[
  {
    "source": "CoinDesk",
    "date": "2024-02-22T16:05:08.000Z",
    "title": "The European Central Bank's Blog Post on Bitcoin ETFs",
    "url": "https://www.coindesk.com/policy/2024/02/22/the-european-central-banks-blog-post-on-bitcoin-etfs/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "\"Bitcoin has failed on the promise to be a global decentralised digital currency and is still hardly used for legitimate transfers. The latest approval of an ETF doesn’t change the fact that Bitcoin is not suitable as means of payment or as an investment,\" two ECB officials wrote in a blog post."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-22T15:50:00.000Z",
    "title": " Binance Labs invests in EigenLayer’s liquid restaking service Renzo ",
    "url": "https://cointelegraph.com/news/binance-labs-invests-eigen-layer-liquid-restaking-renzo",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNjM2NDNiOTUtYjNjYS00ZGU1LTg1ZGUtN2RkOWU2YTZiYzkzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Binance Labs is joining a group of venture firms and crypto ecosystems that invested $3.2 million in the startup seed round in January.</p>\n                    <p><p>Crypto venture capital firm Binance Labs has disclosed an investment in Renzo, the interface to the EigenLayer ecosystem.</p><p>According to an announcement on Feb. 22, Binance Labs is joining a group of venture firms and crypto ecosystems that invested $3.2 million in the startup seed round in January. Binance’s investment in the startup has not been revealed.</p><p>Renzo offers Ethereum smart contracts that facilitate communication between stakers, node operators, and actively validated services (AVSs). In other words, it allows users to restake assets, delegate them to node operators and interact with on-chain service modules, explained the company. </p><p><a href=\"https://cointelegraph.com/news/binance-labs-invests-eigen-layer-liquid-restaking-renzo\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-22T15:52:29.000Z",
    "title": "Galaxy Digital CEO Eyes Institutional Crypto Boom: “They’re Coming for Crypto”",
    "url": "https://www.cryptoglobe.com/latest/2024/02/galaxy-digital-ceo-eyes-institutional-crypto-boom-theyre-coming-for-crypto/",
    "description": "On February 21, in an interview on CNBC’s “Squawk Box,” hosted by Andrew Ross Sorkin, Galaxy Digital CEO Michael Novogratz shared his insights into the current state and future prospects of the crypto market. The discussion covered a range of topics, from Bitcoin’s price movements to institutional interest in cryptocurrencies. Bitcoin’s Price Trajectory and Institutional […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-22T16:00:41.000Z",
    "title": "Superfluid Secures $5.1M to Launch Distribution Pools and Unlock One-to-Many Streams",
    "url": "https://cryptodaily.co.uk/2024/02/superfluid-secures-51m-to-launch-distribution-pools-and-unlock-one-to-many-streams",
    "description": "Superfluid Secures $5.1M to Launch Distribution Pools and Unlock One-to-Many Streams"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-22T15:45:27.000Z",
    "title": "LBank Labs Leads Investment Round in FortyTwo, Pioneering UX Frontend for Interchain DeFi",
    "url": "https://news.bitcoin.com/lbank-labs-leads-investment-round-in-fortytwo-pioneering-ux-frontend-for-interchain-defi/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240222_184941_123-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240222_184941_123-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240222_184941_123-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240222_184941_123-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240222_184941_123-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240222_184941_123-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240222_184941_123-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240222_184941_123.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. LBank Labs, a leading blockchain investment fund of $100M AUM announced today its participation in a strategic funding round for FortyTwo, a revolutionary UX frontend for decentralized finance (DeFi) across the interchain ecosystem. The investment round also saw participation from a distinguished list of funds and angel investors. FortyTwo is actively developing technology [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-22T16:07:10.000Z",
    "title": "Memecoin Price Prediction 2024 – 2033: Is MEME A Wise Investment?",
    "url": "https://www.cryptopolitan.com/memecoin-price-prediction-2023-2040-is-meme-a-wise-investment/",
    "description": "Memecoin MEME Overview Meme coins are a category of cryptocurrencies based on memes and meme culture. They have gained popularity in crypto due to their unique nature and appeal to a younger audience. Memecoin MEME is no exception, with its quirky branding and dedicated community. Dogecoin was the frontier in the meme coin world, and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-22T16:00:44.000Z",
    "title": "Superfluid Secures $5.1M to Launch Distribution Pools and Unlock One-to-Many Streams",
    "url": "https://www.cryptopolitan.com/superfluid-secures-5-1m-to-launch-distribution-pools-and-unlock-one-to-many-streams/",
    "description": "London, United Kingdom, February 22nd, 2024, Chainwire Optimism, Gitcoin and ENS DAO Adopt Token Streaming Protocol For Grant and Hackathon Payments Superfluid, the leading asset streaming protocol that brings subscriptions, salaries and rewards to DAOs and crypto-native businesses, today announced a $5.1M strategic round led by Fabric Ventures with participation from Multicoin Capital, IOSG Ventures, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-22T15:41:32.000Z",
    "title": "UK AI Funding Declines Despite ChatGPT Surge",
    "url": "https://www.cryptopolitan.com/uk-ai-funding-declines-despite-chatgpt-surge/",
    "description": "Investment in UK-based artificial intelligence (AI) companies experienced a significant decline in 2023, despite the technology&#8217;s widespread popularity. Research conducted by Beauhurst revealed that funding for UK AI firms nearly halved compared to the previous year. In 2023, 291 UK AI companies secured £1.4 billion across 311 funding rounds, a sharp decrease from the £2.9 [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-22T16:00:01.000Z",
    "title": "Bitcoin Long-Term Call: Analyst Predicts Price To Soar To $500,000",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-long-term-call-analyst-predicts-price-to-soar-to-500000/",
    "description": "As Bitcoin makes its way through the erratic waves of the cryptocurrency market, crypto analysts are still bullish about the asset, predicting BTC to reach unprecedented heights in the long run.  Bitcoin To Reach $500,000 In The Long-Term Bitcoin is currently in the spotlight as crypto expert Michael Van De Poppe has shared a bold prediction regarding BTC&#8217;s future with the community on the social media platform X (formerly Twitter).  Related Reading: Crypto Analyst Says Bitcoin At $100,000 Not Far Off, Here’s When According to Poppe, Bitcoin is presently experiencing an &#8220;overly bullish sentiment&#8221; from market participants within the cryptocurrency space. Due to this, he claims that there is &#8220;a likelihood&#8221; for the crypto asset to reach $500,000 in the long term. Poppe also warned investors about upcoming severe corrections prior to the surge. However, he has urged them to take the dip as a &#8220;giant buying opportunity&#8221; to position themselves for future gains. The post read: The overly bullish sentiment is great for Bitcoin. Long-term, the likelihood of Bitcoin reaching $500,000 is definitely there. However, corrections will happen and they will be rough. If Bitcoin corrects by 20% or more, use those as a giant buying opportunity. That&#8217;s it. The analyst&#8217;s prediction has sent quite a frenzy in the crypto community, with several enthusiasts expressing their belief in the forecast. A pseudonymous X user stated that he agrees with the projections while noting that &#8220;BTC has the potential to grow in the long-term.&#8221; Poppe has also shed light on his &#8220;game plan&#8221; for the upcoming period for the digital asset. He pointed out two distinct aspects of the plan in light of Bitcoin&#8217;s corrections. &#8220;Survive a potential Bitcoin correction, as Bitcoin is at the end of this run and probably consolidating,&#8221; he stated. In addition, he has encouraged investors to navigate their investment toward Ethereum during the time of the retracement. He added that investors should hold their ETH for about &#8220;1 to 2 months and wait in cash until the correction is over.&#8221;  BTC Is The Ultimate Safe Haven Michael Van De Poppe is not the only analyst who believes Bitcoin has the potential to achieve the $500,000 mark. Max Keiser, a financial journalist, has also predicted that BTC will reach the aforementioned price target. Related Reading: Billionaire Tim Draper Bullish On Bitcoin As It Will Surpass Traditional Currencies, Here’s Why Keiser appears to be anticipating a significant crash in the stock market drawing a similar scenario to the 1987 crash. Consequently, he believes Bitcoin to be a safe haven during this period, as he expects the token to &#8220;soar past $500,000.&#8221; The expert also noted that BTC ETFs and domestic miners will be confiscated by the US government within this period. However, despite this action, Keiser reckoned that BTC would still see more inflows than Gold in the market. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-22T16:00:00.000Z",
    "title": "Ethereum Layer 2 Tokens Poised for Pump? Here Are the Targets",
    "url": "https://coinedition.com/ethereum-layer-2-tokens-poised-for-pump-here-are-the-targets/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum Layer 2 Tokens Poised for Pump? Here Are the Targets\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire.png 730w, https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire-300x169.png 300w, https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire-380x214.png 380w, https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire-696x392.png 696w, https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire-159x89.png 159w, https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire-255x143.png 255w, https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire-313x175.png 313w, https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire-440x247.png 440w, https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire-414x233.png 414w, https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire-293x165.png 293w, https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire-375x211.png 375w, https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire-328x185.png 328w, https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire-144x81.png 144w, https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire-123x70.png 123w, https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire-129x73.png 129w, https://coinedition.com/wp-content/uploads/2024/01/5-Altcoins-on-Fire-355x200.png 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>IMX might retrace to $3.40, while OP could extend its gains toward $5. Buying pressure might validate ARB’s move to $3, and MNT could hit $0.81. MATIC bulls might push for a 43% increase, which could send the price to $2. The optimism about a potential Ethereum (ETH) ETF approval has fueled speculation that Layer [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ethereum-layer-2-tokens-poised-for-pump-here-are-the-targets/\">Ethereum Layer 2 Tokens Poised for Pump? Here Are the Targets</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]