[
  {
    "source": "NewsBTC",
    "date": "2023-11-03T22:00:21.000Z",
    "title": "US Authorities Confiscate $54 Million In Ethereum From Convicted Drug Dealer",
    "url": "https://www.newsbtc.com/ethereum-news/us-authorities-confiscate-54-million-in-ethereum-from-convicted-drug-dealer/",
    "description": "In recent developments, US authorities led by US Attorney Philip R. Sellinger successfully seized $54 million worth of Ethereum (ETH) from Christopher Castelluzzo, a convicted drug dealer operating in Lake Hopatcong, New Jersey.  Related Reading: Cardano Summit 2023: Charles Hoskinson Takes The Stage, Day 1 Recap Massive Crypto Bust The US Attorney&#8217;s Office filed a civil forfeiture action to recover previously seized cryptocurrency that was determined to be the proceeds of an illegal narcotics distribution scheme operating in and around New Jersey.  US Attorney Philip R. Sellinger emphasized law enforcement&#8217;s &#8220;commitment&#8221; to seizing financial gains from criminal activity, regardless of the form they take. Sellinger further stated: The civil action we are taking today seeks to recover millions of dollars of cryptocurrency, which the defendant allegedly obtained from drug sales. Whether it’s as simple as bags of cash or as sophisticated as cryptocurrency, we will take the steps necessary to seize financial gains defendants obtain from criminal activity.  According to the US Department of Justice&#8217;s (DOJ) press release on the case, the prosecution sheds light on using cryptocurrencies such as Bitcoin (BTC) and Ethereum by criminals on the darknet to evade detection. In addition, James E. Dennehy, Special Agent in Charge of the Federal Bureau of Investigation (FBI) in Newark, stated that the FBI played a critical role in uncovering the illegal conduct and ill-gotten proceeds. Drug Trafficker&#8217;s Ethereum Stash Seized According to court documents and the investigations conducted, Christopher Castelluzzo and his associates conspired to sell narcotics between 2010 and 2015.  In 2013, they allegedly began trading drugs on darknet platforms in exchange for Bitcoin. Castelluzzo, using proceeds from narcotics sales, participated in Ethereum&#8217;s Initial Coin Offering (ICO) in July 2014, acquiring 30,000 Ethereum. Additionally, Castelluzzo received 30,000 ETH Classic in 2016. Castelluzzo&#8217;s plan to move the funds to a tax haven in Ireland, Malta, or the Bahamas, or potentially keep them in USDT (Tether), was revealed in forfeiture documents.  However, a subsequent search warrant led to the raid of Brian Krewson&#8217;s residence, an associate of Castelluzzo. Police discovered the relevant crypto wallets under Krewson&#8217;s control, and after obtaining the necessary passwords, law enforcement executed the seizure of the Ethereum, valued at $31 million at the time. Related Reading: Can Dogecoin Rally 135%? Here’s What Needs To Happen Currently serving concurrent 20-year federal and state prison sentences for drug distribution convictions, Castelluzzo attempted to evade taxes and transfer the 30,000 Ethereum out of the United States while incarcerated.  However, Castelluzzo’s plans were intercepted when recorded prison telephone calls exposed his efforts to launder the cryptocurrency. As a result, the United States intervened and seized Castelluzzo&#8217;s cryptocurrency holdings linked to his drug trafficking crimes. The current value of the 30,000 Ethereum stands at approximately $54 million, underscoring the significant impact of the seizure.  As of the time of writing, ETH is trading at $1,815, reflecting a 0.9% increase over the past 24 hours and a steady upward trend of over 2% in the past seven days, exhibiting strong bullish momentum in the market. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-03T21:44:00.000Z",
    "title": "Bitcoin is “Exponential Gold,” Says Fidelity Investments Director",
    "url": "https://coinedition.com/bitcoin-is-exponential-gold-says-fidelity-investments-director/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin is Exponential Gold\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/BlackRock-Hits-600k-for-Bitcoin-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Jurrien Timmer, director of Global Macro at financial services company Fidelity Investments, in a recent post, hailed Bitcoin as “exponential gold,” alluding to the digital asset’s potential to add significant value over time.&#160; Indeed, the executive tweeted that “Bitcoin’s scarcity and adoption curve creates the potential for it to be a high-powered hedge against monetary [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bitcoin-is-exponential-gold-says-fidelity-investments-director/\">Bitcoin is “Exponential Gold,” Says Fidelity Investments Director</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-03T22:01:09.000Z",
    "title": "Solana’s Rally Continues As SOL Overtakes Polygon (MATIC) in Daily Decentralized Exchange Volume",
    "url": "https://dailyhodl.com/2023/11/03/solanas-rally-continues-as-sol-overtakes-polygon-matic-in-daily-decentralized-exchange-volume/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/sol-matic-altcoins.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/sol-matic-altcoins.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/sol-matic-altcoins.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/sol-matic-altcoins.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/sol-matic-altcoins.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/sol-matic-altcoins.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/sol-matic-altcoins.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ethereum (ETH) competitor Solana (SOL) is sustaining its upward momentum as it overtakes layer-2 scaling solution Polygon (MATIC) in daily decentralized exchange (DEX) volume. New data from blockchain tracking platform Artemis reveals that the smart contract platform has surpassed MATIC in both overall DEX volume and the number of daily transactions. Artemis’ data shows that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/03/solanas-rally-continues-as-sol-overtakes-polygon-matic-in-daily-decentralized-exchange-volume/\">Solana’s Rally Continues As SOL Overtakes Polygon (MATIC) in Daily Decentralized Exchange Volume</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]