[
  {
    "source": "Cointelegraph",
    "date": "2023-07-19T15:00:00.000Z",
    "title": "SEC vs. Ripple — Huge win for crypto",
    "url": "https://cointelegraph.com/news/sec-vs-ripple-huge-win-for-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/c724e4d3-7aff-4ead-a855-29d7ba10f92b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>On this week’s episode of The Market Report, Cointelegraph’s resident expert discusses Ripple’s latest win against the SEC and what it means for the crypto market.</p>\n                    <p><p>In the latest episode of <em>The Market Report</em>, Cointelegraph analyst and writer Marcel Pechman discusses Ripple’s partial victory against the SEC and its impact on the crypto market. Although people traded based on emotion after headlines popped out, the next day, as investors could process what happened, the altcoins gave away half of the gains.</p><p>On July 13, the United States District Court for the Southern District of New York ruled that Ripple’s XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) token is not a security — but only for programmatic sales on digital asset exchanges. The question of sales to institutional investors remains an open case.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/a8jcOLHxc4w\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Moreover, according to a former chair of the Commodity Futures Trading Commission, Timothy Massad, the SEC could appeal the judge’s decision. Therefore, this initial win for Ripple could still be overturned.</p><p>According to Pechman, the XRP decision was a non-event in price terms. The spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund impact is likely the main trigger for the next 18 months, even though initially, altcoins tend to underperform relative to BTC.</p><p>Lastly, Pechman analyzes how macroeconomics and regulatory concerns might drive Bitcoin’s price to $29,000 — starting with the Bitcoin futures premium stagnating around a neutral 7% level for the past week. Next, the show covers the Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) premium in China, which reached its lowest level in over six months, indicating excessive demand to exit crypto markets. </p><p>Moving to fundamental analysis, Pechman highlights U.S. Securities and Exchange Commission’s ongoing cases against crypto exchanges Binance and Coinbase, and how the macroeconomic environment worsened after China’s weaker-than-expected gross domestic product growth. He also discusses the odds of the U.S. Federal Reserve further increasing interest rates in 2023.</p><p>Get all this and more in the latest episode of <em>The Market Report</em> exclusively on the new <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research</a> YouTube channel.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-19T14:59:28.000Z",
    "title": "$ADA: Cardano DeFi Masterclass Course Unveiled by EMURGO Academy",
    "url": "https://www.cryptoglobe.com/latest/2023/07/ada-cardano-defi-masterclass-course-unveiled-by-emurgo-academy/",
    "description": "EMURGO Academy, an educational division of the global blockchain technology firm EMURGO (which is the commercial arm of Cardano), has unveiled its latest offering: a DeFi Masterclass. This course is the result of a collaborative effort with the Cardano DeFi Alliance (CDA). Established in January 2019, EMURGO Academy is a global educational initiative dedicated to […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T15:03:56.000Z",
    "title": "Bitcoin ETF wave incoming: SEC decision to shake markets",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-wave-incoming-shake-markets/",
    "description": "The cryptocurrency market stands on the precipice of a substantial disruption as the Securities and Exchange Commission (SEC) positions itself to deliver rulings on multiple Bitcoin ETF applications, setting in motion a potential metamorphosis in the trading sphere. This revelation comes as a number of financial heavyweights, including BlackRock, Fidelity, Wisdomtree, VanEck, and Invesco, reach ... <a title=\"Bitcoin ETF wave incoming: SEC decision to shake markets\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-etf-wave-incoming-shake-markets/\" aria-label=\"More on Bitcoin ETF wave incoming: SEC decision to shake markets\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T14:55:45.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T14:53:19.000Z",
    "title": "Golden Cask Club (GCC) is Clearly a Superior Choice in 2023: Rare Spirits Investment Set to Crush TRON (TRX) And Aptos (APT) Performance",
    "url": "https://www.cryptopolitan.com/golden-cask-club-gcc-is-clearly-a-superior-choice-in-2023-rare-spirits-investment-set-to-crush-tron-trx-and-aptos-apt-performance/",
    "description": "As alternative investments continue to surge, Golden Cask Club (GCC) opens doors for everyone to invest in highly exclusive beverage NFTs. Since its launch, Golden Cask Club (GCC) has piqued everyone&#8217;s interest with its fractionalized high-growth spirits while looking to crush TRON (TRX) and Aptos (APT) with its unprecedented gains. This article will delve into ... <a title=\"Golden Cask Club (GCC) is Clearly a Superior Choice in 2023: Rare Spirits Investment Set to Crush TRON (TRX) And Aptos (APT) Performance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/golden-cask-club-gcc-is-clearly-a-superior-choice-in-2023-rare-spirits-investment-set-to-crush-tron-trx-and-aptos-apt-performance/\" aria-label=\"More on Golden Cask Club (GCC) is Clearly a Superior Choice in 2023: Rare Spirits Investment Set to Crush TRON (TRX) And Aptos (APT) Performance\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T14:44:18.000Z",
    "title": "KuCoin Review: Turn-offs and trade-offs",
    "url": "https://www.cryptopolitan.com/kucoin-review-turn-offs-and-trade-offs/",
    "description": "KuCoin&#8217;s interface can turn off new users, but once you get familiar with the platform, you will love the low 0.1% trading fees and the abundance of trading tools available. We&#8217;ve also suggested that KuCoin inform its customers that a wallet upgrade about a coin is planned. Well, if you haven&#8217;t joined KuCoin, you would ... <a title=\"KuCoin Review: Turn-offs and trade-offs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kucoin-review-turn-offs-and-trade-offs/\" aria-label=\"More on KuCoin Review: Turn-offs and trade-offs\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T14:40:36.000Z",
    "title": "How much will Microsoft’s generative AI cost you?",
    "url": "https://www.cryptopolitan.com/how-much-will-microsofts-generative-ai-cost/",
    "description": "Signaling a pioneering stride in the domain of generative artificial intelligence, Microsoft has unveiled its plan to levy a $30 monthly fee for its new AI features in its widely accepted productivity software. This move is slated to create a significant revenue uptick, albeit at a steeper cost than anticipated, leaving industry experts and users ... <a title=\"How much will Microsoft&#8217;s generative AI cost you?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-much-will-microsofts-generative-ai-cost/\" aria-label=\"More on How much will Microsoft&#8217;s generative AI cost you?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-19T14:54:40.000Z",
    "title": "Ubisoft to run a Cronos blockchain validator node",
    "url": "https://crypto.news/ubisoft-to-run-a-cronos-blockchain-validator-node/",
    "description": "Ubisoft, a video game creator and publisher, is growing its footprint in the non-fungible token (NFT) gaming industry after partnering with Cronos"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T15:00:41.000Z",
    "title": "Bitcoin Has Broken This Open Interest Pattern, Quant Explains",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-broken-open-interest-pattern-quant-explains/",
    "description": "A quant has explained how a pattern in the Bitcoin open interest that held during the past month now appears to be broken. Bitcoin Open Interest Is Now Moving Against The Price As explained by an analyst in a CryptoQuant post, the BTC price had earlier been rising along with increases in the open interest. The &#8220;open interest&#8221; here refers to an indicator that measures the total amount of Bitcoin futures contracts that are currently open on all derivative exchanges. When the value of this metric goes up, it means that users are opening up more positions on the futures market right now. As leverage generally increases when this happens, the price of the asset may become more volatile following this trend. On the other hand, the value of the indicator decreasing suggests the users are either closing up their contracts of their own volition or are being liquidated by their platforms currently. Such a trend may lead to the cryptocurrency&#8217;s price becoming more stable. Now, here is a chart that shows the trend in the Bitcoin open interest over the past few weeks: Looks like the value of the metric has been going up in recent days &#124; Source: CryptoQuant As displayed in the above graph, the Bitcoin open interest has been steadily rising during the past few days. This suggests that investors have been slowly opening up more contracts on derivative exchanges. Related Reading: Signal With Perfect Track Record Predicts Bitcoin Bull Market Parabola: Analyst During the last month or so, whenever the open interest had risen, the price of the cryptocurrency had also registered an increase. The quant notes that this would imply that the bulls had been dominating the futures market in this period, as the open interest going up alongside the price implies that the increase in contracts had been coming from long contract holders. This pattern had held up until the surge BTC had observed a few days back. This sharp increase in the price had ended up only being temporary, and as the price had plunged down, the longs had seen liquidation. As the longs had previously dominated the Bitcoin market, this decrease in the open interest was quite sharp, as is visible in the chart. The indicator didn&#8217;t take too long to rebound, however, as it initially sharply rose and then fell back to a trend of gradual growth. which has continued until today. Related Reading: Litecoin Whales Deposit Big To Exchanges, Bearish Sign? But as the price has in fact been going down in this same period, it would appear that the increase in the open interest is now being driven by the shorts. This would imply that a shift in the market may have occurred, as the open interest pattern that had previously held up now seems to be invalid. &#8220;Have the bears returned once again? In any case, it is advisable to exercise caution in the current area,&#8221; warns the quant. BTC Price At the time of writing, Bitcoin is trading around $30,000, down 2% in the last week. BTC has been struggling recently &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Blockchain.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-19T14:59:20.000Z",
    "title": "Goldman Sachs: Bitcoin ETF Approval to Bring “Rapid Flood of Capital” to BTC and Mark the Start of a Massive Bull Market, Moving to a New All-Time High",
    "url": "https://www.crypto-news-flash.com/goldman-sachs-bitcoin-etf-approval-to-bring-rapid-flood-of-capital-to-btc-and-mark-the-start-of-a-massive-bull-market-moving-to-a-new-all-time-high/?utm_source=rss&utm_medium=rss&utm_campaign=goldman-sachs-bitcoin-etf-approval-to-bring-rapid-flood-of-capital-to-btc-and-mark-the-start-of-a-massive-bull-market-moving-to-a-new-all-time-high",
    "description": "<img width=\"1000\" height=\"647\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Spot Bitcoin ETF\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF-300x194.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF-768x497.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Raoul Pal is optimistic a spot Bitcoin ETF approval will help usher in massive capital into crypto. While Bitcoin will benefit, altcoins will also not be left behind. Former Goldman Sachs executive Raoul Pal believes that a spot Bitcoin (BTC) Exchange Traded Fund (ETF) would lead to a rapid flood of capital into the digital [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-19T14:59:20.000Z",
    "title": "SHIB is down 90% From All-Time High, More Meme Coin Holders Buying TOADS",
    "url": "https://www.crypto-news-flash.com/shib-is-down-90-from-all-time-high-more-meme-coin-holders-buying-toads/?utm_source=rss&utm_medium=rss&utm_campaign=shib-is-down-90-from-all-time-high-more-meme-coin-holders-buying-toads",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T174611.939.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T174611.939.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T174611.939-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T174611.939-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The meme coin arena acts as an excellent testing ground allowing investors to gauge overall market sentiment. An increased appetite for these explosive ERC20 coins means risk-on. But diving deeper into the genre, fickle investors frequently chop and change their portfolio holdings. Shiba Inu (SHIB) is down 90% from its all-time high, and more meme [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-19T14:44:40.000Z",
    "title": "The Friendliest U.S. States to Use Crypto",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-friendliest-u-s-states-to-use-crypto/",
    "description": "<p>As this decentralized and innovative form of money continues to gain popularity, various states across the United States have either embraced or resisted its adoption. In this article, we will explore which U.S. states have emerged as the friendliest for Bitcoin use, providing an environment conducive to its growth and utilization. 1) Wyoming: Leading the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-friendliest-u-s-states-to-use-crypto/\">The Friendliest U.S. States to Use Crypto</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]