[
  {
    "source": "Cointelegraph",
    "date": "2023-10-11T13:00:00.000Z",
    "title": "Startup demos upcoming decentralized GPU infrastructure network to OpenAI, Uber ",
    "url": "https://cointelegraph.com/news/startup-builds-decentralized-gpu-sourcing-network-for-ai",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/a5b703bf-b0a0-4699-be48-9361f074fd91.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>io.net has built a decentralized physical infrastructure network that will source GPU computing power for AI and machine learning. </p>\n                    <p><p>A project that started out as an institutional-grade quantitative trading system for cryptocurrencies and stocks has transitioned to become a decentralized network sourcing GPU computing power to serve increasing demand for AI and machine learning services.</p><p>Io.net has developed a test network that sources GPU computing power from a variety of data centers, cryptocurrency miners and decentralized storage providers. Aggregating GPU computational power is touted to drastically reduce the cost of renting these sources that are becoming increasingly expensive as AI and machine learning advances.</p><p>Speaking exclusively to Cointelegraph, CEO and co-founder Ahmad Shadid unpacks details of the network that aims to provide a decentralized platform for renting computing power at a fraction of the cost of centralized alternatives that currently exist.</p><p><a href=\"https://cointelegraph.com/news/visa-to-invest-100-million-generative-ai\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/visa-to-invest-100-million-generative-ai/amp\"><strong><em>Related: Future of payments: Visa to invest $100M in generative AI</em></strong></a></p><p>Shadid explains how the project was conceived in late 2022 during a Solana hackathon. Io.net was developing a quantitative trading platform that relied on GPU computing power for its high-frequency operations, but was hamstrung by the exorbitant costs of renting GPU computing capacity.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/942922c6-4ca1-422d-9f3a-b4e6c656b855.png\"><figcaption style=\"text-align: center;\">The io.net platform will allow GPU computing providers to provide resource to clusters for AI and machine learning needs. Source: io.net</figcaption></figure><p>The team unpacks the challenge of renting high-performance GPU hardware in its core <a href=\"https://developers.io.net/docs/how-we-started\" target=\"_blank\" rel=\"noopener nofollow\">documentation</a>, with the price of renting a single NVIDIA A100 averaging around $80 per day per card. Needing more than 50 of these cards to operate 25 days a month would cost more than $100,000.</p><p>A solution was found in the discovery of Ray.io, an open-source library which OpenAI used to distribute ChatGPT training across over 300,000 CPUs and GPUs. The library streamlined the project’s infrastructure, with its backend developed in the short space of two months. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/18J-jIfFKis\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Shadid <a href=\"https://youtu.be/18J-jIfFKis\" target=\"_blank\" rel=\"noopener nofollow\">demoed</a> io.net’s working testnet at the AI-focused Ray Summit in Sept. 2023, highlighting how the project aggregates computing power which is served to GPU consumers as clusters to meet specific AI or machine learning use cases.</p><blockquote>“Not only does this model allow io.net to provision GPU compute up to 90% cheaper than incumbent suppliers, but it allows for virtually unlimited computing power.”</blockquote><p>The decentralized network is set to leverage Solana’s blockchain to deliver SOL and USD Coin (USDC) payments to machine learning engineers and miners that are renting or providing computing power.</p><blockquote>“When ML engineers pay for their clusters, these funds are directed straight to the miners that served in the cluster with their GPUs, with a small network fee being allocated to the io.net protocol.”</blockquote><p>The project’s roadmap is set to include the launch of a dual native token system that will feature $IO and $IOSD. The token model will reward miners for executing machine learning workloads and maintaining network uptime while considering the dollar cost of electricity consumption.</p><blockquote>“The IO coin will be freely traded in the crypto market and is the gate to access the compute power, while the IOSD token will serve as a stable credit token algorithmically pegged to 1 USD.”</blockquote><p>Shadid tells Cointelegraph that io.net fundamentally differs from centralized cloud services like Amazon Web Services (AWS):</p><blockquote>“To use an analogy, they’re United Airlines and we’re Kayak; they own planes whereas we help people book flights.”</blockquote><p>The founder adds that any businesses that require AI computation typically use third-party providers, since they lack the GPUs to handle it all in-house. With demand for GPU’s estimated to increase by ten times every 18 months, Hadid says that these is often insufficient capacity to meet demand, leading to long wait times and high prices.</p><p>This is compounded by what he describes as inefficient utilization of data centers that are not optimized for the type of AI and machine learning work that is rapidly increasing:</p><blockquote>“There are thousands of independent datacenters in the US alone, with an average utilization rate of 12 - 18%. As a result, bottlenecks are being created, which is having the knock-on effect of driving up prices for GPU compute.”</blockquote><p>The upside is that the average cryptocurrency miner stands to gain by renting out their hardware to compete with the likes of AWS. Hadid says that the average miner using a 40GB A100 makes $0.52 a day, while AWS is selling the same card for AI computing for $59.78 a day. </p><blockquote>“Part of the value proposition of io.net is first we allow participants to be exposed to the AI compute market and resell their GPUs and for the ML engineers we are significantly cheaper than AWS.”</blockquote><p>Figures shared with Cointelegraph estimate that miners with GPU resources at their disposal could make 1500% more than they would from mining a variety of cryptocurrencies.</p><p><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Magazine: Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-11T12:49:07.000Z",
    "title": "Bitcoin price holds steady following surprising US PPI uptick, eyes on upcoming CPI data",
    "url": "https://cryptoslate.com/insights/bitcoin-price-wavers-following-surprising-u-s-ppi-uptick-eyes-on-upcoming-cpi-data/",
    "description": "<p>Quick Take Bitcoin is currently treading water around the $27,000 mark, reflecting a modest 1% decrease following the release of a higher-than-anticipated U.S. Producer Price Index (PPI) year-on-year (YOY) result of 2.2%, notably exceeding the consensus prediction of 1.6%. With an imminent Consumer Price Index (CPI) report on the horizon, the digital currency market teeters [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-price-wavers-following-surprising-u-s-ppi-uptick-eyes-on-upcoming-cpi-data/\">Bitcoin price holds steady following surprising US PPI uptick, eyes on upcoming CPI data</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-11T13:03:51.000Z",
    "title": "Immutable And AWS Announce Collaboration To Boost Web3 Gaming",
    "url": "https://cryptodaily.co.uk/2023/10/immutable-and-aws-announce-collaboration-to-boost-web3-gaming",
    "description": "According to the blockchain gaming firm, the partnership would allow it to access a pipeline of game studio deals and support for successful deal closures."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-11T13:00:45.000Z",
    "title": "Slope Wallet hacker bridged funds to TRON, cashed out through OTCs",
    "url": "https://crypto.news/slope-wallet-hacker-bridged-funds-to-tron-cashed-out-through-otcs/",
    "description": "Blockchain sleuth ZachXBT says Slope Wallet founder Leal Cheung created a new project immediately after the hack. Victims of Slope Wallet hack, which suffered a $4 million loss in August 2022, are &#8220;unlikely&#8221; to see anything returned given that the&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-11T12:57:45.000Z",
    "title": "Bitcoin Lightning Network sees 1,200% surge in 2 years",
    "url": "https://crypto.news/bitcoin-lightning-network-sees-1200-surge-in-2-years/",
    "description": "Bitcoin&#8217;s Lightning Network saw a 1,212% increase in transactions since August 2021, reaching 6.6 million in August 2023, as per a new report by River Financial. Bitcoin&#8217;s (BTC) layer-2 scaling solution, the Lightning Network, achieved impressive growth, according to a&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-11T12:52:23.000Z",
    "title": "What we’ve learned from Sam Bankman-Fried’s trial so far",
    "url": "https://crypto.news/sbf-trial-so-far/",
    "description": "The trial of Sam Bankman-Fried, the founder of FTX, has presented a slew of astonishing revelations, ranging from SBF&#8217;s involvement in Washington to the purpose of the FTT token. Bankman-Fried stands accused of embezzling billions from FTX customers and investors,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-11T13:00:43.000Z",
    "title": "Bulls Vs Bears: XRP Price Gears Up For Big Squeeze, Which Side Will Prevail?",
    "url": "https://www.newsbtc.com/analysis/xrp/bulls-vs-bears-xrp-price-gears-up-for-big-squeeze-which-side-will-prevail/",
    "description": "The XRP price has experienced a lot of volatility in the first two weeks of October, in contrast with previous months. This trend will continue as a critical metric hint at a potential “short squeeze,” a price move set to take liquidity from long or short positions. Related Reading: XRP Price Retest: A Prelude To A Stunning Surge To $2, Predicts Expert As of this writing, the XRP price trades at $0.48 with a 2% loss in the last 24 hours. The cryptocurrency recorded a 9% loss in the previous seven days and operated as the worst performer in the top 10 by market cap, closely followed by Solana (SOL). XRP Price Sets Trajectory For Short Squeeze? The crypto market has been experiencing a spike in volatility since October. Following months of sideways movement by Bitcoin and Ethereum, the XRP price broke the trend and ignited new life into the nascent sector. The spike in volatility was recorded when the US Securities and Exchange Commission (SEC) lost its case against payment company Ripple. A US Judge favored the company and deemed the XRP token outside of securities laws in the country. This event propelled XRP to fresh yearly highs, but the cryptocurrency has been losing some steam. Uncertainty in the crypto market remains high, and any individual bull run seems likely to lose power, as demonstrated by XRP’s latest price action. However, the current status quo is fragile, and fresh data indicates an aggressive move is in the making. A pseudonym analyst shared the chart below, showing the spike in the Bitcoin Open Interest. The analyst claims that the metric stands at a critical point that often leads to sudden moves in the price of Bitcoin, XRP, and other cryptocurrencies. In the short term, this spike in volatility could lead the XRP back to critical support levels. However, the most likely scenario is that the Short Squeeze, the sudden spike in volatility, operates as a tool for prominent market participants to take liquidity off both sides, longs and shorts. Crypto Poised For Downside Price Action On higher timeframes, the crypto market and more prominent cryptocurrencies could become an obstacle to any upside on XRP. According to another analyst, the sector is gearing up for a significant move to the downside. The analyst bases this theory on the upcoming Bitcoin Halving. This event has a profound impact on all other cryptocurrencies, and right now, BTC is at a critical point in which historical data points to a deep retrace back to around $20,000. If BTC follows this trajectory, XRP could return to its pre-SEC victory levels. However, this downside price action might provide bulls with the “perfect” opportunity to accumulate before an overall bull run unleashes its force on the nascent sector. Related Reading: Legendary Investor Declares Now Is The Time To Buy Bitcoin: Here’s Why As News reported, historical data also points to a great performance for XRP in the year&#8217;s second half. The cryptocurrency enjoys a 30% return on investment (ROI) during this period. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-11T13:07:38.000Z",
    "title": "As Bitcoin Surges, Bitcoin Spark Is Poised To Revolutionize The Bitcoin Fork World",
    "url": "https://www.crypto-news-flash.com/as-bitcoin-surges-bitcoin-spark-is-poised-to-revolutionize-the-bitcoin-fork-world/?utm_source=rss&utm_medium=rss&utm_campaign=as-bitcoin-surges-bitcoin-spark-is-poised-to-revolutionize-the-bitcoin-fork-world",
    "description": "<img width=\"512\" height=\"384\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-41.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-41.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-41-300x225.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As Bitcoin continues to capture investor attention worldwide, the rise of Bitcoin Spark introduces an innovative narrative of evolution and potential. BTCS deploys distinct promising features likely to shape the dynamic and ever-expanding crypto landscape. It positions itself at the forefront of the blockchain revolution, promising unique and transformative advancements to become the best-performing Bitcoin [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-11T12:53:00.000Z",
    "title": "Who Is Trading FTT? Kaiko Says Token Peaked Over $400M Trade in 2023",
    "url": "https://coinedition.com/who-is-trading-ftt-kaiko-says-token-peaked-over-400m-trade-in-2023/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Developer-Report-Live-Data-Announcement.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Developer-Report-Live-Data-Announcement.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Developer-Report-Live-Data-Announcement-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Developer-Report-Live-Data-Announcement-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Developer-Report-Live-Data-Announcement-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Developer-Report-Live-Data-Announcement-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Developer-Report-Live-Data-Announcement-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cryptocurrency market data platform Kaiko today raised suspicions around FTT, the native cryptocurrency token of troubled crypto trading platform FTX. In the tweet on X &#8211; formerly Twitter, the platform noted that despite the FTX collapse, FTT continued to record high trading volume. Kaiko noted that the weekly volume of the token has, at times, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/who-is-trading-ftt-kaiko-says-token-peaked-over-400m-trade-in-2023/\">Who Is Trading FTT? Kaiko Says Token Peaked Over $400M Trade in 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]