[
  {
    "source": "Cointelegraph",
    "date": "2023-08-07T04:56:50.000Z",
    "title": "Weekend Wrap: Celsius’ Mashinsky fraud suit is on, Tether class suit dismissed and more",
    "url": "https://cointelegraph.com/news/celsius-mashinsky-motion-denied-tether-lawsuit-dismissed-this-weekend-in-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/945fed74-61e9-49bd-b878-a008296de9be.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The former Celsius CEO has been denied a lawsuit dismissal, Tether celebrates a minor court victory and China vows to crack down on telecoms fraud using crypto and AI.  </p>\n                    <p><h3>Celsius' Mashinsky motion to dismiss denied</h3><p>The former chief executive of crypto lending platform Celsius Network, Alex Mashinsky is back on track to face a civil fraud lawsuit after a Supreme Court judge denied his motion to dismiss the case.</p><p>A court order <a href=\"https://iapps.courts.state.ny.us/nyscef/ViewDocument?docIndex=0oLDKVak2XmmPZ0SwrCo7g==\" target=\"_blank\" rel=\"noopener nofollow\">issued</a> on Aug. 4 by New York County Supreme Court Justice Margaret Chan denied Mashinsky’s motion to dismiss the suit originally brought by New York Attorney General, Letitia James in January. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/13e9cc98-69b1-4779-b439-a1dd7254bb8d.jpg\"  /><figcaption style=\"text-align: center;\">Screenshot from denial filing. New York v. Mashinsky, New York State Supreme Court. No. 450040/2023. Source: courts.state.ny.us</figcaption></figure><p>Celsius filed for Chapter 11 bankruptcy on July 14, 2022, and Mashinsky resigned as CEO in September of that year. </p><p>Mashinsky's response argued the complaint failed to state a \"legally-cognizable\" claim against Mashinsky and is otherwise deficient, <a href=\"https://cointelegraph.com/news/mashinsky-files-motion-to-dismiss-ny-ag-suits-says-it-parrots-misinformation\">among other arguments</a>. </p><p>However, Judge Chan argued there were sufficient allegations to support a plausible inference that Mashinsky's misstatements induced new investors to deposit in Celsius' earn accounts. </p><p>The judge has denied the motion to dismiss and has also ordered Mashinsky to file an answer to the complaint within 30 days of the order. </p><p>The CFTC and SEC <a href=\"https://cointelegraph.com/news/celsius-alex-mashinsky-us-sec-files-lawsuit-against-celsius-and-alex-mashinsky-report\">issued</a> their own <a href=\"https://cointelegraph.com/news/everything-that-s-happened-with-celsius-and-alex-mashinsky-so-far\">civil cases</a> against Mashinsky in July amid the former CEO’s criminal charges. Moreover, the Federal Trade Commission (FTC) issued $4.7 billion in fines to Celsius for allegedly “squandering billions in user deposits” after “duping” users.</p><h3>Judge dismisses Tether class action suit</h3><p>Stablecoin issuer Tether has lauded a legal victory after a U.S. District Court dismissed a class action lawsuit regarding its reserves on Aug. 4. </p><p>Judge Laura Taylor Swain of the U.S. District Court for the Southern District Of New York issued an order dismissing the class action lawsuit filed by Matthew Anderson and Shawn Dolifka in 2021.</p><p>The complaint claimed that the defendants did not maintain the same amount of reserves as Tether tokens in circulation. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It&#39;s a good Friday.<a href=\"https://twitter.com/hashtag/Tether?src=hash&amp;ref_src=twsrc%5Etfw\">#Tether</a> and <a href=\"https://twitter.com/bitfinex?ref_src=twsrc%5Etfw\">@Bitfinex</a> Win Comprehensive Legal Victory as U.S. District Court Dismisses Class Action Lawsuit<br><br>The Court correctly held that plaintiffs’ complaint lacked any “plausible allegations of injury” because it includes no facts showing that “USDT had a…</p>&mdash; Paolo Ardoino  (@paoloardoino) <a href=\"https://twitter.com/paoloardoino/status/1687566761997090816?ref_src=twsrc%5Etfw\">August 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Reporting on the result, Tether <a href=\"https://tether.to/en/tether-and-bitfinex-win-comprehensive-legal-victory-as-us-district-court-dismisses-class-action-lawsuit/\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> “The dismissal of the entire class action at this very early stage of the proceedings underscores the fact that the plaintiffs’ claims lacked any legal merit.”</p><p>Tether CTO Paolo Ardoino called it a “good Friday.”</p><h3>China cracks down on telecom fraud, targeting crypto</h3><p>The Chinese government has reportedly announced plans to crack down on overseas telecom fraud, and has pointed the finger directly at crypto and artificial intelligence. </p><p>On Aug. 6 local media <a href=\"https://www.globaltimes.cn/page/202308/1295747.shtml\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that the Commission for Political and Legal Affairs of the Communist Party of China (CPC) Central Committee has issued the warning. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">crypto and AI fraudsters after China announced aggressive measures to tackle fraud <a href=\"https://t.co/08aqR1HDkn\">pic.twitter.com/08aqR1HDkn</a></p>&mdash; web3 guy (@memefloor) <a href=\"https://twitter.com/memefloor/status/1688344188062932993?ref_src=twsrc%5Etfw\">August 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>It specifically stated that it would be targeting new methods used by cyber criminals including blockchain, metaverse, cryptocurrencies, and <a href=\"https://cointelegraph.com/news/ai-and-dot-com-bubble-share-some-similarities-but-differ-where-it-counts\">artificial intelligence</a>.</p><p>The announcement followed recent reports of Chinese nationals being subjected to telecoms fraud involving “virtual kidnapping.” Scammers have been impersonating public security personnel to dupe victims into divulging personal information which has led to extortion and ransoms.</p><h3>Worldcoin touts user growth</h3><p>Weekly global World ID verifications more than doubled in the seven days following the launch of retina-scanning digital ID platform Worldcoin, according to an Aug. 6 <a href=\"https://worldcoin.org/blog/announcements/launch-week-sets-records-worldcoin-community-world-id-sign-ups\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a> from the firm.</p><p>It added that there was a threefold increase in weekly active World App users and more than ten times the weekly account creations in the seven days following the launch. Worldcoin claims to have over 2 million users. </p><p>“Last week's 2X growth in weekly World ID sign-ups demonstrates a sustained increase in global demand for World ID as a standalone product,” it said. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In the days following the Worldcoin launch, World App downloads hit record highs around the world. <a href=\"https://t.co/K4iV6llPfR\">pic.twitter.com/K4iV6llPfR</a></p>&mdash; Tools For Humanity (@tfh_technology) <a href=\"https://twitter.com/tfh_technology/status/1687224759640035329?ref_src=twsrc%5Etfw\">August 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, on Aug. 4 Cointelegraph <a href=\"https://cointelegraph.com/news/worldcoin-orb-had-serious-security-vulnerability-in-operator-onboarding-certik\">reported</a> that Worldcoin’s Orb had serious a security vulnerability in operator onboarding according to CertiK.</p><h3>Also making news</h3><p>The Huobi crypto exchange has been reporting <a href=\"https://cointelegraph.com/news/huobi-tvl-drops-amid-rumors-insolvency-investigations-china\">large outflows</a> over the weekend amid ongoing concerns and rumors regarding its solvency. Additionally, Chinese authorities have been reportedly investigating its executives. </p><p>On Aug. 5 Elon Musk <a href=\"https://cointelegraph.com/news/elon-musk-debunks-scam-token-claims-assures-no-crypto-plans-for-x\">quashed rumors</a> of a token launch for his recently rebranded micro-blogging platform X (formerly known as Twitter). The tech entrepreneur said there will “never” be a token launch despite unrelated altcoins being pumped and dumped by degens. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/girl-gone-crypto-thinks-breaking-crypto-news-tweets-are-boring-hall-of-flame/\"><strong><em>Girl Gone Crypto thinks ‘BREAKING’ crypto news tweets are boring: Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]