[
  {
    "source": "Decrypt",
    "date": "2023-11-23T01:11:18.000Z",
    "title": "Indian AI Video Startup Rephrase.ai Announces Acquisition by Adobe",
    "url": "https://decrypt.co/207178/rephrase-ai-generative-video-startup-adobe-acquisition",
    "description": "Aimed somewhere between Photoshop and Premiere Pro, the tool lets users create videos from scratch with just a prompt."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-23T01:25:20.000Z",
    "title": "Director YOLO'd $4M of Netflix budget into Dogecoin, made $27M: Report",
    "url": "http://cointelegraph.com/news/netflix-director-bet-show-budget-on-doge",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e46826a6-919c-4ede-8b52-a4a1d083af1c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Carl Erik Rinsch reportedly used nearly $11 million of his Netflix show’s budget to gamble with stocks and crypto and made millions on a single Dogecoin bet.</p>\n                    <p><p>The director of Netflix’s sci-fi series <em>Conquest</em> reportedly used $4 million from the show’s budget to bet on Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) and made $27 million in the process.</p><p>Now the director, Carl Erik Rinsch, wants another $14 million from Netflix, according to a Nov. 22 <a href=\"https://www.nytimes.com/2023/11/22/business/carl-rinsch-netflix-conquest.html\" target=\"_blank\" rel=\"noopener nofollow\">report</a> in The New York Times citing a confidential arbitration proceeding.</p><p>The Times report details the behind-the-scenes drama of Rinsch’s sci-fi Netflix series <em>Conquest</em>, which the streaming giant doled out $55 million to make, but is yet to receive an episode.</p><p>In March 2020, 16 months after Netflix bought Rinsch’s idea and provided him with an initial budget of $44 million, the director asked for more funds. Netflix obliged and wired him $11 million on the condition he finished the show.</p><p>According to financial statements obtained by the Times Rinsch used $10.5 million from the fresh funding to gamble on the stock market and allegedly lost nearly $6 million in just a few weeks by placing options bets on pharmaceutical companies and the S&amp;P 500, </p><p>With a little over $4 million left, Rinsch transferred the money to the crypto exchange Kraken and went all in on DOGE. When he liquidated in May 2021, he withdrew around $27 million, per an account statement seen by the Times</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Wild Netflix story.<br><br>In 2018, it bought a sci-fi series from director Carl Rinsch. By 2020, Netflix spent $44m on the show. <br><br>Production was floundering and Rinsch demanded $11m more. He took the funds and quickly lost ~$6m in pharma option YOLOs.<br><br>A bit later, he took $4m and… <a href=\"https://t.co/JnvY09Op9A\">pic.twitter.com/JnvY09Op9A</a></p>&mdash; Trung Phan (@TrungTPhan) <a href=\"https://twitter.com/TrungTPhan/status/1727460440874385881?ref_src=twsrc%5Etfw\">November 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Thank you and god bless crypto,” Rinsch wrote in a chat with a Kraken representative.</p><p>With the proceeds, Rinsch allegedly spent nearly $9 million on high-end furniture, designer clothing, an over $380,000 luxury watch, five Rolls-Royces and a Ferrari, according to a forensic accountant hired by Rinsch’s ex-wife for divorce proceedings.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-traders-look-at-dogecoin-doge-here-is-why\"><strong><em>Crypto traders are looking at Dogecoin (DOGE) again — Here’s why</em></strong></a></p><p>The Times said Rinsch launched a confidential arbitration proceeding against Netflix, claiming the streaming service breached its contract and owes him $14 million in damages. Netflix denies owing Rinsch anything and hasreferred to his demands as a shakedown.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/37ad717e-6a83-4a18-86f3-de0a18f67bd0.jpg\"  /><figcaption style=\"text-align: center;\"><em>A scene from 47 Ronin, Rinsch's breakout 2013 film starring Keanu Reeves. Source: Universal Pictures</em></figcaption></figure><p>In a deposition, Rinsch said the items in his almost $9 million spending spree were props for <em>Conquest</em>. He later argued in his case against Netflix that the money was actually his and he’s owed another $14 million.</p><p>A ruling on the case is expected soon as it was heard before an arbitrator earlier in November.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/\"><strong><em>Cryptocurrency trading addiction — What to look out for and how it is treated</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  }
]