[
  {
    "source": "Decrypt",
    "date": "2023-10-12T14:23:49.000Z",
    "title": "The Trial of Sam Bankman-Fried: Live Blog, Latest News and Insights",
    "url": "https://decrypt.co/199892/trial-sam-bankman-fried-live-blog-latest-news-insights",
    "description": "FTX founder Sam Bankman-Fried faces seven criminal charges related to the dramatic collapse of his crypto empire. Here's the latest on his trial."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-12T14:22:00.000Z",
    "title": "Why AI Arena is Building on Arbitrum",
    "url": "https://decrypt.co/videos/interviews/Gl80TQOm/why-ai-arena-is-building-on-arbitrum",
    "description": "AI Arena CEO Brandon Da Silva and COO Wei Xie discuss the challenges that come with building on Ethereum, ETH sidechains, and layer-two blockchains."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-12T14:20:04.000Z",
    "title": "Compute Anything on Bitcoin? What You Need to Know About BitVM",
    "url": "https://decrypt.co/201067/compute-anything-on-bitcoin-what-you-need-to-know-about-bitvm",
    "description": "A new Bitcoin proposal says anything can be computed on the network, but devs are split on whether that's a good idea."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-12T14:31:08.000Z",
    "title": "FTX hacker moves $120M amid Sam Bankman-Fried trial: Report",
    "url": "https://cointelegraph.com/news/stolen-ftx-assets-awaken-nine-months-after-collapse",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/f1aaab85-bfa8-4cba-a406-5e482a5430db.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The blockchain analytics firm Elliptic didn't rule out the possibility of an FTX inside job being behind the $477 million hack. </p>\n                    <p><p>Anonymous hackers of the now-defunct exchange FTX have been moving large amounts of assets stolen from the platform, with new transactions occurring just as the <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">ongoing trial of FTX founder Sam Bankman-Fried</a> gets underway.</p><p>As much as 72,500 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) of stolen assets from FTX has awakened for the first time since the <a href=\"https://cointelegraph.com/news/ftx-hacker-dumps-50-000-eth-still-among-top-40-ether-holders\">exchange was hacked in November 2022</a>, the blockchain analytics firm Elliptic <a href=\"https://www.elliptic.co/blog/the-477-million-ftx-hack-following-the-blockchain-trail\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on Oct. 12.</p><p>According to Elliptic, the thief has converted $120 million worth of ETH into Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) through the multi-chain decentralized exchange (DEX) THORSwap since Sept. 30, 2023.</p><p>The first converting transactions were made just a few days before Bankman-Fried’s trial started on Oct. 3. At the time of the hack, the converted amount was worth $87 million, or 18% of the total stolen funds of $477 million.</p><p>The FTX hacker applied a similar laundering technique to the one deployed soon they stole the funds when the thief transferred 65,000 ETH ($100,000) to BTC using the cross-chain bridge RenBridge in November last year.</p><p>“The 180,000 ETH that was not converted to Bitcoin through RenBridge remained dormant until the early hours of Sep. 30, 2023 — by which time it was worth $300 million,” Elliptic wrote in the new report.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/eec2e11e-7e17-4432-a76b-a114dcf3bb23.png\"  /><figcaption style=\"text-align: center;\"><em>Daily number of transactions involving FTX stolen assets. Source: Elliptic</em></figcaption></figure><p>Elliptic mentioned that the FTX hacker lost $94 million in the days following the hack as the attacker rushed to launder the funds through decentralized exchanges, cross-chain bridges and mixers.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ftx-hacker-sam-bankman-fried-trial-obscure-funds-transfer-certik\"><strong><em>FTX hacker could be using SBF trial as a smokescreen: CertiK</em></strong></a></p><p>Almost a year after the hack, the identity of the FTX thief is still unknown, Elliptic noted. The blockchain analytics firm suggested three potential possibilities for who could be behind the FTX theft, including an FTX inside job, North Korea’s Lazarus Group and Russia-linked criminal groups.</p><p>“Some FTX employees would have had access to the business’s crypto assets in order to move them for operational reasons. In the chaos surrounding the company’s bankruptcy and collapse, it may have been possible for an internal actor to take these assets,” the Elliptic’s report reads.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-12T14:11:36.000Z",
    "title": "Stocks across Asia and Europe rise on Economic growth indicators",
    "url": "https://cointelegraph.com/news/stocks-across-asia-and-europe-rise-on-economic-growth-indicators",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/4913dcf8-8f10-41d3-98da-e2702395786f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Stocks across the Asia Pacific region marked a second consecutive day of bullish growth as the European stock market reached a three-week high.</p>\n                    <p><p>Stock markets in the Asia-Pacific region and Europe saw gains on Thursday. This uptick was attributed to the United Kingdom’s economic recovery, China’s recent stimulus measures and expectations surrounding the United States Consumer Price Index. </p><p>The Hang Seng Index in Hong Kong led a positive movement in the Asian markets. The Oct. 12 rise came after reports that China’s sovereign wealth fund increased its investment in some of the country’s major banks. </p><p>In Europe, the stock market rally was bolstered by data from the United Kingdom, with reports showing economic growth in August, although some sectors still lagged.</p><h2>China led bullish stock rally in Asia</h2><p>China’s sovereign wealth fund announced an increase in its holdings in the country’s four largest banks on Thursday, Oct. 12. The news helped shares of all three main lenders in the country go up during Shanghai’s trading hours. Bank of China stock increased by 3.2%, the China Construction Bank saw an increase of 2.7%, the Industrial and Commercial Bank of China registered a 2.5% gain, and the Agricultural Bank of China jumped 0.6%.</p><p>China’s stimulus decisions also helped Hong Kong’s Hang Seng Index rise by 1.9% to 18,257 points for the day, marking the sixth consecutive day of gains for the benchmark index — its longest winning streak since November 2021.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/91cd22ce-46ec-4722-82ed-fa9037f54f53.png\"  /><figcaption style=\"text-align: center;\"><em>Hong Kong Hang Seng Index daily price chart. Source: investing.com</em></figcaption></figure><p>Japan’s Nikkei 225 index recorded another 1.8% gain on Thursday to reach 32,494.66 points, marking its second consecutive day of gains </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/bd900111-f8cb-41f4-93b1-6ea133d0b1cc.png\"  /><figcaption style=\"text-align: center;\"><em>Japan Nikkei 225 index daily price chart. Source: Investing.com</em></figcaption></figure><h2>European stocks three-week high led by London</h2><p>The British economy rose 0.2% in gross domestic product terms in August compared to the previous month, exceeding estimates of less than 0.1%. This GDP growth helped reverse a slide in the economy that began in July with a 0.5% contraction.</p><p>The bullish economic growth for the U.K. helped European stock markets rise to a new three-week-high. The benchmark London stock FTSE 100 Index rose 0.8%, the French CAC 40 was up 0.6% and the pan-European Stoxx 600 traded 0.8% higher on Thursday.</p><p><em>Vintage Markets is dedicated to the in-depth exploration and reporting of traditional financial news, tracing the journey of global markets and economies from the Stone Age to the Stoned Age.</em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-12T14:30:17.000Z",
    "title": "Deciphering the role of UTXOs in Bitcoin consolidation patterns",
    "url": "https://cryptoslate.com/deciphering-the-role-of-utxos-in-bitcoin-consolidation-patterns/",
    "description": "<p>One of the foundational concepts of Bitcoin is the Unspent Transaction Output, or UTXO. Every Bitcoin transaction results in the creation of these UTXOs, which represent a piece of Bitcoin that can be spent in future transactions. When you send or receive Bitcoin, you&#8217;re essentially working with UTXOs: combining them, splitting them, and creating new [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/deciphering-the-role-of-utxos-in-bitcoin-consolidation-patterns/\">Deciphering the role of UTXOs in Bitcoin consolidation patterns</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-12T14:24:44.000Z",
    "title": "Conflux Takes the Lead in Web3 Innovation at China International Industry Fair",
    "url": "https://cryptodaily.co.uk/2023/10/conflux-takes-the-lead-in-web3-innovation-at-china-international-industry-fair",
    "description": "The 23rd China International Industry Fair (CIIF) held at the National Exhibition and Convention Center in Shanghai brought together the world's industrial leaders, showcasing cutting-edge innovations from across the globe."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-12T14:20:48.000Z",
    "title": "The Open Network (TON) to Attempt World Record for the Fastest Blockchain",
    "url": "https://cryptodaily.co.uk/2023/10/the-open-network-ton-to-attempt-world-record-for-the-fastest-blockchain",
    "description": "Today, The Open Network Foundation (TON Foundation) announces their upcoming attempt to officially be named the world’s fastest blockchain."
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-12T14:10:00.000Z",
    "title": "Arca Sends 1.49M ARB to Binance, Losing $465K",
    "url": "https://coinedition.com/arca-sends-1-49m-arb-to-binance-losing-465k/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Trader-Sends-ARB-to-Binance.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Trader Sends ARB to Binance\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Trader-Sends-ARB-to-Binance.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Trader-Sends-ARB-to-Binance-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Trader-Sends-ARB-to-Binance-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Lookonchain, the on-chain tracking platform, revealed in an X (formerly Twitter) post earlier today that the investment firm Arca sent a substantial amount of Arbitrum (ARB) to Binance a few hours ago. According to the post, Arca sent 1.49 million ARB tokens, valued at $1.21 million, to the leading cryptocurrency exchange platform. Notably, Arca selling [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/arca-sends-1-49m-arb-to-binance-losing-465k/\">Arca Sends 1.49M ARB to Binance, Losing $465K</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-12T14:30:46.000Z",
    "title": "Risk Appetite for Altcoins Low As Liquidity Dries Up, According to Analytics Firm Glassnode",
    "url": "https://dailyhodl.com/2023/10/12/risk-appetite-for-altcoins-low-as-liquidity-dries-up-according-to-analytics-firm-glassnode/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/Coming-Bitcoin-Plunge-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/Coming-Bitcoin-Plunge-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/Coming-Bitcoin-Plunge-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/Coming-Bitcoin-Plunge-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/Coming-Bitcoin-Plunge-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/Coming-Bitcoin-Plunge-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/Coming-Bitcoin-Plunge-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analytics firm Glassnode says that liquidity is drying up in the altcoin market as an appetite for risk-on assets declines. In a new analysis, the firm says key altcoin metrics are at cycle lows indicating market weakness. Says Glassnode, “Liquidity continues to dry up across the digital assets as network settlement, exchange interaction and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/12/risk-appetite-for-altcoins-low-as-liquidity-dries-up-according-to-analytics-firm-glassnode/\">Risk Appetite for Altcoins Low As Liquidity Dries Up, According to Analytics Firm Glassnode</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]