[
  {
    "source": "CoinDesk",
    "date": "2023-06-02T14:13:56.000Z",
    "title": "Justin Sun: Huobi Could Have Hong Kong License in 6 to 12 Months",
    "url": "https://www.coindesk.com/business/2023/06/02/huobi-could-have-hong-kong-license-in-six-to-twelve-months-justin-sun-on-coindesk-tv/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto exchange Huobi could receive a crypto trading license in Hong Kong as soon as the end of the year, Huobi advisor and Tron founder Justin Sun said on CoinDesk TV on Friday."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-02T14:12:00.000Z",
    "title": "Web3 gaming gets competitive edge as Maniac Panda Games joins Cointelegraph Accelerator",
    "url": "https://cointelegraph.com/news/web3-gaming-gets-competitive-edge-as-maniac-panda-games-joins-cointelegraph-accelerator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/30d9f456c9c44cc1c11fd48fd56297a4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>European game studio Maniac Panda Games aims to onboard mainstream players to Web3 with its flagship MMO title.</p>\n                    <p><p>As the Web3 gaming landscape is getting bigger by the day, mainstream players who enjoy playing popular titles games such as PUBG, Fortnite or Apex Legends are starting to take notice. However, there’s still a <a href=\"https://cointelegraph.com/news/web3-gaming-still-a-long-way-from-mainstream-adoption-survey\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/web3-gaming-still-a-long-way-from-mainstream-adoption-survey/amp\">technical understanding barrier</a> before Web3 gaming can reach a broader audience. Players need gameplay elements that <a href=\"https://cointelegraph.com/news/play-to-earn-falling-out-of-favor-after-massive-shift-in-priority-bga-survey\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/play-to-earn-falling-out-of-favor-after-massive-shift-in-priority-bga-survey/amp\">they are familiar with</a> to warm to blockchain games that usually come with technical lingo like play-to-earn (P2E), nonfungible tokens (NFTs) or crypto wallets.</p><p>The gaming world is no stranger to blockbuster titles that initially started as an adaptation of literary work. From The Witcher series to the first Bioshock (which was inspired by Ayn Rand’s dystopian classic Atlas Shrugged), using books as a reference for worldbuilding is a tried-and-true method for game developers. An upcoming Web3 game applies the same formula by building a virtual world around a fantasy saga to create the familiar feeling of ‘becoming someone else in an alternate world’ for players.</p><p>Inspired by the fantasy Outer Ring saga of novels of the same name written by Daniel Valdés-Araiz, CEO of the company, Outer Ring MMO is set in a lore-rich universe that has five species divided into four different factions, all fighting for control and resources. The game is a online multiplayer role-playing game (MMORPG) with extensive gameplay that ties in multiple components, including PvP, PvE, housing and crafting in a vast, sci-fi-themed metaverse.</p><div class=\"embed-responsive embed-responsive-16by9\"><center><p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/HwPiZRjy-dA\" width=\"560\"></iframe></p></center></div><p>Using 3rd person perspective, players can compete against each other, engage with brands and in-game businesses in real-time, socialize and monetize the time spent in the game. Known for their Valorant performance, major esports club Team Heretics <a href=\"https://outerringmmo.com/team-heretics-joins-outer-rings-metaverse/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">announced</a> that they will take part in the Outer Ring MMO PvP experience.</p><p>A defining characteristic of Web3 gaming is its user-centric economy, where players can own, trade and monetize game-related assets. As blockchain technology enables the creation of economic infrastructure in Web3 games, native tokens or NFTs created on the same network can act both as an in-game item and a crypto asset that can be traded on different marketplaces. Similarly, the player-driven economy found in Outer Ring MMO  enables users to generate in-game assets and items and then convert them to NFTs. Through this process, players can own those objects and generate value by selling them.</p><p><img alt=\"Introducing a Scavengon, one of the 5 playable races in the game. Source: Outer Ring\" src=\"https://s3.cointelegraph.com/storage/uploads/view/6b7cfe3f5366bcc52f93be2b86104ac5.png\" title=\"Introducing a Scavengon, one of the 5 playable races in the game. Source: Outer Ring\"></p><p style=\"text-align: center;\"><em>Introducing a Scavengon, one of the 5 playable races in the game. Source: <a href=\"https://outerringmmo.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Outer Ring</a></em></p><p>In terms of tokenomics, Outer Ring MMO is built as a part of the developers’ Galactic Quadrant (GQ) ecosystem. It would use the same GQ token as the governance currency, while Exocredits (EXO) will act as the in-game currency. Other games to launch within the same ecosystem already available to play in their early stages are the racing game <a href=\"http://racerloop.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">RacerLoop</a>, the trading card game <a href=\"https://undergroundwaifus.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Underground Waifus</a> and the gambling title <a href=\"https://cryptoduels.gq/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">CryptoDuels</a>.</p><p>Developers at Maniac Panda Games, the gaming branch of Nexxyo Labs - a 300-employee Spanish studio regarded as one of the largest Web3-native video game studios in Europe - aim to seamlessly connect Web2 and Web3 gaming. The studio is looking to introduce Web3 gaming to the masses through their flagship AAA-tier game developed by former talent at Rockstar Games (the studio after Grand Theft Auto), Ubisoft and Electronic Arts. Cointelegraph Accelerator selected Maniac Panda Games as a participant of the program with an aim to boost adoption in Web3 gaming space.</p><div class=\"embed-responsive embed-responsive-16by9\"><center><p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/fhfeanI6yQo\" width=\"560\"></iframe></p></center></div><p>Launched in 2023, the <a href=\"https://cointelegraph.com/accelerate/\">Cointelegraph Accelerator</a> program aims to help up-and-coming Web3 ventures reach a broader audience and acts as a catalyst in assisting them in achieving their Web3 potential. By becoming a part of the program, Maniac Panda Games will tap into Cointelegraph’s global audience and its established leadership in the crypto and blockchain media landscape since 2013.</p><p>Aside from Cointelegraph Accelerator, Outer Ring MMO has seen interest from organizations in a wide range of industries, including basketball club Baskonia-Alavés, movie theater chain Kinépolis and decentralized finance app DexTools. All of them have sealed deals to tap into Web3 by the hand of Outer Ring and have their respective functional presence and integrations running within the game to interact with users and players. Following the closed pre-alpha release of Outer Ring MMO, which is slated for June 28, 2023 for PC and Mac operating systems, the team will continue to develop the game’s player-driven economy and expand the overall GQ ecosystem with more strategic partnerships.</p>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-02T14:30:44.000Z",
    "title": "China publishes national blockchain standard",
    "url": "https://cryptoslate.com/china-publishes-national-blockchain-standard/",
    "description": "<p>China&#8217;s Ministry of Industry and Information Technology (MIIT) has published a national standard for blockchain technology to guide the development of the industry in the country, a state-run news channel CGTN reported on June 2. The guideline reportedly standardizes the blockchain system&#8217;s functional architecture and core elements, serving as a reference to better understand and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/china-publishes-national-blockchain-standard/\">China publishes national blockchain standard</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-02T14:21:31.000Z",
    "title": "IOG Continue Blistering Place of Cardano (ADA) Development Work",
    "url": "https://www.cryptoglobe.com/latest/2023/06/iog-continue-blistering-place-of-cardano-ada-development-work/",
    "description": "In the latest development update from IOG, Essential Cardano announced a series of advancements in the Cardano ecosystem. The most notable is the Marlowe smart contracts platform launch on the Cardano mainnet. Marlowe is designed to simplify creating, testing, and deploying secure smart contracts on the Cardano blockchain. It offers a suite of open-source tools […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-02T14:30:28.000Z",
    "title": "Silvergate Bank Faces Regulatory Deadline for Self-Liquidation Plan",
    "url": "https://news.bitcoin.com/silvergate-bank-faces-regulatory-deadline-for-self-liquidation-plan/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/liq-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/liq-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/liq-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/liq-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/liq-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/liq-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/liq-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/liq.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent press release from the U.S. Federal Reserve Board of Governors, it was disclosed that Silvergate Bank has been given a ten-day deadline to submit a plan outlining its self-liquidation procedure and the systematic cessation of operations. This order from the central bank comes in the wake of Silvergate&#8217;s declaration of voluntary liquidation [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T14:38:07.000Z",
    "title": "Hashflow price analysis: Following a reemergence of bullish momentum, the price climbs to $0.459",
    "url": "https://www.cryptopolitan.com/hashflow-price-analysis-2023-06-02/",
    "description": "The most recent Hashflow price analysis indicates a notable bullish recovery with today&#8217;s further elevation. Following the significant correction on May 31, 2023, which triggered a strong downtrend, the price has exhibited a consistent recovery since yesterday. The bulls have efficiently maintained control, leading to regained momentum, resulting in the current price of $0.459. HFT/USD ... <a title=\"Hashflow price analysis: Following a reemergence of bullish momentum, the price climbs to $0.459\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hashflow-price-analysis-2023-06-02/\" aria-label=\"More on Hashflow price analysis: Following a reemergence of bullish momentum, the price climbs to $0.459\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-02T14:30:19.000Z",
    "title": "BitTorrent Bridge Breakthrough: Justin Sun’s TRX To Reach Ethereum Network",
    "url": "https://www.newsbtc.com/news/tron/bittorrent-bridge-breakthrough-justin-suns-trx-to-reach-ethereum-network/",
    "description": "Justin Sun, the founder of the Tron blockchain, has announced that the Tron network&#8217;s native asset, TRX, can now be fully accessed on Ethereum (ETH), the largest altcoin network in the cryptocurrency industry. This has been made possible through the BitTorrent Bridge, which allows for seamless interoperability between the two blockchains.  BitTorrent Bridge Paves The Way To Ethereum Integration Interoperability in the context of blockchain refers to the ability of different blockchains to communicate and exchange information with each other seamlessly. In this case, the BitTorrent Bridge enables Tron&#8217;s native asset, TRX, to be transferred and accessed on the Ethereum network, and vice versa. Related Reading: Litecoin Breaks $95 As Whale Transactions Spike This means that TRX holders can now access the larger Decentralized Finance (DeFi) market and decentralized applications (dapps) available on Ethereum, while Ethereum users can now access TRX and its associated dApps on the Tron network. The BitTorrent Bridge acts as an intermediary between the two blockchains, facilitating the transfer of assets and data in a secure and decentralized manner. The move is a significant development for the Tron ecosystem, which is currently the second-largest DeFi ecosystem with over $5.6 billion in total value locked and more than 2.9 million active users, according to DeFiLlama data. Justin Sun&#8217;s tweet regarding the Ethereum expansion via BitTorrent Bridge has already had a positive impact on TRX&#8217;s price, with the asset jumping by 2% following the announcement. This further demonstrates the potential for Tron to expand its reach and appeal to a wider audience in the cryptocurrency industry. With Tron&#8217;s expansion to Ethereum, the cryptocurrency industry continues to see the growing importance of interoperability between different blockchains. As more projects explore the potential of cross-chain functionality, the industry is likely to see further development and innovation in the coming years. TRON Sets New Daily Transaction Record Despite the challenges faced by the cryptocurrency industry in recent months, TRON has continued to perform strongly, defying expectations and posting impressive growth. According to a Twitter thread by Justin Sun, the network hit a new record high in daily transactions, processing over 10 million transactions in a single day. Furthermore, Sun notes that the robust performance of the TRON network is a result of its quality and efficiency, as well as its ability to continuously improve and deliver concrete results. Looking ahead, TRON has set an ambitious target for the year, aiming to double its transaction volume. Sun emphasizes that this increase is not just a measure of quantity, but also a reflection of the network&#8217;s ability to maintain its strong fundamentals and generate revenue even in a challenging market. Related Reading: Galaxy Digital CEO Mike Novogratz Says This Will Kickstart The Bitcoin Bull Market Moreover, the growth in TRON&#8217;s transaction volume is expected to further bolster protocol revenue and demonstrate the strength of the TRON ecosystem. As the cryptocurrency industry continues to evolve and face new challenges, TRON is positioning itself as a leader in the space by focusing on innovation, efficiency, and delivering results. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-02T14:40:00.000Z",
    "title": "ABBC’s 300 Million Token Burn Skyrockets ABBC Coin Price by 90%",
    "url": "https://coinedition.com/abbcs-300-million-token-burn-skyrockets-abbc-coin-price-by-90/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/ABBC-Coin-Price-Soars-89.78-in-24-Hours-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/ABBC-Coin-Price-Soars-89.78-in-24-Hours-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/ABBC-Coin-Price-Soars-89.78-in-24-Hours-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/ABBC-Coin-Price-Soars-89.78-in-24-Hours-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/ABBC-Coin-Price-Soars-89.78-in-24-Hours-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/ABBC-Coin-Price-Soars-89.78-in-24-Hours-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/ABBC-Coin-Price-Soars-89.78-in-24-Hours.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The ABBC coin’s price increased by 89.78% within the last 24 hours with the ABBC Foundation’s announcement of a Coin-Burn event. As per the company’s press release, the ABBC Foundation has taken the decision to schedule a Coin Burn event, as the ABBC Trade Plan was approaching a milestone of 320 million. As such, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/abbcs-300-million-token-burn-skyrockets-abbc-coin-price-by-90/\">ABBC&#8217;s 300 Million Token Burn Skyrockets ABBC Coin Price by 90%</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-02T14:34:25.000Z",
    "title": "Paysenger Offers The Best Of Web2 And Web3 On Its Social Platform",
    "url": "https://coinedition.com/paysenger-offers-the-best-of-web2-and-web3-on-its-social-platform/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Paysengers-EGO-Token-Emerges-As-A-Trending-Choice-In-2023-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Paysengers-EGO-Token-Emerges-As-A-Trending-Choice-In-2023-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Paysengers-EGO-Token-Emerges-As-A-Trending-Choice-In-2023-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Paysengers-EGO-Token-Emerges-As-A-Trending-Choice-In-2023-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Paysengers-EGO-Token-Emerges-As-A-Trending-Choice-In-2023-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Paysengers-EGO-Token-Emerges-As-A-Trending-Choice-In-2023-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Paysengers-EGO-Token-Emerges-As-A-Trending-Choice-In-2023.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Paysenger has emerged as a popular choice for content creators and influencers due to its exciting platform that lets them collaborate with brands and interact with fans. The platform’s rapid growth has put its native token, EGO, on track to become one of the most attractive investment opportunities in the crypto space. The consistent development [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/paysenger-offers-the-best-of-web2-and-web3-on-its-social-platform/\">Paysenger Offers The Best Of Web2 And Web3 On Its Social Platform</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-02T14:20:00.000Z",
    "title": "Solana Seeks for Market Equilibrium at $16 Before the Big Surge ",
    "url": "https://coinedition.com/solana-seeks-for-market-equilibrium-at-16-before-the-big-surge/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/SOL_Could_Soar_to_New_Yearly_High_if_it_Breaks_Through_26_03-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/SOL_Could_Soar_to_New_Yearly_High_if_it_Breaks_Through_26_03-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/SOL_Could_Soar_to_New_Yearly_High_if_it_Breaks_Through_26_03-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/SOL_Could_Soar_to_New_Yearly_High_if_it_Breaks_Through_26_03-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/SOL_Could_Soar_to_New_Yearly_High_if_it_Breaks_Through_26_03-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/SOL_Could_Soar_to_New_Yearly_High_if_it_Breaks_Through_26_03-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/SOL_Could_Soar_to_New_Yearly_High_if_it_Breaks_Through_26_03.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Solana (SOL) rallied at the beginning of the year in a significant bull run that saw the price reach a yearly high of $27.12. The price has since trended sideways after the initial rally, following a general loss of momentum in the crypto market. SOL traded at $21.25 at the time of writing after bouncing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/solana-seeks-for-market-equilibrium-at-16-before-the-big-surge/\">Solana Seeks for Market Equilibrium at $16 Before the Big Surge </a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-02T14:30:26.000Z",
    "title": "More Than 75% of Shiba Inu and Floki Investors Are Sitting on Losses: Crypto Analytics Firm IntoTheBlock",
    "url": "https://dailyhodl.com/2023/06/02/more-than-75-of-shiba-inu-and-floki-investors-are-sitting-on-losses-crypto-analytics-firm-intotheblock/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/shiba-Sitting-on-Losses.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/shiba-Sitting-on-Losses.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/shiba-Sitting-on-Losses.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/shiba-Sitting-on-Losses.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/shiba-Sitting-on-Losses.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/shiba-Sitting-on-Losses.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/shiba-Sitting-on-Losses.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A leading blockchain analytics firm says that a huge percentage of Shiba Inu (SHIB) and Floki (FLOKI) holders are underwater. According to IntoTheBlock, 81% of SHIB holders are sitting on losses, just 16% are profitable and 3% are breaking even. SHIB is trading for $0.00000851 at time of writing, down 90.1% from its all-time high [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/02/more-than-75-of-shiba-inu-and-floki-investors-are-sitting-on-losses-crypto-analytics-firm-intotheblock/\">More Than 75% of Shiba Inu and Floki Investors Are Sitting on Losses: Crypto Analytics Firm IntoTheBlock</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]