[
  {
    "source": "Cointelegraph",
    "date": "2023-11-24T20:46:31.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "http://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Bitfinex and Tether have decided not to appeal the Freedom of Information Law (FOIL) request lodged by several news publications. Meanwhile, a court in Montenegro has approved the extradition of Terraform Labs co-founder Do Kwon to either South Korea or the United States, and Sam Bankman-Fried is trading Mackerel while jailed (yes, really). </p><h3>Bitfinex, Tether no longer opposed to FOIL request</h3><p>Bitfinex and Tether have agreed <a href=\"https://cointelegraph.com/news/tether-bitfinex-agree-drop-opposition-foil-request\">not to oppose</a> a Freedom of Information Law (FOIL) request initiated in New York by several high-profile news publications who accused the companies of exhibiting \"certain behaviors.\"</p><p>In a statement shared with Cointelegraph, the crypto exchange and stablecoin issuer said they were committed to sharing information in a transparent manner following a FOIL request earlier this year.</p><p>“It’s essential to clarify that transparency does not mean a wholesale release of all our documents,” the said. Both companies called for a \"responsible document review\" before any information is released publicly. </p><p>The FOIL request stems from a February 2021 agreement between Bitfinex and Tether and New York regulators over allegations that the two companies commingled $850 million in client and corporate funds. As part of the agreement, the two companies reportedly paid $18.5 million in fines and agreed to submit quarterly attestation reports. </p><h3>Do Kwon extradition approved by Montenegro court</h3><p>The saga of Terraform Labs co-founder Do Kwon continues to unfold, with a court in Montenegro approving his extradition to either South Korea or the United States.</p><p>The High Court of Podgorica has determined the legal requirements for Kwon’s extradition, according to an official statement posted on the court’s website on Nov. 24.</p><p>As the court approved Kwon’s extradition to either the U.S. or South Korea, the final decision on his extradition will be made by Montenegro’s minister of justice, the announcement notes.</p><p>Previously, a court in Montenegro sentenced Kwon to four months in jail after finding him guilty of using a forged passport to try to flee to Dubai via private jet. In June 2023, Kwon was reportedly charged with attempting to leave the country using a fake Costa Rican passport.</p><p>If the minister of justice allows the final extradition of the defendant, the extradition will occur after the execution of the criminal sanction announced before in the case of forged documents, the court statement notes.</p><h2>Fish for fresh cuts: SBF trades mackerel while jailed </h2><p>Sam Bankman-Fried’s crypto trading days are over, so the convicted founder has <a href=\"https://cointelegraph.com/news/sam-bankman-fried-mackerel-fish-trading\">moved on to trading fish</a> while behind bars.</p><p>The Wall Street Journal reported that Bankman-Fried traded four packets of Mackerel — “macks” in prison terms — for a haircut before his criminal trial last month.</p><p><a href=\"https://cointelegraph.com/news/sam-bankman-fried-jail-meds-peanut-butter-prison\">Bankman-Fried doesn’t eat mackerel</a> as part of his vegan diet — making them an easily traded commodity for the former Jane Street trader.</p><p>Mack packs have been the hottest trading commodity in prisons since the ban on tobacco products. The Metropolitan Detention Center commissary where Bankman-Fried is housed sells mackerel packets for $1.30.</p><p>Controversial tech figure Martin Shkreli, known as “pharma bro,” spent over four years in prison and confirmed macks were a staple currency in jail. </p><p>In a post on X (Twitter), Shkreli said paying four macks for a haircut was a “rip off” but noted it was still less than paying someone a book of stamps. </p><p>Bankman-Fried is sharing a cell at the Brooklyn prison with former Honduran President Juan Hernández and a former senior Mexican police officer, sources familiar with the matter told The WSJ.</p><h3>KyberSwap hacker used “infinite money glitch” to steal funds</h3><p>A decentralized finance expert has weighed in on the recent <a href=\"https://cointelegraph.com/news/kyberswap-dex-exploited-tvl-drops\">$46 million KyberSwap attack</a>. </p><p>Doug Colkitt, founder of the Ambient exchange, took to X (formerly Twitter) to explain how <a href=\"https://cointelegraph.com/news/kyberswap-attacker-used-infinite-money-glitch-drain-funds-defi-expert\">the attacker carried out</a> “the most complex and carefully engineered smart contract exploit I’ve ever seen.” Based on Colkitt’s analysis, the attacker exploited an “infinite money glitch” and took advantage of KyberSwap’s unique liquidity implementation. That’s how they tricked the contract into believing it had more liquidity than it actually had, he said. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ Finished a preliminary deep dive into the Kyber exploit, and think I now have a pretty good understanding of what happened.<br><br>This is easily the most complex and carefully engineered smart contract exploit I&#39;ve ever seen...</p>&mdash; Doug Colkitt (@0xdoug) <a href=\"https://twitter.com/0xdoug/status/1727613541115429314?ref_src=twsrc%5Etfw\">November 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The exploit “is specific to Kyber’s implementation of concentrated liquidity and probably will not work on other DEXs,” Colkitt explained. Based on his analysis, the exploit was carried out in multiple steps, beginning with the attacker borrowing 10,000 Wrapped Ether (wETH) from Aave. </p><p>KyberSwap’s total value locked plunged by 68% shortly after the attack, reaching a low of around $27 million. Its TVL was as high as $134 million earlier in 2023.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T21:05:18.000Z",
    "title": "WEEKLY CRYPTO PRICE ANALYSIS: BTC, ETH, BNB, XRP, SOL, ADA, AND DOGE",
    "url": "https://www.cryptopolitan.com/weekly-crypto-price-analysis-2023-11-24/",
    "description": "In the most recent week, the cryptocurrency market has seen a mix of bullish and bearish trends, with most cryptocurrencies trading in neutral ranges. The weekly crypto price analysis reveals a market has been struggling to find direction, with most of the tokens seeing gains rather than losses. The market has been volatile, and buying ... <a title=\"WEEKLY CRYPTO PRICE ANALYSIS: BTC, ETH, BNB, XRP, SOL, ADA, AND DOGE\" class=\"read-more\" href=\"https://www.cryptopolitan.com/weekly-crypto-price-analysis-2023-11-24/\" aria-label=\"More on WEEKLY CRYPTO PRICE ANALYSIS: BTC, ETH, BNB, XRP, SOL, ADA, AND DOGE\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T20:43:06.000Z",
    "title": "KyberSwap offers 10% bounty to hacker in negotiations",
    "url": "https://www.cryptopolitan.com/kyberswap-offers-10-bounty-to-hacker/",
    "description": "In a dramatic turn of events in the decentralized finance world, KyberSwap, a prominent decentralized exchange, has found itself at the epicenter of a sophisticated heist. On November 22, the platform experienced a massive security breach, resulting in the loss of $46 million. In a bold move, KyberSwap has offered a 10% bounty to the ... <a title=\"KyberSwap offers 10% bounty to hacker in negotiations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kyberswap-offers-10-bounty-to-hacker/\" aria-label=\"More on KyberSwap offers 10% bounty to hacker in negotiations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T20:41:21.000Z",
    "title": "EU AI Act Faces Backlash from Tech Industry Stakeholders",
    "url": "https://www.cryptopolitan.com/eu-ai-act-faces-backlash/",
    "description": "Stakeholders in the tech industry are raising concerns over the potential consequences of the upcoming EU AI Act, warning that it could stifle innovation and drive AI startups out of existence. The proposed regulations categorize AI models based on their risk factors, with startups developing high-risk foundation models facing additional requirements. Tech policy group DigitalEurope ... <a title=\"EU AI Act Faces Backlash from Tech Industry Stakeholders\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eu-ai-act-faces-backlash/\" aria-label=\"More on EU AI Act Faces Backlash from Tech Industry Stakeholders\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-24T21:00:17.000Z",
    "title": "Ethereum Outperforms Bitcoin: Is The Altcoin Season Officially On?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-outperforms-bitcoin-altcoin-season-on/",
    "description": "Ethereum (ETH) continues to absorb Bitcoin (BTC) selling pressure in November, looking at price action when writing on November 24. In the daily chart, ETH bulls have the upper hand, adding roughly 9% versus BTC from October lows.  Ethereum Outperforms Bitcoin In November ETH buyers are firm, with price action still confined inside the conspicuous bullish engulfing bar of November 9. Despite bears forcing prices lower in the second week of November, the failure of BTC bulls to reverse all losses suggests that ETH buyers are still in command. If anything, prices may rise in the days ahead, reversing losses of the better part of 2022 when Bitcoin, buoyed by a crash in the altcoin scene, forced capital to the world&#8217;s most valuable currency.  With Ethereum being resilient, reading from its performance in the ETH/BTC chart, hints suggest that the altcoin season could be in the early stages. Should that be the case, it will be a reprieve for ETH and other altcoins, including Cardano (ADA).  Related Reading: Will Recent Binance Events Trigger This Historical Bitcoin Bull Run Signal? Following the dip in 2022, most altcoins capitulated, with most falling by over 80% from 2021 peaks as the crypto winter progressed, freezing gains. The situation took a turn south in 2023 when regulators continued with their enforcement actions against CeFi facilitators, mostly exchanges like Binance and Coinbase. Their decision negatively impacted liquidity, as evidenced in other trending altcoins like Solana (SOL). ETH remains relatively firm at spot rates versus BTC, extending gains in late November. This could indicate that demand is beginning to pivot toward altcoins, with ETH, the most liquid of them all, leading the way. Since other altcoins have relatively thinner liquidity, they tend to recover faster but generally align with ETH. If the ETH revival is sustained, reading from the candlestick arrangement in the daily chart, the leg up might also be accelerated by several macro tailwinds. BlackRock Applies For Spot Ethereum ETF, Will ETH Reach $26,800? In November, BlackRock, one of the world&#8217;s largest asset managers, filed for a spot Ethereum ETF. It comes when the broader crypto market expects the Securities and Exchange Commission (SEC) to approve the first spot Bitcoin ETF in the country. This application signals that BlackRock is confident about Ethereum&#8217;s investment products.  Related Reading: Market Watch: These 5 Altcoins Are Poised For Breakouts, Says Crypto Expert Additionally, the on-chain analytics platform, Token Terminal, recently issued a bold report forecasting ETH to reach $36,800 by 2030. Token Terminal expects Ethereum to process over $14 trillion of the finance industry&#8217;s value in the next seven years. Ethereum would likely dominate at this pace, driven by sharp growth in decentralized finance (DeFi) and other crypto sub-sectors. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-24T20:54:30.000Z",
    "title": "Cardano Founder Hoskinson Reacts: CZ’s Exit Marks the End of an Era in Crypto",
    "url": "https://www.crypto-news-flash.com/cardano-founder-hoskinson-reacts-czs-exit-marks-the-end-of-an-era-in-crypto/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-founder-hoskinson-reacts-czs-exit-marks-the-end-of-an-era-in-crypto",
    "description": "<img width=\"2048\" height=\"1536\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-768x576.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-1536x1152.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-24x18.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-36x27.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-48x36.jpg 48w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" />Charles Hoskinson, founder of Cardano, comments on the resignation of Binance CEO Changpeng Zhao, marking it as a significant shift in the crypto industry. Hoskinson predicts increased regulatory scrutiny in the crypto sector, impacting exchanges like Binance and wallets like Metamask. Charles Hoskinson, the founder of Cardano, has shared his perspective on the resignation of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-24T20:47:35.000Z",
    "title": "Emerging Cryptocurrency Challenges Solana and Dogecoin with Potential for Remarkable Growth",
    "url": "https://www.crypto-news-flash.com/emerging-cryptocurrency-challenges-solana-and-dogecoin-with-potential-for-remarkable-growth/?utm_source=rss&utm_medium=rss&utm_campaign=emerging-cryptocurrency-challenges-solana-and-dogecoin-with-potential-for-remarkable-growth",
    "description": "<img width=\"512\" height=\"286\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-48-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-48-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-48-1-300x168.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Solana plummets 4% after the SEC calls it a security in a lawsuit against Kraken. Dogecoin gains 5% on news of Astrobotics taking physical Dogecoin to space. Rebel Satoshi takes on leading cryptos after promising 3x presale gains. The bullish momentum in the crypto space has started slowing down. As a result, top crypto coins [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-24T20:46:11.000Z",
    "title": "SEC’s Crypto Mom: “There is no reason for us to stand in the way of BlackRocks’s spot Bitcoin ETF”",
    "url": "https://www.crypto-news-flash.com/secs-crypto-mom-there-is-no-reason-for-us-to-stand-in-the-way-of-blackrockss-spot-bitcoin-etf/?utm_source=rss&utm_medium=rss&utm_campaign=secs-crypto-mom-there-is-no-reason-for-us-to-stand-in-the-way-of-blackrockss-spot-bitcoin-etf",
    "description": "<img width=\"1000\" height=\"666\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BlackRock\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />SEC Commissioner Hester Pierce said there’s no reason to stand in the way of BlackRock Bitcoin ETF pursuit. The statement has reignited hope that approval for the product might be close. In a recent interview with Bloomberg, SEC Commissioner Hester Peirce, dubbed “Crypto Mom” for her pro-crypto and blockchain sector position, said, &#8220;There is no [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-24T20:44:40.000Z",
    "title": "Binance’s $4.3 Billion Settlement Clears Path for Spot Bitcoin ETF Approval",
    "url": "https://www.crypto-news-flash.com/binances-4-3-billion-settlement-clears-path-for-spot-bitcoin-etf-approval/?utm_source=rss&utm_medium=rss&utm_campaign=binances-4-3-billion-settlement-clears-path-for-spot-bitcoin-etf-approval",
    "description": "<img width=\"1000\" height=\"647\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin ETF\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF-300x194.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF-768x497.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Binance&#8217;s $4.3-billion settlement with the U.S. paves the way for potential spot Bitcoin ETF approval by addressing regulatory concerns. The SEC&#8217;s worries about market manipulation have hindered spot Bitcoin ETFs, and Binance&#8217;s market dominance needed to be addressed before approval. Binance has reached a $4.3 billion settlement with the United States government. This settlement is [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-24T21:00:01.000Z",
    "title": "This Ethereum Rival’s Poised To Be the ‘Fastest Horse,’ Will Skyrocket Much Higher: Top Analyst",
    "url": "https://dailyhodl.com/2023/11/24/this-ethereum-rivals-poised-to-be-the-fastest-horse-will-skyrocket-much-higher-top-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Turn-Crypto-Market-Bullish-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Turn-Crypto-Market-Bullish-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Turn-Crypto-Market-Bullish-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Turn-Crypto-Market-Bullish-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Turn-Crypto-Market-Bullish-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Turn-Crypto-Market-Bullish-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Turn-Crypto-Market-Bullish-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Top crypto analyst Bluntz says that the recent correction in Solana (SOL) is over and that rallies are set to continue for the leading Ethereum (ETH) rival. In a new strategy session, the pseudonymous analyst tells his YouTube subscribers that SOL has completed an ABC correction, priming itself for another impulse to the upside. Bluntz [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/24/this-ethereum-rivals-poised-to-be-the-fastest-horse-will-skyrocket-much-higher-top-analyst/\">This Ethereum Rival’s Poised To Be the ‘Fastest Horse,’ Will Skyrocket Much Higher: Top Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-24T20:55:01.000Z",
    "title": "Crypto Trader Says Altcoin Markets Approaching a ‘Historic’ Retest, Deep Dives Into Polkadot (DOT)",
    "url": "https://dailyhodl.com/2023/11/24/crypto-trader-says-altcoin-markets-approaching-a-historic-retest-deep-dives-into-polkadot-dot/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2021/11/altcoin-built-on-polkadot.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" /><p>A widely followed crypto analyst is diving into the altcoin markets and interoperability blockchain Polkadot (DOT) in particular. Pseudonymous crypto trader Rekt Capital tells their 371,000 followers on the social media platform X that the overall market for altcoins is approaching a market cap last touched around August of 2022. &#8220;Historic retest for the Altcoin Market [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/24/crypto-trader-says-altcoin-markets-approaching-a-historic-retest-deep-dives-into-polkadot-dot/\">Crypto Trader Says Altcoin Markets Approaching a ‘Historic’ Retest, Deep Dives Into Polkadot (DOT)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]