[
  {
    "source": "CoinDesk",
    "date": "2023-11-02T12:00:01.000Z",
    "title": "Protocol Village: Toposware, Specialist in Zero-Knowlege Cryptography, Raises $5M ",
    "url": "https://www.coindesk.com/tech/2023/11/01/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Nov. 2-8, with live updates throughout."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-02T11:59:19.000Z",
    "title": "SafeMoon hacker’s use of centralized exchanges could help law enforcement: Match System",
    "url": "http://cointelegraph.com/news/safe-moon-hackers-centralized-exchanges-use-help-law-enforcement-match-system",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/a99325f7-ee5d-465a-836b-9125bca055a4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> SafeMoon was exploited in March earlier this year after a smart contract update led to a burn call vulnerability allowing hackers to transfer funds.</p>\n                    <p><p>SafeMoon, a decentralized finance project <a href=\"https://cointelegraph.com/news/jake-paul-endorsed-safemoon-gets-hacked-after-introducing-a-bug-in-upgrade\">exploited in March</a>, resulting in a net loss of $8.9 million in BNB, has been charged by the United States Securities and Exchange Commission and its key executives for security rules violations and frauds. </p><p>The funds associated with the exploit have been on the move via centralized exchanges and Match System, a blockchain analytic firm, believes these transfers via CEX could become critical for law enforcement agencies.</p><p>Sean Thornton from Match System told Cointelegraph that they suspect centralized exchanges were used as an intermediate link in the money laundering chain.</p><blockquote>“On CEX, funds could be exchanged for other tokens and withdrawn further, and accounts on CEX could be registered for drops (dummy persons). Taking into account the fact that it is almost impossible to trace the movement of funds through CEX without a request from law enforcement agencies, CEX is a more preferable option than DEX for a hacker to gain time and confuse paths,” Thornton explained.</blockquote><p>Match System carried out a post-mortem of the SafeMoon smart contract and the subsequent movement of funds to analyze the behavior of the exploiters. The analysis revealed that the hacker exploited a vulnerability in SafeMoon’s contract associated with the “Bridge Burn” feature, allowing anyone to call the “burn\" function on SFM tokens at any address. These attackers used the vulnerability to transfer other users’ tokens to the developer’s address. </p><p>The transfer made by exploiters resulted in 32 billion SFM tokens being sent from SafeMoon’s LP address to SafeMoon’s deployer address. This led to an instant pump in the value of tokens. The exploiter used the price pump to swap some of the SFM tokens for BNBs at an inflated price. As a result, 27380 BNB were transferred to the hacker’s address.</p><p>Match System, in its analysis, found that the smart contract vulnerability was not present in the previous version and only came in with the new update on March 28, the day of the exploit, leading many to believe the involvement of an insider. These speculations gained more fuel by Nov.1 as the SECf iled charges against SafeMoon project and its three executives, accusing them of committing fraud and violating securities laws. </p><p>Thornton told Cointelegraph that the SEC accusations are not unfounded and they also found evidence that may indicate the involvement of SafeMoon management in the hacking that occurred. He added that whether this was done intentionally or was the criminal negligence of the employees will have to be sorted out by law enforcement agencies.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/new-crypto-litigation-tracker-highlights-300-cases-from-safemoon-to-pepe-the-frog\"><strong><em>New crypto litigation tracker highlights 300 cases from SafeMoon to Pepe the Frog</em></strong></a></p><p>The SEC alleged that the CEO of SafeMoon, John Karony, and the chief technical officer, Thomas Smith, embezzled investor cash and withdrew $200 million in assets from the enterprise. The SafeMoon executives are also facing charges from the Justice Department for conspiring to commit wire fraud, money laundering, and securities fraud.</p><p>The hacker behind the attack initially claimed they had mistakingly exploited the protocol and wanted to set up a communication channel<a href=\"https://cointelegraph.com/news/safemoon-hacker-agrees-to-return-80-of-stolen-funds-says-development-team\"> to return 80% of the funds</a>. Since then, the funds linked to the exploits have moved on several occasions, many times via centralized exchanges like Binance, which the analytic firm believes will be critical for law enforcement agencies to track down the perpetrators of the exploit.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/huawei-nfts-toyotas-hackathon-north-korea-vs-blockchain-asia-express/\"><strong><em>Huawei NFTs, Toyota’s hackathon, North Korea vs. Blockchain: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-02T11:45:19.000Z",
    "title": "Potential Bitcoin bull run predicted by closing gap between realized and long-term holder prices",
    "url": "https://cryptoslate.com/insights/potential-bitcoin-bull-run-predicted-by-closing-gap-between-realized-and-long-term-holder-prices/",
    "description": "<p>Quick Take The Bitcoin market is currently exhibiting signs of a potential bull run, as evidenced by the dynamics of the realized prices among different investor cohorts. The realized price, reflecting the aggregate price at which each Bitcoin was last spent on-chain, currently stands at $20,638. This is only $100 shy of the Long-Term Holder [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/potential-bitcoin-bull-run-predicted-by-closing-gap-between-realized-and-long-term-holder-prices/\">Potential Bitcoin bull run predicted by closing gap between realized and long-term holder prices</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-02T11:49:17.000Z",
    "title": "Fidelity Investments’ Director of Global Macro on Bitcoin: ‘I Think of It As Exponential Gold’",
    "url": "https://www.cryptoglobe.com/latest/2023/11/fidelity-investments-director-of-global-macro-on-bitcoin-i-think-of-it-as-exponential-gold/",
    "description": "Jurrien Timmer, the Director of Global Macro at Fidelity Investments, has shared his insights on Bitcoin’s current market activity, drawing parallels with historical financial patterns. On 1 November 2023, Timmer took to the social media platform X (formerly known as Twitter) to share his perspective on the cryptocurrency’s trajectory, echoing his late 2020 thesis. Timmer […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-02T12:00:11.000Z",
    "title": "Microstrategy Expands Bitcoin Trove, Total Holdings Now Stand at 158,400 BTC",
    "url": "https://news.bitcoin.com/microstrategy-expands-bitcoin-trove-total-holdings-now-stand-at-158400-btc/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/micro-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Microstrategy Expands Bitcoin Trove, Total Holdings Now Stand at 158,400 BTC\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/micro-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/micro-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/micro-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/micro-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/micro-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/micro-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/micro.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Microstrategy reported a 3.3% increase in total revenues to $129.5 million in the third quarter of 2023, even as the company took impairment losses of $33.6 million on its bitcoin holdings, according to the firm&#x2019;s latest financial disclosure. The firm&#x2019;s founder, Michael Saylor, revealed that Microstrategy purchased an additional 155 BTC for $5.3 million in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-02T12:04:53.000Z",
    "title": "SAP Unveils Innovative Generative AI Solutions for Developers at TechEd Event",
    "url": "https://www.cryptopolitan.com/sap-generative-ai-solutions-for-developers/",
    "description": "SAP, a leading enterprise application software giant, has introduced a range of generative AI offerings designed to empower developers. These offerings, including SAP Build Code solutions, the vector engine on SAP HANA Cloud, and a generative AI hub within SAP AI Core, were unveiled at the SAP TechEd event in Bangalore, India. With these innovations, ... <a title=\"SAP Unveils Innovative Generative AI Solutions for Developers at TechEd Event\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sap-generative-ai-solutions-for-developers/\" aria-label=\"More on SAP Unveils Innovative Generative AI Solutions for Developers at TechEd Event\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-02T12:04:34.000Z",
    "title": "Ripple Labs’ Chief Legal Officer Calls Out SEC’s Regulatory Missteps",
    "url": "https://www.cryptopolitan.com/ripple-labs-clo-calls-out-secs-missteps/",
    "description": "Amid regulatory ripples, Ripple Labs&#8217; Chief Legal Officer, Stuart Alderoty, has recently expressed concerns over the U.S. Securities and Exchange Commission&#8217;s (SEC) regulatory conduct. The Fifth Circuit Court of Appeals echoed these concerns, ruling against the SEC for not adhering to the Administrative Procedure Act during its enforcement actions. Significantly, the appellate court&#8217;s decision on ... <a title=\"Ripple Labs&#8217; Chief Legal Officer Calls Out SEC&#8217;s Regulatory Missteps\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-labs-clo-calls-out-secs-missteps/\" aria-label=\"More on Ripple Labs&#8217; Chief Legal Officer Calls Out SEC&#8217;s Regulatory Missteps\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-02T11:51:59.000Z",
    "title": "Beatles Release Final Record with the Help of Artificial Intelligence",
    "url": "https://www.cryptopolitan.com/beatles-release-final-record-with-the-help-of-artificial-intelligence/",
    "description": "In a remarkable blend of technology and music history, the Beatles are set to release their final record, &#8220;Now and Then,&#8221; with the assistance of artificial intelligence. This song, originally recorded as a demo by John Lennon in 1970, has been meticulously restored and completed, thanks to AI-enhanced audio technology. After over 40 years in ... <a title=\"Beatles Release Final Record with the Help of Artificial Intelligence\" class=\"read-more\" href=\"https://www.cryptopolitan.com/beatles-release-final-record-with-the-help-of-artificial-intelligence/\" aria-label=\"More on Beatles Release Final Record with the Help of Artificial Intelligence\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-02T12:00:27.000Z",
    "title": "Shiba Inu News: ShibaSwap 2.0 And Pawzaar Unleash New Features",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-news-shibaswap-pawzaar-new-features/",
    "description": "In a significant development for the Shiba Inu community, the much-anticipated upgrades for ShibaSwap 2.0 have been teased with fresh details, and NFT marketplace Pawzaar has announced a new approach to SHIB burns that aims to bridge tokens from Shibarium back to Ethereum. Here’s the latest Shiba Inu news. New Features For ShibaSwap 2.0 The Shiba Inu ecosystem is abuzz with anticipation as the marketing lead Lucie hinted at innovative features for the upcoming release of ShibaSwap 2.0. In a statement that caught the attention of crypto enthusiasts, Lucie said: Shibaswap 2.0 is more than just a regular DEX; it&#8217;s a complete portal experience. As for why it can&#8217;t be produced like other DEXs in week, it involves intricate development and features. Additionally, Shiba Name Service is one of our pioneering features. Next week coming another feature. #shibarium x BONE X SHIB Expected to revolutionize the decentralized exchange landscape, ShibaSwap 2.0 remains under development, with the specific launch date still shrouded in secrecy. Although speculative mentions of an October release have emerged (which turned out false), the team’s strategic silence on an official date underscores their cautionary approach to community expectations. Related Reading: Shiba Inu Burn Rate Nosedives Following 7,700% Jump, What Happened? Lucie’s previous comments in April brought to light that ShibaSwap 2.0 will not only facilitate token swaps but also serve as a crypto portal — a comprehensive platform offering news, statistics, charts, and trends. Alongside the informational gateway, the DEX will boast new designs that are yet to be unveiled. This level of development suggests a qualitative leap, aiming to enhance user engagement and provide value-added services within the Shiba Inu ecosystem. Pawzaar Implements New Approach To SHIB Burns Turning to the SHIB burn debate, Pawzaar, a burgeoning NFT platform on Shibarium, declared a key operational upgrade today: We have finished upgrading our platform! All SHIB burns now go to a wallet that will bridge the tokens from Shibarium to Ethereum. As addressed by Lucie, we have complied to the request for burns to take place on Ethereum. We will begin adding collections onto the platform! The platform is aligning with Lucie’s guidance, ensuring burns contribute to the SHIB’s total supply reduction on Ethereum’s Layer-1 network. The clarification came after Shib CoOp’s inaugural SHIB burn on Shibarium sparked a hotly discussed debate, emphasizing the need for a protocol that accurately impacts the SHIB supply. The community-driven burn tracker, Shibburn, laid out the technicalities, “If you burn a token like SHIB on an L2 chain, you are not actually burning the original token on the L1 chain.” Related Reading: Shiba Inu Price Prints Rare Buy Signal, What You Need To Know Lucie further explained the burning process across both layers, emphasizing the necessity for burns to occur on the Ethereum network to affect the original SHIB token supply genuinely. She explained that Shibarium projects which wish to burn tokens, have to make sure to bridge the SHIB back to the Ethereum network and then send it to the dead wallet. Pawzaar&#8217;s implementation of this directive is a first on Shibarium and showcases their commitment to the community&#8217;s consensus on token burns. Remarkably, the NFT platform launched only on October 24 and saw a massive influx of users thanks to the SHIB Dreams collection. The high demand was too much for the node provider and prompted the Pawzaar team to stop minting new NFTs for a while. Recently, Pawzaar also announced: “We will be adding collections and providing details on the upcoming PAWPASS. Expect announcements of some upcoming partnerships and PAW (PAWZONE) utilities on the platform. Keep building Shibarium NFT creators and supporting SHIB burns collectors! The fun is about to begin.” At press time, Shiba Inu traded at $0.000008, just above the 20-week EMA (at $0.00000798). Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-02T11:52:00.000Z",
    "title": "Adidas x Bugatti’s New Football Boot Collection Will Accept Crypto",
    "url": "https://coinedition.com/adidas-x-bugattis-new-football-boot-collection-will-accept-crypto/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto.png 730w, https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto-313x175.png 313w, https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto-129x73.png 129w, https://coinedition.com/wp-content/uploads/2023/11/Adidas_x_Bugattis_New_Football_Boot_Collection_Will_Accept_Crypto-355x200.png 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to an announcement published by Adidas, the sportswear brand and Bugatti have collaborated to launch a “limited edition football boot crafted for maximum speed and style.” The X Crazyfast Bugatti boots, only available in 99 pairs globally, are exclusively purchasable via an auction conducted using cryptocurrency. The auction will be hosted on the Adidas [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/adidas-x-bugattis-new-football-boot-collection-will-accept-crypto/\">Adidas x Bugatti’s New Football Boot Collection Will Accept Crypto</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-02T11:45:34.000Z",
    "title": "Top Trader Updates Outlook on AI-Focused Altcoin That’s Exploded 307% Year-to-Date, Unveils Targets for Solana",
    "url": "https://dailyhodl.com/2023/11/02/top-trader-updates-outlook-on-ai-focused-altcoin-thats-exploded-307-year-to-date-unveils-targets-for-solana/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Focused-Altcoin-That-ai.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Focused-Altcoin-That-ai.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Focused-Altcoin-That-ai.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Focused-Altcoin-That-ai.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Focused-Altcoin-That-ai.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Focused-Altcoin-That-ai.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Focused-Altcoin-That-ai.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto strategist is updating his outlook on one red-hot artificial intelligence (AI) altcoin. The pseudonymous crypto analyst Pentoshi tells his 707,100 Twitter followers that Fetch.AI (FET) is likely entering a consolidation phase after soaring 307% year-to-date. “Update: mid-term resistance resisting. Guessing a week or so of some consolidation and chop for this [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/02/top-trader-updates-outlook-on-ai-focused-altcoin-thats-exploded-307-year-to-date-unveils-targets-for-solana/\">Top Trader Updates Outlook on AI-Focused Altcoin That’s Exploded 307% Year-to-Date, Unveils Targets for Solana</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-11-02T12:11:00.000Z",
    "title": "SÀN GIAO DỊCH BITFINEX LÊN SÓNG TIẾNG VIỆT",
    "url": "https://blog.bitfinex.com/media-releases/san-giao-dich-bitfinex-len-song-tieng-viet/",
    "description": "<p>ROAD TOWN, Quần đảo Virgin Anh, [2 tháng 11, 2023] – Bitfinex (www.bitfinex.com/), sàn giao dịch tiền điện tử hàng đầu thế giới, vui mừng thông báo sàn đã lên sóng giao diện tiếng Việt với mục đích phục vụ giao dịch tối ưu và...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/media-releases/san-giao-dich-bitfinex-len-song-tieng-viet/\">SÀN GIAO DỊCH BITFINEX LÊN SÓNG TIẾNG VIỆT</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]