[
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T14:31:58.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T14:30:57.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T14:25:04.000Z",
    "title": "Hana bank leads South Korea’s quest for secure monetary solutions",
    "url": "https://www.cryptopolitan.com/hana-bank-leads-south-koreas-quest-for-secure-monetary-solutions/",
    "description": "The banking sector in South Korea has been actively exploring alternatives to stablecoins and Central Bank Digital Currencies (CBDCs) as they search for secure and efficient monetary options. Leading banks in the region have shown a keen interest in Certificate of Deposit (CD) accounts, indicating a growing trend towards blockchain-based monetary solutions proposed by the ... <a title=\"Hana bank leads South Korea&#8217;s quest for secure monetary solutions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hana-bank-leads-south-koreas-quest-for-secure-monetary-solutions/\" aria-label=\"More on Hana bank leads South Korea&#8217;s quest for secure monetary solutions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T14:18:38.000Z",
    "title": "How AI Skin Type Detection Technology Can Instantaneously Assist To Make Your Meetings Pleasant",
    "url": "https://www.cryptopolitan.com/ai-skin-type-detection-technology/",
    "description": "In the corporate world, having good healthy skin is a wise investment when you&#8217;re meeting a high-caliber client, face-to-face. That&#8217;s where this groundbreaking advancement in skincare technology &#8211; AI Skin Type Detection &#8211; fits in. This cutting-edge solution uses the power of artificial intelligence to analyze up to 14 different skincare concerns instantaneously, accurately determining ... <a title=\"How AI Skin Type Detection Technology Can Instantaneously Assist To Make Your Meetings Pleasant\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-skin-type-detection-technology/\" aria-label=\"More on How AI Skin Type Detection Technology Can Instantaneously Assist To Make Your Meetings Pleasant\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T14:17:53.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices considering investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it brings. For ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T14:12:00.000Z",
    "title": "Global crypto exchanges rush to lisk Worldcoin – Is WLD Token the next big thing?",
    "url": "https://www.cryptopolitan.com/crypto-exchanges-rush-to-lisk-worldcoin/",
    "description": "The recent introduction of Worldcoin (WLD) has taken the DeFi ecosystem by storm. The crypto market has long been recognized for its inherent volatility, with newly introduced tokens frequently encountering substantial price variations upon their inclusion in prominent exchange platforms.&#160; The recently established digital token garnered significant attention within the crypto community due to its ... <a title=\"Global crypto exchanges rush to lisk Worldcoin &#8211; Is WLD Token the next big thing?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-exchanges-rush-to-lisk-worldcoin/\" aria-label=\"More on Global crypto exchanges rush to lisk Worldcoin &#8211; Is WLD Token the next big thing?\">Read more</a>"
  },
  {
    "source": "Kraken Blog",
    "date": "2023-07-24T14:16:09.000Z",
    "title": "Crypto shouldn’t be cryptic: Introducing Kraken’s refreshed web experience",
    "url": "https://blog.kraken.com/crypto-shouldnt-be-cryptic-introducing-krakens-refreshed-web-experience",
    "description": "Getting started in crypto doesn’t need to be hard, and now Kraken has made it even easier. The powerful features and design principles of Kraken’s mobile app are now available on the web. Introducing the new and improved Kraken web experience — the easy way to start your crypto journey. Get started What’s different? All [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-24T14:30:15.000Z",
    "title": "Bitcoin Sharks Continue Accumulation, But Whales Stagnate",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-sharks-continue-accumulation-whales-stagnate/",
    "description": "On-chain data shows the number of Bitcoin sharks has continued to increase recently, but the whale count on the network has hit stagnation. Bitcoin Sharks Have Continued To Go Up In Number Recently According to data from the on-chain analytics firm Santiment, the number of whales on the Bitcoin blockchain has observed a slight decline during the last couple of months. The relevant indicator here is the &#8220;Supply Distribution,&#8221; which measures the total number of addresses that belong to each of the wallet groups on the network. The addresses are divided into these &#8220;wallet groups&#8221; on the basis of the total amount of BTC that they are carrying in their balances right now. In the context of the current discussion, there are four such cohorts that are of interest: 0-0.01 coins, 0.01-1 coins, 1-100 coins, and 100+ coins. Naturally, an address belonging to any of these groups would have its balance inside the range of the group in question. So if the Supply Distribution is applied to these cohorts, it would tell us (among other things) the total number of addresses on the chain that satisfy the respective conditions. Now, here is a chart that shows the trend in the Bitcoin Supply Distribution for each of these four cohorts since the start of the year: Looks like only one of these metrics has continued to constantly grow in recent days &#124; Source: Santiment on Twitter The first of these groups, the 0-0.01 coins range, signifies the small retail holders of the market. From the above graph, it&#8217;s visible that these investors haven&#8217;t changed in number much lately as their Supply Distribution curve has been moving sideways over the past seven weeks. This would suggest that adoption among small investors isn&#8217;t rising for the cryptocurrency at the moment. Related Reading: Bitcoin Will Reach $175,000 If Prices Break Above This Rising Channel, Trader Claims The second group of relevance (0.01-1 BTC) has also been moving flat recently, showing that retail investors as a whole have hit a state of stagnation on the network. Unlike these cohorts, though, the indicator&#8217;s value for the 1-100 coins group, which is sometimes popularly referred to as the &#8220;sharks,&#8221; has only continued to climb higher in the past few months. This would imply that these decently-sized holders are still interested in buying the cryptocurrency, which could be a positive sign for the asset&#8217;s rally. While the sharks may hold some influence in the market due to the size of their holdings, they don&#8217;t hold nearly as much power as the largest cohort in the market: the whales. These humongous investors with 100+ BTC can move around a large amount of coins on the network, and thus, can cause noticeable ripples in the market. Due to this reason, these holders&#8217; behavior may be considered the most important to watch. As displayed in the graph, the number of whales on the network has observed a decline during the last couple of months, although the degree of the downtrend hasn&#8217;t been too much. Nonetheless, one fact remains: they haven&#8217;t been accumulating recently. Related Reading: Bitfinex Hackers Surrender: Couple Agrees to Forfeit 120,000 Bitcoin in Plea Deal What these investors do next from here may be worth keeping an eye on, as Santiment explains that if they start buying again, the possibility of a breakout would greatly increase. BTC Price At the time of writing, Bitcoin is trading around $29,300, down 3% in the last week. BTC has plunged during the past day &#124; Source: BTCUSD on TradingView Featured image from Flavio on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-24T14:29:14.000Z",
    "title": "Binance USD (BUSD) and Gemini USD (GUSD) Secure ‘A’ Ratings for Strong Governance and Stability, While Tether (USDT) Earns ‘D’ in New Stablecoin Credit Ratings List",
    "url": "https://www.crypto-news-flash.com/binance-usd-busd-and-gemini-usd-gusd-secure-a-ratings-for-strong-governance-and-stability-while-tether-usdt-earns-d-in-new-stablecoin-credit-ratings-list/?utm_source=rss&utm_medium=rss&utm_campaign=binance-usd-busd-and-gemini-usd-gusd-secure-a-ratings-for-strong-governance-and-stability-while-tether-usdt-earns-d-in-new-stablecoin-credit-ratings-list",
    "description": "<img width=\"1280\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/feedback-g85f7b9c2c_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/feedback-g85f7b9c2c_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/feedback-g85f7b9c2c_1280-300x281.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/feedback-g85f7b9c2c_1280-1024x960.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/feedback-g85f7b9c2c_1280-768x720.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />According to Bluechip, Tether was assigned an overall rating of &#8216;D.&#8217;  Garett Jones, the Chief Economist at Bluechip, emphasized that the quality of their governance heavily influences the stability ratings of many stablecoins. On July 22, Bluechip, an independent nonprofit stablecoin rating agency, revealed its plan to release its updated rating lists in August. Economist [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-24T14:34:13.000Z",
    "title": "The Dark Side of Worldcoin",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-dark-side-of-worldcoin/",
    "description": "<p>One concerning aspect of WorldCoin&#8217;s approach is its reliance on centralized iris scanning for identity verification, which raises significant privacy and security concerns. In this article, we delve into the negatives of WorldCoin and the risks involved in entrusting a centralized entity with our most personal information. Let&#8217;s explain each point: 1) The Pitfalls of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-dark-side-of-worldcoin/\">The Dark Side of Worldcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-24T14:30:35.000Z",
    "title": "Privacy-Centric Ethereum Altcoin Could Get Boost From This Bullish Signal: Analytics Firm Santiment",
    "url": "https://dailyhodl.com/2023/07/24/privacy-centric-ethereum-altcoin-could-get-boost-from-this-bullish-signal-analytics-firm-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Altcoins-To-Watch-for.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Altcoins-To-Watch-for.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Altcoins-To-Watch-for.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Altcoins-To-Watch-for.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Altcoins-To-Watch-for.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Altcoins-To-Watch-for.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Altcoins-To-Watch-for.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An altcoin used for a privacy-focused internet browser could receive a shot in the arm from a recent bullish signal, according to crypto insights firm Santiment. Santiment says that Basic Attention Token (BAT), which is used as a rewards-based cryptocurrency for the Brave Browser, could rally on the back of recent social media buzz. Santiment [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/24/privacy-centric-ethereum-altcoin-could-get-boost-from-this-bullish-signal-analytics-firm-santiment/\">Privacy-Centric Ethereum Altcoin Could Get Boost From This Bullish Signal: Analytics Firm Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]