[
  {
    "source": "Cointelegraph",
    "date": "2023-09-30T16:30:34.000Z",
    "title": "VanEck to donate 10% profits from Ether ETF to core developers ",
    "url": "https://cointelegraph.com/news/vaneck-donate-profits-from-ether-etf-core-developers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/6031b78c-bf56-446f-b901-19648ed961f0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Protocol Guild, a team of over 150 Ethereum core developers, will be the beneficiary. VanEck argues that asset managers should give back some Ether ETF proceeds to the community.  </p>\n                    <p><p>Global asset manager VanEck will donate 10% of all profits from its upcoming Ether futures exchange-traded fund (ETF) to Ethereum core developers for ten years, the company announced on X (formerly Twitter) on Sept. 29. </p><p>The beneficiary will be The Protocol Guild, a group of over <a href=\"https://protocol-guild.readthedocs.io/en/latest/9-membership.htmlhttps://protocol-guild.readthedocs.io/en/latest/9-membership.html\" target=\"_blank\" rel=\"noopener nofollow\">150 developers</a> maintaining Ethereum’s core technology. According to VanEck, it’s only fair for asset managers to return part of their proceeds to the community building the crypto protocol. It stated: </p><blockquote>“If TradFi stands to gain from the efforts of Ethereum’s core contributors, it makes sense that we also give back to their work. We urge other asset managers/ETF issuers to consider also giving back in the same way.\"</blockquote><p>With this move, VanEck joins other crypto-native communities supporting the Ethereum network, including Lido Finance, Uniswap, Arbitrum, Optimism, ENS Domains, MolochDAO, and Nouns DAO. </p><p>According to a public dashboard tracking donations sent to the Guild’s mainnet, 4,846 contributions have <a href=\"https://dune.com/protocolguild/protocol-guild\" target=\"_blank\" rel=\"noopener nofollow\">generated</a> over $12 million in donations. Funds are then distributed among its members according to a weighted ratio based on their contribution periods.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Big announcement!<br><br>We intend to donate 10% of our <a href=\"https://twitter.com/search?q=%24EFUT&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$EFUT</a> ETF profits (<a href=\"https://t.co/gr652AkUvv\">https://t.co/gr652AkUvv</a>) to <a href=\"https://twitter.com/ProtocolGuild?ref_src=twsrc%5Etfw\">@ProtocolGuild</a> for at least 10 years.<br><br>Thank you, Ethereum contributors, for nearly a decade of relentless building &amp; ongoing stewardship of this common infrastructure.<br><br>Details </p>&mdash; VanEck (@vaneck_us) <a href=\"https://twitter.com/vaneck_us/status/1707888396171977036?ref_src=twsrc%5Etfw\">September 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The network core developers are reportedly working on Ethereum Improvement Proposal <a href=\"https://www.eip4844.com/\" target=\"_blank\" rel=\"noopener nofollow\">EIP-4844</a> (Proto-Danksharding). The upgrade will introduce a new kind of transaction type to Ethereum, promising to reduce transaction fees for layer-2 protocols. </p><p>VanEck <a href=\"https://cointelegraph.com/news/vaneck-launch-ethereum-futures-etf-ads-ahead-sec-approval\">disclosed its upcoming Ethereum Strategy ETF</a> (EFUT) on Sept. 28, saying it will invest in ether futures contracts. The fund will be actively managed by Greg Krenzer, head of active trading at VanEck, and is expected to be listed on the Chicago Board Options Exchange in the coming days. </p><p>Other traditional investment firms set to offer exposure to Ether futures include Valkyrie, and Bitwise, while the line for a spot Ether ETF <a href=\"https://cointelegraph.com/news/invesco-galaxy-ether-spot-etf-application\">keeps growing with Invesco Galaxy</a>, ARK 21Shares, and VanEck waiting for regulatory approval. The United States Securities and Exchange Commission (SEC) recently delayed a decision on whether to approve a spot Ether product until December.</p><p><strong><em>Magazine:</em></strong> <a href=\"https://cointelegraph.com/magazine/joe-lubin-the-truth-about-eth-founders-split-and-crypto-google/\"><strong><em>Joe Lubin — The truth about ETH founders split and ‘Crypto Google’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-30T16:17:33.000Z",
    "title": "Privacy Concerns and Skepticism Surrounding the Rise of Smart Glasses",
    "url": "https://www.cryptopolitan.com/skepticism-rises-of-smart-glasses/",
    "description": "In the ever-evolving landscape of technological advancements, it&#8217;s natural to approach emerging trends with a blend of curiosity and caution. One can&#8217;t help but reminisce about instances when skepticism led to missed opportunities, as in the case of the initial iPhone launch, which many doubted would succeed. Fast forward to today, where the name &#8220;Apple&#8221; ... <a title=\"Privacy Concerns and Skepticism Surrounding the Rise of Smart Glasses\" class=\"read-more\" href=\"https://www.cryptopolitan.com/skepticism-rises-of-smart-glasses/\" aria-label=\"More on Privacy Concerns and Skepticism Surrounding the Rise of Smart Glasses\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-30T16:37:38.000Z",
    "title": "nChain CEO resigns, claims Craig Wright is not Satoshi",
    "url": "https://crypto.news/nchain-ceo-resigns-claims-craig-wright-is-not-satoshi/",
    "description": "The nChain board, Ager-Hanssen claims, \"didn’t take action.\" One of the things he recommended was \"to sack Dr. Craig Wright.\" "
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-30T16:30:50.000Z",
    "title": "FTX Exploiter Transfers 5,000 ETH Ahead Of Ether Futures ETF Launch",
    "url": "https://www.newsbtc.com/news/ethereum/ftx-exploiter-transfers-5000-eth-ahead-of-ether-futures-etf-launch/",
    "description": "Some 5,000 ETH, worth over $8.2 million, have been moved from a wallet address associated with the FTX hacker. This development marks the first time assets have been transferred out of the hacker’s wallet following the exploit about a year ago. Related Reading: Cathie Wood’s ARK Invest Joins Ethereum Futures ETF Race After Spot Bitcoin ETF Delay FTX Hacker Moves 5,000 ETH, Spot On Chain Reveals Marked as one the biggest crypto heists ever, the now-defunct FTX exchange suffered a loss of over $600 million through an hack in November 2022, a few hours after filing for bankruptcy.  According to the on-chain analytics platform Spot On Chain, the FTX exploiter has now transferred 5,000 ETH in two transactions, moving 2,500 ETH to two separate wallets with a space of two hours between both transactions.  Spot on Chain further revealed that following the first transaction, the hacker moved 700 ETH through the Thorchain Router and 1,200 ETH through the DeFi wallet Railgun, both crypto projects that are lauded for their privacy-focused features. Aside from the origin of these transferred assets, the movements of the FTX exploiter have drawn much attention due to a key development in the crypto space, with many enthusiasts and analysts now speculating on a possible market sell-off.  Related Reading: Grayscale Takes New Approach As It Files For Another Ethereum Futures ETF Could FTX Hacker Be Planning A Sell-Off As Ether Futures ETF Launch Nears? This week, reports swelled that the US Securities and Exchange Commission (SEC) was looking to clear some Ether futures ETH for launch next week ahead of a possible government shutdown. These reports picked up more steam in less than a day when the VanEck Investment firm announced plans to soon launch an Ether futures ETH, named the VanEck Ethereum Strategy ETF.  However, Valkyrie Investments, who had been tipped to be the forerunner for the SEC’s approval, finally won the race, securing the commission&#8217;s green light to launch the first-ever Ether futures ETF in the US.  Following the official launch of an Ether futures ETF, there is likely a massive positive effect on ETH price movement. Just in the last two days of similar positive news around this investment fund, the second-largest cryptocurrency already rose by 4%, based on data from CoinMarketCap.  Now, the recent token transfers by the FTX hacker are usually associated with an impending sell action. Thus, there is a possibility that this bad actor could be planning to take profit from the potential ETH price surge, which could be generated from the launch of ETH futures ETF.  Such selling action is a common practice by crypto whales and is known to induce a bearish trend, which could be dangerous for small traders.  At the time of writing, ETH trades at $1,677, with a 5.77% gain in the last day. Meanwhile, the token’s daily trading volume is down by 44.35% and valued at $3.8 billion.  ETH trading at $1,675.57 on the hourly chart &#124; Source: ETHUSDT chart on Tradingview.com Featured image from Money,chart from Tradingview"
  }
]