[
  {
    "source": "CryptoSlate",
    "date": "2023-07-19T23:05:19.000Z",
    "title": "Apple developing its own AI chatbot as an internal tool",
    "url": "https://cryptoslate.com/apple-is-working-on-an-internal-ai-chatbot/",
    "description": "<p>Apple is developing artificial intelligence (AI) tool including a chatbot that is similar to ChatGPT, Bloomberg reported on July 19. Company members have reportedly been working on an internal framework for large language models called &#8220;Ajax&#8221; since 2022. That development in turn led to the creation of an AI chatbot that is internally referred to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/apple-is-working-on-an-internal-ai-chatbot/\">Apple developing its own AI chatbot as an internal tool</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-19T22:44:00.000Z",
    "title": "Crypto Analyst Predicts $DOGE Could Mimic $XRP’s Massive Rally",
    "url": "https://www.cryptoglobe.com/latest/2023/07/crypto-analyst-predicts-doge-could-mimic-xrps-massive-rally/",
    "description": "Popular cryptocurrency analyst Michaël van de Poppe has recently revealed he believes that the price of the meme-inspired cryptocurrency Dogecoin ($DOGE) could potentially see a remarkable rally similar to the one $XRP saw earlier this month. The price of XRPis up over 65% over the past weekover a recent ruling by a federal judge in […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T22:44:28.000Z",
    "title": "Top Blockchain Development Companies in Europe: What Does A Blockchain-Empowered Future Need?",
    "url": "https://www.cryptopolitan.com/top-blockchain-development-companies-in-europe-what-does-a-blockchain-empowered-future-need/",
    "description": "As the digital landscape relentlessly evolves, one revolutionary technology that has taken the world by storm is blockchain. A fundamental pillar of digital transformations in various industries, blockchain technology offers unparalleled security, transparency, and efficiency. Its transformative potential reaches beyond cryptocurrencies into a myriad of applications, establishing it as a disruptive force in the technology ... <a title=\"Top Blockchain Development Companies in Europe: What Does A Blockchain-Empowered Future Need?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-blockchain-development-companies-in-europe-what-does-a-blockchain-empowered-future-need/\" aria-label=\"More on Top Blockchain Development Companies in Europe: What Does A Blockchain-Empowered Future Need?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T23:02:13.000Z",
    "title": "Bitcoin, XRP, & Ethereum: Three Top Coins On Brink Of Golden Cross",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-xrp-ethereum-three-top-coins-golden-cross/",
    "description": "Bitcoin, XRP, and Ethereum — three of the cryptocurrency market’s most dominant coins — are about to simultaneously form a 3-day golden cross. This signal is rare, happening only a handful of times in the past in each individual asset. However, never have all three of these major cryptocurrencies triggered this signal all at the same time. What exactly does this mean, and what are the results of the 3-day golden cross? Bitcoin, XRP, &#38; Ethereum Lead Market Recovery The crypto market outlook is a lot less bleak than it was just weeks ago, between BlackRock and other institutions seeking to launch Bitcoin ETFs and the massive win for XRP and Ripple against the US Securities and Exchange Commission (SEC). Related Reading: Perfect Storm: Why Bitcoin &#38; Crypto Are Poised For A Dramatic Recovery Even the technical environment is starting to show signs of a possible uptrend brewing. Notably, several top cryptocurrencies are inching closer to a golden cross on the 3-day timeframe, which has only occurred a handful of times in the past. This is about to happen in Bitcoin, Ethereum, and XRP, simultaneously, for the first time in their history. Previously, these signals arrived at different phases of previous bull markets. It wasn’t until all three coins golden crossed that a stronger rally began. Three top crypto assets — #Bitcoin, Ethereum, and #XRP — are on the brink of a golden cross on the 3-day timeframe All three firing at the same time has never happened before It will also be the third in history for BTC and XRP, second ever for Ether pic.twitter.com/bzVfK3ZpBp — Tony &#8220;The Bull&#8221; (@tonythebullBTC) July 19, 2023 What Is A Golden Cross In Crypto? A golden cross occurs when a higher timeframe moving average, typically a 200-period MA, crosses above a lower timeframe moving average, usually a 50-period MA, from below. In contrast, a death cross happens when the two cross down from from above. These crossovers generate a buy or sell signal in a moving average-based trading system. Such systems are designed to capture the majority of a trend, but tend to miss much of the early part of a rally as it awaits confirmation. The 3-day golden cross throughout the years &#124; BTCUSD on TradingView.com Moving Average Crossover: How Does The Signal Stack Up? The only time the signal suffered a drawdown was in Bitcoin in 2019. In all other instances, the buy signal using nothing more than a simple moving average crossover, was wildly profitable with limited downside. In 2015, the BTCUSD 3-day golden cross yielded over 2,000% ROI before crossing back down and giving the corresponding sell signal. XRP’s golden cross to death cross kept more than 9,000% of the uptrend’s gains. Ethereum never fired a signal back then, however, due to insufficient price history. Related Reading: This Bitcoin Continuation Pattern Points To 3-6 Months Of Uptrend Ahead Come 2019, Bitcoin had its misfire where the buy signal then sat through a long drawdown. Neither XRP nor Ethereum triggered a signal until 2020, when the entire crypto market began to rally together. The 2020 ETHUSD golden cross held onto over 1100% ROI before the death cross closed out the position. XRP failed to set a new all-time high, but the golden cross still clocked in 200% ROI. Even though Bitcoin fired early in 2019 and sat through a drawdown, the buy signal was still ultimately effective and retained 550% ROI by the time a death cross caused the position to close. Across the five historic buy signals, there was an average of 2,570% ROI when a golden cross occurred. While such returns aren’t likely in the future, this does suggest the signal is effective. Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T23:00:30.000Z",
    "title": "Back In The Game: Ripple Joins $54 Million Funding Round For Metaverse Startup",
    "url": "https://www.newsbtc.com/ripple-2/back-in-the-game-ripple-joins-54-million-funding-round-for-metaverse-startup/",
    "description": "Ripple has been mostly preoccupied with its lawsuit with the United States Securities and Exchange Commission (SEC). However, with a partially favorable ruling from Judge Analisa Torres last week stating that XRP tokens sold on the secondary market are not securities, the crypto firm has turned its attention to other things. This time around, Ripple has dipped its toes into the metaverse sector, joining a massive funding round for Futureverse. Ripple Joins $54 Million Funding Round For Futureverse On Tuesday, Bloomberg reported that Futureverse, a metaverse startup, had raised a total of $54 million. The company completed the Series A funding round, although at an undisclosed valuation. But the interesting part of the raise was the parties involved. Related Reading: Why This Upcoming Event Is Bearish For Axie Infinity (AXS) The raise was led by 10T Holdings, a crypto investment firm. However, the funding round seems to have managed to draw the attention of Ripple Labs as well. The raise is also significant in the fact that it took place at a time when crypto-related companies are seeing a decline in funding. Interestingly, the Futureverse startup is a combination of other startups. According to the Bloomberg report, Futureverse is actually a combination of 11 startups that span across different industries. These include metaverse, gaming, and artificial intelligence (AI), among others. XRP price sitting at $0.79 &#124; Source: XRPUSD on TradingView.com Nevertheless, most of Futureverse’s products so far seem to be combining metaverse, gaming, and AI. The startup currently has a football (soccer) game that can be played on mobile called ‘AI League’ that has also been licensed by FIFA. Its next gamin product is said to be a boxing game leveraging the power of AI. A Return Fueled By Positive Sentiment Ripple has regained its foothold in the crypto industry following the court’s ruling against the SEC last week. With this, both the company and its native token, XRP, have experienced renewed vigor in the market. One example is Ripple looking to leverage real-world assets which it expects to reach a $30 trillion market cap in the next decade. Related Reading: Bearish Signal: BNB Open Interest Skyrockets To New Highs Following the ruling as well, the price of XRP jumped by over 60%, bringing the digital asset to its highest level since December 2021. Since then, XRP has continued on a bullish streak, surpassing Bitcoin in terms of average weekly volume, and emerging as one of the top performers in the space. Presently, the price of XRP is sitting at $0.791, representing a 4.92% increase in the last 24 hours. On the 7-day chart, the cryptocurrency is seeing gains of 67% and is now the 4th-largest cryptocurrency with its market cap resting at $41.5 billion. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]