[
  {
    "source": "Cointelegraph",
    "date": "2024-01-19T03:00:54.000Z",
    "title": " Nifty News: Trump NFTs go Ordinal, Zuck’s metaverse a ‘decade’ away and more ",
    "url": "https://cointelegraph.com/news/donald-trump-nft-ordinals-pudgy-penguins-ath-nft-volumes-plummet-nifty-news",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNjhmZWNlNGEtYTY1ZS00NDA5LWFjZTktZTgyMGQxYTllYTk0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Donald Trump has released an extra-premium Ordinals NFT for users who purchase more than 100 NFTs from his latest “mugshot collection.”</p>\n                    <p><p>Donald Trump is banking on Bitcoin Ordinals to push up sales of his controversial “Mugshot Edition” nonfungible tokens (NFTs).</p><p>The team behind the former U.S. president’s NFT collection has announced that any user who purchased 100 or more mugshot editions of the Trump Digital Trading Cards NFTs will now receive a “One-of-One” trading card as a Bitcoin Ordinal. </p><p>According to a Jan. 18 X post from CollectTrumpCards, only 200 unique Ordinals NFTs will ever be minted and will only be available to those who spend $99 apiece for at least 100 of his latest Mugshot NFTs — meaning the user would have had to spend at least $9,900 in total. </p><p><a href=\"https://cointelegraph.com/news/donald-trump-nft-ordinals-pudgy-penguins-ath-nft-volumes-plummet-nifty-news\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-19T02:52:53.000Z",
    "title": "Bitcoin Price Takes Hit, Can Bulls Protect The Main Support at $40K?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-takes-hit-40k/",
    "description": "Bitcoin price extended its decline below the $41,450 support zone. BTC is showing bearish signs and might struggle to stay above the $40,000 support zone. Bitcoin price is gaining bearish momentum below the $42,500 zone. The price is trading below $42,000 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance near $42,100 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair is now at risk of more downsides toward the $40,000 support zone. Bitcoin Price Gains Bearish Momentum Bitcoin price failed to start a recovery wave above the $43,250 resistance zone. BTC formed a short-term top and started another decline below the $42,120 support zone. The bears were able to push the price below the $41,450 level. A new weekly low was formed near $40,625 and the price is now consolidating losses. It is trading near the 23.6% Fib retracement level of the recent decline from the $43,569 swing high to the $40,625 low. Bitcoin is now trading below $42,000 and the 100 hourly Simple moving average. There is also a key bearish trend line forming with resistance near $42,100 on the hourly chart of the BTC/USD pair. On the upside, the price is facing resistance near the $41,675 level. The next key resistance is near the $42,100 zone and the trend line. It is also close to the 50% Fib retracement level of the recent decline from the $43,569 swing high to the $40,625 low. Source: BTCUSD on TradingView.com A clear move above the $42,100 resistance could send the price toward the $43,250 resistance. The next resistance is now forming near the $43,500 level. A close above the $43,500 level could push the price further higher. The next major resistance sits at $44,450. More Losses In BTC? If Bitcoin fails to rise above the $42,100 resistance zone, it could continue to move down. Immediate support on the downside is near the $40,750 level. The next major support is $40,500. If there is a close below $40,500, the price could gain bearish momentum. In the stated case, the price could drop toward the $40,000 support in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $40,750, followed by $40,000. Major Resistance Levels – $41,675, $42,100, and $43,250."
  }
]