[
  {
    "source": "Decrypt",
    "date": "2023-08-15T19:52:08.000Z",
    "title": "Actors Union Agreement That Includes AI Rules Is ‘Not a Waiver,’ Director Says",
    "url": "https://decrypt.co/152600/actors-union-agreement-that-includes-ai-stipulations-is-not-a-waiver-director-clarifies",
    "description": "SAG-AFTRA Executive Director Duncan Crabtree-Ireland explained how the current deal offer addresses the use of artificial intelligence."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-15T19:54:21.000Z",
    "title": "US lawmakers press SEC and FINRA on Prometheum's broker-dealer approval",
    "url": "https://cointelegraph.com/news/us-lawmakers-press-sec-finra-prometheum-broker-dealer-approval",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/3f615b8c-1127-4147-bcb1-f96263b2c576.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Members of the House Financial Services Committee questioned the “timing and circumstances” of FINRA approving Prometheum’s special purpose broker-dealer license in May.</p>\n                    <p><p>United States lawmakers on the House Financial Services Committee have demanded answers from the heads of the Securities and Exchange Commission (SEC) and Financial Industry Regulatory Authority (FINRA) regarding under what circumstances Prometheum obtained a special purpose broker-dealer license (SPBD).</p><p>In separate letters dated Aug. 9, House committee chair Patrick McHenry and 20 other members <a href=\"https://financialservices.house.gov/uploadedfiles/2023-08-09_fsc_gop_letter_to_sec_re_prometheum.pdf\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> to SEC chair Gary Gensler and FINRA president and CEO Robert Cook. The lawmakers questioned the “timing and circumstances” of FINRA approving Prometheum’s SPBD as they were continuing to consider legislative solutions to regulatory gaps on digital assets.</p><p>“While Prometheum claims it is the silver bullet for regulated digital asset offerings, it has not yet served a single customer,” claimed the lawmakers. “It is unclear why FINRA would have chosen to approve a firm with no operating history and no track record of serving customers over all the applications that it has received.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/NEW?src=hash&amp;ref_src=twsrc%5Etfw\">#NEW</a>: Chairman <a href=\"https://twitter.com/PatrickMcHenry?ref_src=twsrc%5Etfw\">@PatrickMcHenry</a> led Republicans on the Financial Services Committee in letters to <a href=\"https://twitter.com/FINRA?ref_src=twsrc%5Etfw\">@FINRA</a>  and <a href=\"https://twitter.com/SECGov?ref_src=twsrc%5Etfw\">@SECGov</a> regarding the shady approval of Prometheum as the only Special Purpose Broker-Dealer for digital assets.<br><br> Read more <a href=\"https://t.co/2B9TYw070h\">https://t.co/2B9TYw070h</a> <a href=\"https://t.co/8erscG99JO\">pic.twitter.com/8erscG99JO</a></p>&mdash; Financial Services GOP (@FinancialCmte) <a href=\"https://twitter.com/FinancialCmte/status/1691503278972870665?ref_src=twsrc%5Etfw\">August 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blockchain-association-calls-for-investigation-prometheum-sweetheart-sec-deal\"><strong><em>Blockchain Association calls for investigation into Prometheum over alleged ‘sweetheart’ SEC deal</em></strong></a></p><p>Prometheum, founded in 2017, had been largely unknown to many members of the crypto space prior to its co-founder and co-CEO Aaron Kaplan <a href=\"https://cointelegraph.com/news/us-lawmaker-invokes-sec-lawsuits-in-considering-crypto-regulatory-framework\">testifying before the House committee</a> in June. The firm received an SPBD in May, prompting many crypto advocacy groups and lawmakers to <a href=\"https://cointelegraph.com/news/who-is-prometheum-what-testify-congress-about-crypto-sec\">question its products and services</a>, and in some cases call for an investigation. </p><p>The House committee members requested the SEC and FINRA provide documents and communication records related to Prometheum’s SPBD before Aug. 22. In addition, the lawmakers called on FINRA to <a href=\"https://financialservices.house.gov/uploadedfiles/2023-08-09__fsc_gop_letter_to_finra_re_prometheum.pdf\" target=\"_blank\" rel=\"noopener nofollow\">answer</a> specific questions related to Prometheum, alleging the firm may have had ties to the Chinese Communist Party.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-15T19:50:15.000Z",
    "title": "Institutional investors have switched gears on Salvadoran bonds",
    "url": "https://cryptoslate.com/institutional-investors-have-switched-gears-on-salvadoran-bonds/",
    "description": "<p>El Salvador&#8217;s once-shunned debt has become a sought-after investment this summer, with BNN Bloomberg reporting that major financial institutions like JPMorgan Chase &#38; Co., Eaton Vance, and PGIM are making notable moves into the market. The significant turnaround is largely credited to President Nayib Bukele’s efforts. Despite initial apprehensions from Wall Street due to his [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/institutional-investors-have-switched-gears-on-salvadoran-bonds/\">Institutional investors have switched gears on Salvadoran bonds</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-15T19:59:33.000Z",
    "title": "Huobi’s 7th PrimeVote finishes with MinePlex (XFI) Coming out on Top",
    "url": "https://cryptodaily.co.uk/2023/08/huobis-7th-primevote-finishes-with-mineplex-xfi-coming-out-on-top",
    "description": "<p>Singapore, Singapore, August 15th, 2023, Chainwire</p><p>Crypto Exchange Huobi announced that the 7th round of Huobi's PrimeVote event is finished. In this round, a total of 12 projects competed for the listing, accumulating 226,040,064 votes in the form of \"Rockets\". After two rounds of intense voting, MinePlex (XFI) emerged as the winner, garnering a total of 208,172,999 \"Rockets\". XFI will soon get listed on Huobi for trading.</p><p>In the final round of voting, XFI secured the win by amassing 208,172,999 \"Rockets\". XDAO secured the second position with 11,355,497 \"Rockets\" while AD and INS captured the third and fourth positions with 4,130,180 \"Rockets\" and 2,381,388 \"Rockets\" respectively. Huobi's official data reveals that participants casted a total of 226,040,064 \"Rockets\" with 5,176 individuals taking part. Notably, the \"Rockets\" used for voting witnessed a substantial 78% upswing compared to the previous round. Additionally, the 8th round of Huobi's PrimeVote event will carry on its worldwide search for outstanding projects by encouraging their participation in this vote-to-list event. The rules of the 8th PrimeVote will stay the same&nbsp; with \"rockets\" as the favored voting tool.</p><p>Vote for projects with \"Rockets\" and win limited edition NFTs</p><p>The \"Rocket Plan\" is Huobi's newest endeavor aimed at enriching user engagement and experience. Rockets refer to the USDT equivalent of your average assets on Huobi over a 30-day period. 1 USDT equals to 1 Rocket. The Rocket value represents an integer without decimal places.</p><p>The number of \"Rockets\" a user holds is determined by the balance of their assets. With an increased possession of \"Rockets,\" users can wield more influence in the PrimeVote event, major platform decisions, new token airdrops, and other scenarios where \"Rockets\" come into play. This grants them a stronger voice and a larger share of rewards. To increase their Rocket values, users can improve their asset balances by making deposits and purchasing quality assets like BTC, ETH, HT, etc. Moreover, using \"Rockets\" to vote will not cause users' asset balance to be locked.</p><p>\"Rockets\" are users' tickets to take part in the PrimeVote events and also give participants a chance to mint limited edition NFTs in Huobi's Mars Program that offers $6 million worth of space travel.</p><p>Based on Huobi's official announcement, a total of 12 projects were shortlisted in the 7th round of the PrimeVote event. As of August 9 202313:00 (UTC), EML and XDAO emerged as top performers in Group A while XFI and AD took the lead in Group B. These projects have advanced to the final voting stage. Following two rounds of preliminary and final voting, MinePlex (XFI) has stood out as the favored pick among the community by winning the championship of this event with a notable 208,172,999 \"Rockets\". MinePlex (XFI) represents an innovative CrossFi initiative by integrating the stability and liquidity of traditional financial instruments with the security and transparency embedded in blockchain technology. To realize this vision, the team is crafting a distinct blockchain v1.0 featuring the LPoS consensus algorithm. The MinePlex 2.0 blockchain adopts the DPoS consensus protocol.</p><p>Huobi prioritize users and persistent crypto listings with community votes</p><p>Huobi remains committed to upholding the principle of impartial listing and respects the choices of all users. It aims to establish a digital asset trading platform that is compliant, secure, and transparent. It returns the listing right to community users by allowing them to decide which tokens can be traded on Huobi. Launching PrimeVote not only identifies the most popular tokens and ensures listing quality but also maximizes the transparency and fairness of the listing process.</p><p>To date, Huobi has successfully conducted seven rounds of the PrimeVote event by establishing a unique method for token listing. Looking ahead, Huobi will further refine event rules and introduce innovative features.</p><p></p><p>About Huobi&nbsp;</p><p>Founded in 2013, Huobi has evolved from a crypto exchange into a comprehensive ecosystem of blockchain businesses that span digital asset trading, financial derivatives, wallets, research, investment, incubation and other areas. Huobi serves millions of users worldwide, with a business presence covering over 160 countries and regions across five continents. Its three development strategies - \"global development, technology drives development, and technology for good\" underpin its commitment to providing comprehensive services and values to global cryptocurrency enthusiasts.</p><p>Company Website</p><p>https://www.huobi.com</p><p></p>ContactMichael Wangglo-media@huobi.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T19:58:08.000Z",
    "title": "Europe’s first Spot Bitcoin ETF under Jacobi lists in Amsterdam",
    "url": "https://www.cryptopolitan.com/europes-first-spot-btc-etf-under-jacobi/",
    "description": "Europe has surpassed the United States in the launch of the first Bitcoin exchange-traded fund (ETF), with London-based Jacobi Asset Management announcing the product&#8217;s debut on Euronext Amsterdam today. The firm initially expected to launch its Bitcoin ETF product last year after getting authorization from the Guernsey Financial Services Commission (GFSC) in October 2021. Europe ... <a title=\"Europe&#8217;s first Spot Bitcoin ETF under Jacobi lists in Amsterdam\" class=\"read-more\" href=\"https://www.cryptopolitan.com/europes-first-spot-btc-etf-under-jacobi/\" aria-label=\"More on Europe&#8217;s first Spot Bitcoin ETF under Jacobi lists in Amsterdam\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T19:42:44.000Z",
    "title": "Will Bitcoin hit $100k before the 2024 halving?",
    "url": "https://www.cryptopolitan.com/will-bitcoin-hit-100k-before-2024-halving/",
    "description": "Jesse Myers, a Bitcoin investor and author, believes that according to market analysts, Bitcoin won&#8217;t reach six figures until the block subsidy halving in 2024. Myers, the co-founder of Bitcoin investment firm Onramp, stated in an X (formerly Twitter) post on August 15 that the market would only &#8220;price in&#8221; the halving after the fact. ... <a title=\"Will Bitcoin hit $100k before the 2024 halving?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/will-bitcoin-hit-100k-before-2024-halving/\" aria-label=\"More on Will Bitcoin hit $100k before the 2024 halving?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-15T20:00:06.000Z",
    "title": "Institutional XRP Holdings Rise Rapidly Following Ripple’s Win Over SEC",
    "url": "https://www.newsbtc.com/analysis/xrp/institutional-xrp-holdings-rise/",
    "description": "Now that Ripple has prevailed over the SEC in court, major players are eager to get their hands on XRP. According to recent data, institutions have been getting their hands on the cryptocurrency at a steady rate, as reflected in the digital asset fund flows report.  Institutional XRP Holdings Rise Rapidly In the days following Ripple’s partial victory in the SEC lawsuit, XRP volumes and prices rose dramatically as crypto traders rushed to the cryptocurrency in anticipation of a continued bull run. However, price metrics from Coinmarketcap show that the euphoria has subsided, with XRP now down 13.39% in a monthly time frame. On-chain data has also shown whales dumping the token to take profits, increasing the selling pressure on the token. Related Reading: Here’s Why This Former SEC Lawyer Thinks A Spot Bitcoin ETF Isn’t Coming On the other hand, the tide is turning for the once embattled crypto among institutional investors as inflows into XRP digital asset funds are increasing steadily. According to the weekly report on the digital asset fund flows by CoinShares, XRP saw $0.5 million in inflows last week.  Over the past 16 weeks, XRP has seen consistent inflows into crypto investment funds, making up 12% of all digital assets under management. In total, XRP’s assets under management have risen 127% since the beginning of the year, outpacing the growth of other popular altcoins like Polygon and Cardano. XRP price returns to $0.6256 &#124; Source: XRPUSD on Tradingview.com Investor Attitude Toward Crypto Funds Is Growing Crypto funds, in general, have seen a shift to positive sentiment from investors. In the first week of the month, digital asset investment products saw outflows, with investors taking profits in recent weeks. Bitcoin alone saw outflows totaling $111 million, its highest since March. XRP, however, did witness inflows of $0.5 million during this period.  The latest report would see digital asset investment products receive inflows of $29 million throughout the week. Bitcoin would also return as the primary focus, seeing $27 million of inflows after three prior weeks of $144 million outflows. Related Reading: Winds Of Change: Bitcoin Miner Riot Sees Substantial Increase In BTC Holdings With the recent inflows, institutional investors are signaling their faith in XRP’s future by increasing their asset holdings. In July, many digital asset funds saw a 57% increase in their XRP Exchange Traded Products (ETPs). Fineqia, for instance, saw its XRP AUM increase from $49 million to $76.8 million.  The price of the token appears to have weakened in momentum in recent weeks, much like the rest of the crypto market. At the time of writing, XRP is down by 0.60% in the last 24 hours and is trading at 0.625. Even so, the mood around XRP feels decidedly more optimistic as investors expect a final decision in the Ripple-SEC lawsuit.  Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-15T20:00:29.000Z",
    "title": "Former SEC Official Says Bitcoin (BTC) ETF Will Not Be Approved Until This Happens",
    "url": "https://dailyhodl.com/2023/08/15/former-sec-official-says-bitcoin-btc-etf-will-not-be-approved-until-this-happens/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/sec-official-btc-etf.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/sec-official-btc-etf.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/sec-official-btc-etf.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/sec-official-btc-etf.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/sec-official-btc-etf.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/sec-official-btc-etf.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/sec-official-btc-etf.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A former high-ranking official of the U.S. Securities and Exchange Commission (SEC) says that a possible future event could result in the likely approval of a spot-based Bitcoin (BTC) exchange-traded fund (ETF). John Reed Stark, who founded the SEC’s Office of Internet Enforcement and spent 11 years as its chief, says that crypto has become a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/15/former-sec-official-says-bitcoin-btc-etf-will-not-be-approved-until-this-happens/\">Former SEC Official Says Bitcoin (BTC) ETF Will Not Be Approved Until This Happens</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-15T19:55:12.000Z",
    "title": "Benjamin Cowen Says There Could Be a ‘Windfall Event’ That Crushes DeFi and Altcoin Markets",
    "url": "https://dailyhodl.com/2023/08/15/benjamin-cowen-says-there-could-be-a-windfall-event-that-crushes-defi-and-altcoin-markets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/DeFi-Blockchain-Behind.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/DeFi-Blockchain-Behind.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/DeFi-Blockchain-Behind.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/DeFi-Blockchain-Behind.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/DeFi-Blockchain-Behind.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/DeFi-Blockchain-Behind.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/DeFi-Blockchain-Behind.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Widely followed crypto analyst Benjamin Cowen is warning that the decentralized finance (DeFi) and altcoin markets could get caught up in a large capitulation event soon. In a new interview with Scott Melker, Cowen says that Bitcoin (BTC) will likely retrace the gains it put up in the first half of the year, dragging DeFi [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/15/benjamin-cowen-says-there-could-be-a-windfall-event-that-crushes-defi-and-altcoin-markets/\">Benjamin Cowen Says There Could Be a ‘Windfall Event’ That Crushes DeFi and Altcoin Markets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]