[
  {
    "source": "Crypto Daily",
    "date": "2023-07-04T06:17:24.000Z",
    "title": "BlackRock Refiles Application for Bitcoin Spot ETF With SEC",
    "url": "https://cryptodaily.co.uk/2023/07/blackrock-refiles-application-for-bitcoin-spot-etf-with-sec",
    "description": "<p>BlackRock refiled its application for its iShares Bitcoin Trust exchange-traded fund (ETF) after the SEC found it inadequate.</p>\n<p>The Nasdaq exchange has submitted an amended application for a Bitcoin spot ETF on behalf of BlackRock after the SEC found trouble with its initial attempt.</p>\nNasdaq Names Coinbase as Surveillance Partner\n<p>In the newly submitted application, Nasdaq reached an agreement with crypto exchange Coinbase to enter into a surveillance-sharing agreement which will address one of the SEC&rsquo;s main objections to recent Bitcoin spot ETF filings. &nbsp;</p>\n<p>The filing reads:</p>\n\n<p>The Spot BTC SSA is expected to be a bilateral surveillance-sharing agreement between Nasdaq and Coinbase that is intended to supplement the exchange&rsquo;s market surveillance program.</p>\n\n<p>The Wall Street Journal reported last week that the SEC told Nasdaq and Cboe that recent ETF filings from BlackRock, Fidelity, and others were not &ldquo;clear and comprehensive.&rdquo;</p>\n<p>Senior Bloomberg Analyst Eric Balchunas soon tweeted that the SEC&rsquo;s main objection to the filings was that it needed the name of the crypto exchange for the &ldquo;surveillance-sharing agreement&rdquo; and required more details on the SSA.</p>\n\n<p dir=\"ltr\" lang=\"en\">Hold up a second, this isn't as bad as headline. The key paragraph is deep in story. Basically SEC wants them to name the \"crypto exchange\" and give more details on SSA. That's understandable, arguably good news. I was under impression they'd have to update that as well. pic.twitter.com/bh9qn65Xh2</p>\n&mdash; Eric Balchunas (@EricBalchunas) June 30, 2023\n<p>\n\n</p>\nFirms Update ETF Filings\n<p>BlackRock&rsquo;s proposed ETF will depend on Coinbase as its custodian and for its spot market data for pricing. Coinbase has also agreed to provide similar services to Fidelity, which is also applying for its own Bitcoin spot ETF.</p>\n<p>BlackRock was the first to apply for a Bitcoin spot ETF on June 15, followed by filings from WisdomTree, Invesco, and finally, Fidelity.</p>\n<p>Given the agency&rsquo;s hostile stance against crypto under its current chairman Gary Gensler, the SEC has not approved any Bitcoin spot ETFs.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T06:22:03.000Z",
    "title": "Revolut Ceases Offering Solana, Cardano, and Polygon Tokens to US Users",
    "url": "https://www.cryptopolitan.com/revolut-ceases-offering-tokens-to-us-users/",
    "description": "Revolut, a prominent UK-based fintech app, has made the decision to discontinue providing Solana (SOL), Cardano (ADA), and Polygon (MATIC) tokens to its customers in the United States. This move follows the delisting of these cryptocurrencies by its provider, Bakkt Holdings Inc., in response to the US Securities and Exchange Commission&#8217;s (SEC) classification of these ... <a title=\"Revolut Ceases Offering Solana, Cardano, and Polygon Tokens to US Users\" class=\"read-more\" href=\"https://www.cryptopolitan.com/revolut-ceases-offering-tokens-to-us-users/\" aria-label=\"More on Revolut Ceases Offering Solana, Cardano, and Polygon Tokens to US Users\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T06:17:24.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  }
]