[
  {
    "source": "Cointelegraph",
    "date": "2023-09-30T02:23:03.000Z",
    "title": "Do Kwon dismisses Slack chat records as irrelevant evidence ",
    "url": "https://cointelegraph.com/news/terraform-labs-do-kwon-slack-chat-evidence",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/d1115d00-50f0-4116-a482-fad803b45599.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Slack conversations between Terraform Labs' co-founders Do Kwon and Daniel Shin have exposed their contemplation of orchestrating fraudulent transactions on the Terra blockchain.</p>\n                    <p><p>Terraform Labs co-founder Do Kwon has refuted the significance of Slack messages as evidence, which involved discussions with his co-founder Daniel Shin about manipulating transactions on the Terra blockchain to attract investors.</p><p>The United States Securities and Exchange Commission (SEC) included the Slack conversation between the two co-founders, which was dated back to September 2019, in a recent court <a href=\"https://www.docdroid.net/ogE2StR/govuscourtsnysd594150581-pdf#page=3\" target=\"_blank\" rel=\"noopener nofollow\">filing</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/9ca611e8-6ef4-44f1-936b-ad8705a4e45f.png\"  /><figcaption style=\"text-align: center;\"><em>Slack message report between Do Kwon and Daniel Shin. Source: Docdroid</em></figcaption></figure><p>The message report suggests the two co-founders were brainstorming strategies to increase investor interest in the Terra blockchain. However, Kwon showed the intention of influencing transactions to create a more appealing image:</p><blockquote>“I can just create fake transactions that look real.”</blockquote><p>Kwon further elaborates that these transactions will generate fees and can be gradually phased out as Chai grows.</p><p>He further asserted that it will be challenging for individuals to uncover the manipulation tactics.</p><p>“All the power to those that can prove its fake,” he states, adding that he will be making every effort to prevent the scheme being exposed:</p><blockquote>“Because I will try my best to make it indiscernable.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/54bab01a-616d-4bd5-900b-6e06ab517bac.png\"  /><figcaption style=\"text-align: center;\"><em>Slack conversation between Do Kwon and Daniel Shin on 5/9/2019. Source: Docdroid</em></figcaption></figure><p>However, Kwon <a href=\"https://www.docdroid.net/ogE2StR/govuscourtsnysd594150581-pdf#page=2\" target=\"_blank\" rel=\"noopener nofollow\">refutes</a> the evidence against him, alleging it was taken out of context</p><p>The objection goes on to claim that Kwon and Shin spoke about the possibility of staking LUNA tokens with validators and facilitating transactions between LUNA wallets, rather than creating counterfeit Chai transactions:</p><blockquote>“Finally, the SEC misstates evidence in its gratuitous effort to prejudice Mr. Kwon in a procedural motion having nothing to do with the merits (or lack of merit) of the SEC’s case.”</blockquote><p>“In other words, the SEC’s motion relies on misrepresentations about irrelevant evidence to support its spurious claim that it has been unable to get discovery from Mr. Kwon,” Kwon's lawyers added.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/do-kwon-converted-stolen-funds-from-luna-to-bitcoin-s-korean-prosecutors\">Do Kwon converted illicit funds from LUNA to Bitcoin: S.Korean prosecutors</a></em></strong></p><p>Meanwhile, Kwon's lawyers are pushing a US federal court to <a href=\"https://cointelegraph.com/news/do-kwon-sec-extradition-request-impossible-deposition-united-states\">reject the SEC's request</a> to extradite him to the US over the collapse of the Terra ecosystem.</p><p>Kwon's legal team declared the request as \"impossible\" due to him being detained in Montenegro with no scheduled release date after being found guilty of passport fraud.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\">Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-30T02:26:00.000Z",
    "title": "Popular Analyst Forecasts Potential $XRP Price Breakout as Crypto Market Moves Sideways",
    "url": "https://www.cryptoglobe.com/latest/2023/09/popular-analyst-forecasts-potential-xrp-price-breakout-as-crypto-market-moves-sideways/",
    "description": "Most cryptocurrencies have been trading sideways over the last few weeks with a few notable exceptions including MakerDAO’s $MKR. The native token of the XRP Ledger, $XRP, has been following the path of most other digital assets, but could soon breakout as well, according to a crypto analyst. Popular analyst CoinsKid has recently said in […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-30T02:40:23.000Z",
    "title": "Another Ether ETF filed by Invesco Galaxy",
    "url": "https://www.cryptopolitan.com/another-ether-etf-filed-by-invesco-galaxy/",
    "description": "In a filing made on Friday, Invesco, a fund group that manages nearly $1.6 trillion in assets, advanced into the crypto domain. Recently, the Invesco Galaxy Ethereum ETF&#8217;s purpose was made public. Galaxy Digital Funds will function as the execution agent and manage the sale of ether in this strategic move. Notably, this ETF will ... <a title=\"Another Ether ETF filed by Invesco Galaxy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/another-ether-etf-filed-by-invesco-galaxy/\" aria-label=\"More on Another Ether ETF filed by Invesco Galaxy\">Read more</a>"
  }
]