[
  {
    "source": "Cointelegraph",
    "date": "2023-07-11T07:45:20.000Z",
    "title": "UK FCA shuts down 26 crypto ATMs following coordinated investigation",
    "url": "https://cointelegraph.com/news/uk-fca-shuts-down-26-illegal-crypto-atms",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/d3abab97-24be-457e-acf7-5ac51544c3b9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The FCA — along with other law enforcement agencies — investigated 36 crypto ATM locations using powers under the Money Laundering Regulations 2017.</p>\n                    <p><p>The United Kingdom’s financial regulator, the Financial Conduct Authority (FCA), “disrupted” 26 of the 34 cryptocurrency ATMs it visited and inspected since the start of 2023.</p><p>On Feb. 14, the FCA gave an <a href=\"https://cointelegraph.com/news/uk-fca-to-take-action-against-unregistered-illegal-cryptocurrency-atms\">ultimatum to all crypto ATM operators in the UK</a> — to either comply with regulations or wind down illegal operations. Following the warning, the FCA — along with other law enforcement agencies — investigated 36 crypto ATM locations using powers under the Money Laundering Regulations 2017.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#Crypto</a> ATMs operating without FCA registration are illegal. The action we’ve taken over the past few months and wider work shows that we will act to stop illegal activity. <a href=\"https://twitter.com/hashtag/cryptocurrency?src=hash&amp;ref_src=twsrc%5Etfw\">#cryptocurrency</a> <a href=\"https://t.co/KnMhiKAt21\">https://t.co/KnMhiKAt21</a></p>&mdash; Financial Conduct Authority (@TheFCA) <a href=\"https://twitter.com/TheFCA/status/1654413022327197696?ref_src=twsrc%5Etfw\">May 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Speaking against the use of all crypto ATMs, Steve Smart, joint executive director of enforcement and market oversight at the FCA, stated:</p><blockquote>“If you use a crypto ATM in the UK, you are using a machine that is operating illegally and you may be handing your money over to criminals.”</blockquote><p>Smart further clarified that victims of scams involving the crypto or Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ATMs “will not be protected” by the government or the operator of the machines. Out of the lot, 18 locations were inspected in May and June, right when the FCA publicly <a href=\"https://cointelegraph.com/news/uk-financial-watchdog-announces-inspections-against-sites-with-suspected-illegal-crypto-atms\">announced the commencement of the inspection drive</a>.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/uk-government-moves-forward-bill-aimed-empowering-authorities-to-seize-crypto\"><strong><em>UK government moves forward on bill aimed at empowering authorities to seize crypto</em></strong></a></p><p>All crypto exchanges and ATMs must be registered with the FCA and comply with the UK Money Laundering Regulations. On July 8, Clive Police Department released a <a href=\"https://www.facebook.com/ClivePoliceDepartment/posts/pfbid0egFuCCpw1AKXzrd8Y4Cb4wTMenCWRN1ACV1qj18v3QzzMaHcFBdJFiFCVbytjJGgl\" target=\"_blank\" rel=\"noopener nofollow\">report</a> detailing how a crypto scammer, called up an unsuspecting victim pretending to represent law enforcement and managed to steal $6,000 while threatening an arrest warrant.</p><p>Scammers utilize fear tactics and impersonate law enforcement officials to deceive unsuspecting individuals into transferring funds through crypto ATMs. However, it is important to note that law enforcement agencies never contact individuals demanding payment over the phone or via crypto.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\"><strong><em>Should you ‘orange pill’ children? The case for Bitcoin kids books</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-11T07:45:00.000Z",
    "title": "US Lawmakers Call On SEC, DOJ To Investigate Prometheum",
    "url": "https://cryptodaily.co.uk/2023/07/us-lawmakers-call-on-sec-doj-to-investigate-prometheum",
    "description": "<p>Six members of the United States Congress have called on the Department of Justice (DOJ) and the United States Securities and Exchange Commission (SEC) to investigate crypto firm Prometheum.&nbsp;</p>\n<p>The members have alleged that the firm has close ties with the Chinese Communist Party (CCP).&nbsp;</p>\nRepublicans Step Up Attack On Prometheum&nbsp;\n<p>The Republican members of Congress stated that the firm&rsquo;s co-CEO, Aaron Kaplan, may have potentially given false testimony during a Jun. 13 hearing on regulatory clarity in the crypto space. They also alleged that the company may have violated securities laws. The lawmakers stated in a letter written on Jul. 10, stating,&nbsp;</p>\n\n<p>&ldquo;We write to express great concern that Prometheum Inc. (Prometheum) may have provided false testimony to Congress or violated United States securities laws.&rdquo;</p>\n\n<p>The lawmakers further claimed that Prometheum was connected with investors that had close ties with the Chinese Communist Party (CCP), the Shanghai Wanxiang Blockchain and HashKey Digital Asset Group. The group of lawmakers, led by Alabama Senator Tommy Tuberville, called on Securities and Exchange Commission Chair Gary Gensler and Attorney General Merrick Garland to look into the matter. Apart from Tuberville, the letter was signed by Laine Luetkemeyer, R-Miss., Barry Loudermilk, R-Ga., Ralph Norman, R-S.C., Byron Donalds, R-Flor., and Mark Alford, R-Missouri.</p>\nWhat Did Kaplan Say?&nbsp;\n<p>On Jun. 13, Kaplan, the co-founder, and co-CEO of Prometheum, appeared before the US House to discuss regulatory clarity in the crypto space. During the hearing, Kaplan had argued that multiple frameworks put out by the Securities and Exchange Commission had laid out a clear path for crypto firms operating in the United States. Kaplan went so far as to call the Securities and Exchange Commission &ldquo;the most capable financial markets regulatory agency in the world.&rdquo;</p>\n<p>However, what caught the attention of Republican lawmakers were allegations that the company had links with the Chinese Communist Party. Tuberville alleged that Kaplan, during his testimony, had said that Prometheum was developed independently of Wanxiang and HashKey. Kaplan stated in his testimony,&nbsp;</p>\n\n<p>\"In December 2018, as part of the investment from Hashkey into Prometheum, Prometheum, and Wanxiang agreed to jointly develop a blockchain trading system. Thereafter, in approximately one (1) year, it became clear to Prometheum that joint development was not viable. Upon such realization, Prometheum started to independently develop its own platform. All servers, code, data, and proprietary technology were created independently of Wanxiang and its affiliates. Prometheum does not use any resource, code, or other assets from Wanxiang or its affiliates in any of its systems.\"</p>\n\n<p>According to Kaplan, Prometheum terminated all strategic relationships with Shanghai Wanxiang Blockchain in October 2021.&nbsp;</p>\n\n<p>&ldquo;Prometheum formally terminated all co-development work and strategic relationships with Shanghai Wanxiang Blockchain and its affiliates in October 2021 in an Omnibus Agreement, which was filed with the SEC in November 2021.&rdquo;</p>\n\n<p>However, lawmakers alleged that this contradicted the information that the firm had provided in filings with the SEC, stating that Prometheum still relied on the HashKey partnership, as shown by the SEC filings from 2020-2021. Furthermore, they questioned why Prometheum did not make clear in the filings that the company was developing its own technology platform, entirely independent of its Chinese partners.</p>\n<p>The senators have yet to give the Securities and Exchange Commission and the Department of Justice a deadline to respond but have said they hope to hear from them soon.&nbsp;</p>\nPrometheum Responds&nbsp;\n<p>While Kaplan has not commented on the developments so far, a Jun. 23 op-ed by Kaplan and co-CEO Benjamin Kaplan has claimed that Tuberville&rsquo;s concerns regarding Prometheum and its alleged ties to China were without merit and relied on old information.&nbsp;</p>\n\n<p>&ldquo;We formally terminated all co-development work and strategic relationships with Wanxiang and its affiliates on Oct. 21, 2021. Prometheum has severed all intellectual property and technology ties to Wanxiang, giving it and its affiliates no access to any information that could expose the U.S. or its citizens to risk.&rdquo;</p>\n\nConcerns About China\n<p>Republican lawyers have consistently raised concerns about companies having ties with China-based entities or its government when it came to laws and regulations regarding digital assets. Minnesota Rep Tom Emmer and Former Senator Pat Toomey had issued warnings about the use of China&rsquo;s Digital Yuan during the Beijing Winter Olympics. The current letter to the Securities and Exchange Commission and the Department of Justice comes a month after Tuberville brought forward a bill to ban companies from China from acquiring a stake in American digital asset companies. The bill was co-sponsored by Sen. Kristen Gillibrand, D-N.Y.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-11T08:00:34.000Z",
    "title": "Japanese Gaming Giant Sega to Pull Support From ‘Boring’ Blockchain Games",
    "url": "https://news.bitcoin.com/japanese-gaming-giant-sega-to-pull-support-from-boring-blockchain-games/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_635526365-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Japanese Gaming Giant Sega to Pull Support From &#039;Boring&#039; Blockchain Games\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_635526365-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_635526365-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_635526365-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_635526365-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_635526365-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_635526365-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_635526365.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Sega, one of the biggest game developers in Japan, has recently announced changes regarding its blockchain and Web3 gaming policy. The company announced it would not involve its largest franchises in blockchain initiatives, avoiding a possible devaluation of its intellectual properties (IPs), shelving in-house developed games and developments from third parties. Sega Changes Its Blockchain [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T08:04:55.000Z",
    "title": "Ripple Recognized for CBDC Innovation, Receives Rare Award",
    "url": "https://www.cryptopolitan.com/ripple-recognized-for-cbdc-innovation/",
    "description": "Ripple Labs, the American blockchain payments firm, has received a prestigious award from Currency Research for its outstanding contributions to the development of Central Bank Digital Currency (CBDC). The rare accolade was presented to Ripple Labs at the recently concluded 2023 Digital Currency Conference, where the company was honored for its Advancement in Digital Currency ... <a title=\"Ripple Recognized for CBDC Innovation, Receives Rare Award\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-recognized-for-cbdc-innovation/\" aria-label=\"More on Ripple Recognized for CBDC Innovation, Receives Rare Award\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-11T08:08:09.000Z",
    "title": "Arkham is allegedly privacy trafficking, crypto reporter claims",
    "url": "https://crypto.news/arkham-is-allegedly-privacy-trafficking-crypto-reporter-claims/",
    "description": "According to crypto reporter Colin Wu, Binance’s popular IEO project, Arkham Intelligence, has been collecting private user data. Per the tweet, Arkham’s blockchain intelligence platform has been leaking a huge number of users’ private email addresses, calling it “personal privacy&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-11T07:55:02.000Z",
    "title": "InQubeta vs. Bitcoin Cash: comparing potential ROI in 2023",
    "url": "https://crypto.news/inqubeta-vs-bitcoin-cash-comparing-potential-roi-in-2023/",
    "description": "This article compares InQubeta and Bitcoin Cash to determine which one has the potential to deliver a higher return on investment (ROI) in 2023"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-11T07:51:19.000Z",
    "title": "Korean court conducts preliminary hearing for Terra co-founder ",
    "url": "https://crypto.news/korean-court-conducts-preliminary-hearing-for-terra-co-founder/",
    "description": "The Seoul Southern District Court has conducted a preliminary hearing for Terraform Labs’ co-founder Daniel Shin and several other former project employees. Shin, the co-founder of Terraform Labs and former CEO of Chai Corporation, is set to undergo his initial&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-11T07:55:52.000Z",
    "title": "PEPE Potential Rebound: Key Details You Shouldn’t Miss",
    "url": "https://www.newsbtc.com/news/pepe-potential-rebound-key-details-you-shouldnt-miss/",
    "description": "PEPE recently reached a new peak, driven by the significant hype surrounding Bitcoin Exchange-Traded Funds (ETFs). However, as the initial excitement surrounding ETFs subsided, Bitcoin (BTC) experienced a period of fluctuation.  Notably, during this time, PEPE has been gradually making lower highs. Amidst these fluctuations, it becomes essential to examine the underlying factors that have contributed to the declining trend in PEPE&#8217;s price perfomance. Are there external market forces at play, or is it indicative of a broader shift in the cryptocurrency landscape? Additionally, how will this development impact the future trajectory of PEPE and other cryptocurrencies? PEPE Price Performance: From Highs To Fluctuations PEPE recently reached a new high of $0.00000190. However, its current price on CoinGecko stands at $0.00000152, reflecting a modest 4.3% rally in the past 24 hours. Nevertheless, over the course of the last seven days, PEPE has experienced a significant decline of 13%. Source: Coingecko Technical indicators further emphasize the shift in PEPE&#8217;s price trajectory. A PEPE price report highlights that various indicators have flashed sell signals. Notably, the Relative Strength Index (RSI) has made lower highs, indicating a decline in buying pressure over the past few days. Total market cap of cryptocurrencies currently at $1.16 billion. Chart: TradingView.com Moreover, the On Balance Volume has eased, suggesting a decrease in demand, while the Average Directional Index (ADX) has dropped below 20, indicating a lack of a strong trend for PEPE.  These technical signals hint at the challenges PEPE has faced in the face of its recent fluctuations. Altcoins&#8217; Massive Pullbacks Amidst Bitcoin&#8217;s Extended Consolidation Meanwhile, Bitcoin (BTC) has entered a phase of extended consolidation, with its price fluctuating above the $30,000 mark for nearly two weeks. This prolonged period of stability, coupled with intermittent fluctuations, has had a cascading effect on the broader cryptocurrency market, leading to significant pullbacks in most altcoins, including PEPE. BTC&#8217;s status as the leading cryptocurrency makes its price movements a crucial factor influencing the market sentiment and performance of other digital assets. When Bitcoin experiences extended consolidation, investors and traders often exercise caution and become more hesitant to make significant moves. PEPE seven-day price action. Source: Coingecko As a result, altcoins, which rely on BTC&#8217;s stability and positive market sentiment, tend to be more susceptible to pullbacks and corrections. The pullbacks in altcoins have been notable, with many experiencing substantial declines in value during this period of Bitcoin&#8217;s consolidation. The high correlation between Bitcoin and altcoins like PEPE exacerbates the impact of the crypto&#8217;s fluctuations on their prices. As the alpha coin&#8217;s consolidation continues, closely monitoring its price movements and assessing the subsequent impact on altcoins and meme coins like PEPE becomes paramount for market watchers. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from PBS"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-11T08:08:15.000Z",
    "title": "Terra Classic Validator Takes Bold Step: Burning 100% of Commission to Drive LUNC to $1",
    "url": "https://www.crypto-news-flash.com/terra-classic-validator-takes-bold-step-burning-100-of-commission-to-drive-lunc-to-1/?utm_source=rss&utm_medium=rss&utm_campaign=terra-classic-validator-takes-bold-step-burning-100-of-commission-to-drive-lunc-to-1",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"The long-awaited LUNC/USTC swaps may soon be available on TerraSwap, which would be great for the Terra Classic (LUNC) community.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-1536x864.png 1536w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />The operator of the community validator at Terra Classic is committed to burning 100% of its commission throughout the rest of the year.  The community validator showed support for Binance and its participation in burning LUNC tokens while urging other validators to do the same.  According to a recent announcement made by a Terra Classic [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-11T08:01:21.000Z",
    "title": "Discover Golteum (GLTM): The Secure and Profitable Alternative to Stellar (XLM) and Filecoin (FIL) for Crypto Investors",
    "url": "https://www.crypto-news-flash.com/discover-golteum-gltm-the-secure-and-profitable-alternative-to-stellar-xlm-and-filecoin-fil-for-crypto-investors/?utm_source=rss&utm_medium=rss&utm_campaign=discover-golteum-gltm-the-secure-and-profitable-alternative-to-stellar-xlm-and-filecoin-fil-for-crypto-investors",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T122920.547.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T122920.547.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T122920.547-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T122920.547-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Investors are constantly seeking the next big opportunity that promises significant returns. Golteum (GLTM) emerges as a standout contender, offering a unique combination of bullish projection, a groundbreaking presale, and a utility token that sets it apart from other cryptocurrencies like Stellar (XLM) and Filecoin (FIL). Golteum (GLTM) emerges as a force to be reckoned [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-11T08:00:47.000Z",
    "title": "As The Growth of Cardano (ADA) and Ripple (XRP) Declines, InQubeta (QUBE) presale generates buzz among crypto whales",
    "url": "https://www.crypto-news-flash.com/as-the-growth-of-cardano-ada-and-ripple-xrp-declines-inqubeta-qube-presale-generates-buzz-among-crypto-whales/?utm_source=rss&utm_medium=rss&utm_campaign=as-the-growth-of-cardano-ada-and-ripple-xrp-declines-inqubeta-qube-presale-generates-buzz-among-crypto-whales",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-92.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-92.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-92-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-92-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As crypto investors seek new opportunities, the growth of established projects like Cardano (ADA) and Ripple (XRP) seems to be declining. However, amidst this changing landscape, a new player is generating buzz among crypto enthusiasts and industry insiders. InQubeta (QUBE), the world&#8217;s first crypto crowdfunding platform that enables fractional investment in AI startups, is capturing [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-11T08:03:09.000Z",
    "title": "Crypto ATMs Pose Threat: Britain’s FCA Stops 26 Machines",
    "url": "https://coinedition.com/crypto-atms-pose-threat-britains-fca-stops-26-machines/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Top-Cryptocurrencies-in-The-Red.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Top Cryptocurrencies in The Red\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Top-Cryptocurrencies-in-The-Red.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Top-Cryptocurrencies-in-The-Red-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Top-Cryptocurrencies-in-The-Red-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Top-Cryptocurrencies-in-The-Red-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Top-Cryptocurrencies-in-The-Red-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Top-Cryptocurrencies-in-The-Red-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Financial Conduct Authority (FCA) of Britain has decided to shut down 26 cryptocurrency ATMs across the nation alleging illegal services. The authority claimed that these machines have been functioning illegally offering cryptocurrencies, and warned investors that their money could be lost during crypto ATM transactions. The report dated July 11 stated that the FCA’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-atms-pose-threat-britains-fca-stops-26-machines/\">Crypto ATMs Pose Threat: Britain’s FCA Stops 26 Machines</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]