[
  {
    "source": "Decrypt",
    "date": "2023-08-15T22:48:56.000Z",
    "title": "Silvergate CEO Departs With Benefits as Bank Shutdown Continues",
    "url": "https://decrypt.co/152635/silvergate-ceo-departs-with-benefits-as-bank-shutdown-continues",
    "description": "The CFO is shipping out at the end of September, leaving only the former chief risk officer at the helm."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T23:05:32.000Z",
    "title": "US lawmakers urge SEC, FINRA on Prometheum approval",
    "url": "https://www.cryptopolitan.com/us-lawmakers-sec-finra-prometheum-approval/",
    "description": "Mounting pressure descends on the Securities and Exchange Commission (SEC) and Financial Industry Regulatory Authority (FINRA) as prominent figures from the House Financial Services Committee demand clarity over the somewhat controversial granting of a special purpose broker-dealer (SPBD) license to Prometheum. Questionable License Approval Raises Eyebrows The committee, chaired by Patrick McHenry, joined by 20 ... <a title=\"US lawmakers urge SEC, FINRA on Prometheum approval\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-lawmakers-sec-finra-prometheum-approval/\" aria-label=\"More on US lawmakers urge SEC, FINRA on Prometheum approval\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T22:54:41.000Z",
    "title": "FDIC: Crypto crashes and climate chaos imperil banking",
    "url": "https://www.cryptopolitan.com/fdic-crypto-crashes-climate-chaos-banking/",
    "description": "As markets and Mother Nature unleash havoc, the Federal Deposit Insurance Corporation (FDIC) has cast a sharp spotlight on an alarming duo threatening the heart of American banking: the tumultuous world of cryptocurrency and the escalating perils of climate change. Unraveling the Complexity of Cryptocurrency Cryptocurrency&#8217;s allure is undeniable. Its recent surge has seen a ... <a title=\"FDIC: Crypto crashes and climate chaos imperil banking\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fdic-crypto-crashes-climate-chaos-banking/\" aria-label=\"More on FDIC: Crypto crashes and climate chaos imperil banking\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-15T23:00:52.000Z",
    "title": "Will Bitcoin Price Crash Similarly To 2019 And 2020?",
    "url": "https://www.newsbtc.com/news/bitcoin/will-bitcoin-price-crash-similarly-to-2019-and-2020/",
    "description": "Bitcoin price has mostly maintained the $29,000 level for the better part of the week. This points to low activity and momentum in the market, as well as a reluctance to engage in the digital asset at this point. One reason for this reluctance is the expectation that the Bitcoin price will see another crash before the bull market resumes. However, this crypto analyst explains why expectations may be dashed this time around. Bitcoin Price May Not See A Repeat Of 2019-2020 Before the 2020-2021 bull market kicked in, the Bitcoin price had seen a rollercoaster year. Mostly, the bear market had ravaged the digital asset causing it to fall more than 80% below its all-time high price at the time, and the crashes would continue well into 2020. Related Reading: Base TVL Surges 900% In 2 Weeks, What’s Driving The Growth? Given the tendency of the Bitcoin price to follow previous trends, investors are understandably expecting a repeat of this trend. But pseudonymous crypto analyst “Tony The Bull” took to X (formerly Twitter) to use the ‘recency bias’ to explain why this may not happen. In the post, the crypto analyst used an analogy of a town that had not had a flood before, suddenly experiencing a flash storm rainstorm. Given that it had not happened before, businesses were caught unaware without flood insurance. However, going forward, the businesses begin to expect another flood and as such, they get flood insurance. The analyst explained that even though measures would be put in place to decrease the chances of such as flood happening again, people continued to operate with the knowledge of the impact of the flood. “It is the brain’s way to going with the most easily accessible information, which is the one that has most recently impacted you in a significant way,” the analyst said. “This is what’s called recency bias.” BTC movement over the last five years &#124; Source: BTCUSD on Tradingview.com This recency bias, when applied to Bitcoin, shows investors are expecting a repeat of 2019-2020 because it is the most recent bear market. Hence, investors are operating with the knowledge of the most recent impactful event. “But much like the flood never happened before, we had a once in a lifetime pandemic. The probability is rather low we’ll see the same price action as 2019 and 2020,” Tony The Bull explains. BTC Price Sticking To Previous Trends? The analyst’s position is backed up by the fact that the Bitcoin price has continuously deviated from historical trends during this cycle. One example is that while the digital asset’s price did fall to around 70% below its $69,000 all-time high, it recovered to almost 50% below its ATH. Related Reading: Regulatory Pressure Mounts On Worldcoin, Can WLD Price Recover? However, a similar trend was recorded in 2019 when BTC’s price recovered above $11,000 toward the middle of the year. But by the end of the year, had lost about half of those gains. With the rest of the gains being wiped out in early 2020. If BTC does end up following the previously established trend though, then the digital asset’s price could fall as low as $12,000 before the next bull run begins. However, it is now a waiting game to see what ends up happening. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]