[
  {
    "source": "CoinDesk",
    "date": "2023-09-21T10:21:44.000Z",
    "title": "BNB, XRP Lead Slide in Crypto Majors as Mt. Gox's Repayment Delay Fails to Bouy Bitcoin Prices",
    "url": "https://www.coindesk.com/markets/2023/09/21/bnb-xrp-lead-slide-in-crypto-majors-as-mt-goxs-repayment-delay-fails-to-bouy-bitcoin-prices/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "“We still believe that the chances of further declines are higher for now,” one analyst said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-21T10:28:37.000Z",
    "title": "You can build your own Trezor but here’s the price: DIY wallet engineer",
    "url": "https://cointelegraph.com/news/trezor-home-made-wallet-builder",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/5e83db64-baa4-47a1-b506-f8c0fdf8dc08.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>An electronics design manager who made his own Trezor One has assessed the difficulty of building a DIY crypto wallet from scratch.</p>\n                    <p><p>The open-source nature of many hardware cryptocurrency wallets allows one to build a do-it-yourself (DIY) wallet like Trezor from scratch, but it requires certain skills.</p><p>Florin Cocos, an electronics design manager from Romania, built his own DIY Trezor with the wallet’s open-source code in 2018, without having access to a “real” Trezor device.</p><p>On his YouTube channel, <em>Voltlog, </em>Cocos <a href=\"https://youtu.be/mZmv4wG6_PE?si=aXotRNunbahK9Gvk\" target=\"_blank\" rel=\"noopener nofollow\">demonstrated</a> the process of creating the DIY Trezor Model One, using electronics components purchased from distributors like Farnell. The engineer specifically used a Farnell microcontroller and a printed circuit board (PCB) ordered from a production house in China, extracted from a Gerber file available on Trezor’s GitHub.</p><p>“The parts can be purchased from any reputable distributor like Farnell, DigiKey, RS, Newark, TME. It really depends on your location, get them from your local distributor. You can get the OLED screen from AliExpress or eBay,” Cocos <a href=\"http://www.voltlog.com/voltlog-154-making-my-own-trezor-crypto-hardware-wallet/\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> on his <em>Voltlog</em> blog.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/a395443c-fbf6-4e8d-920e-3e1686ab90e4.png\"  /><figcaption style=\"text-align: center;\"><em>PCBs used by Voltlog for building a DIY Trezor wallet. Source: YouTube</em></figcaption></figure><p>Five years after releasing his DIY Trezor video, Cocos is still enthusiastic about his DIY crypto device. “I have used the device and I would always trust my DIY device over a marketplace-bought one,” the engineer told Cointelegraph in an interview on Sept. 19.</p><h2>It took roughly 10 hours for Voltlog to set up the DIY Trezor</h2><p>Trezor’s market availability wasn’t the main reason for Cocos to build the DIY wallet, though: the engineer was rather focused on spreading the word about open-source projects.</p><p>“Open-source designs are gaining more and more popularity and in my opinion, this is the future,” Cocos said, adding:</p><blockquote>“You have full control over the security aspects and it's always fun to build something yourself. For me personally, the idea of making something useful, myself, contributes more than anything else to the decision to start such a project.”</blockquote><p>The entire process of building and installing firmware on the DIY Trezor wallet took roughly 10 hours for Cocos, minus time spent on receiving the PCBs and other ordered components.</p><p>“It took me maybe two or three hours to evaluate the project and generate the necessary Gerber files for uploading to a PCB manufacturing service and ordering all of the required parts from known distributors like Mouser or Digikey,” the design manager said. After receiving the PCBs, it took him roughly five hours to assemble the PCB. flash it with firmware and get it running, Cocos noted.</p><p>Building hardware for the DIY Trezor was the easiest part, the engineer told Cointelegraph, adding that flashing the firmware and getting it to work with the application was “slightly more challenging.”</p><h2>How difficult is it to build a DIY Trezor for an average user?</h2><p>As the whole building process didn’t take too much time, one may think that creating a DIY Trezor might be not that difficult for an average user, but that’s not the case, at least according to Cocos.</p><p>According to the engineer, it’s “nearly impossible” to build such a project for the average user without any knowledge of electronics. “If 10 is the most difficult, then I would rate this a 10,” Cocos said while trying to estimate the difficulty of building a DIY Trezor for an average user.</p><p>He added that the process could be simplified but at the cost of significant security risks related to vulnerabilities in the supply chain and manufacturing.</p><p>“Things could be improved by creating a ‘makers pack’ for the project, with all of the required manufacturing files in their specific format and just uploading that to one of the PCB and PCBA prototyping services available online. However while at that stage it would be a difficulty level of roughly 3 on a scale of 1-10, you lose control over the supply chain and manufacturing step, so there is an added security risk,” the engineer stated.</p><p>Cocos suggested that efforts to build a DIY Trezor without proper knowledge could result in significant security risks, adding:</p><blockquote>“I would not recommend building such a hardware wallet if you are not experienced with electronics and specifically with soldering small surface mount components. If that's the case, the result is likely just the magic smoke escaping or at best a brick that does nothing.”</blockquote><p>Cocos — who described himself as an occasional user of cryptocurrency — holds a bachelor's in Electrical Engineering and has been designing and building electronics professionally for 10 years and as a hobby for more than 15 years. He believes that one doesn’t need to be an expert like him to build a DIY Trezor, but it does still require some expertise.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ledger-announces-u-s-paypal-integration-lets-users-buy-crypto-from-within-app\"><strong><em>Ledger announces U.S. PayPal integration, lets users buy crypto from within app</em></strong></a></p><p>“Just one or two years of tinkering with electronics at a moderately fast pace, from a moderately technically skilled person should be enough to greatly increase the chances of success,” Cocos stated.</p><p>As previously reported, some cryptocurrency users have <a href=\"https://cointelegraph.com/news/trusted-seller-vends-fake-trezor-wallets-stealing-crypto-kaspersky\">fallen victim to fake hardware wallets</a> by buying the devices from other sources than the direct manufacturer or the official vendor. As such, hardware wallet makers like Ledger and Trezor have been always urging their customers to only buy hardware wallets from the official vendors.</p><p>As there are some regions where hardware wallets cannot be shipped due to issues like sanctions, companies like Trezor suggested that the devices’ open-source nature could be a solution. “Trezor is fully open-source, anyone can build their own using the schematics and bill of materials on Github,” Trezor’s Bitcoin analyst Josef Tetek told Cointelegraph.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-crypto-deaths/\"><strong><em>Big Questions: What’s with all the crypto deaths?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-21T10:25:22.000Z",
    "title": "Optimism Foundation $157M token sale impacts market, OP dips 3%",
    "url": "https://cryptoslate.com/optimism-foundation-157m-token-sale-impacts-market-op-dips-3/",
    "description": "<p>Ethereum-based (ETH) layer-2 network Optimism said it has entered into a private token sale of approximately 116 million OP tokens (worth $157 million) with seven purchasers, according to a Sept. 20 update on its governance platform. &#8220;Starting today, there will be several transactions totaling approximately 116M OP tokens,&#8221; Optimism Foundation wrote in a Sept. 21 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/optimism-foundation-157m-token-sale-impacts-market-op-dips-3/\">Optimism Foundation $157M token sale impacts market, OP dips 3%</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-21T10:27:03.000Z",
    "title": "Ripple CEO Brad Garlinghouse Accuses SEC Chair Gary Gensler of Bullying Tactics",
    "url": "https://www.cryptoglobe.com/latest/2023/09/ripple-ceo-brad-garlinghouse-accuses-sec-chair-gary-gensler-of-bullying-tactics/",
    "description": "Brad Garlinghouse, the CEO of FinTech firm Ripple Labs, has openly criticized the U.S. Securities and Exchange Commission (SEC) and its Chairman, Gary Gensler. While speaking at Messari’s Mainnet 2023 event (September 20 – 22, 2023, New York City), Garlinghouse labeled Gensler as a bully, accusing him of prioritizing power and politics over effective regulation. […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T10:30:00.000Z",
    "title": "Authors Guild and Prominent Writers Launch AI Lawsuit Against OpenAI",
    "url": "https://www.cryptopolitan.com/prominent-writers-ai-lawsuit-against-openai/",
    "description": "In a legal move, the Authors Guild, in collaboration with 17 distinguished authors, including George R R Martin, John Grisham, and Jodie Picoult, has initiated a class-action lawsuit against OpenAI, accusing the tech giant of copyright infringement. The suit, filed in the Southern District of New York, aims to address the unauthorized use of authors&#8217; ... <a title=\"Authors Guild and Prominent Writers Launch AI Lawsuit Against OpenAI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/prominent-writers-ai-lawsuit-against-openai/\" aria-label=\"More on Authors Guild and Prominent Writers Launch AI Lawsuit Against OpenAI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T10:15:35.000Z",
    "title": "Aptos Labs partners with Coinbase Pay to streamline Web3 onboarding",
    "url": "https://www.cryptopolitan.com/aptos-labs-partners-with-coinbase-pay-to-streamline-web3-onboarding/",
    "description": "In a significant move to simplify the entry into the web3 ecosystem, Aptos Labs has integrated Coinbase Pay into its crypto wallet, Petra. This collaboration aims to provide a seamless experience for users to exchange value within the Aptos ecosystem, whether they are accessing Petra via a mobile device or a web browser. The integration ... <a title=\"Aptos Labs partners with Coinbase Pay to streamline Web3 onboarding\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-labs-partners-with-coinbase-pay-to-streamline-web3-onboarding/\" aria-label=\"More on Aptos Labs partners with Coinbase Pay to streamline Web3 onboarding\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-21T10:36:30.000Z",
    "title": "Mt. Gox extends repayment deadline by one year",
    "url": "https://crypto.news/mt-gox-extends-repayment-deadline-by-one-year/",
    "description": "Mt. Gox&#8217;s trustee, Nobuaki Kobayashi, announced that the deadline for the exchange&#8217;s scheduled repayments had been extended by 12 months. In a Sept. 21 letter, Nobuaki Kobayashi, the Rehabilitation Trustee for the once-dominant Bitcoin exchange Mt. Gox, announced a one-year&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-21T10:30:54.000Z",
    "title": "Tether resumes lending after promise to reduce it to zero",
    "url": "https://crypto.news/tether-resumes-lending-after-promise-to-reduce-it-to-zero/",
    "description": "Tether Holdings has resumed lending services in its stablecoin less than a year after promising to “reduce lending to zero.” According to the Wall Street Journal, the company was supposed to reduce the issuance of loans to zero in 2023.&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-21T10:26:36.000Z",
    "title": "Crypto prices barely stir as Fed leaves interest rates unchanged",
    "url": "https://crypto.news/crypto-prices-barely-stir-as-fed-leaves-interest-rates-unchanged/",
    "description": "The crypto market has reacted little to the U.S. Federal Reserve’s decision to leave interest rates unchanged, even as it hinted at a final hike before year’s end. On Sept. 20, the U.S. Federal Reserve (Fed) Chair Jerome Powell held&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-21T10:13:14.000Z",
    "title": "FLEX plunges 10% as Hodlnaut opposes OPNX’s $30m offer",
    "url": "https://crypto.news/flex-plunges-10-as-hodlnaut-opposes-opnxs-30m-offer/",
    "description": "Hodlnaut&#8217;s interim judicial managers call FLEX token &#8220;illiquid&#8221; as its price crashed 90% since August 2023. Crypto bankruptcy claims exchange OPNX is unlikely to become the new owner of the embattled crypto lending firm Hodlnaut as its interim judicial managers&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-21T10:23:59.000Z",
    "title": "Mt. Gox Delays Repayment Deadline for Creditors Holding Bitcoin (BTC) by Another Year",
    "url": "https://www.crypto-news-flash.com/mt-gox-delays-repayment-deadline-for-creditors-holding-bitcoin-btc-by-another-year/?utm_source=rss&utm_medium=rss&utm_campaign=mt-gox-delays-repayment-deadline-for-creditors-holding-bitcoin-btc-by-another-year",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Primakov-Mt.-Gox.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Primakov-Mt.-Gox.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Primakov-Mt.-Gox-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Primakov-Mt.-Gox-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Primakov-Mt.-Gox-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Mt. Gox has extended its deadline for repayments by a year to Oct. 31, 2024, from Oct. 31, 2023. This delay is a relief for Bitcoin holders who are concerned about the sheer amount of BTC coins that might be released to the open market. After nearly a decade of waiting, some Mt. Gox creditors [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-21T10:25:01.000Z",
    "title": "Cryptography in Cryptocurrencies: A Simplified Guide – Part 1",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/cryptography-in-cryptocurrencies-a-simplified-guide-part-1/",
    "description": "<p>Behind the scenes, a powerful ally is at work to ensure the safety and integrity of digital assets, cryptography. Is one of the great strengths of this industry. So, if you really want to understand how cryptos work, you need to know about certain cryptographic methods and concepts. In this article, we will make it [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/cryptography-in-cryptocurrencies-a-simplified-guide-part-1/\">Cryptography in Cryptocurrencies: A Simplified Guide &#8211; Part 1</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-21T10:22:17.000Z",
    "title": "Maker (MKR) Bulls Rally to a 12-Month High: Will the Resistance Hold?",
    "url": "https://coinedition.com/maker-mkr-bulls-rally-to-a-12-month-high-will-the-resistance-hold/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Maker-Price-Analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Crypto Community Disagrees as MakerDAO Will Allow MKR to Borrow DAI\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Maker-Price-Analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Maker-Price-Analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Maker-Price-Analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Maker-Price-Analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Maker-Price-Analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Maker-Price-Analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In the previous 24 hours, bearish momentum in the Maker (MKR) market was neutralized when support at the intraday low of $1,296.53 propped up the price. This support level was a significant barrier to further decline, signaling a possible change in market mood. Consequently, buyers restored confidence and began to join the market, causing the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/maker-mkr-bulls-rally-to-a-12-month-high-will-the-resistance-hold/\">Maker (MKR) Bulls Rally to a 12-Month High: Will the Resistance Hold?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]