[
  {
    "source": "Bitcoin.com",
    "date": "2024-01-13T02:00:00.000Z",
    "title": "Ark Invest Now Sees Higher Probability of Bitcoin Soaring to $1.5 Million, CEO Says",
    "url": "https://news.bitcoin.com/ark-invest-now-sees-higher-probability-of-bitcoin-soaring-to-1-5-million-ceo-says/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/cathie-wood-price-following-etf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ark Invest Now Sees Higher Probability of Bitcoin Soaring to $1.5 Million, CEO Says\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/cathie-wood-price-following-etf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cathie-wood-price-following-etf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cathie-wood-price-following-etf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cathie-wood-price-following-etf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cathie-wood-price-following-etf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cathie-wood-price-following-etf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cathie-wood-price-following-etf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Ark Invest CEO Cathie Wood has doubled down on her bullish bitcoin forecasts, now seeing a higher probability of the price of bitcoin soaring to $1.5 million per coin. She emphasized that the approval of spot bitcoin exchange-traded funds (ETFs) by the U.S. Securities and Exchange Commission (SEC) has raised the probability of her bull [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-13T02:00:19.000Z",
    "title": "Bitcoin Price Suffers Post-Spot ETF Blues, Drops 7% To $43,200",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-suffers-post-spot-etf-blues-drops-7-to-43200/",
    "description": "The introduction of Bitcoin (BTC) exchange-traded funds (ETFs) has triggered a significant sell-off, leading to a sharp decline in the Bitcoin price. After gaining approval and commencing trading on Thursday, the ETFs have prompted a &#8220;sell the news&#8221; event, causing Bitcoin&#8217;s value to plummet from its initial trading price of $46,500 at the time of approval to a low of $43,200 within a matter of hours on Friday. Over the past 24 hours, Bitcoin, the largest cryptocurrency by market capitalization, has experienced a 7% drop. Its gains over the past 30 days have been limited to a mere 4%, erasing much of the progress made during that period.  Additionally, as selling pressure continues to mount following the approval, there are indications that the Bitcoin price may face further downward pressure. Bitcoin Price Under Pressure CryptoQuant analyst J.A. Maartunn observed significant sell orders in Bitcoin&#8217;s two-week chart on Wednesday. Notably, three clusters of sell orders were positioned between $46,100 and $48,000, comprising stacks of 755, 1,031, and 794 BTC, respectively. According to the CryptoQuant analyst, such patterns are typically associated with market tops, unless these orders are later withdrawn or executed. Related Reading: Cardano’s 2024 Kickoff: First Two Weeks Show Major Updates, Report This influx of sell orders may help explain the lackluster response to the ETF approvals until now, as it appears that selling pressure has been building up. However, the situation has intensified even further.  According to Maartunn, additional sell orders were detected on Friday, indicating that the seller is not yet finished. Two substantial sell orders have been placed just above the current Bitcoin price: one for 894 BTC at $44,000 and another for 1,071 BTC at $45,100. These developments suggest that market participants are taking advantage of the ETF news to offload their Bitcoin holdings, leading to increased selling pressure and a subsequent price decline.  The market&#8217;s stabilization following this period of heightened selling pressure remains uncertain. The introduction of ETFs was believed to bring about heightened institutional interest and potentially drive up the Bitcoin price.  However, it is important to note that the impact of these ETFs is expected to unfold over the long term, rather than being evident within days, weeks, or even months. It will likely take years to fully gauge the effects and consequences of ETF integration on the Bitcoin market. Bitcoin&#8217;s Bullish Structure Remains Intact Amidst the ongoing selling pressure, several support lines may potentially halt the downtrend and bring positive news for the Bitcoin price and BTC bulls. Although Bitcoin has already lost its $44,000 support level, there is another crucial threshold at $42,700 that could prevent further decline. If this level holds, there is a chance for Bitcoin to regain the $43,000 mark and reverse the downward momentum. If the $42,700 support is breached, additional support lines come into play. These include $42,300, $41,700, and $41,200, which act as the last barriers before a potential test of the $40,000 support level. The $40,000 mark holds significance as it represents the final support before a potential dip towards $38,000. Related Reading: Bitcoin Erases $49,000 ETF Rally As Coinbase Users Take To Selling However, there is a positive aspect for Bitcoin bulls to consider. The current bullish structure of the cryptocurrency remains intact as long as the dip does not breach the $29,900 mark. This level marked the beginning of the current bullish uptrend, and its preservation would ensure the maintenance of the overall positive market structure. Featured image from Shutterstock, chart from TradingView.com "
  }
]