[
  {
    "source": "Decrypt",
    "date": "2023-11-27T21:46:02.000Z",
    "title": "Pudgy Penguins Release Exclusive Walmart 'Influencer Box' for Cyber Monday",
    "url": "https://decrypt.co/207633/pudgy-penguins-release-exclusive-walmart-influencer-box-cyber-monday",
    "description": "The prominent Ethereum NFT project continues pumping out plush toys, serving up a Cyber Monday exclusive via Walmart."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-27T21:40:36.000Z",
    "title": "Bitcoin traders' bullish bias holds firm even as BTC price dips to $37K",
    "url": "http://cointelegraph.com/news/bitcoin-traders-bullish-bias-holds-as-btc-price-dips-37k",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/38629c27-2f62-4fd4-9285-05009907c32f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC's correction reveals a disconnect between pro traders' confidence and retail investors' skepticism amid regulatory shifts.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) briefly reached $38,000 on Nov. 24 but faced formidable resistance at the price level. On Nov. 27, Bitcoin price traded below $37,000, which is unchanged from a week ago. </p><p>What is eye catching is the unwavering strength of BTC derivatives, which signals that bulls remain steadfast with their intentions.</p><p>An intriguing development is unfolding in China as Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) trades below its fair value in the local currency, the Yuan. This discrepancy often arises due to differing expectations between professional traders engaged in derivatives and retail clients involved in the spot market.</p><h2>How have regulations impacted Bitcoin derivatives?</h2><p>To gauge the exposure of whales and arbitrage desks using Bitcoin derivatives, one must assess BTC options volume. By examining the put (sell) and call (buy) options, we can estimate the prevailing bullish or bearish sentiment.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/7f61a38f-c21f-4df7-ad5a-a40dd540aae7.png\"><figcaption style=\"text-align: center;\"><em>Deribit BTC options put-to-call volume ratio. Source: Laevitas.ch</em></figcaption></figure><p>Since Nov. 22, put options have consistently lagged behind call options in volume, by an average of 40%. This suggests a diminished demand for protective measures—a surprising development given the intensified regulatory scrutiny following <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-officials-announce-binance-settlement/amp\">Binance's plewith the U.S. Department of Justice</a> (DoJ) and the U.S. Securities and Exchange Commission's (SEC) <a href=\"https://cointelegraph.com/news/sec-sues-kraken-for-securities-laws-violations\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-sues-kraken-for-securities-laws-violations/amp\">lawsuit against Kraken exchange</a>.</p><p>While investors may not foresee disruptions to Binance's services, the likelihood of further regulatory actions against exchanges serving U.S. clients has surged. Additionally, individuals who previously relied on obscuring their activity might now think twice, as the DoJ gains access to historical transactions.</p><p>Furthermore, it's uncertain whether the arrangement struck by Changpeng “CZ” Zhao with authorities will extend to other unregulated exchanges and payment gateways. In summary, the repercussions of recent regulatory actions remain uncertain, and the prevailing sentiment is pessimistic, with investors fearing additional constraints and potential actions targeting market makers and stablecoin issuers.</p><p>To determine if the Bitcoin options market is an anomaly, let's examine BTC <a href=\"https://cointelegraph.com/explained/margin-trading-vs-futures-what-are-the-differences\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/margin-trading-vs-futures-what-are-the-differences/amp\">futures contracts</a>, specifically the monthly ones—preferred by professional traders due to their fixed funding rate in neutral markets. Typically, these instruments trade at a 5% to 10% premium to account for the extended settlement period.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/6486de4d-d86f-46fb-8d0e-c482a1a869d1.png\"><figcaption style=\"text-align: center;\"><em>Bitcoin 30-day futures annualized premium. Source: Laevitas.ch</em></figcaption></figure><p>Between Nov. 24 and Nov. 26, the BTC futures premium flirted with excessive optimism, hovering around 12%. However, by Nov. 27, it dipped to 9% as Bitcoin's price tested the $37,000 support—a neutral level but close to the bullish threshold.</p><h2>Retail traders are less optimistic after the ETF hopium fades</h2><p>Moving on to retail interest, there is a growing sense of apathy due to the absence of a short-term positive trigger, such as the potential approval of a spot Bitcoin exchange-traded fund (ETF). The SEC is not expected to make its final decision until January and February 2024.</p><p>The USDT premium relative to the Yuan hit its lowest point in over four months at OKX exchange. This premium serves as a gauge of demand among China-based retail crypto traders and measures the gap between peer-to-peer trades and the U.S. dollar.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/8ac03a85-a3f8-4d68-9781-32df5e8dc445.png\"><figcaption style=\"text-align: center;\"><em>Tether (USDT) peer-to-peer vs. USD/CNY. Source: OKX</em></figcaption></figure><p>Since Nov. 20, USDT has been trading at a discount, suggesting either a significant desire to liquidate cryptocurrencies or heightened regulatory concerns. In either case, it's far from a positive indicator. Furthermore, the last instance of a 1% positive premium occurred 30 days ago, indicating that retail traders aren't particularly enthused about the recent rally toward $38,000.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/what-next-binance-changpeng-cz-zhao\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/what-next-binance-changpeng-cz-zhao/amp\"><strong><em>What’s next for Binance’s Changpeng ‘CZ’ Zhao?</em></strong></a></p><p>In essence, professional traders remain unfazed by short-term corrections, regardless of the regulatory landscape. Contrary to doomsday predictions, Binance's status remains unaffected, and the lower trading volume on unregulated exchanges may boost the chances of a spot Bitcoin ETF approval. </p><p>The disparity in time horizons may explain the divide between professional traders and retail investors' optimism. Additionally, recent regulatory actions could pave the way for increased participation by institutional investors, offering a potential upside in the future.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-27T22:00:52.000Z",
    "title": "Crypto Scam Alert: Fraudsters Impersonate Forbes Journalists In Plot To Rob BAYC Holders",
    "url": "https://www.newsbtc.com/nft-market/crypto-scam-alert-fraudsters-impersonate-forbes-journalists-in-plot-to-rob-bayc-holders/",
    "description": "In the non-fungible tokens (NFTs) sector, scammers are constantly devising new methods to exploit unsuspecting collectors. The latest incident involves fraudsters posing as journalists from Forbes magazine, specifically targeting Bored Ape Yacht Club (BAYC) NFT holders.  One BAYC owner, &#8220;Crumz,&#8221; recently shared his encounter with these scammers, detailing the elaborate scheme designed to steal his digital assets. BAYC Collector&#8217;s Close Encounter With Scammers According to Crumz, the scam began when he received a direct message on X (formerly Twitter) from someone claiming to be a Forbes editor named Robert Lafranco.  Intrigued by the prospect of being featured in an article about BAYC, Crumz proceeded cautiously, conducting a cursory online search that seemingly confirmed the person&#8217;s identity. Unbeknownst to him, the scammers had meticulously crafted a “facade of credibility.” The supposed Forbes journalist informed Crumz of their interest in gathering firsthand accounts from BAYC owners regarding their experiences within the club. Despite initial surprise at being approached, Crumz agreed to participate in a scheduled Zoom call.  Related Reading: Cosmos Co-Founder’s Controversial Proposal Triggers 11% Plunge In ATOM Crumz further stated that the scammers failed to show up for the initial call, citing a fabricated family emergency as the reason for their absence. They rescheduled the meeting for a later date. When the rescheduled call finally took place, Crumz noticed several red flags. The individuals on the call refused to activate their cameras, claiming technical difficulties.  Another person claiming to be Steven Ehrlich, Forbes&#8217; research director, joined the conversation. Crumz shared his BAYC journey, recounting the early days and highlighting the club&#8217;s unique features. During the call, Crumz alleges that the scammers exhibited further suspicious behavior. They lacked a premium Zoom account and insisted on using multiple call links.  Additionally, they requested permission to record the screen using a separate recording bot. Although Crumz initially thought nothing of it, alarm bells rang when they asked him to find a banana and say something that resembled his Bored Ape character. Unable to produce a banana on the spot, Crumz excused himself momentarily, muting his screen. During this momentary lapse, the scammers attempted to take control of his computer, prompting him to intervene when they navigated to the website delegate.cash.  Ultimately, all of Crumz&#8217;s valuable NFTs were securely stored in cold storage, safeguarding them from potential theft. He promptly shut down his computer to ensure his safety, hoping to sever any remote access the scammers may have gained. Crumz concluded: Hopefully I&#8217;m safe now. Don&#8217;t think they can still control my computer when I turn it back on. Please be safe out there, it could&#8217;ve been a dreadful day today Decline In Sales And Market Engagement BAYC has recently witnessed a notable decline in various key metrics. The latest NFT data reveals a decrease in the number of sales, sales volume, and primary sales. According to the latest figures, the number of sales has seen a significant drop of 33.59%, with 87 sales reported at present compared to 131 sales recorded the previous day.  This decrease in sales has also resulted in a decline in sales in USD, with a decrease of 38.02%. The current sales volume is $2 million, compared to $3 million on Sunday. Related Reading: The Dogecoin Surge: Unveiling The Catalyst Behind Rising Transactions In terms of sales volume, primary sales have experienced a 100% decrease, with no current sales reported. In contrast, primary sales generated $12,000 in USD the previous day. Secondary sales volume has also declined 37.76%, with the current figure at $2 million, compared to $3 million from the previous day. Featured image from Shutterstock, chart from TradingView.com "
  }
]