[
  {
    "source": "CoinDesk",
    "date": "2023-11-03T18:41:49.000Z",
    "title": "Bitcoin Stalls at $35K as Gains Flow to Altcoins in Crypto's 'Early Bull Market Rotation,' Analyst Says",
    "url": "https://www.coindesk.com/markets/2023/11/03/bitcoin-stalls-at-35k-as-gains-flow-to-altcoins-in-cryptos-early-bull-market-rotation-analyst-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Layer 1 cryptocurrencies and DeFi tokens soared this week as bitcoin and ether chopped sideways."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-03T18:51:31.000Z",
    "title": "Stablecoin Supply Has Bottomed Out—Is It Bullish for Crypto?",
    "url": "https://decrypt.co/204360/stablecoin-supply-bottoms-out-bullish-crypto",
    "description": "Investors are turning their cold hard cash into cold hard stablecoins. Next to rising prices, does this mark the beginning of a new bull?"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-03T19:00:00.000Z",
    "title": "English school turned BTC miner in China expands capacity with 220 new units",
    "url": "http://cointelegraph.com/news/english-school-bitcoin-miner-china-expands-capacity-220-units",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/9686e70e-5b80-4d3f-8ae1-19079a275ed7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC Digital used to be a chain of English schools based in Shenzhen. Now it has mining farms in Pennsylvania and Tennessee. </p>\n                    <p><p>China-based BTC Digital announced the purchase of 220 new Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) mining units on Nov. 3, bringing its total number of machines to 2,174, with over 230PH/s of computing power. The new acquisitions are expected to become operational by the end of the month.</p><p>The deal was made with “two unaffiliated third parties” for Bitmain Antminer S19j Pro units in exchange for 276,572 shares of ordinary company stock valued at $968,800, according to a <a href=\"https://www.prnewswire.com/news-releases/btc-digital-ltd-announces-purchase-of-220-units-of-antminer-s19j-pro-bitcoin-mining-machines-301976867.html\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>. BTC Digital was known as Meten EdtechX Education Group until a name <a href=\"https://www.prnewswire.com/news-releases/meten-holding-group-ltd-announces-name-change-to-btc-digital-ltd-301903306.html\" target=\"_blank\" rel=\"noopener nofollow\">change</a> in August that “better reflects the Company's current business operations.” </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/a7eb4835-7d18-489a-a8ba-e7c811bae417.jpg\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>The BTC Digital homepage. Source: BTC Digital</em></figcaption></figure><p>According to the Nasdaq-listed company’s website, it is “a leading general English language training service provider in China.” The website <a href=\"https://stage.investorroom.com/meten_ir/Corporate-Profile\" target=\"_blank\" rel=\"noopener nofollow\">claims</a> that the company has learning centers throughout the country and offers training online and in the metaverse. A Reddit thread begun on Nov. 11, 2022, <a href=\"https://www.reddit.com/r/chinalife/comments/ys909u/another_one_bites_the_dustmeten_goes_bust/\" target=\"_blank\" rel=\"noopener nofollow\">indicated</a> that the company had ceased teaching operations unexpectedly, however.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitmain-air-cooled-bitcoin-miner\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitmain-air-cooled-bitcoin-miner/amp\">Bitmain to start shipping new Bitcoin Antminer T21 in January 2024</a></em></strong></p><p>The company <a href=\"https://stage.investorroom.com/meten_ir/Corporate-Profile\" target=\"_blank\" rel=\"noopener nofollow\">expanded</a> into Bitcoin mining at the end of 2021 when it deployed 1,482 miners, according to an undated profile on its website. Its mining farms were located in the American states of Pennsylvania and Tennessee and run by a third party. BTC Digital CEO Alan Peng said of the company's latest purchase:</p><blockquote>“With the recent purchases and our plan to further increase the number of mining machines, we aim to continue improving our financial conditions as well as maximizing value for our shareholders.\"</blockquote><p>It had a market cap of $3.1 million on Sept. 28, after <a href=\"https://www.marketwatch.com/story/btc-digitals-stock-rockets-after-ticker-change-better-reflects-its-business-ee0fcbbb\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-marketwatch-com.cdn.ampproject.org/c/s/www.marketwatch.com/amp/story/btc-digitals-stock-rockets-after-ticker-change-better-reflects-its-business-ee0fcbbb\">hitting</a> a low of $1.79 per share on Sept. 26. It experienced a surge of activity after its ticker symbol was changed from METX to BTCT on Sept. 28. Shares are valued at $3.66 at the time of writing. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">What is the current valuation of the <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&ref_src=twsrc%5Etfw\">#bitcoin</a> mining sector?<br><br>On average, the public miners trade at a P/S ratio of 2.92. This level could surpass 7 in the next bull market, potentially pushing stock valuations to new all-time highs. <a href=\"https://t.co/jTb2MjfvCt\">pic.twitter.com/jTb2MjfvCt</a></p>— Jaran Mellerud ⛏️ (@JMellerud) <a href=\"https://twitter.com/JMellerud/status/1720431472341918192?ref_src=twsrc%5Etfw\">November 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>China <a href=\"https://cointelegraph.com/news/chinese-regulators-unite-forces-to-crack-down-on-crypto\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/chinese-regulators-unite-forces-to-crack-down-on-crypto/amp\">cracked down on Bitcoin mining</a> domestically in the second half of 2021, although its efforts <a href=\"https://cointelegraph.com/news/china-returns-as-2nd-top-bitcoin-mining-hub-despite-the-crypto-ban\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/china-returns-as-2nd-top-bitcoin-mining-hub-despite-the-crypto-ban/amp\">appeared to be less</a> than completely successful. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-miner-gets-life-in-prison-china-offers-bounties-for-crypto-firms-asia-express/\">Bitcoin miner gets life in prison, China offers bounties for crypto firms: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-03T18:58:09.000Z",
    "title": "Bitcoin’s pullback — warning sign or blip on the radar?",
    "url": "https://crypto.news/bitcoins-pullback-warning-sign-or-blip-on-the-radar/",
    "description": "Crypto coins plunged as investors cashed out recent gains, questioning if the rally was overextended."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-03T18:42:51.000Z",
    "title": "Cardano grows 36% in the past two weeks, 6th in gainers",
    "url": "https://crypto.news/cardano-grows-36-in-the-past-two-weeks-6th-in-gainers/",
    "description": "Cardano continues to report growth this week, currently sitting at number 6 for top gainers in today’s CoinMarketCap report."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-03T19:00:50.000Z",
    "title": "Cardano Summit 2023: A Chat With SingulariyNET, Staking Announcement",
    "url": "https://www.newsbtc.com/news/cardano/cardano-summit-2023-a-chat-with-singulariynet-staking-announcement/",
    "description": "In the financial center of Dubai, the Cardano Summit 2023 will gather some of the most prominent projects in the crypto space. During the three-day event, speakers, founders, and the community will voice views on the growing sector and the future of the network and blockchain technology as Cardano enters a critical stage in its development. Related Reading: Cardano Summit 2023: Charles Hoskinson Takes The Stage, Day 1 Recap Our team had the opportunity to speak with the team behind SingularityNET, one of the first projects that has worked on integrating blockchain, machine learning, and Artificial Intelligence (AI) products. The community has been asking for staking features and finally got a response. SingularityNET Launches Staking For AGIX Tokens During Cardano Summit 2023 During the event, SingularityNET revealed the implementation of staking capabilities for users holding their native token, AGIX. In this way, users can generate a yield from holding the token and contribute to the adoption of Cardano and SingularityNET. 📢 Exciting News: AGIX Staking is coming to @Cardano! Get exclusive insights by visiting our booth at the #CardanoSummit2023 – we&#8217;ve got a special surprise waiting for you! Read our latest blog post for more details: https://t.co/qajpfZfdUL#AGIXonCardano #CardanoCommunity — SingularityNET (@SingularityNET) November 2, 2023  The staking capabilities will roll out for everyone later this month. As mentioned, SingularityNET has been working on the intersection between the nascent industry and AI long before these technologies became a global trend. Now, their partnership with IOG and Cardano makes them a perfect candidate to benefit from the adoption of both as major companies pour capital and effort into integrating with AI and blockchain-based projects. Our team sat down with Janet Adams, COO of SingularityNET, and Mihaela Ulieru on the future of blockchain and AI, the role of the community, and their partnership with Cardano. This is what they told us. Q: Could you tell us about your experience during the Cardano Summit 2023? What does it mean for the SingularityNET ecosystem and its partnership with Cardano? Adams: Feel like Home. When I come to a Cardano Summit, our partnership with Carano is very deep. It&#8217;s very strong. I have so many friends here today wandering around all of the different booths, meeting all the different thriving businesses, that are building on Cardano meeting so many friends of Singularity Net. We&#8217;re here with Dessa (Desdemona) Robot. Dessa is really popular. She&#8217;s our pop star, our rockstar robot using a humanoid robot, of course, built by Hanson Robotics. It&#8217;s been very positive. I&#8217;m having a number of really positive discussions with all of the Cardano community. But what&#8217;s really important for us this year at SingularityNET is that our AGIX ADA staking solution on Carano is ready to launch in the next one to two weeks. And that&#8217;s something that I always get asked for by the Cardano community, “when staking.” And so now it’s finally here, I&#8217;m here this week and this weekend I&#8217;m telling everybody “We now have staking.” They&#8217;re all super excited by it. And then that opens the door to us, porting the full SingularityNET marketplace onto Carano as our next major technical action. Q: SingularityNET was a project being developed on Ethereum and eventually migrated to Cardano; what has been the result of this migration? Are your ties with Cardano and its community growing stronger? Adams: So our visionary founder, Dr. Ben Goertzel, has a strong relationship with Charles Hoskinson. And there are two to three core reasons why Cardano is such a leading blockchain partner for us at SingularityNET. One is that we share a common vision and goal for positive impact on humanity. Cardano was established to bring digital identity to populations who don&#8217;t have these kinds of solutions. And the shared passion that I feel when I meet the Cardano community is for positive impact. So that&#8217;s number one within the whole crypto community. And I meet many, many communities around the world. The Cardano community is the most heart-led, the most purpose-driven, the community that really cares about dramatically improving life on the planet for the people who need it most and reducing inequalities. We have shared interests in Africa, where we both have offices as well. So one is the purity of purpose, the second is the mathematical foundation of the Cardano blockchain. It&#8217;s clearly in the long run, it&#8217;s clearly the most mathematically robust blockchain that has been developed. And because our artificial intelligence is also clearly mathematically driven as a mathematically driven solution, it&#8217;s really important that our AI runs on really solid, really secure, really scalable blockchain infrastructure. And then the third reason is we wanted to take advantage of the much better gas fees on Cardano, but the community, the strength of the community, is the most passionate community in the world. We&#8217;re the most passionate company in the world, and our community is also super passionate. And so you bring those two passions together with a blockchain that is more robust, more scalable, more solid, more mathematically proven than any other blockchain. It&#8217;s clear that this is a very strong opportunity for us to work together, SingularityNET and Cardano are building the most important technologies of all time to reduce inequalities. Q: Could you tell us about SingularityNET’s latest projects and how Artificial Intelligence (AI) connects with blockchain technology? Moreover, why build on Cardano rather than in a different network? Ulieru: Some of our most outstanding projects are building the future of Artificial General Intelligence, such as Zarqa &#8211; a large language model that performs much better than ChatGPT due to our approach, which is building with a layer of symbolic reasoning on top of the normal neural networks methods implied in ChatGPT. Another dearest to my heart is the Cogito Protocol, which has a first application Green Coin &#8211; a stablecoin pegged to Sustainability Index and which will grow as we make strides to address the climate and sustainability conundrum. So it offers a holistic perspective on incentivizing action that improves the state of the world at scale. Rejuve is a health impact project that enables people to improve their health (an App is guiding them on healthy lifestyle tricks) including a genetic product that improves longevity. And at last, Sophiaverse &#8211; a game in the metaverse enabling AGI to train by interacting with people via a game structure. There are many more and all building on Cardano as our preferred blockchain since it had the best technological stack. Q: How do you envision the future of AI running on the blockchain? And what do you expect Cardano and SingularityNET to achieve in the coming years? Ulieru: AI is all about processing large amounts of data, and the greatest conundrum is that it infringes on the privacy rights of individuals. With Blockchain this is hard to solve as well, given the transparency inherent in the design. Cardano came up with an innovation, which was today presented by Charles Hoskinson here at the Summit, the Midnight blockchain, with its &#8220;dust&#8221; token, which can enable the processing of encrypted data. There is also a development on the scaling of Cardano &#8211; since SingularityNET is expanding Hydra, the side chain of Cardano, with a novel implementation of a &#8220;ledgerless&#8221; blockchain named Hypercycle (see hypercycle.ai), which is enabling the processing of encrypted data and as such preserves the privacy. Hypercycle was chosen by SingularityNET to be &#8220;the Internet of AI&#8221; since their innovative implementation also comes with a &#8220;router&#8221; for the Internet of AI which everyone can install instead of their normal router and thus bring the AI algorithms to their data, which they can keep private and secure on their own personal router. Related Reading: Cardano November Momentum – An Over 40% Increase In The Cards? We at SingularityNET chose Cardano because it is by far the most innovative blockchains in terms of technology out there. The Keynote of Charles Hoskinson today proved exactly this, including the flexibility of Cardano to accommodate interoperability with all other blockchains, which we at SingularityNET praise a lot, since we are blockchain agnostic and want to enable everyone to use us. And yesterday we also announced that we began staking AGIX on the Cardano blockchain. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-03T19:00:34.000Z",
    "title": "$113 Million In Longs Get Rekt As Bitcoin Plunges Back To $34,000",
    "url": "https://www.newsbtc.com/bitcoin-news/113-million-longs-rekt-bitcoin-plunges-back-34000/",
    "description": "Data shows the cryptocurrency longs have taken a beating today because of the plunge towards $34,000 that Bitcoin has observed. Cryptocurrency Futures Market Has Seen Liquidations Totaling $137 Million Today According to data from CoinGlass, a large amount of liquidations have taken place in the cryptocurrency futures market during the past day. &#8220;Liquidation&#8221; here refers to a forced closure of a futures contract being done by the derivative contract with which said position is open. A contract is liquidated when it amasses losses equal to a certain percentage of the margin (that is, the initial collateral that the holder had put forth when opening the contract). Related Reading: Solana Whales Deposit To Exchanges, Selloff Incoming? As it&#8217;s easy for traders&#8217; bets to fail during volatile periods, it&#8217;s not surprising that the volatility from the past day has induced liquidations throughout the market. The below table shows the data for the liquidations that have occurred in the sector during the last day. Looks like the sector has registered a significant amount of liquidations in the past 24 hours &#124; Source: CoinGlass As you can see, the cryptocurrency futures market has seen liquidations amounting to about $137 million in the past day. Out of these, around $113 million of the contracts were long positions. This means that more than 82% of the liquidation flush in this period has involved the long holders. This is consistent with the price action, as most of the liquidations have been triggered by a plunge in the Bitcoin price from above $35,400 to the $34,000 mark. Such large liquidation events are popularly called &#8220;squeezes.&#8221; Since the squeeze from the last 24 hours has seen the longs on the losing side, the event was a &#8220;long squeeze.&#8221; As the below table displays, Bitcoin-related contracts have unsurprisingly contributed the most towards this latest squeeze. The distribution of the liquidations by symbol &#124; Source: CoinGlass Bitcoin saw $40 million in futures liquidations, while Ethereum registered almost half of those at $21 million. Out of the altcoins, Solana (SOL) observed the highest liquidations. SOL has seen a bit of an explosion recently, so it&#8217;s not unexpected that it has attracted a large amount of speculators towards it. As a natural consequence of this higher interest in the cryptocurrency, its liquidations have been more than the other altcoins. Mass liquidation events like today&#8217;s aren&#8217;t exactly a rare occurrence in the cryptocurrency sector, due to extreme amounts of leverage being easily accessible and the volatility that most of the coins witness on the regular. Related Reading: Ethereum Yet To Shake Off 2022 Bear Hangover: Glassnode It would appear that today&#8217;s liquidation squeeze has been unable to put off speculators, as the Bitcoin open interest (a measure of the total amount of contracts open on the futures market) is still at high values. The indicator's value has seen a surge during the past couple of weeks &#124; Source: CoinGlass As such, it&#8217;s possible that Bitcoin will see more volatility in the near future and with it, another liquidation squeeze. Bitcoin Price Following its drop of more than 3%, Bitcoin is now trading around the $34,200 level. BTC has registered some decline in the last two days &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, CoinGlass.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-03T18:47:01.000Z",
    "title": "Polygon 2.0: Unveiling Exclusive Features Unmatched by Other Blockchain Platforms",
    "url": "https://www.crypto-news-flash.com/polygon-2-0-unveiling-exclusive-features-unmatched-by-other-blockchain-platforms/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-2-0-unveiling-exclusive-features-unmatched-by-other-blockchain-platforms",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-39.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-39.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-39-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Polygon 2.0 upgrade introduces seamless multi-chain interactions and scalability solutions for the Ethereum network. The upgrade includes the pioneering zkEVM technology, enhancing transaction efficiency while keeping costs low. Polygon has announced a significant upgrade with its Polygon 2.0 platform. This upgrade is poised to redefine scalability and interoperability within the blockchain ecosystem, particularly for Ethereum-based [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-03T19:02:00.000Z",
    "title": "ETH Breaking Above $1,850 Will Be a Bullish Sign, Says Analyst",
    "url": "https://coinedition.com/eth-breaking-above-1850-will-be-a-bullish-sign-says-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Community-Warns-Against-Sending-Funds-to-BEN.eth-in-LOYAL-Pre-Sale.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Community Warns Against Sending Funds to BEN.eth in $LOYAL Pre-Sale\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Community-Warns-Against-Sending-Funds-to-BEN.eth-in-LOYAL-Pre-Sale.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Community-Warns-Against-Sending-Funds-to-BEN.eth-in-LOYAL-Pre-Sale-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Community-Warns-Against-Sending-Funds-to-BEN.eth-in-LOYAL-Pre-Sale-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Community-Warns-Against-Sending-Funds-to-BEN.eth-in-LOYAL-Pre-Sale-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Community-Warns-Against-Sending-Funds-to-BEN.eth-in-LOYAL-Pre-Sale-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Community-Warns-Against-Sending-Funds-to-BEN.eth-in-LOYAL-Pre-Sale-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency analyst and trader Crypto Tony shared the two levels that he will be watching for Ethereum (ETH) in the short term. According to an X (formerly Twitter) post published earlier today, the analyst revealed that the altcoin leader breaking above the $1,850 mark will be bullish. Conversely, ETH falling below $1,747 will be [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/eth-breaking-above-1850-will-be-a-bullish-sign-says-analyst/\">ETH Breaking Above $1,850 Will Be a Bullish Sign, Says Analyst</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-03T19:04:29.000Z",
    "title": "JPMorgan Chase, Bank of America, Wells Fargo Suffer Major Outage As Customers Scramble to Locate Deposits",
    "url": "https://dailyhodl.com/2023/11/03/jpmorgan-chase-bank-of-america-wells-fargo-suffer-major-outage-as-customers-scramble-to-locate-deposits/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/bank-chase-outage.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/bank-chase-outage.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/bank-chase-outage.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/bank-chase-outage.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/bank-chase-outage.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/bank-chase-outage.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/bank-chase-outage.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Several of America&#8217;s biggest banks are facing a flood of complaints about issues with account balances and direct deposits. Customers at JPMorgan Chase, Bank of America, US Bank, Wells Fargo and Truist say money that should have arrived in their accounts is not showing up. The network monitoring app Downdetector is reporting widespread issues at [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/03/jpmorgan-chase-bank-of-america-wells-fargo-suffer-major-outage-as-customers-scramble-to-locate-deposits/\">JPMorgan Chase, Bank of America, Wells Fargo Suffer Major Outage As Customers Scramble to Locate Deposits</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-03T18:45:17.000Z",
    "title": "PayPal Receives Greenlight To Conduct ‘Certain Crypto Asset Activities’ in the United Kingdom",
    "url": "https://dailyhodl.com/2023/11/03/paypal-receives-greenlight-to-conduct-certain-crypto-asset-activities-in-the-united-kingdom/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/certain-crypto-asset-activities.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/certain-crypto-asset-activities.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/certain-crypto-asset-activities.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/certain-crypto-asset-activities.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/certain-crypto-asset-activities.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/certain-crypto-asset-activities.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/certain-crypto-asset-activities.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Global payments giant PayPal just secured a license from financial regulators in the United Kingdom to operate as a crypto asset business. According to the Financial Conduct Authority (FCA) website, PayPal is registered for certain crypto asset activities effective October 31st as required by the UK’s money laundering regulations. Under the Money Laundering, Terrorist Financing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/03/paypal-receives-greenlight-to-conduct-certain-crypto-asset-activities-in-the-united-kingdom/\">PayPal Receives Greenlight To Conduct ‘Certain Crypto Asset Activities’ in the United Kingdom</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-03T18:41:15.000Z",
    "title": "FBI Collected Transactional Data of FTX Customers During Bankruptcy Proceedings, According to Billing Records",
    "url": "https://dailyhodl.com/2023/11/03/fbi-collected-transactional-data-of-ftx-customers-during-bankruptcy-proceedings-according-to-billing-records/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/fbi-warns-tricking.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/fbi-warns-tricking.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/fbi-warns-tricking.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/fbi-warns-tricking.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/fbi-warns-tricking.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/fbi-warns-tricking.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/fbi-warns-tricking.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New data reveals that the Federal Bureau of Investigation (FBI) collected transactional data of FTX customers as the troubled crypto exchange went through its bankruptcy proceedings. According to new billing documents from consultancy group Alvarez and Marshal, advisers for FTX have been gathering transactional data to comply with subpoenas from at least five different FBI [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/03/fbi-collected-transactional-data-of-ftx-customers-during-bankruptcy-proceedings-according-to-billing-records/\">FBI Collected Transactional Data of FTX Customers During Bankruptcy Proceedings, According to Billing Records</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]