[
  {
    "source": "Decrypt",
    "date": "2023-07-26T09:01:02.000Z",
    "title": "Lacoste's New Virtual Store Has Exclusive Perks for Ethereum NFT Holders",
    "url": "https://decrypt.co/150014/lacoste-new-virtual-store-exclusive-perks-ethereum-nft-holders",
    "description": "Apparel brand Lacoste's new digital storefront provides an immersive shopping experience—and NFT holders get full access."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-26T09:00:00.000Z",
    "title": "Tokenization Will Transform Real Estate Investing & Ownership",
    "url": "https://cryptodaily.co.uk/2023/07/tokenization-will-transform-real-estate-investing-and-ownership",
    "description": "<p>The real estate industry is ripe for transformation through the advent of tokenization, which makes it possible for physical properties to be represented as digital tokens on the blockchain. Tokenizing real estate opens the door to fractional ownership and the possibility of millions of new investors getting involved in the industry. No wonder, real estate tokens have already become extremely popular, accounting for almost 40% of the global digital securities market.&nbsp;</p>\n<p>The clearest advantage of tokenization is that it dramatically lowers the barrier to entry, enabling small-scale investors to become part-owners of real estate for the first time.&nbsp;</p>\n<p>&nbsp;</p>\nWhat Does Real Estate Tokenization Look Like?\n<p>Tokenization of real estate is a powerful yet simple concept, where a property such as a luxury beach resort, hotel, condominium or home is represented by digital tokens. The property can be represented by, say, 10,000 tokens, meaning 10,000 different individuals could each own a portion of that asset. By enabling fractional ownership, investors with limited capital can finally get involved in real estate.&nbsp;</p>\n<p>Blockchain technology is the foundation on which real estate tokenization is built. The decentralized ledger, which also underpins Bitcoin and other cryptocurrencies, provides a secure and transparent platform for digital assets to be stored and transferred. Smart contracts, which are agreements that execute automatically when specific conditions are met, can be used to streamline the transaction process, eliminating the need for intermediaries.&nbsp;</p>\n<p>&nbsp;</p>\nThe Power Of Tokenized Real Estate\n<p>It&rsquo;s not just that transactions become more efficient. Tokenization can also bring greater liquidity into the real estate market, and make it more accessible. Real estate has traditionally always been an illiquid asset class because of its high costs and the complex transaction process. When real estate is tokenized, this is no longer the case, as individuals can freely buy and sell shares of a property without any intermediary. This ease of buying and selling, combined with the lower costs, encourages greater liquidity for the industry.&nbsp;</p>\n<p>Small investors especially can benefit from tokenization. Before tokenization, someone would need millions of dollars to invest in high-end real estate. With fractional ownership, that&rsquo;s no longer the case as individuals can purchase a small share of an expensive luxury resort and become an investor in real estate for the first time. Tokenization has the effect of making real estate more inclusive.&nbsp;</p>\n<p>Opportunities for small investors already exist. The blockchain-based real estate investment platform LABS Group recently announced that it had successfully distributed the first dividends to investors of the luxurious Kunang Kunang Tent Resort project based in Indonesia. It&rsquo;s a luxury resort on the island of Java, located in a picturesque destination renowned for its natural beauty, and it has enjoyed big demand since the reopening of tourism in the region following the COVID pandemic. The Kunang Kunang Tent Resort has a commendable 9.6 rating on Booking.com and 9.3 rating on Agoda, and has achieved an average occupancy rate of 58% since it first opened a year ago. According to LABS Group, early investors&rsquo; dividends amounted to a yield of approximately 10%.&nbsp;</p>\n<p>Normally, individuals would need access to millions of dollars to become an investor in a project like the Kunang Kunang Tent Resort, but tokenization has instead made it possible for thousands of individuals to get involved by acquiring non-fungible tokens, or NFTs, that represent a share of the property.&nbsp;</p>\n<p>It doesn&rsquo;t just lower the barrier to entry though, for tokenization also means increased transparency and transaction efficiency. If an investor decides they no longer want to be involved, they can quickly sell their share of ownership (the tokens they own) on a decentralized, public marketplace. The transaction will be powered by smart contracts and completely transparent, improving regulatory efficiency.&nbsp;</p>\n<p>&nbsp;</p>\nNew Business Models\n<p>Blockchain technology can also be leveraged to create new business models involving real estate. For instance, Staynex is a revolutionary vacation membership platform that enables users to acquire the rights to visit resorts on an annual basis. It&rsquo;s similar in some ways to timeshares, but investors can also earn rewards simply by holding onto their membership. Stays at resorts are tokenized through NFTs that specify the number of nights allocated to each investor at a specific property.&nbsp;</p>\n<p>The startup calls its NFTs &ldquo;Staynex Passes&rdquo;, and they provide the NFT holder with a guaranteed annual stay at the specified resort and the ability to earn rewards from the resort&rsquo;s business operations. Of course, users are free to sell or gift their NFT to someone else at any time.&nbsp;</p>\n<p>&nbsp;</p>\nChallenges For Real Estate Tokenization\n<p>If real estate tokenization is to gain traction, the industry will need to overcome a couple of challenges. One of the main concerns is the lack of any consistent regulatory framework that governs digital asset markets. Different countries have different laws regarding crypto assets, and this can cause confusion for project leaders and investors. In addition, there&rsquo;s no centralized reporting system for tokenized real estate transactions, which may cause issues with regulators that want to monitor and enforce compliance in the industry.&nbsp;</p>\n<p>Another concern has to do with the potential vulnerabilities of smart contracts. If smart contracts can be exploited, investors may be wary of investing too much money into tokenized real estate. However, it&rsquo;s hoped that as regulatory frameworks for digital assets evolve, the process of tokenizing real estate and transferring these assets will become more secure.&nbsp;</p>\n<p>&nbsp;</p>\nA Compelling Use Case\n<p>While those challenges may hold back adoption of real estate tokenization for now, there seems little doubt that it can be a revolutionary, game-changing concept for the industry. Tokenization and fractional ownership will dramatically increase accessibility, giving millions of people an enticing opportunity to diversify their investments. As the number of tokenized properties increases, investing in real estate will become a radically different and more inclusive experience.&nbsp;&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-26T08:53:00.000Z",
    "title": "LayerZero Crosses 50 Million Cross-Chain Messages Milestone",
    "url": "https://cryptodaily.co.uk/2023/07/layerzero-crosses-50-million-cross-chain-messages-milestone",
    "description": "<p>Bridge Protocol LayerZero has revealed that it has achieved a significant landmark, crossing 50 million cross-chain messages.&nbsp;</p>\n<p>The landmark shows the surging demand among users in the crypto space to conduct cross-chain token swaps and transfer liquidity between different chains.&nbsp;</p>\nWhat Is LayerZero?&nbsp;\n<p>Interoperability issues have plagued the blockchain ecosystem. For seamless interoperability between blockchains, projects must implement standardized data formats, secure communication channels, common consensus mechanisms, and secure, scalable interoperability protocols. This is where LayerZero comes into the picture. LayerZero is a cross-chain communication protocol that facilitates trustless, direct communication between different blockchains, supporting prominent players such as Solana, Aptos, SUI, EVM Chains, and others.&nbsp;</p>\n<p>The communication protocol could potentially revolutionize how blockchains interact with one another, eliminating the need for intermediaries such as bridges and facilitating direct communication instead.&nbsp;</p>\nLayerZero&rsquo;s Unique Approach&nbsp;\n<p>LayerZero uses a unique approach called Ultra Light Nodes (ULNs) to facilitate interoperability. Ultra Light Nodes are essentially lightweight blockchain clients that can validate transactions on other chains without requiring them to download the entire blockchain state. This allows LayerZero to achieve a significantly high throughput, along with low latency during inter-chain communication with blockchains that have different architectures and consensus mechanisms.&nbsp;</p>\n<p>The Ultra Light Nodes are deployed on chains that wish to communicate with one another and maintain a partial view of the chain they are deployed on, which is then used to validate transactions. Relayers, a type of off-chain service, are responsible for relaying messages between ULNs on different chains. As an incentive, relayers are adequately compensated for each message they transmit between chains. Oracles, another third-party service, are used to pass on the block header to the target chain&rsquo;s endpoint, following which the transaction proof is submitted. Once submitted, the destination chain validates the proof using its consensus mechanism.&nbsp;</p>\nThe 50 Million Milestone&nbsp;\n<p>LayerZero crossed the 50 million messages milestone for messages between blockchains on Tuesday. The landmark achievement highlights the high demand among users in the crypto space to conduct cross-chain token swaps and liquidity transfers between chains, despite several vulnerabilities and risks. This is because data from Chainalysis has shown that bridge exploits accounted for over $2 billion in stolen assets in 2022 alone.&nbsp;</p>\n<p>The news also comes just three months after LayerZero Labs, the entity behind LayerZero raised $120 million in capital from over 33 backers. The list of backers included prominent names such as auction house Christies&rsquo; Sequoia Capital, Samsung Next, and Andreessen Horowitz. The Series B funding round was done at a valuation of $3 billion, nearly tripling its valuation from its $135 million round, held in March 2022. Other backers in the latest funding round included OpenSea Ventures, Circle Ventures, and BOND.&nbsp;</p>\n<p>The funding round also marked a rare funding deal in a prolonged crypto bear market that has seen funding dry to a crisp. Co-founder and CEO of LayerZero Labs stated,&nbsp;</p>\n\n<p>&ldquo;LayerZero is to blockchains what the internet was to computing clusters. LayerZero allows chains not only to build bridges (to transfer assets/value between them) but send and execute arbitrary data just like a packet on the internet. What this means is that you can now build applications that are orders of magnitude more complex than existing applications and do so with a completely seamless experience between chains.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-26T09:00:14.000Z",
    "title": "Dogecoin Price Analysis: What’s Next For DOGE?",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-price-analysis-whats-next-for-doge/",
    "description": "Dogecoin (DOGE) is once again at the center of excitement in the crypto space. Over the days, the meme-inspired cryptocurrency experienced a remarkable surge, gaining 25% in just two weeks. As traders and investors closely watch DOGE’s price movements, a combination of technical indicators and on-chain data offer intriguing insights into what may lie ahead for DOGE. Dogecoin Price Analysis According to renowned analyst Ali Martinez, DOGE&#8217;s price action has established a crucial support zone between $0.070 and $0.076. Martinez points out that in this price range, a staggering 452,000 wallets acquired a significant amount of DOGE, totaling 51.4 billion coins. On the other hand, the cryptocurrency faces stiff resistance at $0.083 and $0.088, signaling potential hurdles for further upward momentum. On-chain data firm Santiment adds to the optimism surrounding DOGE, highlighting that the average DOGE trader, active in the past year, is now in profit for the first time in 12 weeks, showing a 2.4% gain. This development is considered a significant milestone and could attract more interest from traders. Related Reading: Crypto Analyst Says It’s Time To Buy Dogecoin, Here’s Why On the other hand, more traders in profit means that profit-taking is more likely, thus selling pressure could build up. Moreover, the DOGE social dominance indicator has not yet reached the dangerous &#8220;FOMO zone,&#8221; indicating the possibility of a further upward surge. Undoubtedly, the current price momentum of Dogecoin is due to Elon Musk. The recent price rally can be attributed to speculation that the meme coin may become a payment method on Twitter&#8217;s rebranded platform, &#8220;X.&#8221; Traders seem eager to front-run Elon Musk&#8217;s decision on this matter, as he has been a vocal supporter of Dogecoin. Related Reading: Dogecoin Price (DOGE) Jumps 10% – Here’s Why The Bulls Could Aim $0.085 This has fueled roaring speculation, resulting in a surge in the perpetual futures market tied to DOGE, with notional open interest exceeding $512 million for the first time since April 19. On that day, DOGE traded at $0.0941 and saw a price drop of about 19% over the next three days. While the influx of new money into the market is generally seen as a confirmation of an uptrend, traders should remain cautious. As profit-taking becomes more likely with more traders in profit, selling pressure could build up, potentially leading to a temporary pullback in DOGE&#8217;s price. However, at press time, the open interest weighted-funding rates were close to zero, suggesting a balance between long and short positions. DOGE/USD 1-Day Chart As explained in the last chart analysis before the pump, DOGE had formed an ascending triangle formation signaling a trend reversal. As predicted, DOGE broke out above the resistance at $0.075 and initially stalled at the 23.6% Fibonacci retracement level ($0.0785). However, after a brief pause, the Dogecoin price continued its rally and climbed to $0.0839, where the bulls paused for the time being due to resistance. While the daily RSI is still not overbought at 68.5, another push higher seems possible. However, lower profit-taking seems to dominate the market for now, so a retest of the 23.6% Fibonacci retracement at $0.0785 could be a likely scenario. If the bulls defend this support, DOGE could rise another 20% to the 38.2% Fibonacci retracement at $0.0937. The next target would then be the yearly high at $0.1044 and the 50% Fibonacci retracement level at $0.1066. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-26T09:00:50.000Z",
    "title": "Cardano (ADA) volume stagnation spells opportunity for Borroe (ROE) presale and its 100x potential",
    "url": "https://www.crypto-news-flash.com/cardano-ada-volume-stagnation-spells-opportunity-for-borroe-roe-presale-and-its-100x-potential-2/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-ada-volume-stagnation-spells-opportunity-for-borroe-roe-presale-and-its-100x-potential-2",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T172608.776-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T172608.776-1.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T172608.776-1-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T172608.776-1-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T172608.776-1-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T172608.776-1-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As Cardano&#8217;s trading volume struggles to keep pace with other top cryptocurrencies, a hidden gem emerges in the form of Borroe (ROE). The ROE presale presents a promising investment opportunity with its massive potential for 100x gains. Cardano&#8217;s volume woes: A win for Borroe (ROE) Cardano (ADA), the top 20 ranked cryptocurrency in terms of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-26T08:44:50.000Z",
    "title": "Bitcoin Adoption in Focus: BRICS Summit Invites 69 Leaders in August – A Step Towards De-Dollarization",
    "url": "https://www.crypto-news-flash.com/bitcoin-adoption-in-focus-brics-summit-invites-69-leaders-in-august-a-step-towards-de-dollarization/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-adoption-in-focus-brics-summit-invites-69-leaders-in-august-a-step-towards-de-dollarization",
    "description": "<img width=\"1920\" height=\"1281\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/06/united-nations-3760656_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/06/united-nations-3760656_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/united-nations-3760656_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/united-nations-3760656_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/united-nations-3760656_1920-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/united-nations-3760656_1920-1536x1025.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/united-nations-3760656_1920-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/united-nations-3760656_1920-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/united-nations-3760656_1920-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/united-nations-3760656_1920-48x32.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />The upcoming BRICS summit, with 69 invited leaders, aims to discuss de-dollarization and the promotion of national currencies in international trade. While a common BRICS currency is not on the agenda, the bloc may explore alternatives, with rumors suggesting Bitcoin&#8217;s financial independence as a potential option. In line with the book &#8220;Pathways to De-dollarization,&#8221; which [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-26T08:41:56.000Z",
    "title": "Everything You Need to Know About Bitcoin, Part 2",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/everything-you-need-to-know-about-bitcoin-part-2/",
    "description": "<p>In 2023, the pace of crypto&#8217;s advancement is blistering. Bitcoin, the granddaddy of crypto, isn&#8217;t lagging behind. With Ordinals, Inscriptions and many projects building atop Bitcoin, more value is being built into $BTC.  In this second part, we&#8217;ll be exploring more fun facts about Bitcoin. Facts that you should know about the crypto that started [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/everything-you-need-to-know-about-bitcoin-part-2/\">Everything You Need to Know About Bitcoin, Part 2</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]