[
  {
    "source": "Cointelegraph",
    "date": "2023-07-30T23:00:39.000Z",
    "title": "Ethereum is about to get crushed by liquid staking tokens",
    "url": "https://cointelegraph.com/news/ethereum-crushed-liquid-staking-tokens",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/6cfecc5f-3635-4ef0-97e4-880a020dc162.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The popularity of liquid staking tokens could usher in a new age for Ethereum and the rest of cryptocurrency — and play a key role in the new bull market.</p>\n                    <p><p>Before we know it, <a href=\"https://cointelegraph.com/news/liquid-staking-claims-top-spot-in-defi-binance-report\">liquid staking tokens (LSTs)</a> are going to replace Ethereum’s native cryptocurrency, Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). The LST market is already worth approximately $17 billion, and it has grown continuously since Ethereum’s Merge.</p><p>While LSTs are just beginning to hit their stride, their advantages over traditional ETH will soon become clear to liquidity providers (LPs), toppling ETH from its throne and ushering in a new era of LST domination.</p><p>Since the Merge, ETH can now be staked to produce a roughly 4% annual yield, depending on factors of network activity, total ETH staked, number of validators and the value captured by <a href=\"https://cointelegraph.com/learn/what-is-mev-ethereums-invisible-tax\">maximum extractable value</a>. This development is significant because of the nature of ETH as a generally stable asset. Many cryptocurrencies are more volatile, so owners have to consider both yield and whether the price of that asset will appreciate or depreciate. Alternatively, ETH now offers yields from both staking <em>and</em> gradual price stability and appreciation.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/lower-costs-higher-speeds-after-ethereum-s-merge-don-t-count-on-it\"><strong><em>Lower costs, higher speeds after Ethereum’s Merge? Don’t count on it</em></strong></a></p><p>The new capacity to stake ETH and earn yield means that those who hold ETH today must decide: Should they provide liquidity with their ETH and hope to earn fees, or would they be better off staking that ETH and earning a surefire yield? </p><p>LSTs solve this dilemma for LPs. Unlike regular staked ETH, which is illiquid in the Ethereum staking contract, LSTs unlock the inherent value of staked tokens, giving LPs a liquid “receipt” token that can be freely traded and utilized as collateral within <a href=\"https://cointelegraph.com/defi-101/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> protocols. Because LSTs make staked assets liquid, they offer flexibility for tokenholders to engage in other activities across different networks while still earning ETH staking rewards.</p><p>This means that LPs can now earn the yield from staked ETH while simultaneously using LSTs to provide liquidity in <a href=\"https://cointelegraph.com/explained/uniswap-and-automated-market-makers-explained\">automated market makers (AMMs)</a>. Critically, LSTs also offer a much lower cost to entry than regular ETH staking, which is appealing for reaching new audiences and smaller dollar investors.</p><p>The argument that LSTs will replace ETH in DeFi is evident: Any LP who chooses to supply ETH to an AMM instead of an LST is sacrificing roughly 4% APR. What kind of sense would that make for folks looking to maximize their yield?</p><p>There are undoubtedly some in this space who would argue that ETH is ETH — that it’s the second biggest token in the cryptocurrency landscape and that it’s not going anywhere. But crypto is quick to evolve. This community is always looking for the next technical development that makes earning yield easier and more efficient, and when it comes down to it, LSTs offer a more effective way to earn yield.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ethereum-s-merge-will-affect-more-than-just-its-blockchain\"><strong><em>Ethereum’s Merge will affect more than just its blockchain</em></strong></a></p><p>The transition to LSTs will come swiftly, but right now, it’s still very early days. Ethereum’s Shanghai upgrade, which enabled ETH to be unstaked for the first time, only happened in April. But LSTs have a much larger market potential than their current market share represents. As people become more comfortable with staking ETH now that it can be easily unstaked, I believe that we will see a rapidly growing adoption of liquid staking platforms.</p><p>The beginning of this transition can already be seen in staking trends in the post-Shanghai world. In 2023 alone, the ETH deposited with the Lido protocol has <a href=\"https://defillama.com/protocol/lido?denomination=ETH\" target=\"_blank\" rel=\"noopener nofollow\">increased</a> from 4.9 million to 8 million, representing more than 30% of all staked ETH. The Swell Network, which launched in mid-April, already has more than 43,000 ETH staked on its platform. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/f1320f7e-4556-4b16-b746-06b6eb496396.jpg\"  /><figcaption style=\"text-align: center;\"><em>ETH staked on Swell as of July 30, 2023. Source: DeFiLlama</em></figcaption></figure><p>This shift could mean LSTs will take over as the dominant asset in decentralized exchanges and eventually replace ETH entirely as the go-to token in crypto. The sweeping growth of “LSTFi” could usher in an age in which all ETH will be staked through liquid staking protocols and users will do all trading and other activities using LSTs. </p><p>Yes, ETH is the more familiar asset. But familiar doesn’t necessarily mean “best.” Before settling into purchasing ETH and then having to make decisions about what financial opportunity to forfeit via providing liquidity vs. staking, folks in DeFi should take a spin through the up-and-coming LST ecosystem. Right now may be the last real chance to get in on the ground floor and maximize the impact of their investments.</p><p>Ultimately, an LST takeover would be a positive thing for the industry. Many crypto users left during our “crypto winter,” and there’s been a noticeable slowdown in garnering interest from new users. LSTs are a more accessible option to attract new users and could be the new breath of life this industry needs.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Bob Baxley</strong> is a core builder for the Maverick Protocol. He worked previously for Apple as a senior manager of design and product management and as a director of design for Yahoo. He holds an undergraduate degree from the University of Texas at Austin and a master’s degree from Stanford University.</div></div><p class=\"post-content__disclaimer\"><em>The opinions expressed are the author’s alone and do not necessarily reflect the views of Cointelegraph. This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice.</em></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-30T22:43:08.000Z",
    "title": "Crypto trading soars in Russia amid Wagner rebellion",
    "url": "https://www.cryptopolitan.com/crypto-trading-soars-in-russia-why/",
    "description": "The tempestuous winds of political upheaval recently swept across Russia&#8217;s financial landscape, causing a surprising surge in crypto trading. Amid an attempted insurrection by the Wagner Group, led by Yevgeny Prigozhin, Russians scrambled to find a stable alternative to their plummeting currency. The country&#8217;s first coup attempt in three decades shook the very foundations of ... <a title=\"Crypto trading soars in Russia amid Wagner rebellion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-trading-soars-in-russia-why/\" aria-label=\"More on Crypto trading soars in Russia amid Wagner rebellion\">Read more</a>"
  }
]