[
  {
    "source": "CoinDesk",
    "date": "2023-10-19T21:01:43.000Z",
    "title": "Hamas Crypto Funding Likely ‘Overstated’ – Chainalysis",
    "url": "https://www.coindesk.com/consensus-magazine/2023/10/19/hamas-crypto-funding-likely-overstated-chainalysis/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Reports of many millions going to Hamas and other groups are based on faulty analysis, the forensics firm said."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-19T21:01:03.000Z",
    "title": "Universal Music Group sues Anthropic for IP infringement",
    "url": "https://cryptoslate.com/universal-music-group-sues-anthropic-for-ip-infringement/",
    "description": "<p>Anthropic, an artificial intelligence (AI) firm known for its Claude chatbot, was sued by several music companies over its inclusion of song lyrics in AI prompts on Oct. 18. Those music companies, many of which belong to or are related to Universal Music Group, allege that Anthropic &#8220;unlawfully copies and disseminates vast amounts of copyrighted [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/universal-music-group-sues-anthropic-for-ip-infringement/\">Universal Music Group sues Anthropic for IP infringement</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-19T21:07:03.000Z",
    "title": "Why Crypto mixers are in hot water with FinCEN",
    "url": "https://www.cryptopolitan.com/crypto-mixers-are-in-hot-water-with-fincen/",
    "description": "The turbulence surrounding crypto mixers has amplified, putting them squarely in the crosshairs of the Financial Crimes Enforcement Network (FinCEN). Let&#8217;s dive into the unfolding drama and scrutinize the intensifying skepticism regarding these platforms. On The Rise: Illicit Transactions FinCEN, an arm of the U.S. Treasury Department, is ringing alarm bells. The agency has observed ... <a title=\"Why Crypto mixers are in hot water with FinCEN\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-mixers-are-in-hot-water-with-fincen/\" aria-label=\"More on Why Crypto mixers are in hot water with FinCEN\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-19T20:49:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-19T21:01:49.000Z",
    "title": "BH Token stolen funds funneled into Tornado Cash",
    "url": "https://crypto.news/bh-token-stolen-funds-funneled-into-tornado-cash/",
    "description": "Funds stolen in a prior exploit have reportedly been channeled into Tornado Cash, totalling an estimated 1,500 BNB now within the mixer."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-19T21:00:30.000Z",
    "title": "Hedera (HBAR) Q3 Triumph: Transaction Volume Soars, Network Revenue Crosses 1M Milestone",
    "url": "https://www.newsbtc.com/news/hedera-hbar-q3-triumph-transaction-volume-soars-network-revenue-crosses-1m-milestone/",
    "description": "According to a recent report by the online database platform Messari, the Hedera (HBAR) Network, an open-source, public blockchain governed by the Hedera Governing Council, has showcased significant growth in the face of a challenging crypto market during Q3 2023.  Hedera Network Hits New Record With 99 Million Daily Transactions Per the report, Hedera Network&#8217;s transaction volume continued its upward trajectory, achieving a new record of 99 million daily average transactions in Q3 2023.  This milestone marks the fifth consecutive quarterly increase in transaction activity, with the Hedera Consensus Service responsible for 99% of all transactions on the network.  Related Reading: Bitcoin Maximalist Calls Ethereum ‘Garbage’, Here’s Why Notably, the network&#8217;s revenue derived from transaction fees surpassed $1 million for the first time, experiencing a remarkable 30% quarter-on-quarter growth.  According to Messari, the Hedera Consensus Service largely drove the revenue growth and remained independent of HBAR&#8217;s price fluctuations, as transaction fees are fixed in USD terms. While the overall crypto market experienced a moderate downturn during Q3 2023, HBAR&#8217;s circulating market capitalization grew by 7.6% quarter-on-quarter, reaching $1.7 billion by the end of September.  HBAR&#8217;s fully diluted market capitalization also increased by 2.5%, settling at $2.5 billion. As a result, the Hedera Network emerged as the 31st-largest crypto protocol by market capitalization, demonstrating its growing prominence in the industry. Hedera’s TVL Skyrockets By 29% The protocol’s Total Value Locked (TVL) reached $31 million in Q3 2023, a 29% increase from the previous quarter. While the broader market witnessed a reduction in TVL, Hedera&#8217;s year-over-year (YoY) TVL growth stood at an impressive 75%.  SaucerSwap, the leading protocol within the Hedera ecosystem, accounted for most of the TVL, with $27 million locked, comprising 87% of the Hedera Network&#8217;s total TVL. According to Messari, this growth in TVL can be attributed to the launch of new protocols within the ecosystem. On the flip side, the Hedera community has strongly emphasized enhancing developer tools and collaborations.  In Q3 2023, significant progress was made toward achieving Ethereum Virtual Machine (EVM) equivalence. The community introduced developer-focused features, integrated the JSON-RPC codebase, and refined contract creation transactions through HIP-729.  These efforts have increased compatibility with EVM networks and expanded the capabilities of smart contract development on the Hedera Network. High Staking Percentage And Strategic Partnerships The Hedera Network reported a high staking percentage, with 85% of the circulating supply and 56% of the total supply staked.  Core entities such as the HBAR Foundation, Swirlds, and Swirlds Labs have staked their HBAR allocations and the Hedera Treasury to support validators in meeting the minimum staking threshold for network consensus. Notably, these entities have chosen not to collect staking rewards.  Related Reading: This Bullish Divergence Is Once Again Forming For Bitcoin, Rally Soon? Per the report, the Hedera Governing Council modified the staking rewards structure during Q3, adjusting the reward rate to 2.5% and setting a maximum staked quantity to ensure proportional reward rates. Despite the challenging crypto market conditions in Q3 2023, the Hedera Network has showcased significant growth. The expansion of TVL and the dominance of SaucerSwap further solidified the ecosystem&#8217;s position.  Despite the growth of Hedera Network&#8217;s ecosystem, the native token, HBAR, is currently trading at $0.0460, reflecting a 4.5% decrease in value over the past 24 hours. This trend has persisted throughout the year, resulting in a year-to-date decline of 24%. Featured image from Shutterstock, chart from TradingView.com "
  }
]