[
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T01:00:00.000Z",
    "title": "Best New Crypto That Can Outperform Solana (SOL)",
    "url": "https://www.cryptopolitan.com/best-new-crypto-that-can-outperform-solana-sol/",
    "description": "In the rapidly changing space of cryptocurrency, investors are constantly on the lookout for the next big opportunity that can deliver outstanding returns. Among the myriad of new entrants, one project stands out with the potential to outshine established giants like Solana (SOL). This project, known as Pandoshi (PAMBO), is capturing the attention of the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-07T01:00:44.000Z",
    "title": "XRP Buy Signal Goes Off, Analyst Says This Is How Long Uptrend Will Last",
    "url": "https://www.newsbtc.com/xrp-news/xrp-buy-goes-analyst-how-long-uptrend-last/",
    "description": "An analyst has recently explained how a buy signal has formed for XRP on its weekly chart, which could lead to an uptrend lasting for this long. XRP Has Observed A TD Sequential Buy Signal Recently In a new post on X, analyst Ali discussed a buy signal forming in the weekly price of XRP. The relevant indicator is the &#8220;Tom Demark (TD) Sequential,&#8221; a technical analysis tool for pinpointing probable reversal points for any asset&#8217;s price. This indicator is made up of two phases. The first phase is called the &#8220;setup&#8221; and lasts nine candles. During this phase, candles of the same polarity are counted up to nine, and following the ninth candle, the commodity can be assumed to have hit a top or bottom. Related Reading: XRP, SOL Among Coins With Red Sentiment, Time To Buy Against Crowd? If the setup&#8217;s completion occurred with nine green candles (the prevailing trend was bullish), then the indicator would suggest a switch toward the bearish direction. Similarly, red candles would imply a buy signal for the asset. The second phase in the TD Sequential is the &#8220;countdown,&#8221; which works just like the setup except that it lasts for thirteen candles. After these thirteen candles, another price reversal may have occurred. The TD Sequential phase of the former type has been completed for XRP recently. Here is the chart shared by the analyst that shows the TD Sequential setup forming in the weekly price of the cryptocurrency: Looks like the phase has finished with nine red candles for the asset recently &#124; Source: @ali_charts on X The graph shows that this TD Sequential setup in the cryptocurrency&#8217;s 7-day price has formed with red candles, as the coin&#8217;s price has been struggling recently. The historical pattern could imply that the asset may have now hit a probable bottom point. Ali suggests XRP &#8220;is poised for an upswing lasting one to four weeks.&#8221; XRP Has Continued To Go Down Since The Year Has Kicked Off The year 2024 began for XRP with a sharp move down, from which the asset still hasn&#8217;t been able to recover as its price has continued to head downward, staying in line with the tone set by the poor start. The below chart shows how the coin has performed over the last three months. The price of the coin appears to have been going down during the last few weeks &#124; Source: XRPUSD on TradingView A brief relief rally came for XRP around the time of the Bitcoin spot ETF approval, but just like it had played out in the broader sector, this surge also couldn&#8217;t last long as investors took to selling the news. Related Reading: Dogecoin Trounced: Chainlink’s 34% Jump Kicks DOGE Out Of Top 10 List After all the downtrend since then, the cryptocurrency is now trading around the $0.50 mark, down almost 18% year-to-date. Featured image from Shutterstock.com, charts from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-07T01:00:29.000Z",
    "title": "About $1,220,000,000 in Ethereum (ETH) Has Exited Known Crypto Exchange Wallets in Just Three Weeks: Analyst",
    "url": "https://dailyhodl.com/2024/02/06/about-1220000000-in-ethereum-eth-has-exited-known-crypto-exchange-wallets-in-just-three-weeks-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/eth-exited-known-wallets.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/eth-exited-known-wallets.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/02/eth-exited-known-wallets.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/eth-exited-known-wallets.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/eth-exited-known-wallets.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/eth-exited-known-wallets.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/02/eth-exited-known-wallets.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Cryptocurrency analyst and trader Ali Martinez says hundreds of thousands of Ethereum (ETH) are leaving crypto exchanges as holders accumulate the native asset of the leading smart contract protocol. Martinez tells his 43,400 followers on the social media platform X that Ethereum potentially is facing a decline in selling pressure after the crypto asset recorded [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/06/about-1220000000-in-ethereum-eth-has-exited-known-crypto-exchange-wallets-in-just-three-weeks-analyst/\">About $1,220,000,000 in Ethereum (ETH) Has Exited Known Crypto Exchange Wallets in Just Three Weeks: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]