[
  {
    "source": "Decrypt",
    "date": "2023-07-06T16:55:44.000Z",
    "title": "DeFi Traders Lost $228 Million to Hackers in 3 Months",
    "url": "https://decrypt.co/147539/defi-traders-lost-228-million-to-hackers-in-3-months",
    "description": "The overall number of hacks has increased by 65% and losses from fraud rocketed up by 225%."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T17:00:00.000Z",
    "title": "Elon Musk calls for AI regulatory oversight: Report",
    "url": "https://cointelegraph.com/news/elon-musk-calls-ai-regulatory-oversight-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/b358fd43-9645-4dfe-8967-550e053ad084.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In a keynote address at a Chinese government-backed AI conference, Musk noted that governments should be concerned about deep intelligence.</p>\n                    <p><p>Twitter's executive chairman Elon Musk continues to push for more regulatory oversight of artificial intelligence, <a href=\"https://www.scmp.com/tech/big-tech/article/3226728/elon-musk-says-he-has-faith-chinas-ability-develop-artificial-intelligence\" target=\"_blank\" rel=\"noopener nofollow\">claiming</a> it may be \"smarter than all humans at everything\" in the future.</p><p>In a video keynote address at a Chinese government-backed AI conference on July 5, Musk <a href=\"https://www.scmp.com/tech/big-tech/article/3226728/elon-musk-says-he-has-faith-chinas-ability-develop-artificial-intelligence\" target=\"_blank\" rel=\"noopener nofollow\">reportedly</a> noted that governments should be concerned about deep intelligence, urging regulators to step in to prevent its misuse. </p><p>“I do think we should be very careful with development of, especially artificial general intelligence, or very deep intelligence [...] Artificial general intelligence is a computer intelligence that is smarter than all humans at everything. That is something we should be concerned about,” Musk said, acknowledging that “it’s important to have some sort of regulatory oversight” on that front.</p><p>The concept of artificial general intelligence, or AGI, refers to a subset of artificial intelligence that expects machines to compete with or even surpass humans in intelligence. Also known as deep AI, the technology adds human cognitive abilities to a program, allowing machines to learn in the same fashion as humans. </p><p>In the speech, Musk also addressed autonomous vehicles and robots, noting that they may bring a \"very profound change\" to the world, adding that \"we need to be careful about it to make sure it is something that benefits humanity.\"</p><p>Musk's comments follow the unveiling of Tesla's humanoid robot a few months ago. Called \"Optimus\", the prototype was first showcased at the automaker's \"AI Day\" event last September as a demonstration of the company's latest advancements in artificial intelligence. “As time goes by, it seems like, it may, at some point, exceed one-to-one ratio, in more robots than humans, and potentially much greater,” Musk remarked.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/033cd2fa-7173-48fd-b4ac-eff05b220d8d.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Tesla's Optimus prototype at the company's 'AI Day' event in 2022. Source: Tesla</em></figcaption></figure><p>China is reportedly heightening its AI development efforts. In a recent meeting attended by Chinese President Xi Jinping and prominent Communist Party members, Beijing stressed <a href=\"https://cointelegraph.com/news/chinese-officials-issue-warning-about-ai-and-national-security\">its ambitions to lead the AI global race.</a></p><p>According to local news outlet Xinhua News Agency, Chinese leaders debated the need for “dedicated efforts to safeguard political security and improve the security governance of internet data and artificial intelligence.”</p><p><a href=\"https://cointelegraph.com/magazine/moral-responsibility-how-blockchain-can-improve-ai-trustworthiness/\"><strong><em>Magazine: ‘Moral responsibility’ — Can blockchain really improve trust in AI?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-06T16:40:08.000Z",
    "title": "Georgia prosecutors reportedly charge billionaire George Bachiashvili for misappropriation of funds in Bitcoin, money laundering",
    "url": "https://cryptoslate.com/georgia-prosecutors-reportedly-charge-billionaire-george-bachiashvili-for-misappropriation-of-funds-in-bitcoin-money-laundering/",
    "description": "<p>Georgian news outlet Agenda reported Thursday that George Bachiashvili, the founder of the Georgian Co-Investment Fund, known for running a $6 billion private equity fund contributing about 40% to the nation&#8217;s GDP, has been charged with cryptocurrency misappropriation and money laundering. The Prosecutor&#8217;s Office of Georgia alleges Bachiashvili misappropriated a &#8220;large amount&#8221; of cryptocurrency, notably [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/georgia-prosecutors-reportedly-charge-billionaire-george-bachiashvili-for-misappropriation-of-funds-in-bitcoin-money-laundering/\">Georgia prosecutors reportedly charge billionaire George Bachiashvili for misappropriation of funds in Bitcoin, money laundering</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-06T16:53:14.000Z",
    "title": "Nayms Issues World’s First Crypto-Denominated Industry Loss Warranty (ILW)",
    "url": "https://cryptodaily.co.uk/2023/07/nayms-issues-worlds-first-crypto-denominated-industry-loss-warranty-ilw",
    "description": "<p>London, United Kingdom, July 6th, 2023, Chainwire</p><p>Nayms SAC Ltd., the leading crypto-native insurance marketplace, is proud to announce the issuing of the world&rsquo;s first crypto-denominated industry loss warranty (ILW) through the second segregated account or &lsquo;cell&rsquo; within its marketplace. This type of instrument is index-based and used for providing retrocessional reinsurance protection to property reinsurers.</p><p>In this program, Nayms provides coverage for US named windstorm, attaching above a loss trigger of $60 billion. The basic structure aligns with other ILWs, but Nayms innovates on the traditional approach by using USD Coin (USDC) as the collateral within the segregated account on its independently audited Ethereum smart contract, and by securing that collateral through new mechanisms and concepts, including a digital multi-signature process, for enhanced transparency and efficiency.</p>&ldquo;This deal demonstrates so nicely the benefits of our business model and technology for a broad range of parties and opportunities. Notably, insureds gain access to alternative capital and investors can earn a return on their crypto that is fully regulated yet not correlated to most other financial instruments,&rdquo; observed Dr. David Verbeeten, Chief Commercial Officer at Nayms.<p>The purchaser is Prospero Re, a Bermuda insurer, wholly owned by Resolute Global Partners, with a strong commitment to innovation. For underwriting, Nayms was assisted by the deep domain knowledge of Daniel Vestergren, CEO of Varius Capital Partners Ltd. and former head of ILS at Hiscox Bermuda, who acted as general advisor. For seamless placement, both the purchaser and Nayms were guided by Guy Carpenter, who acted as sole placing broker.</p>Tom Libassi, Co-Founder and Managing Partner of Resolute Global Partners, said, &ldquo;We're proud to partner with Nayms to offer the first-ever property catastrophe reinsurance contract denominated in cryptocurrency. This contract is also the first ILW with a loss trigger based on the advanced catastrophe modeling technology behind our Footprint product, which provides coverage for severe losses along with a transparent, timely, and highly efficient way for investors to access the property catastrophe market.&rdquo;&nbsp;&nbsp;&nbsp;&nbsp;<p>The ILW market is part of the larger global property catastrophe reinsurance market, which generates more than $300 billion of annual renewal premium, presenting significant opportunities for insurers, insureds, and investors alike. Moving forward on the success of its innovative ILW, Nayms remains committed to deploying emerging technologies to reshape the insurance industry. The company invites interested parties to explore other pending investment opportunities. The company made estimates of the potential incomes in prospective segregated accounts within Nayms&rsquo; marketplace as such:</p><p>a. Primary insurance for excess cyber liability, 10-15% ROI</p><p>b. Primary insurance for smart contract hack and cross-chain bridging failure, 12-15% ROI</p><p>c. Captive insurance for smart contract protection services, 8-12% ROI</p><p>d. Captive insurance for digital asset recovery services, 10-15% ROI</p><p>About Nayms</p><p>Nayms is the world&rsquo;s leading crypto-native insurance marketplace. The company is licensed in Bermuda for both general insurance (IIGB) and digital assets business (DABA Class F). It operates as a bridge between alternative capital and uninsured risk in the rapidly evolving digital assets&rsquo; space and other hard-to-place markets. It provides the technical and legal infrastructure over which diverse stakeholders, including insureds, insurers, underwriters, brokers, and others, come together to capitalise and transfer risk on-chain. Building on Ethereum, Nayms&rsquo; diverse team uses a smart contract to coordinate crypto-native payments, underwriting, claims handling, and capitalisation for a large variety of insurances.</p><p>About Prospero Re</p><p>Prospero Re Ltd. is a Class 3A licensed reinsurance company domiciled in Bermuda and regulated by the Bermuda Monetary Authority. Launched in 2013 by long-term industry leader Don Kramer, Prospero Re is wholly owned by Resolute Global Partners Ltd. and offers both catastrophe and non-catastrophe reinsurance coverage to a wide range of insurance and reinsurance companies across the globe, predominantly in the United States, Europe, United Kingdom, Canada, Japan, and Australia. Business assumed includes property, marine, and offshore energy, as well as aviation and other sectors within the reinsurance market. We view our counterparties as partners and work to deliver meaningful solutions to our clients for their current and future needs. Prospero Re has an &lsquo;A&rsquo; rating from Kroll Bond Rating Agency.</p><p>About Guy Carpenter</p><p>Guy Carpenter &amp; Company, LLC is a leading global risk and reinsurance specialist with 3,400 professionals in over 60 offices around the world. Guy Carpenter delivers a powerful combination of broking expertise, trusted strategic advisory services and industry-leading analytics to help clients adapt to emerging opportunities and achieve profitable growth. Guy Carpenter is a business of Marsh McLennan (NYSE: MMC), the world&rsquo;s leading professional services firm in the areas of risk, strategy and people. The Company&rsquo;s more than 85,000 colleagues advise clients in 130 countries. With annual revenue of over $20 billion, Marsh McLennan helps clients navigate an increasingly dynamic and complex environment through four market-leading businesses including Marsh, Mercer and Oliver Wyman. For more information, visit www.guycarp.com and follow us on LinkedIn and Twitter.</p><p>For more information on launching insurance vehicles at Nayms, contact adam@nayms.com. For more information on Nayms and investment opportunities, contact sarah@nayms.com or visit Nayms': Official Website | LinkedIn | Twitter | Telegram | Medium | YouTube</p>ContactHead of OperationsSarah GeorgeNaymssarah@nayms.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T16:45:08.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T16:53:33.000Z",
    "title": "Nayms Issues World’s First Crypto-Denominated Industry Loss Warranty (ILW)",
    "url": "https://www.crypto-news-flash.com/nayms-issues-worlds-first-crypto-denominated-industry-loss-warranty-ilw/?utm_source=rss&utm_medium=rss&utm_campaign=nayms-issues-worlds-first-crypto-denominated-industry-loss-warranty-ilw",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Untitled_design_7_1688658391cCXdl3JKHg.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Untitled_design_7_1688658391cCXdl3JKHg.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Untitled_design_7_1688658391cCXdl3JKHg-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Untitled_design_7_1688658391cCXdl3JKHg-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Untitled_design_7_1688658391cCXdl3JKHg-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />London, United Kingdom, July 6th, 2023, Chainwire Nayms SAC Ltd., the leading crypto-native insurance marketplace, is proud to announce the issuing of the world’s first crypto-denominated industry loss warranty (ILW) through the second segregated account or ‘cell’ within its marketplace. This type of instrument is index-based and used for providing retrocessional reinsurance protection to property [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-06T16:53:00.000Z",
    "title": "SolSea Teams up With Coca-Cola for Serbian Music Festival",
    "url": "https://coinedition.com/solsea-teams-up-with-coca-cola-for-serbian-music-festival/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/NFT-V2-9-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Coca-Cola Serbia has joined forces with SolSea an, to launch a range of products for Serbia’s EXIT Festival. The drop includes physical hoodies and a special NFT collection on SolSea, a marketplace on the Solana blockchain. According to the details from the announcement, this alliance is centered around a feature called the “Magic Mirror”, which [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/solsea-teams-up-with-coca-cola-for-serbian-music-festival/\">SolSea Teams up With Coca-Cola for Serbian Music Festival</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-06T16:59:36.000Z",
    "title": "Veloce Media Group Announces Major Investment Commitment of $50 Million From GEM Digital Limited",
    "url": "https://dailyhodl.com/2023/07/06/veloce-media-group-announces-major-investment-commitment-of-50-million-from-gem-digital-limited/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/05/Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/05/Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/05/Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>July 6, 2023 – London, United Kingdom Veloce Media Group announces major investment commitment of $50 million from GEM Digital Limited – a significant investment to fuel Veloce Media Group’s growth. GEM Digital Limited is a global leading digital asset investment firm. Following the announcement of Veloce Media Group’s evolution to Web 3.0 – with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/06/veloce-media-group-announces-major-investment-commitment-of-50-million-from-gem-digital-limited/\">Veloce Media Group Announces Major Investment Commitment of $50 Million From GEM Digital Limited</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-06T16:55:09.000Z",
    "title": "Former SEC Official Says CBDCs Will Open Pandora’s Box of Privacy Concerns, Supports Ted Cruz’s Proposed Ban",
    "url": "https://dailyhodl.com/2023/07/06/former-sec-official-says-cbdcs-will-open-pandoras-box-of-privacy-concerns-supports-ted-cruzs-proposed-ban/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/former-sec-cruz.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/former-sec-cruz.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/former-sec-cruz.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/former-sec-cruz.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/former-sec-cruz.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/former-sec-cruz.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/former-sec-cruz.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A former official of the U.S. Securities and Exchange Commission (SEC) says the establishment of a central bank digital currency (CBDC) is possibly the most absurd financial idea in the history of monetary policy. Ex-chief of the SEC Office of Internet Enforcement John Reed Stark says the CBDC does not solve any problem at all [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/06/former-sec-official-says-cbdcs-will-open-pandoras-box-of-privacy-concerns-supports-ted-cruzs-proposed-ban/\">Former SEC Official Says CBDCs Will Open Pandora’s Box of Privacy Concerns, Supports Ted Cruz’s Proposed Ban</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-06T16:42:49.000Z",
    "title": "OKX To Launch Signal Trading Platform, Empowering Traders With High-Quality Signals and Seamless Execution",
    "url": "https://dailyhodl.com/2023/07/06/okx-to-launch-signal-trading-platform-empowering-traders-with-high-quality-signals-and-seamless-execution/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>July 6, 2023 – Dubai, United Arab Emirates OKX&#8217;s Signal Trading is a trading bot and marketplace that bridges the gap between signal providers and traders. Signal Trading will be integrated with TradingView, enabling signal providers and traders to create signals directly on the leading charting platform. A pre-launch waitlist is available now for signal [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/06/okx-to-launch-signal-trading-platform-empowering-traders-with-high-quality-signals-and-seamless-execution/\">OKX To Launch Signal Trading Platform, Empowering Traders With High-Quality Signals and Seamless Execution</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]