[
  {
    "source": "CoinDesk",
    "date": "2023-11-20T09:20:17.000Z",
    "title": "Santander Private Bank Introduces Bitcoin, Ethereum Trading for Swiss Clients",
    "url": "https://www.coindesk.com/business/2023/11/20/santander-private-bank-introduces-bitcoin-ethereum-trading-for-swiss-clients/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Santander Private Banking International is offering buy, sell and hold services with bitcoin and ether to clients in Switzerland."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-20T09:11:07.000Z",
    "title": "Sam Altman, Former OpenAI CEO, Lands at Microsoft",
    "url": "https://www.coindesk.com/business/2023/11/20/sam-altman-former-openai-ceo-lands-at-microsoft/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Altman and other departed OpenAI staff will join a new advanced AI research team at the software giant."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-20T09:30:04.000Z",
    "title": "Ethereum Network Accounted for Over 90% of Layer 1 Revenues in Q3 — Study",
    "url": "https://news.bitcoin.com/ethereum-network-accounted-for-over-90-of-layer-1-revenues-in-q3-study/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_776426233-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ethereum Network Accounted for Over 90% of Layer 1 Revenues in Q3 — Study\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_776426233-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_776426233-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_776426233-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_776426233-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_776426233-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_776426233-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_776426233.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to a Messari report, the Ethereum network&#x2019;s revenues constituted more than 90% of the $491.5 million generated by layer 1 chains in Q3. The data also shows that in the period in question, the Aptos network&#x2019;s revenues were 160% higher than in the preceding quarter. Ethereum Still Dominates While the third quarter (Q3) revenue [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-20T09:10:29.000Z",
    "title": "Analysts focus on Rebel Satoshi, Shiba Inu, and Zcash ahead of crypto bull run",
    "url": "https://crypto.news/analysts-focus-on-rebel-satoshi-shiba-inu-and-zcash-ahead-of-crypto-bull-run/",
    "description": "Market analysts have been exploring the crypto landscape. Presently, their focus is on Rebel Satoshi (RBLZ), Shiba Inu (SHIB), and Zcash (ZEC)"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-20T09:30:11.000Z",
    "title": "Unleashing The Bull: The Astonishing 400% Rise Of An AI Crypto – Details",
    "url": "https://www.newsbtc.com/news/unleashing-the-bull-the-astonishing-400-rise-of-an-ai-crypto-details/",
    "description": "The merging of blockchain technology with the prowess of AI (artificial intelligence) has paved the way for groundbreaking initiatives. Among these, Bittensor (TAO) stands out as a cutting-edge protocol specifically developed for the advancement of machine learning models. This dynamic synergy between blockchain and AI not only underscores their capabilities but also heralds a new era of collaborative innovation. Bittensor (TAO), a cryptocurrency centered around artificial intelligence, has made notable traction in the trending altcoin space. Its value surged nearly fivefold in under 30 days, riding the wave of excitement around AI-focused cryptocurrencies. Related Reading: Kaspa Binance Listing Sparks Frenzy: 50% Price Surge Captures Investors’ Interest AI Crypto TAO Makes Presence Felt This rapid growth highlights Bittensor&#8217;s commanding presence in the current altcoin landscape and reflects the increasing interest in cryptocurrencies that leverage AI to reshape finance and technology. $TAO to the top 10 still probably the most obvious trade. Sell side liquidity on these CEXs is minimal. No real resistance. The market cap is a meme if the whales aren&#8217;t offloading their bags on you. It&#8217;s now the #1 AI project and we&#8217;ve only seen 2% of what AI is capable of. pic.twitter.com/yWzPYurxG7 — Eric Cryptoman (@EricCryptoman) November 18, 2023 At the time of writing, TAO is valued at $265, reflecting a commanding increase of 80% in the last seven days and an impressive leap of nearly 400% in the last 30 days. Based on data by TradingView, TAOUSDT tallied an all-time high of $267 on Monday, and boasts a market capitalization exceeding $1.27 billion. As such, Bittensor (TAO) has surpassed Render Network (RNDR), which had been the clear leader in the market for a few months, to become the leading artificial intelligence cryptocurrency, according to CoinGecko. TAOUSDT trading at $267 on the 24-hour chart: TradingView.com By integrating artificial intelligence and blockchain consensus, the Bittensor (TAO) project offers a fresh perspective. In order to create a decentralized economy, Bittensor plans to let AI models participate in blockchain consensus. Making Significant Strides In The Crypto Space Bittensor (TAO), an AI protocol based on open-source principles, was introduced to the public by Jacob Steeves, a former Google developer, on September 19, 2023. Source: Taostats Related Reading: Yearn Finance Tumbles: Rug Pull Rumors Swirl As Token Takes A 45% Hit Over the past two months, Bittensor (TAO) has made several significant announcements, encompassing notable improvements in miners&#8217; performance, the introduction of additional subnets, and important advancements in the building of huge language models, among other things. Meanwhile, an overwhelming majority of businesses (more than 70%) see blockchain and AI as complementary technologies, highlighting the mutually beneficial relationship between the two. TAO seven-day price action. Source: Coingecko An intriguing new dimension to the Bittensor narrative has emerged with the recent crypto market boom that followed OpenAI&#8217;s AI Developer Day on Nov. 6. Enhanced GPT-4 and GPT-3.5 natural language models are among the new AI capabilities unveiled by OpenAI, which may have an effect on AI tokens. This might be the reason why crypto-based AI is gaining popularity. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Negative Space/Pexels"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-20T09:17:51.000Z",
    "title": "Shanghai Tanlian and VeChain Join Forces in ‘Double Carbon Joint Innovation Lab’",
    "url": "https://www.crypto-news-flash.com/shanghai-tanlian-and-vechain-join-forces-in-double-carbon-joint-innovation-lab/?utm_source=rss&utm_medium=rss&utm_campaign=shanghai-tanlian-and-vechain-join-forces-in-double-carbon-joint-innovation-lab",
    "description": "<img width=\"1000\" height=\"697\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"VeChain\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-300x209.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-768x535.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Shanghai Tanlian has joined the &#8216;Double Carbon Joint Innovation Lab&#8217;, marking a significant step in China&#8217;s dual-carbon strategy. The collaboration with VeChain in the lab emphasizes blockchain innovation in the energy sector. As highlighted in my recent feeds on X account Collin Brown, the announcement of Shanghai Tanlian joining forces with VeChain in the &#8216;Double [...]"
  }
]