[
  {
    "source": "Cointelegraph",
    "date": "2023-11-21T16:02:22.000Z",
    "title": "Circle launches 'bridged USDC standard' for deploying to new networks",
    "url": "http://cointelegraph.com/news/circle-launches-bridged-usdc-standard-deploying-new-networks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/a9814611-005e-421a-b838-5d6c0c885a86.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Circle published a new standard that allows developers to launch an unofficial bridged version of USDC that can later become native and official.</p>\n                    <p><p>Circle has launched a new standard to <a href=\"https://www.circle.com/blog/bridged-usdc-standard\" target=\"_blank\" rel=\"noopener nofollow\">streamline</a> the process of launching its stablecoin, USDC, on new networks, according to a Nov. 21 blog post. </p><p>The new “bridged USDC standard” allows developers to launch the token through a two-phase process. In the first phase, the third-party developer has control of the token contracts, and the token on the new network is backed by a native version on another network. In the second phase, Circle takes control of the contracts, and the token becomes backed directly by Circle’s reserves. The second phase may not occur with all deployments.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Introducing Bridged USDC Standard, a new way to expand access to <a href=\"https://twitter.com/search?q=%24USDC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDC</a> &amp; reduce fragmentation.<br><br>EVM blockchain &amp; rollup teams can now deploy a bridged USDC token contract with optionality for Circle to seamlessly upgrade to native issuance in the future.<a href=\"https://t.co/suSgllMQoQ\">https://t.co/suSgllMQoQ</a></p>&mdash; Circle (@circle) <a href=\"https://twitter.com/circle/status/1726963699142062208?ref_src=twsrc%5Etfw\">November 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the post, the token produced in the first phase will be “unofficial and not issued nor redeemable by Circle,” but will serve “as a proxy to USDC that’s extensible to any ecosystem where bridging is made possible.” If Circle and the third-party developer later decide they want to make the token official, they can “seamlessly upgrade to native issuance in the future.”</p><p>Circle said it's releasing the standard to eliminate the need for “migrations,” where users must swap an unofficial version of USDC for an official version after it becomes available. If developers use the new standard, migrations should become unnecessary, as it allows the unofficial tokens already held in a user’s wallet to become official.</p><p>The standard’s Github documentation <a href=\"https://github.com/circlefin/stablecoin-evm/blob/master/doc/bridged_USDC_standard.md\" target=\"_blank\" rel=\"noopener nofollow\">requires</a> developers to use a bridge with upgrade functionality for specific functions and refrain from upgrading the bridge once the token is issued.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/circle-mulling-public-launch-next-year-bloomberg\"><strong>Stablecoin issuer Circle weighing up 2024 public launch: Report</strong></a></em></p><p>Once the developer and Circle decide to transition the token to an official version, the third-party developer can freeze new mints on the bridge and “reconcile in-flight bridging activity to harmonize the total supply of native USDC.” Ownership of the contract can then be transferred to Circle, at which point the native coins backing the tokens on the new network will be burnt, causing the new network’s tokens to be backed directly by Circle’s reserves.</p><p>In September, Circle <a href=\"https://cointelegraph.com/news/usd-coin-expands-base-optimism-networks\">launched a native Base network version</a> of USDC. In October, it <a href=\"https://cointelegraph.com/news/circle-launches-usdc-tokens-on-polygon\">did the same for Polygon</a>.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-21T16:00:00.000Z",
    "title": "Navigating the crypto frontier: Pioneers’ insights for new Web3 professionals",
    "url": "http://cointelegraph.com/innovation-circle/navigating-the-crypto-frontier-pioneers-insights-for-new-web3-professionals",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/037774fb-fbdc-432c-89d0-17a522ffd40d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto and blockchain industry still offers unlimited possibilities if you come in with your eyes open.</p>\n                    <p><p>Entrepreneurs and professionals eyeing Web3 are likely both enthusiastic and wary. While seeming “overnight success” stories are alluring, there’s also no doubt that the crypto and blockchain industry has seen its share of bad actors. Further, the unfamiliarity of the industry’s technologies, methods and philosophies can be daunting to a newcomer.</p> <p>The members of <a href=\"https://circle.cointelegraph.com/?_ga=2.198681135.1484442309.1667485998-1927108766.1652715111\">Cointelegraph Innovation Circle</a> are crypto pioneers who’ve played a significant role in scouting and forging a path ahead for those who are just now entering the industry. Below, 14 of them discuss the details and truths they wish they’d known when they first entered crypto and blockchain. Tap into their experience to launch strong into Web3.</p> <h2>Don’t expect overnight success</h2> <p>Despite the quick pace of the crypto ecosystem, it’s rare for success to arrive overnight. While we’ve certainly seen projects exceed anyone’s wildest dreams, the majority face the uphill challenges of a crowded field and shifting public sentiment. For true believers, this is common knowledge often won through sober experience. Therefore, it’s wise to temper your expectations and plan for rainy days. –<a href=\"https://circle.cointelegraph.com/u/83c71aad-8be6-470a-aaf9-7f146821217c\"> Oleksandr Lutskevych</a>,<a href=\"http://cex.io\"> CEX.IO</a></p> <h2>Nurture your community</h2> <p>Community is the ultimate competitive edge in Web3; it is the most important thing to focus on. Your community adopts your products early, gives you feedback to reach product-market fit, acts as a distribution channel and actively participates in making everything about your project better. A project with a strong community can weather any kind of storm. –<a href=\"https://circle.cointelegraph.com/u/f4ebe406-f3c2-4453-a667-edbcd9253956\"> Abhishek Saxena</a>,<a href=\"http://polygon.technology\"> Polygon Technologies</a></p> <h2>Embrace your unique skills</h2> <p>Reflecting on my Web3 journey, key lessons emerge. First, you are not too late to get into the evolving Web3 space; ample opportunities persist. Foundational reading, like Satoshi’s paper, is crucial, as is grasping key terms. Contrary to the tech-only myth, Web3 values diverse skills, including marketing, community, legal and finance. Embrace your unique skills; they’re vital to Web3’s success. –<a href=\"https://circle.cointelegraph.com/u/963834e5-2157-4737-bb21-82dc7a3ccb37\"> Sandy Carter</a>,<a href=\"https://unstoppabledomains.com/\"> Unstoppable Domains</a></p> <h2>Protect your reputation as an asset</h2> <p>Make no mistake, there are a lot of bad apples in this industry. This has been, and continues to be, a shock to me. I’ve learned to live with it because I don’t expect the industry to self-regulate anymore. My advice is time-tested: Your reputation is an asset. How you trade on it is up to you. There are projects that don’t cut corners and are forging new ground; I believe mine is one. Keep your eyes open. –<a href=\"https://circle.cointelegraph.com/u/565d28ae-aad2-4ed9-bc34-a68b9954700e\"> Stephanie So</a>,<a href=\"http://geeq.io\"> Geeq</a></p> <h2>Prepare for the speed of regulatory evolution</h2> <p>One thing I wish I’d known is how rapidly the regulatory environment can change and the significance of being adaptable. The legal frameworks around crypto and blockchain are continuously evolving, and a keen understanding of global regulations and compliance from the start would have been incredibly beneficial in navigating the complex Web3 landscape more effectively. –<a href=\"https://circle.cointelegraph.com/u/0d167285-44f8-41a6-9001-72aab6b4058d\"> Tomer Warschauer Nuni</a>,<a href=\"http://www.kryptomon.co\"> Kryptomon</a></p> <h2>Prioritize security at every step</h2> <p>It’s crucial to prioritize security at every step, from understanding best practices for securing wallets and private keys to thoroughly vetting projects and contracts before getting involved. The crypto and blockchain industry is full of potential, but it’s also a space where being informed, cautious and patient can make a huge difference in your journey toward success. –<a href=\"https://circle.cointelegraph.com/u/1fbaa63a-afa6-4780-8cd8-50788faae090\"> Myrtle Anne Ramos</a>,<a href=\"http://blocktides.com\"> Block Tides</a></p> <h2>Avoid emotion-driven decisions</h2> <p>As you navigate crypto and blockchain, prioritize deep learning over quick wins. The industry’s pace demands a solid foundation for sound decisions. Equally, respect the market’s volatility. While the allure of innovative projects is enticing, the landscape is ever-shifting. Approach Web3 projects with diligence and avoid emotion-driven decisions to ensure stability and success. –<a href=\"https://circle.cointelegraph.com/u/bbcf43d3-bf13-4749-9aba-de9959380c45\"> Maksym Illiashenko</a>,<a href=\"http://mynftwars.com\"> My NFT Wars: Riftwardens</a></p> <h2>Cultivate a healthy skepticism</h2> <p>Stepping into Web3, I quickly realized the importance of discernment. Amid the buzz and hype, I wish I’d known how to sift the genuine opportunities from mere buzzword allure. Newcomers — especially those from non-tech backgrounds — must cultivate a healthy skepticism. Dive deep, question trends and remember: In this industry, substance always outshines sparkle. –<a href=\"https://circle.cointelegraph.com/u/16cde551-5395-4ca9-8281-7152cbb88396\"> Tiago Serôdio</a>,<a href=\"https://www.partisiablockchain.com/\"> Partisia Blockchain</a></p> <h2>Keep thinking ahead</h2> <p>Act now, but plan for tomorrow. Instead of just chasing the latest trends, Web3 newcomers should dive deep into their research to figure out which big trend might be coming up next. Be grateful for moments of instant gratification, but always stay humble and, like a chess player, keep thinking ahead. –<a href=\"https://circle.cointelegraph.com/u/abc0e9e1-b580-49da-b9fb-105caa752b79\"> Wolfgang Rückerl</a>,<a href=\"https://entity.global\"> ENT Technologies AG</a></p> <h2>Explore Web3 in its entirety</h2> <p>The Web3 space is still very much in its infancy. Therefore, the opportunity to explore has never been more enticing. Fully embracing the space for what it has to offer should be a priority, as adoption and future developments are going to increase rapidly and unique starting opportunities will start to diminish. Be open-minded, and explore the Web3 realm in its entirety. –<a href=\"https://circle.cointelegraph.com/u/923e790f-d991-437d-a1eb-575af185daca\"> Ilias Salvatore</a>,<a href=\"http://flooz.xyz\"> Flooz XYZ</a></p> <h2>Grow your brand and the industry through specialized knowledge</h2> <p>There is immense power in becoming an expert within a defined niche of Web3. This industry is in its infancy, and those who express passion for and elevated knowledge of a particular product or sector can help both the industry and their personal brand grow. The decentralized aspect of Web3 makes the industry community-focused, allowing thought leaders to reach large audiences in an impactful manner. –<a href=\"https://circle.cointelegraph.com/u/84007b98-8c0e-4c02-8807-ff7876b7765d\"> Megan Nyvold</a>,<a href=\"http://bingx.com/en-us/\"> BingX</a></p> <h2>Know that Web3 isn’t really the ‘Wild West’</h2> <p>Web3 has been considered the “Wild West,” with minimal rules and a relatively chaotic space, but the truth is that regulation within Web3 is constantly evolving. Understanding the potential for regulatory changes and the importance of staying compliant would have been valuable knowledge from the start. –<a href=\"https://circle.cointelegraph.com/u/5cae7f29-8588-4852-bb31-c66fd1d805c6\"> Anthony Georgiades</a>,<a href=\"https://pastel.network/\"> Pastel Network</a></p> <h2>Understand that change is constant</h2> <p>Surprises are inevitable, regardless of your familiarity with crypto, decentralized finance or decentralized autonomous organizations. Web3 is an ever-evolving realm of financial, gaming, governance and security experiments. So, always maintain an open-minded approach, as change is constant. –<a href=\"https://circle.cointelegraph.com/u/bcb46b42-12ad-4937-8069-b741c596ef3c\"> Sheraz Ahmed</a>,<a href=\"http://storm.partners/\"> STORM Partners</a></p> <h2>Build an MVP before approaching investors</h2> <p>One thing I wish I had known when I entered the industry is that gaining access to funding is easier when you already have a minimum viable product. Having an MVP also reduces the time period between obtaining funding and launching. Further, along with funding comes the expertise of your investors, who can prove highly useful in putting you in touch with all kinds of expert professionals. –<a href=\"https://circle.cointelegraph.com/u/1d9f8b61-2e77-4452-a837-4db4245d01ca\"> Abhishek Singh</a>,<a href=\"http://acknoledger.com/\"> Acknoledger</a></p> <hr class=\"wp-block-separator\" /> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-21T16:04:47.000Z",
    "title": "Wintermute Asia completes first block trade of options via CME Group",
    "url": "https://crypto.news/wintermute-asia-completes-first-block-trade-of-options-via-cme-group/",
    "description": "Wintermute Asia, a branch of the algorithmic trading firm Wintermute Group, has executed its first options block trade through CME Group, marking a significant collaboration between crypto and traditional financial markets."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-21T15:54:09.000Z",
    "title": "Open Network announces initiation of TON bootcamp  ",
    "url": "https://crypto.news/open-network-announces-initiation-of-ton-bootcamp/",
    "description": "In a Nov. 21 press release shared with crypto.news, TON Future3 Campus, in collaboration with The Open Network (TON) Foundation, revealed the initiation of TON bootcamp."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-21T16:00:33.000Z",
    "title": "Analyst Sets $30,000 Floor For Bitcoin, But Can We Forget 2021’s Misfire?",
    "url": "https://www.newsbtc.com/bitcoin-news/analyst-sets-30000-floor-for-bitcoin-but-can-we-forget-2021s-misfire/",
    "description": "The price of Bitcoin presses on towards the upside and, once again, touched a critical resistance close to $38,000. The cryptocurrency could trend sideways at its current levels in the short term, leading analysts to find the support level that could withstand a spike in selling pressure. Related Reading: XRP Price: Cup And Handle Pattern Hints At Short-Term 208% Surge As of this writing, Bitcoin trades at $37,160 with sideways movement in the last 24 hours. BTC held a 2% profit the previous week, while Cardano (ADA) and Solana (SOL) took the lead in the current price action. The History Of Bitcoin Reveals Mega Bottom For The Current Cycle? On-chain analyst Willy Woo shared a prediction on his social media channels based on the Bitcoin Cost Basis Density. The analyst investigated the BTC supply dynamics to find where the cryptocurrency could hold off the bears. Based on his findings, the analyst stated that Bitcoin is unlikely to revisit the $30,000. As seen in the chart below, each time in BTC’s history that the supply moved to long-term investors, the cryptocurrency trends to the upside without returning to this price point: $30,000 for the current cycle. The analyst set 3 conditions to confirm this pattern: first, Bitcoin must be exiting a bear market; second, there must be signs of a “high agreed price;” finally, the cryptocurrency must be about to go through a “Halving Event.” During the latter, the supply rewards for mining BTC are cut in half along with its production, which often leads to “supply shocks,” according to some analysts. Halving events coincide with the BTC bull run, but other analysts warned against corresponding Bitcoin bull runs with the reduction in its supply. The Biggest Narrative Driving The Bull Run However, Woo claims that the potential approval of a Bitcoin Exchange Traded Fund (ETF) might be the more significant catalyst for the cryptocurrency. If the US Securities and Exchange Commission (SEC) approves the product, billions of dollars flow into the cryptocurrency. The analyst added: Bitcoin is far from a commodity market at saturation. What we&#8217;re seeing across the 13 yrs of this chart is BTC&#8217;s widespread adoption. The network had 10,000 users in 2010, today there&#8217;s well over 300m people using it as a store of value technology. This is only going to climb with a spot ETF. The majority of users replying to Woo’s forecast highlighted his 2021 prediction. At that time, the analyst also set some levels that were supposed to hold against a selloff but quickly folded against unprecedented selling pressure. Related Reading: Bitcoin About To Smash The $38,000 Barrier – Decoding the Next Moves It remains to be seen if this prediction will suffer the same fate or if the Bitcoin price can hold above $30,000 for the next bull cycle. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-21T15:52:30.000Z",
    "title": "Argentina’s Bitcoin Bet: Will Javier Milei Make BTC Legal Tender?",
    "url": "https://www.crypto-news-flash.com/argentinas-bitcoin-bet-will-javier-milei-make-btc-legal-tender/?utm_source=rss&utm_medium=rss&utm_campaign=argentinas-bitcoin-bet-will-javier-milei-make-btc-legal-tender",
    "description": "<img width=\"1280\" height=\"799\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-300x187.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-1024x639.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-768x479.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-163x102.png 163w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Argentina has elected Javier Milei as the new president, he is a pro-Bitcoin advocate leading to speculation that the country may adopt BTC as legal tender. Adoption of BTC in the region would be positive for the citizens with the country facing inflation of nearly 150 percent and foreign currency drying. The crypto community is [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-21T16:08:00.000Z",
    "title": "Will the SEC Intervene in FTX’s Mission to Liquidate Assets?",
    "url": "https://coinedition.com/will-the-sec-intervene-in-ftxs-mission-to-liquidate-assets/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/08.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SEC Intervene in FTX Mission\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/08.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/08-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/08-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto community has been abuzz with the Securities and Exchange Commission’s (SEC) increasing scrutiny of crypto companies. However, Parrot Capital, a popular voice in the crypto space, recently shook the community with revelations regarding the growing illegal trades and fraud in the crypto space. Shedding light on the SEC’s recent accusations against the crypto [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/will-the-sec-intervene-in-ftxs-mission-to-liquidate-assets/\">Will the SEC Intervene in FTX’s Mission to Liquidate Assets?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-21T15:53:00.000Z",
    "title": "Analysts Pick Top 3 Performing AI Tokens For Next Bull Cycle",
    "url": "https://coinedition.com/analysts-pick-top-3-performing-ai-tokens-for-next-bull-cycle/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Analysts Pick Top 3 Performing AI Tokens For Next Bull Cycle\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Analyst-Forecasts-Altcoin-Rally-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>AJ noted that he was about to start accumulating AGIX tokens in his public portfolio. Armstrong thinks that GRT is a unique coin with a utility unmatched by any other project. Ben Armstrong, AJ, and Corey have revealed their favorite AI tokens for the next bull cycle. Three crypto analysts, Ben Armstrong, AJ, and Corey, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/analysts-pick-top-3-performing-ai-tokens-for-next-bull-cycle/\">Analysts Pick Top 3 Performing AI Tokens For Next Bull Cycle</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]