[
  {
    "source": "Cointelegraph",
    "date": "2023-10-09T04:52:32.000Z",
    "title": "Crypto exchange Upbit was targeted by hackers 159K times in H1: Report",
    "url": "https://cointelegraph.com/news/crypto-exchange-upbit-targeted-hackers-159000-times-in-h1-2023",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/3ab309d2-3f50-4f44-9e7f-3f89b021c606.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The figure is more than double recorded in the first half of 2022 and a massive 1800% increase from the same period in 2020, according to the operating firm.</p>\n                    <p><p>South Korean cryptocurrency exchange Upbit has been targeted by hackers on more than 159,000 occasions in the first half of 2023, according to its operating firm. </p><p>The figures were reported by Dunamu — the <a href=\"https://cointelegraph.com/news/crypto-exchange-upbit-fix-fake-aptos-token-issue\">firm operating Upbit</a> — to South Korean Representative Park Seong-jung of the People Power Party, <a href=\"https://www.yna.co.kr/view/AKR20231007053200002?section=search\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to an Oct. 9 report by South Korea-based Yonhap News Agency.</p><p>The figure marks a 117% increase from the first half of 2022 and a whopping 1800% increase from the first half of 2020.</p><p>Upbit is one of South Korea’s largest cryptocurrency exchanges with 24 hour trading volume of around $1.2 billion, according to CoinGecko. Other major exchanges include Bithumb, Coinone and Gopax. </p><p>To counter the rise in security breach attempts, Dunamu said Upbit increased the proportion of funds it holds in cold wallets to 70% to strengthen security. Upbit also upped its security measures for funds held in hot wallets.</p><p>Hot wallets tend to be hacked more often than cold wallets because the private keys are stored online as opposed to a cold wallet where they’re stored on external hard drives and USBs.</p><p><a href=\"https://cointelegraph.com/news/upbit-hack-stolen-eth-worth-millions-on-the-move-to-unknown-wallets\">Upbit suffered a $ 50 million exploit</a> in 2019. But since then, Upbit hasn’t suffered a single security breach, a Dunamu spokesperson told Yonhap.</p><blockquote>\"After the hacking incident in 2019, we took various measures to prevent recurrence, such as distributing hot wallets and operating them, and to date, not a single cyber breach has occurred.\"</blockquote><p>However, <a href=\"https://cointelegraph.com/news/crypto-exchange-upbit-fix-fake-aptos-token-issue\">Upbit had to halt Aptos token services</a> in late September after the platform failed to recognize a fake token “ClaimAPTGift.com” which made its way to 400,000 Aptos wallets.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/   Crypto Deposits Security Thread <br><br>Today’s Upbit incident highlights a crucial aspect that is often overlooked - the security of crypto deposits. While a lot is discussed around private key management &amp; withdrawals security, deposits have a similar attack surface. ⤵️ <a href=\"https://t.co/5NEAyJB63N\">pic.twitter.com/5NEAyJB63N</a></p>&mdash; Nass Eddequiouaq (@nassyweazy) <a href=\"https://twitter.com/nassyweazy/status/1706126681801736280?ref_src=twsrc%5Etfw\">September 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Seong-jung acknowledged that <a href=\"https://cointelegraph.com/news/huobi-global-crypto-exchange-hacked-report\">cryptocurrency hacks</a> have increased across the board but called on the South Korean government to take more action:</p><blockquote>“The Ministry of Science and Technology must conduct large-scale whitewashing mock tests and investigate information security conditions in preparation for cyber attacks against virtual asset exchanges where hacking attempts are frequent.”</blockquote><p>“The role of the Ministry of Science and ICT in managing and supervising them is ambiguous,” Seong-jung added.</p><p>Cointelegraph reached out to Upbit for comment but did not receive an immediate response.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinex-crypto-exchange-suspected-hacked-crypto-moved\"><strong><em>CoinEx exchange drained of $27M worth of crypto in suspected hack </em></strong></a></p><p>Meanwhile, crypto exchanges have been targeted in a string of attacks in September. </p><p>Hong Kong-b exchange <a href=\"https://cointelegraph.com/news/coinex-compromised-private-keys-behind-70-million-hack\">CoinEx suffered a $70 million hack</a> in September after one of the firm’s private keys was compromised. The firm stated that affected users will be compensated for any lost funds.</p><p>In a separate attack, Huobi Global’s HTX exchange <a href=\"https://cointelegraph.com/news/huobi-global-crypto-exchange-hacked-report\">lost $7.9 million in a Sept. 24 exploit.</a></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/3-4-billion-bitcoin-popcorn-tin-silk-road-hacker/\"><strong><em>$3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-09T04:58:25.000Z",
    "title": "Litecoin Price Prediction: LTC Could Retest $60 Before Fresh Surge",
    "url": "https://www.newsbtc.com/analysis/ltc/litecoin-price-prediction-ltc-retest-60/",
    "description": "Litecoin price is struggling to gain pace above $66.40 against the US Dollar. LTC could revisit the $60 support before the bulls take a strong stand. Litecoin is correcting losses from the $63 support zone against the US Dollar. The price is now trading below $66 and the 100 simple moving average (4 hours). There is a key contracting triangle forming with resistance near $65.50 on the 4-hour chart of the LTC/USD pair (data feed from Kraken). The price could drop toward the $60 support before it starts a fresh increase. Litecoin Price Signals Bearish Move This past week, there was a fresh decline in Bitcoin, Ethereum, Litecoin, and other altcoins against the US Dollar. LTC price formed a top near $68.40 before it started a fresh decline. The price traded below the $66.40 and $65.00 support levels. It retested the $63.00 support zone. A low was formed near $63.01 and the price is now attempting a fresh increase. There was a move above the $65.20 resistance. The price spiked above the 50% Fib retracement level of the downward move from the $68.38 swing high to the $63.01 low. Litecoin is now trading below $66 and the 100 simple moving average (4 hours). There is also a key contracting triangle forming with resistance near $65.50 on the 4-hour chart of the LTC/USD pair. On the upside, immediate resistance is near the $65.50 zone. The next major resistance is near the $6.40 level. It is close to the 61.8% Fib retracement level of the downward move from the $68.38 swing high to the $63.01 low. If there is a clear break above the $66.40 resistance, the price could start another strong increase. Source: LTCUSD on TradingView.com In the stated case, the price is likely to continue higher toward the $68.40 and $70 levels. Any more gains might send LTC’s price toward the $75 resistance zone. Downside Thrust in LTC? If Litecoin price fails to clear the $66.40 resistance level, there could be a fresh decline. Initial support on the downside is near the $63.00 level. The next major support is forming near the $60 level, below which there is a risk of a move toward the $58.00 support. Any further losses may perhaps send the price toward the $55 support. Technical indicators: 4-hour MACD – The MACD is now losing pace in the bullish zone. 4-hour RSI (Relative Strength Index) – The RSI for LTC/USD is still below the 50 level. Major Support Levels – $63.00 followed by $60.00. Major Resistance Levels – $66.40 and $68.40."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-09T05:00:36.000Z",
    "title": "IOTA’s Breakthrough: LINKS Foundation to Develop Digital Passport for Raw Materials in Mastermine EU Project",
    "url": "https://www.crypto-news-flash.com/iotas-breakthrough-links-foundation-to-develop-digital-passport-for-raw-materials-in-mastermine-eu-project/?utm_source=rss&utm_medium=rss&utm_campaign=iotas-breakthrough-links-foundation-to-develop-digital-passport-for-raw-materials-in-mastermine-eu-project",
    "description": "<img width=\"2560\" height=\"1709\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/epic_images-IOTA-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"IOTA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/epic_images-IOTA-1.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/epic_images-IOTA-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/epic_images-IOTA-1-1024x684.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/epic_images-IOTA-1-768x513.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/epic_images-IOTA-1-1536x1025.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/epic_images-IOTA-1-2048x1367.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/epic_images-IOTA-1-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/epic_images-IOTA-1-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/epic_images-IOTA-1-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/epic_images-IOTA-1-48x32.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />LINKS is utilizing IOTA Distributed Ledger Technology (DLT) to forge a pioneering digital passport for raw materials under the Mastermine EU project, contributing to reshaping the European Union (EU) mining landscape. MASTERMINE’s multi-faceted approach targets multiple axes, including culture, strategy, and tactics, intending to facilitate a structural multilevel alteration in mining operations with an emphasis [...]"
  }
]