[
  {
    "source": "Decrypt",
    "date": "2024-02-21T18:53:51.000Z",
    "title": "Yuga Labs Founder Garga Returns as CEO to ‘Unshackle’ Bored Ape Team",
    "url": "https://decrypt.co/218401/bored-ape-yuga-labs-garga-ceo-returns",
    "description": "Big changes are coming as Greg “Garga” Solano takes the helm at Yuga Labs, apparently pushing out Daniel Alegre in the process."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-21T19:06:49.000Z",
    "title": " Price analysis 2/21: BTC, ETH, BNB, SOL, XRP, ADA, AVAX, DOGE, LINK, DOT ",
    "url": "https://cointelegraph.com/news/price-analysis-2-21-btc-eth-bnb-sol-xrp-ada-avax-doge-link-dot",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMGIwM2NkNmMtYzAxMS00MmQxLTg0ZDctYThiOWUwOTdhODkwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bulls failed to hold Bitcoin price above $52,000, possibly marking the start of a short-term trend change in BTC and altcoins. </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has been trading sideways for the past few days, indicating a tough battle between the bulls and the bears. Will the sellers overpower the buyers and start a short-term correction, or could the buyers come out on top? That is the question on every crypto investor’s mind.</p><p>Dwindling hopes of an early rate cut by the Federal Reserve have resulted in profit booking in the S&amp;P 500 Index. That could signal a risk-off sentiment in the near term, increasing the risk of a pullback in Bitcoin and select altcoins.</p><p>However, the dip may not change the long-term bullish view. Investors are likely to view every dip as a buying opportunity because of Bitcoin’s upcoming halving in April, which has historically been a bullish event.</p><p><a href=\"https://cointelegraph.com/news/price-analysis-2-21-btc-eth-bnb-sol-xrp-ada-avax-doge-link-dot\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-21T18:57:29.000Z",
    "title": " Would Sam Altman&#039;s $7 trillion ask really secure our future? ",
    "url": "https://cointelegraph.com/news/would-sam-altmans-7-trillion-ask-really-secure-our-future",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZGI1NDJkMWItNzY3Yy00MzFjLWE4ZDAtMTJhYzBiMWFmNWE0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>OpenAI CEO Sam Altman wants to raise $7 trillion for chip production to help AI systems, but he has yet to show AI is moving in a direction that will help us.</p>\n                    <p><p>OpenAI co-founder Sam Altman is reportedly <a href=\"https://cointelegraph.com/news/openai-seeking-trillions-ai-chip-development\">seeking to raise up to $7 trillion</a> for a project addressing the massive global shortage in semiconductor chips, prompted by the rapid growth in the demand for generative artificial intelligence (GenAI). But it’s much more than that, according to Altman:</p><p>“We believe the world needs more AI infrastructure — fab capacity, energy, data centers, etc. — than people are currently planning to build. Building massive-scale AI infrastructure, and a resilient supply chain, is crucial to economic competitiveness. OpenAI will try to help!” Altman wrote in an X post.</p><p>Is it indeed for securing “our collective future”? Or OpenAI's future?</p><p><a href=\"https://cointelegraph.com/news/would-sam-altmans-7-trillion-ask-really-secure-our-future\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-21T19:01:11.000Z",
    "title": "LBank Exchange Will List PAPOCOIN (PAPO) on February 23, 2024",
    "url": "https://cryptodaily.co.uk/2024/02/lbank-exchange-will-list-papocoin-papo-on-february-23-2024",
    "description": "LBank Exchange Will List PAPOCOIN (PAPO) on February 23, 2024"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-21T18:42:00.000Z",
    "title": "Ripple (XRP) holders scramble to buy last of Pushd (PUSHD) presale after Ethereum (ETH) fund buy in early",
    "url": "https://cryptodaily.co.uk/2024/02/ripple-xrp-holders-scramble-to-buy-last-of-pushd-pushd-presale-after-ethereum-eth-fund-buy-in-early",
    "description": "Amidst Ethereum (ETH) gaining renewed attention from both investors and institutions due to a rise in price, Ripple (XRP) holders are quickly getting involved in the Pushd (PUSHD) presale. This interplay of legal conflicts and market dynamics adds a distinctive element to the cryptocurrency narrative."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-21T19:04:19.000Z",
    "title": "Why Michael Saylor believes selling Bitcoin now is a huge mistake — Inside MicroStrategy’s plan",
    "url": "https://www.cryptopolitan.com/michael-saylor-believes-selling-btc-mistake/",
    "description": "In a recent interview with Bloomberg TV, Michael Saylor, CEO of MicroStrategy, emphatically stated his company&#8217;s strategy regarding its significant bitcoin holdings and indicated a long-term commitment to the cryptocurrency. Despite the volatile nature of the digital asset market, Saylor&#8217;s remarks reveal a deep conviction in Bitcoin&#8217;s value proposition and its role in the future [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-21T19:00:16.000Z",
    "title": "Uniswap Expands Reach: Deploys v2 Protocol On Six New Chains Including Arbitrum And Polygon",
    "url": "https://www.newsbtc.com/news/uniswap/uniswap-expands-reach-deploys-v2-protocol-on-six-new-chains-including-arbitrum-and-polygon/",
    "description": "Uniswap (UNI), one of the largest decentralized cryptocurrency exchanges (DEX) by trading volume, has made an important announcement regarding deploying its v2 protocol on six additional chains.  The chains on which the v2 protocol has been deployed include Arbitrum (ARB), Polygon (MATIC), Optimism (OP), Base, Binance Smart Chain (BSC), and Avalanche (AVAX). Uniswap Widens v2 Protocol Deployment According to a recent post on X (formerly Twitter) by Uniswap Labs, the software product developer working on the protocol, the decision to deploy the v2 protocol on more chains is primarily driven by the desire to simplify the experience for Liquidity Providers (LPs). While the protocol’s v3 offers advanced features tailored for active liquidity providers, the development team believes the v2 protocol offers a more “straightforward approach.”  By default, v2 pools cover the entire price range, reducing the need for upfront decisions and minimizing the active involvement of liquidity providers. This simplification streamlines the process and makes it more accessible to a broader range of users, according to the announcement.  Related Reading: AVAX Slips, Adding Tension To $365 Million Avalanche Token Unlock Drama Another benefit of using the v2 protocol on multiple chains, according to Uniswap Labs, is its cost efficiency. Creating pools on v2 is more gas efficient than other versions, resulting in lower gas costs to add liquidity.  This cost reduction can be translated into savings for users, making swaps on the platform “incredibly affordable.” In addition, the use of v2 on Layer 2 scaling solutions significantly reduces the risk of frontrunning and manipulative practices known as Miner Extractable Value (MEV).  Ultimately, by offering an official v2 deployment directly accessible through the Uniswap interface, the developers suggest that users can be assured of a safe and secure environment for their swaps. UNI Price Dip, Platform Metrics Remain Solid Despite the recent developments that could attract investors&#8217; attention and drive broader adoption of the Uniswap protocol, the exchange&#8217;s native token, UNI, is currently undergoing a significant correction in line with the overall market trend. Currently, UNI is trading at $7.22, representing a 4.4% price drop in the past 24 hours and a 1.1% decline in the last trading hour. However, it&#8217;s worth noting that UNI has been one of the better-performing tokens in the market, with price increases of 14.7% and 16.8% in the past fourteen and thirty days, respectively. Furthermore, according to data from Token Terminal, the Uniswap ecosystem continues to exhibit substantial growth in key metrics.  Related Reading: Bitcoin FOMO Hasn’t Spiked Yet: Green Signal For Rally To Continue? The fully diluted market capitalization of Uniswap stands at $7.56 billion, reflecting the total value of all tokens if they were fully in circulation. This figure has experienced a notable increase of 18.4% over the past month.  In contrast, the circulating market capitalization, which considers the currently circulating tokens, is valued at $6.94 billion, indicating a 19.9% increase over the same period. Despite the overall surge in market capitalization, the trading volume of the UNI token has experienced a significant decline of 69.3% over the past 30 days, amounting to $2.79 billion.  The total value locked (TVL), a measure of the value of assets locked within Uniswap&#8217;s smart contracts, has also experienced a 14.4% increase, reaching $4.76 billion.  Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-21T19:01:05.000Z",
    "title": "LBank Exchange Will List PAPOCOIN (PAPO) on February 23, 2024",
    "url": "https://www.crypto-news-flash.com/lbank-exchange-will-list-papocoin-papo-on-february-23-2024/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-exchange-will-list-papocoin-papo-on-february-23-2024",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/papo_1708530785D8VdfT3zHU.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/papo_1708530785D8VdfT3zHU.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/papo_1708530785D8VdfT3zHU-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/papo_1708530785D8VdfT3zHU-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/papo_1708530785D8VdfT3zHU-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/papo_1708530785D8VdfT3zHU-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Road Town, BVI, February 21st, 2024, Chainwire In a significant move for cryptocurrency and mobile technology enthusiasts, LBank Exchange, a premier global digital asset trading platform, has announced the listing of PAPOCOIN (PAPO) on February 23, 2024. Users of LBank Exchange can brace themselves for the PAPO/USDT trading pair, which will go live at 10:00 [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-21T19:05:09.000Z",
    "title": "Investor That Bought Ethereum (ETH) Under a Dollar Sees Bitcoin (BTC) ‘A Lot Higher’ by End of the Year",
    "url": "https://dailyhodl.com/2024/02/21/investor-that-bought-ethereum-eth-under-a-dollar-sees-bitcoin-btc-a-lot-higher-by-end-of-the-year/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Woo-Says-Bitcoin-Mirroring.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Woo-Says-Bitcoin-Mirroring.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Woo-Says-Bitcoin-Mirroring.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Woo-Says-Bitcoin-Mirroring.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Woo-Says-Bitcoin-Mirroring.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Woo-Says-Bitcoin-Mirroring.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Woo-Says-Bitcoin-Mirroring.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Galaxy Digital CEO Mike Novogratz is predicting that Bitcoin (BTC) will end 2024 much higher than its current value. In a new interview with CNBC, the early crypto investor who bought Ethereum (ETH) around $1 says that increased adoption through the newly launched spot BTC exchange-traded funds (ETFs) may continue to fuel Bitcoin’s bullish momentum [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/21/investor-that-bought-ethereum-eth-under-a-dollar-sees-bitcoin-btc-a-lot-higher-by-end-of-the-year/\">Investor That Bought Ethereum (ETH) Under a Dollar Sees Bitcoin (BTC) ‘A Lot Higher’ by End of the Year</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]