[
  {
    "source": "Cryptopolitan",
    "date": "2023-11-17T08:28:03.000Z",
    "title": "Bithumb scandal deepens as Lee Jeong-hoon faces jail time",
    "url": "https://www.cryptopolitan.com/bithumb-scandal-deepen-lee-jeong-face-jail/",
    "description": "In a significant development within South Korea&#8217;s cryptocurrency industry, Lee Jeong-hoon, the former chairman of the major crypto exchange Bithumb, faces a pivotal moment with an eight-year jail sentence looming over alleged fraudulent activities. As the January 18, 2024, appeal hearing nears, the case has become a focal point, highlighting critical issues surrounding crypto governance ... <a title=\"Bithumb scandal deepens as Lee Jeong-hoon faces jail time\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bithumb-scandal-deepen-lee-jeong-face-jail/\" aria-label=\"More on Bithumb scandal deepens as Lee Jeong-hoon faces jail time\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-17T08:35:54.000Z",
    "title": "Wall Street Expert Predicts Ripple IPO Date",
    "url": "https://www.newsbtc.com/ripple-2/wall-street-expert-predicts-ripple-ipo-date/",
    "description": "Wall Street financial expert Linda Jones recently offered a detailed forecast regarding the potential Initial Public Offering (IPO) of Ripple. Speaking at a Fireside chat with Linqto, a pre-IPO investment platform, Jones outlined her insights into the expected timeline and factors influencing Ripple&#8217;s decision to go public. Jones stated via X, “Here is my interview with Linqto today. We talked about when Ripple might go public, my back of the envelope calculation for what the stock might be worth and potential acquisition targets.” Ripple IPO In May 2024? Despite Ripple&#8217;s apparent lack of immediate need for IPO-related funds, Jones suggested that investor pressure might compel the company&#8217;s executives towards this path. She elaborated, “Well like I said, Ripple was founded in 2012, and I think their investors want the exit and Brad [Garlinghouse] will get pressure to do that even though they don&#8217;t need the money from the IPO.” Related Reading: Ripple Introduces AMMs To XRPL, But Is This Good Or Bad For XRP Price Her forecast hinges on a broader economic outlook, predicting a bull market spurred by decreasing inflation and interest rates, thereby creating a conducive environment for public offerings. “I do think we will go into this incredible bull market that will happen from the drop of inflation and interest rates that will lead to a very strong rise in stocks that will allow the IPO market to get very hot next year,” Jones added. Jones pinpointed mid-May 2024, specifically around May 15, as the ideal window for Ripple&#8217;s IPO, contingent on favorable market conditions and company readiness. “I think there is an opportunity if Ripple wants to go public next year that mid-May would be an ideal time, right around May 15 would be an ideal time &#8211; that&#8217;s my first target that they might go public if everything – the stars, the Sun, and the Moon – lined up, and they wanted to go public,” she explained. Related Reading: Ripple Vs. SEC: Epic Battle Unfolds Over $770M Disgorgement Demand However, she also cautioned about the uncertainty of this timeline, indicating that if Ripple misses this window, the next viable opportunity might not arise until 2025. “If it doesn’t happen, then I think it probably won&#8217;t happen until 2025,” Jones remarked. One Roadblock Remains To Be Removed Further complicating Ripple&#8217;s path to an IPO is the ongoing legal conflict with the US Securities and Exchange Commission (SEC). Ripple CEO Brad Garlinghouse has acknowledged this challenge, noting that SEC approval for Ripple’s Form S-1 Registration Statement is necessary for an IPO. As long as the legal battle persists, this approval remains uncertain. At press time, the XRP price traded at $0.6165 after dropping below the 0.382 Fibonacci retracement level. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-17T08:25:06.000Z",
    "title": "Цена Dogecoin (DOGE) выросла на 10%, а объемы транзакций достигли 3-месячного максимума",
    "url": "https://www.crypto-news-flash.com/dogecoin-doge-price-surges-by-10-as-transaction-volumes-reach-3-month-high/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-doge-price-surges-by-10-as-transaction-volumes-reach-3-month-high",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-29T004104.488.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shibarium testnet\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-29T004104.488.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-29T004104.488-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-29T004104.488-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Цена Dogecoin (DOGE) выросла на 5%, а объем транзакций достиг трехмесячного максимума, опередив основные альткоины. Значительная активность китов и ажиотаж вокруг отправки физического токена Dogecoin на Луну способствуют положительной динамике монеты. Dogecoin бросает вызов рыночным тенденциям На фоне широкого криптовалютного рынка Dogecoin (DOGE) демонстрирует уникальный курс, опередив другие альткоины благодаря значительному росту цены на 5%. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-17T08:24:15.000Z",
    "title": "What Will be the Next Big Meme Coin?",
    "url": "https://www.crypto-news-flash.com/what-will-be-the-next-big-meme-coin/?utm_source=rss&utm_medium=rss&utm_campaign=what-will-be-the-next-big-meme-coin",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-54.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-54.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-54-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-54-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />NuggetRush is one of the most promising new ICOs on the market. It is a combination of memes, P2E, GameFi, and NFT. Experts predict that there will be a 4,500% increase in its value immediately after launch. The meme ecosystem is both promising and competitive—perhaps the most competitive in the crypto space. With new tokens [...]"
  }
]