[
  {
    "source": "Cointelegraph",
    "date": "2023-08-29T11:47:23.000Z",
    "title": "Media companies grapple with AI both inside and outside newsrooms ",
    "url": "https://cointelegraph.com/news/media-companies-grapple-with-ai",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/aab7a22c-bc84-4146-9c10-e7f17986937d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Media companies have been trying to navigate the rapid emergence of AI, with many banning its usage internally and others choosing to embrace it.  </p>\n                    <p><p>Many leading media companies have taken a stance against allowing artificial intelligence (AI), like OpenAI’s ChatGPT, into the newsrooms, and have withheld permission for AI to scan their content on the web. </p><p>It has been <a href=\"https://www.theguardian.com/technology/2023/aug/25/new-york-times-cnn-and-abc-block-openais-gptbot-web-crawler-from-scraping-content\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that multiple mainstream media companies including CNN, the New York Times and Reuters have coded their platforms to stop<a href=\"https://cointelegraph.com/news/open-ai-launch-gptbot-web-crawler-amid-gpt5-trademark\"> OpenAI’s web crawler GPTBot</a> from having access to their content. </p><p>The web crawler was released on Aug. 8 to potentially improve future ChatGPT models by indexing content from websites across the web.</p><p>Additionally, a CNN report claimed other news and media giants have also done the same, including Disney, Bloomberg, The Washington Post, The Atlantic, Axios, Insider, ABC News and ESPN among others. Major publishing houses like Condé Nast and Vox Media have also taken measures against AI. </p><p>Danielle Coffey, the president and chief executive of the News Media Alliance, told a CNN reporter that with AI in the picture: </p><blockquote>“I see a heightened sense of urgency when it comes to addressing the use, and misuse, of our content.”</blockquote><p>Already AI developers have been faced with lawsuits pertaining to copyright infringement from material used to train models. On July 12, <a href=\"https://cointelegraph.com/news/google-hit-with-lawsuit-over-ai-privacy-policy\">Google was hit with a lawsuit</a> for its then-new AI data-scraping privacy policy. </p><p>Prior to that, author Sarah Silverman and two others sued Meta and OpenAI for using her <a href=\"https://cointelegraph.com/news/meta-and-open-ai-sued-for-copyright-violations-sarah-silverman\">copyrighted work to train</a> their systems without the proper consent. </p><p>Back in April, the CEO of News Corp Australia was ahead of the game when he argued that <a href=\"https://cointelegraph.com/news/chatgpt-and-ai-must-pay-for-the-news-it-consumes-news-corp-australia-ceo\">ChatGPT and similar AI systems</a> must pay for the news consumed.</p><h3>To ban or not to ban</h3><p>It’s not just media companies that have been proactive in banning the usage of AI chatbots in the workplace or banning the systems from accessing content. </p><p>In May <a href=\"https://cointelegraph.com/news/samsung-employees-banned-from-using-chatgpt-like-ai-tools\">tech-giants Samsung</a> and <a href=\"https://cointelegraph.com/news/apple-bans-chat-gpt-employee-use\">Apple both banned</a> the internal usage of AI chatbots like ChatGPT, over concerns of sensitive internal data being outsourced by the models. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/chat-gpt-academia-divided-over-chat-gpt-left-political-bias-claims\"><strong><em>Academia divided over ChatGPT’s left political bias claims</em></strong></a></p><p>Prior to that a slew of financial service companies such as <a href=\"https://www.wsj.com/articles/jpmorgan-restricts-employees-from-using-chatgpt-2da5dc34\" target=\"_blank\" rel=\"noopener nofollow\">JPMorgan</a>, Bank of America, Goldman Sachs and Citigroup also banned the internal use of generative AI tools.</p><p>On June 26, the United States House <a href=\"https://cointelegraph.com/news/us-house-bans-members-from-using-all-chatbots-except-chatgpt-plus\">banned its members</a> from using all AI chatbots, with the exception of ChatGPT Plus due to its incorporation of “important privacy features” that can help protect sensitive data. </p><h3>Media embracing AI - for better or worse</h3><p>While many are putting up guard against the invasiveness of the technology, others have been eyeing it - even experimenting with it. </p><p>Entertainment giant Netflix appears to be looking into incorporating AI in one way or another, based on<a href=\"https://cointelegraph.com/news/netflix-eyes-ai-amid-hollywood-strike-offers-high-paying-ai-positions\"> job listings</a> in July offering high-paying AI roles. </p><p>The media site BuzzFeed recently shuttered its news division and laid off 180 staff employees, then shortly after <a href=\"https://cointelegraph.com/news/buzzfeed-shutters-news-division-leans-into-ai\">in its Q1 earnings call</a> said it will be “leaning into AI.” </p><p>One example of AI incorporation into media going wrong occurred in May, when an <a href=\"https://cointelegraph.com/news/buzzfeed-shutters-news-division-leans-into-ai\">Irish daily newspaper had to apologize</a> for unknowingly publishing an AI-generated article. It claimed it was “deliberately deceived” into believing the identity of a guest writer was human, however, it turned out to be AI. </p><h3>AI for enterprise</h3><p>A report conducted on Aug. 28 also revealed that the c<a href=\"https://cointelegraph.com/news/consumers-increase-distrust-artificial-intelligence-salesforce-survey\">oncern spills over into the consumers</a>, with nearly three-quarters concerned about the unethical use of AI by firms. </p><p>This comes shortly after OpenAI released a version of its <a href=\"https://cointelegraph.com/news/open-ai-launches-chatgpt-enterprise-for-business\">ChatGPT AI chatbot for businesses</a>, with four times the power of the consumer version. It claims that the enterprise version is twice as fast as GPT-4, with enhanced privacy and security standards.</p><p>Prior to the release of the enterprise-focused chatbot, an IBM blockchain and AI expert said that the model <a href=\"https://cointelegraph.com/news/ibm-blockchain-and-ai-expert-says-chatgpt-poses-several-key-risks-for-enterprise-use\">poses several ‘key risks’</a> for business use. These centered primarily around the risk of sensitive internal data being compromised, which was a major concern for many of the aforementioned businesses who banned chatbots. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/banning-ransomware-payments-attractive-dangerous-idea/\"><strong><em>Should we ban ransomware payments? It’s an attractive but dangerous idea</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-29T12:00:00.000Z",
    "title": "\n                        Hong Kong's Digital Leap: Embracing Web3 and the Future of Entertainment\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/hong-kongs-digital-leap-embracing-web3-and-the-future-of-entertainment",
    "description": "\n                        <p dir=\"ltr\">Digital technology, particularly innovations like Web3 and blockchain, is the driving force behind a transformation in Hong Kong.&nbsp;</p>\n<p dir=\"ltr\">Paul Chan Po-Mo, Financial Secretary for Hong Kong, recently laid out his vision for the future of digital technology in Asia in an official government blog with the title: &ldquo;Entertainment Goes Beyond Boundaries with Web3&rdquo;.</p>\n<p dir=\"ltr\">According to Chan, the global online entertainment market, which stood at USD 184.2 billion in 2021, is projected to skyrocket to USD 653.4 billion by 2027, marking an impressive 21% annual growth.</p>\nThe Cyberport digital community\n<p dir=\"ltr\">He remarked on the recent Digital Entertainment Leadership Forum, organised by Cyberport, saying that it was a testament to Hong Kong's commitment to this digital evolution.&nbsp;</p>\n<p dir=\"ltr\">The event, which attracted over 3,500 attendees both online and in-person, served as a platform for experts from over 30 countries to discuss the future of digital entertainment in the Web3 era. The forum also doubled as a highlight of the \"Happy Hong Kong\" campaign, offering a blend of Augmented Reality games, tech workshops, and local delicacies.</p>\n<p dir=\"ltr\">Cyberport, a digital community in Hong Kong, currently houses over 170 companies specialising in the metaverse, game development, e-sports, and more. Many of these firms are making significant strides in leveraging Web3 and other cutting-edge technologies. Noteworthy achievements include a fitness app that allows users to work out alongside Marvel characters and a metaverse game that has amassed a significant following in Japan.</p>\nWeb3 offers so much more\n<p dir=\"ltr\">But Web3's potential isn't limited to entertainment. Its foundational technology, blockchain, promises transparency, security, and cost-efficiency. This tech is poised to revolutionise sectors from finance to supply chain management.&nbsp;</p>\n<p dir=\"ltr\">The recently inaugurated Web3 Living Lab showcases local companies' innovative applications of Web3 in diverse life and business scenarios. From using blockchain to monitor livestock health for financing to introducing programmable tokens for efficient payments, Hong Kong's startups are at the forefront of innovation.</p>\n<p dir=\"ltr\">The Hong Kong Government isn't far behind. Earlier this year, the Hong Kong Monetary Authority pioneered the issuance of tokenised green bonds, a global first. This move streamlined the bond issuance process, slashing the lead time from five business days to just one.</p>\nA Web3 ecosystem\n<p dir=\"ltr\">To further bolster Web3 development, Chan stated that he had allocated $50 million to Cyberport. The fund aims to nurture a thriving Web3 ecosystem, drawing in businesses, talent, and fostering educational initiatives. Presently, Cyberport is home to over 180 Web3-centric companies, with a significant portion hailing from Mainland China and abroad.</p>\n<p dir=\"ltr\">The Task Force on Promoting Web3 Development, which Chan chairs, recently held its inaugural meeting. This group, comprising industry leaders and professionals, is dedicated to guiding Hong Kong's Web3 journey, ensuring its sustainable and orderly growth.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T11:47:07.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 How much is MATIC worth? The current price of Polygon is $0.553. Over the past 24 hours, it has seen a trading volume of $1.16 billion. With a market capitalization of $6.15 billion, Polygon holds a market dominance of 0.51%. However, the MATIC price has experienced a decrease of 1.4% in ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T11:39:46.000Z",
    "title": "John Deaton accuses SEC’s Bill Hinman of lying under oath",
    "url": "https://www.cryptopolitan.com/john-deaton-accuses-sec-of-lying-under-oath/",
    "description": "John Deaton, a well-known pro-crypto lawyer, has accused the U.S. Securities and Exchange Commission (SEC) of losing sight of its primary mission. He specifically questioned the testimony of Bill Hinman, the former Director of Corporation Finance at the SEC. Hinman had stated under oath that the SEC could only satisfy some aspects of the Howey ... <a title=\"John Deaton accuses SEC&#8217;s Bill Hinman of lying under oath\" class=\"read-more\" href=\"https://www.cryptopolitan.com/john-deaton-accuses-sec-of-lying-under-oath/\" aria-label=\"More on John Deaton accuses SEC&#8217;s Bill Hinman of lying under oath\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-29T12:04:44.000Z",
    "title": "Friend.tech imposes penalties on fork users amid revenue slump ",
    "url": "https://crypto.news/friend-tech-imposes-penalties-on-fork-users-amid-revenue-slump/",
    "description": "Friend.tech, a decentralized social media app built on the Base blockchain, has announced punitive measures against users who opt for forks or copycat versions of its platform."
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-29T12:00:28.000Z",
    "title": "Crypto Currents: Can Whale Investors Bring PEPE Back In Action?",
    "url": "https://www.newsbtc.com/news/crypto-currents-can-whale-investors-bring-pepe-back-in-action/",
    "description": "PEPE is garnering attention from major investors as the buzz surrounding the meme coin continues to grow. However, despite the increasing interest, these tokens are grappling with a persistently bearish sentiment, as their price performance remains lackluster. In an interesting turn of events, a significant number of investors are beginning to cast their gaze upon PEPE. Lookonchain&#8217;s latest report reveals a notable occurrence – a user invested 27 ETH, equivalent to $45,000, to secure a staggering 50 billion of the frog-themed token. More astonishingly, this same investor managed to acquire a jaw-dropping 5.9 trillion PEPE tokens for a mere 0.125 ETH, roughly valued at $251.  This strategic move was followed by the sale of 3.95 trillion PEPE tokens, resulting in an impressive haul of 2,505 ETH, equivalent to $4.7 million. Related Reading: MATIC Social Sentiment Slides To Negative Territory – What’s The Impact On Price? Surge In PEPE Interest Amid Mixed Sentiment Despite the glaring positivity in terms of investor activity, the overall sentiment surrounding PEPE tokens remains less than stellar. Lookonchain&#8217;s data cited in a price report indicates that social mentions related to the meme coin witnessed a solid 151.3% surge.  Likewise, social engagements related to the coin also experienced a substantial uptick of 106.9% during the same period. This surge in interest could potentially pave the way for a more dynamic price movement for PEPE tokens in the future. Related Reading: Shiba Inu Price Analysis: Bearish Pattern Puts Heavy Load On SHIB Advance However, the buoyancy in social media activity was not mirrored in sentiment. Santiment, a prominent on-chain analytics firm, utilized a weighted sentiment indicator to gauge the general outlook of PEPE across various social media platforms. This indicator painted a predominantly negative picture of the meme coin&#8217;s sentiment landscape, casting a shadow over the excitement surrounding the token. PEPEUSDT trading at $0.0000054 on the daily chart: TradingView.com Price Volatility On The Horizon Santiment&#8217;s analysis also spotlighted a pivotal moment in PEPE&#8217;s journey – the transfer of a substantial 16 trillion Pepe tokens by the developers for sale on exchanges. This move thrusts Pepecoin into the spotlight as the top trending crypto topic. However, Santiment&#8217;s cautionary note echoes concerns about heightened price volatility that may lie ahead for PEPE tokens, further complicating their price trajectory. Meanwhile, PEPE is trading at a current price of $0.000000839460, with a 3.6% decline in the last 24 hours and a significant seven-day slump of 21.0%, as reported by CoinGecko. 🐸 If you are riding the wave of #memecoins during these uncertain market conditions, #Pepecoin has quickly become the top trending #crypto topic this weekend. Former team members are accused of removing $16M. Expect even more high volatility than usual. https://t.co/iQLD7h224s pic.twitter.com/UOR4sTcWwv — Santiment (@santimentfeed) August 27, 2023 As PEPE continues to captivate larger investors and experience a surge in social media interest, the prevailing negative sentiment and ongoing price struggles underscore the challenges facing this unique cryptocurrency. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Coin Edition"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-29T11:45:13.000Z",
    "title": "Ripple (XRP) Rival Hedera (HBAR) Achieves 19,000,000,000 Transactions as FedNow Ecosystem Flourishes",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-rival-hedera-hbar-achieves-19000000000-transactions-as-fednow-ecosystem-flourishes/",
    "description": "<img width=\"1280\" height=\"850\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"hedera\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-1024x680.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Hedera achieves 19B transactions on its open-source network, powered by Hashgraph consensus.  Token Unlock reveals HBAR token unlocking event, $65M value.  The Hedera decentralized open-source network has achieved a remarkable feat by exceeding 19 billion transactions on its mainnet. Hedera is distinguished as a Layer1 blockchain compatible with the Ethereum Virtual Machine (EVM) and utilizes [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-29T12:02:00.000Z",
    "title": "CRV, IMX, AAVE, COMP, YGG Poised for Strong Price Moves",
    "url": "https://coinedition.com/crv-imx-aave-comp-ygg-poised-for-strong-price-moves/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/CRV-IMX-AAVE-COMP-YGG-Poised-for-Strong-Price-Moves-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The blockchain intelligence platform Santiment revealed in a tweet yesterday that whale activity has spiked during the past 48 hours &#8211; impacting the prices of several altcoins in the market. According to the post, a number of altcoins including AAVE, COMP, CRV, IMX and YGG recorded transfers of more than $10 million. Despite varying price [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crv-imx-aave-comp-ygg-poised-for-strong-price-moves/\">CRV, IMX, AAVE, COMP, YGG Poised for Strong Price Moves</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-29T11:58:04.000Z",
    "title": "The Blockchain Era: Shaping the Future of Blockchain Technology and Crypto Influence",
    "url": "https://coinedition.com/the-blockchain-era-shaping-the-future-of-blockchain-technology-and-crypto-influence/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/pr-1-106.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/pr-1-106.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/pr-1-106-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/pr-1-106-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/pr-1-106-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/pr-1-106-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/pr-1-106-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/pr-1-106-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/pr-1-106-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/pr-1-106-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/pr-1-106-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/pr-1-106-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/pr-1-106-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/pr-1-106-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/pr-1-106-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/pr-1-106-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/pr-1-106-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Today marks an exciting milestone as we announce the establishment of The Blockchain Era (TBE), an innovative Decentralized Autonomous Organization (DAO). TBE is passionately devoted to promoting the growth and development of blockchain technology, leading us towards a future in which the enormous potential of blockchain is fully embraced and capitalized. In our fast-paced digital [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/the-blockchain-era-shaping-the-future-of-blockchain-technology-and-crypto-influence/\">The Blockchain Era: Shaping the Future of Blockchain Technology and Crypto Influence</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-29T11:40:12.000Z",
    "title": "Theta Network Price Prediction 2023-2030: Will THETA Price Hit $1.5 Soon?",
    "url": "https://coinedition.com/theta-network-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Theta-Network-THETA-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Theta Network (THETA) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Theta-Network-THETA-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Theta-Network-THETA-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Theta-Network-THETA-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Theta-Network-THETA-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Theta-Network-THETA-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Theta Network is a blockchain project that supports Web3 infrastructures for content, media, video, and entertainment. Its native token is called THETA. Theta Network investors are bullish on the token since it has had a return on investment (ROI) of over 30 times in the past 2 years. The crypto bubble of 2021 led to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/theta-network-price-prediction/\">Theta Network Price Prediction 2023-2030: Will THETA Price Hit $1.5 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-29T11:45:58.000Z",
    "title": "Top Trader Issues Crypto Warning, Says Next Bull Market Not a Guarantee – Here’s Why",
    "url": "https://dailyhodl.com/2023/08/29/top-trader-issues-crypto-warning-says-next-bull-market-not-a-guarantee-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Market-Not-a-Guarantee.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Market-Not-a-Guarantee.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Market-Not-a-Guarantee.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Market-Not-a-Guarantee.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Market-Not-a-Guarantee.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Market-Not-a-Guarantee.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Market-Not-a-Guarantee.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist says that there is a possibility that digital assets may not witness another bull market. Pseudonymous analyst The Flow Horse, also known as Cantering Clark, tells his 181,600 followers on the social media platform X that he is less confident in a crypto bullish reversal this time around. “Last bear [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/29/top-trader-issues-crypto-warning-says-next-bull-market-not-a-guarantee-heres-why/\">Top Trader Issues Crypto Warning, Says Next Bull Market Not a Guarantee – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]