[
  {
    "source": "CoinDesk",
    "date": "2023-07-14T07:44:03.000Z",
    "title": "Coinbase Rally on the Back of XRP Court Ruling Is Overdone: Berenberg",
    "url": "https://www.coindesk.com/markets/2023/07/14/coinbase-rally-on-the-back-of-xrp-court-ruling-is-overdone-berenberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The surge in the crypto exchange’s share price was driven largely by investors who saw the decision as a representing a rejection of the SEC’s argument in the lawsuit it filed against Coinbase in June, the report said."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-14T08:07:21.000Z",
    "title": "XRP passes BNB in market cap as experts debate judge ruling on securities sales",
    "url": "https://cryptoslate.com/xrp-passes-bnb-in-market-cap-as-experts-debate-judge-ruling-on-securities-sales/",
    "description": "<p>XRP has now surpassed BNB to become the fourth-largest digital asset by market cap following its landmark court decision. # Name Price 24H % Market Cap 24H Vol 1 Bitcoin $31,313.35 +2.97% $608,382,242,056 $25,742,885,697 2 Ethereum $2,006.04 +7.07% $241,135,375,943 $12,574,214,439 3 Tether $1.00042 +0.06% $83,469,496,743 $47,877,965,097 4 XRP $0.78891 +67.5% $41,452,503,749 $12,916,795,997 5 BNB $259.553 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/xrp-passes-bnb-in-market-cap-as-experts-debate-judge-ruling-on-securities-sales/\">XRP passes BNB in market cap as experts debate judge ruling on securities sales</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T08:02:41.000Z",
    "title": "Congressman Torres takes aim at SEC’s crypto oversight, calls for investigation",
    "url": "https://www.cryptopolitan.com/torres-takes-aim-at-secs-crypto-oversight/",
    "description": "According to two letters made public on Thursday, Congressman Ritchie Torres has asked for two separate independent investigations into the United States Securities and Exchange Commission (SEC) for its &#8220;haphazard and heavy-handed approach to digital assets.&#8221; The representative accuses Gensler of &#8220;politicizing&#8221; the registration process by approving Prometheum&#8217;s special purpose broker-dealer license. New York Congressman ... <a title=\"Congressman Torres takes aim at SEC&#8217;s crypto oversight, calls for investigation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/torres-takes-aim-at-secs-crypto-oversight/\" aria-label=\"More on Congressman Torres takes aim at SEC&#8217;s crypto oversight, calls for investigation\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-14T07:49:09.000Z",
    "title": "The Ripple Effect: SEC In A Tight Corner With Other Of The Regulator’s Stance Against Crypto",
    "url": "https://nulltx.com/the-ripple-effect-sec-in-a-tight-corner-with-other-of-the-regulators-stance-against-crypto/",
    "description": "The SEC&#8217;s recent loss in the case against Ripple is a major setback for the agency&#8217;s efforts to regulate cryptocurrencies. The ruling that XRP is not a security could have far-reaching implications for the future of crypto regulation in the United States. XRP Ruling The most important part of this ruling: “XRP, as a digital [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-14T07:55:08.000Z",
    "title": "Why Is Bitcoin Price Up Today?",
    "url": "https://www.newsbtc.com/news/bitcoin/why-is-bitcoin-price-up-today-2/",
    "description": "The Bitcoin price tagged a new yearly high yesterday at $31,840, leaving market participants wondering about the driving forces behind this bullish momentum. The Power of Economic Indicators One of the crucial factors contributing to Bitcoin&#8217;s upward trajectory was the release of the United States Producer Price Index (PPI) data. The latest figures revealed a significant slowdown in inflation, with PPI YoY dropping to 0.1% in June, surpassing expectations and marking the smallest pace since August 2020. Notably, the Core PPI YoY came in at 2.4%, slightly below the estimated 2.6%, reinforcing the notion of a diminishing inflationary environment. This decrease in PPI is seen as a positive sign for the Consumer Price Index (CPI), providing hope for a more stable economic landscape. Macro researcher Mortensen Bach emphasized the significance of the PPI&#8217;s impact, stating, &#8220;PPI always leads CPI. Inflation is no longer a thing and input prices clearly indicate that! Deflation remains the primary risk going forward. This is what happens when you have a Federal Reserve who is blindly focused on backward-looking data!&#8221; Echoing these sentiments, macro analyst Ted added, &#8220;PPI inflation leads CPI by a few months&#8230; and today&#8217;s PPI numbers have YoY running at +0.24%. Almost in deflation! Fed pivot anyone?&#8221; Related Reading: Perfect Storm: Why Bitcoin &#38; Crypto Are Poised For A Dramatic Recovery Also worth noting is that, May PPI inflation was revised lower from 1.1% to 0.9%. May Core PPI inflation was revised lower from 2.8% to 2.6%. The drop and revision lower in Core PPI is what the US Federal Reserve wants to see. Inverse Correlation With The DXY Another pivotal factor driving Bitcoin&#8217;s surge is the recent drop in the US Dollar Index (DXY) below 100.00, a level not seen in 15 months. This development has sparked renewed interest in risk assets like Bitcoin as a hedge against a weakening dollar. The inverse correlation between the DXY and Bitcoin has historically played a significant role in the cryptocurrency&#8217;s price movements, and this recent drop in the DXY has acted as yet another bullish catalyst. Ripple&#8217;s Partial Victory The ongoing legal battle between Ripple Labs and the US Securities and Exchange Commission (SEC) has probably provided another boost to Bitcoin&#8217;s price. Ripple&#8217;s partial victory in the case has generated optimism in the crypto community and can be seen as a net positive event for Coinbase, which is embroiled in its own legal dispute with the SEC. Related Reading: Fund Manager Vanguard Increases Stake In Bitcoin Mining Stocks To $600 Million Interestingly, Coinbase serves as the exchange partner for all U.S. Bitcoin spot Exchange-Traded Funds (ETFs) currently filed with the SEC. Recently, chair Gary Gensler&#8217;s comments on Coinbase&#8217;s involvement in ETF filings have raised concerns about the suitability of the exchange as a market surveillance sharing partner, as Bitcoinist reported. Eric Balchunas, a Senior ETF analyst for Bloomberg, expressed his apprehension, suggesting that &#8220;SSA could be pointless if this is a problem for him.&#8221; With this in mind, the Ripple victory can also be seen as extremely positive news for the approval of a Bitcoin spot ETF, as Coinbase could benefit from the ruling in its case against the SEC. At press time, the BTC price retraced to $31,250, up 2.6% in the last 24 hours. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T08:00:34.000Z",
    "title": "Crypto Experts Recommend Adding QUBE, Uniswap, and Cardano To Diversify Portfolio",
    "url": "https://www.crypto-news-flash.com/crypto-experts-recommend-adding-qube-uniswap-and-cardano-to-diversify-portfolio/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-experts-recommend-adding-qube-uniswap-and-cardano-to-diversify-portfolio",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T095959.339.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T095959.339.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T095959.339-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T095959.339-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the dynamic world of cryptocurrencies, diversification is key to mitigating risks and maximizing potential returns. As the market continues to evolve, experts are recommending the inclusion of specific cryptocurrencies in investors&#8217; portfolios to achieve a well-rounded and diversified approach. In this article, we explore some top altcoins like InQubeta (QUBE), Uniswap (UNI), and Cardano [...]"
  }
]