[
  {
    "source": "CoinDesk",
    "date": "2023-06-21T21:49:56.000Z",
    "title": "Puma, Gutter Cat Gang and LaMelo Ball Team Up to Release NFT Sneakers",
    "url": "https://www.coindesk.com/web3/2023/06/21/puma-gutter-cat-gang-and-lamelo-ball-team-up-to-release-nft-sneakers/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The “GutterMelo MB.03” NFT sneakers are paired with a physical real-life sneaker counterpart and will be available to mint on OpenSea on June 29."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-21T21:45:37.000Z",
    "title": "New York City Spa Gets Heat for Heating with Bitcoin Mining",
    "url": "https://decrypt.co/145714/new-york-city-spa-gets-heat-for-heating-with-bitcoin-mining",
    "description": "Bathhouse shared how the process works, inviting people to “enjoy a hot pool while supporting the Bitcoin network.”"
  },
  {
    "source": "Decrypt",
    "date": "2023-06-21T21:43:30.000Z",
    "title": "Ex- Barclays CEO Praises BlackRock Bitcoin ETF Filing",
    "url": "https://decrypt.co/145713/blackrock-bitcoin-etf-filing-barclays-ceo-praise",
    "description": "Crypto’s growth is just a natural part of an increasingly digitized world, says Bob Diamond. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T21:46:14.000Z",
    "title": "Valkyrie joins rush with BTC spot ETF application to go with its futures, miners ETFs",
    "url": "https://cointelegraph.com/news/valkyrie-submits-btc-spot-etf-application-to-go-with-its-futures-miners-etfs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/b64be7e3-0594-44d4-a9f0-71e22793af3d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The cryptocurrency fund manager is at least the fourth to seek a BTC spot ETF listing in the last week; Fidelity is rumored to be preparing to apply, too.</p>\n                    <p><p>Cryptocurrency fund manager Valkyrie is applying for a Bitcoin spot exchange-traded fund (ETF), joining several other financial firms that have filed similar applications with the United States Securities and Exchange Commission (SEC) in the last week. Valkyrie <a href=\"https://www.sec.gov/Archives/edgar/data/1841175/000138713123007682/valkyrie-s1a_062123.htm\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> an S-1 registration form for a <a href=\"https://cointelegraph.com/explained/bitcoin-spot-vs-futures-etfs-key-differences-explained\">Bitcoin spot ETF</a> with the SEC on June 21. In it, the firm indicated that it would seek to list its fund on the Nasdaq under the symbol BRRR. </p><p>Valkyrie is an old hand at Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) futures ETFs. It <a href=\"https://cointelegraph.com/news/valkyrie-bitcoin-futures-linked-etf-launches-on-nasdaq-with-share-prices-dropping-3-in-first-hour\">launched the second BTC futures ETF</a> in the U.S., the Valkyrie Bitcoin Strategy ETF (BTF), in October 2021 and launched the Valkyrie Balance Sheet Opportunities (VBB) in December of that year. It <a href=\"https://cointelegraph.com/news/valkyrie-funds-to-liquidate-bitcoin-related-etf-by-late-october\">liquidated VBB in October</a><a href=\"https://cointelegraph.com/news/valkyrie-funds-to-liquidate-bitcoin-related-etf-by-late-october\"> 2022</a>. Valkyrie also runs the Valkyrie Bitcoin Miners ETF (WGMI) that tracks securities of companies that derive their revenue or profits from BTC mining.</p><p>On May 16, <a href=\"https://cointelegraph.com/news/valkyrie-leveraged-bitcoin-futures-etf-application\">it submitted an application</a> for a BTC futures ETF to be called the Valkyrie Bitcoin Futures Leveraged Strategy ETF (BTFD). BTFD would be a fund, rather than a trust, as is  the case for its proposed BTC spot ETF. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Anddd we have anotha one! Most interesting here with this updated Valkyrie Bitcoin Fund prospectus -- they have changed their exchange to Nasdaq (same as BlackRock) anddd they gave us a ticker <a href=\"https://twitter.com/search?q=%24BRRR&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BRRR</a>. <a href=\"https://t.co/3QxeFRfLPy\">pic.twitter.com/3QxeFRfLPy</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1671599801761161235?ref_src=twsrc%5Etfw\">June 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Valkyrie was apparently inspired to take action by the recent activity of its competitors. Valkyrie Investments chief investment officer Steven McClurg <a href=\"https://cointelegraph.com/news/ftx-fiasco-set-the-approval-of-bitcoin-spot-etfs-back-valkyrie-investment-chief\">told Cointelegraph in a <em>Hashing It Out</em></a> podcast in March that he thought a BTC ETF would only be possible “in a future administration after the next elections or through legislative action.” </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/grayscale-bitcoin-trust-2023-high-blackrock-etf-filing-buyers\">Grayscale Bitcoin Trust nears 2023 highs on BlackRock ETF filing as buyers step up</a></em></strong></p><p>However, BlackRock <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">applied to list a BTC</a> spot ETF on Nasdaq as a trust on June 15. WisdomTree and Invesco <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco\">filed similar applications</a> on June 20. There are also unconfirmed reports that Fidelity will file an application for a BTC spot ETF. Meanwhile, BTC is rising precipitously, up 6.41% at the time of writing.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/samsungs-bitcoin-etf-700m-bust-coinbase-exits-japan-asia-express/\">Samsung’s Bitcoin ETF, $700M bust, Coinbase exits Japan: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-06-21T22:07:57.000Z",
    "title": "Binance unveils local crypto exchange in Kazakhstan",
    "url": "https://crypto.news/binance-unveils-local-crypto-exchange-in-kazakhstan/",
    "description": "Major crypto exchange Binance continues to expand its services globally with the latest launch of a new digital asset platform in Kazakhstan. "
  },
  {
    "source": "BTCManager",
    "date": "2023-06-21T21:59:13.000Z",
    "title": "Federal reserve chair Powell emphasizes need for strong oversight of US stablecoins",
    "url": "https://crypto.news/federal-reserve-chair-powell-emphasizes-need-for-strong-oversight-of-us-stablecoins/",
    "description": "Federal Reserve Chairman Jerome Powell reiterated the need of robust central-bank oversight in the ongoing development of stablecoin regulations by the House Financial Services Committee."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-21T21:55:13.000Z",
    "title": "Animoca brands partners with Celo to drive web3 adoption with focus on sustainability",
    "url": "https://crypto.news/animoca-brands-partners-with-celo-to-drive-web3-adoption-with-focus-on-sustainability/",
    "description": "Animoca Brands, a company responsible for advancing digital property rights for gaming and the metaverse, has announced its partnership with Celo, a carbon-negative blockchain ecosystem."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-21T22:00:36.000Z",
    "title": "Bitcoin Faces Tough Resistance At $30,000 – Can It Overcome The Hurdle?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-faces-tough-resistance-at-30000-can-it-overcome-the-hurdle/",
    "description": "Bitcoin (BTC), the largest cryptocurrency in the market, has demonstrated a strong shift in investor sentiment. Over the past 24 hours, BTC has surged by an impressive 9%, currently trading at $29,300.  However, Bitcoin still faces significant hurdles, with a resistance line placed at $29,500, as well as a key psychological level at $30,000 that has not been reached since April 19th.  BTC’s Moment Of Truth Material Indicators, a cryptocurrency data analysis firm, has identified a substantial resistance level for BTC at $30,000. This resistance level has been building and may impede the cryptocurrency&#8217;s upward momentum, potentially causing it to become range-bound, as has occurred several times this year. Related Reading: US Bitcoin Investor Trading Volume Rises, Stage Set For Another Massive Rally? If BTC fails to break through this resistance level, it could become trapped in a narrow trading range, limiting its potential for further growth. However, if it manages to overcome this hurdle, it could provide a strong bullish signal for investors and potentially lead to further price increases. One key factor that Material Indicators is watching is bid liquidity in the active trading range. Bid liquidity refers to the amount of buying power in the market and is a crucial indicator of investor sentiment and confidence in a particular asset. The company is closely monitoring how much bid liquidity moves into the active trading range to serve as support for BTC. In addition, Material Indicators is anticipating the testimony of Federal Reserve Chair Jerome Powell, which could impact the cryptocurrency markets. While the company does not expect any major surprises from Powell&#8217;s testimony, they recognize that these events can often lead to increased volatility and uncertainty in the markets. However, Bitcoin needs to maintain its bullish momentum and overcome the nearest resistance level of $29,500 to have a chance at breaching the crucial $30,000 line.  On the other hand, if this attempt fails, it will be crucial for BTC to consolidate above $29,000 and prevent any further downside movements. Bitcoin Set For Major Rally? Ted Talks Macro, a well-known cryptocurrency trader and host of a popular podcast has recently updated his macro view for BTC, highlighting several bullish factors that could drive the cryptocurrency&#8217;s price higher in the coming months. According to Ted, the market has now accepted above February&#8217;s highs and is forming a higher low on the weekly timeframe. This is a bullish signal that suggests BTC is on track for further gains. In March, Ted noted that the high-timeframe bull idea would be invalidated if BTC dropped back into the range below $24,500. However, this did not happen, and the bulls showed up to support the price of BTC. In addition to these technical factors, Ted identified several narratives that could drive sentiment over the coming quarters. These include the upcoming BTC halving, the launch of the Blackrock spot ETF (and other similar products), the Federal Reserve&#8217;s pause on interest rate hikes, and the launch of crypto exchanges by traditional finance giants. Related Reading: MATIC Price Gains Momentum, But Bulls Face Uncertainty Without Breaking Vital Resistance Based on these factors, Ted Talks Macro has set a target of $35,000 for BTC, which is now in play. This target represents a significant increase from BTC&#8217;s current price and suggests that the cryptocurrency market could be poised for a major rally in the months ahead. Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-21T22:01:15.000Z",
    "title": "Tether (USDT) Announces Expansion Onto Kava, CTO Commends Blockchain’s Security Level",
    "url": "https://dailyhodl.com/2023/06/21/tether-usdt-announces-expansion-onto-kava-cto-commends-blockchains-security-level/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/tether-undergo-audit.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/tether-undergo-audit.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/tether-undergo-audit.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/tether-undergo-audit.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/tether-undergo-audit.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/tether-undergo-audit.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/tether-undergo-audit.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The largest stablecoin issuer in the world is announcing its expansion ontp Kava (KAVA), an interoperable layer-1 blockchain. In a new press release, Tether (USDT) says that its dollar-pegged crypto asset will be launching over the Kava network, sending the decentralized finance (DeFi) platform’s price skyrocketing. KAVA is trading for $0.934 at time of writing, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/21/tether-usdt-announces-expansion-onto-kava-cto-commends-blockchains-security-level/\">Tether (USDT) Announces Expansion Onto Kava, CTO Commends Blockchain’s Security Level</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]