[
  {
    "source": "CoinDesk",
    "date": "2023-06-22T21:29:28.000Z",
    "title": "OPNX Files Defamation Lawsuit Against Mike Dudas, Issues Justice Tokens",
    "url": "https://www.coindesk.com/business/2023/06/22/opnx-files-defamation-lawsuit-against-mike-dudas-issues-justice-tokens/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The bankruptcy claims exchange from Kyle Davies and Su Zhu – the founders of failed hedge fund Three Arrows Capital – has also issued Justice Tokens that offer exposure to defamation lawsuits."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-22T21:30:00.000Z",
    "title": "Bitcoin and correlations — Examining the relationship between BTC, gold and the Nasdaq",
    "url": "https://cointelegraph.com/news/bitcoin-and-correlations-examining-the-relationship-between-btc-gold-and-the-nasdaq",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/28034718-3aa1-4146-86a9-117ae4c65f58.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin traders always talk about BTC’s correlation with gold and equities, but how much attention should average investors pay to this discussion?</p>\n                    <p><p>Some news sources have been fond of making comparisons between Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price action and that of other assets. In particular, the two most commonly compared asset classes are gold and tech stocks.</p><p>While a <a href=\"https://cointelegraph.com/news/joining-the-ranks-bitcoin-s-correlation-with-gold-and-stocks-is-growing\">correlation holds</a>, it tends to be a big news story. Throughout much of 2022 and early 2023, for example, the “Bitcoin trades in tandem with tech stocks” narrative was prevalent. Since that correlation has broken down, however, there doesn’t seem to be much related news coverage.</p><p>Now a new narrative has taken the spotlight: that of Bitcoin’s correlation to gold. Ever since the <a href=\"https://cointelegraph.com/news/us-banking-system-outlook-downgraded-to-negative-following-recent-bank-failures\">failures</a> of Silvergate, Signature Bank, and Silicon Valley Bank in March, both assets have rallied. Both of these narratives make sense on the surface. If Bitcoin is to be seen as a speculative asset, then it might trade similar to a tech stock. And if Bitcoin is more of a safe-haven asset, a correlation to gold seems reasonable.</p><p>It’s important to note, however, that correlations can come and go. Just because two assets share a correlation for a time doesn’t always mean they share a place in the market long-term. And when zooming out to larger timeframes, it might be possible to rule out correlations of any kind.</p><p>Let’s examine both of these correlations on a one-year basis and see if there’s any merit to them.</p><h2>Bitcoin, gold and NASDAQ: one-year correlation analysis</h2><p>Year-to-date, <a href=\"https://cointelegraph.com/news/bitcoin-price-this-week-fear-26k-key-5-things\">Bitcoin</a> has gained roughly 58%, rising from $16,600 at the start of the year to over $26,000 today. On the same timeframe, the NASDAQ has gained about 36%, rising from 11,000 to just shy of over 15,000.</p><p>Meanwhile, gold has risen by just over 7% YTD.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/78462960-0465-4ed1-87ef-715ccb758e46.png\"  /><figcaption style=\"text-align: center;\"><em>YTD chart of BTC/USD, NASDAQ and gold with 90-day Correlation Coefficient. Source: TradingView</em></figcaption></figure><p>According to the 90-day correlation coefficient, BTC is positively correlated to gold (0.58) and negatively correlated to tech stocks (-0.65) right now. For the majority of this year, BTC has been highly correlated to both assets. At the beginning of the year, the correlation to gold was deeply negative, while the correlation to tech stocks was just below neutral. </p><p>So then, which is it? Safe-haven correlation or risk asset correlation? Or does the presence of multiple correlations point to no correlation at all? Does similar price action on a yearly basis constitute a significant relationship between two assets in the first place? </p><p>Such a discussion could get quite lengthy. These questions are best interpreted on a rhetorical basis, i.e., they imply that there could be any number of assets who share similar patterns of price action on a one-year chart.</p><p>When looking at the question in terms of percentage gains, things look more different still: gold is up 9%, while Bitcoin is up 18% and the NASDAQ 30%. </p><p>It would be great if we could glean some significance from the fact that Bitcoin has a tendency to be correlated with equities for a time now and then. But so far this year, the relationship between the two remained constant throughout the banking crisis that began in March and led to a large rally for BTC. Since then, the relationship has disappeared, as the NASDAQ had rallied to YTD highs and BTC has mostly traded sideways.</p><h2>On a long enough timeline, everything breaks down</h2><p>Over the past 14-years, Bitcoin has risen against the US dollar by tens of millions of percentage points. There are few asset classes that can boast similar returns. Other assets don’t carry the same degree of volatility either, making a long-standing correlation even less likely.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/eedbeae4-1b60-4618-8afd-bac3e5be9ae6.png\"  /><figcaption style=\"text-align: center;\"><em>All-time BTC/USD chart. Source: TradingView</em></figcaption></figure><p>To date, gold has risen from $800 in early 2009 to $1,945 today, a gain of almost 150%. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/ea4e230b-08f6-4fc0-a439-0c2636068aa9.png\"  /><figcaption style=\"text-align: center;\"><em>All time gold/USD chart. Source: TradingView</em></figcaption></figure><p>The NASDAQ is up more than 10x since early 2009, or returns in excess of 1,000%. Nice gains, but a far cry from the 52,000,000% that Bitcoin returned from <a href=\"https://dqydj.com/bitcoin-return-calculator/\" target=\"_blank\" rel=\"noopener nofollow\">July 2010 to present</a>.<a href=\"https://dqydj.com/bitcoin-return-calculator/\" target=\"_blank\" rel=\"noopener nofollow\"> </a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/6d9aa358-abc5-4988-aef4-828561a404d3.png\"  /><figcaption style=\"text-align: center;\"><em>All-time chart of NASDAQ. Source: TradingView</em></figcaption></figure><p>The key takeaways here are:</p><ul><li>An asset that rises by more than 50,000,000% over the course of its lifetime might not be correlated to much else. </li><li>The correlations between Bitcoin, gold, and tech stocks often can’t be seen on timeframes in excess of a year or two. </li><li>Due in large part to the previous two points, the correlations don’t hold much significance.</li></ul><p>Investors would do well to keep this in mind when interpreting markets. Banking on any specific correlation as part of a strategy could be risky, as that correlation could break at any moment. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-22T21:15:00.000Z",
    "title": "Robinhood buys credit card fintech X1 for $95M",
    "url": "https://cointelegraph.com/news/robinhood-buys-credit-card-fintech-x1-for-95m",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/11e5b79f-21e9-4208-8e68-3d92e02cc916.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In 2022, X1 claimed to have 500,000 people on its waiting list for a credit card. Over the past two years, the startup has raised $62 million from venture capital firms. </p>\n                    <p><p>Crypto and stock trading app Robinhood has taken a new step to diversify its business portfolio by acquiring the credit card startup X1 in a $95 million deal. The fintech firm offers an income-based credit card with rewards, along with free trial and single-use credit cards. </p><p>The deal is expected to be closed by the end of September, Robinhood <a href=\"https://newsroom.aboutrobinhood.com/robinhood-signs-agreement-to-acquire-x1/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a statement on June 22, adding that the move was “an important step” to a deep relationship with its existing customers. </p><p>Robinhood, which already offers debit cards to its customers, gains a new revenue stream with the acquisition. In a press release dated July 18, 2022, X1 <a href=\"https://x1creditcard.com/newsroom\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> $50 million in monthly volume and was expecting to reach $1 billion in annualized spend at year’s end.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Announcement incoming  We’re acquiring <a href=\"https://twitter.com/x1creditcard?ref_src=twsrc%5Etfw\">@x1creditcard</a>, a platform that offers a no fee, stainless steel credit card with rewards on every purchase, and an intuitive mobile app experience. This is an important step toward serving all of our customers&#39; financial needs. More info:… <a href=\"https://t.co/VCUjBxkpsM\">pic.twitter.com/VCUjBxkpsM</a></p>&mdash; Robinhood (@RobinhoodApp) <a href=\"https://twitter.com/RobinhoodApp/status/1671860663046553602?ref_src=twsrc%5Etfw\">June 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to Robinhood’s latest earnings report, its monthly active users base <a href=\"https://cointelegraph.com/news/robinhood-s-q1-crypto-revenue-drops-30-from-the-previous-year\">fell from 16 million in the first quarter of 2022 to just under 12 million</a> over the same period this year. The company also saw a 30% revenue decline year on year for its crypto trading business, with $38 million in crypto trading revenue in Q1 2023, down from $54 million in Q1 2022. </p><p>The fintech is Robinhood’s fifth acquisition in four years, <a href=\"https://www.crunchbase.com/search/acquisitions/field/organizations/num_acquisitions/robinhood\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Crunchbase. In 2019, the company acquired the daily financial newsletter MarketSnacks, followed by three deals in 2021 — <a href=\"https://cointelegraph.com/news/cove-markets-to-join-robinhood-crypto-in-latest-acquisition\">the cross-exchange crypto trading platform Cove Markets</a>, the hiring firm Binc and the shareholders’ platform Say. Before the crypto winter broke out, Robinhood <a href=\"https://cointelegraph.com/news/robinhood-acquires-british-crypto-firm-ziglu-to-push-expansion-plans\">acquired the United Kingdom-based crypto asset firm Ziglu</a> in April 2022.</p><p>X1’s current valuation is unknown, but the company <a href=\"https://x1creditcard.com/newsroom\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> to have 500,000 people on its waiting list for a credit card in 2022. Since 2020, the startup has raised over $60 million from venture capital firms such as Craft Ventures, Soma Capital and FPV, the venture firm of Google Analytics co-founder Wesley Chan, who is also an investor in Robinhood and financial services company Plaid. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\">Tornado Cash 2.0 — The race to build safe and legal coin mixers</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-22T21:24:48.000Z",
    "title": "Brooklyn spa’s Bitcoin mining-heated pools spark controversy on social media",
    "url": "https://cryptoslate.com/brooklyn-spas-bitcoin-mining-heated-pools-spark-controversy-on-social-media/",
    "description": "<p>A New York bathhouse using a Bitcoin mining rig to partially heat its facilities made news and has drawn heat on social media. BATHHOUSE, which opened in 2021, is a trendy Brooklyn spa offering patrons access to saunas, steam rooms, and three on-site pools, two of which are heated to over 90 degrees Fahrenheit—all of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/brooklyn-spas-bitcoin-mining-heated-pools-spark-controversy-on-social-media/\">Brooklyn spa&#8217;s Bitcoin mining-heated pools spark controversy on social media</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T21:22:46.000Z",
    "title": "Bitcoin Gold Price Prediction 2023-2032: Is BTG A Good Investment?",
    "url": "https://www.cryptopolitan.com/bitcoin-gold-price-prediction/",
    "description": "Bitcoin Gold Price Prediction 2023-2032 Bitcoin Gold (BTG) aims to revolutionize the mining process by introducing a new Proof-of-Work algorithm that combats the scalability issues Bitcoin struggles with. This Bitcoin Gold price prediction will track the BTG network thru its price movements from 2023 to 2032. Bitcoin Gold is one of the first hard forks ... <a title=\"Bitcoin Gold Price Prediction 2023-2032: Is BTG A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-gold-price-prediction/\" aria-label=\"More on Bitcoin Gold Price Prediction 2023-2032: Is BTG A Good Investment?\">Read more</a>"
  }
]