[
  {
    "source": "Cointelegraph",
    "date": "2024-01-13T17:31:05.000Z",
    "title": " Bitcoin ETFs attract $1.4B in two trading sessions ",
    "url": "https://cointelegraph.com/news/bitcoin-etfs-attract-1-billion-two-trading-sessions",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNTgwMGM5YzQtYTQyMi00YzVhLTlhMjEtNzQ2ZWQyYzJkZGVhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Grayscale’s Bitcoin Trust (GBTC) experienced an outflow of $579 million in its first days of trading after redemption was opened under the U.S. SEC approval.  </p>\n                    <p><p>The newly launched spot Bitcoin exchange-traded funds (ETFs) have seen inflows totaling $1.4 billion in the first two trading sessions,<a href=\"https://twitter.com/EricBalchunas/status/1746145426229669972\" target=\"_blank\" rel=\"noopener nofollow\"> according</a> to Bloomberg ETF analyst Eric Balchunas. </p><p>A total of 500,000 trades were made on the funds, totaling a trading volume of $3.6 billion, according to data from Bloomberg. Trading volume considers the outflows and inflows from the funds. Balchunas suggested the numbers may be adjusted due to transactions awaiting accounting settlement.</p><p data-ct-non-breakable=\"true\">The data reveals Grayscale's ETF, the Grayscale Bitcoin Trust (GBTC), experienced an outflow of $579 million during the period. After deducting the outflows from GBTC, the net total inflows across the products stood at $819 million. The funds' initial activity is so far aligned with previous predictions from ETF analyst James Seyffart, who believes Bitcoin ETFs<a href=\"https://cointelegraph.com/news/sec-backed-into-corner-btc-etf-approval-bloomberg-analyst\"> could attract around $10 billion in the first year</a>. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-etfs-attract-1-billion-two-trading-sessions\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-13T17:24:43.000Z",
    "title": "Top 5 Cryptocurrencies to Capitalize on in January",
    "url": "https://cryptodaily.co.uk/2024/01/top-5-cryptocurrencies-to-capitalize-on-in-january",
    "description": "Dive into the January 2024 cryptocurrency landscape with this guide on the top 5 cryptos to watch. Amid Bitcoin's price rollercoaster and the SEC's ETF announcements, discover key players like Aptos, Cardano, Chainlink, Polygon, and Hashflow. This article offers insights into market dynamics, technological advancements, and investment opportunities, perfect for anyone navigating the complex and evolving world of digital currencies."
  },
  {
    "source": "NullTX",
    "date": "2024-01-13T17:23:00.000Z",
    "title": "Bonk Momentum Slows Down Whilst Investors Turn to  Option2Trade and BNB For 100x Returns",
    "url": "https://nulltx.com/bonk-momentum-slows-down-whilst-investors-turn-to-option2trade-and-bnb-for-100x-returns/",
    "description": "Bitcoin is eyeing up for new All-time as the Halving Event is approaching. The world of crypto experienced a ripple of excitement with recent phenomenal rise of Bonk (BONK), a newly launched meme coin on Solana network that achieved an incredible 11700% increase in its value since launch on December [&#8230;]"
  }
]