[
  {
    "source": "CryptoSlate",
    "date": "2024-01-14T16:45:55.000Z",
    "title": "Over 4k Solana users lost more than $4 million to phishing attacks last month",
    "url": "https://cryptoslate.com/over-4k-solana-users-lost-more-than-4m-to-phishing-attacks-last-month/",
    "description": "<p>Phishing scammers have siphoned off over $4 million from Solana wallets in December 2023, according to estimates posted on X by Scam Sniffer, a scams tracker. The attacks affected around 4,000 users, according to the Scam Sniffer. The stolen assets include those robbed by the rainbow attacker through an airdrop phishing attack. The scammers employed [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/over-4k-solana-users-lost-more-than-4m-to-phishing-attacks-last-month/\">Over 4k Solana users lost more than $4 million to phishing attacks last month</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-14T16:59:43.000Z",
    "title": "Missed Dogecoin's Rise? Explore Cryptos Set to Soar in This Bull Run",
    "url": "https://cryptodaily.co.uk/2024/01/missed-dogecoins-rise-explore-cryptos-set-to-soar-in-this-bull-run",
    "description": "Explore the potential of emerging cryptocurrencies like Aptos (APT), Sui (SUI), Sei (SEI), Optimism (OP), and Bonk (BONK) in this bull run, as Dogecoin (DOGE) makes headlines with its anticipated rise in the cryptocurrency market. This article provides insights into these promising coins and their unique features, offering investors new opportunities to capitalize on the crypto boom"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-14T16:55:33.000Z",
    "title": "Ethereum Takes a Flight to Cross $2,400 Price Mark – Meme Moguls Set to Outperform Bonk Coin Upon Launch",
    "url": "https://cryptodaily.co.uk/2024/01/ethereum-takes-a-flight-to-cross-2400-price-mark-meme-moguls-set-to-outperform-bonk-coin-upon-launch",
    "description": "The crypto market is still quite unpredictable, and there has been a large volatility in the prices of cryptocurrencies including standout performers like Bitcoin, Ethereum, and Solana"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-14T16:44:42.000Z",
    "title": "Ripple (XRP) and Stellar (XLM) Slip As Investors Shift To Emerging Exchange Pullix (PLX) Ahead of Launch",
    "url": "https://cryptodaily.co.uk/2024/01/ripple-xrp-and-stellar-xlm-slip-as-investors-shift-to-emerging-exchange-pullix-plx-ahead-of-launch",
    "description": "Ripple (XRP) and Stellar (XLM) have recently experienced notable fluctuations, capturing the attention of the crypto market."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-14T16:47:35.000Z",
    "title": "Solana Faces Uncertain Future Amidst Recent Challenges",
    "url": "https://www.cryptopolitan.com/solana-faces-uncertain-future-amidst-recent-challenges/",
    "description": "Solana, often dubbed the &#8220;Ethereum killer,&#8221; has been making headlines recently for its potential and struggles. In this article, we will delve into the current state of Solana, its recent setbacks, and the outlook for the cryptocurrency in 2024. Recent developments and challenges Solana, a blockchain platform known for its high-speed and low-cost transactions, has [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-14T16:57:42.000Z",
    "title": "GameStop confirms plans to shut down NFT marketplace over regulatory concerns",
    "url": "https://crypto.news/gamestop-shuts-down-nft-marketplace-regulatory-worries/",
    "description": "GameStop has decided to \"wind down\" its NFT marketplace due to the \"continuing regulatory uncertainty of the crypto space.\""
  }
]