[
  {
    "source": "Cointelegraph",
    "date": "2023-10-26T00:54:31.000Z",
    "title": "Crypto donations raised by Hamas ‘remain tiny,’ says Elliptic",
    "url": "http://cointelegraph.com/news/crypto-donations-hamas-misinterpreted-wsj-warren-elliptic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/fcbde76a-9f9c-4879-90d3-2b5ef3837cb0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Elliptic’s statement was framed as a rebuttal to recent articles and letters circulating among the media and U.S. lawmakers this month.</p>\n                    <p><p>Blockchain forensic firm Elliptic says there’s “no evidence” that Hamas is receiving a significant volume of cryptocurrency donations to fund its attacks against Israel.</p><p>“There is no evidence to support the assertion that Hamas has received significant volumes of crypto donations,” Elliptic <a href=\"https://www.elliptic.co/blog/setting-the-record-straight-on-crypto-crowdfunding-by-hamas\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in an Oct. 25 statement. The amounts raised “remain tiny,” the firm added.</p><p>Elliptic’s <a href=\"https://www.elliptic.co/blog/setting-the-record-straight-on-crypto-crowdfunding-by-hamas\" target=\"_blank\" rel=\"noopener nofollow\">statement</a> was framed as a rebuttal to recent articles and letters written by The Wall Street Journal and United States lawmakers, which the firm says had misinterpreted data to make the case that cryptocurrency is widely used to fund Hamas’ \"terrorist” activities. </p><p>As an example, Elliptic pointed to a “prominent” Hamas cryptocurrency fundraising campaign, operated by Gaza Now, a pro-Hamas news outlet, which has only raised $21,000 since the Hamas attack on Israel on Oct. 7.</p><p>Of the $21,000 raised, $9,000 was frozen by stablecoin issuer Tether, while another $2,000 was frozen after it was <a href=\"https://cointelegraph.com/news/binance-freezes-hamas-linked-accounts-israeli-request\">sent to a cryptocurrency exchange</a> — presumably to cash out, Elliptic noted.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Setting the record straight on crypto crowdfunding by Hamas <a href=\"https://t.co/1tZrE1C43V\">https://t.co/1tZrE1C43V</a></p>&mdash; Elliptic (@elliptic) <a href=\"https://twitter.com/elliptic/status/1717245156007522371?ref_src=twsrc%5Etfw\">October 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Elliptic said it reached out to WSJ to correct a statement that initially claimed that over $130 million in cryptocurrency was raised by Hamas and Palestinian Islamic Jihad between Aug. 2021 and June 2023. WSJ later revised the statement to say “as much as $93 million” in an Oct. 10 update.</p><p>The WSJ article had been cited in a letter written by Elizabeth Warren and over 100 other U.S. lawmakers <a href=\"https://cointelegraph.com/news/crypto-advocacy-groups-rebuttal-links-terrorism\">to the White House</a> and U.S. Department of the Treasury on Oct. 17.</p><p>Warren and other lawmakers argued that cryptocurrency poses a “national security threat” to the U.S. and its allies and that Congress and the Biden administration must take “strong action” to thoroughly address risks with cryptocurrencies in facilitating illicit activity before it can be used to finance another “tragedy.”</p><p>However, Elliptic reiterated that its data was misinterpreted:</p><blockquote>“Over the past two weeks, politicians and journalists have portrayed public crypto fundraising as a significant source of funds for Hamas and other terrorist groups, but the data simply does not support this.” </blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><br><br>~20% of US Congress signed a letter based on incorrect facts. Elliptic just corrected the facts. Will <a href=\"https://twitter.com/WSJ?ref_src=twsrc%5Etfw\">@WSJ</a> &amp; the ~20% of Congress correct their statements now?<a href=\"https://twitter.com/nic__carter?ref_src=twsrc%5Etfw\">@nic__carter</a>, thank you for demanding truth here, and holding power accountable for misstatements of fact  <a href=\"https://t.co/TazXQnjjgW\">https://t.co/TazXQnjjgW</a></p>&mdash; Caitlin Long ⚡️ (@CaitlinLong_) <a href=\"https://twitter.com/CaitlinLong_/status/1717259975255380408?ref_src=twsrc%5Etfw\">October 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On Oct. 18, blockchain forensics firm Chainalysis also <a href=\"https://www.chainalysis.com/blog/cryptocurrency-terrorism-financing-accuracy-check/\" target=\"_blank\" rel=\"noopener nofollow\">posted</a> a blog attempting to address supposed misconceptions circulating in the media. One particular wallet highlighted by media reportedly received $82 million across 7 and a half months, but Chainalysis explained that of that, only $450,000 was transferred to a known terror-affiliated wallet. </p><p>Meanwhile, Elliptic also noted that in April 2023, Hamas suspended cryptocurrency fundraising conducted through Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC),</a> citing a “concern about the safety of donors and to spare them any harm.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/criminals-flock-cross-chain-bridges-after-mixer-crackdowns-elliptic\"><strong><em>Criminals more reliant on cross-chain bridges than ever after mixer crackdowns</em></strong></a></p><p>In 2021, Israel’s National Bureau for Counter Terror Financing also began <a href=\"https://cointelegraph.com/news/israeli-authorities-seize-hamas-linked-crypto-accounts\">issuing seizure orders for cryptocurrency wallets</a> tied to Hamas and worked with exchanges to freeze accounts used by them. </p><p>These events suggest cryptocurrency isn’t an ideal means to facilitate terrorism fundraising, Elliptic argued:</p><blockquote>“This illustrates the weakness of crypto as a terrorism fundraising tool. The transparency of the blockchain allows illicit funds to be traced, and in some cases linked to real-world identities.”</blockquote><p>Cointelegraph reached out to WSJ for comment but did not receive an immediate response.</p><p><strong><em>Magazine:</em></strong><a href=\"https://cointelegraph.com/magazine/us-enforcement-agencies-turning-up-heat-crypto-related-crime/\"><strong><em> </em></strong><strong><em>US enforcement agencies are turning up the heat on crypto-related crime</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-26T01:00:30.000Z",
    "title": "Loopring Going Multi-Network, Will LRC Prices Explode?",
    "url": "https://www.newsbtc.com/news/loopring-multi-network-lrc-bulls-moon/",
    "description": "Loopring, the layer-2 decentralized exchange (DEX) for Ethereum that uses zk-Rollups, is going multi-network, subsequently expanding its core pillars to four, following a recent update. In a Medium post on October 24, the platform said as part of this change in approach, they will be expanding the functionality of their Loopring Dapp.  Loopring Going Multi-Network: Will This Spark Activity? Under Loopring&#8217;s new shift, there will be two parts of the Dapp in Loopring Pro and Earn functionalities. Furthermore, the Dapp&#8217;s Smart Wallet will become multi-network, opening up more users in diverse but supported platforms. Loopring Dapp was one of the three core pillars in the previous setup. Specifically, the Loopring zk-Rollups protocol formed the core infrastructure through which the layer-2 solution will scale all their products while relying on Ethereum&#8217;s security.  Related Reading: Will Ethereum Rally Continue? These Could Be The Factors To Watch Loopring Pro Dapp was a portal through which decentralized finance (DeFi) users would interact with the Loopring DEX and other services. On the other hand, the Loopring Smart Wallet will be a tool where users can store assets securely. This wallet is baked into Loopring Pro Dapp. Following the announcement, the team said the Loopring Earn DApp will serve as the &#8220;lighter&#8221; version of the Pro service on the platform. A notable difference is that it has been reworked to be more customizable and can be deployed in any other compatible network via the Loopring zk-Rollups protocol. The layer-2 protocol continues to build. Presently, the latest iteration of their DEX, version 3.6, the team said, has processed over 12 million transactions, generating more than $6 billion in trading volume. Since launching, the DEX has connected over 210,000 layer-2 wallets.  Even so, the team plans not to build on this update. The strategy will be to deploy on platforms like Arbitrum, where it can serve as a layer-2 or layer-3, creating a &#8220;highly optimized app-chain experience.&#8221; While at it, the team hopes to expand and scale their &#8220;new core products,&#8221; creating more opportunities for DeFi users. Related Reading: Bitcoin ETF Will Send BTC Back To $44,000, Why This Trading Firm Is Betting On This Scenario LRC Remains Under Pressure: Will This Change? Following this news, LRC, the platform&#8217;s native token, remains on an uptrend, rising with the broader markets. Still, whether the uptick was due to the revival in Bitcoin and Ethereum is not immediately clear. However, what&#8217;s clear is that the announcement coincided with the rally of BTC above $32,000, registering new 2023 highs.  LRC is at new October 2023 highs, up 20% from October lows. At spot levels, the token is at December 2022 lows and down 62% from February 2023 highs. At 2023&#8217;s peak, it changed hands at around $0.50. Feature image from Canva, chart from TradingView"
  }
]