[
  {
    "source": "Cointelegraph",
    "date": "2024-02-15T19:07:10.000Z",
    "title": " WWE gets digital Donruss Elite cards on Panini blockchain ",
    "url": "https://cointelegraph.com/news/wwe-gets-digital-donruss-elite-cards-on-panini-blockchain",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNzM2ZjYzNzAtMDAyZi00NGRmLWI3NTMtZjU1ZjJlMDJlNTkyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Here’s hoping John Cena’s digital Donruss Elite does better than his NFTs did.</p>\n                    <p><p>Panini, an Italian trading card, comics, and collectibles company, recently announced the launch of a series of 100 World Wrestling Entertainment (WWE) Superstars in a digital Donruss Elite card set on the Panini Blockchain.</p><p>The set will include some of the most noteworthy WWE Superstars including John Cena, “Stone Cold” Steve Austin, Roman Reigns, Finn Bálor, Damian Priest, Rhea Ripley, and Lyra Valkyria, Undertaker, Chyna, Chelsea Green, and Kiana James,</p><p>Unfortunately for Cena and WWE, those NFTs essentially bombed, selling only a few dozen of the mid-tier offering.</p><p><a href=\"https://cointelegraph.com/news/wwe-gets-digital-donruss-elite-cards-on-panini-blockchain\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-15T18:48:54.000Z",
    "title": " Crypto laundering evolves with Lazarus Group’s bridge tactics ",
    "url": "https://cointelegraph.com/news/lazarus-group-crypto-laundering-bridge-tactics",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYjVkMTI4OGYtNzg4YS00NWYyLWJjMjMtMGE5M2RmMjJhODhhLkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Crypto laundering has decreased overall, although sophisticated crypto criminals such as the Lazarus Group are shifting from mixers to cross-chain bridges.</p>\n                    <p><p>Cryptocurrencies have introduced a new frontier for money laundering, challenging the traditional methods used to disguise the illegal origins of funds. At the heart of this challenge is blockchain technology, which, with its transparent ledger, makes every transaction visible to the public. Despite this transparency, criminals creatively attempt to obfuscate the trace of their funds, aiming to convert their illicitly obtained cryptocurrencies into fiat currency undetected.</p><p>The “2024 Crypto Crime Money Laundering <a href=\"https://www.chainalysis.com/blog/2024-crypto-money-laundering/\" target=\"_blank\" rel=\"noopener nofollow\">Report</a>” from Chainalysis highlights a notable evolution in the tactics employed by these individuals, reflecting broader shifts in the landscape of digital financial crime. This analysis not only underscores the adaptability of criminals to technological advancements but also marks the ongoing battle between these illicit actors and regulatory efforts to curb money laundering in the digital age.</p><p>Chainalysis’s updated findings reveal a significant shift in cryptocurrency transactions linked to illicit activities in 2023. Illicit addresses transferred $22.2 billion of cryptocurrency to various services, a notable reduction from $31.5 billion in 2022. This decline exceeds the overall decrease in transactional volume, with money laundering activities dropping by 29.5% against a 14.9% fall in total transaction volume. This discrepancy suggests that factors beyond mere transactional slowdowns are at play in the reduction of cryptocurrency laundering.</p><p><a href=\"https://cointelegraph.com/news/lazarus-group-crypto-laundering-bridge-tactics\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-15T19:00:04.000Z",
    "title": "Crypto money laundering drops nearly 30% in 2023 as cyber criminals change tactics",
    "url": "https://cryptoslate.com/crypto-money-laundering-drops-nearly-30-in-2023-as-cyber-criminals-change-tactics/",
    "description": "<p>Crypto money laundering experienced a significant decline of 29.5% in 2023 compared to the previous year, primarily due to a decrease in overall crypto transaction volume. According to a Chainalysis report, illicit addresses moved approximately $22.2 billion in digital assets to various crypto services in 2023, marking a notable drop from the $31.5 billion transferred [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/crypto-money-laundering-drops-nearly-30-in-2023-as-cyber-criminals-change-tactics/\">Crypto money laundering drops nearly 30% in 2023 as cyber criminals change tactics</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-15T19:04:13.000Z",
    "title": "Future of streaming DeeStream (DST) takes Ripple (XRP) fans by storm as Ethereum (ETH) whale buys in early",
    "url": "https://cryptodaily.co.uk/2024/02/future-of-streaming-deestream-dst-takes-ripple-xrp-fans-by-storm-as-ethereum-eth-whale-buys-in-early",
    "description": "Ripple (XRP) holders faced a setback after a US judge ruled in favor of the United States Securities and Exchange Commission,"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-15T18:56:59.000Z",
    "title": "Kelexo (KLXO) ace deemed best investment over Solana (SOL) & Immutable (IMX) in February",
    "url": "https://cryptodaily.co.uk/2024/02/kelexo-klxo-ace-deemed-best-investment-over-solana-sol-immutable-imx-in-february",
    "description": "As the cryptocurrency market continues to evolve, investors are navigating through various options to identify the most promising investments for February. In this dynamic landscape, Solana (SOL) and Immutable (IMX) have shown significant price movements, drawing attention from market participants"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-15T18:56:18.000Z",
    "title": "De.Fi Awards Over $8,000 to Users in Successful Airdrop, Fuels Web3 Growth",
    "url": "https://cryptodaily.co.uk/2024/02/defi-awards-over-8000-to-users-in-successful-airdrop-fuels-web3-growth",
    "description": "De.Fi Awards Over $8,000 to Users in Successful Airdrop, Fuels Web3 Growth"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-15T18:49:36.000Z",
    "title": "Polkadot (DOT) holders love Kelexo (KLXO) as presale stage 1 selling out quick after Solana (SOL) whale bought in",
    "url": "https://cryptodaily.co.uk/2024/02/polkadot-dot-holders-love-kelexo-klxo-as-presale-stage-1-selling-out-quick-after-solana-sol-whale-bought-in",
    "description": "In cryptocurrency, innovative platforms like Kelexo (KLXO) are reshaping the landscape of peer-to-peer lending. With Polkadot (DOT) and Solana (SOL) making waves in the market, the spotlight now shines on Kelexo (KLXO) as it revolutionizes borrowing and lending practices."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T18:57:32.000Z",
    "title": "Elizabeth Warren embraces Bitcoin, celebrates Satoshi Nakamoto’s legacy",
    "url": "https://www.cryptopolitan.com/elizabeth-warren-celebrates-satoshi-nakamoto/",
    "description": "Senator Elizabeth Warren, a well-known critic of Bitcoin and cryptocurrency, publicly supported the digital currency by celebrating the work of its anonymous creator, Satoshi Nakamoto. A historic pivot in political stance Marking the 15th anniversary of the Bitcoin network&#8217;s launch, Warren participated in the Capitol Flag Program to honor Nakamoto&#8217;s creation of what her office [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T18:56:26.000Z",
    "title": "De.Fi Awards Over $8,000 to Users in Successful Airdrop, Fuels Web3 Growth",
    "url": "https://www.cryptopolitan.com/de-fi-awards-over-8000-to-users-in-successful-airdrop-fuels-web3-growth/",
    "description": "Dubai, the United Arab Emirates, February 15th, 2024, Chainwire De.Fi, the premier Web3 Super App, continues its robust expansion in the dynamic crypto space. After evolving into the most extensive all-in-one platform with a trusted user base of 5M globally, De.Fi is thrilled to unveil the official start of Airdrop Season 1. De.Fi (DEFI) is [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-15T18:45:20.000Z",
    "title": "Crypto market soars as SOL Rockets, BTC hits $50K, Kelexo lending surges",
    "url": "https://crypto.news/crypto-market-soars-as-sol-rockets-btc-hits-50k-kelexo-lending-surges/",
    "description": "Solana eyes $140, Bitcoin targets $55K, while Kelexo disrupts defi with AI, hinting at a transformative wave in crypto. In a monumental month for cryptocurrency, Solana (SOL) showcases an ascending triangle pattern, poised for a potential surge to $140, while&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-15T19:00:22.000Z",
    "title": "These Are The Altcoins Drawing Whale Interest, Santiment Reveals",
    "url": "https://www.newsbtc.com/altcoin/altcoins-drawing-whale-interest-santiment-reveals/",
    "description": "The on-chain analytics firm Santiment has revealed some altcoins currently witnessing high interest from the whales. Whale Transactions Have Spiked For These Altcoins Recently In a new post on X, Santiment has discussed how several altcoins have been showing interest from the whales. The on-chain indicator of relevance here is the &#8220;Whale Transaction Count,&#8221; which keeps track of the total number of transfers carrying a value of at least $100,000 taking place every day on the blockchain for any given cryptocurrency. Such large transfers are generally assumed to be coming from the whale entities, as they can only move around amounts this large with single transactions. Related Reading: Litecoin Whale Deposits Big To Binance, LTC’s 3% Drop To Extend? When the metric&#8217;s value is high, the whales make many transfers. This trend implies that these humongous investors are highly interested in trading around the asset in question. On the other hand, the low indicator suggests the whales may not be paying attention to the cryptocurrency as they aren&#8217;t making that many moves on the network. Now, here is the chart shared by the analytics firm that shows the trend in the Whale Transaction Count for some altcoins over the past month: The value of the metric appears to have been quite high in recent days &#124; Source: Santiment on X As displayed in the above graph, these five altcoins have all seen some boost in their Whale Transaction Counts recently: Injective (INJ), Rocket Pool (RPL), PlayDapp (PLA), STP (STPT), and Basic Attention Token (BAT). Given this close surge in the indicator for all of these assets, it would appear possible that the whales have now started playing around with alts after gaining confidence from the sharp rally that Bitcoin has enjoyed. Now, what does this fresh whale interest mean for these altcoins? Usually, a high value of the Whale Transaction count is a predictor of volatility for any cryptocurrency. This is because the whales&#8217; transfers carry a significant value. Of course, any single transaction will likely not be big enough to move the market appreciably on its own, but if many such transfers occur at once, the asset could feel some turbulence. Related Reading: Extreme Greed Is Back For Bitcoin, Is It Time To Sell? However, any such volatility that may arise out of this high whale trading activity can theoretically go in either direction. The Whale Transaction Count only measures the pure number of large transfers happening on the network and doesn&#8217;t provide any information about whether these are buying or selling moves. As such, the only thing that can be said about these altcoins observing high interest from these humongous holders is that they are now more likely to display some volatility, the direction of which is uncertain. INJ Price The 31st-placed coin in the market cap list, Injective, is trading around $35 after going up more than 4% in the past week. Looks like the price of the asset has been consolidating recently &#124; Source: INJUSD on TradingView Featured image from Vivek Kumar on Unsplash.com, Santiment.net, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-15T19:00:53.000Z",
    "title": "The Promising Journey of Avalanche to Reach $40; Increased Demand for Pepe Competitor",
    "url": "https://www.crypto-news-flash.com/the-promising-journey-of-avalanche-to-reach-40-increased-demand-for-pepe-competitor/?utm_source=rss&utm_medium=rss&utm_campaign=the-promising-journey-of-avalanche-to-reach-40-increased-demand-for-pepe-competitor",
    "description": "As the cryptocurrency market continues to evolve, investors are constantly seeking opportunities for growth and diversification within their portfolios. In this dynamic landscape, two assets have been making waves: Avalanche (AVAX) and Rebel Satoshi ($RBLZ). Let&#8217;s explore the recent developments and promising prospects for both. Avalanche&#8217;s Path to $40 Avalanche, currently ranked as the 9th [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-15T19:00:00.000Z",
    "title": "Renowned Author Robert Kiyosaki Bullish on BTC, Silver; Predicts Gold Crash",
    "url": "https://coinedition.com/renowned-author-robert-kiyosaki-bullish-on-btc-silver-predicts-gold-crash/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Renowned Author Robert Kiyosaki Bullish on BTC, Silver; Predicts Gold Crash\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been.png 730w, https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/09/The_accumulation_period_before_a_BTC_halving_has_historically_been-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Kiyosaki foresees gold prices potentially dropping to $1200. According to Kiyosaki, Bitcoin and silver prices will continue to rise. The author expresses expectations for a significant collapse in the S&#038;P 500. Famous entrepreneur and author Robert Kiyosaki, known for his support of Bitcoin, continues to address questions about the economic crisis he claims will occur [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/renowned-author-robert-kiyosaki-bullish-on-btc-silver-predicts-gold-crash/\">Renowned Author Robert Kiyosaki Bullish on BTC, Silver; Predicts Gold Crash</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-15T19:05:58.000Z",
    "title": "‘Bitcoin Is Waiting for Nobody!’ – Glassnode Founders Say BTC Traders To Experience FOMO if This Happens",
    "url": "https://dailyhodl.com/2024/02/15/bitcoin-is-waiting-for-nobody-glassnode-founders-say-btc-traders-to-experience-fomo-if-this-happens/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-flashing-bullishness.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-flashing-bullishness.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-flashing-bullishness.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-flashing-bullishness.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-flashing-bullishness.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-flashing-bullishness.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-flashing-bullishness.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Closely followed crypto analysts say that Bitcoin (BTC) is on the verge of breaking a key resistance level that could spark a big move to the upside. Glassnode co-founders Jan Happel and Yann Allemann, who share the Negentropic handle on the social media platform X, say that if Bitcoin convincingly crosses $52,000, traders may start [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/15/bitcoin-is-waiting-for-nobody-glassnode-founders-say-btc-traders-to-experience-fomo-if-this-happens/\">‘Bitcoin Is Waiting for Nobody!’ – Glassnode Founders Say BTC Traders To Experience FOMO if This Happens</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]