[
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T11:15:00.000Z",
    "title": "Bitcoin breakout catches investors by surprise",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-breakout-catches-investors-by-surprise",
    "description": "<p>After two months of slow sideways and downward price movement, bitcoin has suddenly broken the trend, giving control back to the bulls.</p>\nMany investors had fled\n<p>Following on from the mass of negativity caused by the Securities and Exchange Commission&rsquo;s attack on the crypto industry culminating in suing the two biggest crypto exchanges, Binance and Coinbase, most investors had fled the scene, possibly thinking that crypto might die.</p>\n<p>As mentioned in a Crypto Daily article published only two days previously, it is times like these that the intelligent and experienced traders are waiting for. In addition, the technicals were looking quite positive.</p>\nTechnicals looking good\n<p>Bitcoin had been traversing in a downward sloping channel since mid-April (a bullish pattern in itself), which could even be taken as a bull flag that had gone on for rather a long time.</p>\n<p>Had bitcoin fallen out of the bottom of the channel instead, then this would have been seen as extremely bearish. However, bitcoin did the most logical thing and broke out strongly to the upside.&nbsp;</p>\n<p>It is currently playing with $29,000, which it did hit earlier today. There is the possibility that the price could storm on to the major resistance at $30,300, but it could be expected to get rejected here, at least for the time being.</p>\nCan the move be sustained?\n<p>It might be wondered if bitcoin will be able to sustain a sizable rally on the scale of the 4 and a half month one it made from the beginning of the year. There is still much fear and negativity permeating the crypto space, and given the SEC actions, liquidity is very thin.</p>\n<p>However, bitcoin has its halving cycle that will be drawing the king of the crypto assets higher. This is due to take place in April 2024, so still a lot of ups and downs before the bull run can start in earnest.</p>\nNothing comes close\n<p>All does appear to be on track though. Bitcoin is still the scarcest and hardest form of money on the planet, and it is only a matter of time before traditional institutions take off the blinkers and do something about protecting their portfolios with bitcoin - Gensler and his SEC permitting of course.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T11:38:29.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T11:36:38.000Z",
    "title": "Tether expands stablecoin reach, USDT now on Kava blockchain",
    "url": "https://www.cryptopolitan.com/tether-expands-stablecoin-reach-usdt-now-on-kava-blockchain/",
    "description": "Tether Operations Limited, the entity behind the pioneering USDT stablecoin, has announced its expansion to the Kava blockchain. However, this strategic move further solidifies Tether&#8217;s position as the most widely adopted stablecoin and promises to enhance liquidity across multiple blockchains​. Kava, a layer-1 blockchain founded in 2018, is known for its innovative co-chain design that ... <a title=\"Tether expands stablecoin reach, USDT now on Kava blockchain\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tether-expands-stablecoin-reach-usdt-now-on-kava-blockchain/\" aria-label=\"More on Tether expands stablecoin reach, USDT now on Kava blockchain\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-21T11:13:34.000Z",
    "title": "Asset-agnostic privacy: the cause of disruption in blockchain",
    "url": "https://crypto.news/asset-agnostic-privacy-the-cause-of-disruption-in-blockchain/",
    "description": "The future of blockchain is private and asset-agnostic privacy platform offered via Intra-chain privacy-as-a-service portals will cause major disruptions "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-21T11:10:44.000Z",
    "title": "Why Are Bitcoin And Crypto Up Today? You Need To Know This",
    "url": "https://www.newsbtc.com/news/why-are-bitcoin-and-crypto-up-today-need-to-know/",
    "description": "Bitcoin investors are currently experiencing a déjà vu. As has happened several times in the past, the recent Tether FUD has once again marked the local bottom for the BTC price. At the same time, euphoria and greed have returned to the market. And there are several good reasons for this. BlackRock has applied for a spot ETF and has an insane track record, Fidelity, Citadel &#38; Schwab are launching a crypto exchange, Invesco and WisdomTree have both renewed their Bitcoin ETF applications and Germany&#8217;s largest asset manager Deutsche Bank has applied for a crypto custody license. Big money is definitely making its way into the crypto market after the hard crackdown aka Operation Choke Point 2.0 in the US to grab the largest piece of the pie possible. What Triggered The Bitcoin And Crypto Price Spike? One of the driving factors behind the price rise in the crypto market is undoubtedly the bullish news surrounding Bitcoin and the potential wave of new institutional investors. Bitcoin is once again setting the trend for the broader crypto market, which can also be seen in the fact that Bitcoin dominance, the share of BTC&#8217;s market capitalization in the entire crypto market, continues to rise. The metric rose to its highest level since mid-April 2021 today and currently stands at 51.08%. Yet, the Bitcoin rally has also breathed new life into several altcoins. Among others, FLOW, CFX and BCH are up 22% in the last 24 hours, followed by STX with 18%, OP with 17% and INJ with 15%. ETH is up 4.8%. Related Reading: Bitcoin Hits $138,000 On Binance US, What Happened? However, it is important to note that the current price rally is not mainly due to speculation by futures traders. As we reported yesterday, in recent weeks BTC whales with assets of 1,000 to 10,000 BTC have accumulated a total of 131,6000 BTC worth around $3.5 billion from the spot market. And this trend continues. CryptoQuant CEO Ki Young-Ju wrote via Twitter: This is not a short squeeze, but someone(s) is just buying $BTC a lot. I repeat. This is not a short squeeze, but someone(s) is just buying $BTC a lot. The analyst is referring to the hourly short squeeze ratio indicator. As the chart below shows, the metric has remained relatively flat compared to previous price spikes, indicating that there is more upside potential if short positions are squeezed (once again). This also implies that the spot market had a major influence on the movement. In general, the rise can therefore be seen as more sustainable. Nevertheless, it should be noted that there was a certain degree of short squeeze. Coinglass data shows that about $44 millions in shorts were liquidated. The level is similar to that seen on May 28 this year, when $44 million in BTC shorts were liquidated and the Bitcoin price rose by 4.4%. Vetle Lunde, senior analyst at K33 Research, also made another bullish observation regarding the CME futures. &#8220;Very bullish action on the CME,&#8221; says Lunde, who explained that CME&#8217;s basis pushed to yearly highs after seeing the largest relative daily growth in OI since November 9, 2022. &#8220;Allocations to the futures ETFs did not cause the growth, as the active market participation share increased from 42% to 51% yesterday,&#8221; remarked the analyst. Related Reading: SEC Sues Binance, Coinbase Then BlackRock Files For Bitcoin Spot ETF; Is This An Inside Job? At press time, Bitcoin was displaying an extremely bullish price action. BTC bounced off the 200-day EMA and broke through the downward trend that persisted since mid-April this year. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T11:20:59.000Z",
    "title": "PEPE Coin Investors Rush to Get on Board As Pikamoon (PIKA) Closes Round 2 of Presale in Style, Early Investors Eye 100x Gains Upon Launch",
    "url": "https://www.crypto-news-flash.com/pepe-coin-investors-rush-to-get-on-board-as-pikamoon-pika-closes-round-2-of-presale-in-style-early-investors-eye-100x-gains-upon-launch-2/?utm_source=rss&utm_medium=rss&utm_campaign=pepe-coin-investors-rush-to-get-on-board-as-pikamoon-pika-closes-round-2-of-presale-in-style-early-investors-eye-100x-gains-upon-launch-2",
    "description": "After reaching an all-time high of $0.000004 earlier last month, PEPE has been gradually losing its value, frustrating investors, and losing its popularity in the crypto space. With the token performing lower than expected, PEPE investors are now wondering how to recoup their losses before it is too late. Some PEPE investors are already looking [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-21T11:36:52.000Z",
    "title": "Ethereum (ETH): Why Bearish Bias May Linger Despite Shorts Liquidation",
    "url": "https://coinedition.com/ethereum-eth-why-bearish-bias-may-linger-despite-shorts-liquidation/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/105.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/105.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/105-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/105-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/105-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/105-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/105-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/105-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/105-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/105-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/105-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/105-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/105-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/105-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/105-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/105-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/105-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Over the last 24 hours, more than $25 million of Ethereum (ETH) positions have been liquidated. Also, Coinglass revealed that short-positioned traders accounted for the highest portion of this casualty. This was a result of ETH’s 5% hike to $1,814 — a value it last hit two weeks back. The price rise could come as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ethereum-eth-why-bearish-bias-may-linger-despite-shorts-liquidation/\">Ethereum (ETH): Why Bearish Bias May Linger Despite Shorts Liquidation</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-21T11:15:11.000Z",
    "title": "MEXC Global Exchange Review 2023: Features, Trading Options, Fees, and More",
    "url": "https://coinedition.com/mexc-global-exchange-review/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"MEXC-Global-Exchange-Review\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/MEXC-Global-Exchange-Review-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Introduction MEXC Global, an established cryptocurrency exchange platform founded in 2018, has gained significant traction among traders. Its user-friendly mobile and desktop applications offer a diverse selection of cryptocurrencies, along with advanced trading options and features tailored to accommodate traders of all skill levels. This review of MEXC Global for 2023 aims to provide a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/mexc-global-exchange-review/\">MEXC Global Exchange Review 2023: Features, Trading Options, Fees, and More</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]