[
  {
    "source": "CoinDesk",
    "date": "2023-11-07T14:00:00.000Z",
    "title": "Crypto Broker sFOX Offers Commission-Free Blockchain Staking from Regulated Custody",
    "url": "https://www.coindesk.com/business/2023/11/07/crypto-broker-sfox-offers-commission-free-blockchain-staking-from-regulated-custody/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "“We are providing a gateway to staking without stepping in the middle or taking any revenue or profit,” founder Akbar Thobhani said."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-07T14:01:02.000Z",
    "title": "Sui Taps Space and Time, Bringing Zero-Knowledge Tools to Web3 Games",
    "url": "https://decrypt.co/204654/sui-taps-space-time-bringing-zero-knowledge-tools-web3-games",
    "description": "Sui's tie-up with Space and Time means that developers will be able \"to join in-game activity with on-chain transactions,\" its CEO said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-07T13:59:12.000Z",
    "title": "'107,000 GPUs on the waitlist' — io.net beta launch attracts data centers, GPU clusters ",
    "url": "http://cointelegraph.com/news/107-000-gpus-on-the-waitlist-io-net-beta-launch-attracts-data-centers-gpu-clusters",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/68746c37-811b-4538-9f80-13c079b660b8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Io.net’s recently developed decentralized physical infrastructure network has moved into its beta phase, allowing GPU computing providers to plug into the platform.</p>\n                    <p><p>Over 100,000 GPUs from data centers and private clusters are set to plug into a new decentralized physical infrastructure network (DePIN) beta launched by io.net.</p><p>As Cointelegraph previously <a href=\"https://cointelegraph.com/news/startup-builds-decentralized-gpu-sourcing-network-for-ai\">reported</a>, the startup has developed a decentralized network that sources GPU computing power from various geographically diverse data centers, cryptocurrency miners and decentralized storage providers to power machine learning and AI computing.</p><p>The company announced the launch of its beta platform during the Solana Breakpoint conference in Amsterdam, which coincided with a newly formed partnership with Render Network.</p><p>Tory Green, chief operating officer of io.net, spoke exclusively to Cointelegraph after a keynote speech alongside business development head Angela Yi. The pair outlined the critical differentiators between io.net’s DePIN and the broader cloud and GPU computing market.</p><p><a href=\"https://cointelegraph.com/news/google-cloud-broadens-web3-startup-program-with-11-blockchain-firms\"><strong><em>Related: Google Cloud broadens Web3 startup program with 11 blockchain firms</em></strong></a></p><p>Green identifies cloud providers like AWS and Azure as entities that own their supplies of GPUs and rent them out. Meanwhile, peer-to-peer GPU aggregators were created to solve GPU shortages, but “quickly ran into the same problems” as the exec explained.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Proud to present <a href=\"https://twitter.com/ionet_official?ref_src=twsrc%5Etfw\">@ionet_official</a> at <a href=\"https://twitter.com/solana?ref_src=twsrc%5Etfw\">@Solana</a> <a href=\"https://twitter.com/hashtag/Breakpoint2023?src=hash&amp;ref_src=twsrc%5Etfw\">#Breakpoint2023</a> yesterday!   <br><br>Whether you&#39;re a GPU provider or an ML engineer - tune in for the live demonstration of the platform and join <a href=\"https://t.co/WLXlHkv6f1\">https://t.co/WLXlHkv6f1</a> now.<br><br>Watch the full video  <a href=\"https://t.co/E1XsgJLJNu\">pic.twitter.com/E1XsgJLJNu</a></p>&mdash; io.net (@ionet_official) <a href=\"https://twitter.com/ionet_official/status/1720813946641220079?ref_src=twsrc%5Etfw\">November 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The wider Web2 industry continues to look to tap into GPU computing from underutilized sources. Still, Green contends that none of these existing infrastructure providers cluster GPUs in the same way that io.net founder Ahmad Shadid has pioneered.</p><p>“The problem is that they don't really cluster. They're primarily single instance and while they do have a cluster option on their websites, it's likely that a salesperson is going to call up all of their different data centers to see what’s available,” Green adds.</p><p>Meanwhile, Web3 firms like Render, Filecoin and Storj have decentralized services not focused on machine learning. This is part of io.net’s potential benefit to the Web3 space as a primer for these services to tap into the space.</p><p>Green points to AI-focused solutions like Akash network, which clusters an average of 8 to 32 GPUs, as well as GenSyn, as the closest service providers in terms of functionality. The latter platform is building its own machine learning compute protocol to provide a peer-to-peer “supercluster” of computing resources.</p><p>With an overview of the industry established, Green believes io.net’s solution is novel in its ability to cluster over different geographic locations in minutes. This statement was tested by Yi, who created a cluster of GPUs from different networks and locations <a href=\"https://www.youtube.com/watch?v=EFxvIFEjR14\" target=\"_blank\" rel=\"noopener nofollow\">during a live demo</a> on stage at Breakpoint.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/32a062c9-1767-463f-b7db-bc2d0cf87d36.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>io.net's user interface allows a user to deploy a cluster of GPUs from different locations and service providers globally. Source: io.net</em></figcaption></figure><p>As for its use of the Solana blockchain to facilitate payments to GPU computing providers, Green and Yi note that the sheer scale of transactions and inferences that io.net will facilitate would not be processable by any other network.</p><p>“If you're a generative art platform and you have a user base that's giving you prompts, every single time those inferences are made, micro-transactions behind it,” Yi explains.</p><blockquote>“So now you can imagine just the sheer size and the scale of transactions that are being made there. And so that's why we felt like Solana would be the best partner for us.”</blockquote><p>The partnership with Render, an established DePIN network of distributed GPU suppliers, provides computing resources already deployed on its platform to io.net. Render’s network is primarily aimed at sourcing GPU rendering computing at lower costs and faster speeds than centralized cloud solutions. </p><p>Yi described the partnership as a win-win situation, with the company looking to tap into io.net’s clustering capabilities to make use of the GPU computing that it has access to but is unable to put to use for rendering applications.</p><p>Io.net will carry out a $700,000 incentive program for GPU resource providers, while Render nodes can expand their existing GPU capacity from graphical rendering to AI and machine learning applications. The program is aimed at users with consumer-grade GPUs, categorized as hardware from Nvidia RTX 4090s and under. </p><p>As for the wider market, Yi highlights that many data centers worldwide are sitting on significant percentages of underused GPU capacity. A number of these locations have “tens of thousands of top-end GPUs” that are idle:</p><blockquote>“They're only utilizing 12 to 18% of their GPU capacity and they didn't really have a way to leverage their idle capacity. It's a very inefficient market.”</blockquote><p>Io.net’s infrastructure will primarily cater to machine learning engineers and businesses that can tap into a highly modular user interface that allows a user to select how many GPUs they need, location, security parameters and other metrics. </p><p><a href=\"https://cointelegraph.com/magazine/crypto-zero-knowledge-voting-finance/\"><strong><em>Magazine: Beyond crypto: Zero-knowledge proofs show potential from voting to finance</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-07T13:55:22.000Z",
    "title": "Caitlin Long’s Custodia Bank launches Bitcoin custody platform",
    "url": "http://cointelegraph.com/news/custodia-bank-bitcoin-custody",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/29088e1a-b0f4-401c-b236-0c4661067289.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Custodia Bank’s launch of Bitcoin custody follows a series of regulatory challenges the firm faced earlier this year.</p>\n                    <p><p>Custodia Bank, a cryptocurrency-friendly bank founded by Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) advocate <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/caitlin-long\">Caitlin Long</a>, has launched its Bitcoin custody platform.</p><p>The firm took to X (formerly Twitter) on Nov. 7 to <a href=\"https://x.com/custodiabank/status/1721861898482651304?s=20\" target=\"_blank\" rel=\"noopener nofollow\">announce</a> the launch of Custodia Bank’s Bitcoin custody service targeting businesses like fiduciaries, investment advisers, fund managers and corporate treasurers.</p><p>The launch comes soon after Custodia Bank earned approval from the Wyoming Division of Banking to go live with its Bitcoin custody service, the announcement notes.</p><p>Announcing the news, Custodia Bank emphasized that the platform is a non-lending bank built by Bitcoiners and offers segregated custody accounts on its “custom-built Bitcoin custody platform.”</p><p>The statement said that Custodia Bank offers integrated Bitcoin custody and U.S. dollar services on one platform, which is designed to simplify user operations and reduce risks. Custodia Bank added:</p><blockquote>“Since we built our Bitcoin custody platform in-house, we’re especially grateful to those willing to help us by providing user feedback.”</blockquote><p>Custodia Bank’s approval from the Wyoming Division of Banking follows a series of regulatory challenges for the firm. In January 2023, the Federal Reserve Board <a href=\"https://cointelegraph.com/news/fed-denies-custodia-bank-application-to-join-the-federal-reserve-system\">rejected the bank’s application</a> to become a member of the Federal Reserve System, saying it was “inconsistent with the required factors under the law.” The Fed subsequently denied Custodia’s <a href=\"https://cointelegraph.com/news/us-federal-reserve-denies-custodia-bank-s-request-for-fed-supervision\">request to reconsider its membership</a> application in its system.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/dz-bank-crypto-custody-institutional-investors\"><strong><em>DZ Bank, third-largest German bank, to start crypto custody for institutional investors</em></strong></a></p><p>In a detailed report in March 2023, the Fed’s board <a href=\"https://cointelegraph.com/news/custodia-bank-s-membership-denied-for-ties-with-crypto-markets-says-us-fed\">said the decision</a> to reject Custodia’s application was <a href=\"https://cointelegraph.com/news/custodia-bank-s-membership-denied-for-ties-with-crypto-markets-says-us-fed\">due to concerns about banks</a> with a high concentration of activities related to the crypto industry. Custodia Bank reportedly <a href=\"https://www.centralbanking.com/fintech/crypto-assets/7959512/custodia-opens-for-business-without-fed-master-account#:~:text=Crypto%20services%20provider%20Custodia%20Bank,of%20its%20proposed%20business%20model.\" target=\"_blank\" rel=\"noopener nofollow\">opened</a> for business in August 2023, though the Fed has blocked much of its proposed business model.</p><p>Founded in 2020, Custodia is a bank aiming to bridge the gap between digital assets and the U.S. dollar payments system and a digital asset custodian. The firm was formerly known as Avanti Financial Group and is based in Cheyenne, Wyoming.</p><p>Custodia Bank did not immediately respond to Cointelegraph’s request for comment.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-07T14:06:46.000Z",
    "title": "Bitcoin (BTC) and Cosmos (ATOM) Prices Rally, VC Spectra (SPCT) Poised for Market-Leading Performance",
    "url": "https://cryptodaily.co.uk/2023/11/bitcoin-btc-and-cosmos-atom-prices-rally-vc-spectra-spct-poised-for-market-leading-performance",
    "description": "Despite skepticism from traditional financial figures like Berkshire Hathaway's Vice Chairman Charlie Munger, the cryptocurrency market is experiencing a notable rally. Bitcoin (BTC) maintains a strong dominance and bullish outlook, while Cosmos (ATOM) prices surge"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-07T13:53:14.000Z",
    "title": "BRC20 Token ORDI Skyrockets Over 40% as Binance Announces Listing",
    "url": "https://news.bitcoin.com/brc20-token-ordi-skyrockets-over-40-as-binance-announces-listing/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BRC20 Token ORDI Skyrockets Over 40% as Binance Announces Listing\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Tuesday, the BRC20 token, dubbed ordinals (ORDI), soared over 40% against the U.S. dollar, fueled by news from Binance about its impending inclusion on the exchange&#x2019;s roster of traded currencies. ORDI rocketed from an early 24-hour low of $7 to a peak of $11.53, settling at $10.48 per token at the time of this [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-07T13:44:26.000Z",
    "title": "Ava Labs axes 12% of staff to redirect efforts towards expansion",
    "url": "https://crypto.news/ava-labs-axes-12-of-staff-to-redirect-efforts-towards-expansion/",
    "description": "Ava Labs, the team developing the Avalanche blockchain, has announced a 12% reduction in its workforce, attributing the decision to strategically reallocating its resources. The firm&#8217;s CEO and founder, Emin Gün Sirer, confirmed the layoffs on Nov. 7, following announcements&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-07T14:00:39.000Z",
    "title": "Cardano (ADA) 50-Week EMA Flashes Bullish, Is $0.45 On The Way?",
    "url": "https://www.newsbtc.com/news/cardano/cardano-ada-0-45-on-the-way/",
    "description": "Cardano (ADA) is one of the altcoins that has seen major gains in recent days, and this has ignited chatter about how the crypto token could climb. In line with this, Dan Gambardello, the founder of Crypto Capital Venture, has some answers as he provided insight into the token’s trajectory using technical analysis. What The Charts Are Saying About Cardano In a video shared on YouTube, Gambardello highlighted the fact that ADA saw a weekly close above the 50-week exponential moving average (EMA), which is something he labeled as “special” and “something “huge.” This is so because there are currently similarities between now and the last cycle, which ushered in the bull market. Related Reading: Shiba Inu-Based BONE Eyes $1 As This On-Chain Metric Explodes Interestingly, he noted that Cardano seems to be above the game this time around, as the close above the 50-week moving average occurred this time while ADA is still in the accumulation phase, unlike back in February 2020 when it happened just after the accumulation phase.  He also linked the Relative Strength Index (RSI) to these happenings as he noted that, just like the last cycle, ADA was overbought as it was preparing for an upside move. Despite the overbought similarities, he mentioned that this could be different in that ADA continues instead of a retracement as both the 20-day and 50-day exponential moving averages haven’t crossed over the 200-day EMA. Can ADA Make A Move To $0.45? Although the crypto founder admitted that he didn’t exactly have a target as to what price level ADA could hit, he mentioned that the daily chart was hinting at $0.45 as a possible target. However, he doesn’t believe Cardano can add that much gain to hit such height, as he predicts a “big retracement” soon enough. As to how high he believes Cardano (ADA) can reach before the retracement, he mentioned that the crypto token could peak at $0.40 before the expected retracement, which could see ADA drop to around $0.29 and $0.30 based on the moving average structure.  Related Reading: Bitcoin And Ethereum Rally Not Over: Crypto Capital Inflows Reach One-Year High Such a decline will represent about a %15 decline, but Gambardello is optimistic as he stated that such a dip usually occurs in between the end of the bear cycle and the start of the bull cycle. Meanwhile, he said that ADA could also fall to a Fibonacci support at around $0.26 and $0.28. Despite his prediction that Cardano is going to fall soon enough based on its overbought status, Gambardello isn’t ruling the target of $0.45 out. He just believes it could take longer rather than just seeing all green candles straight up to that target.  At the time of writing, ADA is currently trading at around $0.35, up over 3% in the last 24 hours, according to data from CoinMarketCap.  ADA bulls break $0.35 resistance &#124; Source: ADAUSD on Tradingview.com Featured image from FX Street, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-07T14:06:00.000Z",
    "title": "CoinEx Halts XDAG Trading and Withdrawals After Massive Hack",
    "url": "https://coinedition.com/coinex-halts-xdag-trading-and-withdrawals-after-massive-hack/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/CoinEx_Charity_Empowers_Education_Through_Charitable_Donations.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"CoinEX\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/CoinEx_Charity_Empowers_Education_Through_Charitable_Donations.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/CoinEx_Charity_Empowers_Education_Through_Charitable_Donations-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/CoinEx_Charity_Empowers_Education_Through_Charitable_Donations-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/CoinEx_Charity_Empowers_Education_Through_Charitable_Donations-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/CoinEx_Charity_Empowers_Education_Through_Charitable_Donations-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cryptocurrency exchange CoinEx announced on November 6 what led to the delisting of XDAG. The exchange suffered a massive hacking incident in September that resulted in the theft of a significant portion of the asset&#8217;s circulation supply. On September 12, CoinEx suffered a security breach by unknown hackers who managed to steal all XDAG holdings [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/coinex-halts-xdag-trading-and-withdrawals-after-massive-hack/\">CoinEx Halts XDAG Trading and Withdrawals After Massive Hack</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]