[
  {
    "source": "CoinDesk",
    "date": "2023-07-27T13:58:47.000Z",
    "title": "Ukraine Has Raised $225M in Crypto to Fight Russian Invasion, but Donations Have Stagnated Over the Last Year: Crystal",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/27/ukraine-has-raised-225m-in-crypto-to-fight-russian-invasion-but-donations-have-stagnated-over-the-last-year-crystal/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Ukraine attracted over $225 million from supporters around the world, while Russian military fundraisers only scored several millions."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-27T14:01:02.000Z",
    "title": "Iconic Electronic Music Platform Beatport Launches NFT Marketplace on Polkadot",
    "url": "https://decrypt.co/150302/iconic-electronic-music-platform-beatport-launches-nft-marketplace-polkadot",
    "description": "To mark Beatport’s Web3 launch on Polkadot, it's issuing the limited collection ‘NACHTS’ from Berlin-based photographer Mischa Fanghaenel."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-27T13:41:32.000Z",
    "title": "Block.one ICO damages ‘far beyond’ $22M, ENF founder says",
    "url": "https://cointelegraph.com/news/blockone-ico-damages-far-beyond-22-million-enf-founder-says",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/531d33ec-e0e1-4ae9-866c-2405a2a3c7c2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Block.one owes much more to EOS investors than just $22 million after the $4-billion ICO, EOS Network Foundation CEO Yves La Rose believes.</p>\n                    <p><p>The latest legal action against Block.one (B1), the creator and original seller of EOS (<a href=\"https://cointelegraph.com/eos-price-index\">EOS</a>), could potentially help plaintiffs get higher compensation, according to EOS Network Foundation (ENF) founder and CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/yves-la-rose\">Yves La Rose</a>.</p><p>On July 25, La Rose officially announced that ENF is <a href=\"https://cointelegraph.com/news/eos-foundation-to-sue-blockone-on-failure-to-honor-one-billion-commitment\">preparing a lawsuit against Block.one</a> for its failure to follow through on its $1-billion following its $4.1-billion raise in 2018.</p><p>The CEO argued that Block.one’s broken promises to invest $1 billion caused major issues for the EOS community and promised to hold the firm accountable.</p><p>As many investors have already been part of another class action against Block.one, a number of those might need to opt out of their current lawsuits, La Rose said.</p><p>“They would do that if they aren’t satisfied with the current settlement offer and believe their interests are better suited by opting out, which is a common practice,” the ENF founder told Cointelegraph.</p><p>La Rose added that opting out of an old class lawsuit could result in “obtaining a higher payout,” but it could also result in receiving nothing.</p><p>“There are no guarantees, which is why this is a personal choice they need to make,” the ENF founder noted, reiterating that the firm recommends any person consult their own legal counsel to determine which path is best for them.</p><p>La Rose also emphasized that the amount of settlement in the current class action might not be enough for those who were affected. He stated:</p><blockquote>“Not everyone is covered in the current class, and so this new contemplated action also widens the pool of potential participants. Also, the measly $22 million that Block.one offered is pathetic. The damages caused on a $4-billion raise are far beyond what is being offered in reparations.”</blockquote><p>Block.one’s EOS initial coin offering (ICO) became one of the largest crowdfunding raises in history, <a href=\"https://cointelegraph.com/news/eos-about-to-secure-a-record-4-bln-in-year-long-ico\">raising as much as $4.1 billion</a> by June 2018 and outstripping <a href=\"https://cointelegraph.com/news/telegram-attracts-850-mln-in-second-round-of-ico\">Telegram’s $1.7 billion ICO</a>.</p><p>By the end of its year-long crowdsale, EOS was trading at around $12, or around 44% down from its peak price recorded in April 2018. The cryptocurrency then experienced a couple of ups and downs, eventually plummeting all the way down below $1. At the time of writing, EOS is trading at $0.74, down roughly 30% over the past year.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-campaign-contribution-charge-dropped-by-prosecutors\"><strong><em>Sam Bankman-Fried to have campaign donation charge dropped: Prosecutors</em></strong></a></p><p>Despite a massive decline, EOS is still one of the biggest cryptocurrencies by market capitalization, which amounts to $827 million at the time of writing. That <a href=\"https://www.coingecko.com/\" target=\"_blank\" rel=\"noopener nofollow\">makes</a> the EOS cryptocurrency the 54th largest coin by market value, according to CoinGecko.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/8da9f0fa-927f-42fe-aa76-c646d9509ff5.png\"  /><figcaption style=\"text-align: center;\"><em>EOS all-time price chart. Source: CoinGecko</em></figcaption></figure><p>In 2019, Block.one <a href=\"https://cointelegraph.com/news/sec-reaches-24-million-settlement-with-eos-parent-firm-blockone\">agreed to pay a $24-million</a> civil fine to settle with the United States Securities and Exchange Commission over charges that it held an unregistered ICO. A few months later, disgruntled investors <a href=\"https://www.prnewswire.com/news-releases/investors-bring-class-action-lawsuit-against-blockone-for-biggest-of-all-crypto-frauds--coin-offering-scam-netted-company-billions-301061047.html\" target=\"_blank\" rel=\"noopener nofollow\">started</a> a class-action lawsuit against Block.one, arguing that the firm deceived tokenholders about its financial history, operations and budget, as well as executive compensation, material trends, risk factors and others.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tokenizing-music-royalties-nfts-taylor-swift-3lau-nas-the-weeknd/\"><strong><em>Magazine: Tokenizing music royalties as NFTs could help the next Taylor Swift</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-27T13:55:02.000Z",
    "title": "BlackRock aims to democratize digital investments in India, amid growing BTC rumors",
    "url": "https://cryptoslate.com/blackrock-aims-to-democratize-digital-investments-in-india-amid-growing-btc-rumors/",
    "description": "<p>BlackRock, the world&#8217;s largest asset manager, has announced a joint venture with Jio Financial Services Limited (JFS) to form Jio BlackRock with the goal of democratizing access to investment solutions for investors in India through a digital-first strategy. As BlackRock&#8217;s press release stated, this venture combines the deep expertise and talent of the global giant in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/blackrock-aims-to-democratize-digital-investments-in-india-amid-growing-btc-rumors/\">BlackRock aims to democratize digital investments in India, amid growing BTC rumors</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-27T14:05:28.000Z",
    "title": "Fireblocks, Astar Network Pair Up to Drive Institutional Crypto Access",
    "url": "https://cryptobriefing.com/fireblocks-astar-network-drive-institutional-crypto-access/?utm_source=feed&utm_medium=rss",
    "description": "Fireblocks, an institutional-grade platform for adopting digital assets, has partnered with Astar Network, a platform compatible with Ethereum Virtual Machine (EVM) and WebAssembly (Wasm). Through this partnership, digital assets and..."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-27T13:58:32.000Z",
    "title": "Could $XRP Become a Reserve Asset? Revisiting ‘The Chad Steingraber Theory’",
    "url": "https://www.cryptoglobe.com/latest/2023/07/could-xrp-become-a-reserve-asset-revisiting-the-chad-steingraber-theory/",
    "description": "In a Twitter thread dated 18 August 2022, Chad Steingraber, a known figure in the XRP community, presented an intriguing thought experiment about the future of XRP. His theory explores the idea of XRP becoming a reserve asset, similar to gold, for banks and institutional liquidity providers. On 25 July 2023, Steingraber encouraged his followers […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-27T13:50:00.000Z",
    "title": "Zuckerberg Hopeful Despite Meta’s $3.7B Loss In 2023 Q2",
    "url": "https://cryptodaily.co.uk/2023/07/zuckerberg-hopeful-despite-meta-3-7-b-usd-loss-in-2023-q2",
    "description": "<p>CEO Mark Zuckerberg remains hopeful about the company&rsquo;s metaverse prospects despite sinking $3.7 billion in operating losses in the second quarter of this year.&nbsp;</p>\nMeta&rsquo;s Metaverse Investment Takes a Toll\n<p>The tech giant posted its latest earnings report, which revealed that it had faced significant losses in the second quarter of 2023, with metaverse-related expenses amounting to a staggering $3.74 billion.&nbsp;</p>\n<p>As part of its ongoing investment in the virtual reality (VR) business, Meta has already spent a total of $7.7 billion in 2023. Despite the substantial losses in its metaverse ventures, Meta managed to report an 11% increase in revenue for Q2 2023 compared to the same period last year, reaching a total revenue of $31.9 billion. This revenue growth, however, was overshadowed by the concerning performance of its metaverse-focused Reality Labs.</p>\nReality Labs Revenue Hits a Low\n<p>The revenue from Reality Labs, which is responsible for Meta's metaverse initiatives, plummeted by nearly 40% compared to Q2 2022, hitting its lowest point in two years with just $276 million in revenue. Meta's financial chief, Susan Li, attributed this sharp decline to reduced sales of its VR headset, Quest 2. Additionally, the department's expenses rose by 23% to $4.0 billion, primarily due to increased staffing costs.</p>\n<p>Meta anticipates further challenges for Reality Labs, with projected operating losses expected to persist throughout 2023. The losses were attributed to the ongoing development of VR-related products and continued investments in the metaverse.</p>\nStock Price Surge Despite Metaverse Woes\n<p>Following the earnings announcement, Meta's stock price experienced a significant surge, rising over 7% in after-hours trading, reaching around $320, as reported by Google Finance data. Despite this recent increase, $META shares remain below their all-time high of over $378, set in September 2021. Nevertheless, the stock has gained nearly 140% year-to-date.</p>\nThreads Platform Faces Challenges\n<p>Zuckerberg acknowledged that while the platform had seen unexpected daily engagement, the company's primary focus was on user retention, followed by growth and eventual monetization. This statement came on the same day as a report from Similarweb, claiming that Threads had experienced a 60% decline in users since its launch. Threads initially reached 49 million daily active users on its Android app on July 7, but the numbers fell drastically to 12.6 million by July 23.&nbsp;</p>\n<p>However, the CEO has remained hopeful about the platform&rsquo;s performance, claiming that the company strategy was &ldquo;fully committed to the metaverse vision.&rdquo;&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-27T14:00:57.000Z",
    "title": "Prosecutors Want Sam Bankman-Fried Jailed Ahead of Trial",
    "url": "https://news.bitcoin.com/prosecutors-want-sam-bankman-fried-jailed-ahead-of-trial/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2241251605-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Prosecutors Want Sam Bankman-Fried Jailed Ahead of Trial\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2241251605-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2241251605-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2241251605-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2241251605-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2241251605-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2241251605-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2241251605.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S. prosecutors have asked a federal judge to put crypto exchange FTX founder Sam Bankman-Fried in jail over alleged witness tampering before his trial starts in October. While requiring the prosecution to formalize the request and giving the defense enough time to make its case, the judge issued a temporary gag order restricting their public [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T14:01:45.000Z",
    "title": "Congressman Sherman sparks fury with ‘ridiculous’ remarks on SEC v. Ripple ruling",
    "url": "https://www.cryptopolitan.com/congressman-sherman-sparks-fury-with-ridiculous-remarks-on-sec-v-ripple-ruling/",
    "description": "The cryptocurrency industry has been plunged into a heated dispute over the recent court ruling on Ripple (XRP), one of the top digital assets in the cryptocurrency market. The catalyst for the uproar was none other than U.S. Congressman Brad Sherman, a well-known advocate for the U.S. Securities and Exchange Commission (SEC). The court&#8217;s verdict ... <a title=\"Congressman Sherman sparks fury with &#8216;ridiculous&#8217; remarks on SEC v. Ripple ruling\" class=\"read-more\" href=\"https://www.cryptopolitan.com/congressman-sherman-sparks-fury-with-ridiculous-remarks-on-sec-v-ripple-ruling/\" aria-label=\"More on Congressman Sherman sparks fury with &#8216;ridiculous&#8217; remarks on SEC v. Ripple ruling\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T13:40:33.000Z",
    "title": "Earn and Burn Token ElmoERC Launches With First Person Shooter Game",
    "url": "https://www.cryptopolitan.com/earn-and-burn-token-elmoerc-launches-with-first-person-shooter-game/",
    "description": "Warsaw, Poland, July 27th, 2023, Chainwire New blockchain project ElmoERC has launched with the goal of combining the fun of memes with practical utility and a rapid deflationary mechanism. An Ethereum-based token, ElmoERC aims to create a vibrant ecosystem for its community through various innovative features. ElmoERC embodies meme culture and incorporates two essential elements ... <a title=\"Earn and Burn Token ElmoERC Launches With First Person Shooter Game\" class=\"read-more\" href=\"https://www.cryptopolitan.com/earn-and-burn-token-elmoerc-launches-with-first-person-shooter-game/\" aria-label=\"More on Earn and Burn Token ElmoERC Launches With First Person Shooter Game\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-27T13:49:35.000Z",
    "title": "XRP relisted on exchanges as QUBE takes over crypto",
    "url": "https://crypto.news/xrp-relisted-on-exchanges-as-qube-takes-over-crypto/",
    "description": "InQubeta is gaining traction as QUBE takes over crypto. This follows Ripple's victory over the SEC which saw exchanges relist XRP"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-27T13:45:35.000Z",
    "title": "Robert Kennedy Jr. Admits to purchasing Bitcoin",
    "url": "https://crypto.news/robert-kennedy-jr-admits-to-purchasing-bitcoin/",
    "description": "US Democrat presidential candidate Robert Kennedy Jr. said he bought 14 BTC for his children to &#8220;put his money where his mouth is.&#8221; Robert F. Kennedy Jr, also known as RFK Jr., participated in a Twitter Space hosted by crypto&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-27T14:00:05.000Z",
    "title": "Bitcoin At Decision Point As Investors Hold Neutral Sentiment",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-decision-point-investors-hold-neutral-sentiment/",
    "description": "Bitcoin may be at a decision point right now as investor sentiment is exactly neutral. Which way will the market tip in the coming days? Bitcoin Fear &#38; Greed Index Suggests Market Is Neutral A few days back, Bitcoin had observed a sharp plunge that had taken the cryptocurrency&#8217;s value towards the $29,000 level. In the days that followed, the asset had only consolidated around these relatively low levels, but during the last 24 hours, things appear to have changed a bit. The impetus for this latest volatility appears to have been the US Federal Reserve (Fed) hiking interest rates by an expected 25 bps. Shortly after the FOMC meeting had announced this increase, Bitcoin started to surge, giving investors hope that the coin may be traveling back toward the $30,000 level. This new rise, however, seems to have already run out of steam, as BTC has fallen back to lower levels. At the time of writing, Bitcoin is trading around $29,400, down 2% in the past week. BTC's recovery hasn't been much yet &#124; Source: BTCUSD on TradingView While Bitcoin has retraced from its peak during the past day, the cryptocurrency is still up a net amount in this period, meaning that the asset has managed to hold onto some recovery nonetheless. Related Reading: This AMD Ryzen Bug Can Compromise Your Crypto Wallet Keys The fact remains, though, that the coin has been unable to keep up its upward trend, a sign that the market is still perhaps indecisive about its direction. This is reflected in the general investment sentiment in the space, as the &#8220;Fear &#38; Greed Index&#8221; shows. Looks like the needle is pointing directly in the middle currently &#124; Source: Alternative The Fear &#38; Greed index makes use of various market-related metrics (like volatility, dominance, and volume) to judge what the most likely sentiment of the average participant in the sector is currently. This index has a value of 51 right now, which means that the Bitcoin investor sentiment is almost exactly in the balance. This lack of direction in the market isn&#8217;t a new development; the investors have been leaning towards neutrality for a week or so now. The trend in the Fear &#38; Greed Index over the past year &#124; Source: Alternative The current neutral sentiment must not be confused with a lack of interest in Bitcoin, however, as data from the on-chain analytics firm Santiment shows that the share of social media discussions related to the 100 largest assets in the cryptocurrency sector occupied by BTC alone (the &#8220;social dominance&#8220;) is now at a two-week high. BTC-related talks make up for 33% of all discussions related to the top 100 coins &#124; Source: Santiment The traders look to have an active interest in Bitcoin at the moment, but their collective opinion isn&#8217;t favoring any one side. In situations like these, it&#8217;s generally hard to say which way the cryptocurrency might go in next. Related Reading: Bitcoin Exchange Supply Only Slips Further Despite Price Decline If this indecisiveness in the market stays in the coming days, though, it&#8217;s likely that BTC&#8217;s stagnation will continue further, as moves in either direction (if any) may not be able to go on for long. Featured image from iStock.com, charts from TradingView.com, Alternative.me, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-27T13:56:11.000Z",
    "title": "EOS Network Foundation Takes Legal Action Against Block.one Over Alleged $1 Billion Investment Commitment Failure",
    "url": "https://www.crypto-news-flash.com/eos-network-foundation-takes-legal-action-against-block-one-over-alleged-1-billion-investment-commitment-failure/?utm_source=rss&utm_medium=rss&utm_campaign=eos-network-foundation-takes-legal-action-against-block-one-over-alleged-1-billion-investment-commitment-failure",
    "description": "<img width=\"2560\" height=\"1828\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/gavel-7499911-2-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/gavel-7499911-2-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/gavel-7499911-2-300x214.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/gavel-7499911-2-1024x731.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/gavel-7499911-2-768x549.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/gavel-7499911-2-1536x1097.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/gavel-7499911-2-2048x1463.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/gavel-7499911-2-269x192.jpg 269w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />EOS decides to take legal action against Block.one for failing to honor its promise of a $1 billion Investment into the ecosystem. The EOS CEO in a letter in May 2023 also mentioned that they could embark on a hard fork to exclude B1-owned tokens. The EOS Network Foundation (ENF) is set to sue the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-27T13:40:42.000Z",
    "title": "Earn and Burn Token ElmoERC Launches With First Person Shooter Game",
    "url": "https://www.crypto-news-flash.com/earn-and-burn-token-elmoerc-launches-with-first-person-shooter-game/?utm_source=rss&utm_medium=rss&utm_campaign=earn-and-burn-token-elmoerc-launches-with-first-person-shooter-game",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/banner_1690456534yTnoirQ0H1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/banner_1690456534yTnoirQ0H1.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/banner_1690456534yTnoirQ0H1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/banner_1690456534yTnoirQ0H1-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/banner_1690456534yTnoirQ0H1-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Warsaw, Poland, July 27th, 2023, Chainwire New blockchain project ElmoERC has launched with the goal of combining the fun of memes with practical utility and a rapid deflationary mechanism. An Ethereum-based token, ElmoERC aims to create a vibrant ecosystem for its community through various innovative features. ElmoERC embodies meme culture and incorporates two essential elements [...]"
  }
]