[
  {
    "source": "Cointelegraph",
    "date": "2023-08-07T15:57:30.000Z",
    "title": "CoinsPaid claims North Korean hacking group used fake job interview to steal $37M",
    "url": "https://cointelegraph.com/news/coinspaid-claims-north-korean-hacking-group-fake-job-interview-theft",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/6ea0e333-8add-4341-aaf4-75b319000c41.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Hackers attempted to infiltrate CoinsPaid infrastructure directly starting in March 2023, but switched their approach to targeting individuals through fake high-salary job offers.</p>\n                    <p><p>Estonia-based cryptocurrency payments firm CoinsPaid suspects North Korean hackers with the Lazarus Group gained access to its systems through fake recruiters targeting employees.</p><p>In an Aug. 7 blog post, CoinsPaid <a href=\"https://coinspaid.com/tpost/k4r6jt90p1-the-coinspaid-hack-explained\" target=\"_blank\" rel=\"noopener nofollow\">said</a> an exploit which allowed hackers to steal more than $37 million on July 22 was the result of tricking one employee into downloading software during a fake job interview, having them believe they were completing a technical task. The firm reported that the worker responded to a job offer put out by hackers and downloaded the malicious code, allowing the bad actors to steal information and give them access to CoinsPaid’s infrastructure.</p><p>“Having gained access to the CoinsPaid infrastructure, the attackers took advantage of a vulnerability in the cluster and opened a backdoor,” said CoinsPaid. “The knowledge perpetrators gained at the exploration stage enabled them to reproduce legitimate requests for interaction interfaces with the blockchain and withdraw the company's funds from our operational storage vault.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We Know Exactly How Attackers Stole and Laundered $37M USD<br><br>CoinsPaid invited a partnership with <a href=\"https://twitter.com/MatchSystems?ref_src=twsrc%5Etfw\">@MatchSystems</a>, in cooperation with law enforcement agencies and regulators, accompanies the process of returning stolen <a href=\"https://twitter.com/hashtag/crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#crypto</a> assets. <br><br>Read more: <a href=\"https://t.co/jLF3ICo603\">https://t.co/jLF3ICo603</a> <a href=\"https://t.co/0gDy9CJcS7\">pic.twitter.com/0gDy9CJcS7</a></p>&mdash; CoinsPaid (@coinspaid) <a href=\"https://twitter.com/coinspaid/status/1688550841165455360?ref_src=twsrc%5Etfw\">August 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/curve-hack-mev-bot-behind-61m-heist-begins-returning-funds\"><strong><em>Curve hacker behind $61M heist begins returning funds</em></strong></a></p><p>In its July 26 post-mortem report of the hack, CoinsPaid <a href=\"https://cointelegraph.com/news/coinpaid-crypto-payments-suspect-lazarus-group-behind-hack\">said it suspected</a> Lazarus Group. Prior to the $37-million exploit, the hackers had made several attempts to infiltrate the platform starting in March 2023, but switched their approach to “highly sophisticated and vigorous social engineering techniques” after multiple failures — targeting individual workers rather than the company itself.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2625907d-db5d-4441-869a-a560670787f7.png\"  /><figcaption style=\"text-align: center;\"><em>Tracing the funds stolen from CoinsPaid on July 22. Source: <a href=\"https://coinspaid.com/tpost/k4r6jt90p1-the-coinspaid-hack-explained\" target=\"_blank\" rel=\"noopener nofollow\">CoinsPaid</a></em></figcaption></figure><p>CoinsPaid said it had partnered with blockchain security company Match Systems to track the stolen funds, the majority of which were transferred to SwftSwap. According to the firm, many aspects of the hackers’ transactions mirrored those of the Lazarus Group, as in the <a href=\"https://cointelegraph.com/news/atomic-wallet-hacker-sends-crypto-mixer-elliptic\">$35-million hack</a> of Atomic Wallet in June. The company was continuing to monitor any movement of the funds as of Aug. 7. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethics-101-crypto-projects-negotiate-hackers/\"><strong><em>Should crypto projects ever negotiate with hackers? Probably</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-07T15:42:06.000Z",
    "title": "Can Curve Finance Catch Its Hacker? $1.85M Bounty Now For Public Assistance",
    "url": "https://cryptobriefing.com/can-curve-finance-catch-its-hacker/?utm_source=feed&utm_medium=rss",
    "description": "Curve Finance has issued a substantial public bounty, as the community responds and the platform seeks a path to recovery."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-07T15:56:14.000Z",
    "title": "UK NCA Opens Roles for Crypto Investigators",
    "url": "https://cryptodaily.co.uk/2023/08/uk-nca-opens-roles-for-crypto-investigators",
    "description": "<p>The UK&rsquo;s National Crime Agency (NCA) began advertising roles to expand its cryptocurrency investigation team. </p>\n<p>The UK&rsquo;s National Crime Agency (NCA) is actively recruiting for senior roles to carry out cryptocurrency investigations.</p>\n<p>The NCA seeks to expand its task force on digital asset investigations and has posted four job opportunities on its website. The NCA appoints four senior investigators to join its Complex Financial Crime Team (CFTC) to assist with digital asset-related crimes.</p>\n<p>The CFTC &ldquo;conducts high-end proactive illicit finance investigations,&rdquo; and the newly advertised roles fall under the scope of its newly formed Digital Assets Team (DAT). The DAT will ensure &ldquo;complex investigations into Blockchain-enabled crime are fully in compliance with the Criminal Procedure and Investigations Act 1996 (CPIA).&rdquo;</p>\n<p>According to the NCA website,</p>\n\n<p>&ldquo;It involves enquiries into criminal activity within virtual arenas, high end of high harm cryptocurrency and virtual assets fraud and money laundering offences carried out by significant organised crime groups and state actors.&rdquo;</p>\n\n<p>The positions require individuals to work alongside and collaborate with CPS, investigators, intelligence and analysis staff to ensure disclosure requirements are accordingly dealt with.</p>\nUK Sets Up Investigative Unit to Deal With Illicit Crypto-Related Activities\n<p>Along with the need for a more comprehensive need for crypto regulation, so too does the market exist for teams and agencies to investigate crypto-related activities. The UK&rsquo;s NCA established its digital asset team earlier this year due to the massive investor losses incurred by numerous scandals that shook the industry.</p>\n<p>The country&rsquo;s Financial Conduct Authority (FCA) undertook a mission to shut down all illicit crypto ATM sites and successfully put an end to 26 locations in July.</p>\n<p>The UK has also made strides in crypto regulation. The UK Parliament passed a bill last month that could help authorities seize and freeze cryptocurrencies that have been used in criminal activities.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-07T15:45:34.000Z",
    "title": "Biggest Movers: BCH 5% Higher on Monday, XLM Avoids Drop Below Support",
    "url": "https://news.bitcoin.com/biggest-movers-bch-5-higher-on-monday-xlm-avoids-drop-below-support/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2228869675-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers:  BCH 5% Higher on Monday, Whilst XLM Avoid Drop Below Support\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2228869675-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2228869675-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2228869675-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2228869675-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2228869675-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2228869675-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2228869675-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin Cash was one of Monday&#x2019;s biggest movers, rising by as much as 5%, despite markets mostly consolidating to start the week. The global crypto market cap has been largely unchanged, with volatility mostly muted. Stellar also rose higher, avoiding a drop below a key support point. Bitcoin Cash (BCH) Bitcoin cash (BCH) rose by [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T16:04:11.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-07T16:06:26.000Z",
    "title": "Tether market cap rising, InQubeta presale raises over $2 million",
    "url": "https://crypto.news/tether-market-cap-rising-inqubeta-presale-raises-over-2-million/",
    "description": "This article dives into InQubeta and Tether, examining their trajectories and how they can shape the crypto landscape"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-07T15:48:28.000Z",
    "title": "PayPal ventures into stablecoins with launch of PYUSD",
    "url": "https://crypto.news/paypal-ventures-into-stablecoins-with-launch-of-pyusd/",
    "description": "PayPal has introduced its stablecoin, PayPal USD (PYUSD), marking its latest foray into digital currency. A global payment platform PayPal launched its own stablecoin on August 7, PayPal USD (PYUSD), making it the first large financial company to do so.&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-07T16:00:39.000Z",
    "title": "Ripple Is Now A Member Of Trade Organization That Hosts The Likes Of BlackRock",
    "url": "https://www.newsbtc.com/ripple-2/ripple-now-a-member-of-isda/",
    "description": "In a significant development, Ripple joined the International Swaps and Derivatives Association (ISDA), placing itself at the forefront of the derivatives market valued at a staggering $1.2 quadrillion.  This move aligns Ripple with prominent industry leaders such as J.P. Morgan, Goldman Sachs, and BNY Mellon, solidifying its position within traditional financial systems. This particular membership category caters to technological solution providers and exchanges integral to the derivatives ecosystem and Ripple now stands equal with big players and elite groups in the high cadre of the crypto community. This move is a declaration of its ambitions and a sign of potential growth.  Ripple’s Entry Into The Prestigious Circle The approval of Ripple’s entry into the ISDA marks a noteworthy achievement. The association, comprising more than 1,000 institutions spanning 79 countries, sets the benchmarks and guidelines for the global derivatives market.  Related Reading: XRP Whales Trigger Price Decline With Large Selling A famous X ( formerly known as Twitter) user and a Ripple advocate JackTheRippler shared the news in a recent tweet which triggered excitement from many users. BOOOOOOOOOOOOOOOOOOOM!!!!@Ripple has joined ISDA. It&#8217;s the DERIVATIVES market (1.2 Quadrillion) #XRP • BlockRock • Société Générale et al • directors J.P. Morgan • CME Group • Citi • Goldman Sachs • BNY Mellon • London Stock Exchange • BofA 1000+ Institutions are… pic.twitter.com/6yzSxfzhe4 — JackTheRippler ©️ (@RippleXrpie) August 5, 2023 By joining this distinguished league, Ripple underlines its commitment to bridging the gap between the realm of cryptocurrency and the world of traditional finance. This development comes after Ripple launched its own Central Bank Digital Currency (CBDC) platform to enable governments to create their own digital currencies. The firm is also looking to enter the real-world assets (RWAs) sector as it believes the tokenized assets market could rise as high as a $30 trillion market cap. XRP price holds $0.61 &#124; Source: XRPUSD on Tradingview.com Impact On Ripple And Beyond: A Ripple Effect With the recent legal clarity surrounding XRP due to a favorable ruling, Ripple&#8217;s engagement with the ISDA presents opportunities for deeper collaboration and the wider acceptance of cryptocurrencies within the traditional financial realm.  The cryptocurrency community is buzzing with enthusiasm over Ripple&#8217;s new affiliation. This calculated maneuver signifies Ripple’s intent to firmly establish its presence in the financial landscape, enabling strategic alliances with major financial institutions and unlocking opportunities for the XRP cryptocurrency. Related Reading: Crypto Funds Vs Bitcoin Holders: Who Was The Better Performer In H1 2023 Although the immediate impact on Ripple&#8217;s valuation remains uncertain, this strategic collaboration sets the stage for prospective growth. Ripple’s inclusion among well-established institutions widens doors for increased acceptance and adoption of cryptocurrencies within conventional financial systems.  Despite the latest development, XRP’s price has not responded positively. Rather, the altcoin continues to see losses on both the daily and weekly charts. It is currently trading at $0.61, translating to 2.11% and 12.01% losses on the daily and weekly charts, respectively. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-07T16:00:17.000Z",
    "title": "Monero (XMR) loses ground, DigiToads (TOADS) charts path to 2023’s crypto top 10",
    "url": "https://www.crypto-news-flash.com/monero-xmr-loses-ground-digitoads-toads-charts-path-to-2023s-crypto-top-10/?utm_source=rss&utm_medium=rss&utm_campaign=monero-xmr-loses-ground-digitoads-toads-charts-path-to-2023s-crypto-top-10",
    "description": "<img width=\"512\" height=\"340\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T095131.845.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T095131.845.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T095131.845-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T095131.845-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Monero is one of the most unique cryptocurrencies in the market. However, its singular rallying point of privacy has also presented challenges to growth. DigiToads is a unique alternative project seeking to provide more options to users upon launch. Such dynamism is at the heart of crypto innovation. This industry has as many ideas as [...]"
  }
]