[
  {
    "source": "Decrypt",
    "date": "2023-09-08T17:28:46.000Z",
    "title": "RIP TCG: How Deadfellaz Is Rethinking Card-Battler Games",
    "url": "https://decrypt.co/155545/rip-tcg-how-deadfellaz-rethinking-card-battler-games",
    "description": "Deadfellaz founders Psych and Betty share how the digital trading card game will help grow the lore of the zombie-themed Ethereum NFT brand."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-08T17:20:14.000Z",
    "title": "10 years later, still no Bitcoin ETF — but who cares?",
    "url": "https://cointelegraph.com/news/10-years-later-no-bitcoin-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/e5643541-26d3-4c73-a725-1f10e536394a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Securities and Exchange Commission will inevitably approve a spot Bitcoin ETF, but we should retain some healthy skepticism about the risks it will create.</p>\n                    <p><p>The first spot Bitcoin exchange-traded fund (ETF) application, filed in July 2013, was denied in both <a href=\"https://cointelegraph.com/news/sec-and-cftc-take-opposing-views-on-whether-bitcoin-is-ready-for-mainstream-investors\">2017</a> and <a href=\"https://cointelegraph.com/news/cnbc-winklevoss-twins-bitcoin-etf-application-rejected-by-sec\">2018</a>. A decade has passed since that initial application, and the Securities and Exchange Commission has rejected more than a dozen additional applications and repeatedly punted the date for deciding on others.</p><p>The ETF saga’s latest iteration saw Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) jump more than 6% as industry advocates celebrated a court ruling that affirmed what we already knew — that the SEC’s rejection of Grayscale’s ETF application was “arbitrary and capricious.” This was, of course, followed by the SEC delaying its decision on all seven pending Bitcoin ETFs, and a subsequent price drop.</p><p>Now we wait as the SEC deliberates on its next move and Grayscale <a href=\"https://cointelegraph.com/news/grayscale-asks-sec-meet-for-bitcoin-etf-conversion\">pleads for approval</a>.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-etfs-even-worse-for-crypto-than-central-exchanges\"><strong><em>Bitcoin ETFs: Even worse for crypto than central exchanges</em></strong></a></p><p>To a degree, the case for a Bitcoin ETF makes sense in the spirit of adoption. The $7 trillion ETF industry is ripe with investors still on the crypto sidelines, awaiting a product that would grant them Bitcoin exposure without having to buy BTC directly and set up a wallet. Plus, as a community that’s fought long and hard to have digital assets taken seriously, the crypto world is inclined to welcome the validation that a United States spot ETF would signal.</p><p>But crypto, Bitcoin especially, is predicated on the need for an alternative financial system — one that enables the financial sovereignty, transparency and consensus that traditional finance (TradFi) so glaringly lacks. The crypto industry’s eagerness for an SEC ETF approval feels like a step backward, akin to American revolutionaries begging Parliament to intermediate colonial tax collection after rejecting its imperial rule.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/search?q=%24BITO&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BITO</a> has underperformed <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> by 28% YTD. This is why we need a Spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ETF. <a href=\"https://t.co/WOtnnDgJDO\">pic.twitter.com/WOtnnDgJDO</a></p>&mdash; Michael Saylor⚡️ (@saylor) <a href=\"https://twitter.com/saylor/status/1699808826550112607?ref_src=twsrc%5Etfw\">September 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Mainstream adoption is a ubiquitous goal among crypto champions, and an SEC sign-off on a BTC vehicle that resonates with TradFi is ostensibly a fast track to it. But fighting for approval from an opaque centralized agency for an intermediated investment product belies our industry’s purpose. And frankly, it’s unnecessary.</p><p>The irony of cautious investors waiting to buy Bitcoin ETF shares rather than taking the safer route of buying BTC directly is palpable. ETFs bear many layers of counterparty risk, including the sponsor, custodian and other partners. We saw how catastrophic this type of risk can be in crypto during the latest contagion, when customers lost more than $10 billion within months because they trusted third parties. Though the contagion appears to have dwindled, the major takeaway remains: If you don’t have the private keys to your Bitcoin, your assets aren’t in your control, and they may not even exist.</p><p>Those of us who witnessed the fallout up close know this. But investors who’ve been waiting on the sidelines for an ETF likely do not. It’s our job as industry builders and veterans to help newcomers understand the new degree of security and risk aversion that Bitcoin’s technology enables.</p><p>The downside of a spot Bitcoin ETF runs deeper than the conceptual contradiction and the unknowing purchases of a riskier investment. The potential cost for the crypto movement is immense.</p><p>Take, for example, BlackRock’s iShares Bitcoin Trust, the announcement of which drove Bitcoin’s price to a one-year high in June. However, perhaps blinded by the prospect of monumental institutional inflows, much of the Bitcoin community, myself included, has thrown its support behind BlackRock’s iteration of TradFi 2.0, haphazardly disguised as Bitcoin conviction.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/etf-revolution-bitcoin-cryptocurrencies\"><strong><em>An ETF will bring a revolution for Bitcoin and other cryptocurrencies</em></strong></a></p><p>Buried within BlackRock’s submission is a clause on hard forks. It <a href=\"https://www.sec.gov/Archives/edgar/data/1980994/000143774923017574/bit20230608_s1.htm\" target=\"_blank\" rel=\"noopener nofollow\">states</a>:</p><blockquote>The Sponsor will […] use its discretion to determine which network should be considered the appropriate network for the Trust’s purposes, and in doing so may adversely affect the value of the Shares. [...] There is no guarantee that the Sponsor will choose the digital asset that is ultimately the most valuable fork. […] The Sponsor may also disagree with Shareholders, the Bitcoin Custodian, other service providers, the Index Administrator, cryptocurrency exchanges, or other market participants on what is generally accepted as Bitcoin and should therefore be considered ‘bitcoin’ for the Trust’s purposes, which may also adversely affect the value of the Shares as a result.</blockquote><p>That clause basically introduces ambiguity around the consensus mechanism for a protocol that already has a very well-defined and battle-tested mechanism.</p><p>On a broader level, BlackRock will undoubtedly amass an enormous Bitcoin supply, while its iShares ETF may be subject to opacity and possible rehypothecation. This puts shareholders at risk of having only a paper claim to Bitcoin that’s been lent out, instead of the asset itself. It’s one thing to have accepted this scenario pre-Bitcoin, but it’s deeply unsettling to imagine this becoming the norm in a world where we have the opportunity to own Bitcoin on a transparent and immutable ledger.</p><p>As the coexistence of <a href=\"https://cointelegraph.com/defi-101/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance</a> and TradFi becomes more of a reality, it is inevitable that the SEC will, at some point, approve a spot Bitcoin ETF. While this isn’t innately bad, it’s critical for the Bitcoin community to remain cognizant and committed to the reasons we’re building a new financial system.</p><p>We can and should embrace legacy institutions’ adoption of Bitcoin and the undoubted intertwining of traditional investment vehicles and Bitcoin. But we also need to remain vigilant about the implications of developments like spot ETFs, help market newcomers understand the novelty of Bitcoin’s technology, and keep moving forward.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Joseph Kelly </strong>is the CEO of Unchained, a Bitcoin financial services company he co-founded in 2016. He’s a graduate of the Texas McCombs School of Business.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-08T17:30:13.000Z",
    "title": "Ripple Acquires Crypto Financial Services Company Fortress Trust ",
    "url": "https://news.bitcoin.com/ripple-acquires-crypto-financial-services-company-fortress-trust/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/xrp-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/xrp-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/xrp-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/xrp-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/xrp-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/xrp-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/xrp-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/xrp.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Ripple, a leading blockchain and cryptocurrency company, has acquired Fortress Trust, a Nevada-licensed financial services provider for the crypto industry. The purchase expands Ripple&#8217;s regulatory licenses and infrastructure to bolster its position in enterprise blockchain solutions. Ripple Acquires Fortress Trust The acquisition provides Ripple with Fortress Trust&#8217;s financial, regulatory, and technological infrastructure to serve the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T17:35:00.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T17:29:44.000Z",
    "title": "Cameron Winklevoss ignites crypto regulatory firestorm on DCG",
    "url": "https://www.cryptopolitan.com/winklevoss-crypto-regulatory-firestorm-dcg/",
    "description": "A formidable storm is brewing in the cryptocurrency sector. At the eye of this storm stands Cameron Winklevoss, co-founder of the crypto firm Gemini Trust Co, and his allegations against the Digital Currency Group (DCG) and its trailblazing founder, Barry Silbert. The accusations? Misrepresentation of the financial state of DCG’s lending subsidiary, Genesis, which declared ... <a title=\"Cameron Winklevoss ignites crypto regulatory firestorm on DCG\" class=\"read-more\" href=\"https://www.cryptopolitan.com/winklevoss-crypto-regulatory-firestorm-dcg/\" aria-label=\"More on Cameron Winklevoss ignites crypto regulatory firestorm on DCG\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T17:28:24.000Z",
    "title": "Here’s the crypto market as the weekend effect kicks in – BTC above $26K",
    "url": "https://www.cryptopolitan.com/the-crypto-market-as-weekend-effect-kicks-in/",
    "description": "As the weekend approaches, the crypto market is showing a remarkable uptick, exemplified by Bitcoin (BTC) surging close to the $26,000 mark. Traditionally, the weekend has been a time when trading volumes are lower, but volatility can spike, creating lucrative opportunities for both retail and institutional investors.&#160; This phenomenon, widely known as the &#8220;weekend effect,&#8221; ... <a title=\"Here’s the crypto market as the weekend effect kicks in &#8211; BTC above $26K\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-crypto-market-as-weekend-effect-kicks-in/\" aria-label=\"More on Here’s the crypto market as the weekend effect kicks in &#8211; BTC above $26K\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T17:17:16.000Z",
    "title": "The reason Apple lost $200 billion in less than two days",
    "url": "https://www.cryptopolitan.com/reason-apple-lost-200b-in-less-than-two-days/",
    "description": "Apple, the tech titan revered for its groundbreaking products, recently felt the heat from investor apprehensions. With a jaw-dropping dip of $200 billion in market value in a mere two-day span, one has to wonder what threw a wrench into Apple&#8217;s usually smooth operations. Unveiling the core reasons behind this nosedive reveals an intricate interplay ... <a title=\"The reason Apple lost $200 billion in less than two days\" class=\"read-more\" href=\"https://www.cryptopolitan.com/reason-apple-lost-200b-in-less-than-two-days/\" aria-label=\"More on The reason Apple lost $200 billion in less than two days\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T17:11:40.000Z",
    "title": "JPMorgan has big plans for its JPM token – Details",
    "url": "https://www.cryptopolitan.com/jpmorgan-has-big-plans-for-its-jpm-token/",
    "description": "JPMorgan Chase &#38; Co., the behemoth of the U.S. banking industry, isn&#8217;t content resting on its laurels. The financial giant is on the brink of delving deeper into the world of blockchain technology. The bank is reportedly examining the possibility of introducing a blockchain-anchored digital deposit token. This move is aimed at accelerating the speed ... <a title=\"JPMorgan has big plans for its JPM token &#8211; Details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/jpmorgan-has-big-plans-for-its-jpm-token/\" aria-label=\"More on JPMorgan has big plans for its JPM token &#8211; Details\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-08T17:22:00.000Z",
    "title": "Leaked WhatsApp Chats Show Celsius Gambled $8M Weekly to Sustain CEL",
    "url": "https://coinedition.com/leaked-whatsapp-chats-show-celsius-gambled-8m-weekly-to-sustain-cel/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Celsius-Why-a-30-Price-surge.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Leaked WhatsApp Chats Show Celsius Gambled $8M Weekly to Sustain CEL\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Celsius-Why-a-30-Price-surge.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Celsius-Why-a-30-Price-surge-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Celsius-Why-a-30-Price-surge-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Celsius-Why-a-30-Price-surge-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Celsius-Why-a-30-Price-surge-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to reports, the founders spent over $8 million weekly to sustain CEL&#8217;s value. WhatsApp messages expose Celsius Network founders artificially inflating CEL token price. There are also allegations of them manipulating user holdings to boost CEL token holders count. In a recent revelation, Keith, a volunteer analyst assisting Celsius creditors in deciphering the intricacies [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/leaked-whatsapp-chats-show-celsius-gambled-8m-weekly-to-sustain-cel/\">Leaked WhatsApp Chats Show Celsius Gambled $8M Weekly to Sustain CEL</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]