[
  {
    "source": "Cointelegraph",
    "date": "2024-03-19T15:50:29.000Z",
    "title": " FTX victims describe ‘irreparable harm’ ahead of Sam Bankman-Fried’s sentencing ",
    "url": "https://cointelegraph.com/news/ftx-victims-sam-bankman-fried-sentencing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMTcwOGYyMzYtNTVjZi00OGQ5LTllNTktODc5ZGE3MjZlYWNhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Judge Lewis Kaplan could potentially sentence the former FTX CEO to decades in prison on March 28 following his November 2023 conviction.</p>\n                    <p><p>Victims of defunct cryptocurrency exchange FTX have issued statements ahead of <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam “SBF” Bankman-Fried’s</a> sentencing hearing, describing the emotional and financial impact of the former CEO’s actions and the collapse of the firm. </p><p>In March 18 filings in United States District Court for the Southern District of New York, prosecutors <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590940/gov.uscourts.nysd.590940.411.1.pdf\" target=\"_blank\" rel=\"noopener nofollow\">released</a> several victim impact statements regarding Bankman-Fried and former FTX and Alameda executives Gary Wang, Caroline Ellison, Nishad Singh and Ryan Salame. With the exception of a representative for BlockFi users, many of the statements had personal information redacted as part of efforts by prosecutors to protect victims’ privacy.</p><p>“[W]e entrusted FTX with our hard-earned savings, believing in the integrity of the platform and the digital assets it facilitated,” <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590940/gov.uscourts.nysd.590940.411.3.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a> one unidentified victim. “However, the abrupt downfall of FTX has not only resulted in a substantial financial loss of over $19,000 at current prices but has also shaken the very foundation of our trust in the digital asset space.”</p><p><a href=\"https://cointelegraph.com/news/ftx-victims-sam-bankman-fried-sentencing\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-19T15:43:36.000Z",
    "title": " Solana memecoin Slerfsol recovers after $10M token burn fiasco ",
    "url": "https://cointelegraph.com/news/solana-memecoin-slerfsol-recovers-after-10m-token-burn-fiasco",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNDcwOTZhYWUtZmI5OC00NzY0LWEzNzgtZjAwZGY1ODA5YWM4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The memecoin has surpassed a market cap of $500 million despite an embarrassing launch. </p>\n                    <p><p>Thanks to community support, Solana memecoin Slerfsol (SLERF) has seen a fairly successful launch after its creator mistakenly burned over $10 million worth of Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) from investors during the March 18 presale.</p><p>At the time of publication, SLERF is worth $0.79 with a total market cap of $505 million and listing on multiple exchanges. The day prior, its namesake creator <a href=\"https://cointelegraph.com/news/solana-memecoin-frenzy-parallels-ethereum-ico\">had asked for donations</a> after a blunder that saw 535,000 of investors’ SOL sent to a burn address during the minting of SLERF. The creator has publicly asked for donations to make users whole, with the coin's wallet address <a href=\"https://explorer.solana.com/address/fCuw5ppJ9aZYzjm8EsT2fHwxV1h5JwUfqXM44iX3Pzb\" target=\"_blank\" rel=\"noopener nofollow\">receiving</a> 3,000 SOL. </p><p>The same day, cryptocurrency exchange BingX <a href=\"https://twitter.com/BingXOfficial/status/1769963880758010188\" target=\"_blank\" rel=\"noopener nofollow\">reached out</a> to Slerf on X with an offer to donate all trading fees from buying and selling SLERF on its platform to the project itself. BingX also said it would “airdrop future BingX World Debut tokens to addresses that participated in the Slerf private sale but didn't receive $SLERF tokens.\" In response, Slerf wrote: “Thank you so much [BingX]. I'm shaking. This is so crazy. You guys are amazing.”</p><p><a href=\"https://cointelegraph.com/news/solana-memecoin-slerfsol-recovers-after-10m-token-burn-fiasco\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-19T16:00:34.000Z",
    "title": "Polkadot’s Web3 gaming ecosystem expands with launch of ‘Forever Has Fallen’",
    "url": "https://cryptobriefing.com/forever-has-fallen-game/",
    "description": "New Web3 game 'Forever Has Fallen' launches on Polkadot with an interactive metaverse and unique NFT ticketing system."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T16:08:47.000Z",
    "title": "An In-Depth Analysis of What Faucet Casinos Are, How They Work, and the Pros and Cons",
    "url": "https://cryptodaily.co.uk/2024/03/an-in-depth-analysis-of-what-faucet-casinos-are",
    "description": "Faucet casinos are a novel and interesting development in online gambling."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T16:07:50.000Z",
    "title": "Streamr Network 1.0 Mainnet Launches, Fulfilling the 2017 Roadmap's Vision of Decentralized Data Broadcasting",
    "url": "https://cryptodaily.co.uk/2024/03/streamr-network-10-mainnet-launches-fulfilling-the-2017-roadmaps-vision-of-decentralized-data-broadcasting",
    "description": "Streamr Network 1.0 Mainnet Launches, Fulfilling the 2017 Roadmap's Vision of Decentralized Data Broadcasting"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T16:02:01.000Z",
    "title": "Investing in the Future: DeeStream (DST) Attracts Chainlink (LINK) & Stellar (XLM) Investors with Cutting Edge Streaming Tech",
    "url": "https://cryptodaily.co.uk/2024/03/investing-in-the-future-deestream-dst-attracts-chainlink-link-stellar-xlm-investors-with-cutting-edge-streaming-tech",
    "description": "A broader interest in the blockchain has resulted in multiple industries looking to adopt the technology. These industries are looking to explore the potential of blockchain technology to transform their business and provide cutting-edge services and tools that cater to the needs of the public. As the interest grows, investors are also looking to invest early to reap the market's benefits."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T15:57:30.000Z",
    "title": "Ethereum Classic (ETC) & Ripple (XRP) Investors Discover DeeStream’s (DST) Streaming Potential Amidst Crypto Fluctuations",
    "url": "https://cryptodaily.co.uk/2024/03/ethereum-classic-etc-ripple-xrp-investors-discover-deestreams-dst-streaming-potential-amidst-crypto-fluctuations",
    "description": "After a month of consistent surges, the cryptocurrency market seems to be experiencing frequent fluctuations. Holders of cryptocurrencies like Ethereum Classic (ETC) and Ripple (XRP) may be displeased by this new development, but they are also satisfied with profits from the bull market."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T15:53:09.000Z",
    "title": "Crypto Market Analysis: Bubble Bursting or Bullish Rally?",
    "url": "https://cryptodaily.co.uk/2024/03/crypto-market-analysis-bubble-bursting-or-bullish-rally",
    "description": "Bitcoin, the reigning king of cryptocurrencies, experienced a whirlwind ride recently, hitting a high of $69,170.63 on March 5, only to plummet to $59,000 within a mere 5 hours."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T15:46:45.000Z",
    "title": "Investing with a Twist: Koala Coin (KLC) Captivates Polkadot (DOT) & NEAR Protocol (NEAR) Holders with Its Novel Approach",
    "url": "https://cryptodaily.co.uk/2024/03/investing-with-a-twist-koala-coin-klc-captivates-polkadot-dot-near-protocol-near-holders-with-its-novel-approach",
    "description": "Money never sleeps and digital currencies are at the forefront of this perpetual motion machine of global financial markets. Into this world steps Koala Coin (KLC): a groundbreaking initiative blending the worlds of memes and monetary investment."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T16:08:41.000Z",
    "title": "Streamr Network 1.0 Mainnet Launches, Fulfilling the 2017 Roadmap’s Vision of Decentralized Data Broadcasting",
    "url": "https://www.cryptopolitan.com/streamr-network-1-0-mainnet-launches-fulfilling-the-2017-roadmaps-vision-of-decentralized-data-broadcasting/",
    "description": "Zug, Switzerland, March 19th, 2024, Chainwire Streamr has announced the launch of the Streamr Network 1.0 mainnet, a landmark milestone that signifies the completion of the original 2017 roadmap. 1.0 introduces the full deployment of the $DATA token incentive layer, transforming the network into a feature-complete, fully decentralized protocol run and operated by its users.  [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T16:00:00.000Z",
    "title": "EigenLayer Prepares For Mainnet Launch; Ethereum (ETH) and FLOKI (FLOKI) Near ATHs – Investors Eye NuggetRush (NUGX) Presale For Massive Gains",
    "url": "https://www.cryptopolitan.com/eigenlayer-prepares-for-mainnet-launch-ethereum-eth-and-floki-floki-near-aths-investors-eye-nuggetrush-nugx-presale-for-massive-gains/",
    "description": "TLDR The crypto scene is buzzing with excitement, from EigenLayer’s impending mainnet launch to Ethereum (ETH) and FLOKI (FLOKI) inching closer to their ATHs. Adding to this excitement is NuggetRush (NUGX), an upcoming P2E memecoin. This emerging crypto is fast becoming a favorite among investors, who are doubling down on massive gains. With its market [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T15:55:08.000Z",
    "title": "Inflation is still very much a global challenge",
    "url": "https://www.cryptopolitan.com/inflation-still-very-much-a-global-challenge/",
    "description": "I&#8217;m gonna be real with you, guys. The ghost of inflation is still haunting us all, and it&#8217;s not about to go ghost anytime soon. Despite the world&#8217;s financial brainiacs going to town with strategies and predictions of a gentle economic touchdown—a so-called &#8220;soft landing&#8221;—the reality is that inflation is stubbornly sticking around, refusing to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T15:47:30.000Z",
    "title": "Is GPT-4 Already Obsolete? Sam Altman Says It “Kind of Sucks”",
    "url": "https://www.cryptopolitan.com/sam-altman-says-gpt-4-kind-of-sucks/",
    "description": "In a recent interview, OpenAI CEO Sam Altman offered a refreshingly candid perspective on the state of generative AI. While acknowledging the significant progress made with GPT-4, Altman said kinda sucks compared to OpenAI&#8217;s vision for the future. “I think it kind of sucks, relative to where we need to get to and where I [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T15:43:39.000Z",
    "title": "Bakkt announces leadership shake-up ahead of financial release",
    "url": "https://www.cryptopolitan.com/bakkt-announces-leadership-shake-up-ahead/",
    "description": "In a move aimed at bolstering its position in the competitive crypto market, Bakkt, a prominent crypto custody service and exchange, revealed a significant leadership transition set to take effect later next week. The company&#8217;s current CEO, Gavin Michael, will step down from his role to pursue other opportunities, with board member Andy Main slated [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-19T16:09:07.000Z",
    "title": "Slerf’s trading volume overpasses $2b on first day of its launch",
    "url": "https://crypto.news/slerf-trading-volume-meme-coin/",
    "description": "The trading volume of the Solana-based meme coin Slerf crossed the $2 billion mark."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-19T15:44:10.000Z",
    "title": "BitMEX investigates suspicious trading that sent Bitcoin to $8.9k",
    "url": "https://crypto.news/bitcoin-bitmex-trading-flash-drop/",
    "description": "Crypto exchange BitMEX is looking into unusual Bitcoin trading patterns on its platform that could involve unfair practices. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-19T16:00:27.000Z",
    "title": "Bitcoin Plunges Under $63,000, Here’s Where Next On-Chain Support Is",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-plunges-64000-on-chain-support/",
    "description": "Bitcoin has deepened its decline in the past day with its price now slipping below $63,000. Here&#8217;s where the next potential support is, according to on-chain data. Bitcoin Could Find Support At These Price Levels In a new post on X, analyst Ali has discussed how the Bitcoin support and resistance levels are looking like right now based on on-chain data from Glassnode. The indicator of relevance here is the &#8220;UTXO Realized Price Distribution&#8221; (URPD), which, in short, tells us about the amount of coins (or more precisely, UTXOs) that were last purchased at any given price level that the asset has visited in its history so far. Related Reading: Bitcoin Has Undergone This Bearish Structure Change, Analyst Explains Below is the chart shared by the analyst that shows the data for this distribution for the price levels around the recent spot value of the cryptocurrency: Looks like the $72,880 mark is the level with the richest amount of coins at the moment &#124; Source: @ali_charts on X From the graph, it&#8217;s visible that there are a few price levels not far from the current one that particularly stands out in terms of the amount of buying that took place at them. In on-chain analysis, the potential for any level to act as support or resistance is based on the total number of coins that have their cost basis at the level in question. Levels thick with coins that are situated under the current price would be probable to act as points of support, while those above the spot value could prove to be resistance walls. As is apparent from the graph, the $61,100, $56,685, and $51,530 levels are the ones below the current price that hold the cost basis of a notable amount of the supply right now. Naturally, this means that should the decline continue further, these would be the levels to watch for a possible rebound. Two levels above, however, are even larger than all three of these support levels: the cost basis centers around $66,990 and $72,880. Interestingly, the latter of these is the single largest acquisition level out of all the price levels listed in the chart, implying that a large amount of FOMO buying has occurred at the asset&#8217;s all-time high levels. In the scenario that Bitcoin regains its upward momentum, these levels of high cost basis population would be where the asset could be most probable to find some trouble. Now, as for why acquisition centers are considered relevant for support and resistance in on-chain analysis is the fact that investors are likely to show some kind of reaction when a retest of their cost basis takes place. Related Reading: Bitcoin Sentiment Cools Off, Price Rebound Soon? When such a retest is from above, the holders may decide to accumulate more, believing that the price will go up again in the future. On the other hand, they may sell instead if the retest is from below, as they may think exiting at break-even is better than risking another drop. A large number of coins having their cost basis at the same level means a potentially large degree of one of these reactions happening and, hence, a strong support or resistance effect on the price. BTC Price Bitcoin is inching closer to the first major on-chain support level as it has now dropped to $62,700. The price of the asset appears to have plummeted over the last few days &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, Glassnode.com, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-19T16:06:01.000Z",
    "title": "Streamr Network 1.0 Mainnet Launches, Fulfilling the 2017 Roadmap’s Vision of Decentralized Data Broadcasting",
    "url": "https://www.crypto-news-flash.com/streamr-network-1-0-mainnet-launches-fulfilling-the-2017-roadmaps-vision-of-decentralized-data-broadcasting/?utm_source=rss&utm_medium=rss&utm_campaign=streamr-network-1-0-mainnet-launches-fulfilling-the-2017-roadmaps-vision-of-decentralized-data-broadcasting",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Zug, Switzerland, March 19th, 2024, Chainwire Streamr has announced the launch of the Streamr Network 1.0 mainnet, a landmark milestone that signifies the completion of the original 2017 roadmap. 1.0 introduces the full deployment of the $DATA token incentive layer, transforming the network into a feature-complete, fully decentralized protocol run and operated by its users.  [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-19T16:08:35.000Z",
    "title": "Streamr Network 1.0 Mainnet Launches, Fulfilling the 2017 Roadmap’s Vision of Decentralized Data Broadcasting",
    "url": "https://coinedition.com/streamr-network-1-0-mainnet-launches-fulfilling-the-2017-roadmaps-vision-of-decentralized-data-broadcasting/",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://coinedition.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55.jpg 1200w, https://coinedition.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-300x180.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-1024x614.jpg 1024w, https://coinedition.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-380x228.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-768x461.jpg 768w, https://coinedition.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-148x89.jpg 148w, https://coinedition.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-742x445.jpg 742w, https://coinedition.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-412x247.jpg 412w, https://coinedition.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-400x240.jpg 400w, https://coinedition.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-275x165.jpg 275w, https://coinedition.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-352x211.jpg 352w, https://coinedition.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-117x70.jpg 117w, https://coinedition.com/wp-content/uploads/2024/03/Hubspot_mainnet_launch_1_1710762586rUqHyRuI55-125x75.jpg 125w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /><p>Zug, Switzerland, March 19th, 2024, Chainwire Streamr has announced the launch of the Streamr Network 1.0 mainnet, a landmark milestone that signifies the completion of the original 2017 roadmap. 1.0 introduces the full deployment of the $DATA token incentive layer, transforming the network into a feature-complete, fully decentralized protocol run and operated by its users.  [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/streamr-network-1-0-mainnet-launches-fulfilling-the-2017-roadmaps-vision-of-decentralized-data-broadcasting/\">Streamr Network 1.0 Mainnet Launches, Fulfilling the 2017 Roadmap&#8217;s Vision of Decentralized Data Broadcasting</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-19T16:01:00.000Z",
    "title": "Crypto Titans Clash: Will AI Tokens Outperform Bitcoin in the Long Run?",
    "url": "https://coinedition.com/crypto-titans-clash-will-ai-tokens-outperform-bitcoin-in-the-long-run/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/03/AI-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/AI-4.jpg 730w, https://coinedition.com/wp-content/uploads/2024/03/AI-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/AI-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/AI-4-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/03/AI-4-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/03/AI-4-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/03/AI-4-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/03/AI-4-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/03/AI-4-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/03/AI-4-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/03/AI-4-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/03/AI-4-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/03/AI-4-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/03/AI-4-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/03/AI-4-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/03/AI-4-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Lately, the crypto market has been experiencing a surge in AI crypto tokens, reminiscent of the ascent of tech stocks like Nvidia. This trend is being driven by investors&#8217; increasing interest in machine-learning applications and the promising integration of AI with blockchain technologies. AI crypto tokens linked to the AI market doubled their value in [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/crypto-titans-clash-will-ai-tokens-outperform-bitcoin-in-the-long-run/\">Crypto Titans Clash: Will AI Tokens Outperform Bitcoin in the Long Run?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-19T16:00:00.000Z",
    "title": "Japanese $1.5T Trillion Asset Manager Now Eyes Bitcoin for Diversification",
    "url": "https://coinedition.com/japanese-1-5t-trillion-asset-manager-now-eyes-bitcoin-for-diversification/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7.jpg 730w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-7-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Japan’s Government Pension Investment Fund (GPIF), the world&#8217;s largest pension fund boasting $1.5 trillion in assets under management, has announced its intention to explore diverse investment avenues, including Bitcoin, gold, forests, and farmland. This development was captured in a recent report by Bloomberg Japan, which revealed the GPIF&#8217;s decision to seek information on expanding its [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/japanese-1-5t-trillion-asset-manager-now-eyes-bitcoin-for-diversification/\">Japanese $1.5T Trillion Asset Manager Now Eyes Bitcoin for Diversification</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-19T15:43:09.000Z",
    "title": "Cardano (ADA) Investors Explore New 100X Opportunity Priced $0.006, Cardano Price Falls Again",
    "url": "https://coinedition.com/cardano-ada-investors-explore-new-100x-opportunity-priced-0-006-cardano-price-falls-again/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again.jpg 730w, https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/03/Cardano-ADA-Investors-Explore-New-100X-Opportunity-Priced-0.006-Cardano-Price-Falls-Again-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In the ever-shifting landscape of cryptocurrency, where fortunes can change with the tide, a new opportunity is making waves, captivating the attention of investors from the established Cardano (ADA) community. As the price of Cardano (ADA) faces yet another downturn, its investors are casting their nets wider, seeking new ventures that promise significant returns. Among [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/cardano-ada-investors-explore-new-100x-opportunity-priced-0-006-cardano-price-falls-again/\">Cardano (ADA) Investors Explore New 100X Opportunity Priced $0.006, Cardano Price Falls Again</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]