[
  {
    "source": "Cointelegraph",
    "date": "2023-07-21T14:23:00.000Z",
    "title": "BlackRock ETF will be 'big rubber yes stamp' for Bitcoin: Interview with Charles Edwards",
    "url": "https://cointelegraph.com/news/blackrock-bitcoin-etf-interview-charles-edwards",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/14b7d9c7-c174-44e8-b78b-07140e620bdd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin's future is overwhelmingly bright, and short-term price pressures should not distract investors from a future global asset class, says the Capriole Investments founder.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) stands to win big thanks to the <a href=\"https://cointelegraph.com/news/sec-accepts-black-rock-bitcoin-etf-application-signaling-regulatory-review\">BlackRock exchange-traded fund</a> (ETF), investor and analyst Charles Edwards believes.</p><p>In his latest interview with Cointelegraph, Edwards, who is founder of quantitative Bitcoin and digital asset fund Capriole Investments, goes deep into the current state of BTC price action.</p><p>With his previous bullish statements continuing to stand the test of time, and after an eventful few months, Edwards does not see the need to alter the long-term perspective.</p><p>Bitcoin, he argues, may be less of a sure bet on shorter timeframes, but the overarching narrative of crypto becoming a recognized global asset class undoubtedly remains.</p><p><strong>Cointelegraph (CT): <a href=\"https://cointelegraph.com/news/bitcoin-2024-halving-will-be-its-most-important-interview-with-charles-edwards\">When we last spoke in February</a>, Bitcoin price was around $25,000. BTC is not only 20% higher today, but Bitcoin’s NVT ratio is also at its highest levels in a decade. Does this suggest more upside?</strong></p><p><strong>Charles Edwards (CE):</strong> NVT is currently trading at a normal level. At 202, it is trading in the middle of the <a href=\"https://capriole.com/bitcoin-valuation-using-dynamic-range-nvt-signal/\" target=\"_blank\" rel=\"noopener nofollow\">dynamic range</a> band, well below the 2021 highs. Given its normalized reading today, it doesn't tell us much; just that Bitcoin is fairly valued according to this metric alone.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/e049cb5f-6bae-461c-986f-cc07de8d6c59.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Dynamic Range NVT Signal, using Blockchain.com data. Source: Capriole Investments/TradingView</em></figcaption></figure><p><strong>CT: At the time, you described Bitcoin as being in a “new regime” but forecast up to 12 months’ upward grind to come. How has your thinking evolved since?</strong></p><p><strong>CE:</strong> That thinking mostly remains today. Bitcoin has steadily grinded up about 30% since February. The difference today is that the relative value opportunity is slightly less as a result, and we are now trading into major price resistance at $32,000, which represents the bottom of the 2021 bull market range and confluence with major weekly and monthly order blocks. </p><p>My outlook today over the short term is mixed, with a bias towards cash until one of three things occurs:</p><ol><li>Price clears $32,000 on daily/weekly timeframes, or</li><li>Price mean-reverts to the mid-$20,000s, or</li><li><a href=\"http://capriole.com/model\" target=\"_blank\" rel=\"noopener nofollow\">On-chain fundamentals</a> return to a regime of growth.</li></ol><p><strong>CT: At $30,000, miners have <a href=\"https://cointelegraph.com/news/bitcoin-miners-selling-btc-as-hedge-bitfinex\">begun to send</a> BTC to exchanges en masse at levels rarely seen. Poolin, in particular, has moved a record amount in recent weeks. To what extent will miners’ purported selling impact price moving forward?</strong></p><p><strong>CE:</strong> It’s true that relative Bitcoin miner sell pressure has stepped up. We can see that in the two below on-chain metrics; Miner Sell Pressure and Hash Ribbons. Bitcoin’s hash rate is up 50% since January — that’s over 100% annualized growth rate. </p><p>This rapid rate of growth is not sustainable long term. Hence we can expect any slowdown will trigger the typical Hash Ribbon capitulation. This rapid growth in hash rate also can only mean one thing; an extraordinary amount of new mining rigs have joined the network. </p><blockquote>It’s 50% harder to mine Bitcoin, there's 50% more competition and as a result 33% less relative BTC revenue for miners.</blockquote><p>Through 2022 there were delays and backlogs in global mining hardware shipping for many months; we likely have seen that backlog flush out in the first half of the year with the large hash rate uptick. New mining hardware is costly, so it makes sense that miners would want to sell a bit more at relatively higher prices today to help cover operational costs and take advantage of the 100% price rally we have seen in the last 7 months. </p><p>Miners are large Bitcoin stakeholders so if they are selling at a rapid rate it can impact prices. Though given their relative share of the network is diminishing, that risk factor is not what it once was.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/06365726-531b-452a-b1bc-36f3466b3d5e.png\"  /><figcaption style=\"text-align: center;\"><em>Two on-chain metrics showing miner stress/selling. Source: Capriole Investments/TradingView</em></figcaption></figure><p><strong>CT: When it comes to U.S. macro policy, how do you see the Fed approaching inflation for the second half of the year? Are further hikes coming past July? </strong></p><p><strong>CE:</strong> The market is pricing in a 91% chance of rate hikes through the rest of this year. There’s a 99.8% chance that the Fed will raise rates at next week's meeting, according to the CME Group <a href=\"https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html\" target=\"_blank\" rel=\"noopener nofollow\">FedWatch Tool</a>. So it's probable we see one or two more rate hikes in 2023. That seems quite excessive given inflation (CPI) has consistently been trending down since April 2022, and is now well below the Fed funds rate of 5%. </p><p>Of course things could change quite a bit over the next months, but if we take two more rate hikes as the base case, my expectation that any net change in the Fed’s plan would be toward a pause. We’ve already seen the considerable stress building in the banking system, with multiple bank collapses just a couple of months ago. 2023 was the biggest banking failure of all time in dollar value; more than 2008, so things could change considerably over the next six months.</p><p>Regardless, the Fed has implemented the vast majority of its rate hike plan. 90% of the tightening is complete. It's now a game of wait and see — will inflation continue to decline as anticipated? And will that occur before or after the economy takes a turn?</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/2da2aa7d-b1fe-4fbb-97dd-0fb83fabafa8.png\"  /><figcaption style=\"text-align: center;\"><em>Fed target rate probabilities chart. Source: CME Group</em></figcaption></figure><p><strong>CT: Bitcoin’s correlation with risk assets and <a href=\"https://cointelegraph.com/news/bitcoin-and-correlations-examining-the-relationship-between-btc-gold-and-the-nasdaq\">inverse correlation</a> with U.S. dollar strength has been declining of late. What’s the reason for this? Is this part of a longer-term trend?</strong></p><p><strong>CE:</strong> Bitcoin has historically spent most of its life “uncorrelated” with risk markets, oscillating from periods of positive to negative correlation. Correlation comes in waves. The last cycle happened to see a very strong correlation with risk assets. This began with the Corona crash on March 12, 2020. When fear peaks, all markets go risk-off (into cash) in unison, and we saw a huge spike in correlations across asset classes as a result. </p><p>Following that crash, a wall of money entered risk markets from the biggest QE of all time. In that regard, the following year was “all one trade” — up and to the right for risk. Then in 2022 we saw the unwinding of all risk assets as bonds repriced following the most aggressive Fed rate hike regime in history.</p><p>So it’s been unusual times. But there is no intrinsic need for Bitcoin to have a high correlation to risk assets. It is likely with time that as Bitcoin becomes a multi-trillion-dollar asset, it will be more interconnected with major asset classes and so expect to see a more consistent positive correlation with gold over the next decade, which has a highly negative correlation with the dollar.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5cc2daf2-46a9-422b-9236-214503c1fdb9.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin’s correlation to the S&amp;P 500 and Gold. Source: Capriole Investments/TradingView</em></figcaption></figure><p><strong>CT: How do you think U.S. regulatory pressure will impact Bitcoin and crypto markets going forward? Do you think Binance and Coinbase were the tip of the iceberg?</strong></p><p><strong>CE:</strong> Impossible to say for sure, but I believe the regulatory fears of early 2023 have been well overblown. Bitcoin was long ago classified as a commodity, and from a regulatory perspective is in the clear. There’s definitely question marks on various altcoins, but the legal outcome of XRP being deemed not a security was definitely an interesting turn of events this month. </p><p>Finally, it's pretty clear that industry and government — where it matters — is in support of this asset class and knows it's here to stay. </p><blockquote>BlackRock ETFs have a 99.8% success rate and its announcement to launch a Bitcoin ETF was essentially a regulatory and financial industry green light. </blockquote><p>We’ve seen half a dozen other leading-tier financial institutions follow suit and, of course, now presidential candidate Kennedy is talking about backing the dollar with Bitcoin. This asset class is here to stay. There will be bumps and hiccups along the way, but the direction is clear to me.</p><p><strong>CT: How do you foresee progress of the BlackRock spot ETF and its effect on Bitcoin should it launch?</strong></p><p><strong>CE:</strong> The BlackRock ETF approval will be huge for the industry. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-traders-get-ready-btc-price-preps-2023-bull-market\">Bitcoin traders say ‘get ready’ as BTC price preps 2023 bull market</a></em></strong></p><p>BlackRock is the biggest asset manager in the world, and its (and regulatory) seal of approval will allow a new wave of capital to flow into the market. Many institutions sat on the sidelines last year due to concerns and uncertainty regarding crypto regulation. ETF approval will be a big rubber “yes” stamp for Bitcoin. </p><p>ETFs also arguably make it easier for institutions to put Bitcoin on their balance sheet, as they don't need to worry about custody or even entering the crypto space. So it opens a lot of doors. The best comparable we have for this event is the gold ETF launch in 2004. Interestingly it launched when gold was down 50% (much like Bitcoin is today). What followed was a massive +350% return, seven-year bull run.</p><p>Essentially the Bitcoin ETF is just another goalpost on the pathway to broad regulatory acceptance and establishment of Bitcoin as a serious asset class. And it has big implications.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/c458cef8-5e1c-4ce8-84bd-142f8c147bc2.png\"  /><figcaption style=\"text-align: center;\"><em>CFDs on Gold annotated chart. Source: Charles Edwards/TradingView</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\">Should you ‘orange pill’ children? The case for Bitcoin kids books</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-21T14:15:56.000Z",
    "title": "Bitcoin miners still bullish despite toughest bear market yet - Hut8, Foundry, Braiins",
    "url": "https://cointelegraph.com/news/bitcoin-miners-bullish-despite-bear-market-hut8-foundry-braiins",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/aefe1e63-88cc-4149-86f6-d3907412e0b6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin mining firms have been forced to sell newly minted Bitcoin to cover operational costs during one of the toughest bear markets for miners on record. </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) miners have been up against the ropes over the past year, with record amounts of BTC sent to centralized exchanges to cover costs in 2023.</p><p>As Cointelegraph previously reported, the <a href=\"https://cointelegraph.com/learn/how-to-mine-bitcoin-a-beginners-guide-to-mine-btc\">Bitcoin mining</a> ecosystem has had an eventful year. The industry <a href=\"https://cointelegraph.com/news/bitcoin-miners-raked-millions-in-fees-q2-amid-ordinals\">scored</a> a staggering $184 million from transaction fees in the second quarter of 2023, eclipsing the total of 2022 on the back of a BTC price rebound and hype around BRC-20 tokens.</p><p>Stocks in prominent <a href=\"https://cointelegraph.com/tags/mining\">mining</a> firms have also <a href=\"https://cointelegraph.com/news/bitcoin-miners-raked-millions-in-fees-q2-amid-ordinals\">seen impressive gains</a> in 2023, far exceeding Bitcoin’s market value performance. The top nine public Bitcoin mining firms saw their market capitalization increase by 257% from the start of 2023.</p><p>Meanwhile miners have also been forced to continue selling mined BTC to cover operational costs as the industry continues to attempt to claw its way out of a prolonged bear market. Miners <a href=\"https://cointelegraph.com/news/bitcoin-miners-send-record-inflows-to-exchanges\">sent a record</a> $128 million worth of Bitcoin to exchange in June 2023, with industry experts highlighting miners' propensity to send BTC to exchange to cash out, cover costs and lock in profits.</p><p><a href=\"https://cointelegraph.com/news/how-irish-farmers-turn-cow-dung-into-digital-gold-bitcoin\"><strong><em>Related: How Irish farmers turn cow dung into digital gold (Bitcoin)</em></strong></a></p><p>A <a href=\"https://cointelegraph.com/news/bitcoin-miners-selling-btc-as-hedge-bitfinex\">market report</a> from Bitfinex suggests that mining firms are looking to derisk by offloading BTC to exchanges. Analysts believe miners are engaging in hedging activities in the derivatives market, carrying out over-the-counter orders or transferring funds through exchanges for other reasons.</p><p>Cointelegraph reached out to a number of prominent mining companies to unpack the current mining climate and the recent trends emerging from the sector.</p><p>Jaime Leverton, CEO of Hut8, highlighted the company’s efforts to <a href=\"https://cointelegraph.com/news/crypto-mining-firms-hut-8-and-us-bitcoin-plan-merger\">close-off a merger</a> with USBTC which has hampered its ability to raise capital through an at-the-market offering. After announcing the upcoming merger, Leverton said Hut8 treasury strategy included the option selling from its Bitcoin holdings and newly produced BTC to cover its operating costs: </p><blockquote>“We plan to revisit our treasury strategy once our merger is complete. As such, we were the last major Bitcoin miner to sell part of our production earlier this year.</blockquote><p>Leverton added that Hut8 still holds more that 9,100 BTC ($271 million) and the firm remains “bullish on Bitcoin and HODLing”, given that it retains one of the largest self-mined Bitcoin reserves from a publicly traded company.</p><p>Hut8 <a href=\"https://hut8.io/2023/07/06/hut-8-mining-production-and-operations-update-for-june-2023/\" target=\"_blank\" rel=\"noopener nofollow\">disclosed</a> that it had sold 217 Bitcoin mined across May and June for $7.9 million in its most recently published production and operation update.</p><p><a href=\"https://cointelegraph.com/news/a-glimpse-into-the-future-what-happens-when-there-are-no-more-bitcoin-to-mine\"><strong><em>Related: A Glimpse Into The Future - What Happens When There Are No More Bitcoin To Mine?</em></strong></a></p><p>Foundry’s business development senior manager Charles Chong also weighed in on the subject, while the firm declined to comment on whether it had held any BTC holdings in 2023.</p><p>As Chong explained, bull market conditions in the past saw miners earning a 60-80% margin on production, while external capital was abundant, allowing many operators to hold onto their mined BTC. </p><blockquote>“However, we are in a different time now with scarce external capital and only a 15-30% margin, forcing miners to liquidate their bitcoin to cover operational costs.”</blockquote><p>Chong also added that it was difficult to compare current market conditions to subsequent bear markets following market peaks in 2017 and 2021. He said that Bitcoin mining moved in cycles as miners “overinvest” in ASIC mining equipment during good times.</p><p>It’s worth noting that the Bitcoin mining difficulty has also hit recent all time highs, which suggests that the network is at its most robust. Chong explained that new, more efficient mining capable of higher hashrates have continuously been released into the market in 2023, which has forced miners to refresh their fleet to continue producing BTC at a profit.</p><blockquote>“That said, total energy usage by the network has been slowly creeping up as well, albeit at a slower pace, indicating increasing investment in security for the network.”</blockquote><p>A spokesperson from Braiins mining told Cointelegraph that continuing difficulty increases are a result of hashrate increasing, which signals that industry participants see potential upside for BTC's price in the future:</p><blockquote>\"To us, this is a sign that miners are still able to deploy machines profitably in the current environment and are bullish on Bitcoin's future price appreciation.\"</blockquote><p>Ongoing market conditions have also seen the closure of some prominent mining firms, including Core Scientific which <a href=\"https://cointelegraph.com/news/bitcoin-miner-core-scientific-files-its-chapter-11-plan\">filed</a> its chapter 11 bankruptcy plan in June 2023. The firm has already managed to<a href=\"https://cointelegraph.com/news/core-scientific-plans-september-bankruptcy-exit\"> raise significant capital</a> to bootstrap a reorganization plan earmarked for September 2023 .</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-21T14:24:42.000Z",
    "title": "‘There Is Literally 0 Difference Between Doge and Litecoin’, Says Prominent Crypto Analyst and Trader",
    "url": "https://www.cryptoglobe.com/latest/2023/07/there-is-literally-0-difference-between-doge-and-litecoin-says-prominent-crypto-analyst-and-trader/",
    "description": "Recently, prominent crypto analyst, educator, and trader Tone Vays stirred up a debate in the crypto community with a single tweet that mentioned Bitcoin, Litecoin, and Dogecoin. Tone Vays is a well-known figure in the cryptocurrency industry, recognized for his deep knowledge and outspoken views on Bitcoin and the broader crypto market. With a background […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T14:38:23.000Z",
    "title": "Unraveling the Crypto Heist: DeFi Platform’s Million-Dollar Breach Raises Alarms",
    "url": "https://www.cryptopolitan.com/defi-platforms-million-dollar-breach/",
    "description": "Decentralized finance (DeFi) has revolutionized the financial landscape, offering users an array of innovative opportunities to participate in a permissionless and trustless ecosystem. However, as the DeFi sector continues to thrive, it has also become a lucrative target for malicious actors seeking to exploit vulnerabilities for personal gain. In a recent incident that sent shockwaves ... <a title=\"Unraveling the Crypto Heist: DeFi Platform&#8217;s Million-Dollar Breach Raises Alarms\" class=\"read-more\" href=\"https://www.cryptopolitan.com/defi-platforms-million-dollar-breach/\" aria-label=\"More on Unraveling the Crypto Heist: DeFi Platform&#8217;s Million-Dollar Breach Raises Alarms\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T14:27:04.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-21T14:30:10.000Z",
    "title": "Riding The Ripple Effect: What’s Next For Stellar Lumens (XLM)?",
    "url": "https://www.newsbtc.com/news/stellar/ripple-effect-whats-next-for-stellar-lumens-xlm/",
    "description": "The comeback of the Stellar Lumens (XLM) price keeps going on. In the last 24 hours, XLM has risen by another 15%, bringing the Ripple competitor&#8217;s price in line with XRP. Indeed, both tokens have risen by close to 65% (at this stage) since the summary judgment in Ripple&#8217;s legal battle with the U.S. Securities and Exchange Commission (SEC). Remarkably, the relationship between Stellar Lumens (XLM) and Ripple&#8217;s XRP has been an intriguing tale of correlation and decoupling. As the market reacted to the recent developments in the Ripple-SEC battle, XLM followed suit, experiencing a remarkable price surge. However, as the broader market conditions cast their shadows, the question arises: Can Stellar Lumens maintain its newfound independence and continue its upward trajectory? The Correlation Between XLM and XRP It is no secret that Stellar Lumens and Ripple&#8217;s XRP share many similarities in their blockchain technologies and use cases. Moreover, the founder&#8217;s Jed McCaleb’s connection to Ripple adds another layer of intrigue, as investors hope that XLM will not be deemed a security by regulators. Related Reading: Stellar (XLM) Surges Over 43% In One Week, What’s Pushing It? This connection has often resulted in XLM mirroring the price movements of XRP. The market&#8217;s anticipation of developments for Ripple being equally impactful for Stellar has often led to such correlated movements, just like last week after the Ripple ruling. However, in recent days, Stellar Lumens has managed to stand on its own feet, showcasing its ability to decouple from the fortunes of XRP. One factor for this may have been its partnership with MoneyGram, which yielded the innovative B2B service called MoneyGram Access. This service enables the conversion of the stablecoin USDC into cash worldwide through MoneyGram&#8217;s branch network, tapping into Stellar&#8217;s ledger for seamless execution. This strategic collaboration has not only bolstered Stellar&#8217;s use case but also may catalyzed its recent surge in price. Related Reading: Stellar Makes Surprise 70% Rally – Start Of Something Big For XLM? With the integration of Access into various applications and fiat ramps, XLM&#8217;s demand and utility is substantially boosted. For instance, the HoneyCoin app&#8217;s integration of Access for straightforward cash out in multiple African countries and the United Kingdom might have contributed to Stellar&#8217;s outperformance relative to XRP in recent days. We&#8217;re excited to share @honeycoinapp users can now cash out of their USDC balance at supported @MoneyGram locations in Kenya, Uganda, Tanzania, Nigeria, Ghana, and the UK 🥳️ Another real-world use case for @Circle’s USDC on Stellar.https://t.co/0JKNhdJMx3 — Stellar (@StellarOrg) July 17, 2023 A second factor for XLM’s recently strong performance could be the extremely high interest on the futures market. The open interest for Stellar Lumens has skyrocketed to over $120 million yesterday, a level not seen since the peak of the bull market in November 2021. Notably, this phenomenon is similar to XRP which has also seen open interest soar to prior record levels. Stellar Lumens Price Outlook Despite experiencing a sharp rally, Stellar Lumens still remains in rather bearish territory when looking at the 1-week chart. For this week, it’s crucial that the XLM price regains the 23.6% Fibonacci retracement level at $0,1583 as well as the 200-week EMA at $0,1597 (blue line). With the weekly RSI at 73, another leg up could be possible. On the 1-day time frame, XLM remains above all moving averages (EMAs). For a further bullish trajectory, it&#8217;s important that Stellar hold above the support at $0.1250. Should this happen, XLM could experience a further 35% rally towards the 38.2% Fibonacci retracement level. However, a drop below the support level at $0.1250 would challenge the bullish view. Featured image from oranfireblade / Pixabay,, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T14:30:03.000Z",
    "title": "Is It Time for Ripple (XRP) to Smash the $1 After SEC Case Wins?",
    "url": "https://www.crypto-news-flash.com/is-it-time-for-ripple-xrp-to-smash-the-1-after-sec-case-wins/?utm_source=rss&utm_medium=rss&utm_campaign=is-it-time-for-ripple-xrp-to-smash-the-1-after-sec-case-wins",
    "description": "<img width=\"512\" height=\"338\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T130653.939.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T130653.939.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T130653.939-300x198.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T130653.939-104x69.png 104w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T130653.939-214x140.png 214w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Crypto shorts are feeling the burn as massive liquidations hit them in the past 48 hours. The reason? A court ruling that favored Ripple Labs stating that the XRP token is not a security. So, how did the market react to this news? Well, according to Santiment, the on-chain data provider, the XRP network in [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-21T14:30:10.000Z",
    "title": "Top Crypto Analyst Says Little-Known Altcoin That’s Exploded 390% in a Month Primed To Surge by Another 3x",
    "url": "https://dailyhodl.com/2023/07/21/top-crypto-analyst-says-little-known-altcoin-thats-exploded-390-in-a-month-primed-to-surge-by-another-3x/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Altcoin-Thats-Exploded-390.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Altcoin-Thats-Exploded-390.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Altcoin-Thats-Exploded-390.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Altcoin-Thats-Exploded-390.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Altcoin-Thats-Exploded-390.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Altcoin-Thats-Exploded-390.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Altcoin-Thats-Exploded-390.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist says one surging blockchain casino project could explode by another 200%. Pseudonymous analyst The Flow Horse, also known as Cantering Clark, tells his 179,700 Twitter followers that Rollbit Coin (RLB) could rally another 3x from the $0.10 level. He gives several reasons to support his forecast, including that positive public [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/21/top-crypto-analyst-says-little-known-altcoin-thats-exploded-390-in-a-month-primed-to-surge-by-another-3x/\">Top Crypto Analyst Says Little-Known Altcoin That’s Exploded 390% in a Month Primed To Surge by Another 3x</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]