[
  {
    "source": "CryptoSlate",
    "date": "2023-07-01T13:00:33.000Z",
    "title": "Op-ed: Current DAO infrastructure isn’t truly decentralized, but it can be",
    "url": "https://cryptoslate.com/op-ed-current-dao-infrastructure-isnt-truly-decentralized-but-it-can-be/",
    "description": "<p>Over the past few years, blockchain technology has paved the way for a new governance model known as the decentralized autonomous organization, or DAO. Built with the philosophy of doing away with a centralized hierarchy that fully controls all decision-making within a given company, DAOs flip the traditional corporate structure on its head, giving shareholders [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/op-ed-current-dao-infrastructure-isnt-truly-decentralized-but-it-can-be/\">Op-ed: Current DAO infrastructure isn’t truly decentralized, but it can be</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-01T12:55:00.000Z",
    "title": "Kraken Ordered To Turn Over User Information To The IRS",
    "url": "https://cryptodaily.co.uk/2023/07/kraken-ordered-to-turn-over-user-information-to-the-irs",
    "description": "<p>Cryptocurrency exchange Kraken has been ordered by a federal court to turn over user account information and transaction history to the IRS so that it can check if the exchange&rsquo;s users underreported their taxes.&nbsp;</p>\n<p>The order comes amidst a growing crackdown on crypto and will require the exchange to provide significant user data to the authorities.&nbsp;</p>\nThe IRS Headache&nbsp;\n<p>As a result of the ruling, Kraken will have to hand over swathes of user information to the Internal Revenue Service (IRS). The Internal Revenue Service had filed a court petition in the Northern District of California moments after Kraken had announced that it would settle charges brought against it by the United States Securities and Exchange Commission (SEC). The SEC had charged Kraken with offering unregistered securities through its staking as a service program. The IRS had previously issued a summons to Kraken in 2021, but the exchange failed to comply. The IRS had stated in its February petition,&nbsp;</p>\n\n<p>&ldquo;Despite discussions between the parties, Payward Ventures Inc. [one of the registered companies that make up Kraken] &amp; Subsidiaries has failed to comply with the summons and has not produced the books, records, papers, and other data demanded in the summons. Payward Ventures Inc. &amp; Subsidiaries&rsquo; failure to comply with the summons continues to this date.&rdquo;</p>\n\n<p>The IRS has stated that it is seeking information on Kraken accounts that have carried out at least $20,000 worth of cryptocurrency trading in a single year between 2016 and 2020. On its part, Kraken has called the tax agency&rsquo;s summons an &ldquo;unjustified treasure hunt.&rdquo; It also argued that the summons went well beyond the boundaries set in a similar fight with Coinbase around six years ago.&nbsp;</p>\nThe Court Order&nbsp;\n<p>The federal court ruling comes as regulatory authorities in the United States of America increase their crackdown on the crypto markets. The Securities and Exchange Commission has already filed lawsuits against Binance and Coinbase, alleging that the former mishandled customer funds, misled investors, and broke securities laws, while the latter was running an illegal exchange. The order passed on Friday orders Kraken to turn over account details and user information such as taxpayer identification number, birth date, user name or pseudonym, phone number, email address, address, and several other documents.&nbsp;</p>\n<p>Furthermore, the exchange will also be required to turn over transaction hashes and blockchain addresses that are already a part of the transaction data that it can share. The judge wrote that the IRS has a legitimate purpose and reasoning for seeking the materials in question, adding that it must determine the tax liability for exchange users within the stipulated time period. The IRS&rsquo;s demands are backed by the fact that taxpayers filing returns for Bitcoin-related investments are minuscule compared to the sheer volume of trading activity on Kraken. The order stated that Kraken had over 4 million clients in the time period between 2011 to 2017, conducting over $140 billion worth of trades. Additionally, it stated that the exchange was registering 50,000 new users daily.&nbsp;</p>\nSeveral IRS Requests Rejected&nbsp;\n<p>However, not everything went the way the IRS wanted. In fact, the judge outright refused several requests put forward by the IRS. The judge also rejected the tax agency&rsquo;s requests for receiving employment information and source of wealth from the exchange. The judge wrote in his analysis of some of the requests,&nbsp;</p>\n\n<p>&ldquo;The Court must determine whether the Government&rsquo;s summons is narrowly tailored, that is, whether it is &lsquo;no broader than necessary to achieve its purpose. The Court finds that to the extent the first three requests are aimed at establishing the identities of the Kraken account holders who fall within the Doe definition, the information sought in these requests is much broader than what is necessary to achieve that purpose for the vast majority of Doe users.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-01T13:05:21.000Z",
    "title": "Biggest Movers: LTC Leaps to 15-Month Peak as DOGE Bull Run Continues",
    "url": "https://news.bitcoin.com/biggest-movers-ltc-leaps-to-15-month-peak-as-doge-bull-run-continues/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1908710596-2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: LTC Leaps to 15-Month Peak as DOGE Bull Run Continues\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1908710596-2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1908710596-2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1908710596-2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1908710596-2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1908710596-2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1908710596-2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1908710596-2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />After climbing by over 20% on Friday, litecoin extended gains to start the weekend, surging to its highest point in over a year. The move comes as momentum surrounding the token&#x2019;s listing on EDX markets continues to grow. Dogecoin also recorded a strong start to the day. Litecoin (LTC) Litecoin (LTC) was once again a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-01T13:04:02.000Z",
    "title": "French fashion brand Dior launches exclusive line of blockchain-backed sneakers, explores Web3 integration",
    "url": "https://www.cryptopolitan.com/fdior-launches-exclusive-line-of-blockchain-backed-sneakers/",
    "description": "French luxury fashion house Dior has unveiled its latest innovation in the fashion world by introducing a new line of men&#8217;s sneakers that leverage the Ethereum blockchain. The highly anticipated B33 sneakers, designed by Dior Menswear artistic director Kim Jones, are set to be released as part of the Men&#8217;s Fall 2023 collection. What sets ... <a title=\"French fashion brand Dior launches exclusive line of blockchain-backed sneakers, explores Web3 integration\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fdior-launches-exclusive-line-of-blockchain-backed-sneakers/\" aria-label=\"More on French fashion brand Dior launches exclusive line of blockchain-backed sneakers, explores Web3 integration\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-01T13:00:35.000Z",
    "title": "Africa’s cryptocurrency market surged by 1,200% between 2020 to 2021: Report",
    "url": "https://www.cryptopolitan.com/africas-cryptocurrency-market-surged-by-1200-between-2020-to-2021-report/",
    "description": "In a notable development, the African continent has witnessed a staggering growth of 1,200% in cryptocurrency adoption from July 2020 to June 2021, according to an Emurgo State of Web 3.0 report. Despite accounting for only 2% of the global value of all cryptocurrencies, Africa&#8217;s rapid acceptance of digital currencies is reshaping traditional financial flows ... <a title=\"Africa&#8217;s cryptocurrency market surged by 1,200% between 2020 to 2021: Report\" class=\"read-more\" href=\"https://www.cryptopolitan.com/africas-cryptocurrency-market-surged-by-1200-between-2020-to-2021-report/\" aria-label=\"More on Africa&#8217;s cryptocurrency market surged by 1,200% between 2020 to 2021: Report\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-01T12:54:17.000Z",
    "title": "Shiba Inu burns 1.6b tokens in June",
    "url": "https://crypto.news/shiba-inu-burns-1-6b-tokens-in-june/",
    "description": "A recent tweet by Shibburn shows that the shiba inu community sent 1,653,845,435 SHIB meme coins to empty wallets in the past month. While the quantity of burned SHIB tokens may seem impressive, daily burning rates remain volatile, often plunging&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-01T12:49:41.000Z",
    "title": "The battle of SEC and crypto companies: 2023 outline",
    "url": "https://crypto.news/the-battle-of-sec-and-crypto-companies-2023-outline/",
    "description": "The SEC has initiated legal actions against multiple crypto entities to address potential violations of securities laws and protect investors. As the deadlines for some of them draw near, let&#8217;s recall which are expected to end. Gary Gensler’s SEC has&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-01T13:00:18.000Z",
    "title": "Hollywood X PEPE ($HXPE) Presale Is Ending: Don’t Miss Out on This Golden Opportunity!",
    "url": "https://www.crypto-news-flash.com/hollywood-x-pepe-hxpe-presale-is-ending-dont-miss-out-on-this-golden-opportunity/?utm_source=rss&utm_medium=rss&utm_campaign=hollywood-x-pepe-hxpe-presale-is-ending-dont-miss-out-on-this-golden-opportunity",
    "description": "A spotlight on the new player in the Best Meme Coins Market, and how it compares to Shiba Inu Coin ($SHIB) and Dogecoin ($DOGE). Cryptocurrency is taking the world by storm, and meme coins have carved out a special niche in the hearts of investors. From Dogecoin ($DOGE) to Shiba Inu Coin ($SHIB), there are [...]"
  }
]