[
  {
    "source": "NewsBTC",
    "date": "2023-10-02T20:00:00.000Z",
    "title": "Crypto Crisis Imminent, Warns Bloomberg’s Mike McGlone, Despite Bitcoin’s Surge To $28,000",
    "url": "https://www.newsbtc.com/crypto/crypto-crisis-imminent-warns-bloombergs-mike-mcglone-despite-bitcoins-surge-to-28000/",
    "description": "On October 2, Mike McGlone, Commodity Strategist at Bloomberg, took to social media X (formerly known as Twitter) to express his concerns about the state of the crypto market.  Despite Bitcoin&#8217;s (BTC) recent rise, McGlone highlighted a disturbing trend and raised the possibility of a cryptocurrency recession. Factors Behind Crypto Market&#8217;s Recession Risk McGlone pointed out the concept of &#8220;positive beta vs. negative liquidity&#8221; and its implications for the cryptocurrency market.  Bloomberg’s senior Macro Strategist suggested that the weakness observed in the third quarter of 2023 could be either a temporary blip in the recovery or a sign of an impending recession.  Related Reading: Optimism (OP) Climbs 6% A Day As Crypto Market Rebounds, What’s Next? According to McGlone, the latter scenario is more likely, given that most risk assets experienced gains in 2023 but have since rolled over into the new quarter. The strategist also drew attention to the actions of central banks worldwide, noting that many are tightening their monetary policies despite signs of contraction in the United States and Europe.  Additionally, McGlone highlighted the ongoing property crisis in China, which carries deflationary implications. He argued that the Bloomberg Galaxy Crypto Index&#8217;s (BGCI) relative underperformance may reflect changing conditions for an asset class that has thrived in a zero-interest-rate environment. Drawing historical parallels, McGlone mentioned the swoons in Bitcoin&#8217;s price preceding Federal Reserve (Fed) pivots, implying that cryptocurrencies could serve as leading indicators for broader market liquidity. McGlone suggested that a revival of liquidity may be necessary to support the crypto market. Bitcoin Maximalist Identifies Key Factors For Remarkable Market Growth In addition to McGlone&#8217;s forecast, increased regulatory scrutiny and implementing stringent regulations by governments and regulatory bodies can significantly impact the cryptocurrency market.  The United States regulatory bodies have been actively cracking down on the crypto market, causing delays in what was expected to be a bullish run. Lawsuits filed in 2023 and signals of continued regulatory actions by the US Securities and Exchange Commission (SEC) have created uncertainty and restrictive regulations that can dampen investor sentiment and contract the market.  Moreover, economic factors contribute to concerns about a potential recession in the digital asset ecosystem. Cryptocurrencies are interconnected with the broader economic landscape, meaning global recessions, monetary policy changes, inflation, or deflation can affect the cryptocurrency market, potentially leading to a recession. On the other hand, some view the largest cryptocurrencies as safe havens during significant declines in the world&#8217;s largest economies. Bitcoin maximalists, including &#8220;The Bitcoin Therapist,&#8221; assisted by Artificial Intelligence (AI), have identified key factors necessary for Bitcoin and the overall market to achieve remarkable growth.  These factors include mass adoption, global economic uncertainty, institutional investment, limited supply, increased transaction volume, technological improvements, regulatory clarity, positive market sentiment, halving events, and a global currency crisis.  While progress has been made in factors such as global economic uncertainty, limited supply, increased transaction volume, technological improvements, and halving events, achieving mass adoption, institutional investment, regulatory clarity, positive market sentiment, and a global currency crisis are still pending. Related Reading: Chainlink Signal That Preceded Crashes Of 34% Is Back The strategist&#8217;s remarks underline the cautious sentiment surrounding cryptocurrencies despite recent positive movements in Bitcoin&#8217;s price.  McGlone&#8217;s analysis suggests that the cryptocurrency market may face significant headwinds due to changing economic conditions, central bank policies, and potential liquidity challenges. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-02T20:00:49.000Z",
    "title": "Bitcoin and Gold Can Flourish as US Struggles With Massive Fiscal Problems: Macro Investor Luke Gromen",
    "url": "https://dailyhodl.com/2023/10/02/bitcoin-and-gold-can-flourish-as-us-struggles-with-massive-fiscal-problems-macro-investor-luke-gromen/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/bitcoin-primed-mirrors-predicts.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/bitcoin-primed-mirrors-predicts.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/bitcoin-primed-mirrors-predicts.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/bitcoin-primed-mirrors-predicts.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/bitcoin-primed-mirrors-predicts.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/bitcoin-primed-mirrors-predicts.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/bitcoin-primed-mirrors-predicts.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Veteran macro investor Luke Gromen says that both Bitcoin (BTC) and gold can flourish as fiscal issues continue to mount within the US economy. In a new interview on the Blockworks Macro YouTube channel, macro investor Luke Gromen says that relentless quantitative easing and a potential pivot from the Federal Reserve will create an environment [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/02/bitcoin-and-gold-can-flourish-as-us-struggles-with-massive-fiscal-problems-macro-investor-luke-gromen/\">Bitcoin and Gold Can Flourish as US Struggles With Massive Fiscal Problems: Macro Investor Luke Gromen</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-02T19:55:27.000Z",
    "title": "Aptos (APT) Founder Names Three Things That Could Attract a Billion New Crypto Users",
    "url": "https://dailyhodl.com/2023/10/02/aptos-apt-founder-names-three-things-that-could-attract-a-billion-new-crypto-users/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/massive-airdrop-aptos-plummets.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/massive-airdrop-aptos-plummets.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/massive-airdrop-aptos-plummets.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/massive-airdrop-aptos-plummets.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/massive-airdrop-aptos-plummets.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/massive-airdrop-aptos-plummets.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/massive-airdrop-aptos-plummets.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The co-founder of Aptos (APT) is weighing in on what developments in the digital assets space could attract the next wave of mass adoption. In a new interview with crypto influencer Scott Melker, Aptos CEO and cofounder Mo Shaikh says that three main things could result in a billion new users flooding the space. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/02/aptos-apt-founder-names-three-things-that-could-attract-a-billion-new-crypto-users/\">Aptos (APT) Founder Names Three Things That Could Attract a Billion New Crypto Users</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]