[
  {
    "source": "Cointelegraph",
    "date": "2024-01-11T02:49:25.000Z",
    "title": " As Crypto X cheers Bitcoin ETFs, guess who hasn’t posted in over 24 hours ",
    "url": "https://cointelegraph.com/news/crypto-celebrates-bitcoin-etf-approval-sec-twitter-radio-silent",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNWQ5MzNkZjctNDIwYi00MWI0LWEyOWYtNzY4ZWUzYzJlZjMyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>One X account has maintained radio silence after it unwillingly “bungled” the spot Bitcoin ETF announcement when it was hacked a day earlier.</p>\n                    <p><p>As crypto proponents go into a celebration frenzy over the \"historic\" approval of spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds (ETFs) on Jan. 10, there’s one X user who has been radio silent on the platform. </p><p>Over the past day, tens of thousands of crypto X users have flooded the platform, celebrating the <a href=\"https://cointelegraph.com/news/sec-spot-bitcoin-etf-approvals\">approval of spot Bitcoin ETFs</a>. The hashtag #BitcoinETF is trending on X, while the search term “Bitcoin ETF” reached a maximum score of 100 on Google Trends.</p><p>Many crypto X users have described the day as \"historic\" — a total of 11 issuers received their approvals to list and trade their Bitcoin ETFs on United States exchanges. </p><p><a href=\"https://cointelegraph.com/news/crypto-celebrates-bitcoin-etf-approval-sec-twitter-radio-silent\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-11T03:00:06.000Z",
    "title": "Ethereum takes the lead over Bitcoin in derivatives trading volume",
    "url": "https://cryptoslate.com/ethereum-takes-the-lead-over-bitcoin-in-derivatives-trading-volume/",
    "description": "<p>The derivatives market for Bitcoin (BTC) and Ethereum (ETH) experienced significant fluctuations following the incident on Jan. 9, where the U.S. Securities and Exchange Commission&#8217;s (SEC) Twitter account was compromised. This false announcement of a spot Bitcoin ETF approval led to a series of market reactions that wiped out over $50 billion in Bitcoin&#8217;s market [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ethereum-takes-the-lead-over-bitcoin-in-derivatives-trading-volume/\">Ethereum takes the lead over Bitcoin in derivatives trading volume</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-11T02:48:59.000Z",
    "title": "Bitcoin Price Stuck Below $48K Despite ETF Approval, Is This Bearish?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-stuck-below-48k/",
    "description": "Bitcoin price remained in a range above the $45,000 support. BTC failed to climb higher above the $48,000 resistance despite approval of spot ETF. Bitcoin is still struggling to clear the $47,800 and $48,000 resistance levels. The price is trading above $45,600 and the 100 hourly Simple moving average. There was a break above a major contracting triangle with resistance near $46,550 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh decline if the bears continue to protect the $48,000 resistance. Bitcoin Price Upsides Capped Bitcoin price remained stable above the $45,500 resistance zone. Finally, the SEC approved all 11 spot ETF. BTC did climb higher above the $46,500 and $46,600 resistance levels after the news. There was a break above a major contracting triangle with resistance near $46,550 on the hourly chart of the BTC/USD pair. However, the bears were still active near the $47,350 and $47,800 levels. A high was formed near $47,699 and the price is now showing a few bearish signs. There was a minor decline below the $47,000 level. Bitcoin declined below the 23.6% Fib retracement level of the recent increase from the $44,333 swing low to the $47,699 high. The price is now trading above $45,600 and the 100 hourly Simple moving average. On the upside, immediate resistance is near the $47,000 level. The first major resistance is $47,350. A clear move above the $47,350 resistance could send the price toward the $47,800 resistance. Source: BTCUSD on TradingView.com The next resistance is now forming near the $48,000 level. A close above the $48,000 level could send the price further higher. The next major resistance sits at $49,250. Another Decline In BTC? If Bitcoin fails to rise above the $47,350 resistance zone, it could start a fresh decline. Immediate support on the downside is near the $46,550 level. The next major support is $46,000 or the 50% Fib retracement level of the recent increase from the $44,333 swing low to the $47,699 high. If there is a move below $46,000, the price could gain bearish momentum. In the stated case, the price could drop toward the $45,150 support in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $46,500, followed by $46,000. Major Resistance Levels – $47,000, $47,350, and $47,800."
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-11T03:00:25.000Z",
    "title": "Crypto Trader Predicts Rally Toward ‘Ambitious’ Level for Ethereum Rival, Updates Outlook on Cardano and XRP",
    "url": "https://dailyhodl.com/2024/01/10/crypto-trader-predicts-rally-toward-ambitious-level-for-ethereum-rival-updates-outlook-on-cardano-and-xrp/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/trader-predicts-rally-level.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/trader-predicts-rally-level.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/trader-predicts-rally-level.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/trader-predicts-rally-level.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/trader-predicts-rally-level.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/trader-predicts-rally-level.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/trader-predicts-rally-level.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto trader thinks that one Ethereum (ETH) challenger may be on the cusp of a breakout rally. Crypto trader Ali Martinez tells his 40,000 followers on the social media platform X that Solana (SOL) is forming a bullish continuation pattern on the hourly chart. The analyst shares a chart that suggests SOL [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/10/crypto-trader-predicts-rally-toward-ambitious-level-for-ethereum-rival-updates-outlook-on-cardano-and-xrp/\">Crypto Trader Predicts Rally Toward ‘Ambitious’ Level for Ethereum Rival, Updates Outlook on Cardano and XRP</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]