[
  {
    "source": "CoinDesk",
    "date": "2023-10-03T23:03:16.000Z",
    "title": "Crypto-Friendly Congressman McHenry Temporarily Takes Over U.S. House",
    "url": "https://www.coindesk.com/policy/2023/10/03/crypto-friendly-congressman-mchenry-temporarily-takes-over-us-house/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto-friendly Rep. Patrick McHenry (R-N.C.) has landed in the driver’s seat of the U.S. House of Representatives just as legislation to establish digital-asset regulations nears a finish line there."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-03T22:57:08.000Z",
    "title": "At Least 3 SBF Jurors Recused Themselves Because They Lost Money in Crypto",
    "url": "https://decrypt.co/200014/sam-bankman-fried-jury-voir-dire-lost-money-in-crypto",
    "description": "The court weighed potential bias among candidates who worked for banks, or watched Sunday's 60 Minutes broadcast."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-03T22:53:05.000Z",
    "title": "Could House Speaker Kevin McCarthy's Ouster Be Good for Crypto?",
    "url": "https://decrypt.co/200015/could-house-speaker-kevin-mccarthys-ouster-good-crypto",
    "description": "Top candidates to replace the former Speaker of the House, who was removed from office in a historic vote Tuesday, include ardent pro-crypto advocates Patrick McHenry and Tom Emmer."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-03T22:40:52.000Z",
    "title": "U.S. Department of Justice charges eight Chinese companies using crypto to facilitate fentanyl trade",
    "url": "https://cryptoslate.com/u-s-department-of-justice-charges-eight-chinese-companies-using-crypto-to-facilitate-fentanyl-trade/",
    "description": "<p>U.S. authorities took action against several China-based companies and individuals implicated in the fentanyl trade on Oct. 3. The Department of Justice (DOJ) announced that it has unsealed eight indictments on crimes related to the production of fentanyl and methamphetamine, the distribution of synthetic opioids, and sales related to precursor chemicals. Though participants used a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/u-s-department-of-justice-charges-eight-chinese-companies-using-crypto-to-facilitate-fentanyl-trade/\">U.S. Department of Justice charges eight Chinese companies using crypto to facilitate fentanyl trade</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-03T22:50:00.000Z",
    "title": "Crypto Analyst Predicts $XRP Price Could Surge Over 30% This Week",
    "url": "https://www.cryptoglobe.com/latest/2023/10/crypto-analyst-predicts-xrp-price-could-surge-over-30-this-week/",
    "description": "Popular cryptocurrency analyst Dark Defender has predicted that the price of the native token of the XRP Ledger, $XRP, could surge as much as 32% over this week to hit $0.66 after the cryptocurrency reaches its next Fibonacci level. In a post shared on the microblogging platform X (formerly known as Twitter) with their nearly […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-03T22:54:04.000Z",
    "title": "Meta reportedly plans to downsize staff in metaverse silicon unit",
    "url": "https://www.cryptopolitan.com/meta-reportedly-plans-to-downsize-staff-in-metaverse-silicon-unit/",
    "description": "Meta plans to downsize its Reality Labs division, the unit responsible for pioneering custom silicon to power the tech giant&#8217;s augmented and virtual reality hardware. According to a recent report by Reuters citing sources familiar with the matter, the announcement arrived via Meta&#8217;s Workplace discussion forum on Tuesday. Employees were advised they would be apprised ... <a title=\"Meta reportedly plans to downsize staff in metaverse silicon unit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/meta-reportedly-plans-to-downsize-staff-in-metaverse-silicon-unit/\" aria-label=\"More on Meta reportedly plans to downsize staff in metaverse silicon unit\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-03T23:00:02.000Z",
    "title": "Why You Should Pay Attention To The XRP Price Predictions",
    "url": "https://www.newsbtc.com/analysis/xrp/attention-xrp-price-predictions/",
    "description": "Over the last month, a number of XRP price predictions have dominated crypto headlines. Some of these predictions have been greatly exaggerated, but there have been some that have come up on the more realistic side. Whether or not these XRP price predictions have been probable, there are some merits to actually paying attention to them. XRP Price Predictions Signaling Investor Outlook Price predictions are not new to crypto and they can often be a way to gauge how investors, especially traders are looking at a cryptocurrency. In recent times, the focus has mainly been on the XRP price, and with most of the predictions being bullish, it indicates widespread bullishness across the community. Related Reading: Brace For Impact As $200 Million In Crypto Is Being Unlocked In October A good portion of this bullishness can be attributed to Ripple’s win over the US Securities and Exchange Commission (SEC) back in July. Following the ruling, the price of XRP jumped over 60%, reaching its highest point in a month. Even though the US SEC has contested Judge Analisa Torres’s ruling and filed an interlocutory appeal, it has not eliminated the long-term bullish outlook for the XRP price. This is because multiple legal experts have talked about the SEC’s interlocutory filing and the consensus has mainly been a low chance of success. Additionally, if Ripple were to emerge victorious in the interlocutory appeal as well, it would cement XRP’s status as a non-security. This would bolster the already renewed fate and signal the entrance of more institutional investors into the asset. XRP regains footing at $0.5 &#124; Source: XRPUSD On Tradingview.com Looking At Some XRP Predictions Some XRP price predictions have been more realistic than others and those take precedence in this report. One of those is the 1,100% surge predicted by crypto analyst Dark Defender, who put the altcoin’s price at $5.85 in a couple of years. However, one analyst believes that the XRP price could rise as high as $25 following a 5,000% surge. While another analyst Oaksacorn put forward one of the most bullish predictions of XRP rising to reach the $250 level. Related Reading: LINK Price Primed For Meteoric Rise: Analyst Predicts 130% Rally To $18 For Wells Fargo Manager Shannon Thorp, XRP is primed for even greater heights. Thorp points to Ripple’s rising prominence in the cross-border payments sector and as the sector is expected to reach $250 trillion, she believes this could drive the XRP price to $500. All of these forecasts have varying timeframes for when the analysts expect them to play out. However, one thing they have in common is general bullishness toward the XRP price, especially when put into the perspective of long-term performance. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from CoinMarketCap, chart from TradingView.com"
  }
]