[
  {
    "source": "CryptoSlate",
    "date": "2023-05-29T09:31:17.000Z",
    "title": "Cardano meme coin SNEK scales new heights – hitting new all-time high",
    "url": "https://cryptoslate.com/cardano-meme-coin-snek-scales-new-heights-hitting-new-all-time-high/",
    "description": "<p>Cardano meme coin SNEK has been garnering a lot of attention from the crypto community lately. On May 11, InputOutput (IO) CEO Charles Hoskinson posted a tweet asking, &#8220;What the heck is this #Snek thing that people keep tweeting about?&#8221; Some took this to mean a Hoskinson-IO endorsement of SNEK. However, in a more recent [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/cardano-meme-coin-snek-scales-new-heights-hitting-new-all-time-high/\">Cardano meme coin SNEK scales new heights &#8211; hitting new all-time high</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-29T09:30:44.000Z",
    "title": "Hackers Breach Nigerian Crypto Trading Platform — BTC and Naira Assets Compromised",
    "url": "https://news.bitcoin.com/hackers-breach-nigerian-crypto-trading-platform-btc-and-naira-assets-compromised/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/patr-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Hackers Breach Nigerian Crypto Trading Platform — BTC and Naira Assets Compromised\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/patr-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/patr-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/patr-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/patr-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/patr-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/patr-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/patr.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Nigerian gift card and crypto trading platform, Patricia, announced on May 26 that one of its trading applications had been breached and that BTC as well as naira assets were compromised. The crypto exchange platform said it has since suspended withdrawals and is presently &#x201C;undergoing internal restructuring.&#x201D; Patricia Says Customer and Merchant Assets &#x2018;Secure&#x2019; [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-29T09:24:00.000Z",
    "title": "Terra classic developers delay v2.1.0 upgrade to allow for more tests",
    "url": "https://crypto.news/terra-classic-developers-delay-v2-1-0-upgrade-to-allow-for-more-tests/",
    "description": "In the updated Q2 plan, the L1JTF team is delaying the release of v2.1.0 to mid-June 2023"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-29T09:33:43.000Z",
    "title": "Floki Inu: Does Meme Coin Have What It Takes To Re-Enter Top 100 Spot?",
    "url": "https://www.newsbtc.com/news/floki-inu-does-meme-coin-have-what-it-takes-to-re-enter-top-100-spot/",
    "description": "Floki Inu (FLOKI) entered the crypto landscape with a wave of enthusiasm, riding on the coattails of the meme coin trend that gained momentum through the success of Dogecoin. Its charismatic Shiba Inu mascot and an active community on social media platforms quickly attracted a dedicated following.  Floki Inu&#8217;s journey, however, has not been without its fair share of ups and downs. As the crypto market is known for its volatility, the question arises: Can Floki Inu rally strong enough to regain its coveted spot among the top 100 cryptocurrencies? Related Reading: Bitcoin Bulls Push BTC Back Up To $28K Level Amid Surging Address Activity Floki Inu Market Cap And Growth Analysis Floki Inu (FLOKI), despite previously achieving a significant rally that propelled it into the top 100 cryptocurrencies by market capitalization, has recently lost its position among the elite. Currently, FLOKI holds the 121st spot with a market capitalization of $332,037,915. Source: Coingecko Within the vast cryptocurrency market, Floki Inu (FLOKI) is currently priced at a modest $0.00003367, as per CoinGecko. Over the past 24 hours, the token experienced a slight 2.8% increase. However, it managed to tally a decent 8.8% over the past seven days. The coin is down 6.7% in the last two weeks. Despite being introduced in 2021, Floki Inu has not achieved the same extraordinary level of success as renowned meme coins such as Dogecoin (DOGE) and Shiba Inu (SHIB). However, it would be unjust to characterize FLOKI&#8217;s growth as disappointing. Since its launch, the token has experienced an impressive surge of 656.12%, illustrating its capacity for generating substantial returns. Potential Catalysts For Floki Inu&#8217;s Re-entry To Top 100 A pivotal factor in Floki Inu&#8217;s quest to reclaim its position among the top 100 cryptocurrencies is the cultivation of a more robust and engaged community. By fostering active participation, encouraging community-driven initiatives, and maintaining transparency through regular updates on the project&#8217;s development, FLOKI can significantly enhance its appeal to investors and crypto enthusiasts. Floki Inu also holds strong potential in the realm of non-fungible tokens (NFTs). Notably, the trade volume associated with FLOKI&#8217;s NFTs has achieved remarkable milestones, reaching millions of dollars.  Crypto total market inches up a bit at $1.12 trillion on the daily chart at TradingView.com Related Reading: Bitcoin Core 25.0 Hits The Market: A Sneak Peek Into The Future According to on-chain data, FLOKI’s total NFT volume surged to an impressive $16.25 million in April, illustrating the significant interest in non-fungible assets linked to the Floki Inu network. To regain its standing, Floki Inu must prioritize the enhancement of its token&#8217;s utility and innovative capabilities. By actively developing real-world use cases and forging strategic partnerships with businesses and platforms, FLOKI can establish a more solid foundation for long-term growth. This focus on utility will not only attract more users but also contribute to the token&#8217;s broader adoption and increased market capitalization. -Featured image from Science Photo Library"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-29T09:23:07.000Z",
    "title": "Bitcoin Soars Over $28,000 as US Gears Up to Raise Debt Ceiling – Will BTC Price Reach $30,000 or $25,000 First? Report",
    "url": "https://www.crypto-news-flash.com/bitcoin-soars-over-28000-as-us-gears-up-to-raise-debt-ceiling-will-btc-price-reach-30000-or-25000-first-report/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-soars-over-28000-as-us-gears-up-to-raise-debt-ceiling-will-btc-price-reach-30000-or-25000-first-report",
    "description": "<p>As Bitcoin price gained value over the weekend, the total balance on centralized exchanges reduced, depicting investors are more bullish in the long term. The total crypto market increased by about 2.5 percent to stand around $1.21 trillion on Monday. After closing the first three weeks of May with a bearish outlook, Bitcoin price edged [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/bitcoin-soars-over-28000-as-us-gears-up-to-raise-debt-ceiling-will-btc-price-reach-30000-or-25000-first-report/\">Bitcoin Soars Over $28,000 as US Gears Up to Raise Debt Ceiling &#8211; Will BTC Price Reach $30,000 or $25,000 First? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-29T09:15:41.000Z",
    "title": "Bitcoin Firebrand Michael Saylor Says Banking Establishment Will Oppose CBDCs, Predicts Stablecoin Wind Down",
    "url": "https://dailyhodl.com/2023/05/29/bitcoin-firebrand-michael-saylor-says-banking-establishment-will-oppose-cbdcs-predicts-stablecoin-wind-down/",
    "description": "<img width=\"1024\" height=\"576\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/a-Significant-Moment-crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/a-Significant-Moment-crypto.jpg 1492w, https://dailyhodl.com/wp-content/uploads/2023/01/a-Significant-Moment-crypto.jpg?resize=300,169 300w, https://dailyhodl.com/wp-content/uploads/2023/01/a-Significant-Moment-crypto.jpg?resize=768,432 768w, https://dailyhodl.com/wp-content/uploads/2023/01/a-Significant-Moment-crypto.jpg?resize=1024,576 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/a-Significant-Moment-crypto.jpg?resize=750,422 750w, https://dailyhodl.com/wp-content/uploads/2023/01/a-Significant-Moment-crypto.jpg?resize=1140,641 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>MicroStrategy CEO Michael Saylor predicts that central bank digital currencies (CBDCs) will face significant challenges amid talks of the US possibly rolling out its own digital dollar. In a new interview on Kitco News, the popular Bitcoin (BTC) advocate says that the current banking establishment will oppose the introduction of a CBDC, seeing it as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/29/bitcoin-firebrand-michael-saylor-says-banking-establishment-will-oppose-cbdcs-predicts-stablecoin-wind-down/\">Bitcoin Firebrand Michael Saylor Says Banking Establishment Will Oppose CBDCs, Predicts Stablecoin Wind Down</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]