[
  {
    "source": "CoinDesk",
    "date": "2023-10-16T11:55:27.000Z",
    "title": "‘Elizabeth Warren Chalked the Field’: Former Congressmen Tim Ryan (D) and David McIntosh (R) on the Prospects for Crypto Legislation Before the Election",
    "url": "https://www.coindesk.com/consensus-magazine/2023/10/16/elizabeth-warren-chalked-the-field-former-congressmen-tim-ryan-d-and-david-mcintosh-r-on-the-prospects-for-crypto-legislation-before-the-election/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "David McIntosh says the SEC’s approach to crypto “makes the consumer and the investor much more vulnerable.”"
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-16T11:42:52.000Z",
    "title": "Hong Kong-Based Crypto Exchange OSL's Owner Weighing Sale at $128M Valuation: Bloomberg",
    "url": "https://www.coindesk.com/business/2023/10/16/hong-kong-based-crypto-exchange-osls-owner-weighing-sale-at-128m-valuation-bloomberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BC Technology may elect to sell parts of OSL's business rather than the whole entity, according to the report, citing people familiar with the matter."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-16T11:40:36.000Z",
    "title": "Bitcoin Edges Towards $28,000 as Grayscale's ETF Hopes Stay Alive",
    "url": "https://decrypt.co/201772/bitcoin-edges-towards-grayscales-etf-hopes-stay-alive",
    "description": "Bitcoin regained a few points early Monday, as Grayscale's hopes of executing an ETF conversion enjoyed a minor legal win late last week."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-16T11:52:37.000Z",
    "title": "Crypto yield platform Haru Invest to suspend server",
    "url": "https://cointelegraph.com/news/crypto-yield-platform-haru-invest-suspend",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/35fc453a-3c91-4616-bc72-33e7b76c97e5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>After halting withdrawals in June 2023, Haru Invest is yet to come up with a timeline to repay its customers.</p>\n                    <p><p>Troubled cryptocurrency platform Haru Invest is planning to suspend its server a few months after halting withdrawals in June 2023.</p><p>Haru Invest is thinking of shutting down its server in order to reduce the server maintenance costs of services, Haru Invest CEO Hugo Lee <a href=\"https://haruinvest.com/blog/announcement-october-16-2023/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> on Oct. 16. The CEO emphasized that the server maintenance cost accounts for the “largest percentage of fixed costs” at Haru Invest and is a priority for the firm.</p><p>“We plan to suspend the service in a few weeks, backing up all member information,” Lee wrote in the announcement, adding that the firm is “yet to have a definite plan” for the server suspension.</p><p>The firm’s move to shut down the server comes as Haru Invest says it's “actively devising various strategies” to lower all costs associated with operating its services, the CEO said. “Some of the current fixed expenditures include the upkeep of Haru Invest services, the cost of workspace like the office, and the cost of communication with our members,” Lee noted.</p><p>The CEO claimed that Haru Invest intends to further lower its operating expenditures in order to maintain as much of the company’s assets as possible. He also promised that these assets will be added to those assets to be distributed to users who have had their money stuck on the platform since June.</p><p>The suspension news has triggered some discontent in the Haru Invest community, with many users arguing that server maintenance likely doesn’t cost a fortune for the firm.</p><p>“Server costs cost nothing,” one disgruntled user <a href=\"https://t.me/HaruInvest/93769\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> on Haru Invest’s Telegram channel, which counts around 3,100 members in total.</p><p>“Servers are gone soon guys, huge costs, 200 USD a month,” another Telegram commenter sarcastically <a href=\"https://t.me/HaruInvest/95931\" target=\"_blank\" rel=\"noopener nofollow\">noted</a>. According to online sources, maintenance costs of running a server for a small to medium business <a href=\"https://www.hostinger.com/tutorials/website-maintenance-cost\" target=\"_blank\" rel=\"noopener nofollow\">range</a> between $35 to $500 per month.</p><p>Lee’s announcement on the upcoming server’s suspension comes a few months after Haru Invest <a href=\"https://cointelegraph.com/news/crypto-yield-platform-haru-suspends-transfers-after-investigation\">terminated deposits and withdrawals</a> on June 13, 2023. The South Korean firm subsequently closed its offices and fired dozens of employees, local news agencies reported.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bybit-suspend-uk-services-following-regulator-warning\"><strong><em>Bybit will suspend services in UK following financial regulator’s ‘final warning’</em></strong></a></p><p>Haru Invest claimed that the issues on its platform were caused by the <a href=\"https://cointelegraph.com/news/haru-invest-files-criminal-complaint-against-consignment-operator\">fraudulent activity of consignment operator B&amp;S Holdings</a>, formerly known as Aventus. Some concerned investors accused the firm of orchestrating a “rug pull,” but <a href=\"https://cointelegraph.com/magazine/hong-kong-crypto-exchanges-do-kwon-jail-korean-crypto-lenders-contagion-asia-express/\">Haru Invest denied the accusations</a>.</p><p>The company CEO <a href=\"https://haruinvest.com/blog/announcement-september-9-2023/\" target=\"_blank\" rel=\"noopener nofollow\">appeared</a> in court in September to address concerns over the company's recent corporate rehabilitation application. Lee said that Haru Invest was cooperating with investigating agencies and working to establish a timeline for recovering users’ assets. As of early October, Haru Invest <a href=\"https://cointelegraph.com/news/bankrupt-cefi-firm-haru-invest-hints-asset-recovery\">hasn’t provided any timeline for recovering the funds</a>.</p><p>Haru Invest is reportedly <a href=\"https://www.koreatimes.co.kr/www/nation/2023/10/602_353102.html\" target=\"_blank\" rel=\"noopener nofollow\">facing a class-action lawsuit</a> together with the major South Korean crypto platform Delio, with disgruntled investors accusing the companies of “fraud.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cuba-bitcoin-revolution-adoption-embargo/\"><strong><em>The Truth Behind Cuba’s Bitcoin Revolution: An on-the-ground report</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-16T11:48:38.000Z",
    "title": "Bitcoin breaks out - but is this to face yet another rejection?",
    "url": "https://cryptodaily.co.uk/2023/10/bitcoin-breaks-out-but-is-this-to-face-yet-another-rejection",
    "description": "Bitcoin and crypto are getting some relief over the last few days. Is the current rally going to break higher? Or will Bitcoin face another rejection of the 200-week moving average?"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-16T11:56:30.000Z",
    "title": "The Most Authoritative Cryptocurrency Mining Platform In 2023",
    "url": "https://cryptodaily.co.uk/2023/10/the-most-authoritative-cryptocurrency-mining-platform-in-2023",
    "description": "CGMD miner is a powerful cryptocurrency mining company that was the first platform to provide easy access to Bitcoin mining."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-16T11:51:45.000Z",
    "title": "US government holds $5.3 billion in Bitcoin reserves",
    "url": "https://www.cryptopolitan.com/us-government-holds-5-3-billion-in-bitcoin-reserves/",
    "description": "Recent data analysis indicates the U.S. government&#8217;s possession of a massive Bitcoin collection, making it one of the biggest holders worldwide. Crypto firm 21. co highlights that, based on meticulous scrutiny of public filings, the government&#8217;s coffers reportedly boast approximately 194,188 BTC. With the current market valuation, this digital treasure trove stands at an estimated ... <a title=\"US government holds $5.3 billion in Bitcoin reserves\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-government-holds-5-3-billion-in-bitcoin-reserves/\" aria-label=\"More on US government holds $5.3 billion in Bitcoin reserves\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-16T12:00:06.000Z",
    "title": "Elliott Wave Theory Forecasts XRP Price Of $27 By 2026: Crypto Analyst",
    "url": "https://www.newsbtc.com/analysis/xrp/elliott-wave-theory-xrp-price-27-by-2026-analyst/",
    "description": "Renowned crypto analyst Egrag presented a compelling Elliott Wave analysis on the potential XRP price trajectory in a tweet today. Drawing attention to the inner workings of the Elliott Wave theory, he highlighted that XRP has entered Wave 3 in recent days, which in particular plays a transformative role in determining the course of asset prices. In Egrag&#8217;s words: “XRP aiming to $27 &#8211; Wave 1 inside Wave 3: Diving into the Elliott Wave theory as we explore the potential for XRP to reach $27! Wave 3 is typically a game-changer in the Elliott Wave theory.&#8221; Elliott Wave Analysis: Wave 3 The crypto analyst further elaborated that Wave 3 emerges as the trend&#8217;s dominant force, outshining other waves in size and influence. This stage often witnesses positive news that prompts fundamental analysts to revise their outlook, giving a boost to upward momentum. Notably, prices tend to shoot up rapidly during this phase, with minimal corrections. Investors who try to enter the market on a pullback often find themselves missing out as the third wave gains traction. At the outset, pessimistic news might still dominate, with most market participants maintaining a bearish stance. However, as Wave 3 unfolds, a significant shift towards bullish sentiment becomes evident among the majority. Related Reading: XRP Price Could Get A Boost, Dip In This Bitcoin Metric Suggests New Rally Deep-diving into the XRP analysis, Egrag points out that the green wave count reflects the Grand Cycle spanning from 2014 to 2018. This cycle commenced with Wave 1 and was succeeded by a corrective Wave 2. &#8220;Presently, XRP finds itself amidst the thrilling currents of Wave 1 within the Grand Cycle&#8217;s Wave 3. Prepare for a fascinating journey ahead!&#8221; he noted. He further elucidated that XRP has adeptly navigated through the initial waves and is now setting its course for the anticipated Wave 3, which he predicts will touch the Fibonacci 1.618 mark at $6.5, followed by a brief correction. The subsequent and concluding phase, Wave 5, according to Egrag&#8217;s analysis, will propel the XRP price to a staggering $27. A Deep-Dive Into Egrag&#8217;s XRP Price Chart Egrag’s analysis delineates the intricate voyage of the XRP price through the conceptual lenses of the Elliott Wave theory. The chart starts its narrative in March 2020, when the subordinate Wave 1 began. This initial phase witnessed XRP escalating to a prominent peak of $1.96, buoyed by a favorable outcome in Ripple&#8217;s legal battle with the US Securities and Exchange Commission (SEC). Subsequent to the apex of Wave 1, the chart navigates through a territory marked by correction, which is dubbed Wave 2. In this segment, the XRP price experienced a pullback and dropped to a low of $0.4313. This corrective phase, although incisive, respects the sanctity of Elliott wave norms by not falling below the initial point of Wave 1. Related Reading: How Low Can XRP Price Go Before It Skyrockets To $5? Analyst Forecasts With the transition into the Wave 3 area, bullish momentum is currently starting to build up. Egrag, with a combination of analysis and foresight, expects the XRP price to rise beyond the zenith of Wave 1 and target the Fibonacci extension of 1.618, valued at around $6.57. This upside, plotted on Egrag&#8217;s chart, is expected to end sometime in 2024 or 2025. Wave 4, as described by Egrag, provides for a corrective move following the upswing of Wave 3. At this point, the XRP price is expected to drop heavily and find support at $1.96, which interestingly mirrors the peak of Wave 1. In Egrag&#8217;s chart, Wave 5 emerges as the pinnacle of the bull market. In this decisive phase, the analyst projects his most audacious forecast for the XRP price trajectory. Anticipating a monumental bull surge in 2025, he envisions XRP oscillating between Fibonacci extension levels of 2.272 and 2.414, corresponding to price points of $23.63 and $31.20. Egrag, averaging the values, subsequently forecasts a price target of $27 for XRP. At press time, XRP traded at $0.4934. Featured image from Figma, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-16T12:03:16.000Z",
    "title": "New Meme Coins and New Cryptocurrency Tokens | Complete Guide to the Hottest New Cryptocurrencies of 2023 including Wall Street Memes, Shiba Inu, ApeMax, and More",
    "url": "https://www.crypto-news-flash.com/new-meme-coins-and-new-cryptocurrency-tokens-complete-guide-to-the-hottest-new-cryptocurrencies-of-2023-including-wall-street-memes-shiba-inu-apemax-and-more/?utm_source=rss&utm_medium=rss&utm_campaign=new-meme-coins-and-new-cryptocurrency-tokens-complete-guide-to-the-hottest-new-cryptocurrencies-of-2023-including-wall-street-memes-shiba-inu-apemax-and-more",
    "description": "<img width=\"512\" height=\"287\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-49.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-49.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-49-300x168.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The digital frontier of cryptocurrency is in perpetual motion, constantly birthing novel tokens that captivate audiences with innovation, unique specificities, and occasionally, humor. 2023 is no exception, as a slew of new meme coins and cryptocurrencies enter the limelight, vying for the spotlight. As the crypto community buzzes with excitement, one name, ApeMax, repeatedly echoes [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-16T11:49:55.000Z",
    "title": "Chainlink (LINK) Remains Resilient: Despite Volatility, It’s Still a ‘Buy the Dips’ Asset",
    "url": "https://www.crypto-news-flash.com/chainlink-link-remains-resilient-despite-volatility-its-still-a-buy-the-dips-asset/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-link-remains-resilient-despite-volatility-its-still-a-buy-the-dips-asset",
    "description": "<img width=\"1038\" height=\"612\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Airchains has joined Chainlink&#039;s BUILD program, aiming to accelerate appchains and rollup technology adoption. \" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-300x177.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-1024x604.png 1024w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />Chainlink (LINK) price action has to rally beyond the resistance level between $8 and $9.4 in order to ensure a macro-bullish continuation in the coming months after more than a year of horizontal consolidation. With a notable spike in Chainlink whale activity over the weekend, Rekt Capital analysts believe an imminent macro breakout is on [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-16T11:45:17.000Z",
    "title": "Bitcoin Mining Reaches New Heights of Difficulty",
    "url": "https://www.crypto-news-flash.com/bitcoin-mining-reaches-new-heights-of-difficulty/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-mining-reaches-new-heights-of-difficulty",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-51.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-51.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-51-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Bitcoin flirts with $28,000 as its mining challenge surges to unprecedented levels. Ray Dalio&#8217;s grim prediction of &#8220;World War III&#8221; adds a somber undertone to the week&#8217;s crypto discourse. Bitcoin Mining: Scaling Unprecedented Peaks The world of Bitcoin (BTC) has witnessed yet another significant development. As the premier cryptocurrency approaches the $28,000 mark, its mining [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-16T12:01:49.000Z",
    "title": "Coinbase’s Best Investments in 2023 – Part 2",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/coinbase-best-investments-in-2023-part-2/",
    "description": "<p>Tracking VC investments can be highly profitable in any market condition. And among the key VCs, Coinbase Ventures takes center stage. This article marks the third segment of our comprehensive four-part series. Let&#8217;s dive in Coinbase&#8217;s best investments! Here is the first part of the article series. Coinbase as a VC Coinbase Ventures, the investment [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/coinbase-best-investments-in-2023-part-2/\">Coinbase&#8217;s Best Investments in 2023 &#8211; Part 2</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-16T12:07:00.000Z",
    "title": "Paradigm Backs Binance, Asks Court to Dismiss SEC Ongoing Lawsuit",
    "url": "https://coinedition.com/paradigm-backs-binance-asks-court-to-dismiss-sec-ongoing-lawsuit/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/What_does_Binances_Proof_of_Reserve_PoR_report_tell_us_from_an.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BlockSec Asks Binance Coinbase and MEXC to Help Phishing Victims\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/What_does_Binances_Proof_of_Reserve_PoR_report_tell_us_from_an.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/What_does_Binances_Proof_of_Reserve_PoR_report_tell_us_from_an-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/What_does_Binances_Proof_of_Reserve_PoR_report_tell_us_from_an-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/What_does_Binances_Proof_of_Reserve_PoR_report_tell_us_from_an-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/What_does_Binances_Proof_of_Reserve_PoR_report_tell_us_from_an-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/What_does_Binances_Proof_of_Reserve_PoR_report_tell_us_from_an-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A recent court filing revealed Crypto investment firm Paradigm filed an amicus brief to challenge the U.S. Securities and Exchange Commission’s lawsuit against cryptocurrency Exchange Binance. Paradigm’s move follows a similar filing by the company in late September in the ongoing case. Notably, Paradigm claims the U.S. Securities and Exchange Commission’s categorization of crypto token [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/paradigm-backs-binance-asks-court-to-dismiss-sec-ongoing-lawsuit/\">Paradigm Backs Binance, Asks Court to Dismiss SEC Ongoing Lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-16T11:43:00.000Z",
    "title": "Are Meme Coins Staging a Comeback? PEPE, DOGE, SHIB on the Rise",
    "url": "https://coinedition.com/are-meme-coins-staging-a-comeback-pepe-doge-shib-on-the-rise/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Meme-Coins-Eventually-Go-To-Zero.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Meme Coins Eventually Go To Zero\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Meme-Coins-Eventually-Go-To-Zero.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coins-Eventually-Go-To-Zero-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coins-Eventually-Go-To-Zero-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coins-Eventually-Go-To-Zero-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coins-Eventually-Go-To-Zero-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coins-Eventually-Go-To-Zero-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Amidst a recent surge in major cryptocurrency prices, the popular meme coin token PEPE also recorded a significant uptick, wiping off some of the losses it accumulated over the week. With the token still in the green zone, many wonder if it will sustain that performance until year-end. Particularly, data from CoinMarketCap shows that PEPE [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/are-meme-coins-staging-a-comeback-pepe-doge-shib-on-the-rise/\">Are Meme Coins Staging a Comeback? PEPE, DOGE, SHIB on the Rise</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-16T11:45:17.000Z",
    "title": "SEC Chair Gary Gensler Standing in the Way of Bitcoin ETFs, Says ARK Invest’s Cathie Wood",
    "url": "https://dailyhodl.com/2023/10/16/sec-chair-gary-gensler-standing-in-the-way-of-bitcoin-etfs-says-ark-invests-cathie-wood/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-and-Precious-Metals.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-and-Precious-Metals.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-and-Precious-Metals.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-and-Precious-Metals.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-and-Precious-Metals.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-and-Precious-Metals.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-and-Precious-Metals.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The chief executive of ARK Invest says that the Chair of the U.S. Securities and Exchange Commission (SEC) is getting in the way of a spot market Bitcoin (BTC) exchange-traded fund (ETF). In a new interview with crypto influencer Natalie Brunell, ARK Invest CEO Cathie Wood says that factions of SEC are actually very knowledgeable [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/16/sec-chair-gary-gensler-standing-in-the-way-of-bitcoin-etfs-says-ark-invests-cathie-wood/\">SEC Chair Gary Gensler Standing in the Way of Bitcoin ETFs, Says ARK Invest’s Cathie Wood</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]