[
  {
    "source": "CryptoGlobe",
    "date": "2023-11-15T01:00:00.000Z",
    "title": "Institutional Investors Pour $293 Million into Bitcoin, Ethereum, Solana, and Cardano Products",
    "url": "https://www.cryptoglobe.com/latest/2023/11/institutional-investors-pour-293-million-into-bitcoin-ethereum-solana-and-cardano-products/",
    "description": "Over the past week cryptocurrency investment products saw a total of $293 million in inflows, bringing their 7-week inflows over the $1 billion mark. Beyond BTC and ETH, investment products focusing on Solana (SOL) and Cardano (ADA) saw significant inflows, while other altcoins saw outflows. According to CoinShares’ latest Digital Asset Fund Flows report, Bitcoin-focused […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-15T00:40:31.000Z",
    "title": "The Future of AI-Agents is Decentralized: Delysium and Microsoft Partner to Mainstream AI on Blockchain",
    "url": "https://cryptodaily.co.uk/2023/11/the-future-of-ai-agents-is-decentralized-delysium-and-microsoft-partner-to-mainstream-ai-on-blockchain",
    "description": "The Future of AI-Agents is Decentralized: Delysium and Microsoft Partner to Mainstream AI on Blockchain"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-15T01:00:42.000Z",
    "title": "Kevin O’Leary Warns Spot Bitcoin ETF Approval Could Be 18 Months Away",
    "url": "https://news.bitcoin.com/kevin-oleary-warns-spot-bitcoin-etf-approval-could-be-18-months-away/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/kevin-oleary-bitcoin-etf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Kevin O&#039;Leary Warns Spot Bitcoin ETF Approval Could Be 18 Months Away\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/kevin-oleary-bitcoin-etf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/kevin-oleary-bitcoin-etf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/kevin-oleary-bitcoin-etf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/kevin-oleary-bitcoin-etf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/kevin-oleary-bitcoin-etf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/kevin-oleary-bitcoin-etf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/kevin-oleary-bitcoin-etf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Shark Tank investor Kevin O&#x2019;Leary, aka Mr. Wonderful, has cautioned that it could take another year and a half for the U.S. Securities and Exchange Commission (SEC) to approve a spot bitcoin exchange-traded fund (ETF). He emphasized that we will not see a spot bitcoin ETF in the U.S. until there is a crypto exchange [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-15T01:00:17.000Z",
    "title": "Chainlink Declines 6%: Rally Over Or Is There More To Go?",
    "url": "https://www.newsbtc.com/chainlink-news/chainlink-declines-5-rally-over-there-more-go/",
    "description": "The Chainlink rally has slowed down recently; here&#8217;s what the various LINK on-chain metrics look like to see if the surge has hope of a restart. Chainlink Has Registered Some Drawdown In The Past 24 Hours Just during the weekend, Chainlink had been floating above the $16 mark, but winds seem to have shifted for the coin in the past couple of days, as it has registered some drawdown. During the last 24 hours alone, LINK has dropped around 6%, leading to its price slipping below the $14 level. The chart below shows how the cryptocurrency has performed in the past month. LINK appears to have gone down in the last two days &#124; Source: LINKUSD on TradingView As displayed above, Chainlink had been riding some sharp bullish momentum in this period before this latest plunge, as the asset had more than doubled in value. Despite the decline, LINK is still up over 90% in the past month, which is an impressive return. Related Reading: Bitcoin Could Plunge To $30,200 If This Level Is Lost: Analyst Naturally, the investors may be wondering now if the asset has already hit its peak for this rally or if there is more to come shortly. It&#8217;s hard to say anything about that, but perhaps on-chain data could provide some hints. LINK Activity Has Been Relatively High Recently In a new post on X, the market intelligence platform IntoTheBlock has shared the data of some Chainlink on-chain indicators. First, when the firm made the post, about 56% of the asset&#8217;s investors were sitting on some profit. Looks like 39% of the holders had been underwater &#124; Source: IntoTheBlock on X The cryptocurrency had then been floating at higher levels than currently (although not too high), so more LINK addresses would have entered a state of loss by now. Generally, investors in profit are more likely to sell at any point, so a large amount of them being in the green could raise the probability of a selloff. Some Chainlink investors are currently harvesting their profits, but the profitability ratio is still not skewed that much towards profits. Next, IntoTheBlock has talked about the number of transactions on the network. The value of the metric seems to have been going up recently &#124; Source: IntoTheBlock on X &#8220;The Chainlink network is showing many positive signs in terms of transaction data,&#8221; says the intelligence platform. &#8220;Notably, we see a healthy increase in the number of transactions.&#8221; The number of transactions is up 436% from the monthly lows, and as is usually the case, the volume has also spiked alongside this rise. LINK volume hit $515 million last week &#124; Source: IntoTheBlock on X The transaction activity being high suggests there is interest behind the asset, and so, the price action shouldn&#8217;t go stale just yet. However, the volatility due to this activity can go either way, as the asset is already witnessing. Related Reading: Chainlink Forms Sell Signal, Analyst Predicts Pullback To This Level A metric that could more solidly point at a direction for the cryptocurrency is the large holder netflow, which keeps track of the net accumulation/distribution behavior over the last month for LINK holders carrying more than 1% of the supply. The metric's value has been positive recently &#124; Source: IntoTheBlock on X As is visible in the chart, the large Chainlink holders have been buying recently, which could potentially be a positive sign for the asset. This doesn&#8217;t have to mean that the rally would restart shortly, of course, but it does provide some support for the idea. Featured image from Shutterstock.com, charts from TradingView.com, IntoTheBlock.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-15T01:00:10.000Z",
    "title": "Trader Says Polygon on the Cusp of New Uptrend, Predicts Rallies for THORChain and Ocean Protocol",
    "url": "https://dailyhodl.com/2023/11/14/trader-says-polygon-on-the-cusp-of-new-uptrend-predicts-rallies-for-thorchain-and-ocean-protocol/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/polygon-cusp-new-uptrend.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/polygon-cusp-new-uptrend.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/polygon-cusp-new-uptrend.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/polygon-cusp-new-uptrend.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/polygon-cusp-new-uptrend.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/polygon-cusp-new-uptrend.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/polygon-cusp-new-uptrend.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto trader has a long-term bullish outlook on the blockchain scaling solution Polygon (MATIC) as well as two additional altcoins. The pseudonymous digital asset analyst known as Rekt Capital tells his 368,100 followers on the social media platform X that MATIC is &#8220;on the cusp of entering a new macro uptrend&#8221; after taking [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/14/trader-says-polygon-on-the-cusp-of-new-uptrend-predicts-rallies-for-thorchain-and-ocean-protocol/\">Trader Says Polygon on the Cusp of New Uptrend, Predicts Rallies for THORChain and Ocean Protocol</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]