[
  {
    "source": "CoinDesk",
    "date": "2023-11-16T05:30:21.000Z",
    "title": "South Korea's Pension Fund Bought $20M Coinbase Shares in Q3, Made 40% Profit: Report",
    "url": "https://www.coindesk.com/business/2023/11/16/south-koreas-pension-fund-bought-20m-coinbase-shares-in-q3-made-40-profit-report/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The fund snapped up COIN at an average price of $70.5 in the third quarter, achieving a 40% profit from investment."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T05:12:56.000Z",
    "title": "Solana hoses down ‘inaccurate’ CertiK report on Saga phone security flaws",
    "url": "http://cointelegraph.com/news/solana-dismisses-certik-saga-phone-security-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/904a0711-52e8-429f-b456-e2cd90e18bbc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>CertiK claims Solana’s Saga smartphone contains a critical “bootloader vulnerability” — Solana Labs says the claims are entirely inaccurate.</p>\n                    <p><p>A recent video from blockchain security firm CertiK made a series of “inaccurate” claims about a potential security vulnerability in Solana’s crypto-enabled Saga phone, Solana Labs has said. </p><p>In a Nov. 15 post on X (formerly Twitter), CertiK claimed the Saga phone contained a “critical vulnerability” known as a “bootloader unlock” attack which would supposedly allow a malicious actor to install a hidden backdoor in the phone. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Ever wondered about the security of your Web3 devices? <br><br>Our newest exploration reveals a significant bootloader vulnerability in the Solana Phone, a challenge not just for this device but for the entire industry. Our commitment to enhancing security standards is unwavering. … <a href=\"https://t.co/lHZ5W7hXzy\">pic.twitter.com/lHZ5W7hXzy</a></p>&mdash; CertiK (@CertiK) <a href=\"https://twitter.com/CertiK/status/1724774322324062524?ref_src=twsrc%5Etfw\">November 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In a report sent to Cointelegraph, CertiK claimed the bootloader unlock would “allow an attacker with physical access to a phone to load custom firmware containing a root backdoor.”</p><p>“We demonstrate that this can compromise the most sensitive data stored on the phone, including cryptocurrency private keys,” CertiK’s report said. </p><p>However, a Solana Labs spokesperson told Cointelegraph that CertiK’s claims are inaccurate, and its video did not reveal any legitimate threat to the Saga device. </p><blockquote>“The CertiK video does not reveal any known vulnerability or security threat to Saga holders.”</blockquote><p>Android’s internal Open Source Project <a href=\"https://source.android.com/docs/core/architecture/bootloader/locking_unlocking\" target=\"_blank\" rel=\"noopener nofollow\">documentation</a> shows unlocking a bootloader can be performed across a wide range of Android devices.</p><p>Solana Labs said to unlock the bootloader and install custom firmware, an attacker would have to go through multiple steps, which can only be performed after unlocking the device with the user’s passcode or fingerprint. </p><p>“Unlocking the bootloader wipes the device, which users are alerted about multiple times when unlocking the bootloader, so it’s not a process that can take place without users’ active participation or awareness,” Solana Labs said. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/making-real-world-blockchain-solutions-possible-solana-co-founder-raj-gokal\"><strong><em>Making real-world blockchain solutions possible — Solana co-founder Raj Gokal</em></strong></a></p><p>Additionally, if anyone proceeds to unlock the bootloader on an Android device, they’re subjected to a series of warnings about the implications of the process.</p><p>If they ignore these warnings, the device will be wiped along with their private keys.</p><p>The Solana Saga phone was <a href=\"https://cointelegraph.com/news/solana-smartphone-saga-triggers-mixed-reactions-from-crypto-community\">released in April 2022</a> for a $1,099 price tag. The phone offers a Web3-native DApp store in a bid to integrate crypto apps into tech hardware.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In April, we introduced Saga with a clear vision: to put web3 at your fingertips. We continue to work to bring more people into the ecosystem and drive web3’s mobile future. Today, we are reducing the price of Saga to $599.<br><br>Over the past four months, Saga users embraced the… <a href=\"https://t.co/qpC1BHiqZ7\">pic.twitter.com/qpC1BHiqZ7</a></p>&mdash; Solana Mobile  (@solanamobile) <a href=\"https://twitter.com/solanamobile/status/1689305794049634304?ref_src=twsrc%5Etfw\">August 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Four months after launch, however, Solana slashed its price to $599 — following a steep <a href=\"https://flipsidecrypto.xyz/kiryl_sol/q/teMJ5GbI42zi/saga-genesis-tokens-chart\" target=\"_blank\" rel=\"noopener nofollow\">decline</a> in sales.</p><p>CertiK did not immediately respond to a request for comment on Solana Labs' rebuttal.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/i-spent-a-week-working-in-vr-it-was-mostly-terrible-however/\"><strong><em>I spent a week working in VR. It was mostly terrible, however…</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-16T05:38:15.000Z",
    "title": "SOL Price Rallies Over 50% In Few Days But Uptrend Is Far From Over",
    "url": "https://www.newsbtc.com/analysis/sol-price-rallies-over-50-to-68/",
    "description": "Solana rallied above the $60 resistance against the US Dollar. SOL price is up over 50% in a few days and might continue to rise toward the $75 level. SOL price started a major rally above the $55 resistance against the US Dollar. The price is now trading above $60 and the 100 simple moving average (4 hours). There is a major bullish trend line forming with support near $55.00 on the 4-hour chart of the SOL/USD pair (data source from Kraken). The pair could continue to move up if it clears the $68.00 resistance zone. Solana Price Regains Strength In the past few days, Solana saw a major rally above the $50 level. SOL gained bullish momentum after it settled above $50, outperforming Bitcoin and Ethereum. The price is up over 50% in a few days and the bulls are not done yet. The recent move took the price above the $65 level. A high is formed near $67.21 and the price is now consolidating gains. It is showing positive signs above the 23.6% Fib retracement level of the upward move from the $51.23 swing low to the $67.21 high. SOL is now trading above $60 and the 100 simple moving average (4 hours). There is also a major bullish trend line forming with support near $55.00 on the 4-hour chart of the SOL/USD pair. Source: SOLUSD on TradingView.com On the upside, immediate resistance is near the $67.20 level. The first major resistance is near the $68.00 level. A successful close above the $65.00 resistance could set the pace for a larger increase. The next key resistance is near $70.00. Any more gains might send the price toward the $75.00 level. Are Dips Supported in SOL? If SOL fails to recover above the $68.00 resistance, it could start a downside correction. Initial support on the downside is near the $62.50 level. The first major support is near the $57.75 level or the 61.8% Fib retracement level of the upward move from the $51.23 swing low to the $67.21 high, below which the price could test the trend line. If there is a close below the $55.00 support, the price could decline toward the $50.00 support in the near term. Technical Indicators 4-Hours MACD – The MACD for SOL/USD is losing pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $62.50, and $57.75. Major Resistance Levels – $68.00, $70.00, and $75.00."
  }
]