[
  {
    "source": "CoinDesk",
    "date": "2023-06-30T19:16:49.000Z",
    "title": "Applied Digital Stock Surges 12% After Announcing Its Third AI Deal",
    "url": "https://www.coindesk.com/business/2023/06/30/applied-digital-stock-surges-12-after-announcing-its-third-ai-deal/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Applied Digital will be deploying HPE's Cray XD supercomputers in its AI cloud service."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-30T19:30:00.000Z",
    "title": "Crypto VC is struggling only from a North American perspective — Animoca Brands CEO  ",
    "url": "https://cointelegraph.com/news/crypto-vc-is-struggling-only-from-a-north-american-perspective-animoca-brands-ceo",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/4768511c-8d97-4fb1-a549-528ac62c6af3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Speaking with Cointelegraph at the Collision Conference, in Toronto, crypto veteran Yat Siu outlined how crypto firms can cope with unique environments, stressing that it is not \"as bad as it sounds\".  </p>\n                    <p><p>The crypto space has been in an uneven state around the world, with Web3 startups flourishing in the Middle East and Asia, while North American crypto entrepreneurs face challenges under tough macroeconomic and regulatory conditions, according to Animoca Brands CEO Yat Siu. </p><p>Speaking with Cointelegraph at the Collision Conference, in Toronto, Siu highlighted the main differences between the environment for crypto businesses worldwide, stressing that it is not \"as bad as it sounds\". </p><p>According to him, Web3 startups can still raise funding from venture firms, but current conditions like higher interest rates across the globe along with a downturn in crypto assets prices have raised the bar for newcomers.</p><p>\"Valuations have come down, obviously, but the number of builders entering the space, the number of smart contracts being deployed, the number of people still on the increase. Generally, we're very bullish,\" he noted, adding that Animoca had added nearly 60 investments to its portfolio in the past months. </p><p>Despite being active, the space isn't as strong as it used to be. According to a recent PitchBook’s Crypto Report for the first quarter of 2023, crypto companies<a href=\"https://cointelegraph.com/news/crypto-venture-capital-investment-q1-2023-report-pitchbook\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-venture-capital-investment-q1-2023-report-pitchbook/amp\"> raised $2.6 billion across 353 investment rounds</a>. Deal value decreased 11% quarter-over-quarter and total deal value decreased 12.2%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/f96fa129-361d-453c-a38a-142f9a39c425.png\"><figcaption style=\"text-align: center;\"><em>Venture capital activity across various quarters. Source: PitchBook </em></figcaption></figure><p>Siu's comments come on the heels of major developments affecting the crypto space since FTX's dramatic collapse in November 2022. In the United States, for instance, the Securities and Exchange Commission launched a crackdown on crypto firms in an attempt to regulate the industry through enforcement actions. </p><p>In contrast, Hong Kong has implemented a licensing system for crypto businesses in order to mitigate the risks associated with the digital asset markets. The United Kingdom took a similar approach, approving a legislation that gives regulators power to introduce and enforce regulations for crypto businesses.</p><p>\"If you are thinking from a North American perspective [about crypto VC], it might sound bad. When you go to the Middle East, Asia, actually it's very vibrant,\" noted Siu. According to the CEO, the regulatory aspect has been a \"hammer\" on Web3 companies. \"It's creating a lot of fear because people don't know what is going on,\" he continued.</p><p>The veteran crypto entrepreneur doesn't believe in coincidences when it comes to the different approaches countries are taking to the industry. For Siu, favorable environments in Asian nations and hostile movements in the U.S. are part of the country' agendas for emerging technology.</p><p>\"Pushing Web3 as a narrative is also about the national interest above and beyond, sort of the end user interest for self sovereign identity. And the US is doing everyone a favor. Sadly, though, because I think the US is important in this [...] Because of political reasons, they are leaving it in the hands of other places around the world to have a role. But the exciting side is it allows for ecosystems to flourish that never could before.\"</p><p><a href=\"https://cointelegraph.com/magazine/crypto-city-guide-sydney-harbor-bridge-synthetix-finder/\"><strong><em>Crypto City guide to Sydney: More than just a ‘token’ bridge</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T19:15:34.000Z",
    "title": "US Senator urges tech companies to label and monitor AI-generated contents",
    "url": "https://www.cryptopolitan.com/us-senator-urge-monitor-ai-generated-content/",
    "description": "In a recent development, US Senator Michael Bennet has called on major tech companies, including OpenAI, Microsoft Meta, Twitter, and Alphabet, to label AI-generated content and monitor the spread of misleading information. In a letter addressed to the executives of these companies, Bennet emphasized the importance of transparency for users, urging them to be aware ... <a title=\"US Senator urges tech companies to label and monitor AI-generated contents\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-senator-urge-monitor-ai-generated-content/\" aria-label=\"More on US Senator urges tech companies to label and monitor AI-generated contents\">Read more</a>"
  }
]