[
  {
    "source": "Decrypt",
    "date": "2024-04-02T20:32:49.000Z",
    "title": "Ethena Just Launched to a $1.2 Billion Market Cap—Here’s What You Need to Know",
    "url": "https://decrypt.co/224494/ethena-ena-usde-susde-launch",
    "description": "The ENA governance token from Ethena Labs, along with USDe, have a controversial history, but that hasn’t held back billions in backing from investors and traders."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-02T20:38:01.000Z",
    "title": " Meet the Solana memecoin that suffered two rug pulls but still survived ",
    "url": "https://cointelegraph.com/news/meet-the-solana-meme-coin-that-suffered-two-rug-pulls-but-still-survived",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMWE0M2Y0ZWYtZjVmNy00ZGQwLTliYmItMDFlMjNkOTRmZDgyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Catwifhat’s first and second development teams dumped all of their tokens and disappeared, yet the token managed to bounce back. </p>\n                    <p><p data-ct-non-breakable=\"true\">While most exit scams or rug pulls result in the collapse of a project, Solana-based memecoin Catwifhat (CIF) managed to survive two of them, illustrating how crypto’s decentralized nature can sometimes allow a project to continue even when its developer disappears.</p><p>In a conversation with Cointelegraph, Catwifhat investor NFT_Sloth claimed that the project survived two rug pulls over 12 days, yet still has a dedicated community behind it today. </p><p>First, the project’s founder allegedly dumped their tokens into the open market only a few hours after launch on Dec. 12, 2023, cashing in 20% of WIF’s supply for 3.86 SOL (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) (worth approximately $265 at the time) and pulling most of its liquidity. Despite this setback, the remaining investors quickly took over the project, forming a new dev team to promote the token. As a result, CIF recovered to a market cap of more than $4 million by Dec. 23, just 11 days after it had been rugged. </p><p><a href=\"https://cointelegraph.com/news/meet-the-solana-meme-coin-that-suffered-two-rug-pulls-but-still-survived\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-02T20:25:59.000Z",
    "title": " Argentine government passes registration requirements for crypto firms ",
    "url": "https://cointelegraph.com/news/argentina-registration-law-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvNTYyOWY2MDItNjNkZS00M2VhLWFjZGItOGU5ODczZjFhNmMyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Comisión Nacional de Valores President Roberto Silva said virtual asset service providers that are not registered “will not be able to operate“ in Argentina.</p>\n                    <p><p>Argentina’s government has begun implementing requirements for cryptocurrency exchanges to operate legally in the country.</p><p>In a March 25 announcement, Argentina’s Comisión Nacional de Valores (CNV) — the country’s equivalent of a securities regulator — <a href=\"https://www.argentina.gob.ar/noticias/la-cnv-crea-el-registro-de-proveedores-de-servicios-de-activos-virtuales-psav\" target=\"_blank\" rel=\"noopener nofollow\">said</a> virtual asset service providers would be operating in accordance with recommendations from the Financial Action Task Force (FATF). Certain companies offering crypto-related services must register with the Argentina government as part of reforms to the country’s Anti-Money Laundering (AML) and Combatting the Financing of Terrorism (CFT) laws.</p><p>The implementation of the law affecting crypto providers in Argentina <a href=\"https://twitter.com/SenadoArgentina/status/1768328967302398385\" target=\"_blank\" rel=\"noopener nofollow\">moved</a> forward on March 14, when the country’s senate approved modifying laws aimed at preventing money laundering and the financing of terrorism. CNV President Roberto Silva said virtual asset service providers that are not registered “will not be able to operate in the country.”</p><p><a href=\"https://cointelegraph.com/news/argentina-registration-law-crypto\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-02T20:28:09.000Z",
    "title": "Dexed.io is the new portuguese platform that predicts the future and indicates the next cryptocurrency to invest in",
    "url": "https://cryptodaily.co.uk/2024/04/dexedio-is-the-new-portuguese-platform-that-predicts-the-future-and-indicates-the-next-cryptocurrency-to-invest-in",
    "description": "Coinscribble - April 2, 2024 / Portuguese tech startup Dexed is launching a decentralised trading platform (DEX) that operates on the Ethereum blockchain"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-02T20:30:08.000Z",
    "title": "Chief Investment Officer confirms lack of crypto appetite among Goldman Sachs clients",
    "url": "https://www.cryptopolitan.com/cio-crypto-appetite-among-goldman-sachs-clients/",
    "description": "Goldman Sachs, one of the major Wall Street banks, remains skeptical about cryptocurrency, as it claims that digital assets are not an investment class. This perspective was even more clearly substantiated by Sharmin Mossavar-Rahmani, the Chief Investment Officer of the bank’s Wealth Management unit, in a recent interview with the Wall Street Journal, stating that [&#8230;]"
  }
]