[
  {
    "source": "NewsBTC",
    "date": "2024-04-02T01:00:40.000Z",
    "title": "Litecoin Soars Above $110 As LTC Breaks Out Of Macro Downtrend: Analysts",
    "url": "https://www.newsbtc.com/news/litecoin-soars-above-110-as-ltc-breaks-out-of-macro-downtrend-analysts/",
    "description": "Litecoin (LTC) has shown a notable performance in the first quarter of the year, reaching over 30 million transactions by March 30. Last year, this feat was achieved around July when LTC traded at around $113. The US Commodity Futures Trading Commission (CFTC) recently classified Litecoin as a commodity alongside Bitcoin and Ethereum. The designation and rumors of a Litecoin exchange-traded fund (ETF) sparked bullish sentiment. Analysts and investors have forecasted a strong performance for the token. Related Reading: Litecoin ETF Rumors Fuel 10% Surge As Institutions Hint At Interest Is Litecoin Out Of The Woods? Litecoin surged 10% last week, seemingly fueled by the positive sentiment from its community. As a result, the token rose above $100 and tested its resistance above the $105 level. Crypto analyst Rekt Capital confirmed that, as April 1st started, LTC officially broke the macro downtrend for the first time since April 2021. $LTC Litecoin has Monthly Closed above the Downtrend It is confirmed The Macro Downtrend has been broken for the first time since April 2021 The Macro Downtrend is now officially over#LTC #Crypto #Litecoin https://t.co/yU7Gz7X1ck pic.twitter.com/ktgOYKTarz &#8212; Rekt Capital (@rektcapital) April 1, 2024 According to the analyst, after successfully retesting its multi-year macro downtrend and turning it into a new support level, the token had to stay above the $94 price range to confirm the end of the trend. LTC closed the month above these levels. The token’s price soared past $110 for the second time this year. Nonetheless, the price didn’t hold for long, as it immediately faced a correction and dropped back to the $105-106 range. After the correction, analyst The Cryptonomist suggested in an X post that if LTC’s price gets a “clean break” above this level, investors could “comfortably see” the price surge to $200. Moreover, crypto investor Crypto Surf pointed out that Litecoin “managed to close at or slightly above the 200-week,” considering it a “not bad” performance. In the charts, Crypto Surf highlights key points from the token’s performance from 2017-2021 and 2021-2024. $LTC did actually manage to close at or slightly above the 200 week MA 😅 Let&#39;s see what these new quarter, month and week bring us⌛️ For now, we&#39;re above the meme lines, so not bad. https://t.co/xqTDWet7tv pic.twitter.com/GT3asJBQF2 &#8212; Surf (@_CryptoSurf) April 1, 2024 The $146 pre-halving top of Litecoin’s second halving event was surpassed approximately three months after breaking out of its 200-week moving average (MA). This breakout was followed by LTC’s all-time high (ATH) of $410 in 2021. After Litecoin’s third halving event, LTC’s pre-halving top reached the $115 price range. This top was tested and almost matched today when the token traded at $112. The charts suggest that, if history repeats itself, LTC’s price could be testing higher resistance levels and a new ATH in the coming months. However, market dynamics and external events could hinder the token’s potential targets. Was LTC’s Rise To $112 An April’s Fool Day Prank? After briefly reaching its highest price of the year, LTC faced a correction that shredded the gains registered over the weekend. The token closed its March monthly candle above important metrics and has resisted above $100 during the past three days. Despite this, the price dipped below that important support zone. LTC has hovered around the $98-99 price range for the past hour. This drop represents a 3.8% decrease from LTC’s price 24 hours ago and a 76.4% dip from its ATH. However, Litecoin’s LTC continues to register green numbers over longer timeframes. LTC has increased 8.8% and 8.9% in the weekly and monthly timeframes. More notably, the token had a 19.9% biweekly surge. Similarly, its daily trading volume has significantly surged by 186.5%, reaching $1.61 billion in the past 24 hours. LTC ranks as the 19th largest cryptocurrency by market capitalization, according to CoinMarketCap data. At the time of writing, Litecoin is trading at $99.13. Related Reading: From $90 To $400 Litecoin: Analysts Bullish On LTC Soaring Trajectory Litecoin is trading at $99.13 in the 3-day chart. Source: LTCUSDT on Tradingview.com  Featured Image from Unsplash.com, Chart from TradingView.com"
  }
]