[
  {
    "source": "CoinDesk",
    "date": "2023-06-28T16:20:00.000Z",
    "title": "This Free-to-Mint Soulbound NFT Tracks Your Web3 Work History",
    "url": "https://www.coindesk.com/web3/2023/06/28/this-free-to-mint-soulbound-nft-tracks-your-web3-work-history/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Digital community platform Coordinape is rolling out CoSoul, which allows users to create a digital resume on-chain."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-28T16:18:33.000Z",
    "title": "FTX Sues Ex-Compliance Chief Over 'Hush Money' Payments",
    "url": "https://decrypt.co/146566/ftx-sues-ex-compliance-chief-for-hush-money-payments",
    "description": "Daniel Friedberg allegedly helped hold together a “house of cards” at the behest of FTX insiders."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-28T16:15:10.000Z",
    "title": "You Can Now Earn Bitcoin for Playing This Candy Crush Clone",
    "url": "https://decrypt.co/146510/you-can-now-earn-bitcoin-playing-candy-crush-clone",
    "description": "REVIEW: Sweet Bitcoin won’t win any awards for originality, but it’s a fun iOS and Android game with real crypto earnings."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-28T16:27:00.000Z",
    "title": "Bitcoin ETF race gets hotter as ARK Invest adds surveillance agreement to application",
    "url": "https://cointelegraph.com/news/bitcoin-etf-race-gets-hotter-as-ark-invest-adds-surveillance-agreement-to-application",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/16053b7d-0d7d-4952-b177-61bbef30239d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>ARK Invest and 21Shares' third application for a spot Bitcoin ETF now includes a surveillance sharing agreement.</p>\n                    <p><p>ARK Investment Management has<a href=\"https://cdn.cboe.com/resources/regulation/rule_filings/pending/2023/SR-CboeBZX-2023-028-Amendment-No-1.pdf\" target=\"_blank\" rel=\"noopener nofollow\"> amended</a> its spot Bitcoin exchange-traded fund (ETF) application with the U.S. Securities and Exchange Commission (SEC), making it similar to BlackRock's recent filing. </p><p>The amendments include a surveillance sharing agreement with the Chicago Mercantile Exchange (CME) futures markets and crypto exchange, most \"likely Coinbase\", said Bloomberg's ETF analyst Eric Balchunas on Twitter.</p><p>In the race for the first Bitcoin ETF in the United States, ARK's filing update puts it ahead of its competitors. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">JUST IN: ARK has amended their 19b-4 for spot bitcoin ETF to include a surveillance sharing agreement bt CBOE and a crypto exchange (likely Coinbase), which makes their&#39;s like BlackRock&#39;s filing now, and puts them in pole position to be approved first bc they filed first. <a href=\"https://t.co/P8PCmPdhln\">pic.twitter.com/P8PCmPdhln</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1674055780058771463?ref_src=twsrc%5Etfw\">June 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The investment company of Cathie Wood and the European asset manager 21Shares r<a href=\"https://cointelegraph.com/news/third-time-s-the-charm-ark-and-21shares-again-file-with-sec-for-bitcoin-etf\">equested approval for a spot BTC ETF a third time in April</a>, after previous applications were denied in 2021 and 2022. As a reason for the rejections, the regulator noted that it did not meet the rules of practice and Exchange Act requirements for listing a financial product.</p><p>Speaking in a recent interview, Bloomberg Intelligence ETF analyst, James Seyffart, confirmed that ARK's request <a href=\"https://cointelegraph.com/news/cathie-wood-s-ark-reportedly-first-in-line-for-a-spot-bitcoin-etf\">is the front-runner for a Bitcoin ETF</a>. “21Shares, ARK and Cboe [Chicago Board Options Exchange] are first in line because their next SEC decision date is Aug. 13, 2023, and we don’t yet have a date for the other 19b-4 applications like the one from BlackRock,” he noted. </p><p>Even if ARK receives approval in the coming weeks, the BTC ETF saga may not be over, as it still needs to appoint a crypto exchange to enter into a surveillance sharing agreement. Although Coinbase may be a strong candidate for this position, the company has already partnered with BlackRock to become a Bitcoin custodian should approval be granted.</p><p>\"Would BlackRock [...] even allow Coinbase to enter into a SSE agreement with another that would help another issuer beat them to market? If so ARK would need another crypto exchange to use,\" Balchunas continued on Twitter. </p><p>BlackRock joined the long line of applicants on June 16, triggering a wave of similar initiatives on Wall Street, especially from previous applicants. Financial investment firms such as Valkyrie, WisdomTree, and Invesco have re-filed for spot Bitcoin ETFs in the past few days. </p><p>Cointelegraph reached out to ARK Invest but did not receive an immediate response. </p><p><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong><em>Magazine: Bitcoin is on a collision course with ‘Net Zero’ promises</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-28T16:11:08.000Z",
    "title": "ECB expresses support for European Commission’s digital euro proposal",
    "url": "https://cryptoslate.com/ecb-expresses-support-for-european-commissions-digital-euro-proposal/",
    "description": "<p>The European Central Bank (ECB) expressed support today, June 28, for the European Commission&#8217;s legislative proposal aimed at creating a regulatory framework for a digital euro. The legislation aims to ensure that the digital euro could be universally utilized throughout the euro area, like traditional banknotes and coins. The ECB stated it is awaiting the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ecb-expresses-support-for-european-commissions-digital-euro-proposal/\">ECB expresses support for European Commission&#8217;s digital euro proposal</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-06-28T16:12:08.000Z",
    "title": "Crypto Fraudster Michael Ackerman to Pay $54M in Damages",
    "url": "https://cryptobriefing.com/crypto-fraudster-michael-ackerman-pay-54m/?utm_source=feed&utm_medium=rss",
    "description": "A federal court has ordered Michael Ackerman, a former broker of the New York Stock Exchange (NYSE), to pay a staggering $54 million in restitution and fines. The United States..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-28T16:15:00.000Z",
    "title": "TCRV, LTC and LINK  top coins to buy with bullish signals per Google Bard",
    "url": "https://cryptodaily.co.uk/2023/06/tcrv-ltc-and-link-top-coins-to-buy-with-bullish-signals-per-google-bard",
    "description": "<p>With the latest update in the momentum of the crypto market prices, analysts are beginning to look at predictions for some of the most notable altcoins. Litecoin and Chainlink have specifically grabbed a lot of attention with their upswing, but amidst all of the bullish momentum, another player is on the horizon known as Tradecurve, which is currently in the presale run and has been making waves with its potential for exponential growth.&nbsp;</p>\n<p>As a result, we decided to go to AI-driven tools like Google Bard to see what kind of outlook it has for all three cryptocurrencies.</p>\n<p>Summary</p>\n<ul>\n<li>Litecoin is expected to surge to $500 by the end of the year</li>\n<li>Chainlink can exceed investor expectations and can climb to $50</li>\n<li>Tradecurve can climb in value by 100x, according to Google Bard</li>\n</ul>\n<p></p>\nLitecoin Seen as One of the Best Altcoins According to Google Bard\n<p>Google Bard predicts a bullish pattern in the future of the Litecoin cryptocurrency. The key reasons why Google Bard believes Litecoin can grow in value include the increased adoption of LItecoin as a payment method, alongside more people buying LTC as a form of investment.</p>\n<p>Additionally, Google Bard noted how there is positive news surrounding the Litecoin cryptocurrency and a lot of speculation that can lead to sudden price movements. Litecoin is predicted to climb anywhere between $200 to $500, according to Google Bard, by the end of 2023.</p>\n<p>As of June 26, 2023, Litecoin traded at a value of $88.64. Within the last seven days, the cryptocurrency saw its low point of value at $76.29, while its high point was at a value of $92.50. The overall price increase in the last seven days has been at 14.6%, and in the last year, Litecoin surged by 48.7%.&nbsp;</p>\n<p>&nbsp;</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\n<p>&nbsp;</p>\nThe Bullish Future for Chainlink According to Google Bard\n<p>Google Bard also had a bullish outlook for the Chainlink cryptocurrency, driven by its appeal in both investor circles and investors on a global scale. Positive news coverage surrounding the Chainlink cryptocurrency can fuel its growth alongside developments in its ecosystem. New features are consistently being rolled out, and 2023 has not been an exception to this growth. As a result, there is an estimation that Chainlink can climb between $25 to $50 by the end of the year.&nbsp;</p>\n<p>However, as of June 26, 2023, Chainlink trades at $6.17. During the past week, the low point for Chainlink was at $5.02, while the high point was at $6.34. The overall price increase in the last seven days for Chainlink was at 20.9%, indicating a bullish pattern.</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\nGoogle Bard Estimates that Tradecurve Can Explode in Value\n<p>Amidst this market rally, alongside Litecoin and Chainlink, another cryptocurrency grabbed attention from the market and grew by 80% since its beginning its Tradecurve, in the last week alone, it went up in value by 20%. Now, at Stage 4 of its presale, Tradecurve trades at $0.018, and at Stage 5 next week, it will climb by 40% to $0.025.</p>\n<p>This growth has been fueled due to the array of unique features and the promising roadmap it has. What helps Tradecurve stand out from competitors such as Binance and Kraken, according to Google Bard, is that it will not require any sign-up KYC checks, which will make it inclusive for anyone from anywhere in the world. KYC procedures can be time-consuming and can involve manual verification, delaying the account creation process and removing anonymity completely.</p>\n<p>Google Bard also noted how users can trade immediately just by making a deposit in crypto, which will be used as collateral on top of the platform. This fact, combined with the privacy provided by Tradecurve, will make it the most desirable trading platform for those who are conscious about their information and want to avoid it getting leaked from platforms that are heavily centralized.&nbsp;</p>\n<p>Other features behind Tradecurve that can help it grow in value, according to Google Bard, include high leverage starting at 500:1, a VIP account system, negative balance protection, and the implementation of Proof of Reserves (PoR) alongside Two-Factor Authentication (2FA) as a security measurement.</p>\n<p>So far, the team has raised $2.8 million, and 12,500 users have signed up. The team predicts that they will be able to raise $20 million and that they can onboard 100,000 users during the first three months of operation. According to Google Bard, due to all of these aspects, Tradecurve can climb to $1.8 by the end of Q4 2023.</p>\nFor more information about the Tradecurve presale:\n<p>Click Here For Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p>&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-28T16:30:33.000Z",
    "title": "Microstrategy Expands Bitcoin Position With $347 Million Investment, Pushing Total Holdings to 152,333 BTC",
    "url": "https://news.bitcoin.com/microstrategy-expands-bitcoin-position-with-347-million-investment-pushing-total-holdings-to-152333-btc/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/microstrategy-bitcoin-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Microstrategy Expands Bitcoin Position With $347 Million Investment, Pushing Total Holdings to 152,333 BTC\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/microstrategy-bitcoin-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/microstrategy-bitcoin-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/microstrategy-bitcoin-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/microstrategy-bitcoin-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/microstrategy-bitcoin-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/microstrategy-bitcoin-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/microstrategy-bitcoin.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Microstrategy has purchased 12,333 more bitcoin for about $347 million, growing its cryptocurrency holdings to 152,333 btc. The Nasdaq-listed software company&#x2019;s announcement came amid a series of positive developments in the crypto industry. Microstrategy Adds 12,333 Bitcoin to Its Holdings Business intelligence and software company Microstrategy (Nasdaq: MSTR) has expanded its bitcoin holdings. The company&#x2019;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T16:29:15.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 The automatic release of new APT tokens into the open market is valued at over $50 million based on current prices. Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for a decoupling of on-chain and off-chain trading activity. So, it&#8217;s interesting ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T16:27:21.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T16:22:39.000Z",
    "title": "BoE governor shocks critics with bold rate hike defense",
    "url": "https://www.cryptopolitan.com/boe-governor-bold-rate-hike-defense/",
    "description": "The Bank of England&#8217;s Governor, Andrew Bailey, recently defended his institution&#8217;s bold decision to increase interest rates, brushing aside fierce criticism and reinforcing the BoE&#8217;s steadfast commitment to keeping the UK economy in check. This decisive move, surpassing market expectations, showcased the BoE&#8217;s autonomy and resolve in navigating the complex economic landscape. BoE navigating a ... <a title=\"BoE governor shocks critics with bold rate hike defense\" class=\"read-more\" href=\"https://www.cryptopolitan.com/boe-governor-bold-rate-hike-defense/\" aria-label=\"More on BoE governor shocks critics with bold rate hike defense\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T16:13:35.000Z",
    "title": "EU’s plan to dominate global markets with digital euro",
    "url": "https://www.cryptopolitan.com/eu-dominate-global-markets-with-digital-euro/",
    "description": "The European Union&#8217;s (EU) strategic plan to revolutionize the world economy through the introduction of a digital euro is gathering steam. This move, fueled by the European Commission&#8217;s recent legislative proposal, is slated to reshape the global financial landscape, with the digital euro set to become the bloc&#8217;s universal payment medium. Digital euro: An economic ... <a title=\"EU&#8217;s plan to dominate global markets with digital euro\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eu-dominate-global-markets-with-digital-euro/\" aria-label=\"More on EU&#8217;s plan to dominate global markets with digital euro\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-28T16:22:30.000Z",
    "title": "Ledger enters institutional trading space with launch of Tradelink",
    "url": "https://crypto.news/ledger-enters-institutional-trading-space-with-launch-of-tradelink/",
    "description": "Paris-based crypto security company, Ledger, has announced its foray into the institutional trading domain with the launch of Tradelink."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-28T16:12:07.000Z",
    "title": "UK authorities unveil  guidelines for crypto reform",
    "url": "https://crypto.news/uk-authorities-unveil-guidelines-for-crypto-reform/",
    "description": "The Law Commission of England and Wales has issued recommendations to reform the legal framework surrounding digital assets. "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T16:21:34.000Z",
    "title": "Litecoin, Cosmos, and The Sandbox Poised for Massive Upward Surges According to Analyst",
    "url": "https://www.crypto-news-flash.com/litecoin-cosmos-and-the-sandbox-poised-for-massive-upward-surges-according-to-analyst/?utm_source=rss&utm_medium=rss&utm_campaign=litecoin-cosmos-and-the-sandbox-poised-for-massive-upward-surges-according-to-analyst",
    "description": "Popular crypto trader, Litecoin (LTC), Cosmos (ATOM), and the Sandbox (SAND) is showing signs of preparing for upward movements. As per the trader&#8217;s analysis, there is a possibility that Litecoin could experience a surge that drives its value up to $110 in the near future According to a popular crypto trader, Litecoin (LTC), Cosmos (ATOM), [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T16:13:20.000Z",
    "title": "SEC Chair Gary Gensler: Protecting Industry Giants like BlackRock and JPMorgan, Neglecting Retail Investors",
    "url": "https://www.crypto-news-flash.com/sec-chair-gary-gensler-protecting-industry-giants-like-blackrock-and-jpmorgan-neglecting-retail-investors/?utm_source=rss&utm_medium=rss&utm_campaign=sec-chair-gary-gensler-protecting-industry-giants-like-blackrock-and-jpmorgan-neglecting-retail-investors",
    "description": "Crypto industry observers believe the SEC is protecting Wall Street firms instead of retail investors. The regulator&#8217;s actions have derailed the track record of Coinbase. Some suspicions have risen in the minds of many cryptocurrency observers about the recent happenings between the United States Securities and Exchange Commission (SEC) and the broad crypto industry. Gary [...]"
  }
]