[
  {
    "source": "Cointelegraph",
    "date": "2024-02-06T04:16:59.000Z",
    "title": " Vitalik Buterin floats 5 designs to decrease Ethereum max block size ",
    "url": "https://cointelegraph.com/news/vitalik-buterin-5-solutions-decrease-ethereum-max-block-size",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYmQ0MWMwNzgtOTFhZi00NGRkLTk2NTAtNjg3MzgyYzc1MDQ5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The solutions floated by Buterin and the Ethereum Foundation revolve around increasing the cost of calldata and raising block gas limits.</p>\n                    <p><p>Ethereum co-founder Vitalik Buterin and the Ethereum Foundation are considering at least five ways to reduce Ethereum’s maximum block size in hopes to optimize the blockchain for the \"rollup-centric roadmap.\"</p><p>On Feb. 5, Buterin and Ethereum Foundation researcher Toni Wahrstätter <a href=\"https://ethresear.ch/t/on-increasing-the-block-gas-limit/18567\" target=\"_blank\" rel=\"noopener nofollow\">said</a> that with the focus on rollups in the medium and long term, it is argued that the way block space is used is not yet optimized — noting that effective block size has essentially doubled over the past 12 months. </p><p>“This might be a result of more and more rollups starting to use Ethereum for DA and trends like Inscriptions,” explained Buterin and Wahrstätter</p><p><a href=\"https://cointelegraph.com/news/vitalik-buterin-5-solutions-decrease-ethereum-max-block-size\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T04:12:17.000Z",
    "title": "B.C. Supreme Court Ruling to Shape Use of AI Models in Legal Sphere – Experts Weigh In",
    "url": "https://www.cryptopolitan.com/supreme-court-ai-models-in-legal-sphere/",
    "description": "In a significant development poised to shape the future landscape of Canada&#8217;s legal system, a pending B.C. Supreme Court case delves into the intricate realm of AI Models in legal sphere. This high-profile case revolves around the submission of purportedly AI-generated legal cases, sparking discussions among industry experts regarding the implications and precedents it might [&#8230;]"
  }
]