[
  {
    "source": "Cointelegraph",
    "date": "2024-04-01T14:07:12.000Z",
    "title": " Open-source Bitcoin education aims to spread global financial literacy  ",
    "url": "https://cointelegraph.com/news/open-source-bitcoin-education-global-financial-literacy",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvODQ1YTg1MmUtMGRiNS00M2FkLWFiZGMtMjE3MmY5MzdjZWZiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Mi Primer Bitcoin, a pioneering Bitcoin education initiative in El Salvador, released the latest edition of its program emphasizing open-source resources and community-led education. </p>\n                    <p><p data-ct-non-breakable=\"true\">The El Salvador-based <a href=\"https://cointelegraph.com/news/el-salvador-s-my-first-bitcoin-how-to-teach-a-nation-about-crypto\">Bitcoin education initiative</a> Mi Primer Bitcoin recently announced the launch of its updated Bitcoin Diploma program, with a new open-source approach. </p><p>Mi Primer Bitcoin began as a local education initiative in 2021 and coincided with <a href=\"https://cointelegraph.com/news/september-7-is-bitcoin-day-in-el-salvador-as-btc-becomes-legal-tender\">El Salvador becoming the first country</a> to adopt Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) as legal tender. </p><p>This new update of the program was developed in collaboration with Bitcoin educators and enthusiasts from around the world to provide a comprehensive curriculum covering various aspects of Bitcoin, from its history to its technical workings and everyday applications.</p><p><a href=\"https://cointelegraph.com/news/open-source-bitcoin-education-global-financial-literacy\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-04-01T14:04:24.000Z",
    "title": "Bitcoin leads over $800 million global crypto ETP market rebound, overshadowing Ethereum outflows",
    "url": "https://cryptoslate.com/bitcoin-leads-over-800-million-global-crypto-etps-market-rebound-overshadowing-ethereum-outflows/",
    "description": "<p>Last week, the digital asset market witnessed a significant influx of over $800 million, spearheaded by Bitcoin&#8217;s dominance, according to the weekly flow report shared by CoinShares&#8216; head of research James Butterfill. This surge marks a swift rebound following the near $1 billion outflow observed in the previous week. Bitcoin, US see significant inflows. Bitcoin [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-leads-over-800-million-global-crypto-etps-market-rebound-overshadowing-ethereum-outflows/\">Bitcoin leads over $800 million global crypto ETP market rebound, overshadowing Ethereum outflows</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-01T13:56:02.000Z",
    "title": "Crypto Heavyweights Shift Focus: Ethereum & Toncoin Whales Flock to Raboo Token Presale",
    "url": "https://cryptodaily.co.uk/2024/04/crypto-heavyweights-shift-focus-ethereum-toncoin-whales-flock-to-raboo-token-presale",
    "description": "Crypto whales call the shots: they are the investors who have so much of one particular currency that any activity affects the price."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-01T13:49:24.000Z",
    "title": "Render (RNDR), Solana (SOL) and KangaMoon (KANG) Spark Altcoin Surge – Holders Potentially Looking at Massive Returns",
    "url": "https://cryptodaily.co.uk/2024/04/render-rndr-solana-sol-and-kangamoon-kang-spark-altcoin-surge-holders-potentially-looking-at-massive-returns",
    "description": "Recently, altcoins have hopped to the forefront of the crypto market. Three altcoins are leading this charge: Render (RNDR), Solana (SOL) and KangaMoon (KANG). While RNDR and SOL are well-established cryptos, KANG is a Stage 4 presale star. It has already provided early buyers with a 180% ROI and experts hint that it may reach $0.5 in 2024. Let’s see why."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-01T13:43:23.000Z",
    "title": "As Bitcoin Tests $80K Pre-Halving, Dogecoin Rival Attracts Retail Investors En Masse.",
    "url": "https://cryptodaily.co.uk/2024/04/as-bitcoin-tests-80k-pre-halving-dogecoin-rival-attracts-retail-investors-en-masse",
    "description": "As Bitcoin surges towards the $80,000 mark ahead of its impending halving event, the cryptocurrency market witnesses a surge in interest and investment."
  },
  {
    "source": "BTCManager",
    "date": "2024-04-01T13:56:58.000Z",
    "title": "Bitcoin wallet UniSat warns of fake Apple iOS app",
    "url": "https://crypto.news/bitcoin-wallet-unisat-fake-apple-ios-app/",
    "description": "UniSat warns users of a malicious Bitcoin wallet hosted on Apple’s app store as BTC exchanged hands 5% below the asset’s all-time high. "
  },
  {
    "source": "BTCManager",
    "date": "2024-04-01T13:45:44.000Z",
    "title": "Tether achieves SOC 2 security compliance, sets annual audit goal",
    "url": "https://crypto.news/tether-soc-2-security-compliance-audit/",
    "description": "USDT stablecoin provider Tether passed the SOC2 audit, demonstrating its ability to secure customer data with strict measures."
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-01T14:00:11.000Z",
    "title": "Bitcoin Weekly Range Breakout Signals Potential Upsurge: Analyst",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-weekly-range-breakout-signals-potential-upsurge-analyst/",
    "description": "Popular cryptocurrency analyst and enthusiast Rekt Capital has delved into the recent performance of Bitcoin (BTC) citing the beginning of a breakout process from a weekly range that could possibly lead to an upswing. Bitcoin Begins The Breakout Process Rekt Capital previously highlighted that Bitcoin has been wedged within a weekly range he dubbed Black-Black, ever since it witnessed about 18% correction. The candle-bodied peak from 2021 and the upside-wicking peak from 2021 basically created this weekly range. Related Reading: Can This Bullish Chart Pattern Propel Bitcoin Price To $75,000? He then claimed that regaining the $69,200 Range High for Bitcoin could indicate that the cryptocurrency is prepared to break out of the weekly range. Additionally, it might also signal the conclusion of the aforementioned pullback period. It appears the analyst&#8217;s forecast has come to pass as BTC has surpassed the $69,200 level, triggering a breakout activity. According to Rekt Capital, the first phase in the breakout process that Bitcoin has initiated is a Weekly Close above the Range High. However, before moving higher, BTC might need to dive into the range high in order to properly retest it as new support. As a result, it would be the second phase to validate the break out from the week range properly. The crypto expert&#8217;s analysis coincides with a recent drop in the price of Bitcoin today, raising speculations about its next movement. Bitcoin opened the day around the $71,000 threshold; a few hours later, the crypto asset fell to $69,200 level. As of the time of writing, Bitcoin was trading at $69,500, indicating a decline of about 1.29% in the past day. BTC&#8217;s market cap has also decreased in the last 24 hours by the same percentage, while its daily trading volume has increased by over 52%. A Bullish Month For BTC This suggests that investors are still bullish toward the digital asset despite the retrace witnessed today. Investors are even more optimistic as Bitcoin&#8217;s halving event approaches because of the possible impact on BTC. Even though BTC began the day with a decline, several analysts still believe it might perform robustly in April. This is due to the fact that Bitcoin has mostly experienced significant growth in April over the past years. Related Reading: Bitcoin Pre-Halving Dip Expected: Will BTC Rally Before US Fed Decision? Zia Ul Haque, the Founder of Open4Profit claims that in the past April has been superior to March while providing a comparison of the monthly increases in the price of Bitcoin from 2013 until 2024. According to data shared by Haque, April has witnessed an average 14.2% increase in price.  Haque anticipates a better performance this time since the much-awaited Bitcoin halving event will take place this month. &#8220;Halving is just at the end of this month &#8211; April 20th, pre-halving narrative can bring lots of attention to this market,&#8221; he stated. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-04-01T14:00:14.000Z",
    "title": "After NEAR Pushes 9X, New Projects Will Be The Next Crypto Narrative",
    "url": "https://www.crypto-news-flash.com/after-near-pushes-9x-new-projects-will-be-the-next-crypto-narrative/?utm_source=rss&utm_medium=rss&utm_campaign=after-near-pushes-9x-new-projects-will-be-the-next-crypto-narrative",
    "description": "<img width=\"1200\" height=\"684\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T152215.410.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T152215.410.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T152215.410-300x171.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T152215.410-768x438.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T152215.410-150x86.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T152215.410-450x257.png 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />With Near Protocol (NEAR) demonstrating the potential to multiply its value ninefold, investors are turning their attention toward new projects as the next frontier in their crypto investments. NEAR crypto price prediction The Near Protocol (NEAR) price has seen a 74.28% increase over the past 30 days. The cryptocurrency’s transaction volumes are rebounding from the [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-04-01T14:01:31.000Z",
    "title": "OKX Lists Wormhole (W) for Spot Trading",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/okx-lists-wormhole-w-for-spot-trading/",
    "description": "<p>This move highlights OKX&#8217;s dedication to expanding our crypto portfolio and offering users varied digital assets. Wormhole (W) will join OKX&#8217;s cryptocurrency lineup, enhancing our global trading experience. Wormhole (W) Joins OKX&#8217;s Trading Lineup The listing of Wormhole (W) on OKX&#8217;s spot market debut will occur in three phases for a smooth, organized rollout. Here&#8217;s [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/okx-lists-wormhole-w-for-spot-trading/\">OKX Lists Wormhole (W) for Spot Trading</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]