[
  {
    "source": "CryptoSlate",
    "date": "2023-11-27T09:30:42.000Z",
    "title": "Circle, SBI Holdings focus combined efforts on USDC growth in Japanese market",
    "url": "https://cryptoslate.com/circle-sbi-holdings-focus-efforts-on-usdc-growth-in-japanese-market/",
    "description": "<p>Stablecoin issuer Circle signed a Memorandum of Understanding (MoU) with Japanese financial giant SBI Holdings to boost USD Coin (USDC) circulation, establish a banking relationship, and expand its presence in the Asian country, according to a Nov. 27 statement. Per the statement, several subsidiaries of the traditional financial institution would play an active role in [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/circle-sbi-holdings-focus-efforts-on-usdc-growth-in-japanese-market/\">Circle, SBI Holdings focus combined efforts on USDC growth in Japanese market</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-27T09:12:47.000Z",
    "title": "JPMorgan’s Head of Global Market Strategy on Binance’s Settlement With DOJ and Impact on Crypto Markets",
    "url": "https://www.cryptoglobe.com/latest/2023/11/jpmorgans-head-of-global-market-strategy-on-binances-settlement-with-doj-and-impact-on-crypto-markets/",
    "description": "On 25 November 2023, Nikolaos Panigirtzoglou, head of cross-asset market strategy at JPMorgan, shared his insights on LinkedIn regarding the Binance settlement and its broader implications for the cryptocurrency ecosystem, particularly in the context of regulation and market dynamics Panigirtzoglou began by emphasizing the significance of the Binance settlement in reinforcing a shift towards regulated […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-27T09:30:26.000Z",
    "title": "Eurasian Economic Union Minister: CBDCs Will Pave the Way for the Launch of a Digital Reserve Currency",
    "url": "https://news.bitcoin.com/eurasian-economic-union-minister-cdbcs-reserve-currency/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/0ab05e9e-1abf-4460-b893-ab4f0a5f82a8-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Eurasian Economic Union Minister: CDBC&#039;s Will Pave the Way for the Launch of a Digital Reserve Currency\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/0ab05e9e-1abf-4460-b893-ab4f0a5f82a8-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/0ab05e9e-1abf-4460-b893-ab4f0a5f82a8-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/0ab05e9e-1abf-4460-b893-ab4f0a5f82a8-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/0ab05e9e-1abf-4460-b893-ab4f0a5f82a8-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/0ab05e9e-1abf-4460-b893-ab4f0a5f82a8-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/0ab05e9e-1abf-4460-b893-ab4f0a5f82a8-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/0ab05e9e-1abf-4460-b893-ab4f0a5f82a8.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Sergei Glazyev, minister of integration and macroeconomics of the Eurasian Economic Union (EEU), has noted the advancements the adoption of central bank digital currencies (CBDCs) could ostensibly bring to the trading dynamics of the region. According to Glazyev, the launch of several digital currencies will allow countries to settle trades outside of the U.S. dollar [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-27T09:33:18.000Z",
    "title": "FLEX soars 360% in 24 hours, sell signal has emerged",
    "url": "https://crypto.news/flex-soars-360-in-24-hours-sell-signal-has-emerged/",
    "description": "The FLEX token has registered significant gains in the past 24 hours while data suggests the asset might be manipulated by large whales.&#160; FLEX is up by 360% in the past 24 hours and is trading at $2.26 at the&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-27T09:16:05.000Z",
    "title": "LUNA, LUNC, USTC surge as social activity skyrockets after key update",
    "url": "https://crypto.news/luna-lunc-ustc-surge-as-social-activity-skyrockets-after-key-update/",
    "description": "The three tokens of the Terra ecosystem — Terra (LUNA), Terra Classic (LUNC) and TerraClassicUSD (USTC) — have gained momentum following an update last week.&#160; The surge comes a week after Terraform Labs deployed $10 million worth of assets in&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-27T09:30:22.000Z",
    "title": "Road To $1: Why Did Terra Classic (USTC) Rise 300% In One Day?",
    "url": "https://www.newsbtc.com/altcoin/terra-classic-ustc-rise-300/",
    "description": "TerraClassicUSD (USTC), the algorithmic stablecoin tied to the LUNA ecosystem, recently went on an upward trajectory to register gains of over 300%. In a stunning cascade of events, the token’s price spike in the past 24 hours has left investors wondering about the implication for Terra Classic (LUNC) and the potential revival of the LUNA ecosystem. USTC Coin Spikes 300% In One Day USTC has lost most of its usefulness as a stablecoin since its implosion in 2022 when it was known as UST. The stablecoin lost its peg to the US dollar which resulted in a chain of events that led to its sister token, LUNA, also losing most of its value and the demise of the Terra-LUNA blockchain ecosystem. After it lost its peg to the US dollar, the stablecoin was rebranded as UST Classic and its value fell to as low as $0.01. Related Reading: XRP Price May Recapture 61,000% Surge Seen In 2017, Analyst Claims It&#8217;s already been more than a year since the crash, but it looks like the token and some members of the LUNA ecosystem are not ready to give up yet. The latest price action has seen the token spike 300% from $0.01569 to $0.0755 in the past 24 hours. The catalyst for this surge can be attributed to Terra Classic Labs (TCL), a LUNC community project. Terra Classic Labs was created in October 2023 by some members of the former thriving LUNA ecosystem. According to its website, it is dedicated to supporting new LUNC projects for the revival of the Terra ecosystem. In a social media post by Trader QT, an official partner of Luna Classic Labs, the team made a massive purchase of approximately 25.6 million USTC for $500,000 at an average price of $0.021 per $USTC. This move sent USTC spiking, fueling hopes that Terra Classic Labs can help revive and stabilize the cryptocurrency. I can confirm that today, in an initial strategic investment, Luna Classic Labs has purchased approximately 25.6m $USTC for $500k in accordance with its Treasury Reserve Policy, at an average price of approximately $0.021 per $USTC. — Trader QT (@0x_Ears) November 26, 2023 Can Terra Classic Return To $1? Although the move by Terra Classic Labs sent USTC on a surge, the stablecoin is still trading at $0.0516, far from a $1 price point. The crypto will have to register another gain of 1837% from its current price before it can regain its peg to the US dollar, showing how far behind it is. The recent price action however did have some sort of bullish action on Terra Classic LUNC, as it has also spiked by 25% in the past 24 hours. Terra Classic is trading at $0.0001004 at the time of writing. Related Reading: Whales Move $30 Million Worth Of XRP To Exchanges – Time To Sell? Although the Terra Classic community hasn&#8217;t given up on the cryptocurrency, the LUNA ecosystem has since rebranded and moved from Terra Classic LUNC to a new chain (Terra 2.0) with its own native token called LUNA.  It would seem LUNA also reacted positively to the TerraClassicUSD surge as data from Coinmarketcap shows LUNA has increased by 17.8% in the past 24 hours and is now trading at $0.79. Token price makes 300% run &#124; Source: USTC/USDT on Tradingview.com Featured image from Vecteezy, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-27T09:34:15.000Z",
    "title": "Former Binance CEO CZ Faces Potential 10-Year Prison Sentence: Shocking Turn of Events",
    "url": "https://www.crypto-news-flash.com/former-binance-ceo-cz-faces-potential-10-year-prison-sentence-shocking-turn-of-events/?utm_source=rss&utm_medium=rss&utm_campaign=former-binance-ceo-cz-faces-potential-10-year-prison-sentence-shocking-turn-of-events",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Binance-Coin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Binance-Coin.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Binance-Coin-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Binance-Coin-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Binance-Coin-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Changpeng Zhao, former Binance CEO, faces a potential 10-year prison sentence and strict travel restrictions due to a violation of the Bank Secrecy Act. The DOJ is challenging a court decision that allows Zhao to stay in the UAE, citing his wealth and connections as flight risks. Changpeng Zhao, the founder and ex-CEO of Binance, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-27T09:20:20.000Z",
    "title": "Ripple or Solana – The Epic Battle for Crypto Supremacy Unfolds",
    "url": "https://www.crypto-news-flash.com/ripple-or-solana-the-epic-battle-for-crypto-supremacy-unfolds/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-or-solana-the-epic-battle-for-crypto-supremacy-unfolds",
    "description": "<img width=\"512\" height=\"268\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-77.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-77.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-77-300x157.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-77-351x185.png 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The battle for dominance in the crypto sphere is heating up. Ripple (XRP) and Solana (SOL) are at the forefront of this clash, two titans vying for supremacy. This article will explore their latest price performance and some noteworthy developments. Ripple (XRP): Indicates Bullish Momentum Ripple (XRP) has always been praised for its practicality in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-27T09:16:45.000Z",
    "title": "Bitcoin Blunder: User Pays $3.1 Million in Fees for a Single Transaction",
    "url": "https://www.crypto-news-flash.com/bitcoin-blunder-user-pays-3-1-million-in-fees-for-a-single-transaction/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-blunder-user-pays-3-1-million-in-fees-for-a-single-transaction",
    "description": "<img width=\"640\" height=\"424\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/bitcoin-3741065_640.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/bitcoin-3741065_640.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/bitcoin-3741065_640-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/bitcoin-3741065_640-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />The unlucky Bitcoin investor was charged nearly 84 BTCs to send only 55 coins thus largely benefitting the miners who confirmed the transaction at block height 818087. The blunder has aroused the need for DeFi protocols to integrate with the lightning network significantly reducing the transaction fees without compromising on security and scalability. The rising [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-27T09:24:13.000Z",
    "title": "How to Be Early in the Next Big Crypto Gem",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-to-be-early-in-the-next-big-crypto-gem/",
    "description": "<p>It goes without saying that being early in crypto is key. By being early, you get into a project at very cheap prices. Once others get in, they push token prices up. That&#8217;s when you get to reap the rewards. With this, we&#8217;ll be teaching you the secrets to do so. In other words, how [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-to-be-early-in-the-next-big-crypto-gem/\">How to Be Early in the Next Big Crypto Gem</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]