[
  {
    "source": "Decrypt",
    "date": "2023-12-04T21:46:02.000Z",
    "title": "Is NFT Winter Over? Prices Climb as Bitcoin and Ethereum Surge",
    "url": "https://decrypt.co/208543/is-nft-winter-over-prices-climb-bitcoin-ethereum-surge",
    "description": "Projects like Pudgy Penguins, Mad Lads, and Milady Maker are leading the charge for a NFT market upswing across Ethereum, Solana, and beyond."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-04T21:58:10.000Z",
    "title": " Core Scientific explains its latest bankruptcy plan ahead of court date ",
    "url": "https://cointelegraph.com/news/core-scientific-explains-latest-bankruptcy-plan-court-date",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNmU3Y2NkODItOTE1MS00MzFlLTkyNWItYzgwMjZjYmMyNmIzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>If approved, this third version of the plan will go into effect on Jan. 5, 2024, and see the company add 372 MW in capacity by 2027.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) miner Core Scientific has released a presentation outlining its plans to emerge from bankruptcy in early January 2024. The presentation is based on the third amended joint Chapter 11 plan <a href=\"https://cases.stretto.com/public/X217/12024/PLEADINGS/1202411172380000000029.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> on Nov. </p><p>Common shareholders and holders of two series of convertible notes are being planned for separately. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-12/ecc4dd46-b86f-41bb-beef-e55c5bbc9f20.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Planned Core Scientific indicators through 2027. Source: Core Scientific</em></figcaption></figure><p>Noteholders will receive $1.628 on every $1 of face value for notes due in April and $1.201 per $1 face value for notes with an August due date. </p><p>If it reaches agreements with key shareholders, Core Scientific will emerge from bankruptcy with $709 million in net debt and $791 million in equity value on Jan. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/unjustly-enriched-core-scientific-knocks-back-4-7m-claim-from-celsius\" >‘Unjustly enriched’ — Core Scientific knocks back $4.7M claim from Celsius</a></em></strong></p><p>Core Scientific operates seven facilities in five states and has a total operational capacity of 724 MW. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today’s <a href=\"https://twitter.com/search?q=%24CORZ&src=ctag&ref_src=twsrc%5Etfw\">$CORZ</a> daily self-mined <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&ref_src=twsrc%5Etfw\">#Bitcoin</a> for the last reported 24-hour period (02-Dec-2023): 30.1 <a href=\"https://t.co/KuKyORAkka\">pic.twitter.com/KuKyORAkka</a></p><p><a href=\"https://cointelegraph.com/news/core-scientific-explains-latest-bankruptcy-plan-court-date\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-04T21:52:39.000Z",
    "title": " IRS team reports rise in crypto tax investigations ",
    "url": "https://cointelegraph.com/news/irs-rise-crypto-tax-investigations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvY2I2ZjMwMTAtZWZhNi00ZjgxLTg5MWQtZGQwMjBmZDliYmE5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>According to the fiscal year 2023 report, the IRS unit investigated failures to disclose crypto holdings and report on capital gains for transactions. </p>\n                    <p><p>The Criminal Investigation (CI) Unit of the United Internal Revenue Service (IRS) reported an increase in the number of investigations around digital asset reporting.</p><p>In its annual report released on Dec. 4, the IRS investigative arm <a href=\"https://www.irs.gov/compliance/criminal-investigation/irs-criminal-investigation-releases-fy23-annual-report-highlighting-more-than-2600-investigations-371-billion-identified-from-tax-and-financial-crimes\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it had initiated more than 2,676 cases in which it had identified more than $37 billion related to tax and financial crimes in the 2023 fiscal year. </p><p>“These investigations consist of unreported income resulting from failure to report capital gains from the sale of cryptocurrency, income earned from mining cryptocurrency, or income received in the form of cryptocurrency, such as wages, rental income, and gambling winnings,” said the Criminal Investigation Unit. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Our FY23 Annual Report highlights more than 2,600 investigations, $37.1 billion identified from tax and financial crimes. <a href=\"https://twitter.com/hashtag/IRSC?src=hash&ref_src=twsrc%5Etfw\">#IRSC</a> <a href=\"https://twitter.com/hashtag/ByTheNumbers?src=hash&ref_src=twsrc%5Etfw\">#ByTheNumbers</a><a href=\"https://twitter.com/hashtag/WhatWeDoCounts?src=hash&ref_src=twsrc%5Etfw\">#WhatWeDoCounts</a><br> <a href=\"https://t.co/B1hZw8ClXm\">https://t.co/B1hZw8ClXm</a> <a href=\"https://t.co/EZWQKNB2uu\">pic.twitter.com/EZWQKNB2uu</a></p>— IRS Criminal Investigation (@IRS_CI) <a href=\"https://twitter.com/IRS_CI/status/1731700138601595198?ref_src=twsrc%5Etfw\">December 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-taxirs-extends-comments-period-for-new-crypto-tax-rule-to-mid-november\" ><strong><em>IRS extends comments period for new crypto tax rule to mid-November</em></strong></a></p><p>Starting in 2019, the IRS began requiring U.S. In the report, CI chief Jim Lee said that “most people using cryptocurrency do so for legitimate purposes,” but digital assets pose a <a href=\"https://cointelegraph.com/news/crypto-advocacy-groups-rebuttal-links-terrorism\" >risk for financing terrorism</a>, ransomware attacks, and other illicit activities.</p><p>Since it began increasing efforts to investigate crimes involving cryptocurrency in 2015, the IRS has <a href=\"https://cointelegraph.com/news/how-the-irs-seized-10b-worth-of-crypto-using-blockchain-analytics\" >seized more than $10 billion</a> in digital assets. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong><em>Best and worst countries for crypto taxes — plus crypto tax tips</em></strong></a></p><p><a href=\"https://cointelegraph.com/news/irs-rise-crypto-tax-investigations\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-04T21:48:16.000Z",
    "title": "India’s crypto regulation advances: 28 entities register with FIU",
    "url": "https://www.cryptopolitan.com/indias-crypto-regulation-advance-28-entities/",
    "description": "About 28 Virtual Digital Assets (VDA) or crypto service providers have officially registered with the Financial Intelligence Unit (FIU) in India, as confirmed by the Indian Minister of State for Finance, Pankaj Chaudhary. This move comes in the wake of regulatory measures aimed at integrating the burgeoning crypto market into the nation&#8217;s financial oversight framework. ... <a title=\"India&#8217;s crypto regulation advances: 28 entities register with FIU\" class=\"read-more\" href=\"https://www.cryptopolitan.com/indias-crypto-regulation-advance-28-entities/\" aria-label=\"More on India&#8217;s crypto regulation advances: 28 entities register with FIU\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-04T21:47:07.000Z",
    "title": "Bitcoin, Cardano, Ethereum show bull market setup: analyst",
    "url": "https://crypto.news/bitcoin-cardano-ethereum-show-bull-market-setup-analyst/",
    "description": "The analyst believes, based on historical data, that the worst of the recent crypto bear market is likely over and that Bitcoin is approaching its next bull cycle."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-04T22:00:46.000Z",
    "title": "Boomers Interested In Bitcoin, Market Won’t Allow BlackRock To Buy BTC Below $60k",
    "url": "https://www.newsbtc.com/bitcoin-news/boomers-bitcoin-market-blackrock-to-buy-btc-60k/",
    "description": "As institutional interest in Bitcoin grows, Fidelity and BlackRock&#8217;s proposed spot Bitcoin Exchange-Traded Fund (ETF) faces an unexpected hurdle: the crypto market&#8217;s unwillingness to let go of the coin at bargain prices.  Bitcoin To $60,000 In Progress? According to Mike Alfred, who claims to be a value investor and a board director, the market will &#8220;unlikely&#8221; allow BlackRock to purchase BTC below $60,000. Taking to X on December 4, Alfred said BlackRock and other Wall Street players keen on issuing spot Bitcoin ETFs would have to &#8220;buy for Boomer&#8217;s 401k plans for at least $60,000.&#8221;  This preview stems from the rapidly growing demand among institutional investors, as seen by the number of Wall Street players willing to issue complex derivatives tailored for, among other investors, &#8220;baby boomers,&#8221; most of whom are &#8220;approaching retirement.&#8221; With their substantial retirement savings, baby boomers increasingly recognize BTC&#8217;s potential as a hedge against inflation and a store of value. Related Reading: ADA In The Spotlight: Heavyweight Investors Pile Into Cardano, What’s Next? Following Federal Reserve intervention during the COVID-19 pandemic, inflation rose to multi-year levels in 2021. To preserve purchasing power, the central bank began hiking interest rates. Although inflation has fallen and the economy stabilized, it remains higher than the target of 2%. The Fed continues to track this metric and may further intervene by raising rates to lower inflation. This might impact Bitcoin prices, as seen in the past months. Nonetheless, the potential influx of boomer money into Bitcoin via a Securities and Exchange Commission (SEC) and Commodity Futures Trading Commission (CFTC) approved derivatives product is a big boost for the coin. Though the SEC has yet to authorize multiple spot Bitcoin ETFs, the crypto and Bitcoin market expects the strict regulator to greenlight the first product in the next few weeks.  BlackRock And Company To Buy BTC At A Premium Accordingly, ahead of this milestone development for the Bitcoin and crypto market, Alfred thinks BlackRock, Fidelity, and other players won&#8217;t secure Bitcoin at spot rates. Instead, the market anticipates that BlackRock, one of the world&#8217;s largest digital asset managers, will make their &#8220;bi-weekly purchases at prices above $60,000.&#8221; Related Reading: Bitcoin Cycle Analysis And Macro Factors Reveal When Price Will Reach $125,000 The coin is trading at April 2022 levels, ripping above $40,000 over the weekend as bulls step up. Looking at the BTC candlestick arrangement on the daily chart, the first clear resistance is around $48,000.  The coin trades within a bullish breakout formation following gains above $32,000. As buyers step up and investors anticipate the SEC approving the first batch of spot Bitcoin ETFs, the coin will likely continue increasing toward all-time highs of around $70,000. Feature image from Canva, chart from TradingView"
  }
]