[
  {
    "source": "Bitcoin.com",
    "date": "2023-10-28T22:00:15.000Z",
    "title": "Mark Cuban Explains What Crypto’s Really About — Says It’s Missing Application ‘Grandma Really Wants to Use’",
    "url": "https://news.bitcoin.com/mark-cuban-explains-what-cryptos-really-about-says-its-missing-application-grandma-really-wants-to-use/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/mark-cuban-crypto-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Mark Cuban Explains Crypto&#039;s True Purpose and What It Needs to Succeed\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/mark-cuban-crypto-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/mark-cuban-crypto-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/mark-cuban-crypto-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/mark-cuban-crypto-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/mark-cuban-crypto-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/mark-cuban-crypto-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/mark-cuban-crypto.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Mark Cuban, a Shark Tank investor and the owner of the NBA team Dallas Mavericks, has shared what he thinks crypto is really about. &#8220;Crypto is still waiting for its Instagram moment,&#8221; the billionaire said, noting that &#8220;What crypto is missing is that one application that grandma really wants to use.&#8221; Mark Cuban Shares What [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-28T21:45:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-28T22:00:40.000Z",
    "title": "XRP Price Prediction: Analyst Points Out Incoming Mega Bounce, Here’s The Target",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-prediction-bounce/",
    "description": "Another bullish prediction has come in for the XRP price which is arguably more optimistic than many would expect. This time around, a crypto analyst is expecting XRP to use up its stored energy for an explosive rally that could see the altcoin rally to $27, well above its all-time high.  XRP Price Suppressed During Last Bull Run Because Of SEC Lawsuit Crypto analyst ERGAG CRYPTO recently predicted that XRP is poised for a massive 4,000% price surge. ERGAG made this prediction in an X post, detailing how this price surge can be actually possible. According to the analyst, XRP&#8217;s price was suppressed during the last major crypto bull run in 2021 due to an ongoing lawsuit from the SEC against Ripple Labs, XRP&#8217;s creator.  Related Reading: Litecoin Whales Are Back In The Game, Can Price Reach $100? While Bitcoin and other altcoins were hitting new all-time highs, the XRP price struggled to keep up due to fears the lawsuit could severely impact the project&#8217;s future. For instance, during this time period, Bitcoin skyrocketed by 23X, and Ethereum also went up a whopping 58X.  A federal judge in the United States has since determined that the programmatic sales of XRP do not constitute the selling of securities. Now that the lawsuit seems to be coming to an end with a settlement in sight, XRP is poised to make up for lost time and shoot up with this lost energy.  The analyst predicts the XRP price could rally 40 times from its current level to $27 in the subsequent bull run, which would exactly coincide with the Fibonacci 1.618 indicator from the 2017 peak to the 2020 bottom. Source: X Although a timeline for the next bull run is not known at the moment, ERGAG puts this spike to happen around mid-2024. &#160; One day for sure. But suggestion March &#8211; May 2024 will be fire works. — EGRAG CRYPTO (@egragcrypto) October 26, 2023 What’s Next For XRP? The entire crypto market has witnessed gains since the middle of October, and the XRP price hasn&#8217;t been left out. Bitcoin, for instance, attained a new yearly high of $35,150. At the time of writing, XRP is trading at $0.547, up by 5.73% in the past seven days.  Related Reading: Shiba Inu Team Member Clarifies SHIB Burn As Shibarium Grows Although its price is relatively low compared to other altcoins, XRP is still one of the strongest in the entire market, occupying the 5th spot in terms of market cap.  ERGAG CRYPTO has also had some very optimistic price predictions for XRP in the past. While a $27 price point seems very overachieving, XRP could easily smash through its previous all-time high of $3.84 in the next bull market. The analyst had initially predicted that the altcoin might not see a new all-time high by July 2028. XRP sees slight retracement &#124; Source: XRPUSD on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  }
]