[
  {
    "source": "Decrypt",
    "date": "2024-01-15T21:47:38.000Z",
    "title": "Mysterious Ordinals Inscription Teases 'Cursed' Bitcoin Art Project",
    "url": "https://decrypt.co/212908/mysterious-ordinals-inscription-teases-cursed-bitcoin-art-project",
    "description": "Cryptic '10,000 sats' message on Ordinal 55,365,041 baffles Ordinals experts, igniting speculation in the Bitcoin community."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-15T21:41:33.000Z",
    "title": " UN implicates crypto in booming illicit economies of Southeast Asia ",
    "url": "https://cointelegraph.com/news/un-implicates-crypto-illicit-economies-southeast-asia",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYTQxY2I1MzktOWZmOC00ZDVmLWE1MGEtYjA0MWYwMWFmYTRkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The \"gray\" casino industry is taking advantage of crypto and other modern technologies to advance illegal goals.</p>\n                    <p><p>A report released by the United Nations Office on Drugs and Crime has warned that cryptocurrency is being misused in illicit economies developing in East and Southeast Asia. Crypto is being combined with the latest tech innovations as organized crime creates new, complex challenges for law enforcement, according to the report. </p><p>Poorly regulated or illicit casinos and “pig-butchering” romance scams have seen rapid growth in the Mekong Region, the report <a href=\"https://www.unodc.org/roseap/uploads/documents/Publications/2024/Casino_Underground_Banking_Report_2024.pdf\" target=\"_blank\" rel=\"noopener nofollow\">stated</a>. These new economic models are highly sophisticated:</p><p>Another technique used by criminals is locating illegal gambling and scam operations in underregulated special economic zones and areas under the control of autonomous armed groups. A specialized travel industry has arisen around the casinos. So-called junket operators do more than just provide travel and accommodations:</p><p><a href=\"https://cointelegraph.com/news/un-implicates-crypto-illicit-economies-southeast-asia\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-15T21:48:16.000Z",
    "title": "Solana alternative Retik Finance Priced at just $0.07 Near Presale Stage 5 Sellout",
    "url": "https://cryptodaily.co.uk/2024/01/solana-alternative-retik-finance-priced-at-just-007-near-presale-stage-5-sellout",
    "description": "As the world of blockchain and cryptocurrency continues to evolve, innovative solutions are emerging to address the challenges and limitations of existing systems."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-15T22:00:59.000Z",
    "title": "Reports Suggest That Binance is Reviewing the Status of Privacy Coins on Its Platform",
    "url": "https://news.bitcoin.com/reports-suggest-that-binance-is-reviewing-the-status-of-privacy-coins-on-its-platform/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/fe4d65dc-4f15-4bc7-92ed-3eba6932d50c-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Reports Hints at Binance Reviewing the Status of Privacy Coins in Its Platform\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/fe4d65dc-4f15-4bc7-92ed-3eba6932d50c-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/fe4d65dc-4f15-4bc7-92ed-3eba6932d50c-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/fe4d65dc-4f15-4bc7-92ed-3eba6932d50c-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/fe4d65dc-4f15-4bc7-92ed-3eba6932d50c-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/fe4d65dc-4f15-4bc7-92ed-3eba6932d50c-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/fe4d65dc-4f15-4bc7-92ed-3eba6932d50c-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/fe4d65dc-4f15-4bc7-92ed-3eba6932d50c.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Recent reports from members of the Zcash community indicate that Binance, the largest cryptocurrency exchange, would be preparing to review all privacy coins listed on its platform and possibly delist some. The exchange has been in talks with project representatives since November 2023, when it expressed its worries about not having the possibility of determining [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-15T22:00:21.000Z",
    "title": "Maker (MKR) Witnesses Notable Whales Accumulation Amidst 70% Price Surge",
    "url": "https://nulltx.com/maker-mkr-witnesses-notable-whales-accumulation-amidst-70-price-surge/",
    "description": "In the last month, Maker (MKR), the governance token linked to MakerDAO and the Maker Protocol, has seen an impressive 70% surge in its price. A recent analysis by LookOnChain, a prominent on-chain expert, suggests that during this period, significant crypto whales have been actively accumulating MKR. The report highlights [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-15T22:00:41.000Z",
    "title": "Dogecoin To See 24% Rally To $0.100 If This Holds: Analyst",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-to-see-23-rally-0-10-holds-analyst/",
    "description": "An analyst has explained that Dogecoin could rally towards $0.10 based on a pattern forming in its price if a support cluster continues to hold. Dogecoin Has Observed A Buy Signal On Its 3-Day Chart As explained by analyst Ali in a post on X, a TD-Sequential buy signal recently appeared for DOGE on its 3-day price. The &#8220;Tom Demark (TD) Sequential&#8221; here refers to an indicator in technical analysis that helps pinpoint locations of probable tops and bottoms in any asset&#8217;s price. This indicator is made up of two phases. The first is called the &#8220;setup&#8221; phase, and it&#8217;s nine-candles long. During this phase, nine candles of the same polarity are counted, and following the ninth, the asset could be assumed to have hit a point of reversal. Related Reading: How Low Can Bitcoin Go? CryptoQuant Head Reveals Target Whether the setup would indicate a buy or sell signal naturally depends on the prevailing price trend. If the price were going up during the setup (the candles were green), then the setup&#8217;s completion would indicate a potential point of selling. Similarly, the TD Sequential would mark a sell signal in the opposite case. Once the setup is complete, the second phase of the indicator, called the &#8220;countdown,&#8221; begins. This phase is thirteen candles long, and once these candles are in, the asset could once again be considered to have reached a probable bottom or top. Now, here is a chart shared by Ali that highlights the completion of a TD-Sequential setup phase for the 3-day price of Dogecoin: The TD-Sequential setup that has recently completed for DOGE &#124; Source: @ali_charts on X The above graph shows that the Dogecoin 3-day price has recently finished a TD-Sequential setup with red candles. This would imply that the indicator has given a buy signal for the asset. So far, since this setup has formed, DOGE has registered two green candles on this chart, implying that the meme coin&#8217;s price may have indeed witnessed a change of direction. In the same chart, the analyst has also highlighted a support cluster for the coin, where some important lines have converged around the $0.074 level. Based on this and the TD-Sequential pattern that has formed, Ali notes, &#8220;as long as the $0.074 support cluster continues to hold, DOGE has a great chance of rebounding to $0.100 or higher!&#8221; Related Reading: Bitcoin Erases $49,000 ETF Rally As Coinbase Users Take To Selling From the current spot price of the cryptocurrency, a potential rally to this $0.100 target would mean a surge of around 24% for the asset. If DOGE retests the $0.074 support level and rebounds to this high, the coin would see a rally of over 35%. DOGE Price Dogecoin opened 2024 with a deep plunge, and the memecoin has so far been unable to recover from it, as its price has mostly been stuck in consolidation. At present, DOGE is trading around the $0.0804 mark. Looks like the price of the asset hasn't moved much since its plunge a couple of weeks ago &#124; Source: DOGEUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com"
  }
]