[
  {
    "source": "CoinDesk",
    "date": "2023-06-14T09:02:12.000Z",
    "title": "Crypto Industry Destined to be Bitcoin Focused After SEC Actions: MicroStrategy Founder Michael Saylor",
    "url": "https://www.coindesk.com/company-news/2023/06/14/crypto-industry-destined-to-be-bitcoin-focused-after-sec-actions-microstrategy-founder-michael-saylor/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin maximalist Michael Saylor has said recent enforcement actions by U.S. regulators have made it clear that the crypto industry is destined to be rationalised down to a bitcoin (BTC)-focused industry."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-14T08:48:55.000Z",
    "title": "Bankrupt Crypto Exchange Bittrex U.S. Set to Allow Withdrawals Starting Thursday",
    "url": "https://www.coindesk.com/policy/2023/06/14/bankrupt-crypto-exchange-bittrex-us-set-to-allow-withdrawals-starting-thursday/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The move follows a Tuesday ruling from a Delaware court."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-14T09:04:15.000Z",
    "title": "Metaverse Tokens Lead Weekly Crypto Losses Amid SEC’s Securities Allegations",
    "url": "https://decrypt.co/144537/metaverse-tokens-lead-weekly-crypto-losses-sec-securities-allegations",
    "description": "The tokens powering various metaverse projects have failed to pump even after the highly anticipated launch of Apple’s new headset. "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-14T08:54:00.000Z",
    "title": "Terra Classic Community Unanimously Passes Parity Upgrade",
    "url": "https://cryptodaily.co.uk/2023/06/terra-classic-community-unanimously-passes-parity-upgrade",
    "description": "<p>A group of Terra Classic Core developers, the Joint L1 Task Force (L1TF), has announced that it is ready for the Parity Upgrade, set for the 14th of June, 2023.&nbsp;</p>\n<p>The Terra Classic Community unanimously voted in favor of Proposal 11561, paving the way for the critical update to be implemented.&nbsp;</p>\nThe Parity Upgrade&nbsp;\n<p>With the Terra Classic community passing the proposal, the Join L1 Task Force will initiate the upgrade on the 14th of June, bringing a host of significant changes to Terra Classic. The primary change will see the upgrade bring Terra Classic to parity with other blockchains, such as Terra 2.0 and other Cosmos chains. This will allow developers and projects to start building once again on the Terra Classic chain. The Parity upgrade is considered one of the most significant upgrades since the Terra community took control of the project following the Do Kwon-led Terra-Luna fiasco in May 2022. Do Kwon now faces multiple charges, and was arrested in Montenegro.</p>\n<p>Terra Classic will undergo the Parity upgrade at block height 13215800 and will be initiated at 14:00 UTC on the 14th of June. However, the block height and upgrade time could be changed. Validators and nodes must install the V2.1.1 release before the upgrade. The upgrade primarily consists of features such as a minimum 5% commission for validators, CosmWasm V1.1.x, and two security upgrades. Other significant changes included in the upgrade are WasmVM upgrade to V1.1.2, WASMd upgrades for multi-chain capability, IBC go v4.3.1, along with bug fixes.&nbsp;</p>\nUnprecedented Support&nbsp;\n<p>Proposal 11501 upgrade to V2.1.0 received unprecedented support, with 99.99% votes in favor of the proposal. The proposal received a minuscule 0.01% &ldquo;No&rdquo; votes. It also received almost no &ldquo;abstain&rdquo; and &ldquo;no with veto&rdquo; votes, indicating the strong level of support for it within the Terra Classic community. Several prominent validators supported the proposal, including Orion, Coinpayu, Allnodes, Interstake One, StakeBin, and others.&nbsp;</p>\nDevelopers Urged To Reach Out&nbsp;\n<p>The main goal of the Parity upgrade is to put Terra Classic at par with other Cosmos chains, such as Terra 2.0. This would allow developers and projects to create and upload their applications on the Terra Classic network. Joint L1 Task Force member LuncBurnArmy stated on Twitter,&nbsp;</p>\n\n<p>&ldquo;As I believe everyone in the #LUNC community is aware, this upcoming Wednesday, the 14th of June, is a milestone upgrade for the blockchain, as we will be at parity with other Cosmos blockchains, providing dApp developers with a much easier process of bringing their dApps over.&rdquo;</p>\n\n<p>Decentralized applications (dApp) and smart contract providers were urged to update the codebase of their projects to CosmWasm v2.1.0 and upload it. The Joint L1 Task Force announced that it would be helping dApps with several crucial requirements for the upgrade. Owners of decentralized applications with sealed smart contracts were urged to contact developer Fragwuerdig if they require help with the CosmWasm parity upgrade.&nbsp;</p>\nName Changed To V2.1.1&nbsp;\n<p>Joint L1 Task Force members also made crucial changes to the original V2.1.0 upgrade and changed the name to V2.1.1. According to GigHub, developers made around 19 additions and 9 deletions to files in the upgrade. This includes changing logs and fixing missing labels in the Wasm client.</p>\nA Historic Milestone&nbsp;\n<p>Terra Luna Classic staking also achieved a significant milestone as the upgrade looms, reaching 1 trillion LUNC staked. Furthermore, the community has burned an additional 63 billion LUNC. As a result, the staking ratio has reached a record high of 14.61%. Currently, out of 6.84 trillion LUNC tokens, around 5.8 trillion are in circulation.&nbsp;</p>\n\n<p>&ldquo;BREAKING: #LunaClassic officially has 1 TRILLION $LUNC staked! Congratulations to the community for this historic achievement! Let&rsquo;s go for 2 TRILLION next! Send it!&rdquo;</p>\n\n<p>Furthermore, the price of the LUNC token has seen a sustained rally following the news of the upgrade. The token was also the only cryptocurrency to remain positive last week, while all others were in the red. The asset&rsquo;s price has seen a jump of over 11.50%, rising to $0.000097, and could increase further following the Parity upgrade. The trading volume has also seen a considerable increase, rising by 120% in the last 24 hours.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T09:05:37.000Z",
    "title": "World Blockchain Summit Returns to Singapore: Bringing Together Global Crypto Leaders and Innovators",
    "url": "https://www.cryptopolitan.com/world-blockchain-summit-returns-to-singapore-bringing-together-global-crypto-leaders-and-innovators-2/",
    "description": "Tuesday, 06 June 2023: Following its highly successful flagship event held in Dubai in March of this year, the World Blockchain Summit is set to return to Singapore. Scheduled for 2,3 August 2023, The World Blockchain Summit Singapore aims to bring together investors, enterprises, industry leaders, and entrepreneurs to explore collaboration and investment opportunities and ... <a title=\"World Blockchain Summit Returns to Singapore: Bringing Together Global Crypto Leaders and Innovators\" class=\"read-more\" href=\"https://www.cryptopolitan.com/world-blockchain-summit-returns-to-singapore-bringing-together-global-crypto-leaders-and-innovators-2/\" aria-label=\"More on World Blockchain Summit Returns to Singapore: Bringing Together Global Crypto Leaders and Innovators\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T08:53:32.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T08:52:25.000Z",
    "title": "The U.S. is still undecided on issuing CBDC",
    "url": "https://www.cryptopolitan.com/the-us-is-still-undecided-on-issuing-cbdc/",
    "description": "The U.S. continues to navigate the uncharted waters of digital financial evolution, with Assistant Secretary for Financial Institutions at the Treasury Department, Graham Steele, underscoring the country&#8217;s measured approach to the idea of issuing Central Bank Digital Currencies (CBDCs). As he elucidated, the United States has yet to make a concrete decision about whether to ... <a title=\"The U.S. is still undecided on issuing CBDC\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-us-is-still-undecided-on-issuing-cbdc/\" aria-label=\"More on The U.S. is still undecided on issuing CBDC\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T08:49:39.000Z",
    "title": "Turncoin exposed – Another Crypto SCAM?",
    "url": "https://www.cryptopolitan.com/turncoin-exposed-another-crypto-scam/",
    "description": "When fundraising in 2019, the founder of crypto venture VirtualStax told potential investors his company would bring in $97 billion revenue in three years. But its tokens and its celebrity endorsers’ digital trading cards have yet to launch. VirtualStax executives have claimed the project is valued at $15 billion, and found a captive audience among ... <a title=\"Turncoin exposed – Another Crypto SCAM?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/turncoin-exposed-another-crypto-scam/\" aria-label=\"More on Turncoin exposed – Another Crypto SCAM?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-14T08:49:40.000Z",
    "title": "Altcoins gain traction while bitcoin’s social trend falls",
    "url": "https://crypto.news/altcoins-gain-traction-while-bitcoins-social-trend-falls/",
    "description": "As bitcoin (BTC) started to fall from the crucial $26,000 mark, the social volume and sentiment toward altcoins have risen tremendously, according to data provided by the market intelligence platform Santiment. While the prices of some of the major altcoins&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T09:00:59.000Z",
    "title": "Is DigiToads Innovative Approach to Blockchain Gaming Fueling TOADS Demand?",
    "url": "https://www.crypto-news-flash.com/is-digitoads-innovative-approach-to-blockchain-gaming-fueling-toads-demand/?utm_source=rss&utm_medium=rss&utm_campaign=is-digitoads-innovative-approach-to-blockchain-gaming-fueling-toads-demand",
    "description": "In recent times, a major advancement has taken place in the world of the DeFi cryptocurrency market. This development is called web3 gaming, which combines two exciting elements: ICO blockchain technology and gaming. This unique trend has created a new and thrilling experience for users. Therefore, DigiToads is emerging as the best cryptocurrency to buy [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T08:55:31.000Z",
    "title": "Coinfest Asia Uses Web2.5 Theme and Will Feature Over 100 Speakers",
    "url": "https://www.crypto-news-flash.com/coinfest-asia-uses-web2-5-theme-and-will-feature-over-100-speakers/?utm_source=rss&utm_medium=rss&utm_campaign=coinfest-asia-uses-web2-5-theme-and-will-feature-over-100-speakers",
    "description": "Bali, Indonesia, June 14th, 2023, Chainwire Coinfest Asia 2023 by Coinvestasi is ready to return on August 24-25 2023, in Jimbaran, Bali. Carrying the theme of Web2.5, Coinfest Asia wants to strengthen the linkages between the Web2 and Web3 industries, thus forming a more resilient Web2.5 industry. This festival will invite participants to explore real [...]"
  }
]