[
  {
    "source": "Cointelegraph",
    "date": "2023-11-24T19:45:57.000Z",
    "title": "Crypto documentary ‘Bull Run’ takes on Bitcoin, tokenization and trading addiction",
    "url": "http://cointelegraph.com/news/crypto-documentary-bull-run-bitcoin-tokenization-trading-addiction",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/91547310-41be-4e49-824d-9ed968b4f4b3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>“Bull Run” explores one director’s obsession with trading cryptocurrencies during the bull market and how it led her to create a tokenized crypto documentary.</p>\n                    <p><p>The film industry has been suggested by many as one of the next frontiers of Web3 and blockchain technology. With movies historically funded by wealthy investors or centralized production companies, blockchain offers a unique set of tools to decentralize the investment process. Filmmakers can launch projects quicker, and individuals can have a stake in the financial outcome of a film in a way not historically possible — all with the benefit of blockchain’s transparency and efficiency.</p><p>The trend toward tokenization in all forms of entertainment is growing, and with it has come the seemingly increasing mainstream acceptance of films with a crypto bent. </p><p>One such example can be found in the film <em>Bull Run</em>, a Spanish documentary that recently had its international premiere on Nov. 15 at the Doc NYC documentary film festival in New York City. <em>Bull Run</em>, directed by Ana Ramón Rubio, describes itself as “the first tokenized film in history,” having <a href=\"https://blog.bullrunlapelicula.com/untitled/\" target=\"_blank\" rel=\"noopener nofollow\">raised</a> 320,000 euros (roughly $370,000 at the time) <a href=\"https://es.cointelegraph.com/news/bitcoin-film-financed-in-spain-in-less-than-24-hours\">in just 24 hours in September 2021</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/e8aee36a-0550-4274-9c32-e482fb89ccb3.jpg\"  /><figcaption style=\"text-align: center;\"><em>Director Ana Ramón Rubio (middle) and producer Juanjo Moscardó (right) at the Doc NYC international premiere. (Source: Cointelegraph)</em></figcaption></figure><p>According to producer Juanjo Moscardó, the process was game-changing. “My last movie, we were four years to raise the money to finance it,” he said during a Q&amp;A session about the film. “And as I say in the movie, this was only in one day to raise.”</p><p>“We think it’s a very good option to finance with tokenization because there are some things that you can’t wait to film or to start shooting, but you have to have the money. And this is what we wanted to do — only <em>Bull Run</em>. And we wanted to go in the bull run.”</p><p>The film’s backers were given BULL tokens, <a href=\"https://www.bullrunlapelicula.com/en/#benefits\" target=\"_blank\" rel=\"noopener nofollow\">described</a> as a security token that represents “the debt issued for the film and grants certain rights to the film’s profits.” Holders are guaranteed a certain percentage of the profits distributed via blockchain along with other benefits such as invitations to premiers and producer credits. The top investor was also given 60 seconds of airtime to say literally whatever they wanted, which was cut up and played at various points throughout the film.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sundance-film-festival-embraces-blockchain-and-crypto-film-initiatives\"><strong><em>Sundance Film Festival embraces blockchain and crypto film initiatives</em></strong></a></p><p>The documentary started shooting at the height of the bull market in late 2021. As explained in the film, Rubio was introduced to crypto by a friend, and she soon became addicted to trading and the dizzying gains she witnessed. Her family was not thrilled, told her it was a pyramid scheme, and begged her to give up trading and go to therapy instead. But rather than giving it up, she made a documentary about it.</p><p><em>Bull Run</em> is a first-person account of how the exponential gains one can see during a bull market can quickly become all-consuming. While the documentary breaks down the basics of blockchain and features interviews with several prominent Spanish-speaking crypto personalities, the film’s emotional core centers around Rubio’s trading obsession and how it affects her life. </p><p>It’s a rather meta film and primarily follows the behind-the-scenes of the filmmaker’s journey and the creation of the documentary itself. For example, during an interview with Miguel Ángel González, host of the <em>Bitcoin al Dia</em> (“Bitcoin Every Day”) YouTube channel, the camera cuts away to reveal Rubio passing her cellphone to someone on her production team so that he can trade for her during the interview.</p><blockquote class=\"twitter-tweet\"><p lang=\"es\" dir=\"ltr\">Detrás de cámaras del rodaje de &quot;Bull Run&quot; junto al equipazo que ha trabajado para poder hacer posible este revolucionario proyecto en compañía de grandes invitados <a href=\"https://twitter.com/hashtag/bullrunlapelicula?src=hash&amp;ref_src=twsrc%5Etfw\">#bullrunlapelicula</a> <a href=\"https://twitter.com/hashtag/bullrun?src=hash&amp;ref_src=twsrc%5Etfw\">#bullrun</a> <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> <a href=\"https://twitter.com/hashtag/cripto?src=hash&amp;ref_src=twsrc%5Etfw\">#cripto</a> <a href=\"https://twitter.com/hashtag/tothemoon?src=hash&amp;ref_src=twsrc%5Etfw\">#tothemoon</a> <a href=\"https://t.co/harbWQb7bV\">pic.twitter.com/harbWQb7bV</a></p>&mdash; Bull Run (@Bullrunlapeli) <a href=\"https://twitter.com/Bullrunlapeli/status/1459254682703077382?ref_src=twsrc%5Etfw\">November 12, 2021</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While <em>Bull Run</em> is surprisingly funny and overall light-hearted, it also dives deep into the director’s personal life, exploring how her crypto trading affected her relationship with her husband and how this documentary reignited her passion for filmmaking. Importantly, it also follows Rubio as everything comes crashing down in 2022. In fact, one of the most critical threads throughout the film is her journey from primarily looking at crypto as a speculative asset to being forced to reevaluate its purpose during the bear market, finally learning how people around the world are using Bitcoin and blockchain technology to better their lives and improve legacy, centralized systems.</p><p>The pace of change in the cryptosphere is rapid, as can clearly be seen in <em>Bull Run</em>. So, what does Rubio think about crypto now, more than two years into her blockchain journey? “I am mostly a Bitcoin believer right now,” she told Cointelegraph. “There are other very interesting projects, but I don’t know what will happen with them. Of course, I don’t know what will happen with Bitcoin, but I believe it will be successful. And so right now, I’m a holder.”</p><p>As for whether she thinks she will end up down the trading rabbit hole again: </p><blockquote>“I don’t know if in 2025, when a new bull run starts, if I will be a little bit more of a trader. Let’s see how this addiction is handled.”</blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/\"><strong><em>Cryptocurrency trading addiction — What to look out for and how it is treated</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-24T19:49:38.000Z",
    "title": "UK approves tokenization of FCA-authorized investment funds",
    "url": "https://cryptoslate.com/uk-approves-tokenization-of-fca-authorized-investment-funds/",
    "description": "<p>The U.K. has officially greenlit a project that will allow authorized funds to develop tokenization in the investment sector in an effort to boost efficiency, transparency, and competitiveness, according to a Nov. 24 press release issued by The Investment Association, which represents the sector. The initiative is part of a concerted effort by the Technology [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/uk-approves-tokenization-of-fca-authorized-investment-funds/\">UK approves tokenization of FCA-authorized investment funds</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-24T20:00:29.000Z",
    "title": "Polkadot (DOT) and Polygon (MATIC) Ride the Crypto Wave - What's Behind the Surge?",
    "url": "https://cryptodaily.co.uk/2023/11/polkadot-dot-and-polygon-matic-ride-the-crypto-wave-whats-behind-the-surge",
    "description": "Witness Polkadot (DOT) and Polygon (MATIC) taking center stage! Dive into exclusive price analyses, predictions, and insider insights on the potential explosive rallies. Uncover the latest crypto developments and stay ahead in the ever-evolving market. Your guide to crypto opportunities awaits"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T20:09:04.000Z",
    "title": "Changpeng Zhao’s legal team challenges U.S. motion to restrict travel",
    "url": "https://www.cryptopolitan.com/changpeng-zhaos-legal-team-challenges-u-s-motion-to-restrict-travel/",
    "description": "The legal defense team of Changpeng Zhao, former CEO of Binance, has mounted a robust argument against a motion seeking to restrict his movement to the United States. This motion, filed by prosecutors, aims to keep Zhao in the U.S. until his sentencing in February next year. The unfolding legal drama encapsulates a crucial debate ... <a title=\"Changpeng Zhao&#8217;s legal team challenges U.S. motion to restrict travel\" class=\"read-more\" href=\"https://www.cryptopolitan.com/changpeng-zhaos-legal-team-challenges-u-s-motion-to-restrict-travel/\" aria-label=\"More on Changpeng Zhao&#8217;s legal team challenges U.S. motion to restrict travel\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T20:07:40.000Z",
    "title": "Former SEC official says CZ has ties to Hamas and ISIS",
    "url": "https://www.cryptopolitan.com/former-sec-official-cz-ties-to-hamas-isis/",
    "description": "In a turn of events that seems more like a plot twist in a high-stakes financial thriller, Changpeng Zhao (CZ), the well-known Binance founder, finds himself at the center of a controversial legal battle. John Reed Stark, a former SEC official, has put forth allegations that could redefine the narrative around CZ and his business ... <a title=\"Former SEC official says CZ has ties to Hamas and ISIS\" class=\"read-more\" href=\"https://www.cryptopolitan.com/former-sec-official-cz-ties-to-hamas-isis/\" aria-label=\"More on Former SEC official says CZ has ties to Hamas and ISIS\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T19:59:36.000Z",
    "title": "President Javier Milei to dissolve Argentina’s central bank",
    "url": "https://www.cryptopolitan.com/milei-to-dissolve-argentina-central-bank/",
    "description": "Buenos Aires – President-elect Javier Milei of Argentina, known for his unapologetically bold economic reforms, has reaffirmed his commitment to disbanding the nation&#8217;s central bank. This move, long considered a cornerstone of his libertarian agenda, stands as a testament to his unwavering stance on radical economic restructuring. New Cabinet, New Directions As Milei readies to ... <a title=\"President Javier Milei to dissolve Argentina&#8217;s central bank\" class=\"read-more\" href=\"https://www.cryptopolitan.com/milei-to-dissolve-argentina-central-bank/\" aria-label=\"More on President Javier Milei to dissolve Argentina&#8217;s central bank\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T19:51:19.000Z",
    "title": "SEC vs. Do Kwon and – Current status",
    "url": "https://www.cryptopolitan.com/sec-vs-do-kwon-and-current-status/",
    "description": "Terraform Labs and its former CEO Do Kwon are currently embroiled in a high-stakes legal battle with the U.S. Securities and Exchange Commission (SEC), stemming from the dramatic collapse of the UST stablecoin. This confrontation reflects the broader challenges and regulatory scrutiny that the crypto industry is facing, highlighting the complexities of legal accountability in ... <a title=\"SEC vs. Do Kwon and &#8211; Current status\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-vs-do-kwon-and-current-status/\" aria-label=\"More on SEC vs. Do Kwon and &#8211; Current status\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T19:50:52.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: ARB breaks key barrier",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the blockchain world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain‘s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: ARB breaks key barrier\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: ARB breaks key barrier\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T19:40:31.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices to consider when investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-24T20:05:34.000Z",
    "title": "L2 Blast on multi-sig debate: Security exists on spectrum, nothing is fully secure",
    "url": "https://crypto.news/l2-blast-on-multi-sig-debate-security-exists-on-spectrum-nothing-is-fully-secure/",
    "description": "Paradigm-backed network Blast addressed skepticism surrounding its blockchain model following a swift rise to over $300 million in market cap and promises of a token airdrop."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-24T20:00:20.000Z",
    "title": "Ethereum Conquers $2,100: On-Chain Data Paints Path To $2,400",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-conquers-2100-on-chain-data-2400/",
    "description": "Ethereum has cleared the $2,100 level during the past day, and if on-chain data is anything to go by, a rally to new yearly highs should be &#8220;easy.&#8221; Ethereum Has No Major On-Chain Resistance At Higher Levels An analyst in a post on X explained that Ethereum has overcome a major on-chain resistance zone with its recent price rally. The on-chain resistance and support levels are defined based on the density of investors who bought at them. The reason behind this lies in how investor psychology tends to work. For any investor, their cost basis is an important level, so whenever the price retests, they pay special attention and might be tempted to make some kind of move. Related Reading: Is Dogecoin About To Reverse? Key Factors To Watch A holder who had been at a loss before the retest might lean towards selling, as they may fear the cryptocurrency would dip below it again, so exiting at the break-even would at least mean they would avoid losses. Similarly, an investor might decide to accumulate more if they had been in profits earlier, as they would see this same level as a profitable point of entry into the asset. Now, here is a chart that shows how the Ethereum price ranges around the current price are looking in terms of the density of investors who share their cost basis there: Looks like the levels above don't host the cost basis of that many investors &#124; Source: @ali_charts on X As displayed in the above graph, the Ethereum price range between $1,982 and $2,044 hosts the cost basis of about 1.67 million addresses, which acquired 38.73 million ETH at these levels. Naturally, the more investors that share their cost basis inside a specific range, the stronger the reaction that the price would feel when it retests due to the aforementioned buying/selling effects. Thus, this range that&#8217;s thick with investors would be a significant zone for the cryptocurrency. Since Ethereum has already surged past this area and has gained some distance over it with its latest break, the range is likely to play the role of support now. Related Reading: Will Recent Binance Events Trigger This Historical Bitcoin Bull Run Signal? Ethereum has this strong support area under its belt, while at the same time, there are no major resistance zones immediately above, as is apparent from the chart. This ideal setup means that, in theory, ETH shouldn&#8217;t have much trouble rallying towards the $2,426 level. Another analyst has also pointed out how Ethereum has observed negative exchange netflows since the start of the month. The exchange netflow here is an indicator that keeps track of the net amount of ETH exiting or entering the wallets of all centralized exchanges. The indicator's value has been negative recently &#124; Source: @C__thumbs on X The net outflows have amounted to over $1 billion during this period, a potential sign that significant buying has been occurring in the space. This certainly fuels the idea that ETH could explore new yearly highs shortly. ETH Price At the time of writing, Ethereum is trading at around $2,100, up 9% in the past week. ETH has been climbing in the last few days &#124; Source: ETHUSD on TradingView Featured image from Bastian Riccardi on Unsplash.com, charts from TradingView.com, IntoTheBlock.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-24T19:58:00.000Z",
    "title": "El Salvador President Losses Approximately $8M in Bitcoin Investment",
    "url": "https://coinedition.com/el-salvador-president-losses-approximately-8m-in-bitcoin-investment/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/El_Salvador_Bitcoin_bond_delayed_due_to_security_concerns_Tether.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"El Salvador President Losses Approximately $8M in Bitcoin Investment\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/El_Salvador_Bitcoin_bond_delayed_due_to_security_concerns_Tether.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/El_Salvador_Bitcoin_bond_delayed_due_to_security_concerns_Tether-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/El_Salvador_Bitcoin_bond_delayed_due_to_security_concerns_Tether-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/El_Salvador_Bitcoin_bond_delayed_due_to_security_concerns_Tether-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/El_Salvador_Bitcoin_bond_delayed_due_to_security_concerns_Tether-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The El Salvadoran president has invested over $126 million in bitcoin since 2021. The current value of the president’s holdings is around $118 million, translating to a loss of over $8 million. The president’s most expensive batch purchase consisted of 420 BTC priced at $60,345 each, which has independently incurred a loss of $9,354,937. President [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/el-salvador-president-losses-approximately-8m-in-bitcoin-investment/\">El Salvador President Losses Approximately $8M in Bitcoin Investment</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-24T19:40:00.000Z",
    "title": "Solana Set to Outshine Ethereum in the Next Bull Run, Predicts Analyst",
    "url": "https://coinedition.com/solana-set-to-outshine-ethereum-in-the-next-bull-run-predicts-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/😒_There_are_not_a_lot_of_big_Solana_believers_even_as_its_price.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Solana Would Be the Second-Highest Gainer During Bull Run: YouTuber\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/😒_There_are_not_a_lot_of_big_Solana_believers_even_as_its_price.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/😒_There_are_not_a_lot_of_big_Solana_believers_even_as_its_price-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/😒_There_are_not_a_lot_of_big_Solana_believers_even_as_its_price-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/😒_There_are_not_a_lot_of_big_Solana_believers_even_as_its_price-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/😒_There_are_not_a_lot_of_big_Solana_believers_even_as_its_price-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/😒_There_are_not_a_lot_of_big_Solana_believers_even_as_its_price-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Ben Armstrong, a renowned crypto YouTuber, thinks Solana would be one of the best-performing cryptocurrencies in the upcoming bull run. In a recently uploaded video, Armstrong described Solana as a “Christmas gift that just keeps on giving.” Despite his observations and Solana’s recent antecedents, Armstrong thinks that Solana is poised to be the second-highest achiever [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/solana-set-to-outshine-ethereum-in-the-next-bull-run-predicts-analyst/\">Solana Set to Outshine Ethereum in the Next Bull Run, Predicts Analyst</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-24T19:45:06.000Z",
    "title": "Embattled Crypto Lender Genesis Files Lawsuit Against Gemini in an Effort To Recover Over $689,000,000",
    "url": "https://dailyhodl.com/2023/11/24/embattled-crypto-lender-genesis-files-lawsuit-against-gemini-in-an-effort-to-recover-over-689000000/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Institutional-Crypto-Lender-Genesis.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Institutional-Crypto-Lender-Genesis.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Institutional-Crypto-Lender-Genesis.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Institutional-Crypto-Lender-Genesis.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Institutional-Crypto-Lender-Genesis.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Institutional-Crypto-Lender-Genesis.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Institutional-Crypto-Lender-Genesis.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Beleaguered crypto lender Genesis is suing cryptocurrency exchange Gemini to recover over half a billion dollars in preferential transfers. A preferential transfer is paid off by an insolvent firm to a creditor typically within 90 days before filing for bankruptcy. If certain conditions are met, the recipient may have to return the funds so that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/24/embattled-crypto-lender-genesis-files-lawsuit-against-gemini-in-an-effort-to-recover-over-689000000/\">Embattled Crypto Lender Genesis Files Lawsuit Against Gemini in an Effort To Recover Over $689,000,000</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-24T19:41:42.000Z",
    "title": "Coinbase’s Bitcoin Reserves Skyrocket by Over $450,000,000 As Binance BTC Holdings Plunge: On-Chain Data",
    "url": "https://dailyhodl.com/2023/11/24/coinbases-bitcoin-reserves-skyrocket-by-over-450000000-as-binance-btc-holdings-plunge-on-chain-data/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/coinbase-massive-settlement-fraud.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/coinbase-massive-settlement-fraud.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/coinbase-massive-settlement-fraud.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/coinbase-massive-settlement-fraud.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/coinbase-massive-settlement-fraud.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/coinbase-massive-settlement-fraud.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/coinbase-massive-settlement-fraud.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New on-chain data reveals that top US-based crypto exchange Coinbase is seeing its Bitcoin (BTC) reserves skyrocket as Binance’s BTC holdings plummet. According to data from blockchain tracker CryptoQuant, Coinbase’s BTC reserves have increased by 12,000 BTC, worth about $450 million, while Binance’s Bitcoin holdings have decreased by about 5,000 BTC, or $187 million. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/24/coinbases-bitcoin-reserves-skyrocket-by-over-450000000-as-binance-btc-holdings-plunge-on-chain-data/\">Coinbase’s Bitcoin Reserves Skyrocket by Over $450,000,000 As Binance BTC Holdings Plunge: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]