[
  {
    "source": "Cointelegraph",
    "date": "2023-12-29T09:04:00.000Z",
    "title": " OKX crypto exchange to delist privacy tokens in early 2024 ",
    "url": "https://cointelegraph.com/news/okx-exchange-delist-privacy-tokens",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMmViNTQ0MGQtZjA4Yi00NmFiLTkzOTEtMWVhZmEzM2EyOWY1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>OKX said that the latest decision to remove a number of trading pairs was based on feedback from users and the OKX token delisting guidelines.</p>\n                    <p><p>Major cryptocurrency exchange OKX will be delisting several prominent <a href=\"https://cointelegraph.com/news/what-are-privacy-coins-and-how-do-they-differ-from-bitcoin\">privacy-focused cryptocurrencies</a> including Monero (<a href=\"https://cointelegraph.com/xmr-price-index\">XMR</a>) in early 2024.</p><p>OKX officially <a href=\"https://www.okx.com/help/okx-to-delist-several-spot-trading-pairs-12-29\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> on Dec. 29 that it will delist a number of trading pairs involving major privacy tokens like Monero and Zcash (<a href=\"https://cointelegraph.com/zec-price-index\">ZEC</a>), as well as partly-private coins like Dash (<a href=\"https://cointelegraph.com/tags/dash\">DASH</a>) and Horizen (ZEN).</p><p>“In order to maintain a robust spot trading environment, we constantly monitor the performance of all listed trading pairs and review their listing qualifications on a regular basis,” OKX said in the announcement. The firm added that the decision was made “based on feedback from users” and the OKX token delisting or hiding guideline.</p><p><a href=\"https://cointelegraph.com/news/okx-exchange-delist-privacy-tokens\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-29T09:00:55.000Z",
    "title": "Vitalik wants Ethereum to be more ‘Cypherpunk’ hailing the social layer as its core USP",
    "url": "https://cryptoslate.com/vitalik-wants-ethereum-to-be-more-cypherpunk-hailing-the-social-layer-as-its-core-usp/",
    "description": "<p>Ethereum&#8217;s co-founder Vitalik Buterin shared his insights on the evolving landscape of the crypto ecosystem on Dec. 29, mainly focusing on Ethereum&#8217;s role in shaping a more open and decentralized internet in a blog post entitled &#8220;Make Ethereum Cypherpunk Again.&#8221; Since its inception, Ethereum has journeyed beyond being a mere extension of Bitcoin with smart contracts. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/vitalik-wants-ethereum-to-be-more-cypherpunk-hailing-the-social-layer-as-its-core-usp/\">Vitalik wants Ethereum to be more ‘Cypherpunk’ hailing the social layer as its core USP</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T08:57:56.000Z",
    "title": "The Rise of Ambient AI: A Seamless Integration into Everyday Life",
    "url": "https://www.cryptopolitan.com/ambient-ai-integration-into-everyday-life/",
    "description": "In an era where artificial intelligence (AI) continues to advance at an unprecedented pace, a new paradigm known as &#8220;ambient AI&#8221; is quietly reshaping the way we live and work. While AI has often been associated with groundbreaking solutions and monumental challenges, ambient AI is taking a different approach, seamlessly integrating into our daily routines [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T08:48:55.000Z",
    "title": "SEC charges Diana Fernandez in crypto investment fraud",
    "url": "https://www.cryptopolitan.com/sec-charges-diana-fernandez-in-crypto/",
    "description": "The Securities and Exchange Commission (SEC) has charged Diana Mae Fernandez, 37, with conducting a fraudulent securities offering. According to a recent litigation release, Fernandez allegedly promised investors high returns, up to 63%, by investing their funds in cryptocurrencies, various companies, and luxury real estate. Instead, the SEC claims that she used these funds for [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T08:47:50.000Z",
    "title": "China Makes First Arrests in ChatGPT-Aided Ransomware Attack",
    "url": "https://www.cryptopolitan.com/china-arrests-chatgpt-aid-ransomware-attack/",
    "description": "An unidentified company in Hangzhou, China recently fell victim to a ransomware attack perpetrated using ChatGPT, leading to the first arrests in the country involving the AI chatbot. Chinese authorities revealed that four cybercriminals were detained late last month &#8211; two in Beijing and two in Inner Mongolia. The suspects confessed to utilizing ChatGPT to [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-29T08:44:42.000Z",
    "title": "Cryptocurrency Trends: ORDI Faces Downturn as Solana and Rebel Satoshi Experience Growth Surge",
    "url": "https://nulltx.com/cryptocurrency-trends-ordi-faces-downturn-as-solana-and-rebel-satoshi-experience-growth-surge/",
    "description": "TLDR: Rebel Satoshi ($RBLZ) is the best crypto to buy with forecasts for a 25% price growth in 2024. ORDI bulls expect ORDI to hit $65.39 in a few weeks. Solana (SOL) analysts expect SOL to reach $160.50. Prudent investments in top crypto coins enable wealth generation while minimizing the risk of substantial [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-29T08:45:00.000Z",
    "title": "Ethereum falls as Cosmos rises; Arweave and InQubeta lead altcoin rally",
    "url": "https://crypto.news/ethereum-falls-as-cosmos-rises-arweave-and-inqubeta-lead-altcoin-rally/",
    "description": "This article explores Ethereum's decline and the factors propelling Arweave and InQubeta's success"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-29T08:59:44.000Z",
    "title": "How Did NFTs Perform in 2023?",
    "url": "https://www.altcoinbuzz.io/spotlight/how-did-nfts-perform-in-2023/",
    "description": "<p>As we bid farewell to another transformative year in the crypto space, we must evaluate how different sectors of the market performed. In this article, we will look at one of the most captivating phenomena that has continued to redefine the crypto ecosystem: Non-fungible tokens (NFTs). How did NFTs do in 2023? NFT projects played [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/spotlight/how-did-nfts-perform-in-2023/\">How Did NFTs Perform in 2023?</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]