[
  {
    "source": "Cointelegraph",
    "date": "2023-12-08T14:01:00.000Z",
    "title": " Bitcoin’s many deaths: Is crypto market past ‘point of no return?’ ",
    "url": "https://cointelegraph.com/news/bitcoin-deaths-crypto-market-adoption",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNjk1NjFiYmQtNTgyNy00OTNjLTk0YmQtZDI4YWI3MjgzOWI2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p> Bitcoin has been declared dead more times than you’d think amid downswings in the market, but it’s always managed to bounce back. </p>\n                    <p><p>Bitcoin and the broader crypto market have been gleefully declared dead more than a few times during bear markets, but some experts say it would take a genuinely extreme set of events for it to truly die.</p><p>According to 99Bitcoins — a website that, among other things, <a href=\"https://99bitcoins.com/bitcoin-obituaries/\" target=\"_blank\" rel=\"noopener nofollow\">tracks</a> how many times Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has been declared dead by mainstream media outlets — the largest crypto by market cap <a href=\"https://cointelegraph.com/news/crypto-bitcoin-is-not-longest-ever-bear-market\">has died 474 times</a> since 2010. </p><p>Often, the proclamation is met with cheering by crypto skeptics as evidence that <a href=\"https://cointelegraph.com/news/pwc-hedge-fund-survey-crypto-remains-viable-despite-recent-market-turmoil\">BTC is not a viable asset</a>, but it might not be so simple <a href=\"https://cointelegraph.com/news/crypto-is-dead-in-america-tech-billionaire-chamath-palihapitiya\">to kill off crypto</a> — at least according to some experts in the space. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-deaths-crypto-market-adoption\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-08T13:54:45.000Z",
    "title": " Microsoft faces UK antitrust probe over OpenAI deal structure ",
    "url": "https://cointelegraph.com/news/microsoft-faces-uk-antitrust-probe-over-openai-deal-structure",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMTcwZmUxNzAtMzA0Ni00YTVkLTgwYWUtYmI0NTgyZDViNmU3LkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The regulator’s examination will assess whether the collaboration constitutes an “acquisition of control,” implying substantial influence of one party over another.</p>\n                    <p><p>The UK’s antitrust regulator is considering initiating a merger investigation into Microsoft’s multi-billion dollar collaboration with OpenAI. </p><p>This announcement resulted in a response from Microsoft, declaring that it only plays a non-voting observer role on the board of the ChatGPT maker.</p><p>The investigation <a href=\"https://www.gov.uk/government/news/cma-seeks-views-on-microsofts-partnership-with-openai\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a> follows the ChatGPT maker’s disclosure that the U.S. tech giant would hold a non-voting board seat. The examination will assess whether the collaboration constitutes an “acquisition of control,” implying substantial influence of one party over another, as stated by the Competition and Markets Authority (CMA) on Friday, Dec. 8.</p><p><a href=\"https://cointelegraph.com/news/microsoft-faces-uk-antitrust-probe-over-openai-deal-structure\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-08T14:00:58.000Z",
    "title": "Bitcoin miner revenue per exahash spikes, nearing yearly high",
    "url": "https://cryptoslate.com/insights/bitcoin-miner-revenue-per-exahash-spikes-nearing-yearly-high/",
    "description": "<p>Quick Take In a notable development in the Bitcoin mining arena, an uptick in miner fees was observed by CryptoSlate yesterday. Miner revenue per Exahash, a metric applied to estimate the daily income of miners in relation to their network hash-power contribution, has experienced a significant surge. This metric, calculated by the ratio of total [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-miner-revenue-per-exahash-spikes-nearing-yearly-high/\">Bitcoin miner revenue per exahash spikes, nearing yearly high</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-08T13:50:12.000Z",
    "title": "Solana liquid staking token JTO surges 85% post-exchange debut, following unique airdrop event",
    "url": "https://cryptoslate.com/solana-liquid-staking-token-jto-surges-85-post-exchange-debut-following-unique-airdrop-event/",
    "description": "<p>Solana-based liquid staking project Jito&#8217;s JTO token price soared more than 80% following its trading debut across multiple major exchanges like Coinbase and Binance. Data from CoinMarketCap shows that JTO&#8217;s value surged to more than $3 during the past day, representing an 85% growth for the newly launched digital asset. JTO&#8217;s price has retraced to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/solana-liquid-staking-token-jto-surges-85-post-exchange-debut-following-unique-airdrop-event/\">Solana liquid staking token JTO surges 85% post-exchange debut, following unique airdrop event</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-08T14:04:54.000Z",
    "title": "Cook Up Magic in Disney Dreamlight Valley with These Recipes",
    "url": "https://www.cryptopolitan.com/disney-dreamlight-valley-recipes/",
    "description": "Disney Dreamlight Valley players, get ready to elevate your culinary skills as we delve into the delectable world of cooking within this enchanting game. Whether you&#8217;re looking to make your crops more valuable or strengthen your bonds with the beloved Disney characters of Dreamlight Valley, cooking plays a crucial role in your journey.These are the ... <a title=\"Cook Up Magic in Disney Dreamlight Valley with These Recipes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/disney-dreamlight-valley-recipes/\" aria-label=\"More on Cook Up Magic in Disney Dreamlight Valley with These Recipes\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-08T13:45:36.000Z",
    "title": "India signals potential veto on Pakistan’s BRICS membership bid",
    "url": "https://www.cryptopolitan.com/india-veto-on-pakistans-brics-membership-bid/",
    "description": "India has recently articulated its stance regarding Pakistan&#8217;s aspiration to join the BRICS (Brazil, Russia, India, China, South Africa) alliance. Arindam Bagchi, the spokesperson for India&#8217;s Ministry of External Affairs (MEA), addressed this topic during a press conference. While responding to queries about Pakistan&#8217;s intent to join BRICS, Bagchi&#8217;s statements suggested that India might exercise ... <a title=\"India signals potential veto on Pakistan&#8217;s BRICS membership bid\" class=\"read-more\" href=\"https://www.cryptopolitan.com/india-veto-on-pakistans-brics-membership-bid/\" aria-label=\"More on India signals potential veto on Pakistan&#8217;s BRICS membership bid\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-08T13:40:21.000Z",
    "title": "Google’s Share Price Surges 5% on Gemini AI Model Announcement",
    "url": "https://www.cryptopolitan.com/googles-share-price-surges-5-on-gemini-ai/",
    "description": "Google&#8217;s shares experienced a remarkable increase of over 5% on Thursday, driven by unveiling of its latest artificial intelligence (AI) model, Gemini. This strategic move positions Google as a formidable contender in the competitive AI landscape alongside significant players like OpenAI, Microsoft, and Meta. The stock market responded positively, marking one of Google&#8217;s most favorable ... <a title=\"Google&#8217;s Share Price Surges 5% on Gemini AI Model Announcement\" class=\"read-more\" href=\"https://www.cryptopolitan.com/googles-share-price-surges-5-on-gemini-ai/\" aria-label=\"More on Google&#8217;s Share Price Surges 5% on Gemini AI Model Announcement\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-08T14:00:29.000Z",
    "title": "Ethereum Price Soars To Over $2,300 – Is $3,000 Next?",
    "url": "https://www.newsbtc.com/news/ethereum-price-soars-to-over-2300-is-3000-next/",
    "description": "The market performance of Ethereum has been steadily rising since October, marking a positive and long-lasting trend. Increased buying activity has been the main driver of this positive momentum that has persisted over time, pushing the cryptocurrency beyond the vaunted $2,000 resistance mark and igniting a continuing rally. The value of Ethereum has sharply grown as a direct result of this increased demand and market optimism, with its sights set on breaking through the crucial resistance region at $2,300. This upward trend serves as another evidence of the increasing investor trust and general bullishness surrounding Ethereum, thereby solidifying its place in the changing cryptocurrency market. Related Reading: This BRC-20 Token Just Breached $1 Billion Market Cap With 180% Rally Today – Details Ethereum Hits 18-Month Highs, Targets $3,000 Ethereum, the second-largest cryptocurrency in the world, is rising quickly and has reached levels not seen in the previous 18 months. With a market valuation of $285 billion, ETH is now trading 5.7% higher at $2,375 as of the time of publication. Some speculators have even shared $3,000 price predictions for ETH amid the latest market breakout. Ethereum&#8217;s approaching resistance level poses a huge challenge to buyers of the altcoin, including the fixed barrier at $2.5K, which has frequently shown to be a significant roadblock. But if the market is able to recapture this critical area, Ethereum may go on to reach the $2.5K &#8211; or even $3.000 &#8212; in the future. Ethereum currently trading at $2,358 territory on the daily chart: TradingView.com As Ethereum breaks down further obstacles, investors and market watchers are keeping a close eye on the situation. A notable indication of the increased interest from institutional investors is the eagerness with which major players like VanEck, BlackRock, and Grayscale are awaiting clearance for Spot Ethereum ETFs. According to Santiment, an on-chain data service, Ethereum has reached $2,349, its highest price since June 2022. The amalgamation of the positive long-term trend indicating a rise in wealth for the leading non-exchange whale wallets and a decrease in sell-off power for the leading exchange whale wallets presents a propitious situation for a steady upward trend. Ethereum&#8217;s Non-Exchange Holdings Surge To 55M ETH A recent tweet from Santinment highlights some intriguing variations in Ethereum&#8217;s wallet mechanics. Exchange wallets saw a five-year low of 9.3 million ETH, while top non-exchange wallets are building up to a record 54.6 million ETH. This move points to upward trends, with wealth building through non-exchange transactions and decreased selling pressure. Related Reading: XRP Greed Index Soars, Backed By Robust $1.3 Billion Volume – Good For Price? Over the course of two months, a bearish divergence between the price and the RSI indicator grew, pointing to a possible overvaluation of Ethereum at this point. Given the current characteristics of the market, even if buyers seem to be in charge and overall sentiment is bullish, there is a significant likelihood of a brief corrective phase that involves consolidation and higher volatility in the near future. Meanwhile, a recent ACDE meeting provided information about the impending Dencun fork of Ethereum, which is set to occur in January 2024. The Goerli network testnet fork was well-prepared for by development teams, opening the door for a larger Goerli shadow network fork in the coming weeks. ACDE#176 happened earlier today: we discussed the state of Dencun, timelines for testnets, and how to approach planning the following network upgrade ⛓️ Agenda: https://t.co/ATVLQ7f9Xp Stream: https://t.co/tDM0tDKxC5 Recap below 👇 https://t.co/PhGBkYxhYN — timbeiko.eth ☀️ (@TimBeiko) December 7, 2023 By using proto-danksharding, Dencun is expected to greatly increase data availability for layer-2 rollups. This improvement should result in lower rollup transaction costs, which will eventually help end customers. Dencun&#8217;s overall effects include rollups that increase Ethereum&#8217;s scalability, gas fee optimization, improved network security, and the deployment of several housekeeping upgrades. As Ethereum&#8217;s price surges to surpass the $2,300 milestone, speculation intensifies about the cryptocurrency&#8217;s potential to reach the next significant threshold of $3,000. The recent upward trajectory reflects the market&#8217;s confidence in Ethereum&#8217;s underlying technology and its role in the evolving digital landscape. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-08T13:44:00.000Z",
    "title": "Bitcoin Price Remains Strong and Eyes Fresh Surge Above $44K",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-strong-44k/",
    "description": "Bitcoin price corrected lower and tested the $42,800 support zone. BTC is now showing positive signs and might attempt a fresh surge above $44,000. Bitcoin is holding gains above the $42,500 pivot level. The price is trading above $42,800 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $42,900 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair is likely setting up for a fresh increase above the $44,000 level. Bitcoin Price Eyes Fresh Increase Bitcoin price started a downside correction below the $44,000 level. BTC declined below the $43,500 level, but the bulls remained active. The price found bids near the 50% Fib retracement level of the upward move from the $41,427 swing low to the $44,465 high. Bitcoin is still trading above $42,800 and the 100 hourly Simple moving average. There is also a key bullish trend line forming with support near $42,900 on the hourly chart of the BTC/USD pair. The price is now rising and showing positive signs above the $43,000 level. On the upside, immediate resistance is near the $44,200 level. The first major resistance is forming near $44,450, above which the price might gain bullish momentum and rise toward $45,000. Source: BTCUSD on TradingView.com A close above the $45,000 resistance might start a strong upward move. The next key resistance could be near $46,000, above which BTC could rise toward the $47,200 level. Are Dips Limited In BTC? If Bitcoin fails to rise above the $44,450 resistance zone, it could start another decline. Immediate support on the downside is near the $42,900 level and the trend line. The next major support is near $42,580 or the 61.8% Fib retracement level of the upward move from the $41,427 swing low to the $44,465 high, below which the price might test the $42,150 zone. If there is a move below $42,150, there is a risk of more downsides. In the stated case, the price could drop toward the $41,500 support in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $42,900, followed by $42,150. Major Resistance Levels – $44,250, $44,450, and $45,000."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-08T13:47:12.000Z",
    "title": "TON Blockchain Partnership: Animoca’s Yat Siu Aims for Success in 2024",
    "url": "https://www.crypto-news-flash.com/ton-blockchain-partnership-animocas-yat-siu-aims-for-success-in-2024/?utm_source=rss&utm_medium=rss&utm_campaign=ton-blockchain-partnership-animocas-yat-siu-aims-for-success-in-2024",
    "description": "<img width=\"1920\" height=\"1307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ton\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s-300x204.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s-1024x697.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s-768x523.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s-1536x1046.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Animoca Brands, led by co-founder Yat Siu, is set for major growth in 2024 with strategic investments in blockchain and gaming. Key moves include a partnership with The Open Network and acquiring the gaming platform Gamee, aiming for mass onboarding and market expansion. Yat Siu, co-founder of Animoca Brands, outlines a solid plan to profit [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-08T14:00:00.000Z",
    "title": "Analyst Unveils Optimism (OP) Strategy After Recent Hike",
    "url": "https://coinedition.com/analyst-unveils-optimism-op-strategy-after-recent-hike/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Optimism Recent Hike\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Michaël van de Poppe, crypto investor and founder of MN Trading told his X followers that they should be careful about buying Optimism (OP) at any value. He further noted that they should focus on finding entries between $1.85 and $1.935.  Van de Poppe also added that OP would most likely follow in Ethereum’s (ETH) [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/analyst-unveils-optimism-op-strategy-after-recent-hike/\">Analyst Unveils Optimism (OP) Strategy After Recent Hike</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]