[
  {
    "source": "Cointelegraph",
    "date": "2023-10-20T08:45:11.000Z",
    "title": "EU data protection regulators urge anonymity for smaller transactions in digital euro ",
    "url": "https://cointelegraph.com/news/eu-data-protection-regulators-urge-anonymity-smaller-transactions-in-digital-euro",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/8d3ced04-0e6d-41b2-a8da-277a833e8ce0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The European Data Protection Board and the European Data Protection Supervisor issued a joint opinion statement on the regulation of “digital euro.”</p>\n                    <p><p>On Oct. 18, the European Data Protection Board (EDPB) and the European Data Protection Supervisor (EDPS) issued a joint opinion <a href=\"https://edpb.europa.eu/news/news/2023/digital-euro-ensuring-highest-data-protection-and-privacy-standards_en\" target=\"_blank\" rel=\"noopener nofollow\">statement</a> on the regulation of “digital euro,” <a href=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A52023PC0369\" target=\"_blank\" rel=\"noopener nofollow\">proposed</a> by the European Commission in July 2023. The regulators made several recommendations to enhance the personal data protection standards for the European central bank digital currency (CBDC). </p><p>The EDPB and EDPS suggest clarifying the proposed verification procedure for the maximum allowed amount of digital euro held by the individual account. The current draft allows the European Central Bank (ECB) and national central banks to establish a single access point to each user’s data. The EDPB and the EDPS recommend conducting an assessment to determine the necessity and proportionality of a singular access point. They emphasize that employing technical measures for the decentralized storage of these identifiers is feasible. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/cbdc-finland-instant-payments-system-embraces-digital-euro\"><strong><em>Finland works on instant payments system, embraces digital euro</em></strong></a></p><p>The regulators also point out the lack of foreseeability in the proposed fraud detection and prevention mechanism of the CBDC. The EDPB and the EDPS recommend further demonstrating the FDPM’s necessity or, otherwise, considering “less intrusive measures” from a data protection perspective.</p><p>The EDPB and the EDPS also “strongly recommend” establishing a 'privacy threshold' for online transactions, below which offline and online low-value transactions are not subject to tracking for anti-money laundering and combating the financing of terrorism (AML/CFT). However, they didn’t come up with a specific amount, referring only to the transaction limit, covering “low-value daily transactions.”</p><p>This week, the governing council of the ECB <a href=\"https://cointelegraph.com/news/ecb-preparation-phase-digital-euro\">announced the ”preparation phase”</a> for the digital euro project following a two-year investigation. The preparation phase will last two years and focus on finalizing rules for the digital currency, as well as selecting possible issuers. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/ethereum-restaking-blockchain-dangerous/\"><strong><em>Ethereum restaking. Blockchain innovation or dangerous house of cards?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-20T08:42:59.000Z",
    "title": "How decentralization can mitigate 'dystopic' artificial intelligence risks: SingularityNET exec",
    "url": "https://cointelegraph.com/news/artificial-general-intelligence-singularitynet-coo-future-blockchain-summit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/52e8d3dd-b14f-4b5b-b9dd-9ff61c50350d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Janet Adams, the COO of SingularityNET, said that AGIs falling into the hands of military could pose existential threats to humanity. </p>\n                    <p><p>While the development of artificial general intelligence (AGI) comes with a truckload of benefits, it also comes with massive risks if the technology falls into the wrong hands. However, decentralization using blockchain technology might help prevent a catastrophe, according to Janet Adams, the chief operating officer of the artificial intelligence and Web3-focused project SingularityNET.</p><p>At the Future Blockchain Summit event in Dubai, Cointelegraph sat down with Adams to learn about the risks of centralization when it comes to AGI and how decentralization holds the key to mitigating these risks.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/8680b8ab-061e-4e71-88a6-cf08739ea805.jpg\"  /><figcaption style=\"text-align: center;\"><em>Cointelegraph's Ezra Reguerra with SingularityNET's Janet Adams at the Future Blockchain Summit in Dubai. Source: Ana Solana</em></figcaption></figure><p>While AGI is still a conceptual version of AI that allows a machine to learn and think like a human being, its development will create a massive shift in the world. However, the machine would need to have a consciousness and become self-aware to be able to perform a broader range of tasks.</p><p>According to Adams, the “dystopic future” that many imagine when it comes to AGI could potentially happen if the technology is monopolized by Big Tech companies, the military or the government. The executive believes that Big Tech will use the technology “for the profit of the few” and will not allow for a significant shift in the inequalities of today.</p><p>Furthermore, Adams highlighted that if AI becomes developed exclusively by the military, the risks could be “existential for humanity,” implying that humans might use the technology for war. On the other hand, if the technology becomes developed by a single government, the executive believes that this could lead to them having unprecedented power. </p><p>To prevent these risks, the SingularityNET COO believes that it is important to decentralize the development of artificial general intelligence using blockchain technology. Adams explained that: </p><blockquote>“Blockchain is the fabric of decentralization. It can be used to enable AI to AI financial transactions on-chain, and it can be used to ensure that we’ve got broad access to the widest developer base around the world for open-source AI development.”</blockquote><p>Adams noted that decentralization would allow AGIs to be used for the benefit of everyone and not just be monopolized by a few organizations. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinbase-ceo-warns-ai-regulation-calls-for-decentralization\"><strong><em>Coinbase CEO warns against AI regulation, calls for decentralization</em></strong></a></p><p>Despite these views, Adams also recognizes that it's impossible to fully predict how an AGI is going to behave once it's invented because it's going to be smarter than humans. However, the executive hopes that AGIs would view humanity as their ancestors. She explained: </p><blockquote>“Our view is that a decentralized governance and ensuring that all of our technologies, ever that we ever develop, have a positive impact on the planet, positive impact on humanity, and that we build examples of love and kindness and compassion into our AGIs.”</blockquote><p>Adams also added that their hope is that when AGIs are born, they would “look to us as their ancestors.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-apple-devloping-pocket-ai-deep-fake-music-deal-hypnotize-gpt-4/\"><strong><em>AI Eye: Apple developing pocket AI, deep fake music deal, hypnotizing GPT-4</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-20T09:04:24.000Z",
    "title": "Op-Ed: X Community Notes are not perfect, but socializing fact-checking should be encouraged",
    "url": "https://cryptoslate.com/op-ed-x-community-notes-are-not-perfect-but-socializing-fact-checking-should-be-encouraged/",
    "description": "<p>The social media platform X, previously known as Twitter, has made strides in battling misinformation with its Community Notes feature. As the Senior Editor of CryptoSlate, my hands-on experience with this tool revealed its advantages and drawbacks in a world desperate for accurate information. Community Notes allow users to add context to potentially deceptive posts. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/op-ed-x-community-notes-are-not-perfect-but-socializing-fact-checking-should-be-encouraged/\">Op-Ed: X Community Notes are not perfect, but socializing fact-checking should be encouraged</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-20T09:06:28.000Z",
    "title": "Former Consensys Employees Sue CEO Joseph Lubin for Violating Equity Promises",
    "url": "https://www.cryptopolitan.com/former-consensys-employees-sue-ceo/",
    "description": "Over two dozen former employees of Consensys, the Ethereum infrastructure firm, have taken legal action against its founder and CEO, Joseph Lubin. The lawsuit alleges that Lubin violated a &#8220;no-dilution promise&#8221; he made in 2015, ultimately diminishing the equity shares of these former employees who played a pivotal role in the early days of the ... <a title=\"Former Consensys Employees Sue CEO Joseph Lubin for Violating Equity Promises\" class=\"read-more\" href=\"https://www.cryptopolitan.com/former-consensys-employees-sue-ceo/\" aria-label=\"More on Former Consensys Employees Sue CEO Joseph Lubin for Violating Equity Promises\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-20T08:53:55.000Z",
    "title": "Crypto giant Base unveils game-changer: Open sourcing smart contracts",
    "url": "https://www.cryptopolitan.com/crypto-giant-base-unveils-game-change/",
    "description": "In a significant move towards greater transparency and collaboration within the blockchain ecosystem, Base, a prominent player in the crypto space, has decided to open source its smart contracts and web properties. This strategic decision aligns with Base&#8217;s core values of accountability and community engagement. By sharing their work openly, Base aims to create a ... <a title=\"Crypto giant Base unveils game-changer: Open sourcing smart contracts\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-giant-base-unveils-game-change/\" aria-label=\"More on Crypto giant Base unveils game-changer: Open sourcing smart contracts\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-20T09:05:54.000Z",
    "title": "Head of Binance payment processor resigns",
    "url": "https://crypto.news/head-of-binance-payment-processor-resigns/",
    "description": "Saulius Galatiltis, CEO of a Binance crypto-to-fiat payment affiliate, has stepped down in an ongoing exodus of executives from the digital asset titan. Galatiltis served as Bifinity’s chief executive from January 2022 to October 2023, per his LinkedIn profile. The&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-20T09:00:50.000Z",
    "title": "When Will The Bitcoin Bear Market End? US Mega Bank Has The Answer",
    "url": "https://www.newsbtc.com/crypto/bitcoin-bear-market-us-mega-bank/",
    "description": "In a recent development, leading investment bank Morgan Stanley has weighed in on when the lingering Bitcoin bear market is likely to end. Interestingly, they share some similar views with analysts who have made predictions in the past.  Bitcoin Halving A Major Factor In an article released by the investment bank, Morgan Stanley highlighted Bitcoin’s importance as the leading crypto and how the Bitcoin Halving, which is set to take place in April 2024, could affect its price and other crypto tokens by extension.  Related Reading: XRP Price Prediction: Rare Bent Fork Pattern Predicts Explosive 3000% Surge To $15 Bitcoin halving is a deflationary measure that occurs every four years, during which the rewards of miners are ‘halved’, thereby creating scarcity. According to the bank, this event could potentially trigger a bull run as it has done in the past.  The article further noted how there have been such bull runs in the past following the three halving events that have occurred and how the bull run lasted for 12 to 18 months after then.  Morgan Stanley’s prediction echoes that of several crypto analysts who have predicted that the Bitcoin Halving could spark the next bull run. Specifically, the co-founder of Delphi Digital, Kevin Kell, while highlighting metrics that showed that the next bull run was close, noted that Bitcoin has broken to a new all-time high (ATH) seven months after the last two halvings occurred. Understanding The Four Phases Of Crypto While trying to avoid giving a definite time as to when to invest ahead of the next bull run, Morgan Stanley noted the importance of learning about the ‘four phases of cryptocurrency prices’ in order for one to make a conviction play as to the right time to invest. These four phases are said to correspond roughly to the four seasons of the year.  The first phase is ‘Summer’ when Bitcoin experiences the most gains, which comes after the halving. The bull run is said to begin with the event and continue when Bitcoin’s price hits its prior peak. The next is the ‘Fall’ when the price “surpasses the old high.” This is the period when the bull market runs its full course after reaching a new high. Related Reading: Bitcoin Maximalist Calls Ethereum ‘Garbage’, Here’s Why After ‘Fall’ comes ‘Winter’, which is when the bear market surfaces as this is the period that investors are locking in their gains, resulting in a massive sell-off. This usually occurs between the “new peak and the next trough.” Historically, there have been three winters, with each of them lasting for about 13 months.  ‘Spring’ is the last phase in the cycle and the one that potentially kickstarts the next bull run (another Summer). This is the period “preceding each halving,’ when Bitcoin’s price “generally recovers from the cycle’s low point, but investor interest tends to be weak.” By understanding these phases, crypto investors could be well-prepared to take advantage of the next bull run to make the most profits. BTC continues recovery as sentiment recovers &#124; Source: BTCUSD on Tradingview.com Featured image from Forbes, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-20T08:56:28.000Z",
    "title": "Base Layer 2: Coinbase’s Transparency Push Ignites Collaboration on Ethereum",
    "url": "https://www.crypto-news-flash.com/base-layer-2-coinbases-transparency-push-ignites-collaboration-on-ethereum/?utm_source=rss&utm_medium=rss&utm_campaign=base-layer-2-coinbases-transparency-push-ignites-collaboration-on-ethereum",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Coinbase-7-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coinbase 7\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Coinbase-7-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Coinbase-7-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Coinbase-7-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Coinbase-7-104x69.jpg 104w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Coinbase Base has open-sourced its code repositories to enhance transparency and community collaboration. They plan to share their smart contracts repositories on GitHub. This initiative allows developers to access the code that underpins Base&#8217;s various processes, including smart contracts and deployments, encouraging community involvement and feedback. Base, the Coinbase-incubated Layer 2 network has recently open-sourced [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-20T08:51:08.000Z",
    "title": "Sam Bankman-Fried Trial: Final Jury Instructions Unveiled Amidst High Stakes",
    "url": "https://www.crypto-news-flash.com/sam-bankman-fried-trial-final-jury-instructions-unveiled-amidst-high-stakes/?utm_source=rss&utm_medium=rss&utm_campaign=sam-bankman-fried-trial-final-jury-instructions-unveiled-amidst-high-stakes",
    "description": "<img width=\"1200\" height=\"601\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ftx.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Sam Bankman\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ftx.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ftx-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ftx-1024x513.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ftx-768x385.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Judge Kaplan weighs jury instructions in Sam Bankman-Fried&#8217;s trial, with defense and prosecution differing on how to guide jurors. Former FTX counsel reveals Bankman-Fried&#8217;s request for &#8220;legal justifications&#8221; amid missing funds, potentially complicating his defense. In the high-profile federal criminal case against Sam Bankman-Fried, Judge Lewis Kaplan is poised to make a critical decision. This [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-20T08:47:53.000Z",
    "title": "Crypto Prices Today: BTC Holds Above $29K, ENJ and SOL Surge",
    "url": "https://coinedition.com/crypto-prices-today-btc-holds-above-29k-enj-and-sol-surge/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The global cryptocurrency market cap jumped 2.50% over the past 24 hours, according to data from the cryptocurrency market tracking website CoinMarketCap. At press time, the market’s valuation was estimated to be around $1.11 trillion. During the past day of trading, Bitcoin (BTC), Enjin Coin (ENJ), and Solana (SOL) all saw their prices surge. Bitcoin [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-prices-today-btc-holds-above-29k-enj-and-sol-surge/\">Crypto Prices Today: BTC Holds Above $29K, ENJ and SOL Surge</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]