[
  {
    "source": "CoinDesk",
    "date": "2023-12-22T13:30:00.000Z",
    "title": "SEC Chair Gary Gensler: 'Far Too Many Frauds and Bankruptcies'",
    "url": "https://www.coindesk.com/policy/2023/12/22/sec-chair-gary-gensler-far-too-many-frauds-and-bankruptcies/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Earlier this month, I had the opportunity to speak with U.S. Securities and Exchange Commission (SEC) Chair Gary Gensler, recognized by CoinDesk as one of the most influential figures in the crypto industry over the past year, about how he views his agency's role in the digital asset world."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-22T13:29:59.000Z",
    "title": " Community responds to Gary Gensler’s latest jab toward crypto ",
    "url": "https://cointelegraph.com/news/gary-gensler-crypto-noncompliance-community-response",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZDk5ZTQ1NDAtNWUyNi00YTNlLWEzNWEtZGY1ZDA3MzU5OWUwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ripple CEO Brad Garlinghouse called SEC chair Gary Gensler a “political liability” whose actions destroyed the agency’s integrity. </p>\n                    <p><p>Crypto community members were quick to clap back at United States Securities and Exchange (SEC) chair Gary Gensler for his latest jab at the space’s compliance. </p><p>On Dec. 22, Gensler shared a post on X (Twitter) that asserts that there’s a lot of noncompliance in crypto. The SEC official said this “undermines confidence” in the space and implied that this leaves victims helpless. Gensler underscored that people who have been affected by the recent crypto bankruptcies can only “stand in line” in the courts. </p><p>The community instantly responded to the SEC chair’s sentiments, highlighting that the SEC has been constantly asked to clarify what compliance means. Using the social platform’s Community Notes feature that allows users to fact-check posts on X, the community shared that the SEC has not shared a clear stance. The note also pointed out that companies like Coinbase have tried to get regulatory clarity from the SEC in the last few years. </p><p><a href=\"https://cointelegraph.com/news/gary-gensler-crypto-noncompliance-community-response\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-22T13:30:29.000Z",
    "title": "Fed’s balance sheet hits lowest point since April 2021",
    "url": "https://cryptoslate.com/insights/feds-balance-sheet-hits-lowest-point-since-april-2021/",
    "description": "<p>Quick Take A recent examination of the Federal Reserve&#8217;s balance sheet reveals a significant trend of quantitative tightening. The balance sheet has contracted by approximately $15 billion in the past week alone, signaling possible upcoming economic shifts. As noted by Charlie Bilello, the Chief Market Strategist at Creative Planning, 2023 may set new records in [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/feds-balance-sheet-hits-lowest-point-since-april-2021/\">Fed&#8217;s balance sheet hits lowest point since April 2021</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-22T13:40:01.000Z",
    "title": "Five Game-Changing Companies Shaping the Global Landscape through Blockchain",
    "url": "https://cryptodaily.co.uk/2023/12/five-game-changing-companies-shaping-the-global-landscape-through-blockchain",
    "description": "Blockchain technology has been steadily gaining influence across various industries, fundamentally transforming the way businesses operate"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-22T13:21:46.000Z",
    "title": "3 Must-Own Cryptocurrencies Before The End of 2023",
    "url": "https://cryptodaily.co.uk/2023/12/3-must-own-cryptocurrencies-before-the-end-of-2023",
    "description": "Explore the top 3 cryptocurrencies to invest in before the end of 2023. Discover our expert insights on these promising digital assets, their growth potential, and why they are essential additions to your investment portfolio"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-22T13:11:35.000Z",
    "title": "Solana (SOL) Motoring Towards $100, Retik Finance (RETIK) Presale Stage 2 Sells Out Quicker Than Anticipated",
    "url": "https://cryptodaily.co.uk/2023/12/solana-sol-motoring-towards-100-retik-finance-retik-presale-stage-2-sells-out-quicker-than-anticipated",
    "description": "Solana (SOL) and Retik Finance (RETIK) are the two projects that have recently captured the attention of investors worldwide."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-22T13:35:37.000Z",
    "title": "Payment Integrity in Healthcare Faces Transformation with AI and Value-Based Care",
    "url": "https://www.cryptopolitan.com/payment-in-healthcare-faces-transformation/",
    "description": "The Payment Integrity (PI) industry in the United States, valued at approximately $9 billion, is experiencing significant growth, with a compound annual growth rate (CAGR) of 7 percent in recent years. This sector plays a vital role in ensuring accurate claims adjudication and proper reimbursement for healthcare providers. As the industry expands, it encounters new [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-22T13:29:44.000Z",
    "title": "Microsoft Discontinues Windows Mixed Reality in Favor of AI",
    "url": "https://www.cryptopolitan.com/microsoft-discontinues-windows/",
    "description": "Microsoft recently announced the discontinuation of its Windows Mixed Reality platform, signaling a shift away from virtual reality (VR) and augmented reality (AR) technologies. The move comes as no surprise to industry observers, as Microsoft had already scaled back its HoloLens efforts. With a growing focus on artificial intelligence (AI), the tech giant seems to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-22T13:23:05.000Z",
    "title": "AI-Powered Reggie the Lion: A Teaching Tool at King’s College London",
    "url": "https://www.cryptopolitan.com/lion-a-teaching-tool-at-kings-college-london/",
    "description": "King’s College London (KCL) celebrates the centenary of its beloved mascot, Reggie the Lion, and the milestone comes with a modern twist. Dr. Andrés Gvirtz, an assistant professor specializing in marketing technology and innovation at KCL’s business school, has harnessed the power of artificial intelligence (AI) to transform Reggie into an educational tool. In a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-22T13:19:15.000Z",
    "title": "Bitcoin NFTs register $425 million in sales in one week",
    "url": "https://www.cryptopolitan.com/bitcoin-nfts-register-425-million-sales-week/",
    "description": "In the past week, the market for non-fungible tokens (NFTs) minted on the Bitcoin blockchain has witnessed remarkable activity, with sales totaling approximately $425.63 million. Notably, the top ten NFT collections during this period all originated from the BTC blockchain, with these collections, known as Ordinal inscriptions, experiencing significant trading volumes and establishing robust baseline [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-22T13:11:17.000Z",
    "title": "UniSat Announces 2023.12 Release Schedule for Atomicals, Focusing on ARC20",
    "url": "https://www.cryptopolitan.com/unisat-release-schedule-atomicals-arc20/",
    "description": "UniSat has officially announced the release schedule for Atomicals, specifically for ARC20, addressing the growing anticipation and queries from the community. Understanding the excitement and inconvenience caused by previous delays, UniSat aims to provide clarity and reassurance with the updated launch plan. The focus on ARC20 comes after careful consideration of the unique technical strengths [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-22T13:30:14.000Z",
    "title": "Social Frenzy: Stacks (STX) Hits 8-Month High, But It Unveiled An Intriguing Twist",
    "url": "https://www.newsbtc.com/news/social-frenzy-stacks-stx-hits-8-month-high-but-it-unveiled-an-intriguing-twist/",
    "description": "In contrast to the majority of cryptocurrencies, which began the week on a downward trajectory, Stacks (STX) deviated from the prevailing trend and registered gains. Stacks Network&#8217;s native token, STX, had a strong 600% increase in 2023. Stacks is a noteworthy 2019 SEC-qualified token that functions as a layer-2 Bitcoin protocol for smart contracts. Related Reading: BONK Crashes 31% After A Solid Month – Is the Success Story Ending? Stacks Surges: Social Buzz And Growth Stacks has been the talk of the cryptocurrency community lately, receiving a lot of attention on social media. The altcoin&#8217;s market value has experienced a notable upswing, having reached a new eight-month high, concomitant with this rise in social volume. STX&#8217;s price has increased by more than 30% in the last week, which has been an impressive rise. This increase in social media mentions and the price gain that followed highlight the rising attention and involvement that Stacks is getting, pointing to increased excitement and hope among investors and the cryptocurrency community as a whole. Furthermore, in the last few hours, the Bitcoin scaling solution minted its first STX-20. The inscription caused a spike in network activity that led to a sharp rise in transactions and brief network congestion. STXUSD currently trading at $1.3283 territory. Chart: TradingView.com The upsurge coincided with the excitement surrounding Bitcoin Ordinals and BRC-20. The average transaction amount experienced a record increase earlier this month, rising from $5 to $7. Because more users were etching non-financial data onto the Bitcoin blockchain, there was an increase in demand for block space, which contributed to the growing transaction costs. The token&#8217;s price has been steadily rising for the past month, which has encouraged more social contact among members of the cryptocurrency community. Meanwhile, on-chain data provider Santiment cautioned in a recent post on X (formerly Twitter) that excessive social media activity frequently leads to &#8220;fear of missing out&#8221; (FOMO) buying. 🗣️ #Solana (+13%), #Stacks (+23%), and #NEARprotocol (+17%) are the top trending assets, according to rising social volumes. In each case, when there is mainstream talk at this level, #FOMO will create price tops. If holding any, take a cautious approach. https://t.co/bb3O2lFJd1 pic.twitter.com/oMnVvAI0ea — Santiment (@santimentfeed) December 21, 2023 STX Price Surge Raises Red Flags The emergence of local price peaks is usually the result of this trend, and as the initial euphoria wears off, prices frequently correct quickly. Following a spike in enthusiasm and speculative interest that drives price increases, there follows a correction phase in the market. The Bollinger Bands (BB) indicator for STX shows a growing gap between its upper and lower bands, indicating more volatility following the recent price ascent. Since December 3rd, the Average True Range (ATR) has increased by 140% to reach 0.12, suggesting that there may be notable price swings. Related Reading: Crypto Analyst Says This AI Altcoin Will Hit A Fresh ATH After 300% Rally Due to the spike in demand, STX&#8217;s major momentum indicators—the Money Flow Index (MFI) at 80.22 and the Relative Strength Index (RSI) at 71.56—have reached overbought levels, indicating a potential for a short-term price decrease and the probability of buyer exhaustion. Despite an endorsement from billionaire investor Tim Draper, it seems that STX couldn&#8217;t leverage this significant support to its fullest potential. In a recent interview with Coin Bureau, Draper designated Stacks as the foremost &#8220;showstopper&#8221; among crypto projects, highlighting it as the most impactful project he discovered this year. As STX captures attention and climbs to new heights, the unfolding twists in its journey continue to captivate the cryptocurrency space, leaving enthusiasts eager to see what the next chapters hold for this compelling digital asset. Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-22T13:26:10.000Z",
    "title": "Fuse Network Partners with Polygon CDK to Launch ZK-Powered Layer-Two: A Game-Changer for Web 3.0 Payments",
    "url": "https://www.crypto-news-flash.com/fuse-network-partners-with-polygon-cdk-to-launch-zk-powered-layer-two-a-game-changer-for-web-3-0-payments/?utm_source=rss&utm_medium=rss&utm_campaign=fuse-network-partners-with-polygon-cdk-to-launch-zk-powered-layer-two-a-game-changer-for-web-3-0-payments",
    "description": "<img width=\"1043\" height=\"606\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/polygon-network-.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/polygon-network-.png 1043w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/polygon-network--300x174.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/polygon-network--1024x595.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/polygon-network--768x446.png 768w\" sizes=\"(max-width: 1043px) 100vw, 1043px\" />The new ZK-powered layer two network will become the Fuse’s native network and will tap on the FUSE token for a gas fee. The transition from the Fuse layer one to Layer two is expected to take place in several stages for the next twelve months. Fuse (FUSE) network, an EVM-compatible layer one blockchain with [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-22T13:16:51.000Z",
    "title": "Cardano DeFi TVL Soars to New Heights, Surpassing $400 Million Mark in 2023",
    "url": "https://www.crypto-news-flash.com/cardano-defi-tvl-soars-to-new-heights-surpassing-400-million-mark-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-defi-tvl-soars-to-new-heights-surpassing-400-million-mark-in-2023",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/cardano-blockchain-platform-104x69.jpg 104w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />The Cardano DeFi landscape, criticized in the past for its delayed entry, has witnessed a remarkable uptrend in TVL, reaching $400 million. Cardano&#8217;s native token ADA also experienced a notable 10.01% gain, trading at $0.6448. In a significant development, the total value of assets locked within decentralized finance (DeFi) protocols on the Cardano blockchain has [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-22T13:41:28.000Z",
    "title": "Solana (SOL) Price Prediction 2024-2030: Will SOL Price Hit $150 Soon?",
    "url": "https://coinedition.com/solana-sol-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Solana-(SOL)-Price-Prediction 2022\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Aside from Bitcoin (BTC) and Ethereum (ETH), there are other digital currencies worth considering for people looking to diversify their portfolios and get experience with new cryptocurrencies, Solana (SOL) is one of them. Solana is an open-source, public blockchain that facilitates using smart contracts, decentralized applications (dApps), and NFTs (non-fungible tokens). The SOL token, which [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/solana-sol-price-prediction/\">Solana (SOL) Price Prediction 2024-2030: Will SOL Price Hit $150 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-22T13:27:33.000Z",
    "title": "INJ Sees Surges on Kraken, But Low Volume Raises Eyebrows",
    "url": "https://coinedition.com/inj-sees-surges-on-kraken-but-low-volume-raises-eyebrows/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Injective-INJ-Price-Analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Injective-INJ-Price-Analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Injective-INJ-Price-Analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Injective-INJ-Price-Analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Injective-INJ-Price-Analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Injective-INJ-Price-Analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Injective-INJ-Price-Analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Injective Protocol (INJ) token witnessed a surprising spike on Friday, reaching $49 on the Kraken exchange to mark its all-time high.  However, the price surge lacked significant backing, as the trading volume remained relatively low, crypto research analyst Riyad Carey noted in a post on X (formerly Twitter). According to Carey, the two largest [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/inj-sees-surges-on-kraken-but-low-volume-raises-eyebrows/\">INJ Sees Surges on Kraken, But Low Volume Raises Eyebrows</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-22T13:14:06.000Z",
    "title": "Altcoin Market to Rally Significantly in Q1 2024: Analyst",
    "url": "https://coinedition.com/altcoin-market-to-rally-significantly-in-q1-2024-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"5 Best Altcoins To Buy This Week as the Market Begins to Rebound\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent post on X (formerly Twitter), crypto trader Michaël van de Poppe expressed his optimism about the performance of altcoins in the coming year. Michaël noted that the crypto market has been in a slump for most of the year. However, recent weeks have seen a surge in altcoin prices, leading him to [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/altcoin-market-to-rally-significantly-in-q1-2024-analyst/\">Altcoin Market to Rally Significantly in Q1 2024: Analyst</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]