[
  {
    "source": "Decrypt",
    "date": "2024-04-03T17:28:54.000Z",
    "title": "Bitcoin-Backed Core Network Defies Flat Market With 218% Price Spike",
    "url": "https://decrypt.co/224662/bitcoin-backed-core-network-218-percent-price-spike",
    "description": "The CORE token of the Bitcoin-backed Core Network is on a bullish run this week, outperforming BTC itself and other major cryptocurrencies."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-03T17:24:16.000Z",
    "title": " Meta’s metaverse lab has lost $40B since Facebook changed its name in 2021 ",
    "url": "https://cointelegraph.com/news/meta-metaverse-lab-lost-40-b-since-facebook-changed-its-name-in-2021",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvNWNiMDZkNmQtNDA2ZS00NGM4LWI5OGEtMGU5MTI3MTQyN2I2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Despite the losses, the company’s other endeavors pushed it to record profits in Q4 2023 with gains expected to continue through Q1 2024. </p>\n                    <p><p>When Facebook changed its name to Meta in September of 2021 it became clear CEO Mark Zuckerberg was fully committed to the pivot from web2 social media to the metaverse. Now, three years later, we can take a look at just how (financially) committed the company has been as well as what impact the expansion into virtual and augmented reality (VR and AR) has had on Meta’s bottom line ahead of its first quarter earnings call set for 24 April. </p><p>Meta posted a <a href=\"https://investor.fb.com/investor-news/press-release-details/2024/Meta-Reports-Fourth-Quarter-and-Full-Year-2023-Results-Initiates-Quarterly-Dividend/default.aspx\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> revenue of $134.90 billion in 2023, up nearly 16% over 2022. Its fourth quarter revenue of $40.1 billion set a company record and beat analysts’ predictions. This would seem to indicate that the pivot towards the metaverse has panned out well for the company, but there are mixed signals to interpret ahead of the next call.</p><p>While Facebook, the social media app, is doing quite well, Meta’s Reality Labs — the research division responsible for products such as the Quest VR headset line — has posted successive year-over-year operating losses totaling around $40 billion since 2021. </p><p><a href=\"https://cointelegraph.com/news/meta-metaverse-lab-lost-40-b-since-facebook-changed-its-name-in-2021\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-04-03T17:25:42.000Z",
    "title": "UK regulators launch sandbox to integrate DLT with financial system",
    "url": "https://cryptoslate.com/uk-regulators-launch-sandbox-to-integrate-dlt-with-financial-system/",
    "description": "<p>The Bank of England (BoE) and the UK Financial Conduct Authority (FCA) have announced the launch of the Digital Securities Sandbox (DSS) on April 3. The new framework aims to facilitate the use of emerging technologies, such as distributed ledger technology (DLT), in issuing, trading, and settling financial securities. It will allow participating firms to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/uk-regulators-launch-sandbox-to-integrate-dlt-with-financial-system/\">UK regulators launch sandbox to integrate DLT with financial system</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-03T17:35:03.000Z",
    "title": "Slerf Price Prediction - Are New Meme Coins The Best Tokens To Invest In",
    "url": "https://cryptodaily.co.uk/2024/04/slerf-price-prediction-are-new-meme-coins-the-best-tokens-to-invest-in",
    "description": "The cryptocurrency space is heating up in April with the Bitcoin halving getting closer by the day, expected to take place in 16 days."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-03T17:37:33.000Z",
    "title": "Bitcoin Stands Strong Amid Government, Silk Road BTC Liquidation",
    "url": "https://www.cryptopolitan.com/bitcoin-stand-government-btc-liquidation/",
    "description": "Bitcoin prices staged a massive bounce to a whopping $66.5K&#160; even with the much-anticipated United States government sale of approximately $133 million worth of 2,000 BTC that was seized from the now-defunct online black market platform called: The Silk The sale was a major deal involving over 30,000 BTC (over $2 billion).&#160; So, the consequences [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-04-03T17:26:39.000Z",
    "title": "SEC’s Grewal criticizes crypto industry’s ‘noncompliance’",
    "url": "https://crypto.news/sec-grewal-crypto-criticism/",
    "description": "U.S. SEC Enforcement Director Gurbir Grewal condemned the crypto industry for its \"significant lack of compliance.\""
  }
]