[
  {
    "source": "Decrypt",
    "date": "2023-11-21T23:51:02.000Z",
    "title": "Why 'Cyberpunk 2077: Ultimate Edition' Needs 3 Discs on Xbox",
    "url": "https://decrypt.co/206946/why-cyberpunk-2077-ultimate-edition-needs-3-discs-xbox",
    "description": "The expanded version of Cyberpunk 2077 is coming to PC, PS5, and Xbox—but only one version ships with three discs."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-22T00:07:07.000Z",
    "title": "Binance’s new chapter begins with hefty fines and compliance commitments",
    "url": "https://cryptoslate.com/binances-new-chapter-begins-with-hefty-fines-and-compliance-commitments/",
    "description": "<p>Binance issued a statement on Nov. 21 regarding its resolution of investigations from the U.S. Department of Justice (DOJ) and other agencies. There, Binance stated that it is pleased to announce the resolution and admitted to past wrongdoing. The crypto exchange company said: &#8220;When Binance first launched, it did not have compliance controls adequate for [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/binances-new-chapter-begins-with-hefty-fines-and-compliance-commitments/\">Binance&#8217;s new chapter begins with hefty fines and compliance commitments</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-22T00:00:56.000Z",
    "title": "Anthropic’s Claude 2.1: Can It Beat OpenAI’s ChatGPT 4 in the Battle of Large Language Models?",
    "url": "https://www.cryptoglobe.com/latest/2023/11/anthropics-claude-2-1-can-it-beat-openais-chatgpt-4-in-the-battle-of-large-language-models/",
    "description": "On 21 November 2021, Anthropic announced that it had made significant strides in improving the safety of Claude 2.1 by implementing a 200,000-token context window. Anthropic is an American research and development company that focuses on the safe and beneficial development of artificial general intelligence (AGI). Founded in 2015 by former OpenAI researchers Dario and […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-22T00:00:12.000Z",
    "title": "DeFi gathering momentum, Ethereum Gas Fees Rising: Why Is Uniswap (UNI) Stuck?",
    "url": "https://www.newsbtc.com/news/defi/defi-ethereum-gas-fees-rising-uniswap-stuck/",
    "description": "Decentralized finance (DeFi) activity on Ethereum is picking up momentum based mainly on how gas fees have been trending in the first three weeks of November, data from Kaiko shows. Even so, despite Uniswap (UNI) spearheading the revival, looking at the gas attributed to its activities over this period, UNI prices remain stagnant below $5.6, with bulls failing to edge higher, breaking to new 2023 highs. Ethereum Gas Fees Rising, DeFi Revival? According to Kaiko, a blockchain analytics platform, the average gas fees on Ethereum hit multi-month highs last week. The platform expressly notes that the primary driver has been Uniswap&#8217;s activities, reading from the rising transaction volumes from meme coins, including GROK. This, in turn, pushed block space demand higher, increasing gas fees. Related Reading: Global Banks Are Betting Big On XRP, Report Shows Gas fees remain volatile but generally higher in the first three weeks of November. As of November 20, Ycharts data shows that the average cost of sending a transaction stood at 45.13 Gwei, nearly 100% from November 19, when it was at 24.84 Gwei. This is a significant jump from 17.66 Gwei in late October 2023. Gas fees and how ETH and DeFi token prices react are directly correlated as DeFi and other on-chain activities like non-fungible token (NFT) minting and trading rise; gas fees usually expand in trending markets. Accordingly, the recent expansion in gas fees could suggest that the markets could be preparing for a leg up, and tokens of critical protocols, including Uniswap or Aave, could benefit. DeFi TVL Rising, But Uniswap Is Stuck Below $5.6 As of writing, the total value locked (TVL) across all DeFi protocols stands at over $46.6 billion as of November 21, according to DeFiLlama. This increase is nearly $5 billion more than in early November and up from $37 billion in mid-October.  Ethereum remains a choice platform for deploying DeFi apps despite the relatively gas fees pinned to mainnet scaling challenges. The pioneer smart contract blockchain manages $25.4 billion in TVL, whereas Uniswap is one of the largest protocols with $3.216 billion in TVL. UNI prices are up 30% from mid-October when writing on November 21. However, bulls have been unable to break above the November highs at around $5.6. From the daily chart, trading volume, and thus participation, has been tapering even though prices have been edging higher.  Related Reading: Shiba Inu Sees A Whopping 48,000% Increase In The SHIB Burn Rate, What’s Next? This formation suggests that the uptrend was behind low momentum and sustainability. Technically, there could be more gains if there is a solid close above November highs with expanding volumes. In that case, UNI could expand, retesting 2023 highs of around $7.2. Feature image from Canva, chart from TradingView"
  }
]