[
  {
    "source": "CryptoGlobe",
    "date": "2023-05-26T04:12:00.000Z",
    "title": "Robinhood Moves 8% of Dogecoin ($DOGE) Supply To New Mysterious Wallet",
    "url": "https://www.cryptoglobe.com/latest/2023/05/robinhood-moves-8-of-dogecoin-doge-supply-to-new-mysterious-wallet/",
    "description": "Popular commission-free trading platform Robinhood has, according to data from the blockchain, moved around 8% of the supply of the meme-inspired cryptocurrency Dogecoin ($DOGE) to a new mysterious wallet. The development means that the supply of DOGE Robinhood held in its wallets, which was once holding steady at around 24%, has plunged to 16% following […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T04:35:35.000Z",
    "title": "Bitcoin Ordinals’ total mintage fees increase, Tradecurve set for another price increase",
    "url": "https://www.cryptopolitan.com/bitcoin-ordinals-total-mintage-fees-increase-tradecurve-set-for-another-price-increase/",
    "description": "Bitcoin (BTC) is an influential cryptocurrency as its market swings affect the entire blockchain space. Being the largest coin in market capitalization and popularity, its market swings can affect the broader industry. However, a cryptocurrency that has gained the attention of numerous traders with its presale is TCRV, the utility token of the Tradecurve platform, ... <a title=\"Bitcoin Ordinals&#8217; total mintage fees increase, Tradecurve set for another price increase\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-ordinals-total-mintage-fees-increase-tradecurve-set-for-another-price-increase/\" aria-label=\"More on Bitcoin Ordinals&#8217; total mintage fees increase, Tradecurve set for another price increase\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-26T04:15:43.000Z",
    "title": "MATIC Price Prediction: Polygon Aims Recovery To $1",
    "url": "https://www.newsbtc.com/analysis/matic-analysis/matic-price-prediction-polygon-to-1/",
    "description": "MATIC price is recovering from the $0.82 support zone. Polygon might rise further but there is a major barrier forming near the $1.00 zone. MATIC price is attempting a recovery wave above the $0.86 resistance against the US dollar. The price is trading above $0.86 and the 100 simple moving average (4 hours). There was a break above a key bearish trend line with resistance near $0.880 on the 4-hour chart of the MATIC/USD pair (data source from Kraken). The pair could continue to rise if it clears the $0.90 resistance zone. Polygon’s MATIC Price Attempts Recovery In the past few days, Polygon’s price saw a steady decline from well above $1.00. MATIC declined below the $0.900 support to move into a bearish zone. A low is formed near $0.8206 and the price is now attempting a recovery wave, similar to Bitcoin and Ethereum. The price was able to climb above $0.850. Besides, there was a break above a key bearish trend line with resistance near $0.880 on the 4-hour chart of the MATIC/USD pair. It broke the 23.6% Fib retracement level of the downward move from the $1.017 swing high to the $0.8206 low. MATIC price is now trading above $0.85 and the 100 simple moving average (4 hours). It is now facing resistance near the $0.90 level. If there is an upside break above the $0.90 resistance level, the price could continue to recover. The next major resistance is near $0.95 or the 61.8% Fib retracement level of the downward move from the $1.017 swing high to the $0.8206 low. Source: MATICUSD on TradingView.com A clear move above the $0.95 resistance could start a steady increase. In the stated case, the price could even attempt a move toward the $0.985 level or $1.00. Fresh Decline in MATIC? If MATIC’s price fails to rise above the $0.90 resistance level, it could start a fresh decline. Immediate support on the downside is near the $0.88 level. The main support is near the $0.865 level. A downside break below the $0.865 level could open the doors for a fresh decline toward $0.82. The next major support is near the $0.80 level. Technical Indicators 4 hours MACD – The MACD for MATIC/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for MATIC/USD is now above the 50 level. Major Support Levels – $0.88 and $0.865. Major Resistance Levels – $0.90, $0.95, and $1.00."
  }
]