[
  {
    "source": "Crypto Daily",
    "date": "2023-08-12T15:15:00.000Z",
    "title": "Developers’ Commitment Shines As Uwerx Maintains Launch Momentum By Tackling Hack Challenge",
    "url": "https://cryptodaily.co.uk/2023/08/developers-commitment-shines-as-uwerx-maintains-launch-momentum-by-tackling-hack-challenge",
    "description": "<p class=\"s6\">Beyond its ground-breaking features, Uwerx's developers' agile methodology approach has significantly contributed to the project's success. They have been so committed to promoting Uwerx&rsquo;s vision and purpose that investors and users could completely trust them and buy into the project.</p>\n<p class=\"s6\">This was part of why the Uwerx launch was overwhelmingly successful, surpassing expectations and initial forecasts. The developers are back to work and ready to take Uwerx to the next level.</p>\n<p class=\"s6\">However, they witnessed a setback as Uwerx was attacked. The team has yet again shown commitment by quickly and efficiently developing recovery strategies and plans. This article will detail the launch, updates, the hack, and Uwerx&rsquo;s road to recovery.</p>\nUwerx&rsquo;s Successful Launch: Developers Set To Renounce Smart Contract Ownership\n<p class=\"s6\">After so much anticipation, Uwerx finally launched on August 1, 2023. The launch was successful, as everyone wanted to become a WERX holder. Also, investors and users made tons of profits with all the bonuses that were up.</p>\n<p class=\"s6\">The developers released updates on what to expect next from Uwerx as soon as the launch ended. Uwerx has finally deployed liquidity on Uniswap. The Uwerx Vault, which received positive feedback from 84% of the community, will soon be available as the smart contracts await a thorough audit. </p>\n<p class=\"s6\">To show their commitment to Uwerx&rsquo;s community, the developers immediately began the 25-year liquidity locking they promised to do once Uwerx launched. They are also ready to denounce smart contract ownership when Uwerx goes live on centralized exchanges. The team has submitted their applications to CoinMarketCap and CoinGecko to facilitate this. </p>\n<p class=\"s6\">The team is working to ensure the Uwerx platform is completed immediately. They are working on the core functionality design, focusing on Freelancer, Client, and Agency Dashboards, Project Management, and Additional Settings Pages. </p>\n<p class=\"s6\">Once this is finished, a Minimum Viable Product (MVP) with functions will be released to the community for testing. Based on the feedback obtained, they will proceed with the premium design. </p>\n<p class=\"s6\">There will be a buyback campaign that will scale accordingly to provide support for Uwerx. It will happen weekly, although the dates and times will not be released to avoid anyone taking unfair advantage of the system.</p>\nUwerx Gets Exploited\n<p class=\"s6\">On August 2, Uwerx reported it got hacked, with the hacker stealing around $327,000. The attacker flash-loaned 20,000 ETH, which he swapped for 5,053,637 WERX. He then sent 4,429,817 WERX to the Uniswap pool. This amount was ten times the prior balance.</p>\n<p class=\"s6\">Afterward, he used the skim() function of Uniswap with the address 0x00...1 as the &ldquo;to&rdquo; address. He also used the transfer function of the Uwerx contract, which first modifies a sender&rsquo;s balance. </p>\n<p class=\"s6\">Since the &ldquo;to&rdquo; address was a UniswapPoolAddress (0x00...1), an extra 1% of the initial amount was burned. As a result, there was an imbalance that the attacker took advantage of to gain 176 ETH ($327,000).</p>\nUwerx Maintains Momentum As It Sets To Relaunch\n<p class=\"s6\">Despite the hack, Uwerx continues to shine as it devises ways to tackle the hack and maintain its momentum. Once they noticed the hack, they immediately alerted SolidProof and InterFiNetwork, their auditors. Also, the team contacted PeckShieldAlert and SlowMist_Team directly on Twitter. </p>\n<p class=\"s6\">The team began by putting out a white-hat bounty, stating the attacker should return 80% of the exploited funds and keep 20%. </p>\n<p class=\"s6\">A new WERX will be relaunched, and its platform will have more robust security measures. As to the relaunch, there will be a new contract address, which will be released to the community soon. </p>\n<p class=\"s6\">However, the contract address will be audited twice by reputable companies and once by an independent contractor. Due to a change in the contract address, the Uwerx Vault smart contracts are being altered, after which they will be audited before being released to the public.</p>\n<p class=\"s6\">The new WERX will be deployed on the Polygon network instead of Uniswap, on which it is currently deployed. This will enable token holders to easily use WERX on the Uwerxplatform without having to bridge, and it will also lower gas fees. </p>\n<p class=\"s6\">However, those who bought WERX on Uniswap will not be abandoned. The team has decided to airdrop the tokens at the end of the vesting period to ensure they still benefit. They also assure those who bought WERX during the presale that they are safe and will be unaffected by the relaunch.</p>\n<p class=\"s6\">The new WERX will be deployed with more liquidity. To do this, the funds reserved for the buyback campaign will be directed to liquidity. Also, the team is proposing a no-burn tax and a sliding sell tax, of which 100% will be directed to liquidity. </p>\n<p class=\"s6\">A poll is already up on Uwerx&rsquo;s Twitter page and Telegram channel, asking the community if they support a sliding sell tax wholly directed to liquidity. Another poll also asks the community how long the vesting period should be. </p>\n<p class=\"s6\">These polls will end on August 13, after which the development of the new WERX will commence on August 14. The team also welcomes feedback or opinions, which can be sent to feedback@uwerx.network.</p>\n<p class=\"s6\">Also, there will be press releases this week and another major announcement on August 21 to update the community on the new WERX development and plans for the relaunch. &nbsp;</p>\n<p class=\"s6\">The Uwerx platform development is ongoing, and the team has completed certain sections like Settings, Security, Help Center, Login, Privacy Policy, Create Account, and Finished Payments.</p>\n<p class=\"s6\">The WERX allocations will also be changed, and the new allocation is:</p>\n● Presale: 57% (427,500,000)\n● User Performance Incentives: 6% (45,000,000) \n● Liquidity Reserve: 14% (105,500,000)\n● Marketing: 9% (67,500,000) \n● Team Tokens: 6% (45,000,000) \n● Partnership Incentives: 2% (15,000,000)\n● Joining Incentives: 6% ( 45,000,000) \n<p class=\"s6\">At the end of the presale, 25,499,071 WERX will be burned. The airdrop and vesting schedules were shifted, and the new schedules have been released. Uwerx&rsquo;s whitepaper will also be modified to reflect the ongoing changes. </p>\n<p class=\"s6\">Uwerx is on to big things, and once the polls are concluded on August 13, the team will announce the specific details of the new WERX, as they are committed to launching it as soon as possible. </p>\n<p class=\"s6\">Uwerx&rsquo;s dedication throughout this period has been incredible. Their efforts in tackling this challenge have removed all forms of doubt and fear the community initially had. No wonder its community has continued to gather momentum, growing to over 2,500 Telegram members and 2,000 Twitter followers.</p>\n<p class=\"s6\">Uwerx remains focused on its vision, which is to be a change in freelancing, and no matter what, it is resolved to achieve this purpose. So why not throw in your support? Be a part of this value-driven community by following the links below:</p>\n<p class=\"s12\">Website: https://www.uwerx.network</p>\n<p class=\"s12\">Telegram: https://t.me/uwerx_network</p>\n<p class=\"s12\">Twitter: https://twitter.com/uwerx_network</p>\n<p class=\"s12\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n<p class=\"s12\">&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-12T15:30:09.000Z",
    "title": "Rebase Tokens: A Stunning Collapse From $8 Billion to $351 Million in 20 Months",
    "url": "https://news.bitcoin.com/rebase-tokens-a-stunning-collapse-from-8-billion-to-351-million-in-20-months/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/rebaseyurface-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Rebase Tokens: A Stunning Collapse From $8 Billion to $351 Million in 20 Months\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/rebaseyurface-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/rebaseyurface-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/rebaseyurface-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/rebaseyurface-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/rebaseyurface-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/rebaseyurface-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/rebaseyurface.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The crypto winter inflicted a brutal toll on the digital currency landscape, leaving numerous coins with values utterly obliterated. Within this ravaged financial terrain, one specific category — rebase tokens — suffered a tremendous deflation in worth over the previous 20 months. In a stark illustration of this downturn, the total value of the leading [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-12T15:30:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-12T15:29:10.000Z",
    "title": "Amazon Races Against Microsoft and Google in Generative AI with Custom AWS Chips",
    "url": "https://www.cryptopolitan.com/amazon-generative-ai-custom-aws-chips/",
    "description": "In a nondescript office building nestled in Austin, Texas, a small team of Amazon employees is fervently working on designing two distinct microchips tailored for the training and acceleration of generative AI. These custom AWS chips, named Inferentia and Trainium, present a viable alternative for AWS customers seeking to train their massive language models without ... <a title=\"Amazon Races Against Microsoft and Google in Generative AI with Custom AWS Chips\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amazon-generative-ai-custom-aws-chips/\" aria-label=\"More on Amazon Races Against Microsoft and Google in Generative AI with Custom AWS Chips\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-12T15:38:10.000Z",
    "title": "Tron, VeChain and Pomerdoge top crypto charts, bulls confident",
    "url": "https://crypto.news/tron-vechain-and-pomerdoge-top-crypto-charts-bulls-confident/",
    "description": "Pomerdoge, Tron, and VeChain are among top performers but traders expect more gains. Meanwhile, POMD presale is ongoing"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-12T15:35:07.000Z",
    "title": "Bankrupt Voyager moves massive amount of crypto to Coinbase",
    "url": "https://crypto.news/bankrupt-voyager-moves-massive-amount-of-crypto-to-coinbase/",
    "description": "Cryptocurrency firm Voyager strategically transfers of $2.77M ETH and $2.7M SHIB to Coinbase. This comes as the firm seeks to settle its obligations with its customers. "
  }
]