[
  {
    "source": "CoinDesk",
    "date": "2023-11-22T16:45:00.000Z",
    "title": "Why On-Chain Transaction Is the Key Blockchain Indicator",
    "url": "https://www.coindesk.com/markets/2023/11/22/why-on-chain-transaction-is-the-key-blockchain-indicator/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The metric helps investors and users to understand whether a blockchain is going to merely survive, or thrive, says Todd Groth, head of research at CoinDesk Indices."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-22T16:45:00.000Z",
    "title": "Tokenization and Real-World Assets Take Center Stage",
    "url": "https://www.coindesk.com/business/2023/11/22/tokenization-and-real-world-assets-take-center-stage/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Blue-chip institutions including Goldman Sachs and J.P. Morgan are trialing digital asset offerings, seeking cost savings and efficiencies."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-22T16:49:15.000Z",
    "title": "Pancakeswap implements new ‘Gauges’ voting system and sunsets vCAKE metric",
    "url": "http://cointelegraph.com/news/pancakeswap-implements-gauges-voting-system-sunsets-vcake-metric",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e80c4789-7676-486f-99b9-ffa2825b0cea.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The decentralized exchange launched a new feature that allows governance token holders to vote on which pools will receive the most rewards.</p>\n                    <p><p>Decentralized crypto exchange Pancakeswap has implemented a new voting system. Called “Gauges,” the system <a href=\"https://blog.pancakeswap.finance/articles/introducing-gauges-voting-and-ve-cake-your-ownership-of-cake-emissions\" target=\"_blank\" rel=\"noopener nofollow\">allows</a> governance token holders to vote for additional rewards to be distributed to particular pools, according to a Nov. 22 blog post. The exchange has also sunsetted its vCAKE metric, replacing it with a new metric called “veCAKE.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Your CAKE, Your Voice<br><br>Introducing Gauges Voting and veCAKE<br><br>More governance power <br>Control CAKE emissions <br>Deeper liquidity <br>Vote Incentives<a href=\"https://t.co/doaCruwMV6\">https://t.co/doaCruwMV6</a> <a href=\"https://t.co/GxHGHdIG4J\">pic.twitter.com/GxHGHdIG4J</a></p>&mdash; PancakeSwapEveryone&#39;s Favorite DEX (@PancakeSwap) <a href=\"https://twitter.com/PancakeSwap/status/1727311273023742115?ref_src=twsrc%5Etfw\">November 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Pancakeswap <a href=\"https://defillama.com/dexs\" target=\"_blank\" rel=\"noopener nofollow\">is</a> the third-largest decentralized exchange in terms of total value locked (TVL), according to blockchain analytics platform DeFiLlama. At the time of publication, it had over $1.4 billion TVL. Its governance token, CAKE, is distributed as a reward to users who provide liquidity. It is governed by a decentralized autonomous organization, CakeDAO, which comprises all CAKE holders.</p><p>Under the new system, CAKE holders can vote on which pools will receive additional rewards every two weeks. However, to gain the ability to vote, they must lock their CAKE into a smart contract for a set period. The longer they lock their tokens up, the more voting power they receive. Voting power is measured in a metric called “veCAKE,” which has replaced the previous “vCAKE” metric, the post stated.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/pancakeswap-adds-portfolio-manager-function-partnership-bril\"><strong>PancakeSwap adds portfolio manager function in partnership with Bril</strong></a></em></p><p>The exchange has also eliminated its “syrup pool” reward system, which previously allowed members of CakeDAO to stake their CAKE to receive an additional share of the exchange’s fees. Instead, the additional fees will now only be given out to users who have veCAKE.</p><p>According to the post, this change was implemented to increase the utility of the CAKE token, allowing only CAKE holders to influence which pools are most profitable:</p><blockquote>“The beauty of this system lies in its exclusivity, as only veCAKE holders can channel CAKE emissions towards the pools where you have stakes, earning additional CAKE emissions as their pools garner more votes[.]”</blockquote><p>To facilitate the transition from vCAKE to veCAKE, the exchange’s interface now provides the option for staked CAKE to be transferred into the new contract by pushing a button and confirming the transaction.</p><p>Pancakeswap isn’t the only DEX adding new features in November. On Nov. 14, Uniswap <a href=\"https://cointelegraph.com/news/uniswap-android-app-launch-swap-function\">released an Android version</a> of its mobile wallet, and Sushiswap began <a href=\"https://cointelegraph.com/news/sushi-taps-into-zetachain-to-test-native-bitcoin-defi-swaps\">testing native Bitcoin swaps</a> across 30 networks on Nov. 17.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-22T17:00:30.000Z",
    "title": "Bitcoin and gold show similar trends as miner shares fall behind spot prices",
    "url": "https://cryptoslate.com/insights/bitcoin-and-gold-show-similar-trends-as-miner-shares-fall-behind-spot-prices/",
    "description": "<p>Quick Take CryptoSlate&#8217;s recent analysis has highlighted a growing divergence between Bitcoin miners and the spot price of Bitcoin, hypothesizing a link to the upcoming halving event next year. Intriguingly, this trend seems to echo in the world of precious metals, gold, to be precise. The spot price of gold reached $2,000 this week; this [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-and-gold-show-similar-trends-as-miner-shares-fall-behind-spot-prices/\">Bitcoin and gold show similar trends as miner shares fall behind spot prices</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-22T16:40:27.000Z",
    "title": "GCEX Receives Operational VASP Licence from Dubai’s Virtual Assets Regulatory Authority",
    "url": "https://www.cryptoglobe.com/latest/2023/11/gcex-receives-operational-vasp-licence-from-dubais-virtual-assets-regulatory-authority/",
    "description": "Singapore, Singapore, November 22nd, 2023, Chainwire GC Exchange FZE (GCEX), part of the GCEX Group, has been granted an Operational VASP Licence for VA Broker Dealer services from Dubai’s Virtual Asset Regulatory Authority (VARA). GCEX, which opened its Dubai office in July 2022 and received its MVP (Minimal Viable Product) Preparatory License from VARA in February […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-22T17:01:43.000Z",
    "title": "Can Ripple (XRP) Capitalize on the Bullish Hints from Kraken's Legal Strife?",
    "url": "https://cryptodaily.co.uk/2023/11/can-ripple-xrp-capitalize-on-the-bullish-hints-from-krakens-legal-strife",
    "description": "Explore Ripple (XRP) in the midst of Kraken's legal developments with our in-depth analysis. Uncover the subtle yet potentially significant bullish signs for XRP, arising amidst the market downturn and Kraken's legal challenges. Stay informed with our expert insights, offering a strategic perspective on this altcoin's potential market trajectory in this unpredictable financial environment."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-22T17:00:00.000Z",
    "title": "Genesis Alleges Multi-Million Dollar Preferential Transfers by Gemini Amidst Crypto Turmoil",
    "url": "https://news.bitcoin.com/genesis-alleges-multi-million-dollar-preferential-transfers-by-gemini-amidst-crypto-turmoil/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/ssddd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Genesis Alleges Multi-Million Dollar Preferential Transfers by Gemini Amidst Crypto Turmoil\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/ssddd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ssddd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ssddd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ssddd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ssddd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ssddd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ssddd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent legal move, Digital Currency Group’s (DCG) subsidiary Genesis Global Capital LLC has filed a complaint against the crypto exchange platform and custodian Gemini. Genesis hopes to claw back $689 million from the centralized crypto trading platform founded by Cameron and Tyler Winklevoss in 2014. Genesis Targets Gemini in $689M Legal Battle Over [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-22T16:41:22.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Cardano stands out as a project with remarkable potential beyond its role as a tradable asset. Rooted in scholarly peer-reviewed research, it has cultivated a robust community over time. Here, we delve into the essence of Cardano and offer a projection for the future value of ADA. How much is ADA ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-22T17:00:33.000Z",
    "title": "Ethereum L2 Blast Crosses $123 Million, Important Things To Know Before You Bridge In",
    "url": "https://www.newsbtc.com/crypto/ethereum-l2-blast-123-million/",
    "description": "Blast, a brand new Ethereum Layer 2 network, has drawn a startling amount of interest and security concerns due to a surge of investors using the network to bridge their assets.  Blast Hits $123 Million In TVL Blast recently announced its mainnet access on X (formerly Twitter). The L2 network built by Pacman Blur has gained a staggering amount of attention from crypto investors following the declaration. “Introducing Blast: The only Ethereum L2 with native yield for ETH and stablecoins. We’ve raised $20m from Paradigm and StandardCrypto to build the L2 that helps you earn more,” Blast stated.  Related Reading: Global Banks Are Betting Big On XRP, Report Shows Blast recorded over 23,368 users in just 24 hours of announcing the imminent launch of its mainnet. The influx of investors pushed Blast’s Total Value Locked (TVL) to $81 million in a single day.  “23,368 users have joined the Blast Community in the past 24 hours. Thanks to them, Blast has reached $81 Million in TVL in one day! We&#8217;re excited to share more with community members soon. There&#8217;s much more to come,” Blast said.  Presently, Blast has recorded over $123 million in TVL from assets bridged by investors. This unexpected surge in bridging demands has raised concerns especially due to the unusual conditions attached to the bridging process.  Source: DeFiLlama According to Blast, users can only access the Ethereum L2 network after receiving an invitation code. The network has also stated that users will not be able to withdraw their bridged funds until February 2024.  While the unconventional bridging conditions have raised some red flags, many investors continue to express their interest by actively bridging their assets  Details About New Ethereum L2 Network Blast has outlined several important details of its bridging and staking processes. The Ethereum L2 network highlighted the potential yield benefits of investors when they bridge their ETH tokens and stablecoins. The network has also stated that investors who stake their ETH can gain profits over time as their assets grow in their Blast wallets.  “Once you have access, you can bridge to earn yield (4% for ETH + 5% for stablecoins) and Blast Points ahead of the Mainnet launch in February (2024). Early access members get more points based on how much they bridge and who they invite,” Blast stated. Related Reading: Ethereum Exchange Supply Drops To 5-Year Lows, What This Means For Price The L2 network added: Specifically, Blast natively participates in ETH staking, and the staking yield is passed back to the L2’s users and dapps. We’ve redesigned the L2 from the ground up so that if you have 1 ETH in your wallet on Blast, over time it grows to 1.04, 1.08, 1.12 ETH automatically. Additionally, Blast has expanded its bridging capabilities to a diverse range of digital assets. According to the L2 network, investors can bridge beyond ETH and opt for stablecoins such as USDT, DAI, and more.  “It’s not just ETH on Blast that earns yield. Stablecoins do too. When you bridge stablecoins like USDC, USDT, and DAI to Blast, it’s deposited in on-chain T-Bill protocols like MakerDAO, and the yield is passed back to Blast users via USDB, Blast’s auto-rebasing stablecoin,” Blast stated. ETH price regains support above $2,000 &#124; Source: ETHUSD on Tradingview.com Featured image from Metaverse Post, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-22T17:08:42.000Z",
    "title": "Cornell University Study Proposes Bitcoin as a Driver for Renewable Energy Development – Report",
    "url": "https://www.crypto-news-flash.com/cornell-university-study-proposes-bitcoin-as-a-driver-for-renewable-energy-development-report/?utm_source=rss&utm_medium=rss&utm_campaign=cornell-university-study-proposes-bitcoin-as-a-driver-for-renewable-energy-development-report",
    "description": "<img width=\"1186\" height=\"656\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/btc-mining.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"btc mining\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/btc-mining.png 1186w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/btc-mining-300x166.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/btc-mining-1024x566.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/btc-mining-768x425.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/btc-mining-24x13.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/btc-mining-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/btc-mining-48x27.png 48w\" sizes=\"(max-width: 1186px) 100vw, 1186px\" />The latest study by Cornell University has proposed that Bitcoin mining promotes renewable energy development. The study also shows that some projects across the US could benefit from Bitcoin mining during the pre-commercial development phase.  The campaign against Bitcoin mining as an environmentally unfriendly process reached its height in 2021 when researchers deemed the process [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-22T16:47:37.000Z",
    "title": "Circle Unleashes Simplified Bridged USDC Standard, Empowering New Blockchains",
    "url": "https://www.crypto-news-flash.com/circle-unleashes-simplified-bridged-usdc-standard-empowering-new-blockchains/?utm_source=rss&utm_medium=rss&utm_campaign=circle-unleashes-simplified-bridged-usdc-standard-empowering-new-blockchains",
    "description": "<img width=\"1280\" height=\"768\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/blockchain-3448502_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/blockchain-3448502_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/blockchain-3448502_1280-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/blockchain-3448502_1280-1024x614.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Circle introduces Bridged USDC Standard to make USDC deployment on new blockchains faster and easier, solving the &#8220;cold start&#8221; problem. Bridged USDC allows quick access to stablecoin liquidity, while native USDC is fully backed and redeemable 1:1 for US dollars. In a move aimed at streamlining the deployment of USD Coin (USDC) on Ethereum-virtual machine [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-22T16:39:49.000Z",
    "title": "Best Crypto Alt Coins to Buy Now | Analysis of Top Altcoins in the Crypto Bull Run and New Memecoins",
    "url": "https://www.crypto-news-flash.com/best-crypto-alt-coins-to-buy-now-analysis-of-top-altcoins-in-the-crypto-bull-run-and-new-memecoins/?utm_source=rss&utm_medium=rss&utm_campaign=best-crypto-alt-coins-to-buy-now-analysis-of-top-altcoins-in-the-crypto-bull-run-and-new-memecoins",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-48-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-48-1.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-48-1-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto landscape in 2023 is reverberating with eager energy, as indicators hint at a looming cryptocurrency bull run. This period is shining a spotlight on a mix of thrilling altcoins and intriguing new meme coins. Among these top tokens, ApeMax is emerging as a standout player, captivating the market with its innovative &#8220;Boost-to-Earn&#8221; feature. [...]"
  }
]