[
  {
    "source": "CryptoGlobe",
    "date": "2023-11-11T02:00:00.000Z",
    "title": "Bitcoin ($BTC) Price Could Skyrocket Back to Previous High This Quarter, Analyst Suggests",
    "url": "https://www.cryptoglobe.com/latest/2023/11/bitcoin-btc-price-could-skyrocket-back-to-previous-high-this-quarter-analyst-suggests/",
    "description": "A prominent cryptocurrency trader has recently suggested that the price of the flagship cryptocurrency Bitcoin ($BTC) could soon surge by over 95% to reach its all-time high at around $69,000 per token. In a post shared on the microblogging platform X (formerly known as Twitter) with their over 140,000 followers, analyst Dave the Wave, who […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-11T02:00:04.000Z",
    "title": "Ripple Vs. SEC: Epic Battle Unfolds Over $770M Disgorgement Demand",
    "url": "https://www.newsbtc.com/news/ripple/ripple-vs-sec-epic-battle-unfolds-over-770m-disgorgement-demand/",
    "description": "In a recent interview with CNBC, Brad Garlinghouse addressed the ongoing legal battle between Ripple and the US Securities and Exchange Commission (SEC) over the classification of XRP.  Garlinghouse highlighted three consecutive wins for Ripple in the legal proceedings, emphasizing that the first judgment on July 13 clearly stated that XRP is not a security. He also mentioned denying the court&#8217;s interlocutory appeal and dismissing allegations against Ripple co-founder Chris Larsen and himself. Ripple CEO Brad Garlinghouse Criticizes SEC&#8217;s Regulatory Approach In the interview, Garlinghouse criticized the SEC&#8217;s approach to regulation by enforcement and lawsuit patterns, stating that the SEC needs to step back and realize that their actions are deviating from its mission to protect investors.  Garlinghouse questioned who the SEC is truly protecting in this journey and called for a change in their regulatory approach. Related Reading: $5 Million Reward: Justin Sun’s Bold Move Against Poloniex Attackers Commenting on the exchange-traded funds (ETFs) currently awaiting approval, Garlinghouse acknowledged that an approved ETF could bring significant capital to the market. However, Brad emphasized that regulatory clarity, utility, and scalable problem-solving are essential for the industry to thrive. Garlinghouse expressed his optimism for the industry&#8217;s future, citing macro catalysts that will propel it forward in the next five to ten years. Pro-XRP Lawyer Challenges SEC&#8217;s $770M Disgorgement Demand In a separate development, pro-XRP lawyer John Deaton chimed in on X (formerly Twitter), stating that Ripple would not come close to paying the $770 million disgorgement demanded by the SEC.  Deaton argued that the SEC&#8217;s claim for disgorgement related to XRP sales in the UK, Japan, Switzerland, and other jurisdictions is flawed. He pointed out that XRP is deemed a non-security in those jurisdictions and was considered a legal exchange/utility token.  Deaton questioned the SEC&#8217;s attempt to disgorge sales made in those jurisdictions and emphasized that the Court&#8217;s goal is not to punish Ripple as this is not a fraud case. Deaton further explained that the disgorgement amount would be significantly reduced after deducting non-US sales, sales to accredited investors and considering the minimal harm caused by ODL (On-Demand Liquidity) transactions.  Deaton highlighted that a petition filed by 75,000 XRP holders claimed that the SEC, not Ripple, was causing harm, further bolstering Ripple&#8217;s position. Related Reading: MicroStrategy’s $4.6 Billion Bitcoin Bet Pays Off, Here’s How Much It’s Worth Now The remarks made by Brad Garlinghouse and John Deaton underscore the ongoing legal battle between Ripple and the SEC, with Ripple asserting its stance on XRP&#8217;s classification and criticizing the SEC&#8217;s regulatory approach.  The outcome of this high-profile case will likely have significant implications for the cryptocurrency industry as a whole. As of the time of writing, XRP is currently trading at $0.660, exhibiting a sideways price movement and consolidating above this crucial level. Despite the lack of significant upward or downward movement, the token has experienced substantial gains amidst the recent bullish reversal in the market. Over the past 30 days, XRP has surged by more than 35%, and on a year-to-date basis, it has recorded an impressive growth of over 70%. Featured image from Shutterstock, chart from TradingView.com "
  }
]