[
  {
    "source": "Decrypt",
    "date": "2024-02-23T16:44:18.000Z",
    "title": "Xai Gaming Token Hits All-Time High, Ronin Still Recovering After Founder’s Wallets Drained",
    "url": "https://decrypt.co/218759/xai-gaming-token-high-ronin-recovering-founder-hack",
    "description": "Ronin (RON) is gradually rebounding after Axie Infinity co-founder Jeff Zirlin’s wallets were hacked, while XAI jumped to a new peak."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-23T16:43:03.000Z",
    "title": " Texas Blockchain Council and Riot Platforms sue energy officials over crypto mining data ",
    "url": "https://cointelegraph.com/news/texas-blockchain-council-riot-platforms-lawsuit-energy-officials-crypto-mining-data",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNTFjMzJlMDctOTdiYS00NTY5LTgyZTMtNzM4MjNlODUzNGRkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Plaintiffs in the lawsuit suggested that an Energy Information Administration mandatory survey for crypto miners was politically motivated and an overreach of government authority.</p>\n                    <p><p>The Texas Blockchain Council (TBC) and mining firm Riot Platforms filed a lawsuit over the Energy Information Administration’s attempt to gather information on energy usage from crypto miners.</p><p>In a Feb. 22 filing in United States District Court for the Western District of Texas, the TBC and Riot <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.txwd.1172776308/gov.uscourts.txwd.1172776308.1.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">alleged</a> the U.S. Department of Energy, Energy Information Administration (EIA), Office of Management and Budget (OMB) and their leadership sought an “invasive” data collection from cryptocurrency miners. The lawsuit was filed ahead of a Feb. 23 deadline under the threat of fines and penalties to respond to an EIA survey on the electricity usage of mining companies. </p><p>The TBC <a href=\"https://www.prnewswire.com/news-releases/texas-blockchain-council-announces-legal-action-against-the-department-of-energys-energy-information-administration-overreach-302069507.html\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> the collection was politically motivated, arguing that requiring mining firms to provide the U.S. government with potentially contractual information and making it public would represent an overreach in authority. The group called out Senator Elizabeth Warren and the White House for orchestrating the EIA action and requested the court approve a temporary restraining order stopping the data collection.</p><p><a href=\"https://cointelegraph.com/news/texas-blockchain-council-riot-platforms-lawsuit-energy-officials-crypto-mining-data\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-23T16:43:46.000Z",
    "title": "Unstoppable Domains teams up with Pudgy Penguins to offer ‘.pudgy’ domain name",
    "url": "https://cryptobriefing.com/unstoppable-domains-pudgy-penguins-domain-name/",
    "description": "Unstoppable Domains partners with Pudgy Penguins to launch '.pudgy' domain names with zero renewals and lifetime community perks."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-23T17:00:01.000Z",
    "title": "Avalanche Blockchain Faces Outage Amid Inscription Wave: AVA Labs Investigates",
    "url": "https://news.bitcoin.com/avalanche-blockchain-faces-outage-amid-inscription-wave-ava-labs-investigates/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/avaxxxx-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Avalanche Blockchain Faces Outage Amid Inscription Wave: AVA Labs Investigates\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/avaxxxx-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/avaxxxx-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/avaxxxx-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/avaxxxx-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/avaxxxx-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/avaxxxx-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/avaxxxx.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Avalanche blockchain has encountered a disruption due to a &#8220;stall in block finalization.&#8221; AVA Labs&#8217; co-founder, Kevin Sekniqi, suggested that the problem might stem from a recent surge in inscriptions. Avalanche Hits Snag as Block Finalization Stall Disrupts Service Avalanche (AVAX) is grappling with a service interruption, echoing challenges previously seen on the Solana [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T17:02:01.000Z",
    "title": "Nvidia Identifies Huawei as Top Competitor in Annual Filing",
    "url": "https://www.cryptopolitan.com/nvidia-identifies-huawei-as-top-competitor-in-annual-filing/",
    "description": "In a recent disclosure to the US Securities and Exchange Commission, Nvidia, the world&#8217;s leading chipmaker, acknowledged Chinese tech giant Huawei as a significant competitor for the first time. This revelation underscores the intensifying competition within the global semiconductor industry, particularly in the lucrative market for artificial intelligence (AI) chips. Growing competition in the AI [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T17:00:24.000Z",
    "title": "Bitcoin ETF inflows rebound despite short-term weakness",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-inflows-rebound-despite/",
    "description": "Recently, cryptocurrency investment has witnessed a fascinating interplay between institutional activity and Bitcoin&#8217;s price movements. Despite a brief spell of weaker inflows into spot Bitcoin exchange-traded funds (ETFs), the market has displayed notable resilience, with investors closely monitoring developments to gauge the cryptocurrency&#8217;s future trajectory. Reversal of inflows: A temporary setback Last week, Bitcoin experienced [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T17:00:00.000Z",
    "title": "Top 5 Memecoins Eyeing Dogecoin’s Success",
    "url": "https://www.cryptopolitan.com/top-5-memecoins-eyeing-dogecoins-success/",
    "description": "In the vast and ever-evolving world of cryptocurrencies, meme coins have carved out a unique niche. These coins, often inspired by internet memes or viral trends, have gained popularity for their quirky branding and community-driven appeal. Among them, Dogecoin stands tall as a pioneer, capturing the imagination of crypto enthusiasts worldwide. However, as the market [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T16:51:14.000Z",
    "title": "Unlocking the Mysteries of Creativity: Insights from News Scientist",
    "url": "https://www.cryptopolitan.com/mysteries-of-creativity-from-neuroscience/",
    "description": "In a recent report by News Scientist, the enigma of creativity, spanning from the literary brilliance of Jane Austen to the innovative genius of Zaha Hadid, has long fascinated minds. While some individuals appear naturally endowed with boundless creative prowess, the underlying mechanisms behind this phenomenon have remained elusive. However, recent advancements in neural network [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T16:47:36.000Z",
    "title": "AI-Enhanced Colonoscopy Reduces Cancer Risk",
    "url": "https://www.cryptopolitan.com/ai-enhanced-colonoscopy-reduces-cancer-risk/",
    "description": "A recent study published in The Lancet Digital Health has unveiled promising findings regarding the integration of artificial intelligence (AI) into colonoscopies. Led by Radboud University Medical Center, the research reveals that employing a smart computer during colon examinations results in a significant increase of approximately forty percent in the detection of polyps—a critical precursor [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T16:46:17.000Z",
    "title": "Solana NFTs achieve remarkable milestone with $5 billion in all-time sales",
    "url": "https://www.cryptopolitan.com/solana-nfts-achieve-remarkable-milestone/",
    "description": "Solana-based nonfungible tokens (NFTs) have surged to unprecedented heights, reaching an all-time sales volume exceeding $5 billion, according to data aggregator CryptoSlam. This significant milestone underscores the blockchain&#8217;s growing prominence in the NFT space, fueled by a surge in trading activity over recent months. Surging momentum: From struggle to success After a subdued performance, Solana [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-23T17:05:18.000Z",
    "title": "Uniswap surges to a two-year high after governance upgrade proposal",
    "url": "https://crypto.news/uniswap-governance-upgrade-proposal/",
    "description": "The Uniswap Foundation has proposed an upgrade to enable the distribution of protocol fees to UNI token holders who have actively staked and delegated their voting rights."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-23T16:58:07.000Z",
    "title": "Phantom adds new wallet watcher feature",
    "url": "https://crypto.news/phantom-adds-new-wallet-watcher-feature/",
    "description": "Phantom has launched a new Wallet Watcher feature, allowing users to add wallets as view-only accounts."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-23T16:47:42.000Z",
    "title": "Binance Web3 Wallet adds inscriptions marketplace, supports ERC-404",
    "url": "https://crypto.news/binance-wallet-inscriptions-erc-404/",
    "description": "Binance has announced updates to its Web3 Wallet, including introducing an Inscriptions Marketplace and support for ERC-404 tokens."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-23T16:41:26.000Z",
    "title": "Avalanche C-chain clogged for 4+ hours by inscription barrage",
    "url": "https://crypto.news/avalanche-chain-inscription-barrage/",
    "description": "Avalanche experienced primary network downtime on Feb. 23 for at least three hours as developers moved to implement fixes."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-23T17:00:32.000Z",
    "title": "Axie Infinity Co-Founder Losses Over $10 Million In Hack, AXS Holds Firm",
    "url": "https://www.newsbtc.com/axs/axie-infinity-co-founder-losses-over-10-million-in-hack-axs-holds-firm/",
    "description": "Two personal crypto wallets belonging to Jeff &#8220;Jihoz&#8221; Zirlin, the co-founder of Sky Mavis, the company behind the popular play-to-earn (P2E) game Axie Infinity, have been compromised, reports on February 23 show. Following this hack, over $10 million worth of various crypto assets were stolen, primarily RON, the native token of Ronin Chain, the Ethereum sidechain designed explicitly for Axie Infinity. Axie Infinity Co-Founder Losses Over $10 Million In Hack According to Lookonchain data, the hacker got away with 3.2 million RON worth over $9.53 million. The co-founder also lost over $834,000 worth of Wrapped Ethereum (ETH). There were other small amounts of PIXEL, the native token of Pixels&#8211;a gaming platform; SLP, the coin priming Axie Infinity&#8217;s metaverse; and USDC, a stablecoin.  &#160; Zirlin held around 164 AXS worth less than $1,300. The hack has shown an unexpected holding pattern, especially among project founders. That the co-founder only held 164 AXS is strange, considering the role played in Axie Infinity. The P2E game has distributed billions of assets since its popularity peaked in the last bull cycle. Related Reading: Arbitrum In Freefall, Dips Below $2 As Experts Analyze Recovery Timelines Stolen assets, Lookonchain data reveals, were reportedly converted to ETH and deposited into Tornado Cash, a crypto mixer whose co-founders have an ongoing court case in the United States. In charges brought forward in August 2023, the prosecution team alleges that North Korean hackers used Tornado Cash to launder millions, if not billions, of dollars worth of stolen coins. Some of these tokens were from the Ronin hack, which lost over $600 million in March 2022.  Dedicated To Mission; RON And AXS Post Minor Losses Zirlin confirmed the hack on X on February 23, emphasizing that it was &#8220;limited to my accounts.&#8221; The hack did not affect the Ronin chain or Sky Mavis operations. The co-founder also added that the compromised private keys were not connected to the company&#8217;s internal systems. Related Reading: Bitcoin Bullish Outlook: Analyst Predicts Near-Term Surge To $61,000 Zirlin said they have &#8220;strict security measures in place for all chain-related activities to assuage fears.&#8221; The co-founder also remains upbeat, assuring concerned crypto community members that the project will continue pursuing its mission of bringing &#8220;economic freedom&#8221; to all users. So far, AXS and RON prices remain stable but lower, looking at the performance in the daily chart. AXS and RON have been edging lower since February 21, cooling off after sharp gains from early Q4 2023.  Feature image from Canva, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-23T17:00:47.000Z",
    "title": "New 500X A.I Token Priced Below $0.0091 Draws Interest from Shiba inu (SHIB) Solana (SOL) Investors",
    "url": "https://www.crypto-news-flash.com/new-500x-a-i-token-priced-below-0-0091-draws-interest-from-shiba-inu-shib-solana-sol-investors/?utm_source=rss&utm_medium=rss&utm_campaign=new-500x-a-i-token-priced-below-0-0091-draws-interest-from-shiba-inu-shib-solana-sol-investors",
    "description": "<img width=\"1280\" height=\"717\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/oct.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/oct.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/oct-300x168.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/oct-1200x672.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/oct-768x430.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/oct-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/oct-450x252.jpg 450w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />In an electrifying shift within the cryptocurrency landscape, a new token has emerged, capturing the imagination and interest of the investment community. Priced enticingly below $0.0091, Option2Trade (O2T) stands at the precipice of revolutionizing the crypto market with its advanced A.I.-powered trading capabilities. This promise of a 500x return on investment has not only piqued [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-23T17:00:42.000Z",
    "title": "As AI Crypto Tokens Skyrocket: Will Cardano’s Latest AI Venture, CardanoGPT, Lead the Charge with Its Innovative Girolamo Bot?",
    "url": "https://www.crypto-news-flash.com/as-ai-crypto-tokens-skyrocket-will-cardanos-latest-ai-venture-cardanogpt-lead-the-charge-with-its-innovative-girolamo-bot/?utm_source=rss&utm_medium=rss&utm_campaign=as-ai-crypto-tokens-skyrocket-will-cardanos-latest-ai-venture-cardanogpt-lead-the-charge-with-its-innovative-girolamo-bot",
    "description": "<img width=\"1200\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-23T170658.096.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-23T170658.096.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-23T170658.096-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-23T170658.096-768x576.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-23T170658.096-150x113.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-23T170658.096-450x338.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Over the past two and a half weeks, the world of artificial intelligence (AI) cryptocurrencies has witnessed an extraordinary surge, adding a staggering $10.21 billion to their collective market value as at the time of writing. This remarkable growth spurt in the value of AI cryptocurrency assets can be traced back to Nvidia&#8217;s exceptional earnings [...]"
  }
]