[
  {
    "source": "Decrypt",
    "date": "2023-07-14T10:01:35.000Z",
    "title": "Multichain Shutters Operations After Chinese Police Take CEO’s Sister Into Custody",
    "url": "https://decrypt.co/148559/multichain-shutters-operations-chinese-police-take-ceo-sister-custody",
    "description": "Chinese police have detained Multichain's CEO and his sister, and impounded operational funds, forcing the team to shutter operations."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-14T09:46:51.000Z",
    "title": "The Ripple Effect: Crypto Market Soars $73.5B After Judge's Ruling in XRP SEC Case",
    "url": "https://decrypt.co/148555/the-ripple-effect-crypto-market-soars-73-5b-after-judges-ruling-xrp-sec-case",
    "description": "Positive gains spread across the board as Ripple’s partial win against the SEC uplifts the crypto market’s spirits."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T10:01:43.000Z",
    "title": "Can XRP price hit $1? Watch these levels next",
    "url": "https://cointelegraph.com/news/xrp-price-hit-1-dollar-ripple-levels",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/8d638fee-ead5-4e73-a2fc-07a2598dc796.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>XRP price almost doubled after Ripple's legal win against the U.S. SEC. But can its rally continue after nearly reaching $1?</p>\n                    <p><p>The price of XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) has skyrocketed in the aftermath of a federal court ruling <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">saying</a> that its sales on crypto exchanges complied with U.S. securities laws.</p><p>On July 14, XRP price retreated by about 10% to $0.76, but compared to its lowest price the previous day, it was still up around 65%. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/why-is-xrp-price-up-today\">Why is XRP price up today?</a></em></strong></p><p>At its highest in the last 24 hours, the XRP/USD pairreached $0.93, its best level since December 2021, just shy of hitting the $1 mark.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/3567068e-3a41-4e7f-b1c2-3700f3d3c2b6.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USD daily price chart. Source: TradingView</em></figcaption></figure><h2>A whale-backed XRP rally</h2><p>Certain indicators show that XRP's ongoing price pump may not be just a short-term reaction to the positive news for Ripple.</p><p>For instance, the duration of XRP's massive pump coincides with its trading volumes reaching a 10-month high. Meanwhile, the number of XRP whale transactions — or wallets holding more than $100,000 — climbed to their best level in 2023, suggesting that the richest investors back the XRP rally.</p><p>\"If key whale and shark addresses are increasing their supply going into this pump, then it is a get foreshadowing signal that the pump may just be getting started, and it's a sign of good things to come,\" <a href=\"https://insights.santiment.net/read/xrp-shocking-the-crypto-world-with-a-87-surge-over-the-span-of-3-hours-7340\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> Brian Q, analyst at data analytics platform Santiment.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/e5e35a71-6d02-4294-ad21-5d3196d11462.png\"  /><figcaption style=\"text-align: center;\"><em>Whale transaction count (&gt;$100K). Source: Santiment</em></figcaption></figure><p>Furthermore, the XRP price gains come in line with a rise in the supply held by entities with a 100,000-10 million token balance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/348d655f-f912-49f0-a0d5-de9ef6e45966.png\"  /><figcaption style=\"text-align: center;\"><em>XRP supply held by whales. Source: Santiment</em></figcaption></figure><p>In other words, whales have not sold the rally but actually <a href=\"https://cointelegraph.com/news/xrp-price-eyes-30-upside-after-key-resistance-area-breaks\">accumulated XRP</a>, suggesting most want to position themselves for further gains.</p><h2>XRP to $1 and beyond?</h2><p>From a technical standpoint, XRP can test the key $1 level in the coming days, but its potential to continue its rally beyond looks weak for the time being.</p><p>Notably, the pullback on July 14 occurred near a resistance confluence comprising of a multi-year horizontal trendline (purple) and a giant descending trendline ceiling (black). </p><p>In addition, XRP's weekly relative strength index (RSI) has turned overbought, raising its correction prospects.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/270990b6-4def-4eb2-8b74-05d114f18a5d.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USD daily price chart. Source: TradingView</em></figcaption></figure><p>Should a pullback occur, XRP price risks dropping toward its multi-year ascending trendline support near $0.45 by September, down around 55% from the current price level. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/xrp-scams-on-rise-sec-induced-hype\">Ripple CTO warns against XRP scams amid SEC-induced hype</a></em></strong></p><p>Other price targets include the token's 50-week exponential moving average (50-week EMA; the red wave) near $0.48 and 200-week EMA (the blue wave) near $0.50.</p><p>On the other hand, an overbought RSI could also result in the XRP price consolidating sideways inside the $0.75-1 range.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5c559b06-a648-44d0-b617-da085461e9c4.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USD weekly price chart. Source: TradingView</em></figcaption></figure><p>If XRP price decisively breaks above $1, then its next price target by September will likely be near $1.35, a resistance level from the August-December 2021 session.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T09:56:31.000Z",
    "title": "Multichain stops operations over lack of funds ",
    "url": "https://cointelegraph.com/news/multichain-stops-operations-over-lack-of-funds",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/e2a1061b-13e1-4868-a9a8-2b17a8e0ca08.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Multichain team said that the team’s funds and access to servers are currently with their CEO Zhaojun who is under Chinese police custody. </p>\n                    <p><p>Cross-chain router protocol Multichain has announced that it is \"forced to cease operations\" because of the lack of operational funds. The announcement follows a report from blockchain analytics firm Chainalysis saying that withdrawals <a href=\"https://cointelegraph.com/news/multichain-possible-rug-pull-chainalysis\">appear to be a “rug pull”</a> by insiders. </p><p>On July 14, Multichain’s official Twitter account announced that it will be finally halting its operations. The team said that a “lack of alternative sources of information and corresponding operational funds” has forced them to shut down their business activities. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1. On May 21, 2023, Multichain CEO Zhaojun was taken away by the Chinese police from his home and has been out of contact with the global Multichain team ever since. The team contacted the MPC node operators and learned that their operational access keys to MPC node servers had…</p>&mdash; Multichain (Previously Anyswap) (@MultichainOrg) <a href=\"https://twitter.com/MultichainOrg/status/1679768407628185600?ref_src=twsrc%5Etfw\">July 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In the tweet, the team also highlighted that the global Multichain team has not had contact with their CEO, known as “Zhaojun,” since he was detained<a href=\"https://cointelegraph.com/news/multichain-team-cannot-locate-ceo-halts-service-for-affected-chains\"> by Chinese police</a>. According to the team, they've contacted the CEO's family and learned that Zhaojun's computers, phones, wallets and mnemonic phrases were seized by the authorities. They wrote: </p><blockquote>“Since the inception of the project, all operational funds and investments from investors have been under Zhaojun's control. This also means that all the team's funds and access to the servers are with Zhaojun and the police.”</blockquote><p>They added that Zhaojun’s sister notified the team of an asset preservation act, transferring some funds to addresses under her control. However, this was followed by the Multichain CEO’s family notifying the team that Zhaojun’s sister was also taken into custody by the police and is now out of contact. As a result, the team announced that it’s now halting its operations. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/multichain-executor-has-been-draining-anyswap-tokens-report\"><strong><em>Multichain Executor has been ‘draining’ AnySwap tokens: Report</em></strong></a></p><p>The Multichain debacle started in May when Multichain routes were <a href=\"https://cointelegraph.com/news/multichain-token-plunges-30-on-backend-upgrade-delay\">suspended due to an upgrade</a>, and fund transfers started taking longer than expected. Following this, crypto exchange Binance <a href=\"https://cointelegraph.com/news/binance-ceases-support-for-deposits-and-withdrawals-of-suspended-multichain-bridged-tokens\">halted deposit and withdrawal support</a> for some Multichain bridged tokens because of the uncertainties surrounding the protocol. </p><p>To make matters worse for the platform, large outflows from the Multichain MPC bridge platform sparked fears of an exploit. On July 6, on-chain observers <a href=\"https://cointelegraph.com/news/multichain-mpc-bridge-sees-millions-in-outflows-exploit-feared\">concluded that the protocol was hacked</a> as over $100 million worth of assets were withdrawn from its Fantom bridge on the Ethereum side. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/zkrollups-endgame-scaling-blockchains-polygon-miden-founder/\"><strong><em>ZK-rollups are ‘the endgame’ for scaling blockchains, Polygon Miden founder</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-14T10:00:43.000Z",
    "title": "SOL, MATIC, ADA gain over 20% on Bitcoin as SEC targeted tokens see mixed performance",
    "url": "https://cryptoslate.com/sol-matic-ada-gain-over-20-on-bitcoin-as-sec-targeted-tokens-see-mixed-performance/",
    "description": "<p>Following the landmark decision for Ripple, asserting that some sales of XRP did not constitute securities sales, tokens included in the U.S. Securities and Exchange Commission (SEC) lawsuits against major cryptocurrency exchanges Binance and Coinbase experienced noticeable price movements. Some of these tokens managed to recover, while others displayed a more stagnant performance when denominated [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sol-matic-ada-gain-over-20-on-bitcoin-as-sec-targeted-tokens-see-mixed-performance/\">SOL, MATIC, ADA gain over 20% on Bitcoin as SEC targeted tokens see mixed performance</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-14T10:00:24.000Z",
    "title": "Crypto market massive surge following SEC defeat on XRP",
    "url": "https://cryptodaily.co.uk/2023/07/crypto-market-massive-surge-following-sec-defeat-on-xrp",
    "description": "<p>Yesterday&rsquo;s pronouncement by the SDNY judge that XRP can only be partially classed as a security led to a huge rise in cryptocurrencies.</p>\nSEC loses millions of taxpayer dollars\n<p>After a 3-year long court battle and millions of US taxpayer dollars spent on fighting the case by the SEC the judge has mainly come down on the side of Ripple, which also spent more than $200 million on legal costs.</p>\n<p>As the judgement is digested across the crypto sector, the ramifications of this ruling can potentially be massive for other crypto companies that are in dispute with the SEC, although there is still the possibility that the US securities regulator may decide to appeal the decision.</p>\n\n<p>the crypto market literally exploded</p>\n\n$XRP explodes\n<p>Be that as it may, when the news broke on Thursday afternoon the crypto market literally exploded. $XRP, the native token of Ripple, went on a vertical trajectory that took it as far as 97% up on the day. It has since fallen back to resistance at $0.78 which it will now likely turn into support.</p>\n<p>Those long on bitcoin used the market surge to propel the king of the cryptos past $31,000, which it looks to have turned into support, potentially giving it the platform to drive up from this level, one that has kept bitcoin from rising higher since April.</p>\n<p>Now that this level could be about to be broken and flipped into support, bitcoin could act like a beachball that has been kept under water and finally been released. An upsurge to $37,000 and even potentially $45,000 could be next.</p>\nSolana makes hay\n<p>Plenty of other cryptocurrencies made hay while the Ripple/$XRP sun shone. Among these, the most notable was Solana ($SOL). Between Thursday afternoon and Friday morning $SOL rose almost 50%.&nbsp;</p>\n<p>A high of $32 was reached before the lightning fast layer 1 settled back down to around $29.40 at time of going to press. Once past $30 again, the next resistance is at $38.70. Now that things appear so much more positive for tokens that have been deemed securities by the SEC, such as $SOL, the shackles are now well and truly off and true growth can happen.</p>\nAltcoins embark on bull market\n<p>The Total 3 market cap (all cryptocurrencies except bitcoin and ethereum) shot up like a rocket on Thursday, driving through the top of a downwards channel it has been following since mid 2022. The price has come back to test the top of this channel, and should it hold above, it&rsquo;s onwards and upwards for the altcoins in what can become the early stages of the next crypto bull market.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-14T10:00:12.000Z",
    "title": "Hackvolution: BNB Chain kicks off Hackathon to Drive Innovation and Collaboration",
    "url": "https://news.bitcoin.com/hackvolution-bnb-chain-kicks-off-hackathon-to-drive-innovation-and-collaboration/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/f2bdf494-9e39-4403-b538-1ecb4c57982c-768x432.jpeg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/f2bdf494-9e39-4403-b538-1ecb4c57982c-300x169.jpeg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/f2bdf494-9e39-4403-b538-1ecb4c57982c-1024x576.jpeg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/f2bdf494-9e39-4403-b538-1ecb4c57982c-768x432.jpeg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/f2bdf494-9e39-4403-b538-1ecb4c57982c-190x107.jpeg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/f2bdf494-9e39-4403-b538-1ecb4c57982c-380x214.jpeg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/f2bdf494-9e39-4403-b538-1ecb4c57982c-760x428.jpeg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/f2bdf494-9e39-4403-b538-1ecb4c57982c.jpeg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. BNB Chain, the world&#x2019;s largest smart contract blockchain in terms of daily active users, has today announced Hackvolution, its global 7-week Hackathon, starting on July 13th and running until September 1st. Hackvolution gets support from COMBO, Google Cloud, CyberConnect, Hooked Protocol, and Ultiverse as key partners with mentors joining from leading universities. Interested [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T09:48:51.000Z",
    "title": "SBF shocking bail request: will he get special treatment for ‘close friends?’",
    "url": "https://www.cryptopolitan.com/sbf-shocking-bail-request/",
    "description": "Sam Bankman-Fried, the former CEO of FTX, has recently requested a modification to his bail conditions in a letter to New York District Court Judge Lewis Kaplan. The letter states that SBF wants his &#8220;close friends&#8221; to be able to visit him at his parents&#8217; home without having to go through the court-ordered security measures ... <a title=\"SBF shocking bail request: will he get special treatment for &#8216;close friends?’\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sbf-shocking-bail-request/\" aria-label=\"More on SBF shocking bail request: will he get special treatment for &#8216;close friends?’\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-14T10:00:44.000Z",
    "title": "Cardano Bulls Reclaim Control As ADA Rallies 28%",
    "url": "https://www.newsbtc.com/analysis/ada/cardano-bulls-reclaim-control-as-ada-rallies-28/",
    "description": "Following Ripple (XRP)’s victory in court yesterday, there is a general bullish wave currently sweeping across the crypto market. According to data from CoinMarketCap, Cardano (ADA) has gained by 28.43% in the last 24 hours, with several other altcoins also posting double digits gains. Cardano (ADA) Price Action And Analysis Prior to its price boost yesterday, ADA had shown little to no movement all week, hovering around the $0.29 price mark. However, the token’s price spiked yesterday afternoon, reaching as high as $0.37 for the first time since early June. Related Reading: XRP Price Retreats After Massive 80% Rally, Buy The Dips? Looking at its broader performance, Cardano has had a mixed-price action since the start of 2023. The altcoin began the year in style, gaining over 70% to trade at $0.41 as of February 16. This price surge was, however,  followed by a bearish trend bringing the token’s price as low as $0.30 on March 10. Thereafter, ADA would resume its bullish trajectory, rising to its highest price so far in 2023 at $0.45 on April 16.  Over the next two months, Cardano’s price slumped once again before showing sideways movement over the last three weeks. Analyzing its 4-Hour Chart, ADA has encountered resistance at the $0.38 price zone and appears to be experiencing a recorrection. However, a rise in selling pressure could result in the token trading as low as $0.28, which marks its imminent support level. On the other hand, if the bulls retake control and manage to push past the $0.38 resistance price level, ADA is likely to rise to $0.42, which represents the next major resistance level.  At the time of writing, ADA is trading at $0.35 with a 2.30% loss in the last hour. The token’s trading volume is up by a stunning 808.08% and is valued at $1.4 billion. With a market cap of $12.3 billion, Cardano is ranked as the 7th biggest cryptocurrency in the world. ADA Trading At $0.35 On The 4-Hour Chart&#124; Source: ADAUSD Chart On Tradingview.com Ripple’s Victory Sparks Altcoin Rally Yesterday afternoon,  U.S. Judge Analisa Torres ruled that XRP is not a security in the ongoing Ripple vs. SEC case. On the emergence of this news, the crypto market experienced a price boost, with mainly altcoins notching significant gains. Asides from Cardano (ADA), coins such as Solana (SOL), Avalanche (AVAX), and Polygon (MATIC), are also on the rise, recording profits at 31.98%, 14.50%, and 17.76%, respectively, in the last 24 hours. Related Reading: Optimism (OP) Rides The Wave Of Today’s Crypto Surge With 15% Rally That said, the premier cryptocurrency was not left out of the current market surge. Bitcoin has gained by 2.81% in the last day to trade above $31,000 again. At the time of writing, the total crypto market cap is valued at $1.26 trillion, with a 6.39% increase in a single day.  Featured Image From Forbes, Chart From Tradingview."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T10:07:04.000Z",
    "title": "Top Crypto Gainers On DexTools: Shib2.0, Floki, Tradecurve – 100X Potential?",
    "url": "https://www.crypto-news-flash.com/top-crypto-gainers-on-dextools-shib2-0-floki-tradecurve-100x-potential/?utm_source=rss&utm_medium=rss&utm_campaign=top-crypto-gainers-on-dextools-shib2-0-floki-tradecurve-100x-potential",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T124059.044.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T124059.044.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T124059.044-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />DexTools, a leading market evaluation tool, is one of the best trends forecasting tools out there. Currently, this tool suggests that Shiba Inu, Floki Inu and Tradecurve all have potential going into July.  Each project has had strong developments recently that pushes its price up. For instance, due to Shibarium’s release, Shiba Inu fans are [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T10:03:40.000Z",
    "title": "Charles Hoskinson Sparks Controversy: Suggests Algorand Should Become a Cardano Sidechain",
    "url": "https://www.crypto-news-flash.com/charles-hoskinson-sparks-controversy-suggests-algorand-should-become-a-cardano-sidechain/?utm_source=rss&utm_medium=rss&utm_campaign=charles-hoskinson-sparks-controversy-suggests-algorand-should-become-a-cardano-sidechain",
    "description": "<img width=\"2048\" height=\"1536\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano founder asks to merge algorand with the community\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-768x576.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-1536x1152.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-24x18.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-36x27.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Hoskinson-48x36.jpg 48w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" />Hoskinson publicly reached out to John Woods, suggesting that Algorand explore the possibility of becoming a sidechain of Cardano. Numerous members of the Algorand community expressed their disapproval and launched scathing criticisms towards Hoskinson. Founder of Cardano, Charles Hoskinson, surprised the blockchain community by extending an olive branch to Algorand, a competing blockchain system, proposing [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T09:42:22.000Z",
    "title": "Polygon (MATIC) up 24%, Solana (SOL) 32%, Cardano (ADA) 25% and Stellar XLM 53% Following Ripple Lawsuit Verdict – Here’s Why Its a Win For These Crypto Assets",
    "url": "https://www.crypto-news-flash.com/polygon-matic-up-24-solana-sol-32-cardano-ada-25-and-stellar-xlm-53-following-ripple-lawsuit-verdict-heres-why-its-a-win-for-these-crypto-assets/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-matic-up-24-solana-sol-32-cardano-ada-25-and-stellar-xlm-53-following-ripple-lawsuit-verdict-heres-why-its-a-win-for-these-crypto-assets",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Investors cheered the outcome of the Ripple lawsuit expecting ADA, SOL, MATIC, and XLM won&#8217;t be classified as securities by the SEC. The development brings confidence among crypto market players to use the Stellar and Solana technology to power their applications. The outcome of the Ripple vs SEC lawsuit is having a market-wide impact with [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-14T09:55:22.000Z",
    "title": "Ripple’s Victory Marks the Beginning of the Alt Season?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/ripples-victory-marks-the-beginning-of-the-alt-season/",
    "description": "<p>Ripple, the blockchain-based payment protocol, recently emerged victorious in a significant legal battle against the U.S. Securities and Exchange Commission (SEC). In this article, we explore three compelling reasons why Ripple&#8217;s legal triumph could potentially kickstart a period of altcoin resurgence. 1) Regulatory Clarity Inspires Confidence The SEC&#8217;s lawsuit against Ripple, which alleged that its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/ripples-victory-marks-the-beginning-of-the-alt-season/\">Ripple&#8217;s Victory Marks the Beginning of the Alt Season?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]