[
  {
    "source": "Cointelegraph",
    "date": "2023-07-04T16:06:45.000Z",
    "title": "Bitcoin ETFs: Even worse for crypto than central exchanges",
    "url": "https://cointelegraph.com/news/bitcoin-etfs-even-worse-for-crypto-than-central-exchanges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/85a65b74-d225-49a4-8848-e9f41ffd0ffb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Want some worthless \"paper\" Bitcoin? With the rise of Bitcoin ETFs, you might soon have the chance to invest in something as worthless as the U.S. dollar.</p>\n                    <p><p>Recent weeks have seen a surge in interest from traditional finance for crypto-based exchange-traded funds (ETFs). After the Securities and Exchange Commission took issue with its initial filing, BlackRock submitted <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner\">a fresh application for a Bitcoin ETF</a> on July 3. A week earlier, <a href=\"https://cointelegraph.com/news/bitcoin-bulls-grill-31k-fidelity-etf-btc-price\">Fidelity led a crop of investment firms</a> in lodging applications with the SEC for Bitcoin-based ETFs. Meanwhile, <a href=\"https://cointelegraph.com/news/hsbc-reportedly-rolls-out-cryptocurrency-services-in-hong-kong\">HSBC has become the first bank</a> to offer Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) ETFs to customers in Hong Kong.</p><p>In the context of Bitcoin, it is often the seemingly positive news that is harmful over the longer term; and vice versa, short-term negative news often serves to strengthen the ongoing case for Bitcoin. A good example of the latter is the 2017 “Blocksize War,” when the Bitcoin community split into the big block camp that launched the Bitcoin Cash fork and the small block camp that implemented the Segregated Witness upgrade in Bitcoin. </p><p>While the result was chaotic in the short term — with many a Bitcoin critic seeking to dance on Bitcoin’s grave — it proved to be one of the most important lessons on decentralized consensus and paved the way for the layered scaling via the Lightning Network that we enjoy today. </p><p>For an example of good news turning negative, we don’t have to go too far back into the past. Up until late 2022, FTX was the prime example of crypto going mainstream, with its <a href=\"https://cointelegraph.com/news/ftx-buys-super-bowl-ad-slot-to-promote-crypto-to-a-tv-audience-of-92m\">Superbowl ads</a>, stadium naming rights and glossy magazine features. But in the end, FTX proved to be a ticking time bomb that blew up in everybody’s face and set back the industry’s legitimacy by years.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today marks 10 years since <a href=\"https://twitter.com/tyler?ref_src=twsrc%5Etfw\">@tyler</a> and I filed for the first spot Bitcoin ETF. The <a href=\"https://twitter.com/SECGov?ref_src=twsrc%5Etfw\">@SECGov</a>&#39;s refusal to approve these products for a decade has been a complete and utter disaster for US investors and demonstrates how the SEC is a failed regulator. Here&#39;s why:<br><br>-&quot;protected&quot;… <a href=\"https://t.co/xmK1xo1iX8\">pic.twitter.com/xmK1xo1iX8</a></p>&mdash; Cameron Winklevoss (@cameron) <a href=\"https://twitter.com/cameron/status/1675302282915610624?ref_src=twsrc%5Etfw\">July 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>And again, as it goes, the seemingly bad news — FTX collapsing and losing a lot of money for its users — will become positive in the long run, as people will take better care of their Bitcoin in the future, thus limiting the systemic risk of large custodian blow-ups.</p><h3>Evade the fakes</h3><p>As we saw with the implosion of FTX and the subsequent market contagion, centralized exchanges were never the answer for everyday investors looking to benefit from the immense promise of Bitcoin. Neither are ETFs. <a href=\"https://cointelegraph.com/learn/bitcoin-etfs-a-beginners-guide-to-exchange-traded-funds\">Bitcoin-linked ETFs</a> are an even worse idea than centralized exchanges, as there is zero possibility of withdrawing the underlying instrument — that is, the Bitcoin. This means the holders are never able to take advantage of the single most important feature of Bitcoin: the ability to control their funds without a need to trust anyone. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-etf-isnt-bullish-for-bitcoin\"><strong><em>Don’t be naive — BlackRock’s ETF won’t be bullish for Bitcoin</em></strong></a></p><p>There are also other dangers for the wider market. With ETFs, there is a risk that “paper Bitcoin,” or claims not backed by actual Bitcoin, could distort the market and undermine Bitcoin’s very monetary policy. Exchanges that have issued paper Bitcoin in the past — such as FTX — have been kept in check via withdrawal runs and eventual collapse, after which the fake Bitcoin claims were wiped out along with the hapless exchanges.</p><p>That likely wouldn’t be the case with ETFs. Without the possibility of withdrawing the underlying asset, paper Bitcoin can be printed at will. If Bitcoin ETFs become the dominant way of investing in Bitcoin, it could very well lead to millions of paper Bitcoin flooding the market, suppressing the price of Bitcoin.</p><h2>With Bitcoin, holding it means owning it</h2><p>In the context of Bitcoin, ownership is very closely linked to control over the cryptographic keys associated with specific Bitcoin addresses. Now, it might be true that someone can own Bitcoin in a legal sense without having direct control over the keys — such as when owning an exchange account or holding an ETF share — but that is simply not a good idea in the Bitcoin world.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/gary-gensler-hurting-little-guys-for-wall-street\"><strong><em>Gary Gensler is hurting the little guys for Wall Street</em></strong></a></p><p>Bitcoin’s digital nature, perfect portability and global liquidity make it especially susceptible to embezzlement, theft or just basic mismanagement. The only way to truly own Bitcoin is to control the keys.</p><p>Some might welcome a possible short-term price pump associated with an approval of a major Bitcoin ETF (such as BlackRock’s), but the long-term impact on Bitcoin adoption would be likely negative (including the long-term price of Bitcoin). The only adoption that actually matters involves self-custody — everything else is a trap.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Josef Tetek</strong> is a Bitcoin analyst for Trezor. A long-time Bitcoiner with a background in Austrian economics and political philosophy, he founded the Czech and Slovak Ludwig von Mises Institute in 2010. He’s the author of two books, <em>Bitcoin: Separation of Money and State</em> and <em>Enemies of State, Friends of Liberty</em>.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-04T15:53:01.000Z",
    "title": "South Africa Will Require Exchanges to Register by Year-End",
    "url": "https://cryptodaily.co.uk/2023/07/south-africa-will-require-exchanges-to-register-by-year-end",
    "description": "<p>South Africa&rsquo;s financial regulator has ordered crypto exchanges in the country to apply for licenses before the end of the year to continue operating. </p>\n<p>Bloomberg reports South Africa&rsquo;s Financial Sector Conduct Authority (FSCA) said cryptocurrency exchanges operating within the country must apply for licenses before year end to continue their operations.</p>\n<p>FSCA Commissioner Unathi Kamlana said in an interview that the authority received about 20 applications since opening licenses a few weeks ago and expects more to be submitted before the deadline on November 20.</p>\n<p>Kamlana said the FSCA plans to take &ldquo;enforcement action&rdquo; against exchanges that continue to operate without a license after the deadline, adding that firms could be closed down or fined. The Commissioner said:</p>\n\n<p>There is potentially serious harm to financial customers when using crypto products, and therefore it makes sense for us to introduce the regulatory framework.</p>\n<p>Time will tell the effectiveness of our measures, and we will continue to work together with the industry to refine and make changes where and if necessary.</p>\n\n<p>Exchanges which operate in South Africa include Binance, the Digital Currency Group-owned Luno, and the Pantera Capital-backed VALR. All these exchanges need to secure licenses if they wish to continue their operations.</p>\nRegulators Step Up Crypto Oversight\n<p>South Africa&rsquo;s tightened crypto oversight comes after a string of bankruptcies in 2022 caused the market to spiral. The collapse of FTX was the catalyst which heightened scrutiny of crypto firms and exchanges.</p>\n<p>EU regulators formally signed its landmark Markets in Crypto Assets (MiCA) into law on May 31, with measures set to take force in 2024. European legislators also formally enacted another law on anti-money laundering, which mandates crypto providers to authenticate their customers&rsquo; identities when conducting wire transfers.</p>\n<p>The UK also voted to pass into law its Financial Services and Markets bill, which will see the country on its way to dealing with crypto as a &ldquo;regulated activity.&rdquo;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-04T16:00:49.000Z",
    "title": "Biggest Movers: ADA Extends Gains, Hitting 10-Day High on Tuesday",
    "url": "https://news.bitcoin.com/biggest-movers-ada-extends-gains-hitting-10-day-high-on-tuesday/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2086645033-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"ADA Extends Gains, Hitting 10-Day High on Tuesday\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2086645033-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2086645033-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2086645033-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2086645033-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2086645033-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2086645033-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2086645033.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Cardano was one of the notable gainers on July 4th, as the token jumped to a ten-day high in today&#x2019;s session. The move came as the global cryptocurrency market was mostly in the green, despite the lower than usual market volume. Polygon also hit a multi-week high. Cardano (ADA) Cardano (ADA) climbed to a ten-day [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T16:07:59.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T16:00:50.000Z",
    "title": "Human Programmers To Be Extinct In 5 Years, An Ominous Interpretation of GitHub Data",
    "url": "https://www.cryptopolitan.com/human-programmers-extinct-5-years-github/",
    "description": "In a recent interview, Emad Mostaque, the founder and CEO of Stability AI, made a thought-provoking prediction about the future of programming: &#8220;There will be no human programmers in five years.&#8221; Mostaque&#8217;s vision encompasses a near future where artificial intelligence (AI) plays a central role in shaping our world. Mostaque&#8217;s claim gains support from data ... <a title=\"Human Programmers To Be Extinct In 5 Years, An Ominous Interpretation of GitHub Data\" class=\"read-more\" href=\"https://www.cryptopolitan.com/human-programmers-extinct-5-years-github/\" aria-label=\"More on Human Programmers To Be Extinct In 5 Years, An Ominous Interpretation of GitHub Data\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T15:57:21.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T15:53:56.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $19.80 with a 24-hour trading volume of $618,897,839. Solana is up 3.58% in the last 24 hours. The current CoinMarketCap ranking is #10, with a live market cap of $7,273,881,101. It has a circulating supply of 394,890,490 SOL coins and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T15:44:57.000Z",
    "title": "Tech giants notify EU of compliance with digital antitrust rules",
    "url": "https://www.cryptopolitan.com/tech-giants-notify-eu-of-compliance-with-digital-antitrust-rules/",
    "description": " Several prominent tech companies, including Amazon.com Inc., Apple Inc., Google&#8217;s parent company Alphabet Inc., and Microsoft Corp., have officially informed the European Union (EU) that they meet the requirements to be subjected to the bloc&#8217;s digital antitrust regulations. This announcement is expected to have far-reaching implications for how these industry leaders operate within the EU. ... <a title=\"Tech giants notify EU of compliance with digital antitrust rules\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tech-giants-notify-eu-of-compliance-with-digital-antitrust-rules/\" aria-label=\"More on Tech giants notify EU of compliance with digital antitrust rules\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T15:42:52.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T15:41:34.000Z",
    "title": "BSV Price Prediction 2023-2032: Will Bitcoin SV Hit $100 Soon?",
    "url": "https://www.cryptopolitan.com/bsv-price-prediction/",
    "description": "BSV Price Prediction 2023-2032 Great things await those who accept challenges. For one, the Bitcoin Satoshi Vision network is giving a challenge to students. In the meantime, what&#8217;s the BTC versus BSV furor? On the surface, the most prominent difference between BTC (Bitcoin Core) and BSV (Bitcoin Satoshi Vision) is the&#160;choice of block size. While ... <a title=\"BSV Price Prediction 2023-2032: Will Bitcoin SV Hit $100 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bsv-price-prediction/\" aria-label=\"More on BSV Price Prediction 2023-2032: Will Bitcoin SV Hit $100 Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-04T16:05:19.000Z",
    "title": "Policy proposal for Hong Kong government-issued stablecoin emerges",
    "url": "https://crypto.news/policy-proposal-for-hong-kong-government-issued-stablecoin-emerges/",
    "description": "A policy paper has recently proposed the creation of a government-backed stablecoin, the HKDG, in Hong Kong to potentially compete with well-established digital counterparts, such as USDT and USDC."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-04T16:00:26.000Z",
    "title": "Bitcoin Could Soar To $140,000 In Next Bull Cycle, Crypto Analysis Channel",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-could-soar-in-next-bull-cycle-predicts-crypto/",
    "description": "Renowned crypto analysis channel BitBoy Crypto recently presented a bullish forecast for Bitcoin, projecting a potential surge to $140,000. The leading cryptocurrency, currently enjoying a strong position in the market, could be poised for a significant climb, according to AJ, an analyst from BitBoy Crypto. This forecast comes at a time when Bitcoin continues to captivate institutional investors and attract large funds interested in capitalizing on its sustained growth. Bold Bitcoin Prediction Amid Growing Institutional Interest AJ&#8217;s latest analysis for Bitcoin points to a potential climb to $140,000 in the next bullish cycle. This prediction, particularly ambitious in its scope, follows BlackRock&#8217;s recent filing for a Bitcoin Exchange Traded Fund (ETF). Related Reading: Analyst’s Forecast: Bitcoin (BTC) To Hit $310,000 If This Happens This move sparked a chain reaction with several other large funds submitting their own filings, further underscoring Bitcoin&#8217;s burgeoning influence in the crypto landscape. Additionally, AJ forecasted that Bitcoin is set to consolidate its share of the crypto market in the coming years. This notion stems from two key factors: Bitcoin&#8217;s distinct position as a non-security digital asset, unlike various altcoins, along with its pioneering status in the market that has garnered institutional investor attention. According to AJ, Bitcoin&#8217;s dominance in the crypto market will not wane in the foreseeable future. He, however, did not dismiss the potential for Ethereum (ETH) to possibly surpass Bitcoin in terms of market capitalization in the long term. However, from a tokenomics perspective, Bitcoin stands out significantly from most altcoins. Currently, 92% of Bitcoin&#8217;s maximum supply is in circulation, contrasting sharply with several crypto projects, where only approximately 50% of their max supply ranging from 500 million to 1 trillion tokens is in circulation. BTC Climb And Market Cap Increase Wrapping up his speculation, the BitBoy Crypto analyst surmised that Bitcoin&#8217;s value could increase to somewhere between $100,000 and $140,000 in the next bull market. Moreover, he projected that Bitcoin&#8217;s market capitalization would reach at least $2 trillion, provided his bullish thesis holds true. This BTC prediction is just one out of the many Bitcoin predictions reported in the past weeks. Last week, renowned analyst Willy Woo sets forth a prediction suggesting Bitcoin could potentially scale up to a price of $310,000 under a specific set of circumstances. These conditions included institution players allocating 5% of their Assets Under Management (AUM) into BTC. Related Reading: Nansen Forecast For Bitcoin Bull Run: Regulatory Clarity And Lower Inflation Weeks prior, another crypto analyst Credible Crypto predicted that Bitcoin could reclaim its previous peak of $69,000 based on the assumption of a continuing “parabolic advance” Regardless, BTC currently trades above $31,000 at the time of writing. The asset is up 1.4% in the past 24 hours and has a daily volume of $16.5 billion over the same period. Featured image from Shutterstock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T15:59:26.000Z",
    "title": "Cardano Blockchain Empowers Million Dollar ‘LEVEL UP’ Gaming Conference with NFT Integration",
    "url": "https://www.crypto-news-flash.com/cardano-blockchain-empowers-million-dollar-level-up-gaming-conference-with-nft-integration/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-blockchain-empowers-million-dollar-level-up-gaming-conference-with-nft-integration",
    "description": "The Cardano-based NFTs for the conference were made possible by LEVEL UP and ADAQuest protocol. The Cardano NFT ecosystem has significantly grown with marketplaces and projects working together for enhanced liquidity. The Cardano (ADA) blockchain, a scalable smart contract ecosystem with more than $165.1 million in total value locked (TVL), has undeniably shaped the mainstream [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-04T15:58:00.000Z",
    "title": "FTX Relaunch Likelihood Is Low, Expert Argues Using Past Cases",
    "url": "https://coinedition.com/ftx-relaunch-likelihood-is-low-expert-argues-using-past-cases/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX Relaunch Likelihood\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/FTX-Relaunch-Likelihood-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In an exclusive interview, Thomas Braziel, Founder of 507 Capital, weighed in on the news of FTX considering relaunching its operations, noting that FTX is actively exploring the idea, with investment bankers accepting offers for the debtor. While Braziel cautiously refrained from providing definitive odds on the likelihood of a relaunch, he suggested that the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ftx-relaunch-likelihood-is-low-expert-argues-using-past-cases/\">FTX Relaunch Likelihood Is Low, Expert Argues Using Past Cases</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]