[
  {
    "source": "CoinDesk",
    "date": "2023-07-14T10:48:19.000Z",
    "title": "Bitcoin's Crypto Market Dominance Slides by Most in 13 Months as XRP Court Ruling Spurs 'Alt Season' Talk",
    "url": "https://www.coindesk.com/markets/2023/07/14/bitcoins-crypto-market-dominance-slides-by-most-in-13-months-as-xrp-court-ruling-spurs-alt-season-talk/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin's share of the crypto market tanked on Thursday while altcoins rallied after a U.S. court threw a spanner in the SEC's plans to regulate digital assets."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-14T10:47:21.000Z",
    "title": "Kraken, Crypto.com Join Coinbase in Relisting XRP After Court Ruling",
    "url": "https://decrypt.co/148562/kraken-crypto-com-join-coinbase-relisting-after-court-ruling",
    "description": "Though the judge’s decision didn’t relate to secondary sales, exchanges are signaling greater confidence in trading XRP."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T11:01:47.000Z",
    "title": "XRP tops Bitcoin on Upbit with $2.6B in trading volume in 24 hours ",
    "url": "https://cointelegraph.com/news/xrp-tops-bitcoin-on-upbit-with-2-6b-in-trading-volume-in-24-hours",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/8f0b08d5-3199-4a10-83e7-8e9b4ef17c19.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Following a favorable partial verdict in the long-drawn SEC court battle, the XRP token surged over 90% on July 13 reaching a new yearly high of $0.90.</p>\n                    <p><p>The trading volume of XRP tokens on the South Korean crypto exchange Upbit has surpassed that of Bitcoin (BTC) in the past 24 hours. The XRP/KRW trading pair saw $2.6 billion in trading volume in the last 24 hours owing to Ripple’s partial win against the United States Securities and Exchange (SEC) Commission in its long-drawn court battle.</p><p>The buying frenzy for XRP saw the token account for 46% of all trading volume on Upbit followed by Bitcoin with just 5% of the total share. XRP token led the bullish momentum in the crypto market in the past 24 hours helping several other altcoins to rise in double digits.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5e9cb3af-aa77-4efa-ac86-ae5bd2e2871b.png\"  /><figcaption style=\"text-align: center;\"><em>24 hour trading volume on UpBit, Source: Coingecko</em></figcaption></figure><p>The buying frenzy for the token was not limited to South Korea. The XRP price saw an 92% surge on July 13, reaching a new one-year high of $0.91. This surge <a href=\"https://cointelegraph.com/news/ripple-xrp-price-market-cap-jumps-sec-ruling\">helped XRP to climb to fourth place in the market cap ranking</a> from seventh position. Within hours of the court ruling, the XRP token’s market cap soared by as much as $21.2 billion to reach a new yearly high of $46.1 billion.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/why-is-xrp-price-up-today\"><strong><em>Why is XRP price up today?</em></strong></a></p><p><a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">On July 13, Judge Torres gave a summary judgment in favor of Ripple Labs</a>, ruling that the <a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a> token is not a security. However, the ruling refers to the token’s sales on digital asset exchanges. The judgment was greeted with relief by the XRP community as the SEC lawsuit filed in 2020 forced several crypto exchanges in the U.S. to delist the XRP token. The likes of <a href=\"https://cointelegraph.com/news/us-crypto-exchanges-second-chance-xrp-listings-after-court-ruling\">Coinbase, Kraken, OKX and Gemini have already announced relisting plans</a>. </p><p>The crypto community celebrated the win, with <a href=\"https://cointelegraph.com/news/xrp-holders-celebrate-ripple-win-victory-sec-case\">many describing it as a watershed moment</a>, while others cautioned that it was only a partial victory so far. Stephen Palley, a lawyer, noted that the summary judgment is only partial and that the ruling by Judge Torres may not set a precedent. He also reminded the crypto community that the SEC may very well appeal against the judgment.</p><p><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/ripple-xrp-price-market-cap-jumps-sec-ruling&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a> to preserve this moment in history and show your support for independent journalism in the crypto space.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\"><strong><em>How smart people invest in dumb memecoins — 3-point plan for success</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-14T11:02:48.000Z",
    "title": "Chancer Presale Rockets Past $750k Milestone in Under 4 Weeks",
    "url": "https://cryptodaily.co.uk/2023/07/chancer-presale-rockets-past-750k-milestone-in-under-4-weeks",
    "description": "<p>London, United Kingdom, July 14th, 2023, Chainwire</p><p>Chancer, a revolutionary blockchain-based predictive markets app that&rsquo;s taking the crypto and betting world by storm, has raised a whopping $750,000 in just 4 short weeks during its exciting presale. Stage 1 is now set to imminently sell out, with under 23% of tokens left before the price increases by 10%.</p><p>The rise is driven by the unique premise of the platform, which offers completely decentralized betting, allowing users to &lsquo;become the house&rsquo; and create their own odds. As well as the presence of the two founders, Adam and Paul Kelbie, who are fast becoming favorites in the blockchain community.</p>Adam Kelbie, CEO of Chancer, said &ldquo;I am delighted with the engagement we&rsquo;re seeing in the ever-growing Chancer community, as well as the raise - but not completely surprised to be honest! This idea has been years in the making, and this is the year we deliver something huge. We&rsquo;re not only seeing increased investor interest by the day, but a number of potential partner collaborations.&rdquo;<p>Users interested in purchasing Chancer tokens can do so through the official website.&nbsp;</p><p></p><p>Chancer: Driving the decentralized betting revolution</p><p>Chancer is the world&rsquo;s first decentralized and fully democratized blockchain betting platform.&nbsp;</p><p>It puts the power firmly back into the hands of bettors, who are usually victims of unfavorable odds set by a house or bookmaker. These odds are stacked against bettors from the get-go. Additionally, these bookies often allow people to only bet on sports or mainstream events.&nbsp;</p><p>That&rsquo;s where Chancer is different. As a decentralized platform, users place bets among themselves, allowing for a fully peer-to-peer betting experience. Users can wager small bets among friends, or participate in viral bets regarding global events such as the World Cup Final, the Oscars, or even the US presidential elections. Powered by Google&rsquo;s WebRTC, users can take up these bets and communicate with others in real-time whilst live streaming events as they unfold.</p><p>All bets are made and paid out in CHANCER tokens, which gives the coin real utility as it is the lifeblood of the entire platform. As more and more users flock to Chancer, the greater the opportunity to disrupt the betting industry, which was worth more than $63 billion in 2022 and is set to skyrocket to over $150 billion by 2030, CHANCER&rsquo;s price could also benefit from increased adoption and a spreading global reach.</p><p>Chancer is also CertiK audited, which only goes to reinforce the faith in the project, given that the team has been fully KYC&rsquo;d and given the stamp of authenticity many will expect from a development roadmap with such substantial scope.</p><p>Unveiling the Remarkable Success of Chancer's Raise</p><p>With real use cases and a platform that works in favor of those using it, it&rsquo;s easy to see why Chancer has managed to raise $750,000 in such a short period of time. Chancer has an extensive roadmap, detailing its plans from its presale right until it plans on becoming a DAO. Given this exciting trajectory and initial low price, it&rsquo;s no wonder people are investing now to get in on the ground floor with Chancer.</p><p>Not only that, but as of the 12th of July the developers added USDT and ETH purchase options, opening up the presale to millions more potential investors.&nbsp;</p><p>Additionally, there are several perks for CHANCER token holders. Users can stake their tokens and potentially earn passive income in the form of tokens, and even receive discounted fees on bets. All of this, as well as the fact that users can set their own odds, makes it an innovative concept for betting and crypto enthusiasts.</p><p>To further whet appetites and draw in an even bigger crowd, Chancer is currently holding a massive $100,000 giveaway in tokens. Ten lucky winners will be in with a chance to win a chunk of this money, which is Chancer&rsquo;s way of giving back to the community. It doesn&rsquo;t matter how many coins a user has &mdash; so long as he has some CHANCER in his wallet, he's in it to win it.</p><p>Upcoming Developments and Expectations for Chancer</p><p>Chancer is still in its presale, presenting a potentially interesting prospect to those exploring new projects in 2023.</p><p>Chancer's current fundraising objective stands at $15 million. Considering the swift achievement of the initial $750,000, the company anticipates a smooth journey toward reaching its target. Following this, Chancer will launch on several exchanges, which will be announced during the course of the presale.</p><p>Chancer presents a radical, completely unprecedented betting platform that empowers bettors and lets people decide on their own odds. With this in mind, Chancer has a real opportunity to overthrow some of the traditional and archaic betting houses in the market. Don&rsquo;t miss out on this token opportunity, still currently at the low entry price of $0.01.</p><p>About Chancer</p><p>Chancer is set to develop the world&rsquo;s first decentralized social predictive markets platform. This will allow Chancer token holders to create, and participate in their very own predictive markets based on their interests, expertise and social opportunities.</p><p>The project intends to disrupt the global gambling and betting market by &lsquo;removing the house&rsquo; and taking a slice of the market share as it garners attention by challenging the traditional bookmaking and betting business model.</p><p>Users can get involved with Chancer on the official website.</p><p>For more information: Website | Whitepaper | Socials</p>ContactAdam KelbieChancerpress@chancer.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T11:04:46.000Z",
    "title": "Chancer Presale Rockets Past $750k Milestone in Under 4 Weeks",
    "url": "https://www.cryptopolitan.com/chancer-presale-rockets-past-750k-milestone-in-under-4-weeks/",
    "description": "London, United Kingdom, July 14th, 2023, Chainwire Chancer, a revolutionary blockchain-based predictive markets app that’s taking the crypto and betting world by storm, has raised a whopping $750,000 in just 4 short weeks during its exciting presale. Stage 1 is now set to imminently sell out, with under 23% of tokens left before the price ... <a title=\"Chancer Presale Rockets Past $750k Milestone in Under 4 Weeks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chancer-presale-rockets-past-750k-milestone-in-under-4-weeks/\" aria-label=\"More on Chancer Presale Rockets Past $750k Milestone in Under 4 Weeks\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-14T11:00:42.000Z",
    "title": "Stellar (XLM) Basks In XRP Euphoria, Soars 52% In One Day",
    "url": "https://www.newsbtc.com/news/stellar/stellar-xlm-basks-in-xrp-euphoria-soars-52-in-one-day/",
    "description": "The price of Stellar (XLM) has experienced a similar meteoric rise to the XRP token in the last 24 hours. This rise was triggered by news that Ripple, the company behind XRP, had won its long-running case against the US Securities and Exchange Commission SEC. The SEC&#8217;s case that XRP is a security was the focus of the court trial. To the delight of the crypto community, Judge Annalisa Torres of the US District Court for the Southern District of New York ruled in Ripple&#8217;s favor, declaring the XRP token not to be a security. Stellar Looks To Enter The Top 20 Crypto Ranking The altcoin market had been dominated by bearish pressure in recent weeks due partly to the SEC’s declaration of tokens tied to Solana, Polygon, and Cardano as securities. This declaration formed the foundation of the regulator’s case against prominent crypto exchanges Coinbase and Binance. Related Reading: Optimism (OP) Rides The Wave Of Today’s Crypto Surge With 15% Rally That said, the market was jolted back to life yesterday following the announcement of Ripple’s court victory, with most tokens basking in green. Stellar also reacted swiftly to positive market sentiment, going on an almost 90% price rally within a few hours. The token&#8217;s price has since steadied, with Stellar currently trading with a 52.4 % gain. With this, XLM’s price rise places it amongst the top daily gainers in the cryptocurrency market today. As of this writing, XLM is valued at $0.147189, with a 3.9% price decrease in the past hour. The token has a 24-hour trading volume of over $1.26 billion, representing a 3,386% surge in the past day. According to CoinGecko data, the Stellar token is closing in on a spot in the top 20 largest cryptocurrencies, with a market cap of nearly $4 billion. Is $0.8 Within Reach For XLM? A look at the broader market shows that XLM has been underwhelming in recent days. Although the token scored some significant gains last month, it appears to have also been affected by the dour market conditions in July. Following the positive price movement of yesterday, investors are hoping to see the XLM price visit the $0.8 again. However, after hitting its all-time high of $0.875563 in 2018, the coin has only ever reached the $0.8 level once. Related Reading: XRP Price Retreats After Massive 80% Rally, Buy The Dips? On the weekly chart, the XLM token must overcome resistance at $0.2 and $ 0.4 price levels. So, it would take extraordinary bullish pressure for Stellar to reach $0.8 again.  XLMUSD trading at $0.146982 &#124; Source: chart from TradingView That said, the Relative Strength Index (RSI), an indicator that tracks the balance between the buying pressure and selling pressure of a token, suggests that the current bullish momentum might be waning. The daily RSI has crossed above the 70-mark, which represents the overbought zone. This indicates that the buying pressure is at its peak, and a reversal might be on the horizon. Featured image from Shutterstock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T11:00:51.000Z",
    "title": "Only 11 of 180 ETH Of ICO Token Supply Remain in Golden Inu Presale",
    "url": "https://www.crypto-news-flash.com/only-11-of-180-eth-of-ico-token-supply-remain-in-golden-inu-presale-2/?utm_source=rss&utm_medium=rss&utm_campaign=only-11-of-180-eth-of-ico-token-supply-remain-in-golden-inu-presale-2",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T131650.881.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T131650.881.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T131650.881-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Time is running out for crypto enthusiasts looking to secure their allocation in Golden Inu&#8217;s presale, as only 5ETH remains on the presale page.  With an already successful presale, Golden Inu is set to make waves in the memecoin market, offering investors a promising opportunity to capitalize on the token&#8217;s upcoming listing on Uniswap. Presale [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T11:00:05.000Z",
    "title": "Chancer Presale Rockets Past $750k Milestone in Under 4 Weeks",
    "url": "https://www.crypto-news-flash.com/chancer-presale-rockets-past-750k-milestone-in-under-4-weeks/?utm_source=rss&utm_medium=rss&utm_campaign=chancer-presale-rockets-past-750k-milestone-in-under-4-weeks",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/gold-challenge-comp_1389_1_1689266826EHWe0lKJZK.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/gold-challenge-comp_1389_1_1689266826EHWe0lKJZK.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/gold-challenge-comp_1389_1_1689266826EHWe0lKJZK-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/gold-challenge-comp_1389_1_1689266826EHWe0lKJZK-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/gold-challenge-comp_1389_1_1689266826EHWe0lKJZK-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />London, United Kingdom, July 14th, 2023, Chainwire Chancer, a revolutionary blockchain-based predictive markets app that’s taking the crypto and betting world by storm, has raised a whopping $750,000 in just 4 short weeks during its exciting presale. Stage 1 is now set to imminently sell out, with under 23% of tokens left before the price [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-14T11:03:34.000Z",
    "title": "How Does Ripple’s Victory Can Affect the Crypto Industry?",
    "url": "https://www.altcoinbuzz.io/spotlight/how-does-ripples-victory-can-affect-the-crypto-industry/",
    "description": "<p>A US federal court ruled on Thursday that the sale of Ripple’s XRP tokens on public exchanges complied with securities law. The SEC has for several years argued that most cryptocurrencies qualify as securities and should face similar regulations as stocks, bonds, etc. However, Thursday’s ruling boosted investor confidence in Ripple’s XRP, which saw it [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/spotlight/how-does-ripples-victory-can-affect-the-crypto-industry/\">How Does Ripple’s Victory Can Affect the Crypto Industry?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]