[
  {
    "source": "CoinDesk",
    "date": "2024-03-04T20:55:26.000Z",
    "title": "Bitcoin Tops $67K, Nearing Silver's $1.38T Market Cap",
    "url": "https://www.coindesk.com/markets/2024/03/04/bitcoin-tops-67k-nearing-silvers-138t-market-cap/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin's price targets $70,000 in the short term and could reach a new all-time high as soon as this week, analysts said."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-04T20:55:55.000Z",
    "title": "What Is the Bitcoin Halving? How Bitcoin's Supply Is Limited",
    "url": "https://decrypt.co/resources/what-is-the-bitcoin-halving",
    "description": "Every four years, the amount of Bitcoin awarded to miners is halved, an event known as the Bitcoin halving."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-04T20:42:34.000Z",
    "title": "Wormhole Airdrop on Ethereum and Solana Could Be Worth Almost $3 Billion",
    "url": "https://decrypt.co/220124/wormhole-ethereum-solana-airdrop-w-token-3-billion",
    "description": "In early trading, Wormhole’s W token has five times the value that it held last month."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-04T21:00:00.000Z",
    "title": " Ethereum network is valued fairly, but ETH could still see 17x return — Brian Russ ",
    "url": "https://cointelegraph.com/news/ethereum-network-is-valued-fairly-but-eth-could-still-see-17x-return-brian-russ",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOTFiNTFkNGItNTU1NS00ZGM5LWFkOGEtNDIwOWJhMTExMmE4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Using a unique quantitative approach, ETHDenver speaker Brian Russ told attendees that ETH is fairly valued but could produce a 17x return by 2033. </p>\n                    <p><p>Ethereum (<a href=\"https://cointelegraph.com/bitcoin-price\">ETH</a>) price has increased by 128% over the past 12 months and has gained 804,027% since <a href=\"https://www.coingecko.com/en/coins/ethereum\" target=\"_blank\" rel=\"noopener nofollow\">opening for trading</a> at $0.43 on Oct. 20, 2015. Despite this phenomenal growth, is there room for Ether price to rally 17x from its current trading price? </p><p><a href=\"https://www.ethdenver.com/talent/brian-russ-485c9\" target=\"_blank\" rel=\"noopener nofollow\">Brian Russ</a>, the managing director of BMO Financial Group at the Colorado market, thinks it is a possibility. </p><p>On March 1, at ETHDenver, Russ <a href=\"https://youtu.be/d2CKehU1l7M?si=8hnNhzc2rOvJpS6W\" target=\"_blank\" rel=\"noopener nofollow\">spoke</a> about how traditional finance analysts use various quantitative models to value a company, a blockchain and its token. </p><p><a href=\"https://cointelegraph.com/news/ethereum-network-is-valued-fairly-but-eth-could-still-see-17x-return-brian-russ\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-04T21:00:41.000Z",
    "title": "BlackRock’s spot Bitcoin ETF surpasses $10B in AUM, faster than any other to date",
    "url": "https://cryptoslate.com/blackrocks-spot-bitcoin-etf-surpasses-10b-in-aum-faster-than-any-other-to-date/",
    "description": "<p>BlackRock&#8217;s iShares Bitcoin Trust (IBIT) now has more than $10 billion in assets under management (AUM), according to data from CoinGlass. Bloomberg ETF analyst Eric Balchunas noted that IBIT is one of just 152 exchange-traded funds (ETFs) that have reached the $10 billion mark. Currently, roughly 3,400 ETFs exist in total. He observed that IBIT [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/blackrocks-spot-bitcoin-etf-surpasses-10b-in-aum-faster-than-any-other-to-date/\">BlackRock’s spot Bitcoin ETF surpasses $10B in AUM, faster than any other to date</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-04T20:51:10.000Z",
    "title": "Coinbase’s technical issues resurface as Bitcoin soars to $67,000",
    "url": "https://cryptobriefing.com/coinbases-technical-issues-bitcoin-soars-67000/",
    "description": "Coinbase faces technical issues again as Bitcoin hits $67,000."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T21:01:46.000Z",
    "title": "Aptos Price Prediction for 2024 – 2033: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2024-2033 As we venture into 2024 to 2033, the period is critical for Aptos as it strives to establish itself as a significant blockchain platform. The rapidly changing market dynamics, technological advancements, and evolving adoption trends will undoubtedly shape Aptos’s path. Against this backdrop, investors and stakeholders are keen to gain insights [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T21:01:00.000Z",
    "title": "Binance Coin Price Prediction 2024-2033: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2024-2033 After notable changes in its executive team, Binance has shown notable resilience and prospects for recovery. The departure of Changpeng Zhao, Binance&#8217;s CEO, who was also embroiled in legal challenges, initially caused a decline in the value of Binance Coin (BNB). Despite this initial setback, the cryptocurrency has shown a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T20:48:22.000Z",
    "title": "Jupiter DAO set to launch, revolutionizing governance in DeFi",
    "url": "https://www.cryptopolitan.com/jupiter-dao-set-to-launch/",
    "description": "The much-anticipated launch of the Jupiter Decentralized Autonomous Organization (DAO) is slated to revolutionize governance within the decentralized finance (DeFi) space. With its inception imminent, here are the essential details you need to know about this groundbreaking initiative. Test vote and launchpad schedule The inaugural phase kicks off with a test vote scheduled for Tuesday [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-04T21:00:47.000Z",
    "title": "Uniswap Founder: Dapps Will Soon Handle Gas Fees On Behalf Of Clients",
    "url": "https://www.newsbtc.com/news/uniswap/uniswap-dapps-handle-gas-fees-on-behalf-clients/",
    "description": "In comments likely to resonate with crypto fans, Hayden Adams, the founder of Uniswap, a leading decentralized exchange (DEX), predicts that network fees will eventually become a background expense for users, much like server costs are today for top centralized applications running on Amazon Web Service and other platforms.   Gas Fees Is A Major Pain Point, Mass Migration To Solana, Layer-2 Platforms Taking to X, Adams envisioned a future where decentralized applications (dapps) seamlessly cover network fees on behalf of users. This approach, the inventor adds, aligns with how server costs are currently handled in the current setup, especially among operators of common applications like X or Facebook. Server costs are often considered a hidden expense in the overall business model. However, this can cost millions of dollars monthly, depending on the app&#8217;s popularity. Related Reading: Shiba Inu Blasts Into Top 10 Crypto Following 175% Price Surge Presently, the dream of low-fee transactions remains out of reach for some blockchains, particularly Ethereum, the dominant platform for smart contracts. Ethereum is a legacy blockchain that recently shifted from a proof-of-work to proof-of-stake consensus. However, while this was a major shift, the network still struggles with scaling challenges. At optimum, Ethereum can only process 15 transactions every second. Comparing this with current demand only means &#8220;gas fees&#8221; must be high to incentivize the validator to include transactions in the next block. This high &#8220;gas fee&#8221; continues to be a major pain point, leading some projects to migrate to alternative networks with faster transaction speeds and lower fees. Solana, a high-throughput blockchain, and layer-2 scaling solutions like Arbitrum have emerged as popular destinations for these migrating projects. This trend is particularly evident with the recent surge of meme coins like BONK and WIF, which have seen significant growth on Solana. Related Reading: Bitcoin Crossroads: Analyst Identifies Level Set To Determine Next Move Unlike Ethereum, Solana and layer-2 platforms relying on Ethereum for security boast higher throughput and negligible gas fees. Accordingly, more meme coin projects are launching on these networks. Here, users can transact without considering the implication of gas fees. In recent weeks, top meme coins, besides PepeCoin (PEPE) or Dogecoin (DOGE), have been launching on Solana. Ethereum Is Working On Scaling Ethereum will implement the Dencun Upgrade in mid-March to combat its scaling woes. The update aims to reduce costs for users interacting with layer-2 solutions significantly. However, this upgrade is just one of the many Ethereum developers plan to implement over time. Eventually, the proof-of-stake network aims to scale processing speeds, allowing it to execute millions of transactions every second through innovations like Sharding.  Uniswap continues to lead in popularity, looking at assets under management. So far, Uniswap developers have deployed its solution across other blockchains and layer-2 options, including Arbitrum and the BNB Chain. Feature image from Shutterstock, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-04T21:00:33.000Z",
    "title": "Top Crypto Strategist Says Bitcoin in Midst of Monster Rally, Unveils Bull Market Target for BTC",
    "url": "https://dailyhodl.com/2024/03/04/top-crypto-strategist-says-bitcoin-in-midst-of-monster-rally-unveils-bull-market-target-for-btc/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/btc-One-Possible-Outcome.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/btc-One-Possible-Outcome.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/btc-One-Possible-Outcome.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/btc-One-Possible-Outcome.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/btc-One-Possible-Outcome.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/btc-One-Possible-Outcome.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/btc-One-Possible-Outcome.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto analyst who accurately called the bottom of the 2018 Bitcoin bear market believes BTC has more room to run to the upside before topping out. In a new video, pseudonymous analyst Bluntz tells his 243,100 followers on the social media platform X that Bitcoin appears to be in the midst of a wave [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/04/top-crypto-strategist-says-bitcoin-in-midst-of-monster-rally-unveils-bull-market-target-for-btc/\">Top Crypto Strategist Says Bitcoin in Midst of Monster Rally, Unveils Bull Market Target for BTC</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-04T20:55:02.000Z",
    "title": "Willy Woo Says Bitcoin To Break $125,000 Minimum Before End of 2025 As ‘Full Demand Unleashed’ – Here’s What He Means",
    "url": "https://dailyhodl.com/2024/03/04/willy-woo-says-bitcoin-to-break-125000-minimum-before-end-of-2025-as-full-demand-unleashed-heres-what-he-means/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/predicts-massive-rally-targets.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/predicts-massive-rally-targets.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/predicts-massive-rally-targets.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/predicts-massive-rally-targets.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/predicts-massive-rally-targets.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/predicts-massive-rally-targets.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/predicts-massive-rally-targets.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>On-chain analyst Willy Woo says Bitcoin could hit the $125,000 mark at a &#8220;minimum&#8221; this year if financial giants BlackRock and Fidelity allocate relatively conservative amounts of capital. Woo tells his 1 million followers on the social media platform X that if clients of the two firms decide to rotate 3% of assets to Bitcoin, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/04/willy-woo-says-bitcoin-to-break-125000-minimum-before-end-of-2025-as-full-demand-unleashed-heres-what-he-means/\">Willy Woo Says Bitcoin To Break $125,000 Minimum Before End of 2025 As ‘Full Demand Unleashed’ – Here’s What He Means</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]