[
  {
    "source": "CoinDesk",
    "date": "2023-06-27T15:44:50.000Z",
    "title": "Bitcoin Briefly Pushes Above $31K After Fidelity Spot ETF Report",
    "url": "https://www.coindesk.com/markets/2023/06/27/bitcoin-briefly-pushes-above-31k-after-fidelity-spot-etf-report/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Fidelity previously applied for a spot bitcoin ETF in 2021, but the effort was rejected by the SEC."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-27T15:42:53.000Z",
    "title": "Bitfinex Launches Peer-to-Peer Trading Platform in Argentina, Colombia and Venezuela",
    "url": "https://www.coindesk.com/business/2023/06/27/bitfinex-launches-peer-to-peer-trading-platform-in-argentina-colombia-and-venezuela/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Users will be able to buy and sell bitcoin, ether, USDT, EURT and XAUT."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-27T15:46:27.000Z",
    "title": "Gary Gensler is hurting the little guys for Wall Street",
    "url": "https://cointelegraph.com/news/gary-gensler-hurting-little-guys-for-wall-street",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/610ec570-ea72-4699-b558-fa99dda7f633.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Securities and Exchange Commission Chair Gary Gensler is working to protect someone, but it’s not American investors.</p>\n                    <p><p>Even the most stalwart crypto supporters could see why the Securities and Exchange Commission might target the crypto industry for <em>some</em> enforcement. Events of the past year — from the failure of <a href=\"https://cointelegraph.com/news/3ac-liquidators-file-motion-hold-kyle-davies-in-contempt\">Three Arrows Capital</a> to the <a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-two-criminal-trials\">fraud at FTX</a> — were bound to bring some scrutiny, and the industry has always been too hospitable to blatant hucksters. </p><p>But the recent spate of enforcement actions by the SEC and U.S. agencies do not meet the standard of protection. Instead, a close review of everything from the banking crackdown earlier this year to the endless regulation by enforcement strikes a different chord. It seems as if the U.S. government is taking action to protect the financial services industry from disruption.</p><p>Exhibit A of this phenomenon is the SEC’s mammoth suit against Coinbase — a company long perceived to be one of the “good guys” in crypto. Its client list includes large asset managers, Fortune 100 companies and the U.S. government itself, none of which have ever complained about the integrity of its services. Unlike FTX, Coinbase has never defrauded its customers. It didn’t base itself in an offshore tax haven and has never been hacked. In fact, the company has repeatedly stated its intent to be regulated and has gone as far as <a href=\"https://cointelegraph.com/news/coinbase-files-court-action-to-compel-sec-s-response-to-rulemaking-petition\">suing the SEC</a> to force it to provide a roadmap on how.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-wrong-to-target-gary-gensler\"><strong><em>Crypto enthusiasts are wrong to target Gary Gensler</em></strong></a></p><p>Its reward? A 100-page suit full of contradictions, like some layer-1 tokens being securities and others not. Imagine a town that refuses to tell you what the speed limit is but frequently gives speeding tickets. Nobody would take such a place seriously. We still don’t know whether Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) is a security, despite SEC Chair Gary Gensler telling us repeatedly that his agency has all the authority it needs to make that call. </p><p>New technologies often clash with old rules, and regulatory agencies can initially struggle to understand startups because they don’t understand the tech. Gensler doesn’t have that excuse. He was a visiting instructor at MIT’s Digital Currency Initiative and taught a generally respected class on blockchain. How, then, did he go from that level of knowledge and belief to arguing on CNBC that we don’t need crypto? </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/VKxXdUvMqAc\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Gensler is protecting <em>someone</em>, but it’s certainly not the American investors who will eventually not have any service providers left. Nor is it the crypto companies that are relocating to friendlier jurisdictions. It’s the Wall Street incumbents that crypto threatens. It’s hard to review the increasingly erratic regulatory approach and draw any other conclusion. To wit:</p><ul><li>America is one of the few major countries without a Bitcoin exchange-traded fund (EFT). Several companies have tried to issue one, but the SEC has refused to approve any, arguing crypto markets are unregulated. This is an odd defense because the agency has already approved futures-backed ETFs that buy derivatives tied to those markets, products that are guaranteed to underperform due to their added frictions. But they do keep incumbents like the Chicago Mercantile Exchange and its related brokers relevant.</li><li>The SEC has designated stablecoins as securities, a ruling that kills their utility as payment products. Stablecoins should not be controversial. They use a familiar model, expand the dollar’s reach, and create additional demand for Treasurys. The only entities they are bad for are the legacy banks and centralized payment providers that dominate that industry.</li><li>The agency has argued that public companies that custody crypto for others should treat them as on-balance sheet liabilities and set aside added reserves. This approach — which does not apply to other assets — makes offering crypto custody cost-prohibitive for all but the biggest custodians.</li><li>Crypto offers novel ways for startups and decentralized projects to raise money from would-be customers and users, reducing funding costs and expanding financial inclusion. But the SEC has repeatedly insisted on expensive registration regimes that force crypto back into the investment bank-led fundraising system.</li><li>Trying to cram digital assets into existing regulatory frameworks designed for stocks and bonds limits their utility but is a boon to Wall Street incumbents who already have the requisite licenses — licenses that have been practically impossible for startups to get. The only exception? The highly dubious Prometheum Capital, whose acquisition of a useless license proves this point.</li><li>Recent rulings on which kind of service providers can be considered “qualified custodians” seem designed to deprive state financial authorities of their ability to charter smaller players who tend to be crypto natives.</li><li>After filing a civil suit against Binance, the largest global crypto exchange, the SEC tried the added step of requesting the government freeze all assets on its domestic entity, effectively putting it out of business.</li><li>The Coinbase suit argues that offering software to people who want to store their own crypto assets should be limited to registered broker-dealers. If held up, this rule would effectively kill crypto’s killer app of self-custody, forcing all investors back into the arms of intermediaries.</li></ul><p>Enacting strict rules can create powerful moats for incumbents — the dirty secret of every highly regulated industry. Large companies might complain in public about the cost of compliance but secretly appreciate the competitive advantage of being on the other side of the regulatory divide. It’s one reason that highly regulated industries such as finance or healthcare seldom see turnover at the top.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-fans-should-get-behind-elon-musk-s-subscription-model-for-twitter\"><strong><em>Crypto fans should get behind Elon Musk’s subscription model for Twitter</em></strong></a></p><p>Protecting the status quo is also the only plausible explanation for why the SEC is against Congress clearing things up via legislation. Gensler repeatedly says securities laws passed in the 1930s and the Howey test — a Supreme Court decision handed down before the invention of the transistor — provide all the clarity his agency needs to regulate crypto. The rest of the world is not taking this approach, perhaps because their legacy service providers are not as prominent as America’s.</p><p>Tellingly, some regulators inside the U.S. disagree with this approach, including other SEC commissioners. </p><p>Five years ago, at a speech given at an MIT blockchain event, Gensler <a href=\"https://www.media.mit.edu/posts/remarks-at-blockchain-event/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> “blockchain technology” had “real potential to transform the world of finance.” He added, “It could lower costs, risks, and economic rents in the financial system.”</p><p>The technology hasn’t changed in that time, but Gensler has. It’s only fair to ask whose interests he is protecting. </p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Omid Malekan</strong> is an adjunct professor at Columbia Business School and the author of <em>Re-Architecting Trust: The Curse of History and the Crypto Cure for Money, Markets, and Platforms</em>.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph. </em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-27T15:45:00.000Z",
    "title": "3AC liquidators look to recoup $1.3B from founders",
    "url": "https://cointelegraph.com/news/three-arrows-liquidators-recoup-losses-from-founders",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/aa682948-6db7-44bf-a8fe-21e3a2cea345.jpeg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The report came exactly one year since a court in the British Virgin Islands ordered Three Arrows Capital into liquidation.</p>\n                    <p><p>Teneo, the liquidators behind bankrupt hedge fund Three Arrows Capital (3AC), are reportedly seeking to recover roughly $1.3 billion in funds from founders Su Zhu and Kyle Davies.</p><p>According to a June 27 Bloomberg report, the liquidators <a href=\"https://news.bloomberglaw.com/securities-law/three-arrows-liquidators-seek-1-3-billion-from-funds-founders\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> Davies and Zhu incurred the $1.3 billion in debt when 3AC was already insolvent, adding to creditors’ losses. 3AC reportedly owed creditors $3.5 billion, making the founders’ potential liability more than a third of the total debt. </p><p>A Teneo spokesperson told Cointelegraph that the goal of seeking $1.3 billion from the 3AC founders was “generally reflective” of a June 27 creditor presentation. At the time of publication, court documents did not appear to include this information.</p><p>The report came exactly one year since a court in the British Virgin Islands ordered 3AC into liquidation on June 27, 2022. In July 2022, the firm also made a Chapter 15 filing in U.S. Bankruptcy Court in the Southern District of New York.</p><p>Though Davies and Zhu have remained active on social media through the liquidation process, their physical whereabouts have been largely unknown. In June, the pair <a href=\"https://cointelegraph.com/news/former-three-arrows-capital-founders-launch-new-vc-fund\">helped launch the Open Exchange</a>, a platform for trading claims against bankrupt crypto entities.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">3AC is dead, long live 3AC Ventures <a href=\"https://t.co/61s8uQquOZ\">https://t.co/61s8uQquOZ</a></p>&mdash; Kyle Davies  (@KyleLDavies) <a href=\"https://twitter.com/KyleLDavies/status/1671505640848515072?ref_src=twsrc%5Etfw\">June 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/3ac-a-10b-hedge-fund-gone-bust-with-founders-on-the-run\"><strong><em>3AC: A $10B hedge fund gone bust with founders on the run</em></strong></a></p><p>Lawyers for the liquidators in the U.S. have also attempted to make Davies and Zhu answer in court during the bankruptcy proceedings. Both 3AC founders have been issued digital subpoenas, and the legal team sought to <a href=\"https://cointelegraph.com/news/3ac-liquidators-file-motion-hold-kyle-davies-in-contempt\">hold Davies in contempt</a> of court for having “repeatedly defied their obligations”. </p><p>Among the 3AC founders’ former assets <a href=\"https://cointelegraph.com/news/sotheby-s-will-auction-off-part-of-3ac-s-digital-art-collection\">included a digital art collection</a> being auctioned off through Sotheby’s. Pieces that were a part of the collection like Dmitri Cherniak’s artwork ‘The Goose’ <a href=\"https://cointelegraph.com/news/sotheby-auctions-the-goose-nft-3ac-collection\">sold for $6.2 million</a> in June.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/huobi-lawsuit-hodlnaut-opnx-3ac-asia-express/\"><strong><em>Huobi sues … Huobi? 3AC rises from ashes, Korea crypto contagion: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-27T16:00:16.000Z",
    "title": "Bitcoin’s exchange balance drops to 5-year low as price hits $30K",
    "url": "https://cryptoslate.com/btc-exchange-supply-drops-to-5-year-low/",
    "description": "<p>Since June 22, Bitcoin has been trading above the critical psychological level of $30,000. This price rally is a result of increased demand for the digital asset, a demand that is further exacerbated by the low availability of Bitcoin on exchanges. One key metric that underscores this trend is the percentage of Bitcoin&#8217;s supply held [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/btc-exchange-supply-drops-to-5-year-low/\">Bitcoin&#8217;s exchange balance drops to 5-year low as price hits $30K</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-27T15:59:47.000Z",
    "title": "First leveraged Bitcoin futures ETF opens for trading on CBOE",
    "url": "https://cryptoslate.com/first-leveraged-bitcoin-futures-etf-opens-for-trading-on-cboe/",
    "description": "<p>The Volatility Shares 2x Bitcoin Strategy ETF (BITX) opened for trading on the Chicago Board Options Exchange (CBOE) on June 27. Chang Kim, COO at Volatility Shares, said: &#8220;There’s a big audience that’s already out there for leveraged-type products, and to sort of marry that with the intrinsic interest that there is in all things [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/first-leveraged-bitcoin-futures-etf-opens-for-trading-on-cboe/\">First leveraged Bitcoin futures ETF opens for trading on CBOE</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-27T16:00:00.000Z",
    "title": "Chibi Finance Executes $1M Rug Pull",
    "url": "https://cryptodaily.co.uk/2023/06/chibi-finance-executes-1m-rug-pull",
    "description": "<p>Chibi Finance, an Arbitrum-based yield farming optimizer, reportedly conducted a major exit scam earlier today.</p>\n<p class=\"md-end-block md-p\">CertiK, a blockchain security firm, confirmed that the developers behind Chibi Finance had stolen approximately $1 million worth of various tokens, according to their analysis of blockchain data shared to the CryptoDaily Editorial team. This factor led to the price of the CHIBI token to plummet by 98%.</p>\nThe Scam and its Execution\n<p class=\"md-end-block md-p\">Chibi Finance's exit scam unfolded as the developers, having gained control of the platform's smart contracts, proceeded to steal a significant amount of users' funds. The scam was orchestrated using a malicious contract set up by the deployer of Chibi Finance.</p>\n<p class=\"md-end-block md-p\">By establishing this malicious contract as the _gov address, the developers gained the ability to invoke the panic function. This function enabled them to trigger an emergencyWithdraw of funds to the exit scammer's address.</p>\n<p class=\"md-end-block md-p\">Approximately 256,012.95 USDC, 94.67 WETH, 4.25520843 WBTC, 115,049 USDT, and 89,563.95 ARB were siphoned off from the project's contracts. The stolen assets were subsequently swapped for 555 ETH, which were then bridged from the Arbitrum network to the Ethereum network. These funds were ultimately laundered through Tornado Cash, a privacy-focused Ethereum mixing service frequently used to obscure transactional activity.</p>\nAftermath and Indications of Fraud\n<p class=\"md-end-block md-p\">In the immediate aftermath of the scam, the price of the CHIBI token plummeted, registering a staggering 98% drop. Adding to the distressing developments, Chibi Finance also deactivated its Twitter account and took down its official website, thereby leaving no room for doubt about the fraudulent nature of the operation.</p>\n<p class=\"md-end-block md-p\">The exit scam came as a shock to the users of Chibi Finance, which had launched around April 2023 and had promoted itself as a yield-optimizing service on the Arbitrum chain. In addition to auto-compounded yields, Chibi Finance had touted several other features typically associated with yield farming.</p>\n<p class=\"md-end-block md-p\">The platform had undergone its first audit on May 31 and had recently reported $500k in Total Value Locked (TVL), with ambitions to reach $1 million. As recent as June 26, Chibi Finance announced that it had been listed on CoinGecko.</p>\nScams on the Arbitrum Network: A Growing Concern\n<p class=\"md-end-block md-p\">This exit scam is unfortunately not an isolated incident. CertiK reports that over $14 million has been lost to scams on the Arbitrum network across 12 different instances in 2023 alone. The growing number of such fraudulent activities underlines the need for greater vigilance and more stringent security measures in the decentralized finance (DeFi) space.</p>\n<p class=\"md-end-block md-p\">These scams, commonly referred to as \"rug pulls,\" typically involve developers gaining legitimacy on social media, hyping up their projects, and raising substantial amounts of money. Once the project's tokens are offered to the public, the developers abruptly withdraw the liquidity, leaving the token holders high and dry.</p>\n<p class=\"md-end-block md-p md-focus\">This incident serves as a cautionary tale, underscoring the importance of thorough due diligence and careful assessment of risk when investing in DeFi projects, especially those operating on relatively new platforms such as Arbitrum. The security and integrity of smart contracts remain crucial factors to consider, and potential investors are advised to be wary of any red flags that may indicate possible fraudulent intentions.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-27T16:00:29.000Z",
    "title": "Biggest Movers: BCH Hits 1-Year High, as EDX Markets Rally Intensifies",
    "url": "https://news.bitcoin.com/biggest-movers-bch-hits-1-year-high-as-edx-markets-rally-intensifies/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2148745717-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BCH Hits 1-Year High, as EDX Markets Rally Intensifies\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2148745717-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2148745717-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2148745717-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2148745717-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2148745717-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2148745717-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2148745717.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin cash rose to a one-year high on Tuesday, as traders continued to buy the token following last week&#x2019;s EDX markets listing. The newly formed exchange, which is backed by the likes of Citadel, Sequoia Capital and Fidelity, listed the coin in its offering. Litecoin was another token added to the exchange. Bitcoin Cash (BCH) [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T16:06:56.000Z",
    "title": "Why Is the Crypto Market Up Today? BTC hovers around $31K",
    "url": "https://www.cryptopolitan.com/why-is-the-crypto-market-up-today-btc-at-31k/",
    "description": "Crypto markets have begun to show signs of a proper bull run after one of the worst crypto winters in history.&#160; According to reports, Bitcoin has managed another attack on $31,000. This comes as traders hope for further BTC price upside in the coming days. According to CoinGecko, The global crypto market cap today sits ... <a title=\"Why Is the Crypto Market Up Today? BTC hovers around $31K\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-is-the-crypto-market-up-today-btc-at-31k/\" aria-label=\"More on Why Is the Crypto Market Up Today? BTC hovers around $31K\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T15:44:38.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  }
]