[
  {
    "source": "Cointelegraph",
    "date": "2023-10-24T11:32:35.000Z",
    "title": "Largest DeFi protocol on Solana reportedly quits UK market citing FCA rule ",
    "url": "https://cointelegraph.com/news/defi-solana-marinade-uk-regulations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/6f9ee7d4-1c47-4341-aa2e-d837a8e0eede.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Marinade Finance holds a total value of $241 million, which accounts for 70% of all the funds locked on the Solana blockchain. </p>\n                    <p><p>Marinade Finance, the largest decentralized finance (DeFi) protocol running on the Solana blockchain, has reportedly started blocking users from the United Kingdom. U.K. customers discovered the problem on Oct. 23. While trying to access Marinade’s website from a local IP, one encounters the block page with a message:</p><blockquote>“Access to this site is unavailable in the United Kingdom due to compliance concerns relating to rules and regulations promulgated by the U.K. Finance [sic] Conduct Authority. Users may withdraw liquidity, claim delayed tickets, or delay unstake via our SDK.”</blockquote><p>Marinade Finance has around 75,000 users and holds a total value of $241 million, which accounts for 70% of all the funds locked on the Solana blockchain. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/huobi-ku-coin-140-crypto-exchanges-non-authorized-uk-regulator\"><strong><em>Huobi, KuCoin, over 140 crypto exchanges ‘non-authorized’ — UK regulator</em></strong></a></p><p>While the message from Marinade doesn’t specify the rules, the protocol isn’t the first to quit the British market in recent months. On Oct. 16, crypto exchange Binance <a href=\"https://cointelegraph.com/news/binance-halts-new-uk-user-onboarding\">stopped accepting users from the U.K</a>., citing certification issues with its local business partner. PayPal has also <a href=\"https://cointelegraph.com/news/paypal-uk-to-halt-crypto-purchases-until-2024\">halted crypto transactions</a> for its U.K. customers, as did Bybit <a href=\"https://cointelegraph.com/news/huobi-ku-coin-140-crypto-exchanges-non-authorized-uk-regulator#:~:text=suspended%20all%20its%20services\">in late September</a>. </p><p>On Oct. 8, the U.K. Financial Conduct Authority (FCA) introduced the Financial Promotions (FinProm) Regime <a href=\"https://cointelegraph.com/news/binance-uk-partner-restricted-crypto-ads\">for cryptocurrency companies</a> to promote “fair, clean and transparent” advertising in the crypto industry. Some companies, including OKX and MoonPay, have already announced they <a href=\"https://cointelegraph.com/news/binance-okx-comply-crypto-finprom-rules-in-uk\">plan to comply</a> with the FCA rules.</p><p>Cointelegraph contacted Marinade Finance for further information but didn’t get an immediate response. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/6-questions-for-adelle-nazarian-crypto-journalism-bitcoin/\"><strong><em>6 Questions for Adelle Nazarian on crypto, journalism and the future of Bitcoin</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-24T11:38:23.000Z",
    "title": "Aethir and GAM3S.GG Unite to Elevate the Future of Web3 Gaming",
    "url": "https://cryptodaily.co.uk/2023/10/aethir-and-gam3sgg-unite-to-elevate-the-future-of-web3-gaming",
    "description": "Aethir, a pioneer in the field of decentralised cloud infrastructure (DCI), has joined hands with GAM3S.GG, the leading Web3 gaming platform. This collaboration signals the beginning of a shared vision to shape the future of the gaming industry by combining the transformative powers of Web3 gaming with Aethir’s DCI."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-24T11:36:23.000Z",
    "title": "Bitcoin to hit $45k in 2023 as funding rates signal FOMO, Matrixport says",
    "url": "https://crypto.news/bitcoin-to-hit-45k-in-2023-as-funding-rates-signal-fomo-matrixport-says/",
    "description": "Crypto services provider Matrixport insists Bitcoin is still on track to reach $45,000 by the end of the year. Bitcoin (BTC) will keep growing to $45,000 this year as futures funding rates signal bullishness among traders. As crypto services provider&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-24T11:26:59.000Z",
    "title": "Binance’s UK chief resigns amid regulatory pressure",
    "url": "https://crypto.news/binances-uk-chief-resigns-amid-regulatory-pressure/",
    "description": "Jonathan Farnell, the compliance officer of Binance in the UK, has left the company. In a comment to crypto.news, Binance&#8217;s spokesperson confirmed Farnell’s departure. &#8220;We&#8217;d like to thank Jonathan for his contributions and wish him all the best on his&#8230;"
  }
]