[
  {
    "source": "CoinDesk",
    "date": "2024-03-26T07:55:20.000Z",
    "title": "Bitcoin ETFs Snap Outflows Streak, Accumulate $15.4M",
    "url": "https://www.coindesk.com/markets/2024/03/26/bitcoin-etfs-snap-outflows-streak-accumulate-154m/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "One analyst said quarter-end inflows could be stronger than usual."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-26T07:43:27.000Z",
    "title": "tymt™ - A Game Launcher Transforming Gaming Experiences",
    "url": "https://cryptodaily.co.uk/2024/03/tymt-a-game-launcher-transforming-gaming-experiences",
    "description": "tymt™ - A Game Launcher Transforming Gaming Experiences"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-26T07:47:52.000Z",
    "title": "UAE Central Bank launches Digital Dirham strategy for wholesale and retail use",
    "url": "https://www.cryptopolitan.com/uae-central-bank-digital-dirham-strategy/",
    "description": "The Central Bank of the United Arab Emirates (CBUAE) has announced the commencement of the initial phase of its central bank digital currency (CBDC) strategy, marking an important stride towards the adoption of digital currency in the region.&#160; In collaboration with R3 and G42 Cloud, the strategy aims to explore the utility of CBDC for [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-26T07:46:04.000Z",
    "title": "tymt™ – A Game Launcher Transforming Gaming Experiences",
    "url": "https://www.cryptopolitan.com/tymt-a-game-launcher-transforming-gaming-experiences/",
    "description": "Sollefteå, Sweden, December 20th, 2023, Chainwire The Gaming Landscape: An Ongoing Struggle Gaming, an essential part of global culture, connects over a billion people worldwide through entertainment, escape, and social interaction. However, within this vast realm of gaming platforms and titles, a perpetual battle for dominance, revenue, and player engagement persists. Gamers encounter numerous options [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-26T08:05:28.000Z",
    "title": "OFAC sanctions Russian providers of digital financial assets",
    "url": "https://crypto.news/ofac-sanctions-russian-providers-of-digital-financial-assets/",
    "description": "Treasury Department has sanctioned Russian providers of digital financial assets, saying many of the designated entities offered services that helped evade sanctions. The U.S. Department of the Treasury&#8217;s Office of Foreign Assets Control (OFAC) has sanctioned 13 entities and two&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-26T08:08:53.000Z",
    "title": "Triple-Digit Gains: Ondo Finance (ONDO) Explodes 138% — Should You Invest?",
    "url": "https://www.newsbtc.com/news/triple-digit-gains-ondo-finance-ondo-explodes-138-should-you-invest/",
    "description": "Ondo Finance (ONDO), a decentralized finance (DeFi) protocol focused on tokenizing US treasuries, has witnessed a meteoric rise in its native token&#8217;s price over the past week. According to CoinMarketCap, although ONDO was only able to muster a meager 1.3% increase in the last day &#8211; pushing its value to a record-breaking $0.94 &#8211; the impressive feat comes on the heels of a 138% weekly gain, marking an impressive performance for the token. Related Reading: Analyst Bullish On Polkadot (DOT), Predicts $17 Price Target Before April ONDO Marks Banner Week With Big Numbers ONDO doing things right on the weekly chart. Source: Coingecko Analysts attribute this surge to a confluence of factors. Whale investors, known for their significant holdings and market influence, have been accumulating ONDO at a substantial clip. Data from on-chain tracking platform Lookonchain reveals that three whale wallets recently withdrew over 9 million ONDOs, worth around $9 million, from various exchanges. This behavior suggests a long-term bullish outlook on the token&#8217;s potential, potentially inciting a follow-the-leader mentality among retail investors. Whales are accumulating #RWA token $ONDO! Whale&#8221;0x56F9&#8243; withdrew 6.53M $ONDO($5.88M) from #Bybit in the past month. Fresh wallet&#8221;0x92dD&#8221; withdrew 1.98M $ONDO($1.78M) from #Gateio in the past hour. Wallet&#8221;0xE6bf&#8221; withdrew 937,600 $ONDO($845K) from #Gateio 3 hours ago. Address:… pic.twitter.com/o5jWqhresp — Lookonchain (@lookonchain) March 25, 2024 Indeed, Santiment data analyzed by AMBCrypto shows a 30% increase in the total number of ONDO holders since March 19th, surpassing the 10,000 mark. This influx of new investors, likely influenced by the whales&#8217; actions and the overall hype surrounding tokenization, has further fueled the token&#8217;s price rally. Total crypto market cap at $2.5 trillion on the daily chart: TradingView.com The recent surge in ONDO&#8217;s popularity coincides with a broader trend within the DeFi space. Last week, global investment giant BlackRock announced the creation of a tokenized fund on the Ethereum blockchain, allowing investors to earn US dollar yields through a decentralized platform. This move underscores the growing interest in tokenization, which involves representing real-world assets like securities, currencies, and real estate on a blockchain. TVL Not Impressive Despite Weekly Rise However, amidst the celebratory atmosphere surrounding the token&#8217;s price surge, a curious detail emerges. Despite the significant increase in ONDO&#8217;s value, the platform&#8217;s total value locked (TVL), a metric reflecting the total value of crypto assets deposited in its DeFi protocols, has remained relatively stagnant over the past week. While the reasons behind this discrepancy are unclear, it could be a cause for concern for some investors. A stagnant TVL might suggest that the recent price increase isn&#8217;t necessarily translating to increased usage of the Ondo Finance protocol itself. Related Reading: Social Media Storm Gives Dogecoin 14% Price Boost – Details Overall, the past week has been undeniably positive for Ondo Finance. The token&#8217;s impressive price surge, coupled with the current tokenization hype and strategic alignment with BlackRock&#8217;s recent venture, paints a promising picture for the future. However, the stagnant TVL serves as a reminder that long-term sustainability hinges not just on speculation but also on real-world adoption and the continued development of the Ondo Finance ecosystem. Featured image from AlphaTradeZone/Pexels, chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-26T08:05:45.000Z",
    "title": "Bitcoin Price Surges Past $71,000: 4 Key Reasons Behind The Rally",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-surges-past-71000-4-key-reasons/",
    "description": "The Bitcoin price has soared past the $71,000 mark. In the past 24 hours alone, the price of Bitcoin surged by 6.5%, climbing from just below $65,500 to reach $71,491. This remarkable rally can be attributed to a combination of factors that have collectively contributed to the upward trajectory of the world&#8217;s leading cryptocurrency. Here&#8217;s a closer look at the four key reasons behind Bitcoin&#8217;s latest price surge. #1 Futures Market Influence The futures market has played a pivotal role in driving Bitcoin&#8217;s price upwards. According to data from Coinglass, the past 24 hours have seen the liquidation of 64,480 traders, with total crypto liquidations amounting to $184 million. Specifically, for Bitcoin, shorts worth $56.9 million and longs worth $16 million were liquidated. Byzantine General, a crypto analyst, noted the significant increase in open interest, suggesting that leverage has been a major factor propelling Bitcoin&#8217;s price higher. He stated, “I can&#8217;t help but have the feeling that BTC is trading like someone knows something. A billion $ in open interest got added in the past couple hours. It&#8217;s mostly this leverage that pushed us higher I think.” Related Reading: To Infinity And Beyond: Analyst Forecasts Bitcoin To Hit $100,000 In High-Speed Furkan Yildirim, another analyst, cautioned about the sustainability of this rally, pointing out the over $1.7 billion in open interest built up since yesterday as a sign of overleveraged positions. “The whole truth is that over $1.7 billion in open interest has been built up since yesterday. We are increasingly seeing the use of overleveraged positions again,” he remarked, raising questions of the sustainability of the move. #2 Bullish News For Bitcoin The rally was further propelled by a series of optimistic news. Notably, the London Stock Exchange (LSE) announced its plan to introduce a market for Bitcoin (BTC) and Ether (ETH) exchange-traded notes (ETNs) by May 28. This decision opens the door to professional investors in Europe and signifies the growing institutional acceptance. Related Reading: Bitcoin Top In Yet? What The Legendary MVRV Ratio Says Moreover, the news of Peruvian Nilam Resources expressing intent to purchase 24,800 Bitcoins (worth $1.7 billion) &#8220;at a discounted rate relative to current market prices&#8221; through an acquisition strategy involving MindWave, a special purpose entity, has injected a dose of exhilaration and skepticism into the market, given Nilam&#8217;s microcap OTC stock status. #3 Bitcoin ETFs And Coinbase Premium Another critical factor influencing Bitcoin&#8217;s price rally was the dynamics surrounding Bitcoin ETFs and the Coinbase premium. The Coinbase Premium Gap turned positive again yesterday, as observed by CryptoQuant analyst Maartunn, indicating a robust demand for spot Bitcoin ETFs. Guess who&#39;s back? Bitcoin: Coinbase Premium Gap is positive again https://t.co/0C7YyyFe2T pic.twitter.com/b73XbSygbl &#8212; Maartunn (@JA_Maartun) March 25, 2024 Given Coinbase&#8217;s custodianship of approximately 90% of Bitcoin ETF assets, the premium emerges as a pivotal indicator of institutional demand for Bitcoin. This was further evidenced by the positive ETF net inflows yesterday, amounting to $15.4 million after last week saw five consecutive days of net outflows. Grayscale’s GBTC had $350 million in outflows. Meanwhile, Fidelity’s FBTC started picking up last week&#8217;s slack with $261.8 million in inflows. Blackrock had another weak day with only $35 million in inflows. Nonetheless, the Coinbase premium was once again a good indicator. Yesterday&#39;s ETF flows were positive once again after a negative week for $15.4 million.$GBTC had $350 million in outflows. Fidelity started picking up last week&#39;s slack with $261.8 million in inflows.Blackrock only did $35 million. Price moved from $65k to above $70k. A day… pic.twitter.com/HCNwa7L2p8 &#8212; WhalePanda (@WhalePanda) March 26, 2024 #4 Technical Breakout From a technical perspective, Bitcoin&#8217;s price breakout from a descending parallel trend channel on the 4-hour chart marked a crucial turning point. The successful retest of the strong resistance zone (red zone) has confirmed the breakout&#8217;s legitimacy, leading to a more than 7% increase in Bitcoin&#8217;s price. This technical movement has bolstered the confidence of traders and investors alike, contributing to the momentum that has driven the price past the $70,000 threshold. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-26T07:52:23.000Z",
    "title": "Jupiter Exchange’s ASR: Simplifying and Rewarding Participation",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/jupiter-exchanges-asr-simplifying-and-rewarding-participation/",
    "description": "<p>This system is not just a feature; it&#8217;s a leap forward in engaging and rewarding the community. ASR sets a new governance standard at Jupiter Exchange, focusing on inclusivity, simplicity, and active engagement. Here are its features: Empowering the Community At the heart of ASR&#8217;s design are several core objectives aimed at fostering a more [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/jupiter-exchanges-asr-simplifying-and-rewarding-participation/\">Jupiter Exchange&#8217;s ASR: Simplifying and Rewarding Participation</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]