[
  {
    "source": "CryptoGlobe",
    "date": "2024-03-18T23:52:00.000Z",
    "title": "Solana ($SOL) Trader Turns $72,000 into $30 Million in Three Days",
    "url": "https://www.cryptoglobe.com/latest/2024/03/solana-sol-trader-turns-72000-into-30-million-in-three-days/",
    "description": "The recent surge in memecoins has seen a trader, identified on-chain by the alias “sundayfunday.sol,” turn a $72,000 investment into a staggering $30 million within just three days trading a little-known cryptocurrency. According to on-chain analysis service Lookonchain, “sundayfunday.sol” bought the meme-inspired cryptocurrency Book of Meme (BOME), launched on the Solana blockchain last week, through […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-19T00:00:25.000Z",
    "title": "Bitcoin Has Undergone This Bearish Structure Change, Analyst Explains",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-undergone-bearish-analyst-explains/",
    "description": "An analyst has explained that the recent trend in the Bitcoin Coinbase Premium Gap suggests a significant change in the asset&#8217;s structure. Bitcoin Coinbase Premium Gap Has Continued To Be Negative In a new post on X, analyst Maartunn discussed how the Bitcoin Coinbase Premium Gap is still negative. The &#8220;Coinbase Premium Gap&#8221; here refers to a metric that tracks the difference between the Bitcoin prices listed on cryptocurrency exchanges Coinbase (USD pair) and Binance (USDT pair). Related Reading: Bitcoin Sentiment Cools Off, Price Rebound Soon? This indicator&#8217;s value provides hints about how the behavior of the former&#8217;s userbase currently differs from that of the latter platform. Below is the chart shared by the analyst that reveals the trend in the Bitcoin Coinbase Premium Gap since the start of the year. The value of the metric seems to have been quite red in recent days &#124; Source: @JA_Maartun on X As the graph shows, the Bitcoin Coinbase Premium Gap had been mostly positive as Bitcoin had gone through its journey from $44,000 to beyond the $73,000 level. This would imply that the price listed on the exchange was higher than on Binance during this period. Such a trend naturally suggests that the buying pressure on the former was greater than on the latter. Coinbase is widely known to be the preferred platform of US-based institutional investors, while Binance has global traffic. Thus, the green positive premium values would imply these large American entities had been buying and supporting the rally. Recently, however, the indicator&#8217;s value turned negative as these investors took to selling instead. Since then, the metric has continued to assume such values. Alongside this selloff, the BTC price has experienced a notable decline. The Bitcoin Coinbase Premium Gap followed a similar pattern during the first month or so of the year. In the first 10 days of January, the metric had been positive as buying had occurred in anticipation of the spot exchange-traded funds (ETFs). Still, after the ETFs had been approved, the indicator had turned negative. Related Reading: Bitcoin FOMO: Over 533,330 Addresses Bought Above $70,180 The red premium values had maintained for a few weeks, during which the cryptocurrency price had struggled. Based on this pattern and the recent trend, it would seem that American institutional traders have driven the price action this year. As such, so long as the current bearish structure in the Bitcoin Coinbase Premium Gap exists, it&#8217;s possible that the price may not be able to amass too much upward momentum. BTC Price At the end of the positive Coinbase Premium Gap streak, Bitcoin had been able to achieve a new all-time high above $73,800, but as traders have switched to selling on the platform, the coin has dropped almost 9%, with its price now trading around $67,300. Looks like the price of the coin has been going down over the last few days &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, CryptoQuant.com, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-19T00:00:58.000Z",
    "title": "Analyst Predicts Over 80% Rally for Under-the-Radar Ethereum Rival, Updates Forecast on Cardano and Polygon",
    "url": "https://dailyhodl.com/2024/03/18/analyst-predicts-over-80-rally-for-under-the-radar-ethereum-rival-updates-forecast-on-cardano-and-polygon/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/Crypto-Markets-Popping-Out-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/Crypto-Markets-Popping-Out-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/Crypto-Markets-Popping-Out-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/Crypto-Markets-Popping-Out-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/Crypto-Markets-Popping-Out-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/Crypto-Markets-Popping-Out-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/Crypto-Markets-Popping-Out-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is predicting a massive rally for one Ethereum (ETH) competitor while updating his forecasts on Cardano (ADA) and Polygon (MATIC). Crypto strategist Ali Martinez tells his 53,500 followers on the social media platform X that he envisions layer-1 blockchain Fantom (FTM) to surge to a price tag of $1.44, a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/18/analyst-predicts-over-80-rally-for-under-the-radar-ethereum-rival-updates-forecast-on-cardano-and-polygon/\">Analyst Predicts Over 80% Rally for Under-the-Radar Ethereum Rival, Updates Forecast on Cardano and Polygon</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]