[
  {
    "source": "Crypto Daily",
    "date": "2024-02-17T13:15:07.000Z",
    "title": "North Korean Hackers Are Now Using YoMix To Launder Stolen Funds",
    "url": "https://cryptodaily.co.uk/2024/02/north-korean-hackers-are-now-using-yomix-to-launder-stolen-funds",
    "description": "The dreaded North Korean hacker collective Lazarus Group is now using the YoMix Bitcoin mixer to launder stolen funds after the recent crackdown on the Sinbad mixer."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-17T13:21:20.000Z",
    "title": "Bitcoin Price Prediction 2024-2033: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2024-2033 How much is Bitcoin (BTC) worth? Today, the price of Bitcoin stands at $51,594, with a trading volume over the past 24 hours reaching $24 billion. Its market capitalization is $1 trillion, and it currently commands 54% of the market share. Over the last 24 hours, the BTC price has experienced [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-17T13:15:29.000Z",
    "title": "Mountain Bridge: Revolutionizing Crypto Trading with Global Connectivity and Real-Time Intelligence",
    "url": "https://www.cryptopolitan.com/mountain-bridge-revolutionizing-crypto-trading-with-global-connectivity-and-real-time-intelligence/",
    "description": "Geneva, Switzerland, February 17th, 2024, Chainwire In the ever-evolving landscape of cryptocurrency trading, Mountain Bridge stands out as a beacon of innovation, redefining the industry with its unique blend of advanced technology, live intelligence, and unparalleled global connectivity. This investment crypto exchange and VIP trading platform has been making waves, setting new standards for the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-17T13:33:38.000Z",
    "title": "CHAINLINK PRICE ANALYSIS & PREDICTION (February 17) – Chainlink Pauses Buying After Increasing By 30% In Two Weeks, Incoming Retracement?",
    "url": "https://nulltx.com/chainlink-price-analysis-prediction-february-17-chainlink-pauses-buying-after-increasing-by-30-in-two-weeks-incoming-retracement/",
    "description": "Since the price broke out of an accumulation face two earlier this month, Chainlink LINK has been struggling to increase but has managed to reach a significant milestone for the first time in two years. It currently appears calm on the daily. The recent monthly break out of an accumulation [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-17T13:24:57.000Z",
    "title": "VECHAIN PRICE ANALYSIS & PREDICTION (February 17) – VET Completely Breaks Out Of Bearish Zone After A Massive Explosion, Signals Bull Run",
    "url": "https://nulltx.com/vechain-price-analysis-prediction-february-17-vet-completely-breaks-out-of-bearish-zone-after-a-massive-explosion-signals-bull-run/",
    "description": "As volatility flows into the lower-cap altcoins, VeChain’s price exploded by 100% weekly and rallied hard to a new multi-month high after two years of trading in a bearish zone. It signals bullish and looks ready for a bull run. After marking resistance near the $0.039 level during the late [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-17T13:13:58.000Z",
    "title": "FLOKI PRICE ANALYSIS & PREDICTION (February 17) – Floki Nears Key Resistance Following An Impressive Recovery In Two Weeks, What’s Next?",
    "url": "https://nulltx.com/floki-price-analysis-prediction-february-17-floki-nears-key-resistance-following-an-impressive-recovery-in-two-weeks-whats-next/",
    "description": "Amid the latest surge in volatility, Floki increased by 15% in the past week and now looks bullish on the daily chart. It currently trades near a monthly resistance level as it gathers momentum for a massive move.  After correcting by almost 50% in two months, Floki found support at [&#8230;]"
  }
]