[
  {
    "source": "Cointelegraph",
    "date": "2023-11-29T23:24:53.000Z",
    "title": "Can Sony and Microsoft bring blockchain to gaming consoles?",
    "url": "http://cointelegraph.com/news/sony-microsoft-bring-blockchain-gaming-consoles",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/43fcd84d-87b2-4617-b168-62ca4de56fa1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sony and Microsoft are angling to get into crypto gaming. Will they be able to succeed where others in the industry have failed?</p>\n                    <p><p>Sony and Microsoft, two of the biggest names in gaming, have been making significant moves towards blockchain technology in recent years. This is an important development, as it has the potential to not only revolutionize the gaming industry but it could be the Trojan horse that makes blockchain a mainstream possibility.</p><p>Sony has filed a patent for a system allowing players to transfer digital assets between PlayStation titles using blockchain technology. This would enable unified progress and asset ownership across different games rather than having assets locked to individual games. Sony has also explored tokenizing in-game assets, allowing players to sell and trade them on secondary markets.</p><p>Leaked documents show that Microsoft is planning to <a href=\"https://cointelegraph.com/news/microsoft-activision-buy-metaverse-office-crypto-gaming\">add crypto wallets to Xbox</a>. This would allow players to trade assets across different platforms securely. Microsoft's goals in annual reports also align with this, as they are pursuing the <a href=\"https://cointelegraph.com/news/microsoft-activision-buy-metaverse-office-crypto-gaming\">acquisition of Activision Blizzard</a> and acquiring Savage Game Studios for mobile. This suggests that Microsoft is serious about expanding its gaming presence and that blockchain could play a role.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/the-reason-bots-dominate-crypto-gaming-cash-grubbing-developers-incentivize-them\"><strong><em>The reason bots dominate crypto gaming? Cash-grubbing developers incentivize them</em></strong></a></p><p>Blockchain gaming is a significant opportunity, so it's no surprise it is gaining attention from two gaming leaders. Estimates suggest the market’s value in 2025 could be up to 10% greater than in 2022.</p><p>The main drivers of the growth of the blockchain gaming market include the increasing popularity of play-to-earn games, the growing demand for more immersive and engaging gaming experiences, and the increasing adoption of blockchain technology by game developers and publishers.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/29ba8829-4eb2-4dc0-bf85-e08ba4486144.jpg\"  /><figcaption style=\"text-align: center;\"><em>The gaming market could grow by more than 10% between 2022 and 2025, according to some estimates. Source: Newzoo.</em></figcaption></figure><p>But why blockchain in the first place? The traditional gaming industry primarily generates revenue through game sales, in-game purchases, and subscriptions, often limiting player ownership of in-game assets and focusing monetization strategies on microtransactions and downloadable content (DLC).</p><p>While tokenization has been in games since the advent of the in-app purchase, the unique properties of blockchain offer true ownership of in-game assets, new revenue streams for players and creators, and more transparent and secure game economies, including the possibility for players to earn real-world value, community governance where players can influence game development decisions, and dividend-like payouts or staking rewards distributed to token holders.</p><p>Ownership of characters, items, and currency also means that you can trade or sell those assets on secondary markets or use them in other blockchain games.</p><h2>Could game consoles make blockchain mainstream?</h2><p>This wouldn't be the first time Sony has brought previously niche, cutting-edge technology to the masses.</p><p>In the early 2000s, Sony was one of the leading proponents of the Blu-ray disc format. Blu-ray eventually won the format war over HD DVD and is now the standard for high-definition optical discs. By partnering with other major companies, Sony created a critical mass of support for Blu-ray, which helped it become the dominant format.</p><p>But including a Blu-ray player in the PlayStation 3 — followed by the PS4 and PS5 — put a cost-effective, high-definition movie cinema in over 239 million homes worldwide. The year before the launch of the PS3, the average cost of a Blu-ray player was more than $1,000 — and it didn't play games, unlike the $500 console.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today is a good day to play. We officially welcome Activision Blizzard King to Team Xbox. Together, we’ll create stories and experiences that bring players together, in a culture empowering everyone to do their best work and celebrate diverse perspectives. <a href=\"https://t.co/KBCESknYYh\">https://t.co/KBCESknYYh</a> <a href=\"https://t.co/jTHOeH48Wx\">https://t.co/jTHOeH48Wx</a></p>&mdash; Phil Spencer (@XboxP3) <a href=\"https://twitter.com/XboxP3/status/1712816031423729991?ref_src=twsrc%5Etfw\">October 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>But the Japanese gaming giant has also dropped the ball several times. The Sony Aibo was arguably the best home robot ever created, and it seemed apparent to many that a PlayStation connection, which could play games with that capable metal dog and reprogram it, would have created the economy of scale needed to make it a must-have purchase.</p><p>And many have commented on how PlayStation Home could be leagues ahead of anything Meta and others are creating to try and bring the metaverse to the home and office, yet it strangely disappeared when the PS4 came to life.</p><h2>Existing blockchain gaming hardware</h2><p>Of course, Sony and Microsoft aren't first to market in the blockchain gaming niche. There are several existing blockchain gaming hardware products on the market, including the Oculus Quest 2 and HTC Vive Pro 2 VR headsets that have blockchain games available for play today, and various high-end gaming laptops are available, such as the Alienware x17 R2 and Asus ROG Zephyrus G15.</p><p>All of those devices, however, feel like those early Blu-ray players in terms of cost and inaccessibility to all.</p><p>However, there are some options on the other end of the price scale. WOWCube is a 3D puzzle game console that allows players to interact with the digital world by twisting, shaking, and tilting the device, reminiscent of a Rubik's cube, and the company behind it has announced that they are working with developers to create blockchain games that can be played on the device.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/90-of-gamefi-projects-are-ruining-the-industry-s-reputation\"><strong><em>90% of GameFi projects are ruining the industry’s reputation</em></strong></a></p><p>In 2021, Atari released a new version of its iconic VCS designed for blockchain gaming. It has a built-in wallet and support for multiple blockchains and comes pre-loaded with many blockchain games, including Atari Pong, Atari Breakout, and Atari Asteroids. It is also possible to sideload additional blockchain games onto the VCS.</p><p>And the Anbernic RG552 is a handheld retro gaming console also released in 2021. While it targets those who want to play retro games, including games from the Atari 2600, Nintendo Entertainment System, and Super Nintendo Entertainment System, it can also be used to play blockchain games via the open-source RetroArch emulator.</p><h2>The road ahead is hashed with gaming gold</h2><p>Sony and Microsoft's move towards blockchain is a significant development for the gaming industry. Blockchain has the potential to revolutionize the way that games are designed, played, and monetized.</p><p>There are challenges ahead, of course. Web3 games are excluded from significant gaming platforms and marketplaces to prohibit applications that issue or allow the exchange of cryptocurrencies or <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a>. However, those hurdles could be lowered or eradicated with the might of two major gaming powerhouses pushing the agenda.</p><p>Significant players like Sony, Microsoft, and Nintendo dominate the gaming console market. However, these platforms have yet to offer decentralized game development or digital asset ownership. On the other hand, various blockchain-based games exist. Still, no unified hardware platform optimizes the gaming experience for blockchain-native games, and all games are limited to personal computer use.</p><p>If Sony and Microsoft change the landscape, or if any existing up-and-coming solutions become wildly popular, gaming — not financial services, real estate, voting, or NFTs — could successfully bring blockchain to the masses and even significantly impact the global technology landscape and cultural landscape.</p><p>Maybe, as with Blu-ray, gaming is the way to put it in the hands of the general public and not just the technologically gifted.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Olga Vorobyeva</strong> is the founder of Vox Consulting, a blockchain advisory firm, and a former head of marketing at SwissBorg, a crypto wealth management platform. She is a founding member of the Swiss Blockchain Association and advisor to startups in Switzerland's \"Crypto Valley.\" She also serves as a mentor to the Alchemist startup accelerator. She holds a master's degree from the Plekhanov University of Economics and a certificate in management from The Wharton School of Business.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  }
]