[
  {
    "source": "Decrypt",
    "date": "2023-08-14T15:57:28.000Z",
    "title": "Coinbase Rolls Out Crypto Services in Canada",
    "url": "https://decrypt.co/152424/coinbase-rolls-out-crypto-services-canada",
    "description": "The company will kick start its launch by offering a free trial for its new subscription service, Coinbase One. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-14T15:44:00.000Z",
    "title": "What is PayPal USD, and how does it work?",
    "url": "https://cointelegraph.com/explained/what-is-paypal-usd-and-how-does-it-work",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/16cd46713ffbced91f68336d8f33f11c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>PayPal has launched its own stablecoin, dubbed PayPal USD (PYUSD). The coin is only available to American customers.</p>\n                    <p><h2>PYUSD is set to face some hurdles</h2><p></p><p><em>While the PayPal USD stablecoin has the potential to compete with other established stablecoins, it will need to overcome some hurdles.</em></p><p>The unveiling of the PayPal USD stablecoin marks the entry of a major regulated financial entity into the crypto space, which could give the cryptocurrency industry the much-needed legitimacy it has been seeking. As such, PYUSD stablecoin is expected to find favor among crypto enthusiasts as looming<a href=\"https://cointelegraph.com/news/bitcoin-price-falls-under-30k-as-macro-and-regulatory-worries-take-center-stage\"> regulations roil the crypto market</a> and cause uncertainty.</p><p>However, PYUSD is also set to face some challenges. For instance, its availability to only American users could constrain its growth. Additionally, some users may be <a href=\"https://cointelegraph.com/news/paypal-usd-boon-for-ethereum-but-not-decentralization-says-community\">wary of the centralized nature</a> of the cryptocurrency and the presence of a security feature within the PYUSD system that permits asset freezing. There are also privacy concerns among users who value their private information.</p><p>Furthermore, the coin was launched at a time when there is an<a href=\"https://cointelegraph.com/news/u-s-congress-to-introduce-new-draft-bill-for-stablecoins\"> ongoing debate in Congress</a> regarding the establishment of a federal regulatory framework for stablecoins. As such, the coin, as well as other stablecoins in the market, could face new regulations that could make it more difficult for them to enter new markets.</p><h2>Competition looms for PYUSD stablecoin in a dynamic market </h2><p></p><p><em>As a new entrant in the stablecoin market, the PayPal USD stablecoin is set to encounter varying degrees of competition from already established players.</em></p><p>The domains in which PayPal USD will be vying for supremacy include market reach, brand authority and regulatory compliance. While Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) and BUSD have large market capitalizations reaching billions, PayPal USD is poised to rapidly expand its market capitalization by capitalizing on its huge user base.</p><p>In terms of accessibility, PayPal USD is yet to be listed on major exchanges. Listing PayPal USD on platforms such as <a href=\"https://cointelegraph.com/learn/binance-vs-coinbase-how-do-they-compare\">Coinbase, Binance</a> and Kraken would allow users outside the PayPal ecosystem to conveniently acquire the cryptocurrency.</p><p>When it comes to brand recognition, PayPal is a widely recognized and trusted name, which gives PayPal USD a significant competitive edge. However, stablecoins USDC, USDT and BUSD have an extensive track record and have solidified their standing as dependable stablecoins.</p><p>When considering regulatory compliance, PayPal USD has a leg up on other stablecoins, such as USDT, which are not yet subject to any government oversight. This could give PayPal USD a significant advantage in the long run, as regulators in major jurisdictions, such as the U.S., increasingly crack down on the stablecoin market and impose restrictions on their use.</p><p>The PYUSD stablecoin stands out from other stablecoins because Paxos, the company that issues it, is subject to the regulatory oversight of the NYDFS. This means that in the event of a Paxos bankruptcy, the NYDFS would step in to ensure that investors get their funds back. This gives PYUSD a significant advantage over other stablecoins, which are not subject to the same level of regulatory scrutiny.</p><h2>Why is PayPal unveiling its own cryptocurrency?</h2><p></p><p><em>By unveiling its stablecoin, PayPal is attempting to claim a share of the growing cryptocurrency market. </em></p><p>The company says that PYUSD will be able to support quick fund transfers for various purposes, such as remittances. PayPal has also indicated that the new cryptocurrency will be compatible with<a href=\"https://cointelegraph.com/learn/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\"> Web3 environments</a> and will eventually be available on<a href=\"https://cointelegraph.com/news/venmo-will-enable-fiat-to-crypto-payments-in-may\"> Venmo</a>.</p><p>The move to support Web3 seems to be a strategic one for PayPal as Web3 is widely hailed as the next generation of the internet. With Web3 frameworks being built atop <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-everything-there-is-to-know\">blockchain technology</a>, cryptocurrencies are set to play a crucial role in facilitating transactions within these ecosystems.</p><p>In Web3 environments, users will have more control over their data, interactions and <a href=\"https://cointelegraph.com/news/from-paypal-to-web3-digital-identity-could-play-key-role-in-unlocking-mainstream-adoption\">digital identity</a>. Cryptocurrencies will help to shape the way people transact and support online platforms and creators. </p><p>They will do this by enabling secure and direct peer-to-peer transactions in Web3, thereby eliminating the need for intermediaries, such as banks or payment processors. This will translate to faster, more efficient and more cost-effective transactions and higher earnings for creators.</p><p>By announcing its intention to support Web3, PayPal seems to be setting itself up to be a major player in the next generation of the internet by allowing PYUSD to be used for payments and transfers in virtual settings.</p><p>Notably, PayPal USD is an<a href=\"https://cointelegraph.com/explained/erc-20-tokens-explained\"> ERC-20 token</a>. This implies that it will be available to a growing community of external developers and supported by many Web3 applications in the future, especially those built on the<a href=\"https://cointelegraph.com/learn/binance-smart-chain-vs-ethereum-differences-explained\"> Ethereum blockchain</a>.</p><p>PayPal’s decision to make its own stablecoin is seen as a natural progression for the company. This is because the company has been gradually<a href=\"https://cointelegraph.com/news/paypal-s-crypto-holdings-increased-by-56-in-q1-2023-to-nearly-1b\"> expanding its cryptocurrency offerings</a> in recent years. The launch of PayPal USD is a significant step forward.</p><p>Currently, PayPal USD is issued and managed by Paxos Trust Company, a regulated blockchain infrastructure firm that is subject to the oversight of the New York State Department of Financial Services (NYDFS), meaning that PayPal USD is a regulated product. </p><p>Paxos previously issued Binance USD (<a href=\"https://cointelegraph.com/binance-usd-busd-price-index\">BUSD</a>) but <a href=\"https://cointelegraph.com/news/stablecoin-issuer-paxos-to-face-sec-lawsuit-over-binance-usd-report\">stopped due to pressure</a> from the U.S. Securities and Exchange Commission and the NYDFS after it was alleged that the stablecoin was an unregistered security.</p><p>In June 2022, PayPal was granted a BitLicense by the NYDFS. A BitLicense is a permit that allows businesses to engage in cryptocurrency-related activities in the state of New York. PayPal’s BitLicense permits the firm to provide cryptocurrency services to customers in the state of New York.</p><p>Starting in September 2023, Paxos will begin publishing a monthly Reserve Report for PYUSD that will openly detail the components that make up the stablecoin’s reserves. Additionally, Paxos will provide a third-party<a href=\"https://www.prnewswire.com/news-releases/paypal-launches-us-dollar-stablecoin-301894262.html\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"> validation</a> of PayPal USD’s reserve holdings. This verification will be executed by an impartial accounting firm unrelated to the parties involved in accordance with the standards defined by the American Institute of Certified Public Accountants.</p><h2>PayPal USD (PYUSD), explained</h2><p></p><p><em>Going by the company’s communique, PayPal USD is designed for people who wish to avoid the volatility of other cryptocurrencies.</em></p><p>PayPal is <a href=\"https://cointelegraph.com/news/paypal-launches-stablecoin-for-payment\">rolling out its own stablecoin</a>, called PayPal USD (PYUSD). Per the<a href=\"https://newsroom.paypal-corp.com/2023-08-07-PayPal-Launches-U-S-Dollar-Stablecoin\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"> announcement</a>, the primary purpose of the PayPal stablecoin will be to make virtual payments frictionless, especially within blockchain ecosystems. The<a href=\"https://cointelegraph.com/learn/stablecoins-101-what-are-crypto-stablecoins-and-how-do-they-work\"> stablecoin</a>, which is currently only available to eligible PayPal customers in the United States, has a few distinctive features, including being exchangeable for fiat currency on the PayPal platform through a simple conversion process.</p><p>In essence, PayPal USD is a stablecoin whose value is equal to the value of its pegged asset — i.e., the U.S. dollar. A stablecoin is a type of cryptocurrency that is pegged to a<a href=\"https://cointelegraph.com/news/crypto-and-fiat-currencies-are-worlds-apart-here-are-the-reasons-why\"> fiat currency</a>. According to PayPal, PYUSD is fully backed (collaterized) by USD deposits, short-term U.S. treasuries and similar cash equivalents. </p><p>This ensures that the PYUSD pegging mechanism maintains the USD value, even when other cryptocurrencies and the wider market fluctuates. The reserves serve as a guarantee to users that they will be able to redeem their stablecoins for the underlying assets if an unforeseen event causes the stablecoin to <a href=\"https://cointelegraph.com/news/how-and-why-do-stablecoins-depeg\">depeg from the correlated fiat currency</a>.</p><p>For those who wish to obtain PYUSD, PayPal says that the stablecoin can be bought and sold through the company’s app or on its official website. As highlighted by PayPal, users of the cryptocurrency can pay for online purchases using PYUSD at online stores that support PayPal USD transactions. This means that the cryptocurrency is likely to be embraced by the consumer payment sector. The coins can also be transferred to cryptocurrency wallets that support PYUSD, such as the Coinbase Wallet and MetaMask.</p><p><img alt=\"Advantages of PayPal USD for qualified PayPal users in the US\" src=\"https://s3.cointelegraph.com/storage/uploads/view/1c00274dbde68c20c947fd92f83276e4.jpg\" title=\"Advantages of PayPal USD for qualified PayPal users in the US\"></p><p>Additionally, PayPal clients in the U.S. can use the digital currency to buy other cryptocurrencies that PayPal supports, such as Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Bitcoin Cash (<a href=\"https://cointelegraph.com/bitcoin-cash-price-index\">BCH</a>), Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) and Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>).</p><p>For users who desire to send PYUSD funds to other PayPal users, there are<a href=\"https://www.paypal.com/us/digital-wallet/manage-money/crypto/pyusd\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"> no fees</a>. However, there are applicable charges when converting between PYUSD and other cryptocurrencies and when carrying out online purchases and withdrawals. The company says that the fees will be <a href=\"https://newsroom.paypal-corp.com/2023-08-07-PayPal-Launches-U-S-Dollar-Stablecoin\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">disclosed</a> to users when trading the crypto on the platform or checking out.</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-14T16:03:25.000Z",
    "title": "CoinDesk to lay off 45% of editorial staff amid restructuring: Report",
    "url": "https://cryptoslate.com/coindesk-to-lay-off-45-of-editorial-staff-amid-restructuring-report/",
    "description": "<p>Crypto media outlet CoinDesk is laying off 45% of its editorial staff in a sweeping restructuring move as its parent company Digital Currency Group (DCG) seeks to bring on strategic investors, according to an internal memo reviewed by The Block. The layoffs were announced internally on Monday and will see 20 individuals, or 45% of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coindesk-to-lay-off-45-of-editorial-staff-amid-restructuring-report/\">CoinDesk to lay off 45% of editorial staff amid restructuring: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-14T16:00:31.000Z",
    "title": "Bitcoin accumulation cools off during August, but all eyes are on September",
    "url": "https://cryptoslate.com/insights/bitcoin-accumulation-cools-off-during-august-but-all-eyes-are-on-september/",
    "description": "<p>Quick Take Over the last five years, the month of August has consistently exhibited a specific trait when it comes to Bitcoin accumulation. The Accumulation Trend Score—a critical on-chain indicator reflecting the relative size of entities actively accumulating Bitcoin—has consistently registered at 0.5 or less. This score uses a scale to determine whether larger entities [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-accumulation-cools-off-during-august-but-all-eyes-are-on-september/\">Bitcoin accumulation cools off during August, but all eyes are on September</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-14T15:58:31.000Z",
    "title": "Potential Ramifications of PayPal’s Stablecoin for Ethereum Are ‘Massive’, Says Bloomberg Analyst",
    "url": "https://www.cryptoglobe.com/latest/2023/08/potential-ramifications-of-paypals-stablecoin-for-ethereum-are-massive-says-bloomberg-analyst/",
    "description": "Last week, digital payments giant PayPal Holdings, Inc. unveiled its U.S. dollar-pegged stablecoin, PayPal USD (PYUSD), marking a strategic pivot into the Web3 and digital payment sectors. A blend of U.S. dollar deposits and short-term U.S. Treasuries anchors PYUSD. Paxos Trust Company, the entity issuing the stablecoin, guarantees its 1:1 parity with the U.S. dollar. […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T15:53:52.000Z",
    "title": "#1 Metaverse Summit 2023: The Role of NFTs in Redefining Digital Ownership",
    "url": "https://www.cryptopolitan.com/1-metaverse-summit-2023-the-role-of-nfts-in-redefining-digital-ownership/",
    "description": "Paris &#8211; The Metaverse Summit 2023, an international convention dedicated to celebrating the forefront of Metaverse technology and creativity, is set to convene once again. This highly anticipated event brings together visionaries, developers, investors, stakeholders, and experts to delve into the future of the Metaverse and its transformative potential. The theme of this year&#8217;s Metaverse ... <a title=\"#1 Metaverse Summit 2023: The Role of NFTs in Redefining Digital Ownership\" class=\"read-more\" href=\"https://www.cryptopolitan.com/1-metaverse-summit-2023-the-role-of-nfts-in-redefining-digital-ownership/\" aria-label=\"More on #1 Metaverse Summit 2023: The Role of NFTs in Redefining Digital Ownership\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T15:52:25.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T15:47:10.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-14T16:00:57.000Z",
    "title": "Winds Of Change: Bitcoin Miner Riot Sees Substantial Increase In BTC Holdings",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-miner-riot-increase-btc/",
    "description": "Bitcoin mining has been up by a considerable fraction this year, as the blockchain network recorded a new all-time high in hash rate in the second quarter of the year. Mining revenue is also up, as the bitcoin Bitcoin recorded a spike in transaction volume.  As a result, Riot Blockchain, one of the largest publicly traded Bitcoin mining companies in the US, has recorded an increase in operations in the second quarter. According to its 2023 second-quarter financial results, the mining company recorded a new all-time record hash while ramping up its Bitcoin mining operations. Solid Second Quarter 2023 According to its financial report, Riot has seriously ramped up its Bitcoin mining operations. As a result, the mining company produced 1,775 BTC during the second quarter of 2023, a 27% increase compared to the 1,395 BTC it produced during that same period in 2022.  In May 2023 alone, the company produced 676 BTC at an average of 21.8 BTC per day. The average cost to mine each bitcoin was $8,389, beating Q2 2022&#8217;s average of $11,316. Related Reading: More Selling? Bankrupt Voyager Sends Millions In SHIB And ETH To Coinbase Riot also witnessed an increase in mining revenue, as Bitcoin miners generated a remarkable total revenue of $2.4 billion. Although the price of Bitcoin during the quarter was 15% less than what it was in Q2 2022, Riot saw a total revenue of $76.7 million, as compared to $72.9 million in Q2 2022. Mining revenue ($49.7 million), engineering revenue ($19.3 million), data hosting revenue ($7.7 million), and power curtailment credits ($13.5 million) were also higher than in Q2 2022.  Not only has RIOT’s revenue from bitcoin mining increased, but their actual bitcoin holdings have also grown substantially. As of June 30, Riot held 7,264 BTC with the price of each BTC at $30,477. In total, Riot finished the quarter with $408.4 million in working capital, including $289.2 million in cash on hand and $221.4 million in Bitcoin, while also reducing its net loss to $27.7 million compared to $353.6 million in Q2 2022. BTC price remains volatile &#124; Source: BTCUSD on Tradingview.com  Increase In Bitcoin Mining Power Riot Blockchain also drastically increased its hash rate throughout the quarter, reaching an all-time record hash rate capacity of 10.7 EH/s. However, the company is also looking to enhance its computational power.  Related Reading: Want A Bitcoin Spot ETF? Then Prove BTC Is Not Manipulated, Says SEC During the quarter, the company signed a long-term purchase agreement with MicroBT to acquire 33,280 next-generation miners. With an expanded mining fleet and facility, Riot believes it can see its hash rate grow to 20.1 EH/s by the second quarter of 2024.  Bitcoin mining is an energy-intensive process. However, Riot&#8217;s power strategy contributes to the stability of the energy grid in Texas at times of high demand by selling extra power back to the grid. At the time of writing Riot&#8217;s stock is up by 1.53% in a daily timeframe and 158.14% in the past six months. Featured image from PYMNTS, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-14T16:00:13.000Z",
    "title": "Chainlink and InQubeta: The Two Giants Poised for a Year of Remarkable Gains According to Top Analysts",
    "url": "https://www.crypto-news-flash.com/chainlink-and-inqubeta-the-two-giants-poised-for-a-year-of-remarkable-gains-according-to-top-analysts/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-and-inqubeta-the-two-giants-poised-for-a-year-of-remarkable-gains-according-to-top-analysts",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-29.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-29.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-29-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-29-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market is witnessing an exciting face-off between two promising projects, Chainlink and InQubeta, both vying for significant gains in the coming year. Top analysts are eyeing these giants with keen interest as Chainlink continues to enhance decentralized oracles. At the same time, InQubeta breaks new ground with its innovative AI technology and NFT-based [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-14T15:53:33.000Z",
    "title": "Coinbase Base Welcomes Coca-Cola’s ‘Masterpiece’ NFT Collection Featuring Timeless and Modern Art",
    "url": "https://www.crypto-news-flash.com/coinbase-base-welcomes-coca-colas-masterpiece-nft-collection-featuring-timeless-and-modern-art/?utm_source=rss&utm_medium=rss&utm_campaign=coinbase-base-welcomes-coca-colas-masterpiece-nft-collection-featuring-timeless-and-modern-art",
    "description": "<img width=\"1648\" height=\"920\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/04/coinbase-russia-56498452.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/04/coinbase-russia-56498452.jpg 1648w, https://www.crypto-news-flash.com/wp-content/uploads/2022/04/coinbase-russia-56498452-300x167.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/04/coinbase-russia-56498452-1024x572.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/04/coinbase-russia-56498452-768x429.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/04/coinbase-russia-56498452-1536x857.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/04/coinbase-russia-56498452-24x13.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/04/coinbase-russia-56498452-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/04/coinbase-russia-56498452-48x27.jpg 48w\" sizes=\"(max-width: 1648px) 100vw, 1648px\" />Major consumer brand Coca-Cola has launched its NFT collection on Base. The piece labeled Masterpiece showcases one of the best arts in the ecosystem. Only a few days after American cryptocurrency exchange and publicly traded company Coinbase announced the public launch of its Ethereum (ETH) scaling solution Base, the world&#8217;s largest soft drinks brand Coca-Cola [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-14T15:39:58.000Z",
    "title": "This President Wants to End Central Banks Era and Start New With Bitcoin (BTC) as Main Currency",
    "url": "https://www.crypto-news-flash.com/this-president-wants-to-end-central-banks-era-and-start-new-with-bitcoin-btc-as-main-currency/?utm_source=rss&utm_medium=rss&utm_campaign=this-president-wants-to-end-central-banks-era-and-start-new-with-bitcoin-btc-as-main-currency",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/01/bitcoin-g7b40b5e89_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/01/bitcoin-g7b40b5e89_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/01/bitcoin-g7b40b5e89_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/01/bitcoin-g7b40b5e89_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/01/bitcoin-g7b40b5e89_1920-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/01/bitcoin-g7b40b5e89_1920-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/01/bitcoin-g7b40b5e89_1920-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2022/01/bitcoin-g7b40b5e89_1920-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/01/bitcoin-g7b40b5e89_1920-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/01/bitcoin-g7b40b5e89_1920-48x32.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Argentina&#8217;s Pro Bitcoin Presidential Candidate Javier Milei is in the lead in the Primaries. As President, Milei has plans to focus more on Bitcoin that the Argentine Peso. Many netizens have been caught by surprise after pro Bitcoin and far-right populist candidate Javier Milei emerged as the winner of Sunday&#8217;s primary presidential election in Argentina. [...]"
  }
]