[
  {
    "source": "CryptoSlate",
    "date": "2023-07-16T02:01:25.000Z",
    "title": "Ripple ruling is likely to be appealed and overturned, ex-SEC official says",
    "url": "https://cryptoslate.com/ripple-ruling-is-likely-to-be-appealed-and-overturned-ex-sec-official-says/",
    "description": "<p>The Ripple case ruling is &#8220;ripe for appeal&#8221; and likely to be overturned, John Reed Stark, former chief of internet enforcement at the SEC, noted in a LinkedIn post on July 14. The court decision, which Cameron Winklevoss hailed as a watershed moment, &#8220;resides on shaky ground,&#8221; Stark wrote. Ripple court ruling is &#8216;troubling on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ripple-ruling-is-likely-to-be-appealed-and-overturned-ex-sec-official-says/\">Ripple ruling is likely to be appealed and overturned, ex-SEC official says</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-16T02:00:37.000Z",
    "title": "Robert Kennedy Jr Says Biden Is ‘Preparing for Ground War With Russia’ as World War III Warnings Escalate",
    "url": "https://news.bitcoin.com/robert-kennedy-jr-says-biden-is-preparing-for-ground-war-with-russia-as-world-war-iii-warnings-escalate/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/biden-ww3-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Robert Kennedy Jr Says Biden Is &#039;Preparing for Ground War With Russia&#039; as World War III Warnings Escalate\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/biden-ww3-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/biden-ww3-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/biden-ww3-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/biden-ww3-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/biden-ww3-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/biden-ww3-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/biden-ww3.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S. presidential candidate Robert F. Kennedy Jr. (RFK Jr.) has explained that President Joe Biden is &#8220;preparing for a ground war with Russia&#8221; by signing an executive order to mobilize reserve forces to augment Operation Atlantic Resolve. Multiple people have accused Biden of starting World War III. Biden Preparing for Ground War With Russia, Says [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-16T02:00:53.000Z",
    "title": "Stablecoin TrueUSD To Be Fully Controlled By Asian Owner",
    "url": "https://www.newsbtc.com/stablecoin/stablecoin-trueusd-to-be-fully-controlled-by-asian-owner/",
    "description": "Featured Image From Kraken, Chart From Tradingview. In today&#8217;s news, the prominent stablecoin TrueUSD &#8211; with the ticker TUSD &#8211; is now undergoing a management change.  According to a thread this morning by the project’s official Twitter handle, Archblock Inc., the current TUSD operator, has begun the transfer of total control of Token to its Asian-based owners, Techteryx Ltd.  Techteryx Finally Assumes Control Of TrueUSD Back in December 2020, Techteryx acquired ownership of TUSD but hired Archblock to keep maintaining the stablecoin’s operations. And for the last two years in which Archblock remained TUSD’s operator, Techteryx claims to have been focusing on expanding the token’s foreign use cases in the global markets.  Related Reading: BUSD Market Cap Plunge Of 80% Raises Concerns Of Impending Collapse However, Archblock has now commenced the transfer of control yesterday, July 13, marking the end phase of TUSD’s international transition. Upon completion, Techteryx will reportedly assume full management of all aspects of the stablecoin’s operation. These controls will include mining and redemptions, customer onboarding and compliance, conservation of fiat reserve, and maintenance of banking and fiduciary relationships. During the transition period, Archblock will continue to support the US-based TUSD users, with Techteryx stepping in with the necessary guidance and further updates.  Prior to today&#8217;s news, TUSD has attracted some interest especially following Binance&#8217;s recent moves with the stablecoin. On June 21, the cryptocurrency exchange announced the launch of a TUSD zero-maker fee promotion for spot and margin trading pairs beginning from June 30. Interestingly, Binance had minted $1 billion worth of TUSD on the Tron network a week before making that announcement becoming the largest holder of the token. Related Reading: Stablecoin Market Share Dwindles As USDC And BUSD Supply Deplete At the time of writing, Ethercscan data shows that Binance accounts for over 68% of TUSD&#8217;s circulating supply, estimated at $1.92 billion. With a market cap value of $2.8 billion, TrueUSD currently ranks as the 5th largest stablecoin and 27th largest cryptocurrency, according to data by Coingecko.  TUSD Valued At $0.99 On The 4-Hour Chart &#124; Source: TUSDUSD Chart On Tradingview.com The Stablecoin Market In 2023 Stablecoins are considered a vital part of the crypto space, especially due to their constant value, allowing traders and investors to avoid the volatility of the crypto market.  According to data from DeFi ilLama, the stablecoin market has been on the decline all year, with its total market cap shrinking from $137.79 billion on January 1 to its current value of $126.96 billion, accounting for 9.86% of the total crypto market.  Related Reading: Stablecoin Sharks &#38; Whales Show Strong Accumulation, Good Sign For Bitcoin? Unsurprisingly, Tether USDT (USDT) has remained the leader of the pack, with a market cap of $83.5 billion, with Circle’s USDCoin (USDC) following with a market cap of $27.08 billion. Following the regulatory embargo that halted its issuance in February, Binance USD (BUSD) &#8211; with a market cap of 3.99 billion &#8211; lost over 75% of its market share, slipping to fourth place behind the DAI stablecoin, which currently boasts a market cap of $4.28 billion.  Featured Image From Kraken, Chart From Tradingview."
  }
]