[
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T20:37:27.000Z",
    "title": "India, Russia ditch US dollar in $40 billion trade deal",
    "url": "https://www.cryptopolitan.com/india-russia-ditch-dollar-in-trade-deal/",
    "description": "In a striking move signaling a shift in global trade dynamics, India and Russia have once again boldly sidestepped the US dollar, conducting an impressive $40 billion worth of trade using their local currencies. This monumental trade volume, achieved within just three quarters of 2023, marks a historic high in the economic collaboration between these [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T20:29:58.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here’s a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T20:23:43.000Z",
    "title": "Blockchain is music industry’s untapped goldmine",
    "url": "https://www.cryptopolitan.com/blockchain-music-industrys-untapped-goldmine/",
    "description": "As the music industry continues to evolve, blockchain emerges as an untapped goldmine, offering revolutionary solutions to longstanding challenges. This technology, often associated with cryptocurrencies, holds the potential to reshape the music business landscape, introducing unprecedented levels of transparency, security, and artist autonomy. Blockchain Reinventing Music Distribution and Ownership The traditional music industry has been [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T20:18:20.000Z",
    "title": "Craig Wright ordered to pay $1 million as lawsuit takes new twist",
    "url": "https://www.cryptopolitan.com/craig-wright-to-pay-1-million-lawsuit-twist/",
    "description": "In the unfolding legal saga surrounding the identity of Satoshi Nakamoto and the rights to Bitcoin, a recent development has shifted the focus. A British judge has rescheduled the trial between Craig Wright, who claimed to be Satoshi Nakamoto in 2016, and Bitcoin Core developers to February 5. Wright’s legal battle involves a lawsuit against [&#8230;]"
  }
]