[
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T04:26:54.000Z",
    "title": "Missing 'Bitcoin Millionaire' and ONFO coin co-creator found dead: Report",
    "url": "https://cointelegraph.com/news/bitcoin-millionaire-onfo-coin-creator-dead",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/0674aeea-1c7e-45ad-b20d-d35af280dbd4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The body of Dr. John Forsyth has been found following a week-long search but police reportedly said foul play did not appear to be a factor. </p>\n                    <p><p>The co-founder of referral-based crypto project ONFO coin who went missing in Missouri on May 21, has been found dead around a week later on May 30 with an apparent gunshot wound, though police don’t currently suspect foul play. </p><p>Dr. John Forsyth, a crypto advocate and emergency room doctor was feared missing by relatives after not showing up to his shift at the Mercy Hospital in Cassville. His family launched an appeal on his whereabouts on social media soon after. </p><p>Speaking to the Daily Beast at the time, his younger brother, Richard Forsyth, said that he wouldn’t miss a shift which was “an immediate red flag.”</p><p>Authorities later found Forsyth’s sedan parked less than a mile away from the hospital, on May 28. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/0d4c8f80-9b7e-40c3-bcce-c01e1a9bf0c1.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Beaver Lake in northwest Arkansas, Dr. John Forsyth - Google Maps/Cassville Police Department</em></figcaption></figure><p>Forsyth’s wallet, passport, laptop, and work briefcase were found inside the unlocked vehicle. His brother added, “his cellphones were inside, which is also very uncharacteristic because he always has his cellphone.”</p><p>“It doesn’t seem like a person who left with a plan,” he<a href=\"https://apnews.com/article/missouri-doctor-missing-ozarks-f7f68205ec6db1f866e99ec4707443af\" target=\"_blank\" rel=\"noopener nofollow\"> told the AP</a> on May 30.</p><p>However, the body was found about an hour south of where he was last seen, with an apparent gunshot wound though local police said foul play does not appear to be a factor.</p><p><strong><em>Related:</em></strong><a href=\"https://cointelegraph.com/news/crypto-billionaires-subsequent-deaths-spark-wild-theories-among-the-community\"><strong><em> </em></strong><strong><em>Crypto billionaires’ back-to-back deaths spark wild theories among the community</em></strong></a></p><p>49-year-old Forsyth founded ONFO coin with his brother Richard Forsyth in 2020. The crypto project purportedly allows users to earn coins by referring others to the platform, a term it calls “network mining”.</p><p>ONFO has promoted itself by depicting the demise of the U.S. dollar through videos such as <em>THE U S DOLLAR IS DOOMED</em> posted to<a href=\"https://www.youtube.com/watch?v=8x-NW1RdbdA\" target=\"_blank\" rel=\"noopener nofollow\"> YouTube</a> in 2021, though there haven't been any new videos posted in a year.</p><p>In 2020, Forbes<a href=\"https://www.forbes.com/sites/lukefitzpatrick/2020/04/27/bitcoin-halving-a-new-class-of-bitcoin-millionaires-may-emerge/?sh=4b6745da61fc\" target=\"_blank\" rel=\"noopener nofollow\"> labeled</a> John Forsyth a “Bitcoin millionaire” who was studying mathematics as an undergraduate and was exposed to <a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a> and blockchain technology. </p><p>Forsyth joins a list of crypto advocates and founders that have died under mysterious circumstances. </p><p>In April, the creator of Cash App and the former technology chief at Square, Bob Lee,<a href=\"https://cointelegraph.com/news/cash-app-creator-dies-following-stabbing-in-san-francisco\"> was killed</a> following a stab wound. Authorities made an<a href=\"https://cointelegraph.com/news/san-francisco-authorities-make-arrest-in-stabbing-of-cash-app-creator-bob-lee\"> arrest</a> on April 13 but did not comment on the motive of the attack.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/moral-responsibility-how-blockchain-can-improve-ai-trustworthiness/\">‘Moral responsibility’ — Can blockchain really improve trust in AI?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-01T04:26:00.000Z",
    "title": "Crypto Influencer Receives $1 Million in $ETH After Simply Asking, Promising Nothing in Return",
    "url": "https://www.cryptoglobe.com/latest/2023/06/crypto-influencer-receives-1-million-in-eth-after-simply-asking-promising-nothing-in-return/",
    "description": "The cryptocurrency community has recently responded to an unusual request on social media in an unexpected way. After an influencer, Pauly0x, tweeted out his Ethereum ($ETH) wallet address with a promise to followers that they would receive “absolutely nothing” in exchange for sending him ETH, he received over $1 million worth of the cryptocurrency. According […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-01T04:36:44.000Z",
    "title": "BNB Price Prediction: Risk of Sharp Drop Below $300",
    "url": "https://www.newsbtc.com/analysis/bnb/bnb-price-prediction-risk-below-300/",
    "description": "BNB price (Binance coin) is moving lower below the $310 support against the US Dollar. The bears could gain strength if there is a close below $300. Binance coin price is moving lower from the $318 resistance against the US Dollar. The price is now trading below $310 and the 100 simple moving average (4 hours). There was a break below a key bullish trend line with support near $310 on the 4-hour chart of the BNB/USD pair (data source from Binance). The pair could accelerate lower if it breaks the $300 support zone. Binance Coin Price Tops Again This past week, BNB price attempted an upside break above the $318 resistance. However, the bulls struggled to gain strength above $318, similar to Bitcoin and Ethereum. A high is formed near $317.1 and the price started a fresh decline. There was a clear move below the $312 and $310 levels. There was also a break below a key bullish trend line with support near $310 on the 4-hour chart of the BNB/USD pair. BNB price is now trading below $310 and the 100 simple moving average (4 hours). A low is formed near $303.2 and the price is now consolidating losses. On the upside, BNB is facing resistance near the $306.5 level. It is close to the 23.6% Fib retracement level of the downward move from the $317.1 swing high to the $303.2 low. The first major resistance is near $310 and the 100 simple moving average (4 hours). Source: BNBUSD on TradingView.com It is close to the 50% Fib retracement level of the downward move from the $317.1 swing high to the $303.2 low. The next major resistance is near $315. A clear move above the $315 resistance might start a steady increase. The next major resistance is near the $318 level, above which the price might rise toward the $325 resistance. More Losses in BNB? If BNB fails to clear the $310 resistance, it could continue to move down. Initial support on the downside is near the $303 level. The next major support is near the $300 level. If there is a downside break below the $300 support, there could be an extended decline toward the $292 support. Any more losses could send the price toward the $284 support. Technical Indicators 4-Hours MACD – The MACD for BNB/USD is gaining pace in the bearish zone. 4-Hours RSI (Relative Strength Index) – The RSI for BNB/USD is currently below the 50 level. Major Support Levels – $303, $300, and $284. Major Resistance Levels – $307, $310, and $315."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-01T04:10:12.000Z",
    "title": "Ethereum Price Topside Bias Vulnerable If It Continues To Struggle Below $1,920",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-vulnerable-1920-2/",
    "description": "Ethereum price started another decline from the $1,920 resistance against the US Dollar. ETH is at a risk of more losses if it stays below $1,920 for a long time. Ethereum is now showing bearish signs and well below the $1,920 resistance zone. The price is trading below $1,880 and the 100-hourly Simple Moving Average. There is a major bearish trend line forming with resistance near $1,870 on the hourly chart of ETH/USD (data feed via Kraken). The pair could gain bearish momentum if it breaks the $1,840 support. Ethereum Price Faces Rejection Ethereum’s price started a fresh decline after it failed to clear the $1,920 resistance zone. ETH declined below the $1,880 level to move into a short-term bearish zone, similar to Bitcoin. There was a sharp move below the $1,860 level. The price even tested the $1,840 support. A low is formed near $1,838 and the price is now consolidating losses. It is testing the 50% Fib retracement level of the recent decline from the $1,882 swing high to the $1,838 low. Ether is now trading below $1,880 and the 100-hourly Simple Moving Average. There is also a major bearish trend line forming with resistance near $1,870 on the hourly chart of ETH/USD. Immediate resistance is near the $1,865 zone. It is close to the 76.4% Fib retracement level of the recent decline from the $1,882 swing high to the $1,838 low. The next major resistance is near the $1,880 level. A proper move above the $1,865 and $1,880 resistance levels might send Ether toward $1,900. Source: ETHUSD on TradingView.com The next resistance sits near $1,920, above which Ethereum could rise toward $2,000. Any more gains above the $2,000 resistance zone might send the price toward the $2,120 resistance. More Losses in ETH? If Ethereum fails to clear the $1,880 resistance, it could continue to move down. Initial support on the downside is near the $1,840 level. The next major support is near the $1,820 zone. If there is a close below the $1,820 support, the price could decline toward the $1,800 support. Any more losses may perhaps send the price toward the $1,740 level or even $1,720 in the coming sessions. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is below the 50 level. Major Support Level – $1,840 Major Resistance Level – $1,880"
  }
]