[
  {
    "source": "NewsBTC",
    "date": "2023-11-15T00:10:50.000Z",
    "title": "New XRP Ledger Upgrade Goes Live, What’s New?",
    "url": "https://www.newsbtc.com/xrp-news/new-xrp-ledger-upgrade/",
    "description": "An XRP and crypto enthusiast on X (formerly Twitter) has announced the launch of the newest version of the XRP Ledger, highlighting core updates and new functionalities on the upgraded ledger.  XRP Ledger New Version XRP enthusiast, Krippenreiter has released the latest details on the newly upgraded XRP ledger on an X post on November 12. The update introduces four distinct changes incorporated into XRPL’s new version as well as four proposed amendments for the ledger.  Related Reading: Ethereum Spot ETFs: BlackRock Takes The Fight To SEC With New Filing “A new major breaking change is on its way to the XRPL ecosystem in the shape of yet another rippled version update. If all goes as planned, this new version will be available to all node operators by November 13, 2023,” Krippenreiter stated.  The community member described the new API version, APIV2, which offers more functionalities than traditional APIs. The launch of API V2 on XRPL will include the introduction of a DeliverMax feature, added error messages, and removed API methods.  Krippenreiter also described the XRP ledger’s Transaction Per Second (TPS) performance and stability. He stated that the new upgrades on this functionality were originally proposed by MarkTravis15 on X, and incorporated three changes that may improve the performance of the ledger.  These changes focus on enhancing the consensus stability, implementing asynchronous writing of batches to NuDB, and introducing periodic intervals when applying transaction batches.  Another noteworthy upgrade to the XRP Ledger is the introduction of a new RPC method which allows software apps to effectively connect to a specific network in the XRPL ecosystem by asking information from the node. Other changes in the XRP Ledger include bug fixes and refactoring or rewriting of codes to ensure better readability and efficiency.  Voting Opens For Ledger Amendments While providing details on updates in the newest version of the XRP Ledger, Krippenreiter highlighted a series of proposed amendments. These amendments, if approved by the community and subsequently implemented, may have a significant positive impact on the XRPL ecosystem.  The first amendment, originally titled federated side chains, involves bidirectional connectivity to XRPL assets. This proposal aims to open new routes for interoperability in the XRP ecosystem using witness servers like Xahau, CBDCL, and others. Related Reading: Renowned Economist Warns Of Bitcoin Crash Before Spot ETF Approvals Krippenreiter also described the second amendment which implements a sovereign identity solution on XRPL called decentralized identifiers (DID). A third amendment seeks to address the unexpected behavior of the XRPL payment engine, providing solutions that appropriately fix the problem. Finally, the last amendment will help clarify how authorized trust lines should be established and permitted. This proposal specifically focuses on situations where the issuer and user enable certain settings on their accounts. Price begins to recover after dip &#124; Source: XRPUSD on Tradingview.com Featured image from The European Business Review, chart from Tradingview.com"
  }
]