[
  {
    "source": "CoinDesk",
    "date": "2023-07-31T07:01:25.000Z",
    "title": "Binance Wins Operational License in Dubai",
    "url": "https://www.coindesk.com/policy/2023/07/31/binance-wins-operational-license-in-dubai/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Binance, the world's largest cryptocurrency exchange, has won a licence to operate in Dubai after meeting pre-conditions set since receiving a preparatory licence in September 2022."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-31T07:00:00.000Z",
    "title": "EIP-6968 Set To Enable Revenue Sharing For Ethereum",
    "url": "https://cryptodaily.co.uk/2023/07/eip-6968-set-to-enable-revenue-sharing-for-ethereum",
    "description": "<p class=\"md-end-block md-p\">An Ethereum Improvement Proposal (EIP), dubbed EIP-6968, has been proposed by Ethereum developers to facilitate decentralized application (dApp) creators to earn a share of transaction fees generated on Layer 2 (L2).</p>\n<p class=\"md-end-block md-p\">On the outset, EIP-6968 aims to introduce a new type of token, the \"Contract Secured Revenue\" (CSR), which would allow developers to claim a percentage of transaction fees generated when users interact with their smart contracts.</p>\n<p class=\"md-end-block md-p\">Kevin Owocki, one of the co-authors of the proposal, envisages this development as an opportunity for projects to band together, form an L2 around shared ideas, and share sequencer fee revenue based on who drives the most usage.</p>\nMechanism and Scaling\n<p class=\"md-end-block md-p\">Layer 2 solutions play a crucial role in enhancing the scalability of the Ethereum network. By conducting transactions off the main Ethereum blockchain (Layer 1 or L1), they mitigate network congestion and reduce transaction costs, whhich can skyrocket during peak periods. Layer 2 solutions use various methods like state channels, sidechains, and rollups, enabling faster and more efficient transaction processing. They significantly boost the tranbsaction throughput, thereby facilitating a smoother, more scalable experience for users and developers.</p>\n<p class=\"md-end-block md-p md-focus\">In terms of the relation between L2s and the EIP-6968 proposal, the former allows smart contract developers to tap into potentially lucrative revenue streams. By introducing the concept of \"Contract Secured Revenue\" (CSR), Layer 2 can incentivize developers to create and deploy their dApps on these networks, fostering innovation and community growth. It creates a positive feedback loop - the more a developer's smart contracts are used, the more transaction fees they can potentially earn. This not only motivates developers but also accelerates the overall development and scaling of the Ethereum ecosystem.</p>\nAdoption and Potential Impact\n<p class=\"md-end-block md-p\">The revenue generated from CSR could be utilized for multiple purposes, such as funding dApp development, public goods, or incentivizing developers to join a network. While Owocki initially proposed EIP-6968 in May, it has garnered increased attention following his presentation at the recent EthCC conference in Paris.</p>\n<p class=\"md-end-block md-p\">EIP-6968 promises to revolutionize the fiercely competitive Ethereum scaling sector by introducing a novel type of incentive for developers. The proposal posits using protocol rewards of L1 to fund smart contract development, a significant change from what is the current state of market mechanisms in place.</p>\n<p class=\"md-end-block md-p\">EIP-6968, viewed as a step ahead from app-chains, is designed to enable \"ecosystem-chains\" that host multiple decentralized applications. It is essentially a modified version of EIP-1559, which implemented Ethereum&rsquo;s burn mechanism back in August 2021.</p>\n<p class=\"md-end-block md-p\">The proposed upgrade could be adopted by any network that uses EIP-1559. Owocki expressed optimism about the potential traction within the L2 ecosystem, predicting a beneficial cycle where smart contract developers receive revenue for the value they contribute to L2s.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T07:06:57.000Z",
    "title": "Critical Vulnerability in Vyper Exposes DeFi Ecosystem to Stress Tests",
    "url": "https://www.cryptopolitan.com/critical-vulnerability-in-vyper-exposes-defi/",
    "description": "The decentralized finance (DeFi) ecosystem is facing a major stress test following the discovery of a critical vulnerability in versions 0.2.15, 0.2.16, and 0.3.0 of the Vyper programming language. The vulnerability allowed malicious actors to exploit a malfunctioning reentrancy lock, resulting in the theft of millions of dollars worth of cryptocurrencies on July 30. The ... <a title=\"Critical Vulnerability in Vyper Exposes DeFi Ecosystem to Stress Tests\" class=\"read-more\" href=\"https://www.cryptopolitan.com/critical-vulnerability-in-vyper-exposes-defi/\" aria-label=\"More on Critical Vulnerability in Vyper Exposes DeFi Ecosystem to Stress Tests\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T06:51:25.000Z",
    "title": "Curve Finance pools hit hard as Vyper exploit leads to losses of $24M",
    "url": "https://www.cryptopolitan.com/curve-finance-pools-24m-exploit/",
    "description": "In a shocking turn of events, several stable pools on Curve Finance, along with other decentralized finance (DeFi) projects, fell victim to a devastating exploit on July 30, causing losses amounting to $24 million at the time of reporting. The exploit was traced back to vulnerabilities in specific versions of the Vyper compiler, with versions ... <a title=\"Curve Finance pools hit hard as Vyper exploit leads to losses of $24M\" class=\"read-more\" href=\"https://www.cryptopolitan.com/curve-finance-pools-24m-exploit/\" aria-label=\"More on Curve Finance pools hit hard as Vyper exploit leads to losses of $24M\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T06:47:13.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.1227, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 4.89% decrease. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-31T06:55:29.000Z",
    "title": "Bitcoin Miner Reserve Rising: Good News For BTC Bulls?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-miner-reserve-rising-good-news-for-btc-bulls/",
    "description": "Bitcoin prices have been stagnant, trading below the psychological $30,000 level. The coin is technically under pressure, declining from its peaks of around $31,800 recorded in early July 2023. Amid this development, on-chain data reveals that the Bitcoin miner reserve has been increasing, notwithstanding prevailing market conditions, bouncing back from May 2023 lows. According to data from CryptoQuant, the BTC miner reserve stands at 1.841 million as of July 30, up from 1.826 million on May 27. Bitcoin Miner Reserve Rising The increasing BTC miner reserve and relatively stable and steady coin prices suggest a sense of optimism among miners. This could improve sentiment and confidence among miners, possibly boosting prices and preventing sellers from pressing the coin even lower. Presently, as mentioned earlier, BTC is trending below $30,000. In crypto, the Bitcoin miner reserve measures all BTC in the hands of all miners and mining pools. It shows the total number of BTC that is yet to be liquidated. Price-wise, this is important. Miners frequently sell their coins to cover operational costs and realize profits. Therefore, trackers often monitor their trading patterns for valuable insights into market sentiment. Related Reading: Shibarium Hype: Shiba Inu Whales Boost Appetite, Snag 1 Trillion SHIB Tokens Bitcoin miner reserve trends are important for traders. However, other critical factors could influence prices in future sessions, some of which might have adverse effects. One key consideration is how different countries decide to regulate cryptocurrencies, including Bitcoin, as their move can impact liquidity and investor perception.  Regulation, Energy Consumption Criticism Negative For Prices In the United States, for instance, the approval or rejection of a Bitcoin Spot ETF by the Securities and Exchange Commission (SEC) could significantly affect Bitcoin&#8217;s price in the months ahead. The approval of a Bitcoin ETF would enable institutional players to include Bitcoin in their portfolios, injecting capital into the crypto markets and potentially increasing liquidity. Currently, Grayscale&#8217;s GBTC, a close-ended trust, allows institutions to get exposure to Bitcoin without directly buying BTC.  Related Reading: Here’s How Long The Majority Of New Ethereum Wallets Are Used Before They’re Dumped Beyond price-related factors, Bitcoin&#8217;s proof-of-work network has faced criticism for its substantial energy consumption to power its operations. In response to environmental concerns, China banned Bitcoin and crypto mining activities, resulting in a drop in the network&#8217;s hash rate and negatively impacting BTC prices. Whether the US and Europe will follow a similar path in the future could also have implications for Bitcoin&#8217;s price trajectory. Featured image from Canva, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-31T07:01:44.000Z",
    "title": "Solana (SOL) Soars with Perfect Uptime in Q2 2023 – Analysts Forecast A Stellar Performance for DigiToads (TOADS)",
    "url": "https://www.crypto-news-flash.com/solana-sol-soars-with-perfect-uptime-in-q2-2023-analysts-forecast-a-stellar-performance-for-digitoads-toads/?utm_source=rss&utm_medium=rss&utm_campaign=solana-sol-soars-with-perfect-uptime-in-q2-2023-analysts-forecast-a-stellar-performance-for-digitoads-toads",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T094500.189.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T094500.189.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T094500.189-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Solana (SOL), a prominent player in the crypto space, has been on a soaring trajectory in Q2 2023, showcasing remarkable enhancements in network uptime and reliability. Solana&#8217;s network performance has impressed analysts and investors alike. The latest report reflects Solana&#8217;s stellar performance, boasting a 100% uptime since February 25, making it an entire Q2 2023 [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-31T07:04:30.000Z",
    "title": "Parabolic Advance Coming for Bitcoin (BTC), Says Crypto Strategist – Here Are His Massive Targets",
    "url": "https://dailyhodl.com/2023/07/31/parabolic-advance-coming-for-bitcoin-btc-says-crypto-strategist-here-are-his-massive-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Dad-Author-Predicts-Bitcoin-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Dad-Author-Predicts-Bitcoin-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/Dad-Author-Predicts-Bitcoin-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Dad-Author-Predicts-Bitcoin-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Dad-Author-Predicts-Bitcoin-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Dad-Author-Predicts-Bitcoin-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Dad-Author-Predicts-Bitcoin-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says that Bitcoin (BTC) is on the verge of igniting steep rallies that could send the flagship digital asset to a new all-time high before the year expires. In a new video, pseudonymous analyst Credible Crypto tells his 343,200 Twitter followers that Bitcoin is currently witnessing a five-wave uptrend. Specifically, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/31/parabolic-advance-coming-for-bitcoin-btc-says-crypto-strategist-here-are-his-massive-targets/\">Parabolic Advance Coming for Bitcoin (BTC), Says Crypto Strategist – Here Are His Massive Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]