[
  {
    "source": "Cointelegraph",
    "date": "2023-09-01T19:25:00.000Z",
    "title": "Balancer protocol exploited for $900K as DeFi hacks mount: Finance Redefined",
    "url": "https://cointelegraph.com/news/balancer-protocol-exploited-for-900k-as-defi-hacks-mount-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/367b270c-e542-41ab-847d-193b7f64aac6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>DeFi exploits resulted in losses of over $16 million in August.</p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>In this week’s newsletter, Ethereum staking services have agreed upon a 22% limit on all validators to ensure fair markets. August proved to be another costly month for DeFi as several protocols were collectively exploited for $16 million. In separate exploit news, Balancer protocol lost nearly $900,000 due to a vulnerability flagged months ago.</p><p>Shibarium’s second launch proved more stable as the layer-2 protocol already has over 100,000 new wallets, and USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) is set to debut on Coinbase’s layer-2 platform later this week.</p><p>The DeFi market had another late-week bearish decline due to an overall market fall after news dropped of a delay in the decision on approval of a spot Bitcoin’s spot exchange-traded fund (ETF). Most DeFi tokens traded in the red, and the total value locked in DeFi tokens remained below $50 billion.</p><h2>Ethereum staking services agree to a 22% limit for all validators</h2><p>At least five Ethereum liquid staking providers have either imposed or are working to impose a self-limit rule in which they promise not to own more than 22% of the Ethereum staking market — in a move seen as ensuring the Ethereum network remains decentralized.</p><p>Among the Ethereum staking providers either already committed or working to commit to the self-limit rule are Rocket Pool, StakeWise, Stader Labs and Diva Staking, according to Ethereum core developer Superphiz.</p><p><a href=\"https://cointelegraph.com/news/ethereum-staking-services-agree-self-limit-validators\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ethereum-staking-services-agree-self-limit-validators/amp\"><strong>Continue reading</strong></a></p><h2>$16 million in crypto lost to DeFi hacks in August: Report</h2><p>In August, $15.8 million in cryptocurrencies was lost in DeFi hacks and exploits, specifically. According to an Aug. 31 report by blockchain security firm Immunfi, a combined $23.4 million in crypto was lost to a combination of hacks, exploits and fraud, a significant decrease compared with the $320.5 million lost in July. All exploits consisted of attacks against DeFi protocols, and not a single incident affected centralized finance entities. </p><p>Five of the 21 security incidents reported occurred on the Ethereum blockchain, while four occurred on the BNB Chain. Coinbase’s highly anticipated layer-2 solution, Base, experienced four security exploits shortly after its launch on Aug. 9. </p><p><a href=\"https://cointelegraph.com/news/16-million-crypto-lost-hacks-august\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/16-million-crypto-lost-hacks-august/amp\"><strong>Continue reading</strong></a></p><h2>Balancer exploited for close to $900,000 after vulnerability warning</h2><p>Ethereum automated market maker and DeFi protocol Balancer was exploited for nearly $900,000, the company confirmed on X (formerly Twitter) on Aug. 27, just days after disclosing a vulnerability that affected several pools.</p><p>An Ethereum address allegedly belonging to the attacker has been revealed by blockchain security expert Meier Dolev. Following the exploit, the address received two transfers of Dai (<a href=\"https://cointelegraph.com/dai-price-index\">DAI</a>) stablecoin worth $636,812 and $257,527, respectively, bringing its total balance to over $893,978.</p><p><a href=\"https://cointelegraph.com/news/balancer-exploited-900k-after-vulnerability-warning\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/balancer-exploited-900k-after-vulnerability-warning/amp\"><strong>Continue reading</strong></a></p><h2>USDC will launch natively on Base network — Jeremy Allaire</h2><p>Circle’s United States dollar stablecoin, USDC, will launch natively on the Base network “next week,” according to an Aug. 29 social media post from CEO Jeremy Allaire. The new version will replace the current USD Base Coin (USDbC) that most users rely on as a substitute.</p><p>Coinbase’s Base network <a href=\"https://cointelegraph.com/news/coinbase-base-network-officially-launched-heres-how-it-can-be-used\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinbase-base-network-officially-launched-heres-how-it-can-be-used/amp\">launched on Aug. 9</a>. At the time, no native version of USDC existed on the network. Users could not deposit cash into a Circle account and receive equivalent USDC on Base. To solve this problem, the Base team allowed users to bridge USDC from Ethereum via an official bridge app. The token issued by the bridge is called “USDbC” and is backed by native USDC locked on the Ethereum network.</p><p><a href=\"https://cointelegraph.com/news/circle-usdc-will-launch-natively-base-next-week-jeremy-allaire\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/circle-usdc-will-launch-natively-base-next-week-jeremy-allaire/amp\"><strong>Continue reading</strong></a></p><h2>Shibarium wallets surpass 100,000 after SHIB devs relaunch bridge</h2><p>Shibarium, a new layer-2 network for the Shiba Inu (<a href=\"https://cointelegraph.com/shiba-inu-price-index\">SHIB</a>) token, has surpassed 100,000 wallets on its platform, with 35,000 coming within 24 hours of Shibarium’s relaunch on Aug. 28. Shytoshi Kusama, the lead developer and co-founder of Shiba Inu, confirmed Shibarium was back up and running in an Aug. 28 blog post.</p><p>At the time, Kusama noted that Shibarium tallied 65,000 wallets across 350,000 transactions — however, those figures have rocketed upward since, increasing 55.8% and 20.2%, respectively, according to Shibariumscan.io.</p><h2>Continue reading</h2><h2>DeFi market overview</h2><p>Data from <a href=\"https://pro.cointelegraph.com/users/sign_in?\">Cointelegraph Markets Pro</a> and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bearish week, with most tokens trading in the red on the weekly charts. The total value locked into DeFi protocols touched $49.25 billion.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/afbecd34-e848-4f48-a1a6-0da3b37f2ed7.png\"></figure><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p>\n\n</p>\n                \n            "
  }
]