[
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T01:58:00.000Z",
    "title": "Crypto is in ‘arms race’ against AI-powered scams: Quantstamp co-founder ",
    "url": "https://cointelegraph.com/news/crypto-scams-more-sophisticated-with-ai-arms-race-quantstamp-richard-ma",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/ef51a35b-b316-4787-9333-9014012a43a3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Quantstamp's Richard Ma explained that the coming surge in “sophisticated” AI phishing scams could pose an existential threat to crypto organizations.</p>\n                    <p><p>With the field of artificial intelligence evolving at near breakneck speed, scammers now have access to tools that can help them execute highly sophisticated attacks en masse, warns the co-founder of Web3 security firm Quantstamp.</p><p>Speaking to Cointelegraph at <a href=\"https://cointelegraph.com/press-releases/korea-blockchain-week-2023-asias-most-impactful-blockchain-conference-presents-web3s-leading-voices\">Korea Blockchain Week</a>, Quantstamp's Richard Ma explained that while social engineering attacks have been around for some time, AI is helping hackers become “a lot more convincing” and increase the success rate of their attacks. </p><p>To illustrate what the new generation of AI-powered attacks look like, Ma recalled what happened to one of Quantstamp’s clients, where an attacker pretended to be the CTO of the targeted firm. </p><p>“He began messaging one of the other engineers in the company, saying ‘hey, we have this emergency, here's what's going on’ and engaging them in a bunch of conversations before asking them for anything,” said Ma. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Apparently there’s an increase in person specific targeted scams, rather than just playing numbers game… using AI and ChatGPT scammers can write code fast, and new tech means it’s more profitable for attackers until software is created to fight back.<br>The elderly are the targets</p>&mdash; MoistenedTart.blsky.social (@MoistenedTart) <a href=\"https://twitter.com/MoistenedTart/status/1697113027055874227?ref_src=twsrc%5Etfw\">August 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ma said these added steps add a layer of complexity to attacks that make the possibility of someone handing over important information a lot more likely. </p><blockquote>“Before AI, [scammers] might just ask you for a gift card or to pay them Bitcoin because it's an emergency. Now they do a lot more extra steps in the conversation beforehand to establish legitimacy.\"</blockquote><p>Ultimately, Ma said the most existential threat introduced by sophisticated AI is the sheer scale at which these types of attacks can be executed. </p><p>By leveraging automated AI systems, attackers could be spinning up social engineering attacks and other advanced scams across thousands of different organizations with very little in the way of human involvement. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">How are AI Chat and ChatGPT scams affecting the markets? <br><br>Find out from The Market Report hosts Sam Bourgi (<a href=\"https://twitter.com/forgeforth_?ref_src=twsrc%5Etfw\">@forgeforth_</a>) and Marcel Pechman (<a href=\"https://twitter.com/noshitcoins?ref_src=twsrc%5Etfw\">@noshitcoins</a>) on our latest episode: <a href=\"https://t.co/wrfGQC0aO4\">https://t.co/wrfGQC0aO4</a> <a href=\"https://t.co/kHH6hcisd9\">pic.twitter.com/kHH6hcisd9</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1630296915555373056?ref_src=twsrc%5Etfw\">February 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“In crypto, there's a lot of databases with all the contact information for the key people from each project. Once the hackers have access to that, they can have an AI that messages all of these people in different ways,” he said. </p><blockquote>“It's pretty hard to train your whole company to be able to not respond to those things.”</blockquote><p>While the scale and complexity of AI-powered scams may seem intimidating, Ma offered some straightforward advice to individuals and organizations looking to protect themselves. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-scams-rise-of-artificial-intelligence\"><strong><em>Crypto scams are going to ramp up with the rise of AI</em></strong></a></p><p>The most important protective measure is to avoid sending any sensitive information via email or text. Ma said that organizations should move to localize all communication of important data to Slack or other internal channels. </p><blockquote>“As a general rule, stick to the company’s internal communication channel and double check everything.”</blockquote><p>Finally, Ma said that companies should invest in anti-phishing software that filters automated emails from bots and AI. He said that Quantstamp utilize anti-phishing software from a company called IronScales, which offers email-based security services.</p><blockquote>“We're just at the start of this arms race, and it's only going to get harder to distinguish between humans and convincing AI.”</blockquote><p><strong><em>AI Eye: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-apple-devloping-pocket-ai-deep-fake-music-deal-hypnotize-gpt-4/\"><strong><em>Apple developing pocket AI, deep fake music deal, hypnotizing GPT-4</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  }
]