[
  {
    "source": "CoinDesk",
    "date": "2023-07-04T01:59:37.000Z",
    "title": "Gemini's Cameron Winklevoss Tweets $1.5B 'Final Offer' in Debt Talks Over Crypto Firm Genesis",
    "url": "https://www.coindesk.com/business/2023/07/04/geminis-cameron-winklevoss-tweets-15b-final-offer-in-debt-talks-over-crypto-firm-genesis/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Creditors of the crypto financial firm Genesis call for $1.5 billion of forbearance payments and loans denominated in dollars, bitcoin and ether, according to a term sheet posted on Twitter by the Gemini co-founder."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-04T01:52:45.000Z",
    "title": "First Mover Asia: Bitcoin Crosses $31K After Spot BTC ETF Issuers Begin Refiling",
    "url": "https://www.coindesk.com/markets/2023/07/04/first-mover-asia-bitcoin-crosses-31k-after-spot-btc-etf-issuers-begin-refiling/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "PLUS: The first half of 2023 has so far been very promising for crypto majors."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-04T02:00:43.000Z",
    "title": "Singapore Implements New Crypto Regulations Targeting Custody, Lending, Staking",
    "url": "https://news.bitcoin.com/singapore-implements-new-crypto-regulations-targeting-custody-lending-staking/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/singapore-new-rules-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Singapore Implements New Crypto Regulations Targeting Custody, Lending, Staking\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/singapore-new-rules-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/singapore-new-rules-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/singapore-new-rules-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/singapore-new-rules-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/singapore-new-rules-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/singapore-new-rules-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/singapore-new-rules.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Singapore has implemented new regulations for crypto service providers in a bid to enhance investor protection and maintain market integrity within the cryptocurrency industry. The Monetary Authority of Singapore (MAS) will also restrict lending and staking activities facilitated by crypto service providers for their retail customers. Singapore Has New Crypto Rules The Monetary Authority of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-04T02:00:40.000Z",
    "title": "Cardano, Solana, Polygon Gains Despite Revolut Plans To Delist",
    "url": "https://www.newsbtc.com/altcoin/cardano-solana-polygon-gains-despite-revolut-plans-to-delist/",
    "description": "Despite Revolut, a platform that provides numerous services, including banking and crypto trading, planning to delist Cardano (ADA), Solana (SOL), and Polygon (MATIC) from its trading platform in the United States by September 18, the three coins have started July firmly, bottoming up from June 2023 lows. As an illustration, SOL is up roughly 50% from June 2023 lows when it had sunk to as low as $13. Meanwhile, ADA has soared 17% while MATIC is up 25% in the past two weeks, reading from the performance in the daily chart. Cardano, Solana, Polygon Prices Firm While their prices are relatively firm but in a bearish formation considering the sharp losses in June 2023, the three coins are still some of the most liquid in crypto. ADA, for instance, is perched at seventh, trailing XRP. The coin has a market capitalization of $10.2 billion and is in the top 10.  Related Reading: Shiba Inu Leads With Highest Number of Fake Twitter Followers, Data Reveals SOL is also at 10th in the market capitalization leaderboard with a market capitalization of $7.6 billion. On the other hand, MATIC is steady, in an uptrend, adding 6.3% in the last trading week. Polygon had a market capitalization of $6.5 billion when writing on July 3.  The cryptocurrencies that Revolut intends to delist have high liquidity and can be traded on major global exchanges such as Binance and KuCoin, even at their current valuations. In an email, Revolut said clients in the United States would be barred from trading the three tokens and have to sell their assets by September 18. Specifically, Revolut cited shifting laws around cryptocurrencies in the United States. The email read in part: Our US crypto services provider has decided to delist these tokens due to the changing laws and regulations around cryptocurrency in the US. Because of this, we’ll no longer be able to process your buy and sell orders for these tokens. SEC Alleges ADA, SOL, And MATIC Are Unregistered Securities While the United States Securities and Exchange Commission (SEC) cited SOL, ADA, MATIC, and other coins, including Algorand (ALGO), as examples of unregistered securities, forcing several providers in the country to remove them from their platforms. Revolut also appears to be following in the steps of Baktt, a digital asset platform founded by Intercontinental Exchange (ICE). Days after the SEC’s comments, the platform said they would stop supporting the three coins mid-June. Related Reading: Maker (MKR) Gains 30% In 7 Days, What’s Next? While using Coinbase and Binance, the SEC alleged that several coins, including ADA, were unregistered securities, forcing sharp price contracts in the first half of June. In the United States, crypto assets classified as securities are subject to tighter regulatory requirements.  Feature image from Canva, chart from TradingView"
  }
]