[
  {
    "source": "BTCManager",
    "date": "2023-06-10T09:11:43.000Z",
    "title": "An 8-year vulnerability affecting Bitcoin signing process identified, over 900 addresses affected",
    "url": "https://crypto.news/an-8-year-vulnerability-affecting-bitcoin-signing-process-identified-over-900-addresses-affected/",
    "description": "A new research finding has picked out vulnerabilities in the new class of Bitcoin ECDSA signature that entities have used to steal over 222 bitcoin (BTC) over the years"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-10T09:14:03.000Z",
    "title": "Bleak Dogecoin (DOGE) Social Sentiment Raises Questions About Price Reversal",
    "url": "https://www.newsbtc.com/news/dogecoin-experiences-bleak-social-sentiment/",
    "description": "Dogecoin (DOGE) has recently found itself at the center of a storm caused by the US Securities and Exchange Commission&#8217;s (SEC) lawsuit against major exchanges Binance and Coinbase. As media outlets spread fear, uncertainty, and doubt regarding the legal proceedings, the market capitalization of this meme coin has experienced a significant drop. However, despite the turbulence, on-chain data reveals that the long-term loyalists of the Dogecoin community remain resolute in their support. In the face of the dwindling media mentions and the calming of the storm, a compelling question arises: could this be the opportune moment for bullish investors to seize the dip and spur yet another impressive price rebound for DOGE? Related Reading: Cardano (ADA) Faces Obstacles In Reaching Key Level In June – Here’s Why Dogecoin (DOGE) Holders Show Resilience Amidst Market Turbulence According to detailed on-chain analysis, it appears that the recent sell-offs and price drops in DOGE were primarily driven by short-term traders rather than committed long-term holders. A comprehensive Santiment chart illustrates this phenomenon, showcasing a notable increase in Mean Coin Age within the Dogecoin ecosystem during the same period when massive sell-offs occurred. DOGE Mean Coin Age. Source: Santiment Examining the data between June 1 and June 9, the Mean Coin Age for DOGE has experienced a 5% increase, rising from 54,317 to 57,219. This upward trend in Mean Coin Age during a period of price retracement serves as a promising signal, indicating growing confidence among long-term DOGE holders. Remarkably, approximately 70% of the total circulating Dogecoin supply is currently held by steadfast long-term investors who have held their positions for more than a year. With such a significant portion of DOGE in the hands of committed holders, it follows logically that if they continue to hold onto their coins, the price of DOGE is likely to rebound in the near future. DOGE Social Volume Down: Potential Opportunity For Bullish Investors? Over a span of just four days, from June 5 to June 9, the Social Volume of DOGE has witnessed a staggering decline of 72%, plummeting from 8,219 mentions to 2,308. Santiment&#8217;s Social Volume metric serves as a reliable indicator of market sentiment by tracking the frequency of a project&#8217;s mentions across various channels, including Twitter and relevant crypto-media platforms. DOGE Social Volume. Source: Santiment When Social Volume experiences a substantial decrease like the one observed above, it signifies that many stakeholders are currently overlooking the asset. This situation presents an opportunity for strategic investors seeking to capitalize on market bottoms. It is common for bullish investors to strategically enter the market when sentiment hits a new low, aiming to purchase assets at their lowest possible value. $doge is like 🚀🚀🚀🚀🚀 today , a little promising and defying the gravity pic.twitter.com/zHNj0BvHcU — THOMAS (@thomasnegeri) June 9, 2023 Interpreting this drop in Social Volume as a potential turning point for the DOGE price dip, optimistic investors may consider this as an encouraging signal. If this bullish outlook materializes, the crypto community believes that DOGE will regain its upward momentum and ascend the charts once again in the days to come. Source: Coingecko As of now, CoinGecko reports the current price of DOGE at $0.060480, down 11.3% in the past 24 hours. The cryptocurrency has likewise experienced a decline of 16.7% over the course of the last seven days. Featured image from Getty Images"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-10T09:15:53.000Z",
    "title": "Shiba Inu Whale Abruptly Moves 4,000,379,151,023 SHIB in Massive Transaction – Here’s Where the Crypto Is Going",
    "url": "https://dailyhodl.com/2023/06/10/shiba-inu-whale-abruptly-moves-4000379151023-shib-in-massive-transaction-heres-where-the-crypto-is-going/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/mysterious-whale-shib-massive.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/mysterious-whale-shib-massive.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/mysterious-whale-shib-massive.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/mysterious-whale-shib-massive.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/mysterious-whale-shib-massive.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/mysterious-whale-shib-massive.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/mysterious-whale-shib-massive.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An unknown crypto whale is suddenly moving trillions of Shiba Inu (SHIB) tokens as the top memecoin dipped this week. Blockchain-tracking service Whale Alert notices that a deep-pocketed entity moved a total of 4,000,379,151,023 SHIB worth $31.7 million from Shiba Staking to the top global crypto exchange Binance. Shiba Inu was trading for about $0.00000792 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/10/shiba-inu-whale-abruptly-moves-4000379151023-shib-in-massive-transaction-heres-where-the-crypto-is-going/\">Shiba Inu Whale Abruptly Moves 4,000,379,151,023 SHIB in Massive Transaction – Here’s Where the Crypto Is Going</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]