[
  {
    "source": "CoinDesk",
    "date": "2023-10-10T21:46:41.000Z",
    "title": "Protocol Village: Spark Protocol Expands Beyond Ethereum to Gnosis",
    "url": "https://www.coindesk.com/tech/2023/10/09/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the week of Oct. 9-15, with live updates throughout."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-10T22:01:02.000Z",
    "title": "Amazon and Immutable Want to Make it Easier to Launch Crypto Games",
    "url": "https://decrypt.co/200895/immutable-amazon-web-services-team-up-help-blockchain-games-scale",
    "description": "Crypto firm Immutable has joined Amazon Web Services' ISV Accelerate Program to develop blockchain gaming infrastructure solutions."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-10T21:57:07.000Z",
    "title": "BAPE Bets on Virtual Pet Nostalgia With Tamagotchi Streetwear Collab",
    "url": "https://decrypt.co/200933/tamagotchi-bathing-ape-bape-bandai-virtual-pets-streetwear",
    "description": "A Bathing Ape (BAPE) and Bandai’s classic Tamagotchi brand are teaming up for a fashion drop and co-branded virtual pets."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-10T21:40:58.000Z",
    "title": "Environmental Groups Need to Dig Deeper Into AI Energy Use, Researcher Says",
    "url": "https://decrypt.co/200932/ai-energy-use-environmental-concerns-crypto-mining",
    "description": "Energy analyst Alex de Vries says limited data is one reason there was a slow response to the emerging threat."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-10T22:05:49.000Z",
    "title": "Changpeng Zhao and other Binance executives facing possible indictments in Brazil",
    "url": "https://cryptoslate.com/changpeng-zhao-and-other-binance-executives-facing-possible-indictments-in-brazil/",
    "description": "<p>A Brazilian congressional committee has asked for Binance CEO Changpeng Zhao and three other company executives to be indicted, Bloomberg said on Oct. 10. Following the committee&#8217;s recommendations, the decision to indict Zhao and the other company executives now lies with the Brazilian police. The committee alleged that Zhao and the other executives have engaged [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/changpeng-zhao-and-other-binance-executives-facing-possible-indictments-in-brazil/\">Changpeng Zhao and other Binance executives facing possible indictments in Brazil</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-10T21:47:40.000Z",
    "title": "U.S. grocery chain Trader Joe’s sues DeFi platform Trader Joe for IP infringement",
    "url": "https://cryptoslate.com/u-s-grocery-chain-trader-joes-sues-defi-platform-trader-joe-for-ip-infringement/",
    "description": "<p>The well-known grocery store chain Trader Joe&#8217;s has initiated a lawsuit against a cryptocurrency-based Decentralized Finance (DeFi) platform, also named Trader Joe, as revealed in U.S. court filings dated Oct. 5. Trader Joe&#8217;s alleges that the creators of the DeFi platform named their service &#8220;after the supermarket,&#8221; directly quoting a newsletter that still exists online. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/u-s-grocery-chain-trader-joes-sues-defi-platform-trader-joe-for-ip-infringement/\">U.S. grocery chain Trader Joe&#8217;s sues DeFi platform Trader Joe for IP infringement</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-10T22:00:20.000Z",
    "title": "Inside Caroline Ellison’s Explosive Testimony — Former Alameda CEO Accuses SBF of Directing Fraud at FTX",
    "url": "https://news.bitcoin.com/inside-caroline-ellisons-explosive-testimony-former-alameda-ceo-accuses-sbf-of-directing-fraud-at-ftx/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellisobbbbbnnn-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Inside Caroline Ellison&#039;s Explosive Testimony — Former Alameda CEO Accuses SBF of Directing Fraud at FTX\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellisobbbbbnnn-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellisobbbbbnnn-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellisobbbbbnnn-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellisobbbbbnnn-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellisobbbbbnnn-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellisobbbbbnnn-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ellisobbbbbnnn.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In bombshell testimony on Tuesday, Caroline Ellison, former CEO of Alameda Research, accused Sam Bankman-Fried of directing her and others to commit fraud under his leadership at FTX and Alameda. Taking the stand in a red dress, Ellison stated &#8220;Alameda took several billions of dollars from FTX customers and used it for investments.&#8221; Caroline Ellison [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-10T21:58:44.000Z",
    "title": "FTX founder Sam Bankman-Fried’s trial day 5: Recap",
    "url": "https://crypto.news/ftx-founder-sam-bankman-frieds-trial-day-5-recap/",
    "description": "Bankman-Fried's girlfriend and Alameda's ex-CEO took the stand on the second week of the trial, revealing that SBF used customer funds for political lobbying."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-10T22:00:04.000Z",
    "title": "How Hamas Lost its Crypto In An Israeli Operation, Binance Supports Security Forces",
    "url": "https://www.newsbtc.com/news/how-hamas-lost-its-crypto-in-an-israeli-operation-binance-supports-security-forces/",
    "description": "Israeli law enforcement launched an operation targeting crypto addresses associated with the terrorist group Hamas. The country suffered an attack this past Sunday, leading to deaths and many civilians disappearing. Related Reading: Binance Faces Scrutiny Over Alleged ICO Missteps And Token Distribution Discrepancies Binance And Israel Work Together To Freeze Crypto A local news media Calculist report confirmed an operation led by the Israeli Police Department and the National Counterterrorism Headquarters, part of the Ministry of Defense. The operation was supported by the world’s largest crypto exchange, Binance. During the operation, the law enforcement agencies discovered funds raised by the terrorist group via crypto donations. The investigation led the cyber unit from the Israeli Police to the crypto trading venue. The terrorist group launched the campaign in the past few days. The law enforcement agencies claimed that Hamas used the attention from Sunday’s attack to raise money from radicals and supporters worldwide. The terrorist group, the report claims, turned to social media platforms to launch the campaign. A spokesperson for the law enforcement agencies told Calculist the following regarding the events: As the war broke out, Hamas launched a fundraising campaign on social networks, asking the public to deposit crypto into its account. The cyber unit and the NSC have been working immediately to locate and freeze the accounts, assisted by the Crypto Exchange (Binance), to freeze the funds (…). The report claims that Binance has been aware of Hamas&#8217;s operation on its platform. In a separate report from CoinDesk, some data suggests previous cooperation between Binance and Israeli law enforcement. The company helped Israel to freeze almost 200 accounts connected to Hamas and other terrorist groups. A spokesperson for the crypto exchange told CoinDesk: Over the past few days, our team has been working in real-time, around the clock to support ongoing efforts to combat terror financing. We are committed to ensuring the safety and security not just of the blockchain ecosystem, but also the global community, through our proactive work. Following the events of the past Sunday, the conflict between Israel and Hamas escalated. The nation-state declared war on the terrorist organization and appeared to be preparing to increase its offensive on the Gaza Strip in response to the terrorist group. Related Reading: Binance CEO Foresees Monumental Bitcoin Price Shift Following Halving In this context, the cooperation between Binance and local enforcement seems likely to increase. Israel will fight Hamas across all sectors, including the nascent industry and its related companies and tools. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-10T22:01:22.000Z",
    "title": "Bitcoin Whale Abruptly Moves 3,000 BTC Worth Over $83,000,000 After Six Years of Dormancy: On-Chain Data",
    "url": "https://dailyhodl.com/2023/10/10/bitcoin-whale-abruptly-moves-3000-btc-worth-over-83000000-after-six-years-of-dormancy-on-chain-data/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Sight-As-BTC-Flashes.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Sight-As-BTC-Flashes.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Sight-As-BTC-Flashes.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Sight-As-BTC-Flashes.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Sight-As-BTC-Flashes.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Sight-As-BTC-Flashes.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Sight-As-BTC-Flashes.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A mysterious Bitcoin whale has suddenly moved 3,000 BTC worth over $80 million after sitting quietly on their coins since 2017. Data from blockchain tracking firm Arkham Intelligence shows the whale beginning to accumulate in 2016, grabbing 3301 BTC in May of that year. The entity later sold 200 BTC in September of 2017, when [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/10/bitcoin-whale-abruptly-moves-3000-btc-worth-over-83000000-after-six-years-of-dormancy-on-chain-data/\">Bitcoin Whale Abruptly Moves 3,000 BTC Worth Over $83,000,000 After Six Years of Dormancy: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]