[
  {
    "source": "Decrypt",
    "date": "2023-11-09T19:49:22.000Z",
    "title": "A Bitcoin Dev’s Bot Bucked BRC-20s—Now He Might Share ‘The Sophon’ With the World",
    "url": "https://decrypt.co/205377/a-bitcoin-devs-bot-bucked-brc-20s-now-he-might-share-the-sophon-with-the-world",
    "description": "Text-based inscriptions associated with BRC-20s plummeted 72% after the code was unleashed. There's signs someone is running a copy of it."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T20:01:14.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "http://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Asset manager BlackRock has registered an Ethereum trust in the state of Delaware. Meanwhile, Bitcoin briefly topped $37,000 for the first time in 18 months and spot Bitcoin ETFs are entering a short eight-day window that would allow all 12 to be approved.</p><h3>BlackRock registers iShares Ethereum Trust</h3><p>U.S. asset manager BlackRock has made the first step in filing for a spot Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) ETF. </p><p>On Nov. 9, the asset manager <a href=\"https://cointelegraph.com/news/blackrock-ishares-ethereum-trust-registered-delaware\">registered an Ethereum trust</a> in the American state of Delaware, with Daniel Schweiger registered as the agent. According to his LinkedIn account, Schweiger is a managing director at BlackRock. The new entity is called iShares Ethereum Trust. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BlackRock has made first step towards filing for a spot Ether ETF. I just confirmed on the website myself. Nice catch by <a href=\"https://twitter.com/SummersThings?ref_src=twsrc%5Etfw\">@SummersThings</a> <a href=\"https://t.co/mLKIhKdiI6\">https://t.co/mLKIhKdiI6</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1722632267032613146?ref_src=twsrc%5Etfw\">November 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ether's price soared on the news, eclipsing $2,000 for the first time since April.</p><p>BlackRock appears to be broadening its efforts in the crypto space. In June, it registered its Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) trust <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">shortly before filing</a> with the U.S. Securities and Exchange Commission for a spot Bitcoin ETF. </p><h3>Bitcoin briefly tops $37k amid market optimism for pending spot ETF approvals </h3><p>Bitcoin briefly surpassed the $37,000 mark for the first time in 18 months as the wider markets reflect optimism over the pending approval of spot BTC exchange-traded funds in the United States.</p><p>Data from a number of cryptocurrency market platforms, including Cointelegraph Markets Pro and TradingView, showed BTC/USD hitting $37,073 at 07:47 EST on Nov. 9 before retracing below the mark.</p><p>Bitcoin’s most recent price surge has been attributed to the pending approval of 12 separate spot Bitcoin ETFs over the next week. According to Bloomberg ETF analysts James Seyffart and Eric Balchunas, the SEC has a window up until Nov. 17 to approve a number of high-profile offerings from prominent U.S. fund managers.</p><p>While there is much fanfare over the potential approval of these highly-anticipated BTC products, both analysts have also noted that there could be a lag time of a month or more before these offerings actually launch.</p><h3>SEC’s first window to approve all 12 spot Bitcoin ETFs to begin today</h3><p>The United States Securities and Exchange Commission <a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-window-sec-bloomberg-analysts\">could approve all 12 of the pending spot Bitcoin exchange traded fund (ETF) applications</a> within the next eight days. </p><p>Bloomberg ETF analysts James Seyffart and Eric Balchunas wrote that starting from Nov. 9 in the United States, the SEC has a “window” to approve all 12 spot Bitcoin ETF filings — including <a href=\"https://cointelegraph.com/news/grayscale-new-spot-bitcoin-etf-nyse\">Grayscale’s conversion of its GBTC</a> trust product — in the days leading up to Nov. 17, but stressed this was only a possibility.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">New Research note from me today. We still believe 90% chance by Jan 10 for spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ETF approvals. But if it comes earlier we are entering a window where a wave of approval orders for all the current applicants *COULD* occur <a href=\"https://t.co/u6dBva1ytD\">pic.twitter.com/u6dBva1ytD</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1722321412218638632?ref_src=twsrc%5Etfw\">November 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The reason for this brief window is that <a href=\"https://cointelegraph.com/news/sec-punts-ark21shares-spot-bitcoin-etf-opens-proposal-comments\">when the SEC extended the deadline</a> for a number of the pending spot Bitcoin ETF filings, it selected Nov. 8 as the last day of the comment period.</p><p>From Nov. 17, the comment period for 3 filings, including Global X Bitcoin Trust, Hashdex Bitcoin ETF and Franklin Bitcoin ETF would recommence, meaning that they wouldn’t be approved or denied until after Nov. 23 at the earliest.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T19:42:00.000Z",
    "title": "Web3 social media to disrupt a $100B market: Pop Social joins Cointelegraph Accelerator",
    "url": "http://cointelegraph.com/news/web3-social-media-to-disrupt-a-100b-market-pop-social-joins-cointelegraph-accelerator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/5d5b9ab22ab4f2b9e1b99253c9e4208a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Web3 social media dApp Pop Social becomes the newest member of the Cointelegraph Accelerator program.</p>\n                    <p><p>The growth of social media has made it possible for everyone to become a content creator. And while the creator economy grew, incentives to become part of it continued to diminish. Since the $100 billion market is <a href=\"https://blog.hubspot.com/marketing/creator-economy-market-size\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">dominated</a> by a handful of centralized platforms, creators hardly ever see a fair compensation for their efforts. </p><p>YouTube, for example, has only <a href=\"https://techcrunch.com/2022/09/16/youtube-give-shorts-creators-cut-ad-revenue/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAFFmX6NKqiq1w-LkvDhtIczRSYAM-6_p9n9V42UAD5eR4SP2vnbnnr4QbNauXGT8xvjhl1Sjyq1g80EOdgm9m2JIH08uYmIXXemG6fbn8RH3ORjwV1gizdnn19eI1p3thvK4Es1N3s6xDYXvPVuzqzEK6Wso4H--dtb371dfmo8m\" rel=\"noopener noreferrer nofollow\" target=\"_blank\" data-amp=\"https://techcrunch-com.cdn.ampproject.org/c/s/techcrunch.com/2022/09/16/youtube-give-shorts-creators-cut-ad-revenue/amp/\">recently</a> started paying out a minor share (45%) of the ad money from Short videos to creators. Streaming platform Spotify also cuts 30% from ad revenue, <a href=\"https://dittomusic.com/en/blog/how-much-does-spotify-pay-per-stream/#:~:text=Spotify%20pays%20artists%20between%20%240.003,holders%20and%2030%25%20to%20Spotify.\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">leaving</a> creators to share $0.003 to $0.005 with right holders and publishers per stream. </p><p>Add to this the growing concerns about data ownership and the lack of sustainable financial models, it becomes clear that the creator economy needs to reestablish itself by placing users and creators at its heart. As the digital landscape evolves, it’s crucial to utilize a <a href=\"https://cointelegraph.com/news/a-new-era-of-content-monetization-blockchain-tech-can-get-you-paid\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/a-new-era-of-content-monetization-blockchain-tech-can-get-you-paid/amp\">decentralized approach</a> to overcome the major challenges of the creator economy.</p><h2>Web3 social media where users and creators come first</h2><p><a href=\"https://www.popsocial.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Pop Social</a>, a Web3-friendly social media platform, combines <a href=\"https://cointelegraph.com/learn/what-is-socialfi-a-beginners-guide-to-the-social-network-of-the-future\">SocialFi</a>, Web3 and <a href=\"https://cointelegraph.com/news/a-brief-history-of-artificial-intelligence\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/a-brief-history-of-artificial-intelligence/amp\">artificial intelligence (AI)</a> to address the key pain points of content creation faced by users and creators alike. The platform aims to eliminate the exploitation of creators by providing fair compensation for creators while introducing a new mechanism to reward users for their engagement as well. To achieve this, Pop Social diversifies its revenue streams by including AdTech revenue, <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a>-related earnings, Phygital Stores and Open-API subscription models, to ensure a sustainable financial foundation. </p><p></p><div class=\"embed-responsive embed-responsive-16by9\"><center><p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/5K8JGRUNIGI\" width=\"560\"></iframe></p></center></div><p></p><p>Using an on-chain unique profile ID and enabling users to bring their own IDs from other decentralized protocols, Pop Social goes all in for true content ownership. With the AI integration, users will be able to see personalized recommendations based on meritocracy rather than popularity. Pop Social uses AI to provide a more balanced experience for users while building a foundation for reliable information flow to prevent fake news through its platform. It aims to create a vibrant and inclusive social ecosystem by focusing on social recovery, user-controlled data privacy and transparent content moderation policies.</p><p>An integral part of the Pop Social ecosystem, Pop Labs operates as a launchpad for innovation, driven by generative AI, creator incubation, and project initiatives.</p><p>“We envision a future where Social, Web3, and AI convergence redefines how we interact, create, and thrive in the digital realm,” Michael Shen, CEO of Pop Social, told Cointelegraph. “At the heart of this vision is empowering individuals, content creators, and communities through a seamlessly integrated ecosystem.” </p><blockquote><p>“SocialFi should aim to create an exciting and inclusive ecosystem where users, creators, and communities thrive financially while reaping the benefits of a decentralized, transparent, and secure social experience.”</p></blockquote><p><a href=\"https://cointelegraph.com/accelerate/\">Cointelegraph Accelerator</a> welcomes Pop Social as a participant in its growing roster of promising projects. Given the disruptive potential the Web3-native social decentralized applications (DApps) hold against the $100 billion creator economy. With good traction regarding active users and app downloads, Pop Social has a founding team of experts who have substantial experience in the blockchain industry.</p>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-09T20:00:38.000Z",
    "title": "Former head of compliance at OneCoin pleads guilty; Crypto Queen remains at large",
    "url": "https://cryptoslate.com/former-head-of-compliance-at-onecoin-pleads-guilty-crypto-queen-remains-at-large/",
    "description": "<p>Irina Dilkinska, who reportedly served as &#8220;Head of Legal and Compliance&#8221; for the supposed crypto project, pleaded guilty to charges of wire fraud and money laundering on Nov. 9 in a Manhattan federal court. The announcement was made by U.S. Attorney for the Southern District of New York Damian Williams. OneCoin, founded in 2014 by [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/former-head-of-compliance-at-onecoin-pleads-guilty-crypto-queen-remains-at-large/\">Former head of compliance at OneCoin pleads guilty; Crypto Queen remains at large</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-09T19:48:20.000Z",
    "title": "Could Avalanche (AVAX) Be the Next to Soar After Bitcoin's Recovery?",
    "url": "https://cryptodaily.co.uk/2023/11/could-avalanche-avax-be-the-next-to-soar-after-bitcoins-recovery",
    "description": "Explore the potential of Avalanche (AVAX) in the evolving crypto landscape. Will AVAX outpace Bitcoin in the next rally? Discover insights into the AVAX market dynamics, technical analysis, and price predictions. Understand its position alongside Bitcoin's recovery and its role as a potential dark horse in today's crypto market."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T20:00:07.000Z",
    "title": "Crypto’s Current Climb: JPMorgan Suggests Rally May Be Reaching Its Peak",
    "url": "https://www.newsbtc.com/news/crypto-current-climb-jpmorgan-suggests-rally-may-be-reaching-its-peak/",
    "description": "JPMorgan analysts have cast a skeptical eye over the recent crypto rally, indicating it may be built on sand rather than solid ground. Their latest report conveys a guarded stance, suggesting that the market&#8217;s exuberance may be outpacing the underlying fundamentals. As the market&#8217;s enthusiasm swells, fueled by pivotal developments such as the US Securities and Exchange Commission&#8217;s (SEC) potential green light of the spot Bitcoin exchange-traded fund (ETF), these financial experts are urging caution, advocating a closer examination of the elements at play. Related Reading: Bitcoin On The Brink? Analyst Predicts Soaring Open Interest May Signal 20% Price Correction A Closer Look At ETF Approval And Regulatory Battles Within the crypto sphere, JPMorgan analysts disclosed that two significant events have captured investor interest and driven prices upward. These events include anticipating a US-approved spot Bitcoin ETF, which has ignited hopes of new capital inflows. At the same time, recent legal tussles involving the SEC have raised expectations for a more permissive regulatory environment. However, the JPMorgan team, led by analyst Nikolaos Panigirtzoglou, presents a contrarian view, deconstructing these drivers and their probable impact on the market. They argue that an ETF approval would usher in fresh capital, which might be misleading. The analysts propose that rather than attracting new investment; the approval could redirect existing funds from current Bitcoin investment products into the new ETFs. The JPMorgan team noted: First, instead of fresh capital entering the crypto industry to be invested in the newly-approved ETFs, we see as a more likely scenario existing capital shifting from existing bitcoin products such as the Grayscale bitcoin trust, bitcoin futures ETFs and publicly listed bitcoin mining companies, into the newly-approved spot bitcoin ETFs. This shift, they assert, would not necessarily expand the market&#8217;s capital base. JPMorgan&#8217;s team points to the tepid response to similar products in Canada and Europe as evidence, suggesting that a US spot Bitcoin ETF might encounter the same lukewarm reception. Legal victories against the SEC in high-profile cases like Ripple and Grayscale are also interpreted as potential precursors to a regulatory softening. Yet, the analysts remain unconvinced, citing the lingering aftereffects of the FTX scandal and the inherent risks of an under-regulated market. They further disclosed that these factors will likely keep the regulatory tightening trend intact, with little room for significant easing. Bitcoin Halving: A Pre-Priced Crypto Event? The report delves into the much-discussed Bitcoin halving, which traditionally stokes bullish forecasts. However, JPMorgan&#8217;s analysts believe the market has already factored in the halving&#8217;s supply-squeeze implications. They noted: This argument seems unconvincing as the Bitcoin halving event and its effect are predictable and in our opinion are well factored into Bitcoin price. They calculate that based on current data, the production cost of Bitcoin post-halving should double, particularly from the current $ $21,000 to $43,000. Their analysis concludes with a sobering outlook, anticipating a potential &#8220;buy the rumor, sell the fact&#8221; scenario post-ETF approval. Such a dynamic could see prices climb on anticipation and plummet once the event materializes, a pattern familiar to seasoned market observers. Echoing similar sentiments, financial commentator Peter Schiff has cast doubt on the longevity of Bitcoin&#8217;s price surges driven by ETF speculations. Related Reading: Bitcoin’s Grip Strengthens: Record High In Long-Term Holdings Signals Bullish Horizon Schiff warns that post-approval, Bitcoin might face a shortage of positive triggers, potentially culminating in a market sell-off as the &#8216;buy the rumor, sell the news&#8217; phenomenon unfolds. How many times can #Bitcoin rally on the same ETF rumor? Once a U.S. Bitcoin EFT is approved, or $GBTC is able to convert into an ETF, there will be no more &#8220;good&#8221; news for Bitcoin to rally on. After years of buying the rumor, everyone will finally be able to sell the news. — Peter Schiff (@PeterSchiff) October 16, 2023 Meanwhile, Bitcoin has seen quite a significant move in the past few hours. The asset has now marked a new high for 2023, surging above $37,000, up by nearly 10% in the past day. Featured image from Unsplash, Chart from TardingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-09T20:01:09.000Z",
    "title": "XRP Price Projections: Analyst Anticipates Record-Breaking $997 Billion Market Cap and $18 Value",
    "url": "https://www.crypto-news-flash.com/xrp-price-projections-analyst-anticipates-record-breaking-997-billion-market-cap-and-18-value/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-price-projections-analyst-anticipates-record-breaking-997-billion-market-cap-and-18-value",
    "description": "<img width=\"1280\" height=\"819\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-768x491.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Top market analyst EGRAG foresees XRP price touching $18 in the long term. This projection is based on renewed optimism in XRP&#8217;s potential based on insights from its historical performance. Prominent crypto analyst EGRAG recently predicted that the XRP market cap could reach an unprecedented $997 billion, with each XRP soaring to $18 in value. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-09T19:44:06.000Z",
    "title": "Bitcoin (BTC) price could hit $40,000 after Fed rate announcement; InQubeta set to deliver 10x returns by Christmas 2023?",
    "url": "https://www.crypto-news-flash.com/bitcoin-btc-price-could-hit-40000-after-fed-rate-announcement-inqubeta-set-to-deliver-10x-returns-by-christmas-2023/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-btc-price-could-hit-40000-after-fed-rate-announcement-inqubeta-set-to-deliver-10x-returns-by-christmas-2023",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-25.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-25.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-25-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Bitcoin (BTC), the best-known cryptocurrency, has stayed relatively stable recently, trading around $34k to $35k. But following the latest Federal Reserve rate announcement, e­xperts predict Bitcoin might reach $40,000. Meanwhile, InQubeta (QUBE) has emerged as a captivating prospect, boasting the potential to deliver impressive 10x returns by Christmas 2023. InQubeta, the world&#8217;s first crypto crowdfunding [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-09T19:45:21.000Z",
    "title": "Crypto Giant Binance Unveils New Self-Custody Wallet Compatible With 36 Different Chains",
    "url": "https://dailyhodl.com/2023/11/09/crypto-giant-binance-unveils-new-self-custody-wallet-compatible-with-36-different-chains/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/crypto-new-self-wallet.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/crypto-new-self-wallet.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/crypto-new-self-wallet.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/crypto-new-self-wallet.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/crypto-new-self-wallet.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/crypto-new-self-wallet.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/crypto-new-self-wallet.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The world’s largest crypto exchange by trading volume has introduced a new self-custody wallet that enables one-click access to the blockchain from the platform’s mobile app. Binance says the new wallet serves as a bridge between the exchange and decentralized finance (DeFi) ecosystems and allows users to take charge of their own assets, trade tokens [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/09/crypto-giant-binance-unveils-new-self-custody-wallet-compatible-with-36-different-chains/\">Crypto Giant Binance Unveils New Self-Custody Wallet Compatible With 36 Different Chains</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-09T19:41:11.000Z",
    "title": "Over $249,000,000 in Bitcoin, Ethereum and Solana Shorts Liquidated in Hours As BTC Blows Past $37,000",
    "url": "https://dailyhodl.com/2023/11/09/over-249000000-in-bitcoin-ethereum-and-solana-shorts-liquidated-in-hours-as-btc-blows-past-37000/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/btc-eth-miracle-rally.png?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/btc-eth-miracle-rally.png 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/btc-eth-miracle-rally.png?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/btc-eth-miracle-rally.png?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/btc-eth-miracle-rally.png?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/btc-eth-miracle-rally.png?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/btc-eth-miracle-rally.png?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Hundreds of millions of dollars worth of Bitcoin (BTC), Ethereum (ETH), and Solana (SOL) shorts have been liquidated as the king crypto shoots past $37,000. According to new data from blockchain tracking platform Coinglass, during the last 24 hours, the top crypto asset by market cap has seen just over $131 million worth of short [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/09/over-249000000-in-bitcoin-ethereum-and-solana-shorts-liquidated-in-hours-as-btc-blows-past-37000/\">Over $249,000,000 in Bitcoin, Ethereum and Solana Shorts Liquidated in Hours As BTC Blows Past $37,000</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]