[
  {
    "source": "Decrypt",
    "date": "2023-12-01T15:55:25.000Z",
    "title": "Coinbase CEO: Future AI ‘Agents’ Will Transact in Crypto",
    "url": "https://decrypt.co/208227/coinbase-ceo-future-ai-agents-will-transact-in-crypto",
    "description": "The worlds of artificial intelligence and crypto will intersect in the future through autonomous AI agents, said Coinbase CEO Brian Armstrong."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-01T16:00:55.000Z",
    "title": "Esports leader Team Liquid joins Illuvium for strategic blockchain game beta test",
    "url": "https://cryptoslate.com/esports-leader-team-liquid-joins-illuvium-for-strategic-blockchain-game-beta-test/",
    "description": "<p>Illuvium, an Ethereum (ETH)-based decentralized gaming platform, has joined forces with Team Liquid, a globally recognized esports organization, to beta-test the early access version of its game, Illuvium: Arena, according to a Dec. 1 statement shared with CryptoSlate. The collaboration aims to introduce blockchain gaming to a broader audience by showcasing gameplay through Team Liquid&#8217;s [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/esports-leader-team-liquid-joins-illuvium-for-strategic-blockchain-game-beta-test/\">Esports leader Team Liquid joins Illuvium for strategic blockchain game beta test</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-01T16:04:10.000Z",
    "title": "Shiba Inu (SHIB) and Aptos (APT) Stall, While a Surprise Coin Eyes Key Resistance Breakthrough",
    "url": "https://cryptodaily.co.uk/2023/12/shiba-inu-shib-and-aptos-apt-stall-while-a-surprise-coin-eyes-key-resistance-breakthrough",
    "description": "Dive into the intriguing dynamics of Shiba Inu (SHIB) and Aptos (APT) as they face pivotal moments in the market. Our incisive analysis examines their current performance stagnation, juxtaposed with a surprising coin's momentum poised to break key resistance. Gain a holistic understanding of these cryptocurrencies' trajectories, uncovering the factors influencing their pause and the potential for an unexpected market reshuffle. Stay informed and navigate the complexities of the crypto world with our expert insights, equipping you to anticipate and react to sudden surges or dips in this ever-changing financial arena."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-01T16:05:00.000Z",
    "title": "OpenAI’s ChatGPT under scrutiny",
    "url": "https://www.cryptopolitan.com/openais-chatgpt-under-scrutiny/",
    "description": "In a recent development, researchers have uncovered vulnerabilities in OpenAI&#8217;s ChatGPT, highlighting concerns related to training data leakage. The attack method, described as &#8220;kind of silly&#8221; but nonetheless significant, involved manipulating ChatGPT to reveal training data, including sensitive information like email addresses and phone numbers. Exploiting ChatGPT&#8217;s vulnerabilities The researchers&#8217; method involved instructing ChatGPT to ... <a title=\"OpenAI&#8217;s ChatGPT under scrutiny\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openais-chatgpt-under-scrutiny/\" aria-label=\"More on OpenAI&#8217;s ChatGPT under scrutiny\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-01T16:00:01.000Z",
    "title": "Starknet Foundation Addresses Airdrop Speculations Amidst Social Media Buzz",
    "url": "https://www.cryptopolitan.com/starknet-airdrop-speculations-media-buzz/",
    "description": "The Starknet Foundation, responsible for the Ethereum Layer 2 network Starknet, has recently addressed the community&#8217;s growing speculation about its upcoming airdrop. The response comes in the wake of widespread discussions triggered by the circulation of two screenshots on social media, which purportedly revealed details of the airdrop criteria. These revelations have stirred considerable interest ... <a title=\"Starknet Foundation Addresses Airdrop Speculations Amidst Social Media Buzz\" class=\"read-more\" href=\"https://www.cryptopolitan.com/starknet-airdrop-speculations-media-buzz/\" aria-label=\"More on Starknet Foundation Addresses Airdrop Speculations Amidst Social Media Buzz\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-01T15:57:46.000Z",
    "title": "Michigan Enacts Sweeping Changes to Election Laws in Effort to Safeguard Voting Rights",
    "url": "https://www.cryptopolitan.com/michigan-enacts-sweeping-changes-to-election/",
    "description": "In a decisive move to fortify the democratic process, Michigan Governor Gretchen Whitmer signed nearly two dozen bills on Thursday, ushering in a series of significant changes to the state&#8217;s election laws. The comprehensive legislative package aims to enhance accessibility, protect the right to vote, and counteract the influence of artificial intelligence (AI) in political ... <a title=\"Michigan Enacts Sweeping Changes to Election Laws in Effort to Safeguard Voting Rights\" class=\"read-more\" href=\"https://www.cryptopolitan.com/michigan-enacts-sweeping-changes-to-election/\" aria-label=\"More on Michigan Enacts Sweeping Changes to Election Laws in Effort to Safeguard Voting Rights\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-01T15:49:09.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: Will APE break $1 support?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: Will APE break $1 support?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: Will APE break $1 support?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-01T16:00:50.000Z",
    "title": "Shibarium Transactions Sees 4,400% Explosion, Time For SHIB And BONE ATH?",
    "url": "https://www.newsbtc.com/shiba-inu/shibarium-4400-shib-bone/",
    "description": "Shibarium has crossed a new milestone in the space of a few days. The layer-2 solution built for Shiba Inu&#8217;s ecosystem just saw transactions spike an astounding 4,400%, registering 748,230 transactions in the past 24 hours.  Numbers like this demonstrate the sheer adoption rate of Shibarium, and investors are left wondering if high valuations for the tokens on the Shiba Inu ecosystem are inevitable. Shibarium Transactions Explode Over 4,400% In One Day Shibarium went live in August and has become the go-to platform for SHIB whales and investors. Shibarium recently crossed the 4 million transaction mark, but it looks like the run isn&#8217;t stopping anytime soon.  Related Reading: Bitcoin 65% Crash Possible? $54 Million In Buy Orders Pile Up At $12,000 The layer-2 solution saw an explosion of over 4,400% transactions in just the past 24 hours to reach the next milestone of five million transactions. According to data from Shibariumscam, there were 748,230 transactions in the past 24 hours, the highest ever recorded since its launch.  Notably, the transaction count on the network has been on the rise in the past week, as it reported over 43,000 transactions On November 23. At the time of writing, the total transaction count now stands at 5.968 million and is steadily approaching the 6 million milestone.  SHIB price at $0.0000083 &#124; Source: SHIBUSD on Tradingview.com What This Means For SHIB And BONE Prices The massive increase in Shibarium transactions is hugely bullish for SHIB and BONE prices. With more activity and utility on the network, demand for the native tokens should rise. Even before the platform went live, SHIB has been known to react to updates regarding the platform. As it stands, a larger part of SHIB&#8217;s utility is now tied to the adoption and use of Shibarium.  BONE is also of this sentiment regarding Shibarium. Apart from its utility as the governance token on the ShibaSwap decentralized exchange (DEX), BONE is also used to pay gas fees on the Shabarium network. The more people buy, sell, and trade on the network, the higher BONE&#8217;s price can climb. As a result, the hype around Shibarium&#8217;s launch in August saw the crypto spike over $1.7 for a few hours.  Related Reading: Bitcoin Spot ETF In January 2024: A New Player Just Joined The Game It would seem that both SHIB and BONE have reacted positively to the recent transaction surge on Shibarium, among other things. According to data from Coinmarketcap, SHIB is up by 1.45% in the past 24 hours, while BONE is up by 2.59% in the same timeframe. However, despite the constant spikes this year, both tokens are still in the negative in a larger timeframe, down by 9.89% and 18.64% in a yearly timeframe. Due to the recent spike in Shibarium transactions, many SHIB and BONE holders are optimistic that new all-time highs are on the horizon for these tokens. SHIB is trading at $0.000008315 at the time of writing and it would need to perform a 930% gain to reach its all-time high of $0.00008616. BONE, on the other hand, is currently trading at $0.6262 and would need to perform gains of 2375% to reach its current all-time high of $15.50. The Shiba Inu ecosystem continues advancing, enhancing the utility and technology behind SHIB, and the future looks bright for this innovative ecosystem and its tokens. Featured image from CryptoRank, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-01T16:07:31.000Z",
    "title": "Bitcoin Price Soars: $60,000 in Sight Before Halving, Matrixport Predicts",
    "url": "https://www.crypto-news-flash.com/bitcoin-price-soars-60000-in-sight-before-halving-matrixport-predicts/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-price-soars-60000-in-sight-before-halving-matrixport-predicts",
    "description": "<img width=\"1280\" height=\"848\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/bitcoin-3890350_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"JpMorgan\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/bitcoin-3890350_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/bitcoin-3890350_1280-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/bitcoin-3890350_1280-1024x678.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/bitcoin-3890350_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Bitcoin is predicted to have a 90 percent chance of hitting $40k by December, before proceeding to $63k in April 2024. Experts believe that several factors including a potential Bitcoin ETF approval, Bitcoin halving, etc could trigger this rally.  Bitcoin (BTC) has in a sudden twist of event switched from its bearish run to bullish [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-01T16:06:04.000Z",
    "title": "Bitcoin ETFs to Be Decided Between January 5th and 10th",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-etfs-to-be-decided-between-january-5th-and-10th/",
    "description": "<p>The SEC&#8217;s decision to postpone the Franklin/Hashdex Bitcoin ETF has raised eyebrows among investors and industry experts. Typically, the delays in Bitcoin ETFs related to regulatory processes are met with frustration. But in this case, the deviation from the usual course of action is being interpreted as a positive signal. Every Bitcoin ETF will be [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-etfs-to-be-decided-between-january-5th-and-10th/\">Bitcoin ETFs to Be Decided Between January 5th and 10th</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-01T15:54:00.000Z",
    "title": "EUR Trading Options Expand on Crypto.com with XRP and SOL Pairs",
    "url": "https://coinedition.com/eur-trading-options-expand-on-crypto-com-with-xrp-and-sol-pairs/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Crypto.com-Exchange-Reduces-Trading-Fees-by-up-to-80.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"EUR Trading Options Expand on Crypto.com with XRP and SOL Pairs\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Crypto.com-Exchange-Reduces-Trading-Fees-by-up-to-80.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Crypto.com-Exchange-Reduces-Trading-Fees-by-up-to-80-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Crypto.com-Exchange-Reduces-Trading-Fees-by-up-to-80-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Crypto.com-Exchange-Reduces-Trading-Fees-by-up-to-80-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Crypto.com-Exchange-Reduces-Trading-Fees-by-up-to-80-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Singapore-based crypto exchange Crypto.com has enabled the trading of more EUR pairs on its platform. In a recent post on X (formerly Twitter), the digital assets trading company told followers they can now trade XRP/EUR and SOL/EUR pairs on their platform. Before the latest additions, Crypto.com users could only trade Bitcoin and Ethereum against the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/eur-trading-options-expand-on-crypto-com-with-xrp-and-sol-pairs/\">EUR Trading Options Expand on Crypto.com with XRP and SOL Pairs</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]