[
  {
    "source": "CoinDesk",
    "date": "2023-06-28T11:25:19.000Z",
    "title": "Horizen Scraps Privacy Coin Moniker Amid Regulatory Scrutiny",
    "url": "https://www.coindesk.com/business/2023/06/28/horizen-scraps-privacy-coin-moniker-amid-regulatory-scrutiny/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Horizen says it's now simply a layer 0 blockchain after depreciating the shielded pools on its main chain."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-28T11:12:57.000Z",
    "title": "Israel Seizes $1.7M From Crypto Accounts Linked to Iran’s Quds Force, Hezbollah: Report",
    "url": "https://decrypt.co/146539/israel-seizes-1-7m-from-crypto-accounts-linked-to-irans-quds-force-hezbollah-report",
    "description": "The operation, the first of its kind, was made possible thanks to new tools developed by Israeli security agencies."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-28T11:30:00.000Z",
    "title": "DegenWin: The Ultimate Crypto Casino Experience in 2023",
    "url": "https://cryptodaily.co.uk/2023/06/degenwin-the-ultimate-crypto-casino-experience-in-2023",
    "description": "<p>Searching for the ultimate Bitcoin casino experience? Not all crypto casinos are equal, and it's crucial to choose a reliable and immersive platform. In this article, we present the top 10 crypto casinos, each with its unique offerings. Among them, DegenWin, the revolutionary Web3 casino that is redefining the landscape of online gambling. In the ever-evolving realm of crypto casinos, finding the ultimate Bitcoin gambling experience can be a daunting task. But fear not, as DegenWin has emerged as the trailblazer, offering an immersive and secure platform that surpasses all expectations. Let's dive into what sets DegenWin apart and why you need to join the action right now!</p>\nTop 10 Crypto Casinos:\n<p>1 - DegenWin: The Leader in Crypto Gambling</p>\n<p>Taking the Top spot is none other than DegenWin. This innovative platform is revolutionizing the industry with its strong tokenomics, audited contract, enticing ICO opportunities, and exhilarating $1,100,000 airdrop campaign. By choosing DegenWin, you're raising the bar for your online gambling experience.2 - CryptoJackpot:Offering a vast selection of games and enticing jackpots, CryptoJackpot delivers an immersive gambling experience.3 - CoinGamble:With its sleek interface and diverse game library, CoinGamble caters to both casual players and enthusiasts.4 - BitRoll:Known for its simplicity and user-friendly interface, BitRoll attracts newcomers to the crypto casino scene.5 - CryptoSpins:Boasting an extensive game catalog, CryptoSpins provides players with a wide range of options.6 - CasinoCoin:CasinoCoin offers a seamless gaming experience with various games to choose from.7 - BetCrypto:With sports betting options and live casino games, BetCrypto appeals to those seeking a diverse gambling experience.8 - CoinGaming:CoinGaming presents a solid platform with a variety of games for players to enjoy.9 - CryptoDice:Targeting a specific audience, CryptoDice offers a simplistic dice game with a low house edge.10 - LuckyCrypto:Providing an array of slot games and generous promotions, LuckyCrypto ensures an entertaining gaming experience.</p>\nDegenWin: Paving the Way to Success\n<p>Now, let's shed light on why DegenWin has emerged as the leading crypto casino in 2023. DegenWin is more than just a casino; it's a thriving ecosystem that benefits both players and investors. Let's explore what makes DegenWin the unrivaled choice for crypto gambling: DegenWin's Variety: DegenWin offers an array of thrilling features for players, including over 5,000 slots, PVP poker, and sports betting. With exciting bonuses like Rackback, weekly/monthly events, Level Bonus, and a Referral System, players are constantly rewarded for their loyalty and participation, enhancing their overall gaming experience.Licensed and Certified: Operating under a legitimate gambling license, DegenWin provides a secure and regulated environment for players to enjoy their favorite games with peace of mind. With DegenWin, you can rest assured that your winnings will be promptly and fairly distributed. Our instant payout system guarantees that you receive your rewards without delay.Strong Tokenomics: DegenWin's $DGW token follows a deflationary model, with 45% of casino earnings allocated for token buybacks and burns. This strategic approach increases the token's value over time, benefiting both token holders and the casino itself.Passive Income Opportunities: By staking $DGW tokens, players can earn passive income and unlock additional rewards, providing an added incentive to engage with the platform and enjoy its offerings.Audited Token Contract: DegenWin's $DGW token contract has undergone meticulous auditing, ensuring transparency and fostering trust within the community. This commitment to security and integrity sets DegenWin apart from its competitors.Interoperability of $DGW Across Different Blockchains:One of the key features that sets DegenWin apart is the interoperability of its native token, $DGW, across different blockchains. This enables seamless transactions and accessibility for users, regardless of the blockchain they prefer to use.ICO Opportunity: DegenWin presents a unique ICO opportunity, allowing participants to secure discounted $DGW tokens. Additionally, participants can earn a referral provision of 25%, making this ICO an appealing and potentially lucrative investment opportunity. Top 10 Exchange Listing:DegenWin has secured a listing on a top 10 exchange, providing liquidity and a wider market reach for the $DGW token. This collaboration further strengthens the credibility and value of the platform. Furthermore, we will secure listings on Coingecko and CoinMarketCap to increase our visibility in the crypto world.Exciting Airdrop Campaign: Don't miss out on DegenWin's thrilling airdrop campaign, where participants have the chance to win $1,100,000 worth of $DGW tokens, along with a $100 USDO bonus. This campaign represents a remarkable opportunity to be part of something extraordinary while reaping significant rewards. The top 50 participants will receive an exclusive bonus of 240,000 tokens, worth over $800 in real value.Renowned Athletes and Ambassadors: DegenWin attracts notable athletes, ambassadors, and advisors who contribute to its growth and success, enhancing the overall experience for players and solidifying its position as a trusted platform.Collaboration with Industry Leaders:</p>\n<p>DegenWin has forged strategic partnerships with industry leaders in the blockchain and gambling sectors. These collaborations ensure continuous innovation, access to cutting-edge technologies, and a constantly evolving gaming experience for users.</p>\n<p>Unleash Your Potential at DegenWin:&nbsp;</p>\n<p>DegenWin reigns supreme. DegenWin offers a gaming experience that rewards both players and investors alike. Enjoy exclusive benefits such as bonuses, exciting events, and engaging gameplay, all while having the opportunity to earn passive income through token staking. On the other hand, investors can capitalize on the robust ecosystem and the potential to become casino shareholders through $DGW token ownership. With DegenWin, the future of gambling awaits, and it's time to embark on a thrilling journey.</p>\n<p>Join the DegenWin Community:</p>\n<p>Become part of the rapidly growing community on Telegram and connect with like-minded individuals who share a passion for online gambling and the future of casinos. Engage in meaningful discussions, exchange insights, and be part of a vibrant community that shapes the future of DegenWin.</p>\n<p>Conclusion:</p>\n<p>When it comes to the top crypto casinos for 2023, DegenWin stands at the forefront as a leading pioneer. Its strong tokenomics, audited contract, exciting airdrop campaign, and thriving ecosystem set it apart from the competition. Don't miss the opportunity to be part of something extraordinary. Join DegenWin today and experience the future of crypto casinos.</p>\n<p>Visit DegenWin now to embark on your extraordinary gambling journey:</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-28T11:30:32.000Z",
    "title": "Swiss Central Bank to Launch Wholesale CBDC Soon Says Chairman Thomas Jordan",
    "url": "https://news.bitcoin.com/swiss-central-bank-to-launch-wholesale-cbdc-soon-says-chairman-thomas-jordan/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1197476725-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Swiss Central Bank to Launch Wholesale CBDC Soon Says Chairman Thomas Jordan\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1197476725-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1197476725-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1197476725-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1197476725-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1197476725-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1197476725-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1197476725.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Swiss National Bank (SNB) said it plans to issue a wholesale central bank digital currency as a pilot via SIX Digital Exchange, a subsidiary of SIX, an operator of infrastructure for the Swiss and Spanish financial centers. SNB chairman Thomas Jordan said while the Central Bank has not ruled out launching retail CBDCs, the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T11:29:28.000Z",
    "title": "BlackRock’s BTC ETF approval hangs in the balance with a 50-chance for greenlight",
    "url": "https://www.cryptopolitan.com/blackrocks-btc-etf-approval-has-a-50-chance/",
    "description": "According to Bloomberg senior ETF analyst Eric Balchunas, investment management giant BlackRock has a 50% probability of getting its spot Bitcoin Exchange Traded Fund (ETF) approved. The approval of BlackRock&#8217;s Bitcoin ETF could mark a groundbreaking moment for the cryptocurrency industry.&#160; As the world&#8217;s largest asset management firm, BlackRock&#8217;s foray into the realm of digital ... <a title=\"BlackRock&#8217;s BTC ETF approval hangs in the balance with a 50-chance for greenlight\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blackrocks-btc-etf-approval-has-a-50-chance/\" aria-label=\"More on BlackRock&#8217;s BTC ETF approval hangs in the balance with a 50-chance for greenlight\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T11:24:11.000Z",
    "title": "Will Robinhood and Celsius Cause a Massive Crypto Crash by Selling their Stakes in Bitcoin and Ethereum?",
    "url": "https://www.crypto-news-flash.com/will-robinhood-and-celsius-cause-a-massive-crypto-crash-by-selling-their-stakes-in-bitcoin-and-ethereum/?utm_source=rss&utm_medium=rss&utm_campaign=will-robinhood-and-celsius-cause-a-massive-crypto-crash-by-selling-their-stakes-in-bitcoin-and-ethereum",
    "description": "Robinhood withdrew support for Cardano (ADA), Solana (SOL), and Polygon (MATIC), after the SEC classified the assets as unregistered.  Bankrupt crypto lending firm Celsius to sell $90 million worth of SOL, ADA and MATIC. The SEC dealt the cryptocurrency market a blow when it first slammed leading cryptocurrency exchanges Binance and Coinbase with a lawsuit. [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-28T11:31:00.000Z",
    "title": "Statistics Indicate That Altcoin Delistings Surged In June",
    "url": "https://coinedition.com/statistics-indicate-that-altcoin-delistings-surged-in-june/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Altcoin Delistings Surged\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Altcoin-Delistings-Surged-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A crypto analyst and trader, Crypto Sensei, shared in a post on Twitter yesterday that the number of altcoin spot instrument delistings skyrocketed during the month of June. According to the post, there were about 441 delistings throughout the past 30 days. It is worth noting that June saw more of these delisings than during [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/statistics-indicate-that-altcoin-delistings-surged-in-june/\">Statistics Indicate That Altcoin Delistings Surged In June</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]