[
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T09:53:17.000Z",
    "title": "South Korea focuses on OTC crypto regulations as unlawful deals reach $4B",
    "url": "https://cointelegraph.com/news/south-korea-otc-crypto-regulations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/a6fa8a36-33db-42a8-82a3-35df27630301.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to the Korea Customs Service report, the value of unlawful foreign exchange transactions made using virtual currency was estimated to be worth $4 billion last year. </p>\n                    <p><p>South Korean regulators have turned their focus to over-the-counter (OTC) crypto trades amid growing concerns about its use for criminal activities. The financial regulators in the country are reportedly monitoring the OTC crypto market trades.</p><p>According to a <a href=\"https://cm.asiae.co.kr/article/2023091507274557430?aceRef=https%3A%2F%2Fcryptonews.com%2F\" target=\"_blank\" rel=\"noopener nofollow\">report </a>published in a local daily, deputy chief prosecutor Ki No-Seong and Park Min-woo of the Financial Services Commission (FSC) and other vital regulatory officials attended a session on “Criminal Legal Issues Related to Virtual Assets” with a focus on the unregulated OTC crypto market. During the event, deputy chief prosecutor No-Seong called for regulating the OTC crypto market due to money laundering concerns. </p><p>A google translated version of Seong’s statement read:</p><blockquote>\"Illegal virtual currency OTC companies have overseas corporations and are engaged in the business of converting illegally obtained virtual currency into Korean won or foreign currency. There is a need to regulate these companies as undeclared virtual asset trading businesses.\"</blockquote><p>The term \"OTC crypto market\" describes exchanges that are not officially recognised by the government. Virtual currency over-the-counter (OTC) transactions include all transactions outside regulated platforms including peer-to-peer (P2P) exchanges. According to the report, there are a total of 172 cryptocurrencies available on Upbit, the largest regulated crypto platform in South Korea, while OTC platforms offer upto 700 cryptocurrencies.</p><p>The report cited several instances of the use of OTC platforms to convert virtual assets into Korean won. The International Crimes Investigation Department of the Incheon District Prosecutors' Office arrested and indicted three people on charges of engaging in illegal foreign exchange transactions between October 2021 and October 2022. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coin-center-responds-lawmakers-request-crypto-tax-guidance\"><strong><em>Coin Center responds to US lawmakers’ request for crypto tax guidance</em></strong></a></p><p>The arrested trio were found to be purchasing $70.9 million (94 billion won) worth of virtual currency from overseas OTC at the request of Libyans and then sending it to Korea to be converted into cash, according to the report. The value of unlawful foreign exchange transactions made using virtual currency was estimated by the Korea Customs Service to be worth $4 billion (5.6 trillion won) last year.</p><p>South Korea over the years has become a country known for its stringent crypto regulations over the years and has several regulations in place to tackle crypto-related crimes. The <a href=\"https://cointelegraph.com/news/south-korea-passes-bill-to-tackle-unfair-cryptocurrency-trading\">country’s regulators have become more proactive</a> in the wake of the Terra-Luna collapse. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/big-questions-did-the-nsa-create-bitcoin/\">Big Questions: Did the NSA create Bitcoin?</a></em></strong></p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/crypto-south-korean-cheongju-to-seize-crypto-from-8520-tax-delinquents&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-18T09:47:00.000Z",
    "title": "Islamic Coin Launches Public Sale On Republic",
    "url": "https://cryptodaily.co.uk/2023/09/islamic-coin-launches-public-sale-on-republic",
    "description": "Islamic Coin has launched its Reg D Token Offering to the Public with OpenDeal Broker LLC, dba THE CAPITAL R (“ODB”) – a subsidiary of Republic."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-18T10:00:28.000Z",
    "title": "Ethereum Co-Founder Insists ETH Is a Commodity Amid SEC Crackdown on Crypto Securities",
    "url": "https://news.bitcoin.com/ethereum-co-founder-insists-eth-is-a-commodity-amid-sec-crackdown-on-crypto-securities/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/etherum-lubin-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ethereum Co-Founder Confident ETH Is a Commodity Amid SEC Crackdown on Crypto Securities\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/etherum-lubin-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/etherum-lubin-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/etherum-lubin-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/etherum-lubin-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/etherum-lubin-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/etherum-lubin-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/etherum-lubin.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Ethereum co-founder Joseph Lubin says he stands by his conviction that ether is a commodity despite the U.S. Securities and Exchange Commission (SEC) and its chairman, Gary Gensler, trying to assert authority over all crypto tokens, except bitcoin. &#x201C;I anticipate that, with previous technologies like the internet, the web and cryptography, clear heads will prevail,&#x201D; [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-18T10:00:20.000Z",
    "title": "Dogecoin Price Outlook: Could We See A 10% Dip Due To Supply Pressure?",
    "url": "https://www.newsbtc.com/news/dogecoin-price-outlook-could-we-see-a-10-dip-due-to-supply-pressure/",
    "description": "Dogecoin (DOGE) has found itself caught in a tug-of-war between buying pressures and bearish sentiment, leaving investors and enthusiasts wondering about the coin&#8217;s future direction.  A sudden dip in DOGE&#8217;s price sent shockwaves through the market, breaking a pivotal support trendline that had historically bolstered the coin&#8217;s recovery phases. This breach raised concerns of a continued decline, but recent developments suggest that the meme-inspired cryptocurrency may be gearing up for a fresh rally. One glimmer of hope for DOGE came in the form of newfound support at the $0.06 price level. This development, combined with the broader market&#8217;s bullish sentiment, contributed to a modest recovery earlier today.  Related Reading: Dogecoin Key Challenge: Will The $0.06 Support Level Hold? However, it&#8217;s important to note that the price has since experienced some corrections, highlighting the ongoing volatility in the cryptocurrency space. At the time of writing, DOGE is trading at $0.061802 on CoinGecko, reflecting a 1.0% decline in the past 24 hours and a 0.6% loss over the past week. DOGE’s Bearish Threat Looms  Despite the recent positive movement, DOGE remains vulnerable to potential bearish pressures. If bears manage to establish dominance around the overhead trendline, particularly at the $0.064 price level, the meme coin may face renewed selling pressure. In such a scenario, a decline of 10-12% could be on the horizon, potentially pushing DOGE prices toward the $0.057 region. DOGE market cap currently at $8.7 billion on the daily chart: TradingView.com Meanwhile, in a surprising turn of events over the weekend, Billy Markus, the creator of Dogecoin, took to Twitter to express his thoughts on the state of the Dogecoin community. Responding to a user&#8217;s lament about the decline in community engagement, Markus did not hold back.  He declared the Dogecoin community as &#8220;dead&#8221; for over a year, placing blame on its most active members for creating unnecessary drama rather than fostering a positive environment. I&#8217;ve observed a decline in the Dogecoin community recently. It appears that many are prioritizing ad revenue over engaging with our own community. It&#8217;s disheartening to see making $10-15 become more important than nurturing the community. 😢 — Tyler Milgate (@MilgateTyler) September 14, 2023 DOGE Continues To Shine While Markus&#8217;s words may seem harsh, they carry an air of irony. Dogecoin, with its iconic Shiba Inu mascot, remains a beloved figure in the meme-cryptocurrency landscape, transcending traditional expectations for digital assets. This ironic twist adds an element of intrigue to the ongoing Dogecoin narrative, as enthusiasts and traders eagerly await the next chapter in this rollercoaster journey. Related Reading: Algorand (ALGO) May Have A Chance At A Bullish Streak – Here’s How Dogecoin&#8217;s recent price fluctuations, combined with the candid remarks of its creator, have ignited speculation about the cryptocurrency&#8217;s future trajectory. As DOGE navigates the ups and downs of the crypto market, one thing remains certain: the world will continue to watch this meme coin with a mix of fascination and amusement. Whether it&#8217;s a fresh rally or more turbulence on the horizon, Dogecoin enthusiasts are always in for a wild ride. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from NameCoinNews"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T10:00:27.000Z",
    "title": "Near Protocol, Compound and Everlodge – Why Are Traders Buying Massive Amounts of These Tokens?",
    "url": "https://www.crypto-news-flash.com/near-protocol-compound-and-everlodge-why-are-traders-buying-massive-amounts-of-these-tokens/?utm_source=rss&utm_medium=rss&utm_campaign=near-protocol-compound-and-everlodge-why-are-traders-buying-massive-amounts-of-these-tokens",
    "description": "<img width=\"512\" height=\"299\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-75.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-75.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-75-300x175.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Near Protocol (NEAR), Compound (COMP) and Everlodge (ELDG) are three of the most-bought altcoins among investor circles. But why did these three come out on top of thousands of projects and cryptos available? To find out the answer, today, we will be jumping into their on-chart data. Summary Near Protocol can spike to $1.77 by [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T09:46:55.000Z",
    "title": "Unlocking the Future: VeChain’s NFC and NFT Combo Transforms Physical and Digital Worlds",
    "url": "https://www.crypto-news-flash.com/unlocking-the-future-vechains-nfc-and-nft-combo-transforms-physical-and-digital-worlds/?utm_source=rss&utm_medium=rss&utm_campaign=unlocking-the-future-vechains-nfc-and-nft-combo-transforms-physical-and-digital-worlds",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"VeChain Reebonz\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-2.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-2-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-2-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-2-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />VeChain partners with World of V to pioneer Phygital technology, bridging the physical and digital worlds through NFC and NFT integration. Phygital technology integrates hardware security, blockchain, and NFTs, offering a trust-based ecosystem for product distribution across retail, entertainment, and art industries. In a pioneering advancement in the blockchain world, Vechain has partnered with World [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-18T09:49:23.000Z",
    "title": "Top Perp Dex Coins That Performed Well This Bear Market",
    "url": "https://www.altcoinbuzz.io/reviews/altcoin-projects/top-perp-dex-coins-that-performed-well-this-bear-market/",
    "description": "<p>Since the onset of 2022, the crypto market cap has witnessed a correction of more than 60%. Despite these challenges, certain coins have defied the odds and delivered commendable performance amid this bearish phase. Which are they? Is there a strong trend? Let&#8217;s delve into perpetual decentralized exchange (perp dex) coins that are consistently outperforming [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/altcoin-projects/top-perp-dex-coins-that-performed-well-this-bear-market/\">Top Perp Dex Coins That Performed Well This Bear Market</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]