[
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T04:35:34.000Z",
    "title": " NYCB stocks flip wildly as banks brace for end to fed-bail outs ",
    "url": "https://cointelegraph.com/news/new-york-community-bancorp-stocks-flip-wildly-fed-end-bail-out",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYWQ5MWNiZmItNTJkYy00MDE5LTkwOTUtZDQwOWMzYjUxOTAxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Stock prices for the embattled lender have slumped 83% since the beginning of 2024, hitting an all-time low this week before rebounding. </p>\n                    <p><p>Investors in embattled New York Community Bancorp (NYCB) were taken for a wild ride on Wednesday after shares in the bank plummeted 42% before surging again after the announcement of a $1 billion lifeline from investors. </p><p>NYCB is an American regional bank with more than $100 billion in assets and is the bank that acquired the once crypto-friendly Signature Bank following its <a href=\"https://cointelegraph.com/news/signature-bank-closed-by-new-york-banking-authorities\">collapse in March</a> 2023. </p><p>However, NYCB has seen a turbulent period after <a href=\"https://cointelegraph.com/news/nycb-stock-down-40-percent-quarterly-report-260-million-loss\">weaker-than-expected financial results</a> in Q4, a reduction in quarterly dividends, and concerns over potential losses from poorly performing loans in the commercial real estate sector.</p><p><a href=\"https://cointelegraph.com/news/new-york-community-bancorp-stocks-flip-wildly-fed-end-bail-out\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T04:23:36.000Z",
    "title": "Will Generative AI Empower Cybercriminals? Visa Sounds Alarm",
    "url": "https://www.cryptopolitan.com/generative-ai-empower-cybercriminals-visa/",
    "description": "Visa, a global leader in payment technology, has raised alarms about the escalating threat posed by generative AI in the hands of cybercriminals. Subra Kumaraswamy, the senior vice president and chief information security officer at Visa, emphasized the imminent impact of generative AI across diverse industries, warning that its widespread adoption could significantly ease cybercriminals&#8217; [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-07T04:27:46.000Z",
    "title": "Ethereum Price Consolidates As The Bulls Aim For Surge Above $4K",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-consolidates-4k/",
    "description": "Ethereum price extended its increase toward $3,900. ETH is now consolidating gains and might aim for a move above the $4,000 resistance. Ethereum traded to a new multi-month high above $3,880. The price is trading above $3,700 and the 100-hourly Simple Moving Average. There is a short-term bullish flag pattern forming with resistance at $3,850 on the hourly chart of ETH/USD (data feed via Kraken). The pair could resume its increase if it clears the $3,850 resistance zone. Ethereum Price Aims Higher Ethereum price extended its rally above the $3,750 level, like Bitcoin. BTC failed to extend gains above the $69,200 zone, but ETH cleared the $3,850 level. It traded to a new multi-month high above $3,880 and recently started a consolidation phase. There was a pullback below the $3,800 level. The price tested the 23.6% Fib retracement level of the recent wave from the $3,211 swing low to the $3,898 high. Ethereum is now trading above $3,700 and the 100-hourly Simple Moving Average. Immediate resistance on the upside is near the $3,850 level. There is also a short-term bullish flag pattern forming with resistance at $3,850 on the hourly chart of ETH/USD. Source: ETHUSD on TradingView.com The first major resistance is near the $3,880 level. The next major resistance is near $3,920, above which the price might gain bullish momentum.  The next stop for the bulls could be near the $4,000 level. If there is a move above the $4,000 resistance, Ether could even rally toward the $4,080 resistance. Any more gains might call for a test of $4,120. Another Decline In ETH? If Ethereum fails to clear the $3,850 resistance, it could start another downside correction. Initial support on the downside is near the $3,740 level. The first major support is near the $3,650 zone. The next key support could be the $3,550 zone or the 50% Fib retracement level of the recent wave from the $3,211 swing low to the $3,898 high. A clear move below the $3,550 support might send the price toward $3,400. Any more losses might send the price toward the $3,320 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $3,650 Major Resistance Level – $3,850"
  }
]