[
  {
    "source": "Cointelegraph",
    "date": "2023-06-19T18:23:46.000Z",
    "title": "Fed rate pause triggers traders’ pivot to stocks — Will Bitcoin catch up?",
    "url": "https://cointelegraph.com/news/fed-rate-pause-triggers-traders-pivot-to-stocks-will-bitcoin-catch-up",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/193e804c-9d27-48f6-982f-b85ab2f8e4cf.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>U.S. stock markets hit year-to-date highs, the Fed pauses rate hikes, Binance.US and the SEC reach an agreement, but data shows Bitcoin bulls remain somewhat skittish.</p>\n                    <p><p>After a momentary retest of the $25,000 support on June 15, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) gained 6.5% as bulls successfully defended the $26,300 level. Despite this, the general sentiment remains slightly bearish as the cryptocurrency has declined by 12.7% in two months.</p><p>The<a href=\"https://cointelegraph.com/news/us-court-approves-sec-binanceus-agreement\"> dismissal of Binance.US's temporary restraining order</a> by United States district court Judge Amy Berman Jackson is somewhat related to investors’ sentiment improving. On June 16, the exchange reportedly reached an agreement with the U.S. Securities and Exchange Commission (SEC), avoiding the freeze of its assets.</p><p>On a longer timeframe, the global regulatory environment has been extremely harmful to cryptocurrency prices. Besides the SEC trying to unilaterally<a href=\"https://cointelegraph.com/news/sec-labels-61-cryptocurrencies-securities-after-binance-suit\"> label exactly which altcoins it views as securities</a> and litigating with the two leading global exchanges, the European Union signed the<a href=\"https://cointelegraph.com/news/eu-s-new-crypto-law-how-mica-can-make-europe-a-digital-asset-hub\"> Markets in Crypto-Assets (MiCA) regulations</a> into law on May 31. This means crypto businesses have set timelines to implement and comply with MiCA’s requirements.</p><p>Curiously, while Bitcoin’s performance has been lackluster, on June 16, the S&amp;P 500 index, reached its highest level in 14 months. Even with this recovery, JPMorgan strategists<a href=\"https://finance.yahoo.com/news/jpmorgan-strategists-stocks-face-risks-073845286.html\" target=\"_blank\" rel=\"noopener nofollow\"> expect</a> the rally to come under pressure in the second half of 2023 \"if growth stalls in absolute terms.\"</p><p>Investors will keep their focus on the U.S. central bank, with Fed Chair Jay Powell set to testify before the House Financial Services Committee on June 21 and the Senate Banking Committee on June 22 morning as part of his semi-annual testimony before lawmakers.</p><p>Let’s look at Bitcoin derivatives metrics to better understand how professional traders are positioned amid weaker macroeconomic perspectives.</p><h2>Bitcoin margin and futures show mild demand for leverage longs</h2><p><a href=\"https://cointelegraph.com/explained/margin-trading-vs-futures-what-are-the-differences\">Margin markets</a> provide insight into how professional traders are positioned because they allow investors to borrow cryptocurrency to leverage their positions.</p><p>OKX, for instance, provides a margin-lending indicator based on the stablecoin/BTC ratio. Traders can increase their exposure by borrowing stablecoins to buy Bitcoin. On the other hand, Bitcoin borrowers can only bet on the decline of a cryptocurrency’s price.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/c1808eb8-1806-4dd6-8406-61cf319e6c6d.png\"  /><figcaption style=\"text-align: center;\"><em>OKX stablecoin/BTC margin-lending ratio. Source: OKX</em></figcaption></figure><p>The above chart shows that OKX traders’ margin-lending ratio has been declining since June 10, indicating the overwhelming dominance of longs is behind us. The present 23x ratio favoring stablecoin lending still favors bulls but sits near the lowest levels in 5 weeks.</p><p>Investors should also analyze the Bitcoin futures long-to-short metric, as it excludes externalities that might have solely impacted the margin markets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/b1f5ca1e-3a24-434b-abc4-c8b15a49e7ea.png\"  /><figcaption style=\"text-align: center;\"><em>Exchanges’ top traders Bitcoin long-to-short ratio. Source: CoinGlass</em></figcaption></figure><p>There are occasional methodological discrepancies between exchanges, so readers should monitor changes instead of absolute figures.</p><p>Top traders at OKX vastly decreased their shorts on June 15 as the Bitcoin price plunged to its lowest level in 3 months at $24,800. However, those traders were not comfortable keeping a ratio that favored longs, and it has since moved back to a 0.80 ratio, in line with the 2-week average.</p><p>The opposite movement happened at Binance, as top traders reduced their long-to-short ratio to 1.18 on June 15, but subsequently added longs as the indicator stands at 1.25. Albeit the improvement, Binance's top traders long-to-short ratio is presently in line with the previous 2-week average.</p><p><em>Related:</em><a href=\"https://cointelegraph.com/news/bitcoin-rebound-falters-amid-sec-crackdown-on-exchanges-raising-chance-of-a-btc-price-capitulation\"><em> </em></a><a href=\"https://cointelegraph.com/news/hawkish-fed-stocks-market-rally-and-crypto-falling-behind\"><em>Hawkish Fed, stocks market rally, and crypto falling behind</em></a></p><h2>Bitcoin’s price gains are capped despite resilience in derivative metrics</h2><p>Overall, Bitcoin bulls lack confidence to leverage long positions using margin and futures markets. BTC lacks momentum as investors’ attention has shifted to the stock market after the Fed decided to pause its interest rate hikes, improving the outlook for corporate earnings.</p><p>Despite the extremely negative regulatory pressure, professional traders did not flip bearish according to Bitcoin derivatives metrics. However, bears have the upper hand as the 20-day resistance at $27,500 strengthens, limiting the short-term upside to a mere 3.8%.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-19T18:15:00.000Z",
    "title": "Tether Mints 1 Billion of USDT on Ethereum, Tradecurve Price Set To Reach $0.018",
    "url": "https://cryptodaily.co.uk/2023/06/tether-mints-1-billion-of-usdt-on-ethereum-tradecurve-price-set-to-reach-0018",
    "description": "<p>Tether, the issuer of USDT, the world&rsquo;s largest stablecoin, has minted the second 1 billion token on the Ethereum blockchain in less than two months.&nbsp;</p>\n<p>The stablecoin issuer has said that the new mint is part of its \"inventory replenish\" program to ensure stablecoin liquidity across all chains. In other crypto developments, Tradecurve has been building momentum as investors flock to the new trading platform that has the potential to rekindle interest in the DeFi space.</p>\n<p></p>\nTether Mints Additional 1 Billion USDT\n<p>Tether&rsquo;s treasury has announced the minting of 1 billion USDT tokens on the Ethereum blockchain just two months after a separate 1 billion USDT token was minted. So far in 2023, the stablecoin issuer has now minted over $16 billion worth of USDT tokens. Tether remains the most dominant USD-pegged stablecoin with a market cap of $83 billion.&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>Announcing the latest mint, Tether&rsquo;s CTO Paolo Ardoino, explained that the tokens were minted for chain swap and not due to a rising interest in the purchase of digital assets. Chain swap refers to the process of sending digital assets (in this case USDT) from one blockchain network to another &ndash; bridging assets across multiple blockchains.</p>\n<p>After the mint, on-chain data showed that Tether&rsquo;s Treasury sent $750 million worth of USDT in a chain swap transaction to Binance. According to Arkham Intelligence, the popular blockchain analytical firm, the Tether Treasury sent the funds in three separate batches of $250 million transactions after an initial $10 test transaction.&nbsp;</p>\n<p>&nbsp;</p>\n<p>The analytical firm later reported that of the $1 billion new tokens minted, only $146 million remains on the Ethereum blockchain as the others have been swapped for USDT on other chains.&nbsp;</p>\n<p></p>\nTradecurve (TCRV) Price Set to Hit $0.018\n<p>Along with the increasing dominance of Tether in the stablecoin sectors, Tradecurve has enjoyed increasing attention in the decentralized finance (DeFi) space. Tradecurve is building the first DeFi platform where its users will have the opportunity to trade both cryptocurrencies and derivatives (like stocks, forex, options, and commodities) from a single account.</p>\n<p>Experts are bullish that the price of Tradecurve (TCRV) could easily jump above its current $0.018 price because of the magnitude of the derivatives markets. The Bank for International Settlements reports that in June 2022, the over-the-counter (OTC) derivatives market rose to $632 trillion.&nbsp;</p>\n<p>The bullish predictions for the price of Tradecurve come from the platform&rsquo;s potential to connect the crypto market with the global derivatives market.</p>\n<p>Experts believe the Tradecurve platform could rekindle interest in the DeFi space as crypto traders would no longer need to open more than one account to trade global financial instruments. As more traders enter into the Tradecurve ecosystem, experts predict that the price of TCRV could jump from $0.018 to as high as $1.5 by the end of 2023.</p>\nFor more information about the Tradecurve presale:\n<p>Click Here For Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-19T18:30:12.000Z",
    "title": "Etherscan Unveils Code Reader: An AI-Powered Tool That Aims to Bolster Smart Contract Analysis",
    "url": "https://news.bitcoin.com/etherscan-unveils-code-reader-an-ai-powered-tool-that-aims-to-bolster-smart-contract-analysis/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/ethers-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Etherscan Unveils Code Reader: An AI-Powered Tool That Aims to Bolster Smart Contract Analysis\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/ethers-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ethers-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ethers-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ethers-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ethers-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ethers-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ethers.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />After the Ethereum block explorer Etherscan introduced an advanced filter for blockchain exploration, the team announced a new tool called Code Reader, powered by artificial intelligence (AI). Essentially, the service leverages AI to enable users to retrieve and interpret the source code of a specific contract address. Etherscan Introduces an AI-Powered Code Reader for Smart [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T18:37:43.000Z",
    "title": "CryptoPunks NFT symbolically tied to Ordinals Inscription",
    "url": "https://www.cryptopolitan.com/cryptopunks-nft-tied-to-ordinals-inscription/",
    "description": "In a striking and symbolic move, a valuable Ethereum-based non-fungible token (NFT) from one of Web3’s prominent PFP (Profile Picture) collections, CryptoPunks, has been permanently removed from circulation and linked to an Ordinals inscription on the Bitcoin network. The burning of CryptoPunk #8611, which was sold for approximately 55 Ethereum or $95,000, garnered attention as ... <a title=\"CryptoPunks NFT symbolically tied to Ordinals Inscription\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cryptopunks-nft-tied-to-ordinals-inscription/\" aria-label=\"More on CryptoPunks NFT symbolically tied to Ordinals Inscription\">Read more</a>"
  }
]