[
  {
    "source": "CryptoSlate",
    "date": "2023-06-15T14:06:00.000Z",
    "title": "Colombia’s central bank to pilot Ripple’s CBDC Platform",
    "url": "https://cryptoslate.com/colombias-central-bank-to-pilot-ripples-cbdc-platform/",
    "description": "<p>Ripple has confirmed its partnership with Banco de la República, the Central Bank of Colombia, for pioneering initiatives in blockchain technology. The central bank and the Ministry of Information and Communications Technologies (MinTIC) will participate in a pilot program until the end of 2023 to assess &#8220;high-value payments&#8221; using Ripple&#8217;s CBDC Platform. This pilot phase [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/colombias-central-bank-to-pilot-ripples-cbdc-platform/\">Colombia&#8217;s central bank to pilot Ripple&#8217;s CBDC Platform</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T13:58:00.000Z",
    "title": "Voyager Could Reopen Customer Withdrawals As Early As 20th June",
    "url": "https://cryptodaily.co.uk/2023/06/voyager-could-reopen-customer-withdrawals-as-early-as-20-th-june",
    "description": "<p>Voyager customers were in for some good news a year after their assets were frozen, with the platform stating that they could withdraw a significant chunk of their crypto assets.</p>\n<p>The protocol&rsquo;s customers will soon be able to check how much of their assets could be withdrawn, nearly a year after Voyager filed for Chapter 11 bankruptcy.&nbsp;</p>\nA Sigh Of Relief&nbsp;\n<p>Paul Hage, Voyager&rsquo;s bankruptcy administrator, stated in a court filing on the 14th of June that the Voyager app would be updated by the 15th of June. Once the app has been updated, customers will be able to check the amount they can withdraw. Hage also estimated that the withdrawal period could start between the 20th of June to the 5th of July. The bankruptcy plan was approved in court on the 17th of May and will see Voyager customers initially receive around 35% of their claims through withdrawals from the Voyager app. They can also withdraw in cash after a period of 30 days.&nbsp;</p>\n\n<p>&ldquo;Voyager Court adjourned for the day. Fee examiner&rsquo;s findings approved by the judge app will come back online on or around the 15th of June Estimated window for withdrawals opening the 20th of June to the 5th of July 30 days to withdraw once the window opens all creditors will receive 35.72 initial distribution.&rdquo;</p>\n\n<p>Once submitted, withdrawals will take between 3 and 7 days to process. Additionally, some liquidations may take longer depending on the liquidity available at the time of liquidation. Supported cryptocurrencies will be distributed in kind, while unsupported cryptocurrencies will be distributed in USDC. Hage stated,&nbsp;</p>\n\n<p>&ldquo;The initial distributions of cryptocurrency will be made to creditors between three to seven calendar days after a withdrawal request is submitted on the Voyager platform.&rdquo;</p>\n\nThree Arrows Capital Still Owes $650 Million&nbsp;\n<p>Hage also added that the bankrupt crypto hedge fund Three Arrows Capital (3AC) still owed Voyager around $650 million. The first tranche of withdrawals will allow customers to withdraw just over 35% of their funds. Once completed, the focus of the proceedings will shift to recovering additional assets that can be distributed to creditors.&nbsp;</p>\n<p>Furthermore, an additional $445 million in customer funds could be made available to creditors. However, this depends on a final resolution of Alameda Research&rsquo;s preference claim against Voyager, which will happen sometime in September 2023.&nbsp;</p>\n\n<p>&ldquo;Meditation between @investvoyager and @FTX_Official is anticipated to not start until Fall 2023. Anything less than 100% return would be a devastating result for Voyager creditors!&rdquo;</p>\n\nVoyager&rsquo;s Bankruptcy Struggles&nbsp;\n<p>Voyager had filed for bankruptcy on the 5th of July, 2022. The company then filed two prior bankruptcy plan proposals, both of which fell through. The first proposal was to the United States arm of FTX. However, this deal fell through after FTX itself filed for bankruptcy. The second was a $1 billion deal with Binance.US. This deal fell through after Binance.US backed out of the deal, citing an uncertain and hostel regulatory climate prevailing in the US. At the time, Binance.US stated in a Twitter communication,&nbsp;</p>\n\n<p>&ldquo;Binance.US has made the difficult decision to exercise its right to terminate the asset purchase agreement with Voyager. While our hope throughout this process was to help Voyager&rsquo;s customers access their crypto in kind, the hostile and uncertain regulatory climate in the United States has introduced an unpredictable operating environment impacting the entire American business community.&rdquo;</p>\n\n<p>Voyager had expressed disappointment with the outcome, stating,&nbsp;</p>\n\n<p>&ldquo;Today, we received a letter from Binance.US terminating the asset purchase agreement. While this development is disappointing, our Chapter 11 plan allows for direct distribution of cash and crypto to customers (a &ldquo;toggle option&rdquo;) via the Voyager platform.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T13:50:08.000Z",
    "title": "Parcl Expands Its Real Estate Frontier: Launches Additional Tradable Indexes for Major US Cities Including Austin, Chicago, Seattle, and Boston",
    "url": "https://cryptodaily.co.uk/2023/06/parcl-expands-its-real-estate-frontier-launches-additional-tradable-indexes-for-major-us-cities-including-austin-chicago-seattle-and-boston",
    "description": "<p>New York, New York, June 15th, 2023, Chainwire</p><p class=\"ql-align-center\">Parcl&rsquo;s market expansion increases access to investors seeking exposure to real estate prices via Real World Asset (RWA) Indexes</p><p>Parcl, the leading blockchain-powered real estate trading platform, announced today the launch of Austin, TX, to its ever-growing list of tradable city indexes. In addition to Austin, Parcl recently launched indexes for Boston, Atlanta, Philadelphia, Chicago, Seattle, Denver, Portland, and Washington, D.C., more than doubling its market pool for investors.</p><p>Parcl makes investing in an entire city's residential real estate market possible, unlocking access to high-demand markets like New York, Los Angeles, and Miami. Parcl merges real estate and DeFi to amplify access and portfolio diversification opportunities for traders around the world.</p><p>Adding Austin, one of the fastest-growing housing markets in the U.S., solidifies Parcl's commitment to providing a broad spectrum of high-potential markets to traders. This increases investor access to 16 dynamic tradable markets and builds upon Parcl&rsquo;s mission of increasing access to real estate investing on a global scale.&nbsp;</p><p>&ldquo;Real estate is the largest asset class in the world &ndash; the largest investment many people will make in their lives. It&rsquo;s also the market that has the lowest liquidity and the highest barriers to entry,&rdquo; said Trevor Bacon, Parcl CEO and co-founder. \"Integrating these high-demand markets signifies Parcl&rsquo;s dedication to continuous growth, providing traders access to diverse and burgeoning markets.\"</p><p>Built on Solana &ndash; a blockchain designed for decentralized, scalable applications &ndash; Parcl facilitates real-world real estate trades in real time. The platform's rapid growth since its launch in February demonstrates significant market need for innovating around real estate investing.</p><p>\"Austin&rsquo;s integration provides traders with another dynamic real estate market to diversify their portfolio,\" Bacon said. \"This move is consistent with Parcl&rsquo;s goal to enhance market access and user engagement, as evidenced by all-time highs in user activity, open interest, and trading volume on the decentralized trading application.\"</p><p>The addition of more North American cities is on the near term horizon, with global cities following shortly thereafter. Parcl&rsquo;s illustrated market growth builds upon its aspiration of becoming the simplest platform for global real estate trading, and illustrates its commitment to the core mission of making real estate investing accessible to everyone, everywhere.</p><p>Parcl is designed which features appeal to the modern investors, offering high liquidity, low transaction fees, and no minimum investment requirements. Traders can now trade real estate indexes as effortlessly as Bitcoin, Ethereum, or other crypto assets.</p><p>About Parcl</p><p>Parcl is a DeFi real estate trading platform revolutionizing the way individuals globally engage with real estate investment. Combining the strengths of blockchain technology with traditional real estate, Parcl offers a simple, efficient, and accessible real estate trading experience.&nbsp;</p><p>For more information, visit www.parcl.co.</p>ContactCMOWill LeathermanParclwill@parcl.co"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-15T14:00:30.000Z",
    "title": "Stablecoin Market Records $2.4B in Redemptions in 30 Days as Leading Tokens Experience Supply Decline",
    "url": "https://news.bitcoin.com/stablecoin-market-records-2-4b-in-redemptions-in-30-days-as-leading-tokens-experience-supply-decline/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/hop-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/hop-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hop-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hop-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hop-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hop-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hop-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hop-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to statistics, over the span of 30 days, from May 15 to June 15, 2022, more than 2.4 billion stablecoins were redeemed. During this period, three of the leading stablecoins experienced a decline in their supplies ranging from 4% to 19% compared to the previous month. Stablecoin Economy Slips Lower In the realm of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T14:01:20.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years, and there is no stopping it anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. Various APE price highlights unfold in this ApeCoin Price Prediction. How much is ApeCoin ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T14:01:20.000Z",
    "title": "S Korea crypto platform Delio halts operations amidst regulatory investigation",
    "url": "https://www.cryptopolitan.com/s-korea-crypto-platform-delio-halts-operations-amidst-regulatory-investigation/",
    "description": "Delio, a South Korean crypto lending platform, has announced a temporary suspension of deposits and withdrawals on its platform. The move comes as financial regulators in the country initiate an investigation into the situation. Delio operates as a crypto lending service and wallet and holds an official virtual asset service provider (VASP) operating license. Delio ... <a title=\"S Korea crypto platform Delio halts operations amidst regulatory investigation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/s-korea-crypto-platform-delio-halts-operations-amidst-regulatory-investigation/\" aria-label=\"More on S Korea crypto platform Delio halts operations amidst regulatory investigation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T13:50:49.000Z",
    "title": "SBF to be prosecuted on original 8 charges",
    "url": "https://www.cryptopolitan.com/sbf-to-be-prosecuted-on-original-8-charges/",
    "description": "The criminal trial of SBF, co-founder of FTX, is set to proceed with the original eight charges filed against him by U.S. prosecutors. In a court filing on June 14, the U.S. Department of Justice (DoJ) stated its intention to move forward with the charges initially levied against Bankman-Fried in December 2022. The DoJ&#8217;s decision ... <a title=\"SBF to be prosecuted on original 8 charges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sbf-to-be-prosecuted-on-original-8-charges/\" aria-label=\"More on SBF to be prosecuted on original 8 charges\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T13:46:59.000Z",
    "title": "Parcl Expands Its Real Estate Frontier: Launches Additional Tradable Indexes for Major US Cities Including Austin, Chicago, Seattle, and Boston",
    "url": "https://www.cryptopolitan.com/parcl-expands-its-real-estate-frontier-launches-additional-tradable-indexes-for-major-us-cities-including-austin-chicago-seattle-and-boston/",
    "description": "New York, New York, June 15th, 2023, Chainwire Parcl’s market expansion increases access to investors seeking exposure to real estate prices via Real World Asset (RWA) Indexes Parcl, the leading blockchain-powered real estate trading platform, announced today the launch of Austin, TX, to its ever-growing list of tradable city indexes. In addition to Austin, Parcl ... <a title=\"Parcl Expands Its Real Estate Frontier: Launches Additional Tradable Indexes for Major US Cities Including Austin, Chicago, Seattle, and Boston\" class=\"read-more\" href=\"https://www.cryptopolitan.com/parcl-expands-its-real-estate-frontier-launches-additional-tradable-indexes-for-major-us-cities-including-austin-chicago-seattle-and-boston/\" aria-label=\"More on Parcl Expands Its Real Estate Frontier: Launches Additional Tradable Indexes for Major US Cities Including Austin, Chicago, Seattle, and Boston\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-15T14:00:38.000Z",
    "title": "Why Governments Are Scared of Cryptocurrencies: The Truth They Don’t Want You to Know",
    "url": "https://nulltx.com/why-governments-are-scared-of-cryptocurrencies-the-truth-they-dont-want-you-to-know/",
    "description": "With the increasing innovation and development in cryptocurrency seen in projects like Avorak, there seems to be increased apprehension by governments and traditional finance systems. Can crypto shake up traditional finance? The fundamental feature of cryptocurrencies lies in their decentralized nature, removing the need for intermediaries like banks or regulatory bodies. This disintermediation empowers individuals [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T14:09:11.000Z",
    "title": "Crypto bot borrows $200m for a $3 profit",
    "url": "https://crypto.news/crypto-bot-borrows-200m-for-a-3-profit/",
    "description": "In the throes of a bear market, a crypto trading bot wagered $200 million to pocket a $3.24 profit. "
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T13:52:16.000Z",
    "title": "Floating Point Group suspends withdrawals following $20m hack ",
    "url": "https://crypto.news/floating-point-group-suspends-withdrawals-following-20m-hack/",
    "description": "Floating Point Group (FPG) has suspended fund deposits and withdrawals on its platform citing a security breach. "
  },
  {
    "source": "Kraken Blog",
    "date": "2023-06-15T13:50:32.000Z",
    "title": "Y00ts, LO-FI PEPE, Trump Digital Trading Cards Series 1 & 2 and more collections added to Kraken NFT",
    "url": "https://blog.kraken.com/y00ts-lo-fi-pepe-trump-digital-trading-cards-series-1-amp-2-and-more-collections-added-to-kraken-nft",
    "description": "We&#8217;ve just added six new NFT collections to Kraken NFT for our clients to explore, collect and trade.  After revealing dozens of NFT collections over the past few weeks, we carefully selected these new collections so you can continue to build the NFT collection of your dreams with zero gas fees.*&#160; We will continue to [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T14:00:41.000Z",
    "title": "I asked ChatGPT which coins to invest in under 1$ in June. The answer was Dogecoin, Tradecurve, and Polygon but why?",
    "url": "https://www.crypto-news-flash.com/i-asked-chatgpt-which-coins-to-invest-in-under-1-in-june-the-answer-was-dogecoin-tradecurve-and-polygon-but-why/?utm_source=rss&utm_medium=rss&utm_campaign=i-asked-chatgpt-which-coins-to-invest-in-under-1-in-june-the-answer-was-dogecoin-tradecurve-and-polygon-but-why",
    "description": "As the crypto market continues to grow, investors are always looking for potential opportunities that can yield significant returns. In June, after consulting ChatGPT, three coins emerged as top recommendations for investments under $1: Dogecoin, Polygon, and Tradecurve. Keep on reading as we look into the reasons behind these recommendations. Summary Dogecoin price analysis  Polygon [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T13:40:12.000Z",
    "title": "IOTA: Advances in Alvarium Project with Dell, but Price Trend Hits a Low",
    "url": "https://www.crypto-news-flash.com/iota-advances-in-alvarium-project-with-dell-but-price-trend-hits-a-low/?utm_source=rss&utm_medium=rss&utm_campaign=iota-advances-in-alvarium-project-with-dell-but-price-trend-hits-a-low",
    "description": "IOTA&#8217;s price has been experiencing a downward trend, reaching a yearly low, while the development progress remains stagnant. IOTA&#8217;s collaboration with Dell in the Alvarium project shows some advancements in tracking real-time CO2 footprints, but it has not affected the price curve significantly. IOTA, the blockchain platform, finds itself facing a tense summer as its [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-15T13:58:00.000Z",
    "title": "On-Chain Metrics for Cardano (ADA) Are Extremely Bearish",
    "url": "https://coinedition.com/on-chain-metrics-for-cardano-ada-are-extremely-bearish/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/CARDANO-9-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/CARDANO-9-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-9-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-9.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The crypto market took an unexpected dive following the FED’s recent interest rate announcement, and Cardano (ADA) was no exception. Data from the on-chain tracking company IntoTheBlock revealed that ADA was worth about $0.255384 at press time after the Ethereum-killer suffered a more than 4% loss over the past 24 hours of trading. This left [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/on-chain-metrics-for-cardano-ada-are-extremely-bearish/\">On-Chain Metrics for Cardano (ADA) Are Extremely Bearish</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]