[
  {
    "source": "CoinDesk",
    "date": "2023-08-23T15:45:00.000Z",
    "title": "The Thermodynamics of Crypto Investing",
    "url": "https://www.coindesk.com/markets/2023/08/23/the-thermodynamics-of-crypto-investing/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "As the various structural risks of crypto investing change over time, the opportunities for returns change, too."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-23T15:45:00.000Z",
    "title": "Bitcoin Dreams Are Coming True in Argentina and Turkey",
    "url": "https://www.coindesk.com/coindesk-indices/2023/08/23/bitcoin-dreams-are-coming-true-in-argentina-and-turkey/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "It’s no surprise a BTC-backing candidate just won a primary election in Argentina."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-23T16:01:02.000Z",
    "title": "Social Poker App PokerGO Play Lands on Gala Games",
    "url": "https://decrypt.co/153348/social-poker-app-pokergo-play-lands-on-gala-games",
    "description": "Gala Games has partnered with PokerGO to launch the NFT-based mobile and PC title, which offers daily sweepstakes."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-23T16:00:42.000Z",
    "title": "Bitcoin’s shaky stage mirrors FTX collapse as short-term holders cut losses",
    "url": "https://cryptoslate.com/insights/bitcoins-shaky-stage-mirrors-ftx-collapse-as-short-term-holders-cut-losses/",
    "description": "<p>Quick Take The Bitcoin network is currently experiencing a precarious phase, with market indicators revealing substantial investor weakness from multiple facets. A significant part of this fragility stems from short-term holders, those who have been in possession for less than 155 days. The current capitulation levels of this cohort bear a stark resemblance to the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-shaky-stage-mirrors-ftx-collapse-as-short-term-holders-cut-losses/\">Bitcoin&#8217;s shaky stage mirrors FTX collapse as short-term holders cut losses</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-23T16:00:00.000Z",
    "title": "\n                        Nomura, CoinShares, Ledger-Backed Komainu Receives VARA License\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/nomura-coinshares-ledger-backed-komainu-receives-vara-license",
    "description": "\n                        <p class=\"MsoNormal\" style=\"line-height: 150%;\">Crypto custody joint venture Komainu announced it received a full operating license from Dubai&rsquo;s Virtual Asset Regulatory Authority (VARA).&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Komainu, the joint venture (JV) between Nomura, Ledger, and CoinShares, has been awarded a full operating license from Dubai&rsquo;s Virtual Asset Regulatory Authority (VARA). The operating license allows Komainu to offer its full range of custody services.&nbsp;&nbsp;</p>\nKomainu To Offer Full Range of Custody Services\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">In a press release, the digital asset custody service provider announced that it had been granted the operational license after securing its MVP license in November 2022. Komainu said that achieving &ldquo;this final step in VARA&rsquo;s licensing process allows Komainu to offer its full suite of custody services,&rdquo; which includes institutional staking and collateral management through its Komainu Connect platform to clients in Dubai.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Komainu&rsquo;s Head of Strategy, Sebastian Widmann, said in the press release: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;We see tremendous opportunities to scale our business here amid a significant boom in assets driven by fund formation and exchange launches.&rdquo;</p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Adding,&nbsp;</p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;Dubai has a vibrant digital asset ecosystem and impressive talent pool, and we are proud to contribute to the growth of this innovative financial hub. Our presence and desirable regulatory status in the region marks another differentiator for us as we execute the next phase of our business.&rdquo; </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The regulated digital asset custodian was built by &ldquo;institutions for institutions&rdquo; and came into existence as a JV between digital asset manager CoinShares, digital security company Ledger, and Nomura. The custodian, established in 2018, offers regulatory complaint multi-asset support. Komainu launched in June 2020 and provides custody services to exchanges, financial institutions, asset managers, government agencies, and corporations.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Nomura Holdings announced recently that its subsidiary, Laser Digital Middle East FZE, received a full crypto license in Dubai. Laser Digital&rsquo;s license allows the firm to offer Virtual Asset Broker-Dealer Services and Virtual Asset Management and Investment Services.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-23T16:00:00.000Z",
    "title": "\n                        BTC/USD 22793 Major Downside Target:  Sally Ho’s Technical Analysis – 24 August 2023\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/btcusd-22793-major-downside-target-sally-hos-technical-analysis-24-august-2023",
    "description": "\n                        <p class=\"MsoNormal\">BTC/USD 22793 Major Downside Target:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 24 August 2023</p>\n<p class=\"MsoNormal\">Bitcoin (BTC/USD) continued to experience expanding volatility early in the Asian session as the pair hovered around the 26000 figure after trading as low as the 25350 area, representing a test of the 23.6% retracement of the recent appreciating range from 24750 to 25537.40.&nbsp; &nbsp;Upward pressure then lifted BTC/USD to the 26180.54 area, representing a test of the 23.6% retracement of the wider appreciating range from 24750 to 26589.41.&nbsp;&nbsp; The recent fresh multi-month low around the 25234.76 area represented a test of a major downside price objective around the 25128.94 area that is associated with selling pressure that increased around the 31862.21 and 30421.29 levels in July.&nbsp;&nbsp; Major Stops were elected below the 27620.46 area during the decline, another downside price objective linked to recent downward pressure around the 30222 and 29665.27 areas.&nbsp; Major Stops were also elected below the 27991.29 area, representing the 23.6% retracement of the broader appreciating range from 15460 to 31862.21.&nbsp;&nbsp; </p>\n<p class=\"MsoNormal\">Areas of technical support and potential buying pressure in appreciating ranges from the 15460 and 19568.52 levels include the 23661, 22793, and 21725 levels.&nbsp; &nbsp;Following recent selling pressure, areas of technical resistance and potential selling pressure include the 26798, 27139, 27728, 27766, 28316, 28548, 29154, 29330, and 30443 levels.&nbsp; Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp;&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p class=\"MsoNormal\">Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 27110.97 and the&nbsp;50-bar MA&nbsp;(Hourly) at 26008.43.</p>\n<p class=\"MsoNormal\">Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p class=\"MsoNormal\">Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p class=\"MsoNormal\">On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p class=\"MsoNormal\" style=\"tab-stops: right 6.5in;\">On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </p>\n<p class=\"MsoNormal\" style=\"tab-stops: right 6.5in;\">View Yesterday&rsquo;s Trading Analysis</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-23T15:50:56.000Z",
    "title": "\n                        Solana (SOL) and Polygon (MATIC) Downtrend Creates Opportunity for Everlodge (ELDG) Buyers\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/solana-sol-and-polygon-matic-downtrend-creates-opportunity-for-everlodge-eldg-buyers",
    "description": "\n                        <p class=\"s6\">As Solana (SOL) and Polygon (MATIC) prices dip, Everlodge investors find a silver lining. Experts suggest investors should not avoid what this new platform has to offer.</p>\n<p class=\"s6\">So, let's explore current opportunities available in the crypto market.</p>\n<p>Join the Everlodge presale and win a luxury holiday to the Maldives</p>\nSolana (SOL) gains high liquidity while the token trades at $21.91\n<p class=\"s6\">Recently, Solana (SOL) shared great news. It is now listed among the top liquid altcoins on Coinbase. According to Kaiko, Solana (SOL) has more than $3 million in liquidity. Such flexible liquidity makes the assets convertible. Hence, Solana (SOL) users can convert assets into cash without any market price impact.</p>\n<p class=\"s6\">Furthermore, some data also suggests that Solana (SOL) is more liquid than XRP and DOGE. Despite this, Solana (SOL) couldn't save itself from the market downturn. Moreover, the SEC lawsuit also declined its value.</p>\n<p class=\"s6\">The token dropped by 11.08% in the past week. Additionally, the total Solana (SOL) token volume has been over 35% down in the past 24 hours. Currently, it is trading at $21.9, a 0.98% rise in a day. Further, the price forecasts suggest the Solana (SOL) token may trade at $21.63 on average.</p>\n<p></p>\nPolygon (MATIC) may join Avorak's AI: the token trades at $0.5798\n<p class=\"s6\">Polygon (MATIC) is among the platforms that support Blockchain and AI pairs. Moreover, it has all the qualities an AI project needs to enter blockchain. In fact, Polygon (MATIC) officials believe that it has ideal testing space for AI development. Hence, rumors on collaboration between Polygon (MATIC) and Avorak's AI platform are spreading.</p>\n<p class=\"s6\">Furthermore, the crypto platform has a scalable network that can test AI solutions. Polygon's (MATIC) scalability may play a great role in AI growth across the network. The rapid and cheaper transactions of Polygon (MATIC) also make it easy to deploy AI solutions.</p>\n<p class=\"s6\">Moreover, platforms like Coinbase ensure investors access Polygon (MATIC) easily. Hence, support from big exchanges can assure longer success for Avorak's AI solution. It may help Polygon (MATIC) gain the needed talent and resources for developing the AI platform.</p>\n<p class=\"s6\">It may also help Polygon (MATIC) flip its price downturn. Currently, the Polygon (MATIC) token is trading at $0.5798, a 0.31% drop in a day. Experts suggest a price rise of $0.72 in later months, for Polygon (MATIC).</p>\nEverlodge (ELDG) may rule the real estate industry\n<p class=\"s6\">The real estate industry is thriving with a market size of more than $7,063 trillion. But buying real estate needs a big financial commitment. This is where Everlodge comes into the picture.</p>\n<p class=\"s6\">It is a unique blockchain-based property marketplace. Users can invest in vacation homes and hotels, and share ownership. The platform enables investment services through NFT minting and timeshare. But, investors don't need to pay for the entire property. The platform divides the property's NFT into smaller fractions. Thus, anyone can buy the cheaper equity of the NFT.</p>\n<p class=\"s6\">Moreover, these NFTs have direct links to real properties. Thus, their worth is bound to rise in the future. The platform's native token, ELDG, also brings various advantages to its holders. These include the following:</p>\n● Discounts on trading costs\n● Staking rewards\n● Vacation giveaways\n<p class=\"s6\">Furthermore, the ELDG tokens&rsquo; presale is now underway, starting at an initial price of $0.01. Market forecasts suggest a 30 times increase in token price on the launch date.</p>\n<p class=\"s6\">So, sign up early, as tokens are selling fast.</p>\nFind out more about the Everlodge (ELDG) Presale\n<p class=\"s14\">Website: https://www.everlodge.io/</p>\n<p class=\"s6\">Telegram: https://t.me/everlodge</p>\n<p class=\"s6\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-23T16:03:02.000Z",
    "title": "Biggest Movers: BNB Rebounds From 1-Year Low, SHIB Surges Higher",
    "url": "https://news.bitcoin.com/biggest-movers-bnb-rebounds-from-1-year-low-shib-surges-higher/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2174136721-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: BNB Rebounds From 1-Year Low, Whilst SHIB Surges Higher\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2174136721-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2174136721-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2174136721-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2174136721-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2174136721-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2174136721-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2174136721.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />BNB was one of Wednesday&#x2019;s biggest movers, as the token rebounded from a recent one-year low. The price decline came as crypto exchange Binance came under scrutiny for allegedly assisting sanctioned Russian clients in moving funds abroad. Shiba inu also rose, following recent losses. BNB BNB, the native token of cryptocurrency exchange Binance, rose by [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T15:55:54.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T15:51:36.000Z",
    "title": "Thailand’s prime minister-elect sparks speculation with shocking crypto connections",
    "url": "https://www.cryptopolitan.com/thailands-prime-minister-elect-on-crypto/",
    "description": "On August 22, Thailand&#8217;s parliament made a significant decision by electing real estate mogul Srettha Thavisin as the forthcoming prime minister of the nation. Thavisin, renowned for his past role as the President and CEO of Sansiri, a prominent real estate development firm in Thailand, also boasts a connection to the cryptocurrency realm. Srettha Thavisin, ... <a title=\"Thailand&#8217;s prime minister-elect sparks speculation with shocking crypto connections\" class=\"read-more\" href=\"https://www.cryptopolitan.com/thailands-prime-minister-elect-on-crypto/\" aria-label=\"More on Thailand&#8217;s prime minister-elect sparks speculation with shocking crypto connections\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-23T16:04:10.000Z",
    "title": "USDC to launch on Base, Polkadot and four more platforms",
    "url": "https://crypto.news/usdc-to-launch-on-base-polkadot-and-four-more-platforms/",
    "description": "Circle, the issuer of USDC, said the stablecoin will now be available on six more blockchains and layer-2 platforms, including Base and Polkadot"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-23T15:42:45.000Z",
    "title": "FBI identifies six Bitcoin addresses controlled by North Korean hackers",
    "url": "https://crypto.news/fbi-identifies-six-bitcoin-addresses-controlled-by-north-korean-hackers/",
    "description": "The US Federal Bureau of Investigation (FBI) has identified six Bitcoin (BTC) wallets with over 1,500 BTC that&#8217;s reportedly connected to the Lazarus Group, a hacking group allegedly sponsored by the Democratic People&#8217;s Republic of North Korea (DPRK).  Lazarus Group,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T16:00:45.000Z",
    "title": "This Bitcoin Indicator Is On The Verge Of A Bullish Breakout",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-indicator-on-the-verge-of-bullish-breakout/",
    "description": "A Bitcoin on-chain indicator is currently attempting a breakout that could turn out to be a bullish signal for the asset&#8217;s value. Bitcoin Active Entities Is Trying To Escape Network Stagnation Range In a new post on X, Jamie Coutts, a Bloomberg Intelligence analyst, has discussed the BTC active entities metric, and how it has a strong relationship with the coin&#8217;s price. The &#8220;active entities&#8221; here are a measure of the unique total amount of Bitcoin addresses that are participating in some kind of transaction activity on the blockchain. Naturally, both senders and receivers are counted by the metric. When the value of this metric rises, it means that an increasing number of users are engaging with the network. Such a trend is a sign of growing adoption for the asset. On the other hand, declining values of the indicator imply that interest in the cryptocurrency may be waning, as fewer addresses are becoming active on the blockchain. The analyst has pointed out that the active entities metric has a high r-squared value with Bitcoin. The r-squared values of the different BTC-related metrics &#124; Source: @Jamie1Coutts on X From the table, it&#8217;s visible that the r-squared value for the active entities is 0.55. What this means is that 55% of all fluctuations in the cryptocurrency&#8217;s price can be explained by this variable. Related Reading: Will Bitcoin Show A Repeat Of The March Rebound? There are only a few metrics with a higher r-squared value, making the active entities an indicator with one of the strongest statistical relationships with BTC. &#8220;Importantly, this is also a stable relationship over time (ex the wonky pre-2012 data),&#8221; Coutts notes. Looks like the r-squared value of the indicator has been quite stable since 2012 &#124; Source: @Jamie1Coutts on X Now, here is a chart that shows how the Bitcoin active entities have changed during the history of the cryptocurrency: The trend in the metric's value over the years &#124; Source: @Jamie1Coutts on X As displayed in the graph, the Bitcoin active addresses have stagnated around each of the cycle lows, but in the periods between them, it has seen a rise, although the pace has been getting slower over time. Related Reading: Bitcoin Dip Worth Buying? What Market Sentiment Suggests Since 2021, the indicator has been inside a rather long phase of stagnation, as the indicator has been unable to escape out of a particular range. It would appear, however, that things might be starting to change for the better. The indicator's value has been on the rise in recent days &#124; Source: @Jamie1Coutts on X The CMT explains that it&#8217;s looking like a TA-style breakout so far, but it&#8217;s not yet fully clear whether the Bitcoin active entities have truly escaped the stagnation range. If the metric can manage to stay above the range for the next few weeks, it might be a confirmation that the extra entities that have started trading on the network are truly planning to stick around, and hence, that constructive adoption is finally picking up for Bitcoin. BTC Price At the time of writing, Bitcoin is trading at around $25,900, down 11% in the last week. BTC has continued to struggle recently &#124; Source: BTCUSD on TradingView Featured image from André François McKenzie on Unsplash.com, charts from TradingView.com, Bloomberg Intelligence"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T16:07:38.000Z",
    "title": "Ethereum’s Layer-2 Solutions Achieve All-Time High in Transaction Speeds",
    "url": "https://www.crypto-news-flash.com/ethereums-layer-2-solutions-achieve-all-time-high-in-transaction-speeds/?utm_source=rss&utm_medium=rss&utm_campaign=ethereums-layer-2-solutions-achieve-all-time-high-in-transaction-speeds",
    "description": "<img width=\"1920\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/ethereum-7190848_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/ethereum-7190848_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/ethereum-7190848_1920-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/ethereum-7190848_1920-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/ethereum-7190848_1920-768x576.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/ethereum-7190848_1920-1536x1152.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Ethereum&#8217;s Layer 2 solutions hit a milestone on August 21st, reaching 54 transactions per second (TPS). First-time transacting wallets surged, surpassing Ethereum&#8217;s activity on occasion. In a remarkable development, Ethereum&#8217;s Layer 2 solutions have attained a remarkable milestone in transaction processing efficiency. On August 21st, these solutions facilitated an average of 54 transactions per second [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-23T16:06:00.000Z",
    "title": "Shiba Inu (SHIB) Price Hikes Post-Upgrade, Will the Resistance Hold?",
    "url": "https://coinedition.com/shiba-inu-shib-price-hikes-post-upgrade-will-the-resistance-hold/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba Inu Price Hikes Post Upgrade\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Price-Hikes-Post-Upgrade-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Shiba Inu (SHIB) market has enjoyed bullish momentum after Shibarium&#8217;s fourth upgrade on August 22, with bulls taking the upper hand. However, early in the day, bullish strength faded, resulting in a negative plunge to a 24-hour low of $0.000007744 before support reemerged. However, buyers battled back and wiped out the negative trend, sending the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/shiba-inu-shib-price-hikes-post-upgrade-will-the-resistance-hold/\">Shiba Inu (SHIB) Price Hikes Post-Upgrade, Will the Resistance Hold?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]