[
  {
    "source": "Decrypt",
    "date": "2023-06-19T10:51:35.000Z",
    "title": "Terra Co-Founder Do Kwon Denies Forged Passport Allegations",
    "url": "https://decrypt.co/145213/terra-co-founder-do-kwon-denies-forged-passport-allegations",
    "description": "Terraform Labs’ CEO Do Kwon told a court in Montenegro he never had any intentions of forging his travel documents. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-19T10:46:00.000Z",
    "title": "Binance cancels registration in the UK amid regulatory scrutiny",
    "url": "https://cointelegraph.com/news/binance-cancels-registration-in-the-uk-amid-regulatory-scrutiny",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/3b2ca2d3-db60-4a55-af4d-dd2e82b48455.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance’s deregistration with the FCA did not have an operational impact, as it had never done business in the United Kingdom, a regional manager said.</p>\n                    <p><p>Troubled cryptocurrency exchange Binance continues to withdraw from major markets amid the ongoing pushback from global regulators.</p><p>Binance Markets Limited (BML), Binance’s United Kingdom-based subsidiary, has officially canceled registration with the Financial Conduct Authority (FCA).</p><p>After deregistration, no Binance entity is authorized by the FCA to provide any services in the United Kingdom, the regulator <a href=\"https://register.fca.org.uk/s/firm?id=001b000000nojfNAAQ\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> on its website.</p><p>According to the FCA, the authority completed Binance’s cancellation request of BML’s permissions with the authority on May 30, 2023.</p><p>“Following the completion of the cancellation of permissions the firm is no longer authorised by the FCA,” the regulator noted in an update on June 7.</p><p>The cancellation of BML’s registration did not have an operational impact on Binance, as it had never been operational in the country, a regional manager at Binance reportedly <a href=\"https://www.financemagnates.com/cryptocurrency/binance-markets-limited-deregisters-with-the-uks-fca/\" target=\"_blank\" rel=\"noopener nofollow\">said</a>.</p><p>Ilir Laro, Binance’s sub-regional manager for growth in the U.K. and Europe, argued that BML has never conducted “any type of regulated business” in the United Kingdom. He added:</p><blockquote>“BML was successfully acquired back in 2020 by Binance Group, intended to launch a regulated business in the UK. This attempt was not successful, however, and has since then remained dormant since its acquisition.”</blockquote><p>Laro took to Twitter on Sunday to also point out that Binance still holds five regulated entities in Europe, including France, Italy, Spain, Poland and Sweden. “As MiCA kicks into force in 2024/5, we are moving focus to getting ready which means some consolidating in order to passport throughout Europe,” he <a href=\"https://twitter.com/ilir_laro/status/1670330407508647936?s=20\" target=\"_blank\" rel=\"noopener nofollow\">noted</a>.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-france-investigation-report\"><strong><em>Binance under investigation in France since February 2022: Report</em></strong></a></p><p>The exec also mentioned the reasoning behind Binance’s regulatory retreats in countries like Cyprus, the Netherlands and Nigeria.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Some more FUD. Let&#39;s address it:<br><br>Cyprus - we have withdrawn our VASP registration as we prepare for MiCA<br><br>Holland - we have stopped offering services due to not obtaining a local license<br><br>Nigeria - the complaint is against &quot;Binance Nigeria Limited&quot; which is not owned by Binance</p>&mdash; Ilir  Binance (@ilir_laro) <a href=\"https://twitter.com/ilir_laro/status/1670329578580049927?ref_src=twsrc%5Etfw\">June 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Binance previously had some regulatory issues in the United Kingdom. In 2021, the FCA ordered Binance to <a href=\"https://cointelegraph.com/news/uk-financial-watchdog-orders-binance-to-halt-regulated-activity-in-the-country\">stop all regulatory activities</a> in the country.</p><p>The news comes shortly after Binance’s chief strategy officer Patrick Hillmann expressed the company’s <a href=\"https://cointelegraph.com/news/binance-looks-to-the-uk-for-regulation-amid-us-crypto-crackdown\">commitment to be regulated in the U.K.</a> amid Binance’s issues in the United States. As previously reported, Binance is facing two civil lawsuits from U.S. regulators, including the <a href=\"https://cointelegraph.com/news/5-key-highlights-sec-lawsuit-binance\">Securities and Exchange Commission</a> and the <a href=\"https://cointelegraph.com/news/binance-and-cz-sued-by-cftc-over-us-regulatory-violations\">Commodity Futures Trading Commission</a>.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong><em>Bitcoin is on a collision course with ‘Net Zero’ promises</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-19T10:56:26.000Z",
    "title": "Roughly 150K Bitcoin became illiquid in past 30 days",
    "url": "https://cryptoslate.com/insights/roughly-150k-bitcoin-became-illiquid-in-past-30-days/",
    "description": "<p>Quick Take &#8216;Illiquid supply&#8217; refers to the amount of Bitcoin held by entities and is not readily available for trading or selling. Glassnode analysis identified the highly liquid supply in a noticeable downward trend. &#8220;Currently residing near a cycle low of 2.94M BTC, a -620K BTC decrease since Jan 2022&#8221;. Glassnode further said, &#8220;This suggests [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/roughly-150k-bitcoin-became-illiquid-in-past-30-days/\">Roughly 150K Bitcoin became illiquid in past 30 days</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-19T11:05:46.000Z",
    "title": "Bitcoin is the way out of a bizarre monetary system",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-is-the-way-out-of-a-bizarre-monetary-system",
    "description": "<p>How the financial system works is bizarre beyond belief. Bitcoin is the life raft that provides unseizable wealth.</p>\nHow does one explain this monetary system?\n<p>If an alien landed on earth and asked how the financial system worked, there is probably no economist who would be able to explain how such a complex and outlandish system actually functions.</p>\n<p>The heart of the world&rsquo;s financial system is arguably the United States, and the Federal Reserve Bank. A bank that isn&rsquo;t federal and has no reserves. In fact, the Federal Reserve is a private bank, with all the big US banks helping to run it and being among the shareholders.</p>\n<p>The alien might ask how on earth, or even in the galaxy, can a private bank run the financial affairs of the most powerful country in the world, and in turn influence the entire global monetary and banking system?</p>\n<p>The answer might be that it just kind of happened. Edward Griffin's &ldquo;The creature from Jekyll Island&rdquo; does the best job in telling the story of how a group of extremely powerful bankers and politicians travelled to a little frequented destination and held a secret meeting on setting up a central bank with which to control the country&rsquo;s money.</p>\n<p>They were successful beyond belief and the bank endures to this day, with the world&rsquo;s financial markets completely in thrall whenever the Chairman of the Federal Reserve makes his utterances on what the central bank will do next.</p>\nHow has the system endured?\n<p>Some might say that what it has already done is enough, as when President Nixon announced back in 1971 that the dollar would be removed from its gold backing, allowing the country to print currency with almost no restraint ever since then.</p>\n<p>The alien could then ask how the dollar was able to keep its purchasing power, to say nothing of all the world&rsquo;s fiat currencies which were tied to it. Also, hard assets such as gold - wouldn&rsquo;t they rocket to the heavens?</p>\n<p>The answer would be that the dollar has lost 99% of its purchasing power since it was established in 1914, just after the creation of the Federal Reserve Bank.&nbsp;</p>\n<p>Gold has kept its purchasing power, as it has done throughout the history of the world and just continues to go up against the dollar despite the massive amount of manipulation that goes on in the paper futures exchanges such as the COMEX.</p>\n<p>Finally the alien may ask how the population of the US and that of other countries hasn&rsquo;t risen up to protest the theft of purchasing power by the banks? The answer would be that the population is kept from discussing or hearing about how the financial system works, and this dearth of knowledge is throughout schools, colleges, and universities.</p>\nHow the story ends well\n<p>However, the good news that could be told to the alien is that a decentralised hard money system has managed to grow under the radar of those in charge of the monetary system. It has spread across the world to become the most powerful and secure computer network that the world has ever seen.</p>\n<p>Its name is Bitcoin, and it provides wealth that cannot be taken away from the holder, not by force, nor by manipulation of central banks that drive the world&rsquo;s middle classes into poverty.</p>\n<p>This is a story that can end well, and will perhaps leave the alien not feeling as sorry for us. Here is a world where an evil monetary system prevails, but where a gift in the form of Bitcoin can provide an exit out of the slavery that fiat currencies inflict.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-19T11:00:00.000Z",
    "title": "ChainGPT Token ($CGPT) is Launching on Ethereum - Bridging Web3 AI",
    "url": "https://cryptodaily.co.uk/2023/06/chaingpt-token-cgpt-is-launching-on-ethereum-bridging-web3-ai",
    "description": "<p>Broadening its horizons and looking to increase its on-chain footprint, ChainGPT has begun its interchain movement by bridging the $CGPT token to the Ethereum Network.</p>\n<p>Enabled through a partnership with ChainPort, KuCoin, BitGet, and other top-tier Web3 partners, ChainGPT has developed a decentralized bi-directional bridge between the Binance Smart Chain and Ethereum for the $CGPT token. Now users will be able to transfer their $CGPT to and from the ETH and BNB/BSC networks seamlessly.</p>\n<p>With the implementation of the bridge, the $CGPT token&rsquo;s on-chain presence expands, gaining access to the robust and vibrant ecology of the Ethereum network. Integrations into many of the world's leading DEFI protocols, the opening of token pools on DEXs, and the provision of added trading pairs against a broader segment of popular tokens becomes possible.</p>\nWhat is $CGPT?\n<p>At its core, $CGPT is enabling a decentralized economy for AI services. As the native token of the ChainGPT ecosystem, $CGPT serves the dual functions of a utility and governance tool. Its utility purpose is to provide access to a full suite of AI-powered Web3 tooling from NFT minting and community management to smart contract auditing and creation to launchpad tiering and beyond. Its governance function relates to the role of $CGPT in distributing ownership rights over the platform throughout its community members and giving them the opportunity to help steer the direction of the project&rsquo;s development. View the ChainGPT DAO here.</p>\nWhere will the ERC-20 version of $CGPT be supported?\n<p>ChainGPT has been in communications with a multitude of exchanges that would be able to provide support immediately after instantiation. At this time, Kucoin, BitGet, and ByBit have confirmed support with a few select other major exchanges signaling their willingness.</p>\n<p>On the front of decentralized venues for support, the most popular DEX in the world, UniSwap, will have a $CGPT token pool opened to provide instant listing and liquidity on Ethereum.</p>\n<p>With the help of ChainPort, $CGPT&rsquo;s presence on major crypto directories and analytics portals including CoinGecko and Etherscan has been expedited.</p>\n<p>Bridge Specifications</p>\n<p>📆 Launch Date: June 19th, 2023🕛 Launch time: 10AM EST / 2PM UTC</p>\n<p>Bridge Partner: ChainPort (app.chainport.io)Exchanges: Uniswap, KuCoin, BitGet, GateioMarket Makers: KaironLabs &amp; CLS</p>\n<p>$CGPT Contract Address on Ethereum:0x25931894a86d47441213199621f1f2994e1c39aa</p>\n<p>$CGPT Contract Address on Binance Smart Chain:0x9840652DC04fb9db2C43853633f0F62BE6f00f98</p>\n<p>CoinMarketCap: https://coinmarketcap.com/currencies/chaingpt/ DexCheck: https://dexcheck.io/app/bsc/chart/0xcfe847aae922cbe3dcbba61dbb1ed97d2124d322&nbsp;</p>\n<p>View the DAO proposal for more information about the bridging, here.</p>\nAbout ChainGPT\n<p>ChainGPT is the leading provider of AI-powered Infrastructure for the crypto, blockchain, and Web3 industry. From automated smart contract generation and auditing, to autonomous community management, advanced Web3 AI chatbot, AI-powered news aggregation, and NFT generation, ChainGPT is the most sophisticated, end-to-end AI solution on the market.</p>\n<p>&nbsp;</p>\n<p>Contact Person(s): Jake Wallace / Cameron French / Ilan Rakhmanov&nbsp;Contact Email(s): jacob@chaingpt.org / cameron@chaingpt.org / ceo@chaingpt.org</p>\n<p>&mdash;&gt; To learn more about ChainGPT visit the official ChainGPT.org website</p>\n<p>&mdash;&gt; For all inquiries, please contact info@chaingpt.org</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-19T11:00:40.000Z",
    "title": "How to Recover a Lost PIN Number for a Trezor Hardware Wallet – KeychainX Expert Explains",
    "url": "https://news.bitcoin.com/how-to-recover-a-lost-pin-number-for-a-trezor-hardware-wallet-keychainx-expert-explains/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/trezor-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"How to Recover a Lost PIN Number for a Trezor Hardware Wallet - KeychainX Expert Explains\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/trezor-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/trezor-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/trezor-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/trezor-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/trezor-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/trezor-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/trezor.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Storing your digital assets on a cryptocurrency hardware wallet such as Trezor is considered to be one of the safest ways to secure your funds. If you have lost your PIN number to access it however, you might be afraid your money is completely gone as there is no-one else that can remember it for [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T11:07:29.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T10:46:37.000Z",
    "title": "BTC and ETH selling pressure declines as data suggests looming accumulation ",
    "url": "https://crypto.news/btc-and-eth-selling-pressure-declines-as-data-suggests-looming-accumulation/",
    "description": "On-chain data indicates that bitcoin (BTC) and ethereum (ETH) have observed negative exchange net flows in the past week, contrasting the positive net flow witnessed with tether (USDT).&#160; Amid this trend, the bitcoin supply last active in the past ten&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T10:43:04.000Z",
    "title": "Do Kwon blames Chinese agency for fake travel documents issuance",
    "url": "https://crypto.news/do-kwon-blames-chinese-agency-for-fake-travel-documents-issuance/",
    "description": "Do Kwon has denied forging his travel documents. Kwon has told a Podgorica District Court that the fake passport and travel documents allegedly found on him were issued by an unnamed Chinese agency recommended by a friend.  Do Kwon, the&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T11:00:35.000Z",
    "title": "Arbitrum (ARB) and Aptos (APT) Stagnate, While InQubeta (QUBE) Presale Soars, Dominating June 2023",
    "url": "https://www.crypto-news-flash.com/arbitrum-arb-and-aptos-apt-stagnate-while-inqubeta-qube-presale-soars-dominating-june-2023/?utm_source=rss&utm_medium=rss&utm_campaign=arbitrum-arb-and-aptos-apt-stagnate-while-inqubeta-qube-presale-soars-dominating-june-2023",
    "description": "June 2023 has been a month of contrasting fortunes in the crypto market, with InQubeta (QUBE) presale experiencing a meteoric rise in popularity, while projects like Arbitrum (ARB) and Aptos (APT) face stagnation. InQubeta&#8217;s exceptional performance can be attributed to several factors, including its recent audit by Hacken and the anticipation of an upcoming price [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T10:50:43.000Z",
    "title": "Planet IX: Unleashing the Power of Polygon and Chainlink for Next-Gen Gaming",
    "url": "https://www.crypto-news-flash.com/planet-ix-unleashing-the-power-of-polygon-and-chainlink-for-next-gen-gaming/?utm_source=rss&utm_medium=rss&utm_campaign=planet-ix-unleashing-the-power-of-polygon-and-chainlink-for-next-gen-gaming",
    "description": "Planet IX stands out as a comprehensive platform offering DeFi, GameFi, NFT trading marketplace, and more, with plans to expand into mobile gaming and cross-chain interoperability. Chainlink&#8217;s services, such as Chainlink VRF and Chainlink Automation, play a crucial role in Planet IX&#8217;s economy, enhancing security and providing essential Web3 functionality. #ChainlinkBUILD member @Planetix0 is building [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T10:46:20.000Z",
    "title": "Is ApeMax the next 100x crypto coin riding the Meme Coin Hype to the Moon?",
    "url": "https://www.crypto-news-flash.com/is-apemax-the-next-100x-crypto-coin-riding-the-meme-coin-hype-to-the-moon/?utm_source=rss&utm_medium=rss&utm_campaign=is-apemax-the-next-100x-crypto-coin-riding-the-meme-coin-hype-to-the-moon",
    "description": "In the vast and thrilling landscape of cryptocurrencies, meme coins have found a niche of their own. These meme coins, known for their enjoyable and playful demeanor, have experienced an unprecedented surge in popularity among avid supporters of the crypto community. ApeMax, with its endearing mascot Max the Ape, has managed to enthrall the fascination [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-19T10:44:35.000Z",
    "title": "Crypto.com’s Internal Trading Teams Raise Concerns: Reports Say",
    "url": "https://coinedition.com/crypto-coms-internal-trading-teams-raise-concerns-reports-say/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/014-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/014-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/014-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/014-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/014-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/014-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/014-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/014-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/014-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/014-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/014-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/014-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/014-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/014-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/014-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/014-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/06/014.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>According to a recent report, the Singapore-based crypto platform Crypto.com implemented dedicated internal teams to engage in token trading with the aim of generating profits, raising concerns in the community. The report reveals that, as per five insiders, Crypto.com runs its own proprietary trading and market-making teams, which are typically handled by distinct private entities. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-coms-internal-trading-teams-raise-concerns-reports-say/\">Crypto.com&#8217;s Internal Trading Teams Raise Concerns: Reports Say</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]