[
  {
    "source": "CoinDesk",
    "date": "2023-10-02T17:47:10.000Z",
    "title": "Sam Bankman-Fried’s Closest Friends Will Testify Against Him. Here’s Who Else We’ll Hear From",
    "url": "https://www.coindesk.com/policy/2023/10/02/sam-bankman-frieds-closest-friends-will-testify-against-him-heres-who-else-well-hear-from/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Several of Bankman-Fried’s former colleagues and friends will testify against the one-time crypto mogul following plea deals they struck with the U.S. Department of Justice, including his former romantic partner Caroline Ellison and childhood friend Gary Wang, who were both deeply involved in the daily workings of both FTX and its quant-driven trading shop, Alameda Research. Another two individuals, who prosecutors have yet to publicly name, may testify if granted immunity, suggesting they may also be tied to the exchange. The DOJ also announced over the weekend that prosecutors intend to call former FTX customers from around the world and investors as witnesses during the trial."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-02T18:02:02.000Z",
    "title": "IMF paper proposes risk assessment framework for integrating crypto into financial system",
    "url": "https://cryptoslate.com/imf-paper-proposes-risk-assessment-framework-for-integrating-crypto-into-financial-system/",
    "description": "<p>The rapid growth of the crypto asset industry in recent years has sparked heightened concerns about potential risks to financial stability, according to a new working paper released by the International Monetary Fund (IMF). The IMF research follows multiple failures in the crypto space, including the collapse of TerraUSD and FTX, which have led to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/imf-paper-proposes-risk-assessment-framework-for-integrating-crypto-into-financial-system/\">IMF paper proposes risk assessment framework for integrating crypto into financial system</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-02T18:03:42.000Z",
    "title": "Coinbase Gets Approval to Offer Crypto Payments Services in Singapore",
    "url": "https://cryptobriefing.com/coinbase-gets-approval-offer-crypto-payments-singapore/?utm_source=feed&utm_medium=rss",
    "description": "Coinbase secures a Major Payment Institution license to provide digital token services to retail and institutional clients."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-02T17:47:03.000Z",
    "title": "TYRION Advances Decentralized Advertising with Strategic Move to Coinbase's Base Chain",
    "url": "https://cryptodaily.co.uk/2023/10/tyrion-advances-decentralized-advertising-with-strategic-move-to-coinbases-base-chain",
    "description": "TYRION Advances Decentralized Advertising with Strategic Move to Coinbase's Base Chain"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-02T17:46:31.000Z",
    "title": "Responsible AI: Bridging the Gap in the Quest for Ethical AI",
    "url": "https://www.cryptopolitan.com/responsible-ai-bridging-gap-in-the-quest/",
    "description": "As AI continues to evolve, so does the need for responsible and ethical practices surrounding its development and deployment. Recent lawsuits involving copyright issues related to scraped data have highlighted the importance of responsible AI. However, the legal landscape often lags behind technological innovation, leaving many gray areas that only the courts can clarify. This ... <a title=\"Responsible AI: Bridging the Gap in the Quest for Ethical AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/responsible-ai-bridging-gap-in-the-quest/\" aria-label=\"More on Responsible AI: Bridging the Gap in the Quest for Ethical AI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-02T17:43:50.000Z",
    "title": "TYRION Advances Decentralized Advertising with Strategic Move to Coinbase’s Base Chain",
    "url": "https://www.cryptopolitan.com/tyrion-advances-decentralized-advertising-with-strategic-move-to-coinbases-base-chain/",
    "description": "Toronto, Canada, October 2nd, 2023, Chainwire In an exhilarating development in the world of crypto and blockchain, TYRION the trailblazer in decentralized advertising, announces its strategic move to build its advertising platform on Coinbase&#8217;s Base Chain. This monumental announcement underscores TYRION’s commitment to leveraging cutting-edge technology to offer unparalleled advertising solutions, anchored in transparency, efficiency, ... <a title=\"TYRION Advances Decentralized Advertising with Strategic Move to Coinbase&#8217;s Base Chain\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tyrion-advances-decentralized-advertising-with-strategic-move-to-coinbases-base-chain/\" aria-label=\"More on TYRION Advances Decentralized Advertising with Strategic Move to Coinbase&#8217;s Base Chain\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-02T18:00:35.000Z",
    "title": "Bitcoin MPI Forms Death Cross, End of The Rally?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-mpi-forms-death-cross-end-rally/",
    "description": "On-chain data shows the Bitcoin Miners&#8217; Position Index (MPI) has formed a death cross recently, a sign that the asset&#8217;s rally may end. Bitcoin MPI Has Formed A Bearish Crossover Recently As pointed out by an analyst in a CryptoQuant Quicktake post, the 365-day moving average (MA) of the BTC MPI has crossed above the 90-day recently. The &#8220;MPI&#8221; here refers to an indicator that measures the ratio between the miner outflows and the yearly MA. The &#8220;miner outflows&#8221; are the amounts these chain validators transfer out of their combined wallets. Generally, the miners take out their coins for selling purposes, so the miners outflows can measure how much dumping they are currently partaking in. Miner outflows are usually not that unusual, though, as this cohort has to constantly sell what they mine to pay off their running costs like electricity bills. What can be notable, however, is whether their selling deviates from the norm. Related Reading: Ethereum ETF: Valkyrie Halts Purchase Of ETH Futures Contracts The MPI provides us with information about precisely this since it compares the outflows against their 365-day MA. When the metric is greater than 0, the miners are selling more than the average for the past year, while negative values imply the opposite. Now, here is a chart that shows the trend in the 90-day and 365-day MAs of the Bitcoin MPI over the last few years: The two MAs of the metric appear to have crossed the path of each other in recent days &#124; Source: CryptoQuant The above graph shows that the 90-day MA Bitcoin MPI (colored in orange) has declined during the last few weeks. Recently, the metric crossed below the 365-day MA, consolidating sideways. Historically, the crosses of the two MAs of the BTC MPI have appeared to be significant for the cryptocurrency&#8217;s price. In the chart, the quant has highlighted the major crossovers that occurred during the last few years. Whenever the indicator&#8217;s 90-day MA has observed a cross above the 365-day MA, BTC has gone off to witness some bullish momentum. Such a cross preceded the April 2019 rally, the 2021 bull run, and the rally that started this January. On the other hand, the opposite type of cross has proven to be bearish for the asset&#8217;s value, as steep declines have followed it. Since this death cross has once again formed for Bitcoin recently, it may signal that this year&#8217;s rally has reached its conclusion. Related Reading: Chainlink Signal That Preceded Crashes Of 34% Is Back However, the crossover is still in the process of forming, meaning that the coming weeks may be important. If the 90-day MA can turn itself around quickly, then the death cross may not form, but if the metrics continue in their current trajectory, the bearish signal would be solidified. BTC Price Regardless of the death cross, Bitcoin has observed some sharp bullish momentum during the past 24 hours, as the asset has surged to the $28,300 level. BTC has registered a sharp jump in the past day &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-02T18:00:39.000Z",
    "title": "Can Dogecoin, Shiba Inu, and ApeMax do 1000x in the Next Crypto Bull Run?",
    "url": "https://www.crypto-news-flash.com/can-dogecoin-shiba-inu-and-apemax-do-1000x-in-the-next-crypto-bull-run/?utm_source=rss&utm_medium=rss&utm_campaign=can-dogecoin-shiba-inu-and-apemax-do-1000x-in-the-next-crypto-bull-run",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-3.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-3.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-3-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As the tides of the cryptocurrency markets ebb and flow, cryptocurrency enthusiasts and fans are constantly scouting for the most appealing contenders. The world of crypto is abuzz with chatter about potential rockets that could lead the next bull rally. While the likes of Dogecoin and Shiba Inu have already made headlines in previous cycles, [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-02T18:05:28.000Z",
    "title": "Sergey Nazarov Says Massive Meltdown of Banking System Could Lead to Fast Adoption of New Crypto Economy by 2030",
    "url": "https://dailyhodl.com/2023/10/02/sergey-nazarov-says-massive-meltdown-of-banking-system-could-lead-to-fast-adoption-of-new-crypto-economy-by-2030/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/01/chainlink-support.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/01/chainlink-support.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/01/chainlink-support.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/01/chainlink-support.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/01/chainlink-support.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/01/chainlink-support.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/01/chainlink-support.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Chainlink (LINK) creator Sergey Nazarov says that a failure of the banking industry and people&#8217;s subsequent disillusion about the traditional financial system could propel crypto into mass adoption mode. In a new interview on Bankless, Nazarov says that he sees two possible scenarios that could play out for crypto and blockchain over the next decade. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/02/sergey-nazarov-says-massive-meltdown-of-banking-system-could-lead-to-fast-adoption-of-new-crypto-economy-by-2030/\">Sergey Nazarov Says Massive Meltdown of Banking System Could Lead to Fast Adoption of New Crypto Economy by 2030</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-02T17:58:03.000Z",
    "title": "Circle Says Stablecoins Are Not Securities, Argues SEC Has No Jurisdiction Over Dollar-Pegged Crypto Assets",
    "url": "https://dailyhodl.com/2023/10/02/circle-says-stablecoins-are-not-securities-argues-sec-has-no-jurisdiction-over-dollar-pegged-crypto-assets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/circle-holds-cash-bank.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/circle-holds-cash-bank.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/circle-holds-cash-bank.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/circle-holds-cash-bank.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/circle-holds-cash-bank.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/circle-holds-cash-bank.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/circle-holds-cash-bank.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The issuer of the stablecoin USDC is refuting the general assertion of the U.S. Securities and Exchange Commission (SEC) that most crypto assets are securities. Court documents show that Circle has filed an amicus curiae brief in the SEC&#8217;s case against crypto titan Binance.  In the brief, Circle says the SEC is not empowered to regulate [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/02/circle-says-stablecoins-are-not-securities-argues-sec-has-no-jurisdiction-over-dollar-pegged-crypto-assets/\">Circle Says Stablecoins Are Not Securities, Argues SEC Has No Jurisdiction Over Dollar-Pegged Crypto Assets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]