[
  {
    "source": "Decrypt",
    "date": "2023-08-08T02:45:18.000Z",
    "title": "Amazon Won't Remove Books Listed Under a Real Author's Name But Allegedly Written With AI",
    "url": "https://decrypt.co/151674/amazon-refuses-authors-request-to-remove-fake-books-written-with-ai",
    "description": "Journalist Jane Friedman says her name is being used to sell books written with AI on Amazon, prompting concerns over author verification."
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-08T03:00:01.000Z",
    "title": "Few Bitcoin Holders Withdrawing BTC From Exchanges, Is Fear Creeping In?",
    "url": "https://www.newsbtc.com/news/few-bitcoin-holders-withdrawing-btc-exchanges-fear-creeping-in/",
    "description": "Recent data from CryptoQuant on August 7 shows that few Bitcoin holders are moving coins away from centralized cryptocurrency exchanges like Binance and Coinbase. Despite BTC prices increasing in recent weeks and teetering close to the $30,000 psychological level, this observation is accurate.  More Bitcoin Held in Exchanges As of July 28, there were 30,663 addresses withdrawing coins from exchanges though prices were relatively higher, trading around $28,000, up from around $25,000 registered on June 14 when 39,311 addresses moved coins. On April 14, when BTC changed hands at around $30,000, 132,237 addresses withdrew the coin from exchanges. The drop in the number of exchange addresses moving coins to external, often non-custodial wallets can be a concern, significantly if prices are rising.  The shift also raises important questions about why more Bitcoin holders opt to store coins in exchanges despite these ramps being targets by hackers. Usually, when fewer people transfer their Bitcoin to external, often non-custodial wallets, it might mean they&#8217;re unsure about the uptrend. As such, they keep their coins on exchanges to quickly sell for USDT or traditional currencies like USD or Euro if needed.  Optimism Abound Even with this change, the broader Bitcoin community remains positive about the coin&#8217;s potential in the coming months. This optimism comes partly from recent classifications from agencies like the Securities and Exchange Commission (SEC) and Commodity Futures Trade Commission (CFTC) that expressly endorse Bitcoin as a commodity subject to capital gains tax.  Related Reading: Solana Products See Strong Inflows, Bitcoin And Crypto Lose $107 Million Other digital assets like ETH have not been categorized as such, sowing doubts among some Ethereum holders that US regulators can classify the second most valuable coin as a security. Because of this positive outlook on the world&#8217;s most valuable coin, advanced derivatives, like BlackRock&#8217;s planned launch (if approved) of a spot Bitcoin Exchange-Traded Fund (ETF), are being developed. Complex Bitcoin trading products are already live in Canada and other parts of the world. Bloomberg Intelligence analysts say that the odds of a Bitcoin ETF getting approved by the SEC are 65%. The increase is partly due to bullish progress, including SEC Chair Gary Gensler&#8217;s comments on Bitcoin, the regulator&#8217;s reportedly insisting that BTC is the only commodity before Coinbase was sued, and the agency accepting re-filing from BlackRock&#8217;s ETF. Related Reading: XRP Journey To $10: Unveiling The Forces That Could Trigger An Upward Momentum While the upcoming halving of Bitcoin in 2024 could be good news, Bloomberg analysts argue that the expected upswing appears to be &#8220;priced in&#8221; based on &#8220;previous cycles.&#8221; Subsequently, analysts think BTC may rally to $50,000 by April 2024, looking at how prices have been performing in the recent few months.  Feature image from Canva, chart from TradingView"
  }
]