[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T23:06:55.000Z",
    "title": "JPMorgan economists foresee steady U.S. economic growth",
    "url": "https://www.cryptopolitan.com/jpmorgan-economists-foresee-steady-growth/",
    "description": "In a significant departure from their earlier forecasts, JPMorgan’s team of economists has abandoned predictions of an imminent U.S. recession. Leading the way is the bank’s Chief U.S. Economist, Michael Feroli, who exudes confidence that the American economy will chart a path of modest yet consistent growth for the remainder of this year and well ... <a title=\"JPMorgan economists foresee steady U.S. economic growth\" class=\"read-more\" href=\"https://www.cryptopolitan.com/jpmorgan-economists-foresee-steady-growth/\" aria-label=\"More on JPMorgan economists foresee steady U.S. economic growth\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-05T23:00:34.000Z",
    "title": "Crypto Funds Vs Bitcoin Holders: Who Was The Better Performer In H1 2023",
    "url": "https://www.newsbtc.com/bitcoin-news/crypto-funds-vs-bitcoin-holders/",
    "description": "A new report has shown investors who held Bitcoin actually outperformed most cryptocurrency funds in the first half of 2023. This is because, between January and June, Bitcoin gained over 80% in value.  Crypto funds, on the other hand, on the other hand, returned only about 15.2% profits on average. While still a positive return, it lagged far behind what regular Bitcoin investors made by just buying and sitting tight.  21e6 Capital’s Crypto Fund Performance in H1 2023 According to a recently released report from Switzerland-based investment adviser 21e6 Capital AG, Bitcoin traders outperformed most crypto funds by 68.8% in H1. Related Reading: Binance Celebrates Significant Milestone After Six Years In Operation This is not surprising, as BTC was one of the best-performing crypto assets in the first half of 2023, seeing massive gains from prospects of the SEC approving a Spot Bitcoin ETF. The price of Bitcoin started the year around $15,500 and climbed to over $31,400 in July. Crypto funds on average generated 15.2% return in the first half of 2023 lol pic.twitter.com/vb8pwYfiX9 — Alex Krüger (@krugermacro) August 5, 2023 Bitcoin outperforming crypto funds is relatively new, as crypto hedge funds are frequently able to outperform the BTC benchmark in the past significantly. But the crypto industry ended 2022 with more of a gloomy sentiment, as the market witnessed regulatory uncertainties and the collapse of FTX and Terra.  This seems to have caused crypto hedge funds to take a safer approach, leaving them with larger-than-normal cash positions. When crypto is hot, that cash doesn’t appreciate like BTC would unless the funds’ assets perform significantly better than Bitcoin. The report also noted that directional crypto funds generally outperformed non-directional crypto funds. Non-directional funds, like arbitrage, lending, and staking, do not depend on the market&#8217;s direction. BTC price holds at $29,000 &#124; Source: BTCUSD on Tradingview.com Outlook for Second Half of 2023: More Gains Ahead for Bitcoin? 21e6 Capital’s latest report shows the general sentiment of the crypto market. Crypto funds had a rough first half of 2023, with many closing down early this year. About 13% of crypto hedge funds shut this year, as a few of them have struggled to present a favorable value proposition to potential investors. Related Reading: Ethereum ETF Race Gets Hotter As SEC Receives 11 Filings In One Week The price of Bitcoin seems to be struggling to break over $30,000, but the outlook for Bitcoin in the second half of 2023 still looks positive. If approved, the price of Bitcoin is expected to spike further in the coming months as major investment companies start to offer Spot Bitcoin ETFs. This influx of capital could spark a fresh bull market for all cryptocurrencies, leading to further gains for BTC holders. This new volume could see the price of BTC rise above $30,000 once more. At the time of writing, BTC is trading at $29,043. Featured image from iStock, chart from Tradingview.com"
  }
]