[
  {
    "source": "CoinDesk",
    "date": "2023-07-18T20:28:09.000Z",
    "title": "If DeFi Wants To Grow, it Has To Embrace Real-World Assets",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/18/if-defi-wants-to-grow-it-has-to-embrace-real-world-assets/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "To scale, DeFi platforms need to attract institutions keen to trade tokenized bonds, equities, and debt, and physical assets such as gold, real estate and art, says Enrico Rubboli of Mintlayer."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-18T20:10:10.000Z",
    "title": "The European Commission’s Web4 strategy is a flop",
    "url": "https://cointelegraph.com/news/european-commission-web4-strategy-flop",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/e943a4b3-a231-4b80-b5de-238e731e0ee8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>There’s a lot of work left to be done on Web 3.0. The European Commission is getting ahead of itself by trying to move to what it calls “Web 4.0.”</p>\n                    <p><p>On July 11, the European Commission formally adopted its <a href=\"https://cointelegraph.com/news/extended-reality-to-create-thousands-of-jobs-by-2025-eu-commission\">new strategy on Web4</a> and virtual worlds with the aim of ensuring “an open, secure, trustworthy, fair and inclusive digital environment” for European Union citizens. The strategy is based on four main pillars, revolving around the empowerment of human resources, support of businesses, further development of public services, and shaping of global standards for “Web 4.0” — a freshly coined term that attempts to preempt the next technological wave.</p><p>While it’s commendable that the European Commission is proactively strategizing for the EU to take the lead on Web 4.0, or Web4, and virtual worlds, we shouldn’t neglect the fact that for all the fanfare of Web3 and the trends that accompanied it, notable credit and financial institutions have so far only firmly and mainly placed their confidence in Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and, to a lesser extent, Ethereum.</p><p>Indeed, it is difficult to assert that <a href=\"https://cointelegraph.com/blockchain-for-beginners/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\">Web3</a> left anything of considerable substance behind it — aside from a sharp but short-lived spike in the Lamborghini and Rolex markets. The sooner that term is forgotten, the sooner we’ll be able to focus again on the areas that do matter.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/time-for-the-sec-to-settle-with-coinbase-ripple\"><strong><em>It’s time for the SEC to settle with Coinbase and Ripple</em></strong></a></p><p>The EU’s general stance on Bitcoin has arguably detracted from its image as a forward-looking, technology-advancing region, and it would do well to either retract or modify previously taken positions on matters such as proof-of-work mining. The reinvention of money is far from a light matter, and if the EU is to take a pincer hold of what ultimately makes the world move, it is well-advised to do so by both advancing its digital euro project and also supporting the other side of the coin, thereby hedging its position to a degree where it is minimizing risks and maximizing possible opportunities.</p><p>In order to do so, it must proverbially unstick the European Central Bank’s head from the sands, limit any anti-Bitcoin publications from the famed Fabio Panetta, and adopt a neutral monetary stance that aligns with a technology-neutral one.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">European Union has introduced its Web4 and virtual worlds strategy<br><br>The strategy is in line with the 2030 objectives of the Digital Decade policy program and three of its key pillars of digitalization: skills, business, and public services. <br><br>The outlook of the EU economy beyond… <a href=\"https://t.co/lg1X5Yvccj\">pic.twitter.com/lg1X5Yvccj</a></p>&mdash; FanBe_web3 (@FanBe_web3) <a href=\"https://twitter.com/FanBe_web3/status/1679130722441871362?ref_src=twsrc%5Etfw\">July 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Moving on to the cornerstone of the proposed strategy on Web4 — digital twinning — it is evident that the EU faces stiff competition from stalwarts such as the United States and China in digitally dominant areas such as artificial intelligence. While one may argue that, on the physical side of things, the EU enjoys a notable position in areas such as manufacturing and global exportation of goods, there is still an appreciable degree of catching up to do in relation to digital areas such as crypto and cloud computing.</p><p>In order for the EU to take the lead on the intersection between the physical and digital realms, it must ramp up its efforts to emancipate digitally exclusive domains such as crypto, which presents notable opportunities given the current lull in the market. While most are forgoing innovations such as <a href=\"https://cointelegraph.com/defi-101/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> and <a href=\"https://cointelegraph.com/daos-for-beginners/what-is-a-dao\">decentralized autonomous organizations</a> as passing trends that have recently exited the limelight, it is clear that these are still very early days for such topics, and that optimally positioning oneself while the general attention is elsewhere will very likely pay handsome dividends in a few years’ time.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/demand-driving-bitcoin-price-to-130k\"><strong><em>Demand is driving the price of Bitcoin to $130K</em></strong></a></p><p>When it comes to DeFi, specifically, Europe as a continent has quietly asserted itself as a leader, with countries such as Italy and France being the birthplace of some of the most notable projects in the space. It would not do to ignore the advantageous position gained in the market in this respect, and with the total value locked metric still hovering comfortably above the $45 billion mark, it is amply clear that DeFi staunchly took the bear market punch and is nowhere near knocked out. It’s also likely to come back for more in the next market reversal.</p><p>With innovations such as ERC-4626 ready to unlock a wealth of exciting new prospects in the space, it is safe to state that we have yet to see DeFi’s true strengths and potential, and if the EU manages to take the helm and steer innovation going forward, it will cement its place in the inevitable financial revolution that has been bubbling in its pot for the past few years.</p><p>Over the past decade, cryptocurrency has been reinvented and reshaped to no avail. The promise of a new form of money still remains its strongest premise, and digital assets flourish best in a digital environment. The lessons learned from the repeated security token flops should still be fresh enough to accentuate the fact that we are not yet ready for a seamless intersection between what is digital and what is physical, and that in order for two subjects to simultaneously succeed, there must be a comparable, if not identical, level of excellence. </p><p>That is something that is still sorely missing in the EU when it comes to digital and crypto assets, which is why it should remain the focus in the short term.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Jonathan Galea </strong>is the CEO and founder of BCAS, a European crypto regulatory consultancy firm. He has consulted numerous regulatory entities across multiple jurisdictions on crypto-related matters, including the structuring of novel legal frameworks. He holds in an LL.D. in law from the University of Malta.</div></div><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Matteo Vena</strong> is the chief strategy officer at BCAS, a crypto-focused regulatory consultancy firm based in Europe. His area of focus is business and marketing strategy in the Bitcoin and digital assets industry. He worked previously as the managing director for Cointelegraph Italy and as the head of content for Blockchain Week Rome.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph. </em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-18T20:35:27.000Z",
    "title": "Republican lawmakers are preparing a new crypto bill in wake of Ripple decision",
    "url": "https://cryptoslate.com/republican-lawmakers-are-preparing-a-new-crypto-bill-in-wake-of-ripple-decision/",
    "description": "<p>Republican Congressman Glenn Thompson (R-PA) is gearing up to introduce his crypto bill in the House of Commons this week and believes the recent Ripple ruling will help drum up Democrat support for the legislation, Bloomberg News reported on July 18. Last week, the court ruled that programmatic sales of Ripple&#8217;s XRP to the general [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/republican-lawmakers-are-preparing-a-new-crypto-bill-in-wake-of-ripple-decision/\">Republican lawmakers are preparing a new crypto bill in wake of Ripple decision</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-18T20:26:35.000Z",
    "title": "XRP Ripple to $1: How Soon? An Analysis by Conor Kenny",
    "url": "https://www.cryptoglobe.com/latest/2023/07/xrp-ripple-to-1-how-soon-an-analysis-by-connor-kenny/",
    "description": "In a recent video published on July 14, 2023, crypto analyst Conor Kenny discussed the potential of XRP, the digital currency associated with Ripple, reaching the $1 mark. XRP’s Recent Performance Kenny begins his analysis by noting the recent re-listing of XRP on Coinbase and other exchanges, following last week’s ruling by Judge Torres that […]\n"
  }
]