[
  {
    "source": "Cointelegraph",
    "date": "2023-08-01T15:28:38.000Z",
    "title": "Bankruptcy judge signs off on order allowing Terraform Labs to subpoena FTX entities",
    "url": "https://cointelegraph.com/news/bankruptcy-judge-signs-order-allowing-terraform-labs-subpoena-ftx",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/c596420e-e2f0-4116-a9b7-0b74e4903fb3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Terraform Labs claimed that the failures of its algorithmic stablecoin and governance token were the result of an attack from short sellers, potentially involving Alameda Research.</p>\n                    <p><p>A judge in the bankruptcy case for defunct crypto exchange FTX has issued an order allowing Terraform Labs to subpoena information that could be used in its case brought by the United States Securities and Exchange Commission (SEC).</p><p>In a July 31 filing in U.S. Bankruptcy Court for the District of Delaware, Judge John Dorsey <a href=\"https://restructuring.ra.kroll.com/FTX/Home-DownloadPDF?id1=MjQ1MzEwNg==&amp;id2=-1\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Terraform Labs was permitted to serve FTX Trading and FTX US with subpoenas aimed at gathering evidence the firm could use in its defense from allegations of fraud by the SEC. The crypto firm <a href=\"https://cointelegraph.com/news/terraform-labs-seeks-access-ftx-wallets-fraud-defense\">claimed in a July 19 filing</a> that the failures of its algorithmic stablecoin and governance token were the result of a coordinated attack from short sellers, potentially involving Alameda Research. </p><p>“The Debtors [FTX] may designate any production in response to the Subpoenas in accordance with the terms of the Protective Order entered in the SEC Action or any confidentiality agreement entered into between the Debtors and [Terraform Labs],” said the order.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/4fd8632e-2f9e-41ec-b9f0-1e87cc1525bc.png\"  /><figcaption style=\"text-align: center;\"><em>July 31 order from Judge John Dorsey on Terraform Labs' request to subpoena FTX records. Source: <a href=\"https://restructuring.ra.kroll.com/FTX/Home-DownloadPDF?id1=MjQ1MzEwNg==&amp;id2=-1\" target=\"_blank\" rel=\"noopener nofollow\">Kroll</a></em></figcaption></figure><p>According to court filings, lawyers for FTX debtors agreed to the court order with “no formal objections”. Terraform Labs requested the ability to subpoena records related to digital wallets used by short sellers connected to FTX entities around May 2022, amid its failure.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/do-kwon-terraform-labs-appoints-new-ceo-from-existing-team-report\"><strong><em>Terraform Labs appoints new CEO from existing team: Report</em></strong></a></p><p>Terraform Labs was one of the first crypto firms to collapse in 2022, partly contributing to a major market crash and causing the price of many tokens to drop. FTX filed for bankruptcy in November 2022.</p><p><a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/do-kwon\">Do Kwon</a>, one of the co-founders of Terra, is currently <a href=\"https://cointelegraph.com/news/do-kwon-sentenced-to-4-months-in-prison-in-montenegro-on-fake-passport-charges\">serving a four-month sentence</a> in a Montenegrin prison after being convicted of using false travel documents. He may also face extradition to the United States or South Korea for fraud charges.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/knifefight-terra-collapse-hubris-as-collateral/\"><strong><em>Terra collapsed because it used hubris for collateral — Knifefight</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-01T15:30:00.000Z",
    "title": "FTX Exchange Might Relaunch, FTT Jumps in Value",
    "url": "https://cryptodaily.co.uk/2023/08/ftx-exchange-might-relaunch-ftt-jumps-in-value",
    "description": "<p>Defunct crypto exchange FTX announced its plans for rebooting the platform and paying back its creditors; the FTT token reacted by a sudden 15% surge in price.</p>\nThe Restart of the FTX Offshore Exchange Will Depend on its Creditors\n<p>On July 31, 2023, the bankrupt crypto exchange FTX Trading Ltd. filed a Draft Plan of Reorganization and a Term Sheet, confirming the rumors about a possible relaunch of the platform.&nbsp;</p>\n<p>According to the plan, FTX divided its claimants into different categories: FTX.com offshore exchange customers, referred to as &ldquo;dotcom customers&rdquo;; the U.S. exchange customers; customers of the non-fungible token (NFT) exchange; general unsecured claims; secured claims; and subordinated claims.</p>\n<p>The international &ldquo;dotcom&rdquo; users have the option to pool their assets and create a &ldquo;rebooted&rdquo; offshore FTX exchange, not available in the US. In this case, these customers are entitled to get a stake in the new platform instead of receiving a cash payout:</p>\n\n<p>&ldquo;Rather than all cash, the Debtors may determine that the Offshore Exchange Company remit non-cash consideration to the Dotcom Customer Pool in the form of equity securities, tokens or other interests in the Offshore Exchange Company, or rights to invest in such equity securities, tokens or other interests.&rdquo;</p>\n\n<p>The proposal stated that FTX administrators will use &ldquo;the waterfall approach&rdquo; to determine the priority of claims. This means that each class will receive a pro-rata payout from the pool of remaining assets after the payout to the preceding class is finished.</p>\nWhat about FTT and its Holders?\n<p>In response to the news, the FTX token jumped by about 15% reaching the mark of $1.55, even though it pulled back to $1.4 shortly after.&nbsp;</p>\n<p>However, the plan clarified that the FTT holders won&rsquo;t receive any compensation for their losses as their claims are to be canceled and extinguished:</p>\n\n<p>&ldquo;Claims by holders of FTT (whether or not held on any FTX exchange), preferred stock and equity investors in the Debtors and related claims. All these claims and interests will be canceled and extinguished as of the Effective Date and holders will not receive any distribution.&rdquo;</p>\n\n<p>Moreover, there are rumors that the FTX token will be eliminated altogether, and the claimants will receive their payout in USD as of the date of bankruptcy. It&rsquo;s also worth mentioning that FTT was previously labeled an unregistered security by the US Securities and Exchange Commission (SEC).&nbsp;</p>\nThe FTX Drama Continues\n<p>The defunct exchange still struggles to deal with other consequences of its sudden fall in November, 2022. Earlier today, it has been announced that FTX almost reached a resolution in its dispute with another bankrupt crypto company Genesis.</p>\n<p>Meanwhile, ex-CEO of FTX Sam Bankman-Fried is still facing seven charges related to wire fraud, securities fraud, and money laundering, partly for misappropriating the FTX customer funds. As of recent developments, Bankman-Fried agreed to a gag order while waiting for an update on his bail status.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-01T15:30:32.000Z",
    "title": "Biggest Movers: SOL, XLM 5% Lower, as Bearish Streak Extends",
    "url": "https://news.bitcoin.com/biggest-movers-sol-xlm-5-lower-as-bearish-streak-extends/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2140879799-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: SOL, XLM 5% Lower, as Bearish Streak Extends\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2140879799-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2140879799-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2140879799-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2140879799-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2140879799-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2140879799-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2140879799.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Solana dropped for a third consecutive session on Tuesday, as the token started the month of August nearly 5% lower. Overall, the global market cap was mostly in the red, dropping by 1.44% as of writing. Stellar fell to a one-week low, following a four-day losing streak of its own. Solana (SOL) Solana slipped for [&#8230;]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-01T15:29:00.000Z",
    "title": "Curve Finance Hack’s Update and Current High Debt Situation",
    "url": "https://coinedition.com/curve-finance-hacks-update-and-current-high-debt-situation/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/CRV-Middle-of-the-channel-broken.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Curve Finance Hack’s Update and Current High Debt Situation\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/CRV-Middle-of-the-channel-broken.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/CRV-Middle-of-the-channel-broken-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/CRV-Middle-of-the-channel-broken-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/CRV-Middle-of-the-channel-broken-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/CRV-Middle-of-the-channel-broken-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Curve Finance&#8217;s founder, Michael Egorov, is facing a lot of debt risks. Due to his 15.8 million FRAX debt and 59 million Curve DAO (CRV) collaterals, Egorov is in a risky position, according to Delphi Digital, a company that conducts market research on digital assets. Egorov has a $305 million CRV backing a 63.2 million [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/curve-finance-hacks-update-and-current-high-debt-situation/\">Curve Finance Hack’s Update and Current High Debt Situation</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-08-01T15:18:41.000Z",
    "title": "The Fork Wars: What is Bitcoin Independence Day?",
    "url": "https://blog.bitfinex.com/education/the-fork-wars-what-is-bitcoin-independence-day/",
    "description": "<p>August 1st marks a monumental date in the world of digital currencies, it is recognised as Bitcoin Independence Day. The day serves as a symbolic reminder of the moment when Bitcoin demonstrated its resilience, decentralisation, and sovereignty by overcoming an attempt at control exerted by...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/education/the-fork-wars-what-is-bitcoin-independence-day/\">The Fork Wars: What is Bitcoin Independence Day?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]