[
  {
    "source": "Decrypt",
    "date": "2023-10-18T21:14:00.000Z",
    "title": "Phantom Galaxies: A Look Inside the Mech Shooter NFT Game",
    "url": "https://decrypt.co/videos/interviews/QI1uDwQv/phantom-galaxies-a-look-inside-the-mech-shooter-nft-game",
    "description": "Animoca Brands and game studio Blowfish are developing Phantom Galaxies, an upcoming sci-fi mech shooter game inspired by mech battlers like Transformers. Decrypt's Kate Irwin asks Blowfish Studios Cofounder and Managing Director Ben Lee about what it's like to play the game."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-18T21:24:55.000Z",
    "title": "Just how bullish is the Bitcoin halving for BTC price? Experts debate",
    "url": "https://cointelegraph.com/news/how-bullish-is-bitcoin-halving-for-btc-price",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/0ea71b33-960f-4f8a-8c07-d6220712f9c8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Analysts recently debated whether or not the Bitcoin halving is still a meaningful catalyst for BTC’s price discovery.</p>\n                    <p><p>A recent <a href=\"https://youtu.be/h8kzWKPOZN0?si=1w90lbDr2YeBEbPY\" target=\"_blank\" rel=\"noopener nofollow\">panel</a> at the Swan Pacific Bitcoin festival was cleverly titled, “Are halving price cycles bullshit?” Throughout the discussion, host and founder of the Bitcoin Layer Nik Bhatia asked Marathon Digital CEO Fred Thiel, Swan CIO Ralph Zagury and Swan product manager Andy Edstrom to share their thoughts on whether the Bitcoin halving is truly a bullish event or just another narrative that novice investors buy into. </p><p>While the panel’s headline might be offputting for some, the inquiry is of great interest to all manner of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and cryptocurrency investors. The conventional belief held by many in the space is that the Bitcoin supply halving is a bullish phenomenon that when complete, is followed by near parabolic upside in BTC price. </p><p>Go and ask any Bitcoin lover about what they’re most excited about in the next year and if they don’t mention the chance for a spot Bitcoin ETF approval first, they're probably going to say the upcoming halving event. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Previous Bitcoin halving events have coincided with bull markets ramping up.<br><br>But will the macro conditions be ripe for that next year in May?<br><br>~ If we are past the initial shock of a recession.<br>~ If a spot BTC ETF is approved.<br>~ If QE is back on the menu.<br><br>Then the planets will… <a href=\"https://t.co/g5dEEKiSMF\">pic.twitter.com/g5dEEKiSMF</a></p>— ecoinometrics (@ecoinometrics) <a href=\"https://twitter.com/ecoinometrics/status/1699460813374034057?ref_src=twsrc%5Etfw\">September 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While previous performance does provide some compelling evidence for what might happen in the next halving, questioning long held assertions and price expectations for a high volatility asset like Bitcoin is probably something every investor should do more often — especially when considering the number of bearish events that have occurred in the past two years. </p><p>To start the discussion, host Nik Bhatia jumped right in by asking “if the halving is the main driver of the Bitcoin price?” </p><p>Thiel quickly responded with: </p><blockquote>“In this cycle, no, I think it’s liquidity” </blockquote><p>Zagury agreed, adding that “flow is really what drives the market, so the halving by definition, there’s nothing on it that should impact price.” Interestingly, Edstrom took a different position by suggesting that:</p><blockquote>“I think the halving is still bullish and we can debate what the magnitude of that effect is, but yeah, I think it still matters for price.” </blockquote><p>Each panelist, including host Bhatia seemed to agree that while the halving may possess some market moving capacity, it could be diminishing over time. According to Bhatia,</p><blockquote>“The halving affects supply. It is less and less material as time goes on and it does nothing to affect demand. But from a psychological perspective, we might be able to play devil’s advocate.” </blockquote><h2>Halving hype and hopium is all in investors’ heads</h2><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/e3827d5a-4314-4b0e-8623-115f77e93c6b.png\"><figcaption style=\"text-align: center;\"><em>Panelists at the \"Are halving price cycles bullshit?\" panel. Source: Swan Bitcoin YouTube</em></figcaption></figure><p>Speculation is essentially at the root of all investing, and while Zagury and Thiel are of the mind that investors attribute more hope, than fact, to the forecast impact of the Bitcoin halving, Edstrom sees the event as the manifestation of a “psychological feedback loop coming into the demand side.”</p><blockquote>“We think that Bitcoin price is going to be higher in the future, and by extension we are applying a lens of investment as we’re investing in Bitcoin.” </blockquote><p>Another popular yearslong held belief by many investors is the role derivatives play in Bitcoin’s price discovery. Bhatia asked whether derivatives played a larger role than spot trading in impacting Bitcoin’s price action and Zagury said,</p><blockquote>“The reality is that the data points we have, in terms of halving, are not enough to come to any conclusion. If you look historically at Bitcoin price, we’ve got the whole data set of price, and you try to find patterns of distribution, of how returns actually work, very quickly you see that there’s a lot of outer correlation, which means that price depends on time and also past performance.”</blockquote><p>According to Zagury, “a thing about Bitcoin which is super curious, and I think there isn’t any other asset class like this out there, is that most of the time, Bitcoin is moving either sideways, in terms of number of days, it's either sideways or down.” </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/btc-price-models-130k-target-024-bitcoin-halving\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/btc-price-models-130k-target-024-bitcoin-halving/amp\">BTC price models hint at $130K target after 2024 Bitcoin halving</a></em></strong></p><p>Bitcoin’s time spent trading in a rangebound band or in a downtrend is what Zagury says “makes it really hard to hodl, right, because it means you're going to have months and years of pain and you’re going to have days of glory.”</p><blockquote>“Being a hodler by definition, by distribution of prices that you see historically, it's extremely hard.” </blockquote><p>Peddling back to the initial question about the role derivatives play in Bitcoin price discovery, Zagury said:</p><blockquote>“When we talk about derivatives, the first thing you’re going to talk about is probability. It’s impossible to conclude what is really going to happen with Bitcoin price, that’s the first thing that you conclude by looking at historical returns. Going back to the halving, the fact that it actually outer correlates a lot, sometimes, in particular times of low liquidity. A small move that bumps the price up, the marginal seller out there will go through the short term sellers and then the price will jump up significantly. This explains why price moves up very very quickly.” </blockquote><h2>Liquidity will be the focal point</h2><p>Despite discounting the impact of Bitcoin supply halvings on BTC price, each panelist expressed their positive longer-term bullish perspectives for Bitcoin’s value.</p><p>With liquidity being the agreed upon future price catalyst for Bitcoin, Zagury said:</p><blockquote>“I’m very bullish. I think we are going to see that soon, because liquidity has been drawing down and we see that these things are starting to happen and it's not going to take a lot for us to see a very big move.” </blockquote><p>When asked when and how this all-important liquidity comes back, Edstrom hinted that 10-year U.S. Treasuries pushing above 5%, the potential regional bank failures that mirror the ones seen 6 months ago, and the rising amount of banks holding long duration government debt at a loss, are all signs that a Federal Reserve pivot that returns to quantitative easing could occur sooner than later.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-18T21:10:00.000Z",
    "title": "Inspector General wants FDIC to refine crypto risk assessment process, guidance",
    "url": "https://cointelegraph.com/news/inspector-general-fdic-crypto-risk-assessment-process-guidance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/0dbc6184-5e45-4034-a24c-da28853693cf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The bank deposit insurer should assess the sufficiency of its risk mitigation measures and then provide them in a more organized manner, the inspector general found. </p>\n                    <p><p>The Inspector General’s Office (OIG) of the Federal Deposit Insurance Corporation (FDIC), the independent United States government body that provides deposit insurance to commercial and savings banks, has published an evaluation report on the corporation’s crypto asset risk strategy. A redacted version of the report has been <a href=\"https://www.oversight.gov/sites/default/files/oig-reports/FDIC/EVAL-24-01-Redacted.pdf\" target=\"_blank\" rel=\"noopener nofollow\">released</a> to the public. </p><p>The FDIC adopted a “bottom up” approach to crypto risk in early 2022, the OIG said. That approach consists of understanding supervised institutions’ crypto-related activities, providing case-by-case supervisory feedback and “providing broader industry guidance on an interagency basis.” </p><p>To understand institutions’ crypto activities, the FDIC <a href=\"https://cointelegraph.com/news/the-fdic-wants-us-banks-to-report-on-current-and-intended-crypto-related-activities\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/the-fdic-wants-us-banks-to-report-on-current-and-intended-crypto-related-activities/amp\">issued a letter asking</a> them about it. As of January 2023, 96 institutions had signaled their interest in or provided current activities with crypto assets. The number of institutions that received feedback from the FDIC was blacked out. Some had been advised to pause crypto-related activity until the FDIC had made its assessment, but that number was also covered up.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/signature-bank-failed-to-understand-risks-associated-with-crypto-fdic-chair\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/signature-bank-failed-to-understand-risks-associated-with-crypto-fdic-chair/amp\">Signature Bank failed to understand risks associated with crypto — FDIC chair</a></em></strong></p><p>The OIG found that the FDIC started to develop strategies concerning risks associated with crypto assets, but it was incomplete: </p><blockquote>“However, the Agency has not assessed the significance and potential impact of the risks. Specifically, the FDIC has not yet completed a risk assessment to determine whether the Agency can sufficiently address crypto-asset-related risks through actions such as issuing guidance to supervised institutions.” </blockquote><p>According to the OIG, the FDIC should document its risk assessments, assess their significance and develop mitigation strategies such as guidance. Moreover, the process for providing feedback in response to its letter was unclear. There is no timeframe for reviews or clear end to the process, the OIG said. The OIG made two recommendations to resolve those situations.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">FDIC Strategies Related to Crypto-Asset Risks: FDIC has started to develop & implement strategies to address crypto-asset risks; hasn’t assessed significance & potential impact of risks, and feedback process to supervised banks is unclear. 2 recs. <a href=\"https://t.co/GRce5uG1By\">https://t.co/GRce5uG1By</a> <a href=\"https://t.co/7rmRGYJwk3\">pic.twitter.com/7rmRGYJwk3</a></p>— FDIC OIG (@FDIC_OIG) <a href=\"https://twitter.com/FDIC_OIG/status/1714652347358740860?ref_src=twsrc%5Etfw\">October 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The OIG classified its recommendations as not significant. It noted that the FDIC had already concurred with the recommendations and planned to complete corrective actions by the end of January 2024.</p><p>Inspector generals were introduced at U.S. federal agencies in 1978. They provide independent audits, evaluations and investigations. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/cleaning-crypto-how-much-enforcement-needed/\">Cleaning up crypto: How much enforcement is too much?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T21:39:18.000Z",
    "title": "Drama, denials, and lies: Highlights from SBF’s trial day 11",
    "url": "https://www.cryptopolitan.com/highlights-from-sbfs-trial-day-11/",
    "description": "Dark clouds seemed to gather as the infamous SBF&#8217;s trial entered its eleventh day, mirroring the somber mood in the courtroom. In a trial filled with a whirlwind of accusations, evasive witnesses, and convoluted testimony, day 11 did not disappoint. The unmasking of deception and the audacity of certain testimonies has left many onlookers both ... <a title=\"Drama, denials, and lies: Highlights from SBF&#8217;s trial day 11\" class=\"read-more\" href=\"https://www.cryptopolitan.com/highlights-from-sbfs-trial-day-11/\" aria-label=\"More on Drama, denials, and lies: Highlights from SBF&#8217;s trial day 11\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T21:27:01.000Z",
    "title": "Got $1? X plans to make you pay for tweeting or retweeting",
    "url": "https://www.cryptopolitan.com/x-to-make-you-pay-for-tweeting-or-retweeting/",
    "description": "It&#8217;s a bold new world for the millions who once thrived on Twitter, now rebranded as X. Those clicks, shares, and witty quips are about to come with a price tag. If X’s latest announcement is any indication, your engagement on their platform might soon cost you a dollar, to be precise. Now, while a ... <a title=\"Got $1? X plans to make you pay for tweeting or retweeting\" class=\"read-more\" href=\"https://www.cryptopolitan.com/x-to-make-you-pay-for-tweeting-or-retweeting/\" aria-label=\"More on Got $1? X plans to make you pay for tweeting or retweeting\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T21:21:55.000Z",
    "title": "Met Police unmask crypto’s role in crime syndicates",
    "url": "https://www.cryptopolitan.com/met-police-cryptos-role-in-crime-syndicates/",
    "description": "The Met Police have dug deep into the shadows, highlighting the intertwining tendrils of cryptocurrency in the dark world of organized crime. The prominence of digital coins in illicit activities has evolved from being a mere sidenote to being at the epicenter of transactions, from trafficking to trading. Organized Crime Gets a Digital Facelift Cryptocurrency, ... <a title=\"Met Police unmask crypto&#8217;s role in crime syndicates\" class=\"read-more\" href=\"https://www.cryptopolitan.com/met-police-cryptos-role-in-crime-syndicates/\" aria-label=\"More on Met Police unmask crypto&#8217;s role in crime syndicates\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-18T21:15:03.000Z",
    "title": "SBF trial day 11: financial forensic report exposes FTX $9.3b money trail",
    "url": "https://crypto.news/sbf-trial-day-11-financial-forensic-report-exposes-ftx-9-3b-money-trail/",
    "description": "Following evidence of political affiliations unearthed by an FBI agent, a government witness in Sam Bankman-Fried’s criminal trial provided financial analysis pointing to conspiracy and fraud based on FTX and Alameda’s bank records."
  }
]