[
  {
    "source": "Bitcoin.com",
    "date": "2024-01-21T07:00:26.000Z",
    "title": "L2 Protocol Manta Network Suffers DDoS Attack, Project Leaders Face Money Laundering Allegations",
    "url": "https://news.bitcoin.com/l2-protocol-manta-network-suffers-ddos-attack-project-leaders-face-money-laundering-allegations/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1883981995-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1883981995-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1883981995-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1883981995-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1883981995-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1883981995-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1883981995-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1883981995.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Manta Network, a modular layer two (L2) protocol, said a distributed denial-of-service attack on Jan. 18 resulted in the network accumulating a large queue of recent transactions. The attack, which occurred during a token-issuing event, is believed to have severely limited communication between the protocol and Manta Network apps. An Aggressive and Timed Attack On [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-21T06:54:51.000Z",
    "title": "Maker (MKR) Makes Crypto History: $2K Breached – Can DeFi Reach For More?",
    "url": "https://www.newsbtc.com/all/maker-mkr-makes-crypto-history-2k-breached-can-defi-reach-for-more/",
    "description": "Maker DAO&#8217;s MKR has been a dominant force in real-world asset (RWA) transactions within decentralized finance (DeFi), boasting a daily average of $94.5 million in RWA-related transactions in the second week of January. Despite this impressive transaction volume, there are underlying challenges that investors need to consider. Related Reading: Astar Makes History, Investors Celebrate 16% Price Hike – Here’s More Maker Transaction Volume Dominance MKR stands out with its substantial RWA transaction volume, signaling ongoing activity and interest in the MakerDAO ecosystem amid market volatility. This is a positive indicator for the protocol. MakerDAO&#8217;s strategic move towards tokenized T-Bills has proven successful, contributing over half of the protocol&#8217;s fee revenue. This diversification provides a potential growth engine, offering a positive aspect amid other challenges. $MKR leads transaction volume amongst RWA protocol tokens, reaching a daily average volume of $94.5M during the second week of January. 🔗https://t.co/fc5hlSkGUI pic.twitter.com/DxqTjCuaon — IntoTheBlock (@intotheblock) January 18, 2024 The Concern: Decline In RWA Activity However, the overall picture for RWA on MakerDAO is not entirely positive. The total value locked (TVL) in RWA has dropped by 33% since October, raising concerns about waning investor interest in real-world asset integration on the platform. MKR market cap currently at $1.8 billion. Chart: TradingView.com Investor sentiment mirrors the decline in TVL, with a substantial $871 million withdrawn from Maker&#8217;s RWA offerings in the past three months. This suggests potential concerns about specific RWA deals or broader market volatility. Despite positive sentiment and demand for MKR, questions arise about the sustainability of this momentum if the RWA decline persists. The future of MKR as the RWA leader is uncertain, and the potential ripple effects remain a key consideration. MKR 24-hour price action. Source: Coingecko Revival Or Paradigm Shift? The capital flight may be a temporary setback or indicative of a broader shift in investor preferences towards different RWA platforms or asset classes. Time will reveal whether MakerDAO can regain investor confidence and revive its RWA sector. Related Reading: Chainlink Gets Whale Backing: LINK Price Up 14% Amid Market Dip MKR was trading at $2,015 at the time of publication, based on CoinMarketCap data. The demand for the altcoin has increased as the year has progressed, with the majority of the attitude being favorable. The challenges and opportunities of RWAs in DeFi are encapsulated in MakerDAO&#8217;s story. While high transaction volume and innovative T-Bill offerings show promise, the significant decline in RWA inflows raises questions about the protocol&#8217;s long-term sustainability. The success of RWAs on MakerDAO and in DeFi as a whole hinges on finding the right balance between innovation, risk management, and building trust with investors. MakerDAO faces the challenge of rewriting the RWA narrative or potentially losing its prominence in the evolving landscape of real-world assets in DeFi. Featured image from Shutterstock"
  }
]