[
  {
    "source": "Cointelegraph",
    "date": "2024-02-17T17:01:09.000Z",
    "title": " FTX creditors sue bankruptcy law firm S&amp;C alleging fraud involvement  ",
    "url": "https://cointelegraph.com/news/ftx-creditors-sue-sullivan-cromwell-alleging-fraud-involvement",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZDczOGYzMDItZWYxMS00NDg0LTljYWQtMTcxNzJmZGE1YjNmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>FTX creditors are seeking damages against the law firm Sullivan & Cromwell for its prior involvement with the crypto exchange. </p>\n                    <p><p>FTX bankruptcy case has unfolded to a new chapter as the exchange’s creditors have <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.flsd.662461/gov.uscourts.flsd.662461.1.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> a class-action lawsuit against the law firm overseeing the case.</p><p>In a court filing on Feb. 16, FTX creditors alleged that law firm Sullivan &amp; Cromwell, also known as S&amp;C, “actively” participated in the “FTX Group’s multibillion dollar fraud,” asserting that the company benefited financially from FTX’s fraud.</p><p data-ct-non-breakable=\"true\">The lawsuit seeks damages for a number of counts, including civil conspiracy, aiding and abetting fraud, and aiding and abetting fiduciary breaches.</p><p><a href=\"https://cointelegraph.com/news/ftx-creditors-sue-sullivan-cromwell-alleging-fraud-involvement\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-17T17:00:33.000Z",
    "title": "US prosecutors ask judge to approve Binance plea deal",
    "url": "https://cryptoslate.com/us-prosecutors-ask-judge-to-approve-binance-plea-deal/",
    "description": "<p>US prosecutors filed a sentencing memo on Feb. 16 asking a federal judge to sign off on the Binance plea deal, Bloomberg News reported. In November 2023, Binance and its former CEO Changpeng Zhao (CZ) pled guilty to charges of money laundering and sanctions violations. Deal justified The plea deal entails Binance paying one of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/us-prosecutors-ask-judge-to-approve-binance-plea-deal/\">US prosecutors ask judge to approve Binance plea deal</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-17T17:05:49.000Z",
    "title": "As Solana and SUI Aim for Record Highs, ScapesMania Is Preparing to Launch",
    "url": "https://cryptodaily.co.uk/2024/02/as-solana-and-sui-aim-for-record-highs-scapesmania-is-preparing-to-launch",
    "description": "Watch as Solana (SOL) and Sui (SUI) gear up for record-breaking highs in the cryptocurrency market! With Solana (SOL) potentially hitting $120 and Sui (SUI) rapidly gaining traction, it's an exciting time for crypto enthusiasts and investors. Dive into the world of digital currencies and discover how these rising stars are preparing for groundbreaking launches and phenomenal growth."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-17T16:50:46.000Z",
    "title": "3 Hidden Gem Tokens Under $1 That Can Emerge as the New Solana",
    "url": "https://cryptodaily.co.uk/2024/02/3-hidden-gem-tokens-under-1-that-can-emerge-as-the-new-solana",
    "description": "Uncover the next Solana in the making with these 3 hidden gem tokens under $1! They are set to take the crypto world by storm, mirroring Solana's meteoric rise. Seize the opportunity to invest in these burgeoning tokens that could skyrocket in value, reshaping your investment portfolio in 2024.\""
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-17T17:00:00.000Z",
    "title": "Altcoins to Watch Before the Next Bull Run: Polkadot (DOT), Chainlink (LINK) and InQubeta (QUBE)",
    "url": "https://www.cryptopolitan.com/altcoins-to-watch-before-the-next-bull-run-polkadot-dot-chainlink-link-and-inqubeta-qube/",
    "description": "It&#8217;s hard to time the start of the next bull run correctly. Despite some volatility, there are clear signs that the year will be a bull market considering the recent approval of spot Bitcoin ETFs by the US SEC and the impending BTC halving a few months away. However, the best you can do is [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-17T17:00:00.000Z",
    "title": "Pandoshi (PAMBO) Approaches Presale Conclusion Raising Over $6 Million, Token Priced at $0.01",
    "url": "https://www.cryptopolitan.com/pandoshi-pambo-approaches-presale-conclusion-raising-over-6-million-token-priced-at-0-01/",
    "description": "Pandoshi (PAMBO), an emerging force within the cryptocurrency sector, is on the verge of completing its highly anticipated presale phase, with its token attractively priced at just $0.01. This innovative project has quickly gained attention for its distinctive approach to decentralized finance (DeFi), drawing in a significant influx of investment and establishing a robust community [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-17T16:57:09.000Z",
    "title": "Trump Disputes Altered Golfing Images",
    "url": "https://www.cryptopolitan.com/trump-disputes-altered-golfing-images/",
    "description": "Explore the controversy surrounding altered images of former President Donald Trump golfing and his claims against fake news."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-17T16:56:24.000Z",
    "title": "US Military Embraces Machine Learning Amid Rising Pacific Tensions",
    "url": "https://www.cryptopolitan.com/us-military-embraces-machine-learning/",
    "description": "In a significant development, a high-ranking US Navy officer has underscored the pivotal role of machine learning in bolstering the United States military&#8217;s capabilities to anticipate and counter threats in the Pacific region. This statement comes at a time when China&#8217;s military activities, particularly around the Taiwan Strait and the South China Sea, have intensified, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-17T17:00:00.000Z",
    "title": "Copy traders stack ORDI, Meme Moguls, and IOTA amid altcoin season",
    "url": "https://crypto.news/copy-traders-stack-ordi-meme-moguls-and-iota-amid-altcoin-season/",
    "description": "The altcoin market is recovering after a correction in January. Several projects see price increases, while IOTA, Meme Moguls, and ORDI are expected to surge over the next weeks. Here’s why copy traders are adding each project to their portfolios. &#8230;"
  }
]