[
  {
    "source": "CoinDesk",
    "date": "2023-06-20T19:28:26.000Z",
    "title": "Bitcoin’s Rally to $28K Causes the Largest Short Squeeze This Month",
    "url": "https://www.coindesk.com/markets/2023/06/20/bitcoins-rally-to-28k-causes-the-largest-short-squeeze-this-month/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The price surge liquidated some $34 million of short positions in the past 24 hours, the most this month, CoinGlass data shows."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-20T19:22:25.000Z",
    "title": "There's a Fake Trezor Wallet in the Apple App Store Draining Crypto",
    "url": "https://decrypt.co/145440/theres-a-fake-trezor-wallet-in-the-apple-app-store-draining-crypto",
    "description": "A malicious Trezor app has appeared on the Apple App Store under the fake name \"Trezor Wallet Suite.\" "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-20T19:30:00.000Z",
    "title": "Biden to discuss dangers of AI in San Francisco meeting with experts",
    "url": "https://cointelegraph.com/news/biden-to-discuss-dangers-of-ai-in-san-francisco-meeting-with-experts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/568ba905-da93-4f25-94ae-4ba8c72178b2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The U.S. president will meet with AI experts to discuss safety, policy and opportunities while he’s in San Francisco.</p>\n                    <p><p>United States President Joe Biden will discuss artificial intelligence (AI) with a group of Silicon Valley experts on June 20 between campaign fundraising stops in California. </p><p>The president will meet with at least eight experts, including renowned researchers and experts in AI safety. According to the White House, the <a href=\"https://www.whitehouse.gov/briefing-room/press-briefings/2023/06/19/press-gaggle-by-press-secretary-karine-jean-pierre-en-route-palo-alto-ca/\" target=\"_blank\" rel=\"noopener nofollow\">topic</a> of discussion will be the Biden administration’s “commitment to seizing the opportunities and managing the risks of Artificial Intelligence.”</p><p>Per a report from The Associated Press, the attendee list <a href=\"https://apnews.com/article/biden-ai-artificial-intelligence-518ec2a9190cfb10db9dbcc1eaab3c4c\" target=\"_blank\" rel=\"noopener nofollow\">includes</a> Jim Steyer, founder of Common Sense Media; Tristan Harris, co-founder of the Center for Humane Technology; Fei-Fei Li, co-director of Stanford’s Human-Centered AI institute; Joy Buolamwini, founder of the Algorithmic Justice League; and Sal Khan, founder of the Khan Institute. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/us-vice-president-gathers-top-tech-ceos-to-discuss-dangers-of-ai\"><strong><em>US vice president gathers top tech CEOs to discuss dangers of AI</em></strong></a></p><p>This group is noteworthy for its individual members’ efforts in education, policy, safety and harm mitigation. Previous meetings with White House officials have included CEOs from some of the largest companies in the global AI sector — including meetings with representatives from Google, Microsoft and Anthropic.</p><p>Biden will <a href=\"https://www.whitehouse.gov/live/\" target=\"_blank\" rel=\"noopener nofollow\">meet</a> with the experts at 4:00 pm Pacific Standard Time on June 20, during a series of discussions the president is participating in at the Fairmont Hotel in San Francisco. The event will be streamed on the official White House YouTube channel.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/EV5QrykvZIQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>The U.S. Senate recently met with OpenAI CEO Sam Altman, IBM chief privacy and trust officer Christina Montgomery and New York University’s Gary Marcus in <a href=\"https://cointelegraph.com/news/openai-ceo-sam-altman-testifies-in-historic-senate-hearing-on-ai-safety\">a hearing to discuss AI policy</a>.</p><p>During his testimony, Altman expressed his belief that the U.S. government should establish a federal regulatory body to provide oversight, licensing and accountability for the burgeoning AI sector. While Marcus agreed with the notion, IBM’s Montgomery dissented, stating that it was her company’s view that Congress should take a more surgical approach to AI governance. </p><p>The discussions surrounding AI come at a time when the U.S. government has yet to set a comprehensive strategy for legislating AI development and production.</p><p>While Europe, China and the United Kingdom have either passed or are currently weighing bills featuring overarching legislation packages for the AI sector, the U.S. still lags behind in both comprehensive cryptocurrency and AI regulations. </p><p>Untangling the two sectors is becoming increasingly difficult, as AI now underpins many cryptocurrency, blockchain and Web3 industries. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ai-blockchain-symbiotic-relationship-animoca-brands-interview\"><strong><em>AI has a ‘symbiotic relationship’ with blockchain: Animoca Brands CEO</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-20T19:30:36.000Z",
    "title": "NFT Sales Rise by 11% This Week as Buyers Surge 95% in Latest Data; ETH Dominates With $85.43 Million in Sales",
    "url": "https://news.bitcoin.com/nft-sales-rise-by-11-this-week-as-buyers-surge-95-in-latest-data-eth-dominates-with-85-43-million-in-sales/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/nfts-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"NFT Sales Rise by 11% This Week as Buyers Surge 95% in Latest Data; ETH Dominates With $85.43 Million in Sales\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/nfts-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/nfts-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/nfts-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/nfts-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/nfts-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/nfts-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/nfts-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In the most recent data, non-fungible token (NFT) sales for this week have experienced a rise of 11.60% compared to the previous week. Moreover, the number of individual buyers purchasing NFTs in the past seven days has jumped 95.20%, reaching a total of 664,096 buyers. This Week&#x2019;s NFT Sales See a Modest Rise of More [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T19:34:17.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T19:34:17.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T19:23:26.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-20T19:30:36.000Z",
    "title": "Stacks (STX) Registers 11% Gains As Broader Market Suffers Volatility",
    "url": "https://www.newsbtc.com/stacks/stacks-stx-registers-11-gains-as-broader-market-suffers-volatility/",
    "description": "While the broader crypto market experiences turbulent times and volatility, Stacks (STX) stands out with an impressive performance. Stacks is a network created in 2017 as an extension of the Bitcoin blockchain, allowing developers to create and deploy smart contracts. In recent times its native token, called STX, has been exhibiting positive performance in its price movement following the popularity of Bitcoin Ordinals.  Amidst Market Turbulence, Stacks (STX) Defies the Odds, Showcasing a Resilient 11% Surge The price of STX recorded a significant increase of 21.57% in the last 7-day trading session. At the time of writing, STX is still maintaining its bullish momentum. It shows a notable increase of 11.33%, representing its current value of $0.6300. Related Reading: Best Crypto Narrative For This Summer? Everything About LSDfi According to data from CoinMarketCap, STX&#8217;s 24-hour trading volume is experiencing a massive pump of 387.11%, standing at $147 million. This increase suggests strong investor demand and positive sentiment surrounding the asset, potentially indicating a bullish trend. A fundamental factor driving the price of Stacks (STX) is the Bitcoin-based NFTs called Ordinals that have experienced increased adoption. Based on data from Dune analytics, the launch of Ordinals has led to nearly 12,906,466 Bitcoin inscriptions on the network.  This has increased network activity, causing the price of STX to rise significantly. However, with increasing scrutiny and regulatory measures impacting various cryptocurrencies, STX became the first token approved by the SEC.  This approval may have contributed to boosting its price by attracting investors. This regulatory approval sets STX apart from other tokens and reassures investors regarding its legitimacy and regulatory compliance. Stacks Daily Chart Stacks (STX) price is currently above the middle band at the time of analysis. It is heading straight toward the upper band of the Bollinger Bands indicator, suggesting a strong upward momentum. This indicates potential bullishness, with the possibility of the price continuing to rise and reaching higher levels. Also, the Moving Average Convergence Divergence (MACD) is above the signal line; the histogram bars also display strong green bars. This suggests the asset&#8217;s positive momentum is strengthening, potentially signaling further upward price movement. Related Reading: Bitcoin Whales Continue To Accumulate As BTC Makes Recovery Push The Stacks token, STX, currently trades between its significant support and resistance levels of $0.4679 and $0.6762, respectively. Based on the chart, the asset is moving straight to its primary resistance level of $0.6762. The move suggests that the buyer&#8217;s pressure has outweighed that of the sellers. If the bulls break this level successfully, the next significant resistance point is $0.8294. General Crypto Market Performance Might Boost STX Notably, the global crypto market cap has reached $1.07 trillion, marking a 0.44% increase in the last day. In the past 24 hours, the total crypto market volume has also surged to $29.04 billion, a significant 44.09% rise. According to CoinMarketCap data, Bitcoin&#8217;s dominance has risen to 48.45%, showing a 0.30% increase throughout the day. These metrics suggest that the crypto market is regaining its positive move today and might also rub off on STX. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T19:21:23.000Z",
    "title": "Ripple: XRP Breaks 777-Day Downtrend: Set to Skyrocket with 576% Rally Ahead",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-breaks-777-day-downtrend-set-to-skyrocket-with-576-rally-ahead/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-xrp-breaks-777-day-downtrend-set-to-skyrocket-with-576-rally-ahead",
    "description": "XRP is regaining strength with the digital asset recently breaking its 777-day downtrend. Minor victories against the SEC are setting Ripple&#8217;s XRP on a bullish path with a 576 percent rally possible. A market analyst has highlighted a major price trend reversal around Ripple&#8217;s XRP. Going by the name Dark Defender on Twitter, the XRP [...]"
  }
]