[
  {
    "source": "Cointelegraph",
    "date": "2023-08-30T03:19:12.000Z",
    "title": "SEC's first deadlines to approve 7 Bitcoin ETFs coming over the next week",
    "url": "https://cointelegraph.com/news/sec-decisions-on-seven-bitcoin-etfs-in-six-days",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/5744a0f1-f2f8-4c99-8793-f78db6c14291.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Analysts say the best-case scenario is the SEC approves the batch of spot Bitcoin ETFs but it may also exercise its right to an appeal.</p>\n                    <p><p>The United States Securities and Exchange Commission is facing its first deadlines to decide on seven new Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) spot exchange-traded fund applications with the latest being Sept. 4 amid <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">its defeat to Grayscale Investments</a> in a U.S. federal appeals court.</p><p>Investment firm Bitwise will learn if its ETF will win the SEC’s approval on Sept. 1 while BlackRock, VanEck, Fidelity, Invesco and Wisdomtree will all be awaiting the SEC’s decision for their funds by Sept. 2, <a href=\"https://www.sec.gov/edgar\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to several SEC filings.</p><p>Meanwhile, Valkyrie is set to hear back from the SEC on Sept. 4.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/9d5f5221-cbea-4682-abff-767a89335a03.png\"  /><figcaption style=\"text-align: center;\"><em>List of recent Bitcoin spot ETF applicant filing dates and deadlines. Source: Bloomberg</em></figcaption></figure><p>The U.S. Court of Appeals ruled on Aug. 29 that the <a href=\"https://cointelegraph.com/news/breaking-grayscale-launches-legal-challenge-to-bitcoin-spot-etf-rejection\">SEC’s rejection of Grayscale’s application</a> to convert its Grayscale Bitcoin Trust (GBTC) into a spot Bitcoin ETF was “arbitrary and capricious” — but it <a href=\"https://cointelegraph.com/news/crypto-community-jubilant-over-grayscale-sec-decision-uncertainty-remains\">doesn’t mean the SEC must approve</a> Grayscale’s application or others in the future, says Bloomberg ETF analyst James Seyffart.</p><p>In an Aug. 29 Bloomberg interview, Seyffart <a href=\"https://www.bloomberg.com/news/videos/2023-08-29/bloomberg-crypto-08-29-2023?sref=j5fwnYfu\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> Grayscale’s win “definitely” increases the odds of a successful outcome for the next wave of applicants. </p><p>He isn’t sure when that day may come though, as the SEC can delay its decisions and has two more proposed deadlines for each fund before being forced to make a final decision on the 240th day post-filing.</p><p>For the awaiting applicants, the final deadlines for the SEC are al mid-March next year.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">99.99999% of the world doesn&#39;t know that the SEC has to decide on 7 BTC ETFs within the next 3 days:<br><br>-blackrock<br>-bitwise<br>-vaneck<br>-wisdomtree<br>-invesco<br>-fidelity <br>-valkyrie<br><br>the suits at our doorstep</p>&mdash; odin free  (@odin_free) <a href=\"https://twitter.com/odin_free/status/1696617583443624347?ref_src=twsrc%5Etfw\">August 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>What are the SEC’s options post-Grayscale decision?</h3><p>After today’s ruling in favor of Grayscale, the regulator has 90 days to <a href=\"https://www.supremecourt.gov/casehand/guideforIFPcases2019.pdf\" target=\"_blank\" rel=\"noopener nofollow\">file</a> an appeal with the U.S. Supreme Court or apply for an En banc review — where a full circuit court can overturn a ruling made by a three-judge panel.</p><p>However, the SEC hasn’t made clear what its next move will be.</p><p>If the SEC doesn’t appeal the court will need to specify how its ruling is executed which could include instructing the SEC to approve Grayscale’s application, or at the very least revisit it.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/btc-price-2-week-highs-grayscale-sec-bitcoin-etf-win\"><strong><em>BTC price jumps to 2-week highs on Grayscale vs. SEC Bitcoin ETF win</em></strong></a></p><p>Either way, Seyffart only saw two viable options for the regulator.</p><p>The first is for it to concede defeat and approve Grayscale’s conversion of its GBTC to a Bitcoin spot ETF.</p><p>Alternatively, the SEC would need to revoke the listing of Bitcoin futures ETFs entirely or deny Grayscale’s application based on a new argument, said Seyffart.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The second potential avenue is to deny on reasons not used before/yet... which i have been saying for months could have to do with Custody or settlement of <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>  which is not something that futures ETFs have to worry about.  SEC has made a lot of noise around custodians</p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1696546549734482172?ref_src=twsrc%5Etfw\">August 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, fellow Bloomberg ETF analyst Eric Balchunas <a href=\"https://twitter.com/EricBalchunas/status/1696564558146556306\" target=\"_blank\" rel=\"noopener nofollow\">considered</a> the odds of the SEC revoking the Bitcoin futures ETFs as “highly unlikely” because of the SEC's reported openness to Ethereum futures ETFs.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Lol, this guy turned the last paragraph of Judge Rao&#39;s legal smackdown today into an MGMT-esque sythe banger. Really captures the mood rn, well done.. <a href=\"https://t.co/BBJZR5O6To\">https://t.co/BBJZR5O6To</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1696613303177380173?ref_src=twsrc%5Etfw\">August 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/wolf-of-all-streets-world-bitcoin-hits-1m-1-million-hall-of-flame/\"><strong><em>Hall of Flame: Wolf Of All Streets worries about a world where Bitcoin hits $1M</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-30T03:30:18.000Z",
    "title": "Ethereum Rally Loses Steam, Why ETH Could Revisit Resistance Turned Support",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-rally-loses-steam-1750/",
    "description": "Ethereum price rallied above the $1,700 resistance against the US Dollar. ETH struggled near $1,750 and is currently correcting gains. Ethereum gained momentum above the $1,660 and $1,670 levels. The price is trading above $1,700 and the 100-hourly Simple Moving Average. There was a break above a key bearish trend line with resistance near $1,650 on the hourly chart of ETH/USD (data feed via Kraken). The pair is now correcting gains from the $1,750 resistance. Ethereum Price Rally Stalls Ethereum’s price was able to start a decent increase from the $1,620 zone. ETH formed a base and started a steady increase above the $1,650 resistance, like Bitcoin. There was a break above a key bearish trend line with resistance near $1,650 on the hourly chart of ETH/USD. The pair climbed higher above the $1,670 and $1,700 resistance levels. However, the bears were active near the $1,750 zone. A high is formed near $1,747 and the price is now correcting gains. There was a move below the $1,720 level. The price declined below the 23.6% Fib retracement level of the upward move from the $1,639 swing low to the $1,747 high. Ether is now trading above $1,700 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $1,725 level. The next resistance is near the $1,750 level. A close above the $1,750 level might send the price toward the $1,850 zone. If there is a clear move above $1,850, Ethereum could rise toward the $1,920 resistance. Any more gains might send the price toward the $2,000 resistance. Are Dips Supported in ETH? If Ethereum fails to clear the $1,750 resistance, it could continue to move down. Initial support on the downside is near the $1,700 level. The first key support is close to $1,680 or the 61.8% Fib retracement level of the upward move from the $1,639 swing low to the $1,747 high. The next major support is near the $1,660 level. If there is a downside break below $1,660, the price could accelerate lower toward the $1,620 level. Any more losses might send the price toward the $1,540 level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,680 Major Resistance Level – $1,750"
  }
]