[
  {
    "source": "Cointelegraph",
    "date": "2024-01-16T23:56:00.000Z",
    "title": " Bitcoin miner Core Scientific to exit bankruptcy, relist shares in ‘coming days’  ",
    "url": "https://cointelegraph.com/news/core-scientific-bankruptcy-relist-shares-chapter-11-bitcoin-miner",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMDQ4M2FmOTgtOWZkYi00YjcyLWFjYjMtYzRiNDZhZDU3MDg3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Crypto mining firm Core Scientific is putting an end to its 13-month restructuring journey, with an emergence targeted for Jan. 23. </p>\n                    <p><p>Crypto mining firm Core Scientific has been given court approval to emerge from bankruptcy and relist its “CORZ” shares on the Nasdaq — putting an end to a 13-month restructuring process. </p><p>In a Jan. 16 <a href=\"https://investors.corescientific.com/investors/news/news-details/2024/Core-Scientific-Inc.-Plan-of-Reorganization-Confirmed-by-Bankruptcy-Court/default.aspx\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, Core Scientific said its <a href=\"https://cointelegraph.com/news/bitcoin-miner-core-scientific-exit-bankruptcy-january-2024\">plan of reorganization</a> had been confirmed by the bankruptcy court for the Southern District of Texas. The firm is <a href=\"https://cases.stretto.com/public/X217/12024/PLEADINGS/1202401162480000000113.pdf\" target=\"_blank\" rel=\"noopener nofollow\">targeting</a> an emergence date of Jan. 23 and anticipates being relisted on the Nasdaq the following day.</p><p>“Today’s plan confirmation is a defining moment in our reorganization; we’re poised to emerge by the end of this month as an even stronger company, with a highly motivated team that is aligned for success,” said Core Scientific CEO Adam Sullivan.</p><p><a href=\"https://cointelegraph.com/news/core-scientific-bankruptcy-relist-shares-chapter-11-bitcoin-miner\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-16T23:51:40.000Z",
    "title": " Being a developer for the decentralized web sucks ",
    "url": "https://cointelegraph.com/news/developing-decentralized-web-sucks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYzUxNzBhN2MtZjEyOS00YjY2LWIxNDgtZjc3OWY2Yzk3MWVkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Web3 developers are suffering from a lack of common standards for integrating the tech, apps, and APIs that they need in order to build.</p>\n                    <p><p>Maybe you’re a legendary developer and you ‘ll disagree, but for most of us, innovating is hard enough without adding in the complexities of new tech, new apps, and new APIs.</p><p><a href=\"https://cointelegraph.com/explained/how-web3-resolves-fundamental-problems-in-web2\">Web2</a> has been around for so long that there is an API for everything and a bunch of aggregation services to make things even simpler.</p><p>When it comes to <a href=\"https://cointelegraph.com/blockchain-for-beginners/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\">Web3</a>, we have apps and APIs, but because everything is decentralized, they’re all, well — decentralized. It’s an absolute pain in the proverbial to get everything working smoothly together.</p><p><a href=\"https://cointelegraph.com/news/developing-decentralized-web-sucks\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-17T00:00:06.000Z",
    "title": "Grayscale Transfers Almost 12,000 BTC To Coinbase, Bitcoin Price Reacts",
    "url": "https://www.newsbtc.com/bitcoin-news/grayscale-transfers-almost-12000-btc-to-coinbase-bitcoin-price-reacts/",
    "description": "In a significant development that could potentially impact the Bitcoin price, Arkham Intelligence data reveals that Grayscale, the manager and owner of the Grayscale Bitcoin Trust (GBTC), has been sending a significant amount of Bitcoin to Coinbase since the launch of Bitcoin spot exchange-traded funds (ETFs) on January 12. Grayscale Bitcoin Trust Initiates Substantial BTC Outflow According to the data, four days ago, Grayscale initiated the first batch of BTC outflows from their holdings to the US-based exchange in four separate batches, totaling 4,000 BTC, which amounted to approximately $183 million. However, the asset manager resumed outflows from the Trust to the exchange on Tuesday. In a recent update, approximately three hours ago, the asset manager sent an additional 11,700 BTC to Coinbase, amounting to $491.4 million. This additional selling pressure could push the Bitcoin price to test lower support levels. Related Reading: Institutional Inflows Into XRP Surges 244% Amid ETF Speculation Furthermore, Bloomberg reports that investors have withdrawn over half a billion dollars from the Grayscale Bitcoin Trust during the initial days of trading as an ETF.  According to Bloomberg&#8217;s data, outflows from the Grayscale Bitcoin Trust reached approximately $579 million, while the other nine spot Bitcoin ETFs witnessed inflows totaling nearly $819 million. Investors Shift Capital To ‘Lower-Cost’ Spot Bitcoin ETFs James Seyffart, an ETF analyst at Bloomberg Intelligence, noted that investors may be profit-taking following the ETF conversion. The flow data provides valuable insights into the ETF&#8217;s performance following SEC approval.  Although over $2.3 billion of GBTC shares were traded on its first day, the outflows indicate that a portion of that volume was due to selling. Seyffart anticipates that a significant amount of capital will enter other Bitcoin exposures. The outflows from Grayscale&#8217;s ETF were somewhat expected. Bloomberg Intelligence had previously projected that the fund would experience outflows of over $1 billion in the coming weeks.  Some of this outflow can be attributed to investors shifting towards more cost-effective spot Bitcoin ETFs. With an expense ratio of 1.5%, GBTC is the most expensive US ETF directly investing in Bitcoin. In contrast, the VanEck Bitcoin Trust, the second-most expensive fund, charges 0.25%. On the other hand, other spot Bitcoin ETFs have witnessed net inflows. BlackRock&#8217;s IBIT attracted nearly $500 million in the first two days of trading, while Fidelity&#8217;s FBTC received approximately $421 million.  According to Bloomberg, these inflows suggest strong demand for Bitcoin exposure in physically backed ETFs, even beyond potential seed funding from the fund issuers. Bitcoin Price Finds Support At $42,000 Currently, the Bitcoin price remains unaffected by the news of Grayscale&#8217;s transfers to Coinbase. The leading cryptocurrency is trading at $43,100, showing a slight increase of 0.8% over the past 24 hours. However, since the commencement of ETF trading, it is important to note that the Bitcoin price has experienced a significant retracement, declining by 8%. This decline can be attributed to profit-taking and selling pressure, with Grayscale&#8217;s involvement being noteworthy. Related Reading: Ethereum Trouncing Bitcoin, ETH/BTC Ratio Bouncing Higher: Will This Trend Continue? In the event of a further drop in the Bitcoin price, a significant support level has been established at $42,000. If this level is breached, the next key level for Bitcoin bulls to watch is $41,350, followed by a potential dip below $40,000. The market is eagerly observing whether Grayscale and its BTC selloff will continue and how this will impact the Bitcoin price leading up to the scheduled halving event in April, which many consider to be the main catalyst for the year. Featured image from Shutterstock, chart from TradingView.com "
  }
]