[
  {
    "source": "Cointelegraph",
    "date": "2024-01-25T08:40:24.000Z",
    "title": " Bitcoin ATM flaw could’ve given hackers ‘total control’ ",
    "url": "https://cointelegraph.com/news/bitcoin-atm-vulnerability-ethical-hackers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYjE4ZGJkNjYtNWM2Yi00ZmVlLWI2MTItY2E0NTMzMDJlMmNlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>IOActive chief technology officer Gunter Ollman said that through the vulnerabilities, attackers could steal users’ Bitcoin through the ATM. </p>\n                    <p><p>Bitcoin ATM provider Lamassu Industries fixed a vulnerability in its Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ATM machines after a team of ethical hackers took full control of the devices, highlighting some of its flaws. </p><p>In 2023, security researchers from IOActive attempted to hijack several ATMs issued by Lamassu. As they worked to access the machines, the research team <a href=\"https://labs.ioactive.com/2024/01/atm-security-owning-bitcoin-atm.html\" target=\"_blank\" rel=\"noopener nofollow\">identified</a> several vulnerabilities that they managed to exploit to gain access to the ATMs. </p><p>IOActive’s chief technology officer, Gunter Ollman, told Cointelegraph that through the exploit, attackers could “view and manipulate interactions with the hijacked ATM.” The security professional explained that hackers could steal BTC from the user’s wallet through the ATM using the vulnerabilities. Ollman explained: </p><p><a href=\"https://cointelegraph.com/news/bitcoin-atm-vulnerability-ethical-hackers\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-25T08:47:08.000Z",
    "title": "Tesla HODLs, Company Did Not Sell Any Of Its Bitcoin In Q4 2023",
    "url": "https://cryptodaily.co.uk/2024/01/tesla-hodls-company-did-not-sell-any-of-its-bitcoin-in-q4-2023",
    "description": "Leading automotive and clean energy company Tesla has revealed in its earnings report that it did not sell any of its Bitcoin during the fourth quarter of 2023."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-25T08:57:43.000Z",
    "title": "Bitget Stakes Claim as Leading Crypto Exchange In 2024",
    "url": "https://cryptodaily.co.uk/2024/01/bitget-stakes-claim-as-leading-crypto-exchange-in-2024",
    "description": "Competition between digital assets exchanges is notoriously intense, with dozens of platforms vying for supremacy. Truthfully, it’s not easy to tease some of them apart as the majority offer users many of the same features, trading pairs,"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T09:00:50.000Z",
    "title": "Polygon Labs to unite multiple blockchains with AggLayer Protocol",
    "url": "https://www.cryptopolitan.com/polygon-labs-blockchains-agglayer-protocol/",
    "description": "Polygon Labs, a developer of Ethereum-scaling solutions, is set to launch its groundbreaking AggLayer protocol next month. This innovative protocol aims to bridge the gap between various blockchains, providing users with an experience that &#8220;feels like a single chain.&#8221;&#160; To address the fragmented state of the blockchain landscape, Polygon Labs aims to create a unified [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T09:00:00.000Z",
    "title": "Can Solana (SOL) Hit $1,000 in 2024? New 100X Altcoin Disrupts A.I Industry",
    "url": "https://www.cryptopolitan.com/can-solana-sol-hit-1000-in-2024-new-100x-altcoin-disrupts-a-i-industry/",
    "description": "In this article, we will delve into the factors that could contribute to Solana’s (SOL) rise and explore the disruptive potential of the Option2Trade (O2T) presale in the A.I market. Solana (SOL), a blockchain platform known for its scalability and fast processing times, has garnered attention and speculation from crypto enthusiasts and investors alike. With [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T08:53:49.000Z",
    "title": "Sui Price Prediction 2024-2033: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2024-2033 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin, capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T08:42:17.000Z",
    "title": "Is AI Set to Supercharge Global Ransomware Threats? NCSC Weighs In",
    "url": "https://www.cryptopolitan.com/ai-supercharge-global-ransomware-threats/",
    "description": "The National Cyber Security Centre (NCSC) has sounded the alarm on a looming surge in global ransomware threats, attributing the heightened risk to the integration of artificial intelligence (AI) by cybercriminals. As per the NCSC&#8217;s latest assessment, the utilization of AI in malicious cyber activities is anticipated to significantly amplify both the frequency and severity [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T08:40:45.000Z",
    "title": "Grayscale Bitcoin Trust (GBTC) outflows show signs of slowing, but uncertainty remains",
    "url": "https://www.cryptopolitan.com/grayscale-bitcoin-trust-gbtc-outflows-slows/",
    "description": "Daily outflows from the Grayscale Bitcoin Trust (GBTC) have reached their lowest point since launch day, sparking hope of a potential end to the exodus. However, experts remain cautious as the situation unfolds. Grayscale Bitcoin Trust outflows ease Daily outflows from the Grayscale Bitcoin Trust (GBTC) have seen a notable slowdown for two consecutive days, [&#8230;]"
  }
]