[
  {
    "source": "CoinDesk",
    "date": "2023-07-28T11:46:40.000Z",
    "title": "Crypto.com Trumps Binance, Securing Netherlands Registration as Larger Rival Withdraws",
    "url": "https://www.coindesk.com/policy/2023/07/28/cryptocom-trumps-binance-securing-netherlands-registration-as-larger-rival-withdraws/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Netherlands, which has taken a tough line on rivals such as Binance and Coinbase, follows France, Dubai and the U.K. in recognizing the crypto exchange."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-28T11:45:50.000Z",
    "title": "Near to Help Colombian Web3 Social Network Blumer Build Token Infrastructure",
    "url": "https://www.coindesk.com/business/2023/07/28/near-to-help-colombian-web3-social-network-blumer-build-token-infrastructure/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Users will be able to convert Blumer tokens for other cryptocurrencies and withdraw to wallets."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-28T11:52:33.000Z",
    "title": "Senate’s $886B Defense Bill Ropes in Crypto Mixers, Privacy Coins",
    "url": "https://decrypt.co/150447/senates-886b-defense-bill-ropes-crypto-mixers-privacy-coins",
    "description": "While the bipartisan effort is a key milestone, an upcoming showdown with the House may mean this policy never sees the light of day."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T11:39:55.000Z",
    "title": "Here’s how big food and beverage brands are using NFTs: Report",
    "url": "https://cointelegraph.com/news/nft-here-s-how-big-food-and-beverage-brands-are-using-nf-ts-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/fbd21c99-47b2-4bdb-9cdc-0af660cf98bd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The key supporting factors for the market are the adoption of blockchain technology and the demand for NFTs for transparency and traceability in the food industry.</p>\n                    <p><p><a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world#:~:text=NFTs%20refer%20to%20nonfungible%20tokens,based%20video%20games%20and%20video.\">Nonfungible tokens (NFT)</a> adoption is picking up steam across the food and beverage industry, with many fast-food chains displaying interest in this new asset class. </p><p>A <a href=\"https://www.prnewswire.com/news-releases/global-food--beverage-non-fungible-token-market-report-2023-2032-creative-marketing-strategies-gaining-momentum-as-pizza-hut-and-papa-johns-launch-nfts-to-promote-food-products-301886099.html\" target=\"_blank\" rel=\"noopener nofollow\">report</a> by ResearchAndMarkets.com states that the global food &amp; beverage NFT market size is expected to reach USD 2,134.04 Million by 2032. These statistics have been evident as recently, Global fast-food brands, including Pizza Hut and Papa John’s, are discovering new ways to integrate NFTs into their marketing strategies. </p><p>The report states that the key supporting factors for the market are the adoption of blockchain technology and the demand for NFTs for transparency and traceability in the food industry. Unique ownership opportunities, using NFTs in <a href=\"https://cointelegraph.com/learn/augmented-reality-vs-virtual-reality-key-differences\">virtual reality</a> and video games, promotions and advertising from food companies and restaurants are other factors expected to drive the market in the forecast period.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/46e4157b-a5ef-420b-8cc4-2a0056e0bb78.JPG\"  /><figcaption style=\"text-align: center;\"><em>Graphic representation of predicted growth for the Food &amp; Beverage NFT market.  Source: Research and Markets</em></figcaption></figure><p>NFTs are unique digital assets verified on a <a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-the-different-types-of-blockchain-networks\">blockchain network.</a> These are created using blockchain technology, a decentralized digital ledger that records transactions transparently and securely. </p><p>The value of an NFT can vary greatly depending on the rarity and popularity of the item it represents, with some NFTs selling for millions of dollars. In the food industry, the NFT market gains traction due to the demand for transparency and traceability. Tracking and verifying food origin, quality and safety is crucial for consumers, retailers and regulators.</p><p>In March 2021, Pizza Hut Canada <a href=\"https://www.newswire.ca/news-releases/pizza-hut-launches-new-1-byte-favourites-pizza-824510721.html\" target=\"_blank\" rel=\"noopener nofollow\">joined</a> the NFT trend with \"1 Byte Favorites,\" a digital pizza collection. The NFTs represented pizza slices with unique recipes on Rarible, featuring popular choices like Hawaiian, Pepperoni, Canadian and Margherita. The NFTs gained popularity and sold out, being used as a marketing campaign to promote their pan pizzas and engage customers. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/nft-styled-debit-cards-the-future-of-web3-animoca-founder\"><strong><em>NFT-styled debit cards the future of Web3 — Animoca founder on $30M hi investment</em></strong></a></p><p>Papa John's International, Inc., a pizza take-out chain, <a href=\"https://www.nfthotbag-papajohns.com/\" target=\"_blank\" rel=\"noopener nofollow\">entered</a> the NFT market with its \"Hot Bags\" collection. These NFTs showcased handbag designs to promote their new business line, Papa John's X Cheddar, which offers merchandise. The NFTs were minted on the Tezos blockchain, with the numbers symbolizing the company's founding year (1984).</p><p>However, the report mentions that NFT adoption in the food &amp; beverage industry is hindered by technical complexities, especially for smaller producers. Limited awareness among consumers and industry stakeholders about NFT benefits also poses a challenge.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tokenizing-music-royalties-nfts-taylor-swift-3lau-nas-the-weeknd/\"><strong><em>Tokenizing music royalties as NFTs could help the next Taylor Swift</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-28T11:45:00.000Z",
    "title": "Senate Passes Military Bill With Crypto Provision",
    "url": "https://cryptodaily.co.uk/2023/07/senate-passes-military-bill-with-crypto-provision",
    "description": "<p>The United States Senate has passed an $886 billion military spending bill with strict anti-money laundering provisions for cryptocurrency.&nbsp;</p>\nU.S. Senate Takes a Stand on Crypto&nbsp;\n<p>On Thursday, the U.S. Senate made a significant move by passing the 2024 National Defense Authorization Act (NDAA), a $886 billion military spending bill that contains a provision that will significantly affect the crypto industry.&nbsp;</p>\n<p>Spearheaded by senators Kirsten Gillibrand, Cynthia Lummis, Elizabeth Warren, and Roger Marshall, the amendment aims to tighten oversight of financial institutions involved in crypto trading and clamp down on the use of crypto mixers and \"anonymity-enhancing\" assets. The senators hailed it as a substantial step in regulating crypto assets.</p>\nMerging Existing Acts\n<p>The amendment draws from two existing acts already presented earlier to the Senate. Elements from the 2023 Lummis-Gillibrand Responsible Financial Innovation Act and portions of Senator Warren&rsquo;s and Senator Marshall&rsquo;s Digital Asset Anti-Money Laundering Act, introduced in 2022, have been integrated into the bill.&nbsp;</p>\n<p>These additions mandate the Secretary of the Treasury to establish examination standards for crypto assets, helping with risk assessment and ensuring compliance with money laundering and sanctions laws.&nbsp;</p>\n<p>Furthermore, the Treasury Department will be required to conduct a study on countering anonymous crypto transactions, specifically targeting the use of mixers to obscure fund origins.</p>\nCustomary Approach To Legislation\n<p>The inclusion of crypto-related provisions in a military bill may raise eyebrows. However, the practice of adding non-defense-related amendments to military bills is not uncommon.&nbsp;</p>\n<p>Furthermore, the senators have defended this move by highlighting the importance of combating illicit finance within the crypto industry. Senator Lummis emphasizes that this measure is crucial for identifying and rooting out bad actors in the sector.</p>\n<p>Additionally, the bill aims to address concerns related to national security, ensuring that crypto assets are not exploited to evade sanctions or fund terrorist activities.&nbsp;</p>\n<p>As the House has already passed its version of the NDAA, both chambers will now enter negotiations to reconcile differences and reach a consensus on the final version of the bill. This process is essential for the legislation's passage and enactment.</p>\nBroader Regulatory Initiatives\n<p>In conjunction with the NDAA, other congressional committees have also taken steps to address the regulatory challenges posed by the crypto industry. The House Agriculture Committee recently advanced the Financial Innovation Technology for the 21st Century Act to establish a federal regulatory framework for cryptocurrencies in the United States.&nbsp;</p>\n<p>The House Financial Services Committee passed its version a day earlier, focusing on establishing clear criteria for classifying crypto assets as securities or commodities.</p>\n<p>As the House and Senate continue their negotiations, the outcome will determine the extent of regulatory measures imposed on the crypto sector and its impact on financial institutions and traders alike.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T11:56:00.000Z",
    "title": "US lawmakers advance legislation to clarify crypto asset classification",
    "url": "https://www.cryptopolitan.com/us-lawmakers-advance-laws-to-clarify-crypto/",
    "description": "In a landmark move, members of the House Financial Services Committee voted to push forward proposed legislation aimed at providing clarity on whether certain crypto assets should be treated as securities or commodities. The bill, known as the Financial Innovation and Technology for the 21st Century Act (H.R. 4763), is set to be considered by ... <a title=\"US lawmakers advance legislation to clarify crypto asset classification\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-lawmakers-advance-laws-to-clarify-crypto/\" aria-label=\"More on US lawmakers advance legislation to clarify crypto asset classification\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T11:53:10.000Z",
    "title": "Is Qualcomm the AI Sleeper Stock? The Meta Team-Up Holds Clues",
    "url": "https://www.cryptopolitan.com/qualcomm-ai-sleeper-stock-meta-team-up/",
    "description": "Mobile chip design leader Qualcomm and social media titan Meta Platforms have joined forces to revolutionize the world of Artificial Intelligence (AI). Qualcomm&#8217;s breakthrough in shrinking AI algorithms for Android phones promises to revolutionize consumer and cloud computing industries. This partnership enables AI-powered services directly on mobile devices, eliminating the need for costly data centers ... <a title=\"Is Qualcomm the AI Sleeper Stock? The Meta Team-Up Holds Clues\" class=\"read-more\" href=\"https://www.cryptopolitan.com/qualcomm-ai-sleeper-stock-meta-team-up/\" aria-label=\"More on Is Qualcomm the AI Sleeper Stock? The Meta Team-Up Holds Clues\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-28T12:00:45.000Z",
    "title": "Bitcoin Set To Accelerate As A Store Of Value In Wake Of Bank Collapses, Cathie Wood",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-set-to-accelerate-as-store-of-value/",
    "description": "ARK Invest CEO and crypto proponent Cathie Wood says that Bitcoin is set to grow massively as a store of value following the recent bank collapses. She believes that Bitcoin’s stability and a huge rally in the wake of US regional banks collapsing is a major testament to the fact that Bitcoin is the future of money. Cathie Wood Remains Bullish On Bitcoin In a recent interview with Barron&#8217;s, Wood maintained that she remains bullish on digital assets and highlighted three reasons she won’t be backing down on her investments. According to her, Bitcoin stood tall and rose by 60%, from $19,000 to $30,000, when regional banks like First Republic, SVB, and Signature Bank collapsed. She attributed this run to investors seeing the asset as a safe alternative for storing their wealth.  Related Reading: European Central Bank Follows US Fed’s Footsteps With 25 BPS Hike Wood explained: We see three revolutions taking place because of crypto. Bitcoin will dominate the first one, the money revolution. The biggest proof is that when regional-bank stocks were falling apart earlier this year, Bitcoin went from $19,000 to $30,000. That was a flight to safety, and we expect it to accelerate. The centralized monetary system we have today is an aberration. We could be going back to the future – before the Federal Reserve existed – under a digital, rules-based monetary system with no government oversight. The other reasons for her bullishness on digital assets relate to decentralized finance (DeFi) and digital property rights involving tokenizing several physical assets in real estate and other relevant industries.  “The second revolution is in financial services, or the so-called DeFi, which will be Ethereum-based. There are a number of infrastructure providers out there. It’s the survival of the fittest, and I’m excited to see who wins,” the CEO said. Last but not least, according to Woord, “is digital property rights, or what many call NFT or the metaverse. People are already buying real estate in virtual worlds. Our young research associates come into the office wearing jeans and T-shirts with no logos, but they are getting their status in the virtual world.” BTC bulls struggle to keep bears at bay &#124; Source: BTCUSD on Tradingview.com Weighing In On Coinbase’s Battle With SEC During the interview, Cathie Wood also discussed Coinbase’s ongoing battle with the United States Securities and Exchange Commission (SEC). Wood’s ARK holdings are one of the largest holders of Coinbase’s stock. She believes that the crypto exchange will ultimately get victory in the SEC’s lawsuit against it for the sale of unregistered securities.  According to her, the court will rule that the SEC has gone beyond its regulatory purview, and in the long run, the US Congress will pass crypto-friendly bills.  “Meanwhile, the legislative branch has awakened to the fact that crypto is a new asset class and we might need new legislatures to give the regulators some guidance,” the ARK Invest CEO added. Related Reading: Lacoste Unveils Exclusive Ethereum-Based Virtual Store For NFT Holders “Those two branches of government have given us great confidence that Coinbase will come out of this as a winner. Many Coinbase competitors either haven’t entered the US or moved out because of our regulatory system. Coinbase has stayed to fight. We think they’ll be rewarded accordingly.” Cathie Wood’s ARK had bought $21.6 million worth of Coinbase’s stock in early June, just immediately after the SEC filed a lawsuit against the crypto exchange. Featured image from ETF Stream, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T12:06:30.000Z",
    "title": "Ripple (XRP) SEC Case Update: What Does This Mean For Coins Like Anarchy (ANA)",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-sec-case-update-what-does-this-mean-for-coins-like-anarchy-ana/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-xrp-sec-case-update-what-does-this-mean-for-coins-like-anarchy-ana",
    "description": "<img width=\"512\" height=\"286\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T150554.565.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T150554.565.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T150554.565-300x168.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />It&#8217;s been days since Ripple (XRP) got its status reversed as an unregistered security, but the news has spread to every corner of the crypto space. Most altcoins have had price surges, and even the big players like Bitcoin have felt the aftermath of XRP&#8217;s partial victory.  But what effect does it have on new [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-28T11:57:07.000Z",
    "title": "Xstake, a New Way to Stake Your Crypto With Wanchain",
    "url": "https://www.altcoinbuzz.io/product-release/xstake-a-new-way-to-stake-your-crypto-with-wanchain/",
    "description": "<p>Wanchain launches Xstake, a new service designed to provide you with different staking opportunities. Xstake mirrors Wanchain&#8217;s continued dedication to security and ease of use across chains. The new service makes it easy to delegate WAN tokens to Wanchain Bridge Nodes and PoS Validator Nodes. It will also change how people use the Wanchain Layer [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/product-release/xstake-a-new-way-to-stake-your-crypto-with-wanchain/\">Xstake, a New Way to Stake Your Crypto With Wanchain</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-28T11:45:44.000Z",
    "title": "Analyst Predicts Double-Digit Dogecoin Rally, Sets Targets for ‘Top Performer’ Altcoin That’s Up 70% in a Month",
    "url": "https://dailyhodl.com/2023/07/28/analyst-predicts-double-digit-dogecoin-rally-sets-targets-for-top-performer-altcoin-thats-up-70-in-a-month/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/DoubleDigit-Dogecoin-Rally.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/DoubleDigit-Dogecoin-Rally.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/DoubleDigit-Dogecoin-Rally.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/DoubleDigit-Dogecoin-Rally.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/DoubleDigit-Dogecoin-Rally.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/DoubleDigit-Dogecoin-Rally.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/DoubleDigit-Dogecoin-Rally.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader is predicting that Dogecoin (DOGE) has more room to run as he updates his outlook on one red-hot altcoin. Pseudonymous trader Altcoin Sherpa tells his 196,300 Twitter followers that Dogecoin will likely increase by about 20% in the near term from its current value of $0.077. &#8220;DOGE: One of the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/28/analyst-predicts-double-digit-dogecoin-rally-sets-targets-for-top-performer-altcoin-thats-up-70-in-a-month/\">Analyst Predicts Double-Digit Dogecoin Rally, Sets Targets for ‘Top Performer’ Altcoin That’s Up 70% in a Month</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]