[
  {
    "source": "CryptoGlobe",
    "date": "2024-01-14T11:25:33.000Z",
    "title": "Grayscale CEO Michael Sonnenshein Reflects on Historic Spot Bitcoin ETF Approval in the U.S.",
    "url": "https://www.cryptoglobe.com/latest/2024/01/grayscale-ceo-michael-sonnenshein-reflects-on-historic-spot-bitcoin-etf-approval-in-the-u-s/",
    "description": "On 11 January 2024, Michael Sonnenshein, CEO of Grayscale, appeared on Bloomberg TV to discuss the U.S. SEC’s recent approval of several spot Bitcoin ETFs. Sonnenshein began by expressing his excitement over this historic day, marking the culmination of a decade’s work. He thanked investors for their patience and the Grayscale team for their efforts, […]\n"
  },
  {
    "source": "NullTX",
    "date": "2024-01-14T11:17:06.000Z",
    "title": "Bitcoin (BTC) and Ethereum (ETH) Whales Deploy Capital Towards High Potential Altcoin Pullix (PLX)",
    "url": "https://nulltx.com/bitcoin-btc-and-ethereum-eth-whales-deploy-capital-towards-high-potential-altcoin-pullix-plx/",
    "description": "Cryptocurrency markets have been buzzing with activity, especially around the leading digital assets, Bitcoin (BTC) and Ethereum (ETH). Investors and market analysts are closely watching these major players, as their movements often set the tone for the broader market. Particularly, Bitcoin has been a focal point due to significant developments [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-14T11:15:50.000Z",
    "title": "3 Top Crypto Coins With Great Potential This Year: Meme Moguls (MGLS), OKB Coin (OKB), and Cosmos (ATOM) Keep Gaining!",
    "url": "https://nulltx.com/3-top-crypto-coins-with-great-potential-this-year-meme-moguls-mgls-okb-coin-okb-and-cosmos-atom-keep-gaining/",
    "description": "In anticipation of Bitcoin ETF approval and BTC’s imminent halving in the coming halving, many altcoins are gearing up with interesting price trajectories, each posing as the best crypto investment to diversify with. While there are indeed many coins predicted to rise this season, three particular contenders with great potential [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-14T11:10:59.000Z",
    "title": "Spot Bitcoin ETFs Record Over $800 Million In Net Inflows in Debut Week – Details",
    "url": "https://www.newsbtc.com/news/bitcoin/spot-bitcoin-etfs-record-over-800-million-in-net-inflows-in-debut-week-details/",
    "description": "On Wednesday, January 10, the US Securities and Exchange Commission (SEC) finally approved the launch of spot Bitcoin ETFs, representing a remarkable event in US trading history.  So far, market data on these investment funds have confirmed theories of increased institutional demand for Bitcoin, with over $800 million in total net inflows and $3.6 billion in trading volume recorded across the first two days of trading.  Although these inflows are yet to be reflected in BTC’s price, as the premier cryptocurrency dipped by 2% in the last week, the spot Bitcoin ETFs have certainly kicked off with a blast which is indicative of potential gains for the world’s largest asset and the general crypto market.  Related Reading: Bitcoin ETF Approval Triggers $1.2 Billion Trading Volume And New Highs For BTC Price Spot Bitcoin ETFs Attract Over $1.4 Billion In Two Days &#8211; Bloomberg Data In an X post on January 13, Bloomberg ETF analyst Eric Balchunas shared some insight on the impressive performance of the spot Bitcoin ETFs in their debut trading week.  Balchunas noted that of the 11 approved spot BTC ETFs, nine have recorded a total inflow of over $1.4 billion. Leading the lot is BlackRock’s IBIT, with an estimated asset inflow of $497.7 million, closely followed by Fidelity’s FBTC, which boasts about $422.3 million in investment.  The BTC spot ETFs of Bitwise and ARK/21 Shares have also produced a significantly positive performance attracting $237.9 million and 105.2 million, respectively.  On the other hand, Grayscale’s GBTC has been the market outcast, recording a stunning $579 million in outflows over the first two days of trading.  Source: Bloomberg Following the SEC’s approval on Wednesday, investors cashed in heavily on GBTC, which was recently converted from a closed-end fund to a spot ETF. SkyBridge Capital founder Anthony Scaramucci has already commented on this trend describing it as one of the potential reasons behind Bitcoin’s dip in the last week.  In total, the spot Bitcoin ETF market recorded an impressive net inflow of $818.9 million in its debut trading week. These figures are likely to improve in the next few weeks as selling volume eventually declines. Meanwhile, investors still anticipate the debut of Hashdex’s spot ETF &#8211; DEFI &#8211; which is undergoing fund conversion from the company’s Bitcoin futures ETF. Related Reading: Spot Bitcoin ETFs Could Trade 8% Above Fair Value: Renowned Expert BTC Price Overview At the time of writing, Bitcoin exchanges hands at $42,980 reflecting a 0.73% loss in the last day. Meanwhile, the token’s daily trading volume has plummeted by 62.33% and is now valued at $16.9 billion. However, with a market cap of $842.23 billion, Bitcoin remains the largest cryptocurrency in the world. BTC trading at $42,916.07 on the daily chart &#124; Source: BTCUSDT chart on Tradingview.com Featured image from Yahoo Finance, chart from Tradingview"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-14T11:21:25.000Z",
    "title": "This Is the Real Goal Behind Blackrock’s Bitcoin ETF",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/this-is-the-real-goal-behind-blackrocks-bitcoin-etf/",
    "description": "<p>In a recent statement, Fink revealed that BlackRock&#8217;s goal is to achieve tokenized stocks on a single shared ledger. This innovative strategy behind its Bitcoin ETF aims to revolutionize the traditional securities market. This will represent a significant step towards embracing blockchain technology. BlackRock&#8217;s Larry Fink Reveals Vision for Tokenized Stocks on Blockchain The vision [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/this-is-the-real-goal-behind-blackrocks-bitcoin-etf/\">This Is the Real Goal Behind Blackrock’s Bitcoin ETF</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-14T11:18:00.000Z",
    "title": "GameStop Bids Farewell to NFT Marketplace Amid Regulatory Uncertainty",
    "url": "https://coinedition.com/gamestop-bids-farewell-to-nft-marketplace-amid-regulatory-uncertainty/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/NFT-10.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"GameStop Bids Farewell to NFT Marketplace Amid Regulatory Uncertainty\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/NFT-10.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/NFT-10-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/NFT-10-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/NFT-10-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/NFT-10-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/NFT-10-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Gaming retail giant GameStop has announced the imminent shutdown of its non-fungible token (NFT) marketplace, citing regulatory ambiguity in the crypto space. In a statement on the company&#8217;s website, GameStop informed users that the NFT platform would cease operations on February 2, 2024. With just over two weeks left, users were urged to finalize any [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/gamestop-bids-farewell-to-nft-marketplace-amid-regulatory-uncertainty/\">GameStop Bids Farewell to NFT Marketplace Amid Regulatory Uncertainty</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]