[
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T01:54:36.000Z",
    "title": "Web3 is about solving business problems, not token prices: Google Cloud exec",
    "url": "https://cointelegraph.com/news/web3-solving-business-problems-not-token-prices-google-cloud-interview",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/f798805f-61c7-4576-b95c-4065604ee34b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>While TradFi is the main source of demand for blockchain tech, digital identity and supply chain are exciting areas too, according to Google Cloud Head of Web3 James Tromans.</p>\n                    <p><p>The crypto industry is far too focused on token prices, rather than figuring out how smart contracts can be used to solve real-world business problems, according to Google Cloud's Web3 lead. </p><p>In an interview with Cointelegraph, Google Cloud’s Head of Web3 James Tromans stressed the need to focus more on the business logic in the smart contract rather than the supply and demand dynamics of the token:</p><blockquote>“What are the business problems that you want to get executed? When you're running a smart contract to execute some business logic to solve your business problem, you're using a token, but the token is not the thing, it’s the business problem that's the thing.”</blockquote><p>“So I would like us to get away from all this talk about tokens and token speculation as if that is Web3 — that is not Web3,” Tromans added.</p><p>One of Google Cloud’s main blockchain services is its Blockchain Node Engine, offering users a self-hosted node to access blockchain data, conduct transactions, build smart contracts and run decentralized applications.</p><p>Tromans argued that blockchain and smart contracts can lead to innovation, lower operational costs and new revenue streams.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/78102153-e684-49d0-b1d0-abb15abfd7a9.jpg\"  /><figcaption style=\"text-align: center;\"><em>Google Cloud’s James Troman in a recent interview at Token 2049 in Singapore. Source: Google Cloud</em></figcaption></figure><p>Despite the bear market, Tromans said Google Cloud has still seen strong demand from enterprises looking to integrate blockchain technology:</p><blockquote>“Over the past 12 to 15 months in the traditional enterprise space, interest in leveraging blockchain technology to improve efficiency, reduce cost and improve the speed of innovation hasn't gone away.”</blockquote><p>Most of this demand has come from the TradFi sector to solve basic finance and accounting problems, Tromans explained. But Google Cloud customers are increasingly looking at integrating blockchain-based solutions in digital identity and supply chain, he added.</p><p>Digital ID in particular has been a hot topic of debate in the Web3 world of late, with the recent <a href=\"https://cointelegraph.com/news/worldcoin-launch-divides-crypto-community\">launch of Worldcoin on Jul. 24</a> — an iris biometric cryptocurrency project founded by OpenAI chief executive Sam Altman in 2019.</p><h3>Blockchain tech isn’t invisible enough</h3><p>Tromans however argues that blockchain tech won't likely see mass adoption, at least until user experience improves. </p><p>“If the average end user, who isn't a computer scientist, who doesn't understand blockchain, has to know about their private keys — we've got it wrong. They have to be abstracted away,” he explained.</p><p>“When you load the Web browser, you're using a bunch of high tech capabilities like TCP-IP and HTTPS. None of these protocols mean anything to most people,” Tromans added, suggesting that <a href=\"https://cointelegraph.com/news/google-cloud-joins-web3-startup-to-make-de-fi-mainstream\">Web3 should strive for the same thing.</a></p><p>Tromans said <a href=\"https://cointelegraph.com/news/near-protocol-partners-with-google-cloud-to-support-web3-devs\">Web3 developers will need to build</a> frictionless solutions to help users recover private keys and help take care of their data for them to have a “fantastic” user experience.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Thank you <a href=\"https://twitter.com/savannah_fortis?ref_src=twsrc%5Etfw\">@savannah_fortis</a> for a great fireside discussion at <a href=\"https://twitter.com/hashtag/ProofOfTalk?src=hash&amp;ref_src=twsrc%5Etfw\">#ProofOfTalk</a> in Paris this week. <a href=\"https://t.co/U3BjAU878k\">https://t.co/U3BjAU878k</a></p>&mdash; James Tromans (@jmtromans) <a href=\"https://twitter.com/jmtromans/status/1669666885481185281?ref_src=twsrc%5Etfw\">June 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/google-cloud-broadens-web3-startup-program-with-11-blockchain-firms\"><strong><em>Google Cloud broadens Web3 startup program with 11 blockchain firms</em></strong></a></p><p>When user experience is optimized, blockchain technology will solve problems in a <a href=\"https://cointelegraph.com/news/web3-ecosystem-made-good-strides-changing-climate-narrative-exec-says\">range of industries,</a> he said.</p><blockquote>“When this technology is solving for payment, helping games have lower cost or helping artists be more creative and get paid for their work so they can have careers but not actually have to know about how the technology is functioning, that's critical [and] very, very important for the wide scale adoption of the technology.”</blockquote><p>“When Web3 hits mass adoption, we won't call it Web3. We'll just call it the web again,” he said.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/joe-lubin-the-truth-about-eth-founders-split-and-crypto-google/\"><strong><em>Joe Lubin — The truth about ETH founders split and ‘Crypto Google’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]