[
  {
    "source": "CoinDesk",
    "date": "2023-07-21T16:06:00.000Z",
    "title": "OpenSea’s New Deal, McNuggets Land in the Metaverse ",
    "url": "https://www.coindesk.com/web3/2023/07/21/openseas-new-deal-mcnuggets-land-in-the-metaverse/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "This week, OpenSea introduced “Deals,” allowing NFT collectors to trade directly with one another and McDonald’s launched McNugget Land in The Sandbox, inviting users to interact with pixelated nuggets and play mini-games."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-21T16:00:00.000Z",
    "title": "Tokenized Collectibles Platform Americana Is Bringing High-End Physical Items On-Chain",
    "url": "https://www.coindesk.com/web3/2023/07/14/tokenized-collectibles-platform-americana-is-bringing-high-end-physical-items-on-chain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Backed by Alexis Ohanian and OpenSea, the newly-launched platform has created blockchain-based solutions for several pain points associated with buying and selling high-end physical collectibles."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-21T15:55:44.000Z",
    "title": "To Survive the New Era of Robot Spam, Look to Crypto’s History",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/21/to-survive-the-new-era-of-robot-spam-look-to-cryptos-history/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Human communication systems are under threat from linguistic robots (AI). But the same spammy problem helped lead to the creation of Bitcoin."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-21T15:45:30.000Z",
    "title": "'Razzlekhan,' Husband Make Plea Deal in Bitfinex Hack Laundering Case Worth Billions",
    "url": "https://www.coindesk.com/policy/2023/07/21/razzlekhan-husband-make-plea-deal-in-bitfinex-hack-laundering-case-worth-billions/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The pair will forfeit the proceeds from nearly 120,000 bitcoins they allegedly laundered from the hacked crypto exchange."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-21T15:49:30.000Z",
    "title": "Couple behind Bitfinex money laundering scheme reach plea deal with US prosecutors",
    "url": "https://cointelegraph.com/news/couple-bitfinex-money-laundering-scheme-reach-plea-deal-prosecutors",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/6c899d0b-e48a-4260-aa5c-1ff098459f52.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ilya Lichtenstein and Heather Morgan are scheduled to appear for an arraignment and hearing on Aug. 3 as part of a plea agreement with U.S. prosecutors.</p>\n                    <p><p>The husband and wife alleged to have laundered billions of dollars worth of Bitcoin connected to the 2016 Bitfinex hack have reached a plea agreement with authorities in the United States.</p><p>According to records filed with U.S. District Court in the District of Columbia on July 21, Ilya Lichtenstein and Heather Morgan are scheduled to appear for an arraignment and hearing on Aug. 3 as part of a plea agreement with prosecutors. The pair had been charged with money laundering conspiracy and conspiracy to defraud the United States, and expected to forfeit digital assets connected to the case. </p><p>Following the hack of crypto exchange Bitfinex in August 2016 in which roughly 119,754 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) was stolen, Lichtenstein and Morgan allegedly laundered more than 94,643 BTC of the funds “in a series of small, complex transactions across multiple accounts and platforms”. Authorities <a href=\"https://cointelegraph.com/news/bitfinex-money-laundering-husband-faces-pre-trial-detention-wife-gets-bail\">arrested the two</a> in New York in February 2022. </p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-21T16:05:41.000Z",
    "title": "Rising unrealized profits indicate a more optimistic Bitcoin market",
    "url": "https://cryptoslate.com/rising-unrealized-profits-indicate-a-more-optimistic-bitcoin-market/",
    "description": "<p>The cryptocurrency market is a complex ecosystem, requiring numerous metrics and indicators to gauge its health and predict future trends. One such metric, the Net Unrealized Profit/Loss (NUPL), provides a nuanced view of market sentiment. NUPL indicates market sentiment by highlighting the difference between unrealized profit and unrealized loss in the Bitcoin supply. The &#8216;unrealized&#8217; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/rising-unrealized-profits-indicate-a-more-optimistic-bitcoin-market/\">Rising unrealized profits indicate a more optimistic Bitcoin market</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-21T16:00:00.000Z",
    "title": "Stablecoins: The New Favourite of Cybercriminals?",
    "url": "https://cryptodaily.co.uk/2023/07/stablecoins-the-new-favourite-of-cybercriminals",
    "description": "<p>An expert on crypto has recently postulated that criminals are leaving Bitcoin in order to use stablecoins, which are considered to be an easier go-to for illegal financial activities.</p>\nFrom Bitcoin to Stablecoins\n<p>It has often been suggested, especially in the mainstream media, that&nbsp; Bitcoin was one of the main currencies in which to transact illicit activities. However, recent insights suggest a shift in this trend. Originally reported by CoinTelegraph, Tara Annison, the former head of technical crypto advisory at Elliptic, stated that the criminal underbelly of the crypto world is now leaning more towards stablecoins, particularly USD Coin (USDC), over Bitcoin.</p>\n<p>Annison, during her presentation at EthCC in Paris, delved into the changing dynamics of crypto-related crimes. She pointed out that Bitcoin's decreasing popularity among criminals can be attributed to the rise of decentralised finance protocols, mixing services, and most notably, stablecoins. These digital assets, especially those pegged to the dollar, offer new, more discreet avenues for illicit transactions.</p>\nWhy the shift to stablecoins?\n<p>Annison explains that assets like USDC offer easy access and can be effortlessly laundered through decentralised exchanges (DEXs). She remarked that in her view the deep liquidity and substantial volume on these platforms make them ideal for such activities.</p>\n<p>However, it's not all gloomy. Annison highlighted a potential advantage for law enforcement agencies. Centralised issuers, such as Circle, have the capability to freeze specific USDC tokens. This means that before these criminals can convert their assets into fiat currencies through DEXs or centralised platforms, their funds can be halted. Annison commented that in her opinion we are witnessing a rise in blacklisted USDC and USDT accounts, effectively freezing assets that criminals can't access.</p>\n$7.8 billion in scams\n<p>Annison went on to say that stablecoins aren't the only concern. Ponzi and pyramid schemes continue to plague the crypto sector. A staggering $7.8 billion has been syphoned off from unsuspecting victims through these scams. Moreover, criminals are constantly innovating, employing techniques like chain swapping and asset swapping to obscure their tracks, using a myriad of tools, from DEXs to mixers, in order to muddy the trail for blockchain analytics firms.</p>\n<p>In the light of crypto scams decreasing by 46% compared to previous years, Annison believes the current bear market in crypto is a significant factor, suggesting that with reduced hype and lower prices, the sector becomes less lucrative for criminals.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T16:04:01.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $25.41 with a 24-hour trading volume of $618,897,839. Solana is up 2.73% in the last 24 hours. The current CoinMarketCap ranking is #9, with a live market cap of $7,273,881,101. It has a circulating supply of 394,890,490 SOL coins and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T15:50:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-21T15:48:54.000Z",
    "title": "FTX’s former CEO SBF allegedly leaked ex-lover’s diary",
    "url": "https://crypto.news/ftxs-former-ceo-sbf-allegedly-leaked-ex-lovers-diary/",
    "description": "The US Department of Justice (DoJ) has attributed a leak of Caroline Ellison&#8217;s personal diary excerpts, recently featured in a New York Times piece, to her ex-lover, Sam Bankman-Fried. Caroline Ellison, previously in a romantic relationship with SBF, was the&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T16:00:52.000Z",
    "title": "A Dive into Golden Inu’s Upcoming DeFi Marketplace: Golden Bazaar",
    "url": "https://www.crypto-news-flash.com/a-dive-into-golden-inus-upcoming-defi-marketplace-golden-bazaar/?utm_source=rss&utm_medium=rss&utm_campaign=a-dive-into-golden-inus-upcoming-defi-marketplace-golden-bazaar",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T162332.150.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T162332.150.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T162332.150-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The up and coming crypto project “Golden Inu” is recently celebrating its much awaited launch on the Ethereum Blockchain. Done via the world’s top decentralized cryptocurrency exchange, Uniswap, the ERC-20 token has already seen a value increase of +20%.  And the incredible 48 Hour ROI is still far from analyst’s expectations.  The $GOLDEN token’s yields [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T15:58:26.000Z",
    "title": "BREAKING: Indonesia Unleashes National Crypto Exchange After Long Wait – A New Era of Digital Trading",
    "url": "https://www.crypto-news-flash.com/breaking-indonesia-unleashes-national-crypto-exchange-after-long-wait-a-new-era-of-digital-trading/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-indonesia-unleashes-national-crypto-exchange-after-long-wait-a-new-era-of-digital-trading",
    "description": "<img width=\"1280\" height=\"853\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/indonesia-g52f048a45_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/indonesia-g52f048a45_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/indonesia-g52f048a45_1280-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/indonesia-g52f048a45_1280-1024x682.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/indonesia-g52f048a45_1280-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/indonesia-g52f048a45_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Indonesia&#8217;s long-awaited national cryptocurrency exchange and clearinghouse is finally operational after multiple delays. The government-approved platform resembles traditional securities markets and aims to create a fair crypto asset trading ecosystem while prioritizing customer protection. Finally, the moment crypto enthusiasts in Indonesia have been eagerly anticipating has arrived! The country&#8217;s long-delayed national cryptocurrency exchange is now [...]"
  }
]