[
  {
    "source": "Decrypt",
    "date": "2023-06-09T19:31:08.000Z",
    "title": "Minecraft Still Hasn't Officially Banned NFTs—But It's Coming",
    "url": "https://decrypt.co/143996/minecraft-still-hasnt-officially-banned-nfts-but-coming",
    "description": "Nearly a year after making the announcement, Microsoft shares an update about Minecraft’s intended NFT ban."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-06-09T19:13:45.000Z",
    "title": "Mt. Gox Suspects Charged: Russian Nationals Indicted by DOJ",
    "url": "https://cryptobriefing.com/mt-gox-suspects-charged/?utm_source=feed&utm_medium=rss",
    "description": "Alexey Bilyuchenko, 43, and Aleksandr Verner, 29, both Russian nationals, have been charged by the U.S. Department of Justice in connection with the 2011 hacking of prominent cryptocurrency exchange Mt...."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-09T19:30:24.000Z",
    "title": "Two Russians Charged for Infiltrating Mt Gox and Operating Illicit Crypto Exchange, BTC-e",
    "url": "https://news.bitcoin.com/two-russians-charged-for-infiltrating-mt-gox-and-operating-illicit-crypto-exchange-btc-e/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/cheee68888-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Two Russians Charged for Infiltrating Mt Gox and Operating Illicit Crypto Exchange, BTC-e\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/cheee68888-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cheee68888-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cheee68888-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cheee68888-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cheee68888-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cheee68888-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cheee68888.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a statement issued on Friday, the U.S. Department of Justice (DOJ) revealed that two Russian individuals have been accused of infiltrating a cryptocurrency exchange and running an unlawful exchange. Reportedly, the pair gained unauthorized access to Mt Gox&#8217;s servers from 2011 to 2014 and purportedly pilfered 647,000 bitcoins from the now-dissolved exchange. Russian Duo [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T19:33:07.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T19:12:15.000Z",
    "title": "How to send Bitcoin without internet connection",
    "url": "https://www.cryptopolitan.com/how-to-send-bitcoin-without-internet/",
    "description": "When Satoshi Nakamoto released Bitcoin for financial use, the pseudonym person had a plan for decentralization and to reach the unbanked. Current trends have proved that BTC lived up to Nakamoto&#8217;s plan to reach the marginalized. Currently, users are able to send and access the BTC blockchain without an internet connection. Here is how you ... <a title=\"How to send Bitcoin without internet connection\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-to-send-bitcoin-without-internet/\" aria-label=\"More on How to send Bitcoin without internet connection\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-09T19:30:12.000Z",
    "title": "Here’s How Current Bitcoin Capitulation Compares With Past Crashes",
    "url": "https://www.newsbtc.com/bitcoin-news/current-bitcoin-capitulation-compares-past-crashes/",
    "description": "On-chain data shows that Bitcoin short-term holders are depositing 0.82% of their supply to exchanges. Here&#8217;s how these inflows compare with past crashes. Bitcoin Short-Term Holder Inflows Have Been Elevated Recently The BTC market can be divided into two broad investor groups, one of which is the &#8220;short-term holder (STHs) cohort.&#8221; The STHs are investors who have been holding onto their coins since less than 155 days ago. Generally, the Bitcoin holders belonging to this group are the weakest hands in the market, as they may easily sell at the sight of any sharp volatility or uncertainty in the market. The opposite cohort is called the &#8220;long-term holder (LTH) group,&#8221; and it naturally includes all participants that have been carrying their BTC in their wallets since more than 155 days ago. These LTHs usually hold for large stretches of times, and they are the diamond hands in the sector who need to be pushed a lot before they start panic selling their coins. Recently, the Bitcoin market has observed the emergence of FUD in the market, as a result of the US Securities and Exchange Commission (SEC) suing cryptocurrency exchanges Binance and Coinbase. The market has acted volatile in both directions, but overall the price of the asset has gone down since the volatility has arrived. Obviously, in times like these, the STHs would be the first ones to break. In a new tweet, the on-chain analytics firm Glassnode has looked at the exchange inflow data of the STHs, to see how they are coping with the current situation. The below chart shows the trend in the Bitcoin exchange inflow for these investors over the past year: Looks like the value of the metric has been a bit high in recent days &#124; Source: Glassnode on Twitter As you can see in the above graph, the Bitcoin exchange inflow for the STHs has been climbing recently and has now hit relatively high levels. The &#8220;exchange inflow&#8221; here refers to a metric that tracks the amount of the asset that these investors have been depositing into the wallets of centralized exchanges. Related Reading: Bitcoin Bearish Signal: Dormant 1,433 BTC Moves After 10+ Years One of the main reasons why investors transfer their coins to these platforms is for selling-related purposes, so the exchange inflow data for these holders can provide us with hints about their current selling behavior. In the context of the current discussion, a modified version of the exchange inflow is being used; one that measures the inflows in terms of the percentage of the total STH Bitcoin supply. The STH exchange inflow has hit a value of 0.82% recently, meaning that these investors have recently been sending around 0.82% of their supply to these platforms. Related Reading: Bitcoin Price Defies Gravity But Here Is Why It Could Decline Again This is certainly not a small value, but when compared to other panic selling events in the past year, namely the LUNA collapse, the FTX crash, and the relief rally in March 2023 (all marked with red on the chart), the current inflows are still quite low. This would mean that the latest uncertainty in the Bitcoin market hasn&#8217;t yet been enough to push the STHs into capitulating at levels similar to historical capitulation events. BTC Price At the time of writing, Bitcoin is trading around $26,600, down 2% in the last week. BTC has been consolidating in the last few days &#124; Source: BTCUSD on TradingView Featured image from Maxim Hopman on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-09T19:30:00.000Z",
    "title": "LUNC Bullish Momentum Stalls, Indicators Foreshadow Recovery",
    "url": "https://coinedition.com/lunc-bullish-momentum-stalls-indicators-foreshadow-recovery/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/LUNC-Bullish-Momentum-Stalls-Indicators-Foreshadow-Recovery-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"LUNC Bullish Momentum Stalls, Indicators Foreshadow Recovery\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/LUNC-Bullish-Momentum-Stalls-Indicators-Foreshadow-Recovery-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/LUNC-Bullish-Momentum-Stalls-Indicators-Foreshadow-Recovery-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/LUNC-Bullish-Momentum-Stalls-Indicators-Foreshadow-Recovery.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>LUNC price shows bullish signs amid increasing trading volume. Moving averages suggest potential bullish momentum for LUNC. Rising Bollinger Bands indicate higher volatility and a possible price breakout for LUNC. The Terra Classic (LUNC) market opened at $0.00009893 and surged to a high of $0.0001028 as the day progressed, thanks to an early bullish surge. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/lunc-bullish-momentum-stalls-indicators-foreshadow-recovery/\">LUNC Bullish Momentum Stalls, Indicators Foreshadow Recovery</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]