[
  {
    "source": "NewsBTC",
    "date": "2023-11-01T02:00:30.000Z",
    "title": "Floki Inu (FLOKI) Claps Back: Counters Bitget’s Claim Of Breaching 7-Day Listing Deadline",
    "url": "https://www.newsbtc.com/news/floki-inu-floki-claps-back-counters-bitgets-claim-of-breaching-7-day-listing-deadline/",
    "description": "Recently, the cryptocurrency community has witnessed a heated dispute between the protocol Floki Inu (FLOKI) and the crypto exchange Bitget.  The controversy arose following Bitget&#8217;s listing of TokenFi (TOKEN) and subsequent accusations of market manipulation, unauthorized listing, and insufficient solvency. Bitget Faces Allegations Of Market Manipulation On October 27, 2023, Bitget announced the listing of TokenFi (TOKEN) in the Innovation Zone of its Spot market. Shortly after the trading service for TokenFi commenced, significant price fluctuations were observed, prompting suspicions of market manipulation.  Concerns were further raised when it was discovered that TokenFi&#8217;s project team had contributed less than $2,000 worth of tokens to the liquidity pool of decentralized exchanges (DEXes), suggesting potential manipulation of initial liquidity. Moreover, an investigation of the TokenFi project uncovered additional issues, including an “opaque” token economy and an unclear vesting schedule.  In light of these findings and to safeguard their users, Bitget decided to delist TokenFi (TOKEN) and initiated a buyback plan for users who held the token on its platform. Related Reading: Ripple Partner’s Staggering XRP Holdings Revealed, Do They Know Something You Don’t? Floki Inu, responded strongly to the exchange’s actions, alleging that Bitget had violated their agreement not to list TOKEN until seven days after its launch.  The meme coin protocol claimed to have had conversations with “several Tier 1 exchanges” and respected parties in the cryptocurrency industry. While these exchanges had expressed interest in listing TOKEN earlier, they agreed to honor Floki Inu&#8217;s request to wait for the stipulated period.  However, Bitget, which, according to Floki Inu, was “the smallest exchange” among those involved, allegedly announced the listing of a fake version of the TOKEN token just 12 minutes before the official launch on the blockchain. Floki Inu further asserted that Bitget had engaged in “deceptive trading practices,” manipulating TOKEN&#8217;s volume without evidence of holding the actual tokens.  The protocol alleges that Bitget&#8217;s initial announcement had even stated that withdrawals would open 24 hours after trading began, potentially indicating an attempt to manipulate the token&#8217;s price. However, the market response did not align with Bitget&#8217;s expectations, resulting in a significant financial loss. The situation escalated when users began reporting difficulties in withdrawing TOKEN from Bitget&#8217;s platform, with some users allegedly being banned for complaints. Floki Inu claimed to have contacted Bitget to address the issue, but the response was unsatisfactory, including a request to report liquidity issues to Bitget&#8217;s support team. Floki Inu Alleges Bad Faith Following subsequent discussions between Floki Inu and Bitget, it was revealed that Bitget required up to 1 billion TokenFi tokens to meet user withdrawal demands and cover their financial deficit. According to Floki’s response, this amounted to approximately 10% of TokenFi&#8217;s total supply, equivalent to around $20 million at the time of Bidget’s statement. Furthermore, the protocol accused Bitget of acting in “bad faith” and attempting to resolve the situation through an over-the-counter (OTC) deal at a deeply discounted rate.  The proposed discount of 90% from the market price raised concerns, as it was argued that Bitget should bear the responsibility for its actions and the resulting financial shortfall. In response to Bitget&#8217;s announcement of delisting TokenFi and accusations of market manipulation, Floki Inu disputed the claims made by Bitget. They asserted that Bitget had listed the token against their explicit instructions and falsely accused the Floki Inu team of price manipulation.  Floki also challenged Bitget to provide verifiable evidence of their TOKEN and FLOKI holdings, expressing concerns about Bitget&#8217;s overall solvency and risk management practices. Related Reading: Ethereum Bearish Signal: MVRV Has Entered The “Danger” Zone Ultimately, the protocol cautioned its users against trading or holding FLOKI on Bitget, citing the “troubling patterns” witnessed during the TokenFi incident. As the situation develops, the cryptocurrency community awaits further clarification and resolution regarding the allegations and the impact on affected users. Given these developments,  FLOKI has experienced a retracement of over 9% in the past 24 hours and is currently trading at $0.00003250. Nonetheless, the token has seen an impressive 85% increase over the past fourteen days.  Featured image from Shutterstock, chart from TradingView.com"
  }
]