[
  {
    "source": "Bitcoin.com",
    "date": "2023-10-28T06:00:45.000Z",
    "title": "Alex Jones Lost a 10K-Bitcoin Stash Gifted by Max Keiser — Now He Can Regain It Doing a Quiz",
    "url": "https://news.bitcoin.com/alex-jones-lost-a-10k-bitcoin-stash-gifted-by-max-keiser-now-he-can-regain-it-doing-a-quiz/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/19ccad7c-976a-4c91-a8c4-ddeeddf0a552-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Alex Jones Lost a 10K Bitcoin Stash Gifted by Max Keiser. Now He Can Regain It in a Quiz\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/19ccad7c-976a-4c91-a8c4-ddeeddf0a552-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/19ccad7c-976a-4c91-a8c4-ddeeddf0a552-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/19ccad7c-976a-4c91-a8c4-ddeeddf0a552-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/19ccad7c-976a-4c91-a8c4-ddeeddf0a552-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/19ccad7c-976a-4c91-a8c4-ddeeddf0a552-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/19ccad7c-976a-4c91-a8c4-ddeeddf0a552-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/19ccad7c-976a-4c91-a8c4-ddeeddf0a552.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />International journalist and Bitcoin maximalist Max Keiser is giving Infowars host Alex Jones the chance of regaining a gift of 10,000 bitcoin he lost. According to Keiser, Jones will have the chance to recover the stash by answering a trivia round consisting of 5 questions. However, Jones has not answered Keiser&#x2019;s call at the time [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-28T05:45:36.000Z",
    "title": "Injective (INJ) Rules Weekend Top 50 Crypto Ranking With 60% Hike – Here’s Why",
    "url": "https://www.newsbtc.com/news/injective-rules-weekends-top-50-crypto-ranking/",
    "description": "The cryptocurrency known as Injective (INJ) has exhibited a remarkable increase in price, exceeding 900% since the commencement of the year, even in the face of a general downward trend in the digital currency market. The price of INJ has remained unaffected by the extensive consolidation observed in the cryptocurrency market since Thursday. On Friday, it had a 10% increase, reaching a trading value of $13.15. The current market valuation of the coin stands at over $1 billion. This places the cryptocurrency at the 44th position in terms of rankings based on market capitalization. Related Reading: Bitcoin Braces For $50 Billion Influx Following ETF Launch, Bitwise CEO Says Injective Nears Historical Peak Amidst Strong Partnerships The interoperable Layer-1 blockchain, which facilitates the operation of decentralized finance apps (DApps) in the future generation, is approaching its historical peak value of $31.40, positioning it as one of the top-performing cryptocurrencies in the current year. Prominent blockchain protocol Injective has the support of Dallas Mavericks owner and billionaire Mark Cuban. At the time of writing, INJ was trading at $13.55, and registered a solid 59% increase in the last week, according to figures by crypto market tracker Coingecko. Source: Coingecko The price range of Injective hit a peak value of nearly $12.8 during a 24-hour period. This represents the highest value observed in almost two years. The rise in the value of the token cannot be attributed entirely to the recent surge in Bitcoin prices. The increase is also influenced by Injective&#8217;s efforts to strengthen its position in the market through its relationship with Google and the introduction of a new product by Helix exchange. Unlike other blockchains like Ethereum, Solana, and Cardano, Injective&#8217;s focus is entirely on the financial industry. Provides developers with the tools they need to build dApps for a wide range of financial use cases, from lending and savings to derivatives trading and even oracles. The Injective network is notable for its lightning-fast processing speeds and low transaction fees. 1/ Introducing Injective Nexus: Injective&#8217;s official data integration &#38; availability on Google Cloud. Now core chain data from the Injective network will be accessible in BigQuery through the Analytics Hub, Google Cloud&#8217;s exclusive data sharing platform.https://t.co/V5gOyvAQe2 — Injective 🥷 (@Injective_) October 24, 2023 Related Reading: PEPE Price Leaps 90% As Meme Coin Reaches Over 155,000 On-Chain Wallets INJ market cap currently at $61.11 billion on the daily chart: TradingView.com Nexus Integration With Google Cloud Expands Accessibility For Users The Injective development team made an announcement last week regarding the integration of &#8220;Injective Nexus&#8221; with Google Cloud. This integration signifies a major development, as it enables the larger mainstream world to access core chain data through the Analytics Hub in BigQuery. The Google team said via a blog post: “Google Cloud to date has only offered BigQuery datasets for major blockchain networks like Bitcoin and Ethereum [&#8230;] now, Injective will become part of this prominent group of Layer-1 chains.” Meanwhile, a bullish trend in the near and medium term is confirmed by a golden confluence in the Exponential Moving Averages (EMAs) on the daily chart. Moreover, the bullish crossover of the MACD lines supports this optimistic feeling and improves the picture. Over $400 Million in $INJ is now staked making Injective one of the largest L1 networks by staked value 🚀 — Injective 🥷 (@Injective_) October 22, 2023 Moreover, the implementation of pre-launch futures for forthcoming tokens by Helix DEX, a decentralized exchange on Injective, has sparked considerable attention. Injective witnessed a significant surge in staked INJ, surpassing the $400 million mark on Monday. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Kate Trysh/Unsplash"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-28T05:55:02.000Z",
    "title": "Exploring Ripple’s Potential Game-Changer: Key Dates and Events Shaping XRP’s Future",
    "url": "https://www.crypto-news-flash.com/exploring-ripples-potential-game-changer-key-dates-and-events-shaping-xrps-future/?utm_source=rss&utm_medium=rss&utm_campaign=exploring-ripples-potential-game-changer-key-dates-and-events-shaping-xrps-future",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP Lawyer\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple&#8217;s upcoming Swell event on November 8-9 is creating a buzz in the XRP community, with high expectations of its potential impact on XRP&#8217;s price. The event’s exclusive, invitation-only nature, coupled with a comprehensive agenda covering the future of crypto and blockchain, makes it a focal point for speculation and anticipation. Referencing CNF&#8217;s update from [...]"
  }
]