[
  {
    "source": "Cointelegraph",
    "date": "2023-11-10T09:22:11.000Z",
    "title": "OpenAI and Microsoft partner with Humane on wearable AI pin ",
    "url": "http://cointelegraph.com/news/openai-microsoft-humane-wearable-ai-pin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/3830afa9-51d2-4e1c-97fb-11bc55db4e0e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>AI startup Humane launched the wearable virtual assistant AI Pin that is embedded with technology from OpenAI and cloud computing services from Microsoft.  </p>\n                    <p><p>The artificial intelligence (AI) startup Humane <a href=\"https://hu.ma.ne/media/humane-launches-ai-pin\" target=\"_blank\" rel=\"noopener nofollow\">released</a> a physical device on Nov. 10 that serves as a wearable AI virtual assistant. </p><p>The AI Pin is a lapel pin-style device that the user wears and taps to speak with a virtual AI-powered assistant. It is equipped with technology from OpenAI, the creator of the well-known chatbot ChatGPT, and has cloud computing capabilities via Microsoft. </p><p>According to Humane, users can also interact with the pin via an intuitive touchpad, holding up objects, performing gestures and through its laser ink display that is projected onto the palm. </p><p>It says the pin will be able to craft messages in the “tone of voice” of the user, sort emails, provide AI-driven music experiences, and it includes an AI-powered photographer. “Ai Pin can also act as your foreign language interpreter,” it reads, “and support your nutrition goals by identifying food using computer vision.”</p><p>In a statement the co-founders of Humane, Imran Chaudhri and Bethany Bongiorno, said:</p><blockquote>“Ai Pin is the embodiment of our vision to integrate AI into the fabric of daily life, enhancing our capabilities without overshadowing our humanity.</blockquote><p>Humane says it is also launching its own MVNO (mobile virtual network operator) connected by telecom company T-Mobile to provide wireless service for the device.</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/biden-ai-executive-order-certainly-challenging-open-source-ai-industry-insiders\"><strong><em>Biden AI executive order ‘certainly challenging’ for open-source AI — Industry insiders</em></strong></a></p><p>The pin is available to order in the United States from Nov. 16 and begins at $699 for the entire system, along with a monthly subscription of $24 per month which includes a cell phone number for the pin and cell services. </p><p>Humane was founded by ex-Apple employees who worked on the iPhone and has raised $241 million from investments by major players in the space including Sam Altman - CEO of OpenAI- and Microsoft. </p><p>The AI Pin comes on the heels of many fast-moving developments in the AI space over the last week. </p><p>On Nov. 5 Elon Musk and his AI startup<a href=\"https://cointelegraph.com/news/elon-musk-launches-ai-chatbot-grok-says-it-can-outperform-chatgpt\"> xAI launched chatbot Grok</a> which he said could outperform ChatGPT, which is currently hailed as one of the world’s most advanced chatbots. </p><p>The next day OpenAI<a href=\"https://cointelegraph.com/news/chat-gpt-launches-feature-subscribers-make-own-gpts\"> announced new ChatGPT features</a> that allow subscribers to create their very own GPTs </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\"><strong><em>Exclusive: 2 years after John McAfee’s death, widow Janice is broke and needs answers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-10T09:35:39.000Z",
    "title": "Polar Bear Capitals Embrace AI for Conservation, Combining with Shotguns and Strobe Lights",
    "url": "https://www.cryptopolitan.com/polar-bear-capitals-ai-for-conservation/",
    "description": "In the frozen expanse of Churchill, Manitoba, where polar bears weave through the snow like ghosts, a technological symphony is unfolding. The town, celebrated as the polar bear capital of the world, finds itself at the crossroads of tradition and innovation. The once-pervasive echoes of shotgun blasts, signaling bear encounters, are now harmonized with the ... <a title=\"Polar Bear Capitals Embrace AI for Conservation, Combining with Shotguns and Strobe Lights\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polar-bear-capitals-ai-for-conservation/\" aria-label=\"More on Polar Bear Capitals Embrace AI for Conservation, Combining with Shotguns and Strobe Lights\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-10T09:29:34.000Z",
    "title": "Ethereum soars to a 7-month high amid the BlackRock ETF approval",
    "url": "https://www.cryptopolitan.com/ethereum-soars-amid-blackrock-etf-filing/",
    "description": "Ethereum (ETH) saw a surge in its price that displayed a better performance than Bitcoin&#8217;s (BTC) following the recent buzz on the exchange-traded funds (ETFs) plans by BlackRock. Both these major currencies witnessed a surge in their price as ETH reached a fresh high in the past 24 hours.&#160; Bitcoin rallied to the $38,000 level ... <a title=\"Ethereum soars to a 7-month high amid the BlackRock ETF approval\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-soars-amid-blackrock-etf-filing/\" aria-label=\"More on Ethereum soars to a 7-month high amid the BlackRock ETF approval\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-10T09:22:42.000Z",
    "title": "India Ramps Up Cyber Police Training to Tackle Cryptocurrency Crime",
    "url": "https://www.cryptopolitan.com/india-to-train-police-to-tackle-crypto-crime/",
    "description": "India&#8217;s Ministry of Home Affairs has undertaken a decisive stride in bolstering the nation&#8217;s defense against cybercrime involving cryptocurrencies. In a substantial training initiative, more than 2,800 cyber police personnel have been equipped with advanced cryptocurrency forensics and investigations skills. This movement is part of a larger effort to modernize law enforcement in the digital ... <a title=\"India Ramps Up Cyber Police Training to Tackle Cryptocurrency Crime\" class=\"read-more\" href=\"https://www.cryptopolitan.com/india-to-train-police-to-tackle-crypto-crime/\" aria-label=\"More on India Ramps Up Cyber Police Training to Tackle Cryptocurrency Crime\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-10T09:20:46.000Z",
    "title": "Ripple IPO: Expert Reveals Why Investors Should Be Cautious",
    "url": "https://www.newsbtc.com/ripple-2/ripple-ipo-expert-cautious/",
    "description": "In a recent development, a prominent figure in the XRP community has explained why members of the community should be careful about being so excited about a Ripple IPO. Using historical data, she elaborated on why an IPO isn’t as straightforward and profitable as some might think.  Why Investors Should Be Cautious In a post shared on her X (formerly Twitter) platform, Crypto Eri revealed how investors aren’t excited about IPOs in what sounded like a note of warning to those who are ready to go all in if Ripple were to go public.  Related Reading: Countdown to Chaos: Ethereum Insider To Expose ETH Founders’ Fraud In Weeks The reason for investors’ lack of enthusiasm seems to be that the biggest IPOs of 2021 have shed 60% of their value since going public. According to her, this fact has also made other private entities cautious to hold off on their plans to go public.  She highlighted certain “essential components” that investors should insist on when listening to anyone talk about price analysis and a company’s valuation. These components include the components cash balance, debt, value of investment portfolio, total shares outstanding, and value of any on-hand assets.  While Eri seems to be more cautious about a potential Ripple IPO, some others have taken a more bullish stance and are ready to go all in on it. One of them happens to be pro-XRP Wall Street financial analyst Linda Jones, who had predicted that a Ripple stock could be valued as high as $600.  She also touted XRP as the next big thing in the financial market as she likened the crypto token to Microsoft and Apple’s stocks.  Maybe Not The Right Time For A Ripple IPO Eri’s warning also seemed to be directed at Ripple as she highlighted key points that might make the crypto company reconsider if an IPO was already in the works. She drew comparisons between Ripple and other similar types of companies, as the former could take a cue from some of their actions.  Related Reading: Analyst Predicts Bitcoin And Crypto Market Crash Of Epic Proportions, Here’s When Interestingly, one of them happens to be Ripple’s partner, Nium Global, which she noted was holding off its US IPO to “possibly the second quarter of 2025.” She alluded to the fact that this decision was made despite the fact that Nium Global is doing pretty well and even recently launched a liquidity hub for FX.  The XRP community might, however, not have to worry about how Ripple will fare if it goes public now, as there is evidence to suggest that the company doesn’t plan on doing so anytime soon.  The founder of Dizer Capital, Yassin Mobarak, recently revealed that Ripple’s CEO Brad Garlinghouse mentioned that a Ripple IPO wasn’t feasible until the company’s legal battle with the SEC is over. XRP price drops to $0.65 &#124; Source: XRPUSD on Tradingview.com Featured image from CoinCodex, chart from Tradingview.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-10T09:10:38.000Z",
    "title": "Pepe Climbs 21% – What’s Igniting The Meme Coin Fire?",
    "url": "https://www.newsbtc.com/altcoin/pepe-climbs-21-whats-igniting-the-meme-coin-fire/",
    "description": "PEPE, the meme coin that had seemingly fallen into silence with no major positive developments, has staged a significant comeback in the crypto market. Today, the coin experienced a noteworthy surge, witnessing a price increase of $0.000001417 in 24-hour trading, marking an impressive 21% rally.  Source: Coingecko Highlighting PEPE&#8217;s Potential The sudden surge in PEPE&#8217;s value has sparked interest and speculation within the crypto community. One possible catalyst for this upward movement is the revelation of PEPE&#8217;s undervaluation index.  Related Reading: Bitcoin Indicator Backed By Founders Of Top Crypto Data Analytics Firm Predicts Bullish Trends Top-11 #PJTs with Market Cap from $300M to $500M by #Undervaluation Index (UI*) #UI is a Market Cap to 24H Trading Volume ratio applied to PJTs with a similar Market Cap. The lower the UI, the more the PJT is undervalued.$SUI $TIA $TRB $PEPE $COMP $QTUM $DASH $AGIX $ASTR… pic.twitter.com/ZvLlEiCRTV — Cryptolaxy #StandWithUkraine (@Cryptolaxy) November 7, 2023 Cryptolaxy, a prominent crypto analysis platform, took to social media on platform X to share that PEPE&#8217;s undervaluation index stands at 4.2. The undervaluation index serves as a metric to assess whether an asset is trading at a price that accurately reflects its true value. In the case of PEPE, with an undervaluation index of 4.2, the coin appears to be trading below its potential value, hinting at the possibility of a forthcoming price uptick. Significance Of Whale Movement Adding to the intrigue surrounding PEPE&#8217;s resurgence, Lookonchain, a blockchain analytics platform, drew attention to a notable development in the market. According to their post, a whale — a large investor with significant holdings — has initiated the accumulation of PEPE.  What did the whale buy recently? The whale with 10,080 $ETH($19.4M) spent 1,433 $ETH($2.6M) to buy 2.51M $ARB at $1.045 and 1,038 $ETH ($1.9M) to buy 1.65T $PEPE at $0.000001154. The whale is currently making $177K(+7%) on $ARB and $159K(+8%) on $PEPE.https://t.co/9Btmdst56T pic.twitter.com/EwsXjIFGdz — Lookonchain (@lookonchain) November 9, 2023 The movement of whales in the crypto market often carries significance, influencing trends and prices. The accumulation of PEPE by a whale suggests confidence in the coin&#8217;s potential and could further contribute to its upward trajectory. PEPE&#8217;s Rollercoaster Ride And Future Prospects As PEPE experiences this rollercoaster ride in its price dynamics, crypto enthusiasts and investors are closely monitoring the developments. The recent surge, driven by undervaluation and whale accumulation, raises questions about the sustainability of PEPE&#8217;s upward momentum.  Total crypto market cap currently at $1.3 trillion. Chart: TradingView.com Analysts are likely to delve into the underlying factors influencing the coin&#8217;s value, exploring whether this resurgence is a short-term spike or indicative of a more substantial trend. The crypto community awaits further developments and market signals to gauge PEPE&#8217;s future prospects in this ever-evolving landscape. Related Reading: Dogecoin Price Chart Described As ‘Beautiful’ By Crypto Analyst (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Counselling/Pixabay"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-10T09:11:42.000Z",
    "title": "Cardano Whales Accumulate 1.89B ADA as Price Set to Soar with Massive Midnight Update",
    "url": "https://www.crypto-news-flash.com/cardano-whales-accumulate-1-89b-ada-as-price-set-to-soar-with-massive-midnight-update/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-whales-accumulate-1-89b-ada-as-price-set-to-soar-with-massive-midnight-update",
    "description": "<img width=\"1000\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano ADA\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2-300x203.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2-768x518.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Cardano whales have significantly increased their ADA holdings, purchasing 1.89 billion tokens as anticipation builds for the network&#8217;s new Midnight update. The price of ADA has risen recently, reflecting confidence from these large-scale accumulations by major investors. Cardano&#8217;s recent surge in investor interest has culminated in a significant gathering of its native token, ADA. Cardano [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-10T09:25:00.000Z",
    "title": "China’s Largest Bank’s US Branch Suffers Ransomware LockBit Attack",
    "url": "https://coinedition.com/chinas-largest-banks-us-branch-suffers-ransomware-lockbit-attack/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Bank-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Dwpbank&#039;s wpNex Brings BTC Trading To 1200 German Affiliate Banks\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Bank-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Bank-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Bank-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Bank-3-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Bank-3-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Bank-3-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The U.S. subsidiary of China’s largest bank, Industrial and Commercial Bank of China Financial Services (ICBCFS), fell victim to a ransomware called LockBit, disrupting activities and causing chaos in the U.S. Treasury Market, the Financial Times reported. LockBit often locks users out of their computers and demands payment in cryptocurrencies, such as Bitcoin, Monero, and [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/chinas-largest-banks-us-branch-suffers-ransomware-lockbit-attack/\">China’s Largest Bank’s US Branch Suffers Ransomware LockBit Attack</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]