[
  {
    "source": "Decrypt",
    "date": "2023-11-17T21:57:06.000Z",
    "title": "Worldcoin Plummets as OpenAI Pushes Out Founder Sam Altman",
    "url": "https://decrypt.co/206546/worldcoin-plummets-openai-pushes-out-sam-altman",
    "description": "It appears Worldcoin investors aren't taking the OpenAI news well."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-17T21:40:14.000Z",
    "title": "Sam Altman removed as OpenAI CEO",
    "url": "https://cryptoslate.com/sam-altman-removed-as-openai-ceo/",
    "description": "<p>OpenAI, a leading entity in the artificial intelligence domain, has announced a significant shift in its leadership. Mira Murati, the Chief Technology Officer of the organization, has been appointed as the interim CEO following the departure of Sam Altman, who has also stepped down from the board of directors. According to the official statement, the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sam-altman-removed-as-openai-ceo/\">Sam Altman removed as OpenAI CEO</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-17T22:00:21.000Z",
    "title": "CoinShares Predicts $141,000 Bitcoin Price, Forecasts $14.4 Billion Inflows From ETFs",
    "url": "https://www.newsbtc.com/bitcoin-news/coinshares-predicts-141000-bitcoin-price-forecasts-14-4-billion-inflows-from-etfs/",
    "description": "In a recently published report by CoinShares, analyst James Butterfill delves into the relationship between inflows into Bitcoin exchange-traded funds (ETFs) and changes in the Bitcoin price.  The report addresses the critical question of how much inflow into ETFs could be anticipated upon launching a Bitcoin spot ETF in the US and the potential impact of these flows on the Bitcoin Price. Bitcoin ETFs Could Attract $14.4 Billion Inflows Butterfill highlights Galaxy&#8217;s analysis, which estimates that the United States has approximately $14.4 trillion in addressable assets. Assuming a conservative scenario where 10% of these assets invest in a spot Bitcoin ETF with an average allocation of 1%, it could result in approximately $14.4 billion of inflows within the first year.  Per the report, this would mark the largest inflows on record, surpassing 2021&#8217;s inflows of $7.24 billion, which accounted for 11.5% of assets under management (AuM).  However, it is worth noting that in 2020, inflows reached $5.5 billion, representing a higher 21.6% of AuM, while Bitcoin&#8217;s price surged by 303% compared to 60% in 2021. Related Reading: Dogecoin Jumps 10%, But This Signal Could Bring Rally To A Stop The report suggests a correlation between inflows as a percentage of AuM and price changes. Inflows coincide with rising prices, indicating that many ETF investors engage in momentum trading. Conversely, during periods of price stagnation, inflows have tended to moderate.  However, it is important to note that exchange-traded product (ETP) investors do not necessarily lead price action, as evidenced by volume data indicating that ETP volumes represent an average of 3.5% of daily Bitcoin trading turnover on trusted exchanges since 2018. Bitcoin Price Surge Predicted By analyzing weekly ETP flows and their percentage of AuM, the report identifies a trend with a coefficient of determination (R2 ) value of 0.31, suggesting a discernible relationship between flows and price changes.  Utilizing this trendline, the report estimates that the aforementioned $14.4 billion of inflows could potentially drive the price of Bitcoin up to $141,000 per coin. Nevertheless, accurately predicting the precise level of inflows upon the launch of spot ETFs remains challenging. The report acknowledges the difficulty in determining the exact magnitude of inflows.  It emphasizes that regulatory approval and corporate acceptance are gradual processes due to Bitcoin&#8217;s perceived complexity, which may require corporations and funds to build knowledge and confidence before committing to investment. Related Reading: Cardano Breakout Of Epic Proportions: Analyst Predicts 1600% Rally To $6.5 The potential wall of demand that could materialize following the introduction of a spot-based ETF is uncertain. While such ETFs offer portfolio diversification and enhanced Sharpe ratios, regulatory approval and corporate adoption may take time due to perceived complexities associated with Bitcoin.  Ultimately, CoinShares believes that Corporations and funds may require an extended period to familiarize themselves with the asset class and gain confidence before entering the market. All in all, the CoinShares report sheds light on the potential impact of Bitcoin ETFs on the price of BTC. While it is challenging to precisely determine the level of inflows and their subsequent effect on the market, the report suggests that launching a Bitcoin spot ETF in the US could potentially drive the price of Bitcoin to US$141,000 per coin.  Currently, Bitcoin (BTC) is consolidating above the significant psychological level of $36,000. Over the past 24 hours, it has experienced a minimal decrease of 0.2%, while showing a 1.3% increase within the 1-hour time frame. Featured image from Shutterstock, chart from TradingView.com "
  }
]