[
  {
    "source": "CoinDesk",
    "date": "2023-11-24T23:42:43.000Z",
    "title": "Binance Founder Changpeng 'CZ' Zhao Isn't a Flight Risk, His Attorneys Say",
    "url": "https://www.coindesk.com/policy/2023/11/24/binance-founder-changpeng-cz-zhao-isnt-a-flight-risk-his-attorneys-say/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Binance founder and former CEO Changpeng Zhao should be allowed to return to the UAE, where he is a citizen and lives, ahead of his February sentencing, his lawyers said, pushing back against a U.S. Department of Justice filing asking he not be allowed to leave the country."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-24T23:57:42.000Z",
    "title": "Ethereum Layer-2 Blast Has $400 Million Locked in Just 4 Days, Despite Concerns",
    "url": "https://decrypt.co/207489/ethereum-layer-2-blast-has-400-million-locked-in-just-4-days-despite-concerns",
    "description": "Ethereum Layer-2 network Blast isn’t live yet. That’s not stopping people from depositing vast sums of crypto."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-24T23:40:22.000Z",
    "title": "MicroStrategy Stock Hits Nearly Two-Year High",
    "url": "https://decrypt.co/207492/microstrategy-stock-hits-nearly-two-year-high",
    "description": "The business intelligence firm is earning significant investor interest as its Bitcoin holdings turn a profit."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-25T00:00:23.000Z",
    "title": "European Central Bank president says her son lost 60% of his investments trading crypto",
    "url": "https://cryptoslate.com/european-central-bank-president-says-her-son-lost-60-of-his-investments-trading-crypto/",
    "description": "<p>European Central Bank President Christine Lagarde revealed that her son lost money investing in cryptocurrency, according to Reuters on Nov. 24. Lagarde said that her son lost &#8220;almost all&#8221; of his investments by trading cryptocurrency against her warnings. During an event, she said: &#8220;He ignored me royally, which is his privilege &#8230; And he lost [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/european-central-bank-president-says-her-son-lost-60-of-his-investments-trading-crypto/\">European Central Bank president says her son lost 60% of his investments trading crypto</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-25T00:00:24.000Z",
    "title": "Crypto Fund Exits BLUR For Lido And IMX—Endorsing DeFi?",
    "url": "https://www.newsbtc.com/news/crypto-fund-exits-blur-for-lido-and-imx-endorsing-defi/",
    "description": "According to Lookonchain data, Sigil, a fund in Gibraltar, has exited BLUR, one of this week&#8217;s top-performing tokens, for Lido DAO&#8217;s LDO, and IMX, the native token Immutable X&#8211;a layer-2 scaling solution primarily dedicated to NFT trading. Sigil Fund Sells BLUR For IMX And LDO  On November 24, Lookonchain, a crypto analytics platform, noted that Sigil sold 1.55 million BLUR for 807,799 IMX, worth roughly $1.14 million, and 210,905 LDO, trading at $540,000, at spot rates. The exchange was made via multiple transactions and done on-chain. The swap comes roughly three days after Sigil withdrew 3.1 BLUR from OKX, a cryptocurrency exchange. Surprisingly, the fund is exiting BLUR when the token has dominated performance in the last few trading days.  Related Reading: Ripple CEO Offers Perspective On Legal Fallout With The SEC To quantify, the token has more than doubled this week alone, surging to register new H2 2023 highs above $0.60. BLUR is already up 330% from its 2023 lows and continues to edge higher on rising trading volume. The Gibraltar-based crypto investment fund&#8217;s rotation from BLUR into core governance tokens of Lido DAO and Immutable X comes when there is FOMO around the 300 million BLUR airdrop in Season 2. Still, it is not immediately clear what might have advised the fund to exit BLUR&#8211;and not simply ride the current ride&#8211;for LDO and IMX.  In retrospect, the shift could be an endorsement of decentralized finance&#8217;s (DeFi) resilience and inherent growth prospects. The rotation of funds into DeFi tokens could also signify a focus on backing decentralized ecosystem building rather than speculative NFT mania, as is currently the case with BLUR, which is rapidly rising, spurred by the Season 2 airdrop. LDO and IMX Are Key For DeFi And NFT As of November 2023, Lido DAO and Immutable X are some of the core platforms driving crypto and DeFi. Lido DAO plays a crucial role in Ethereum staking, while Immutable X offers a secure NFT trading infrastructure. Though recent troubles at FTX and other CeFi actors like FTX&#8217;s partner, Alameda Research, continue to cap upsides, Sigil&#8217;s allocation change is an endorsement for DeFi. Related Reading: LooksRare’s LOOKS Ready To Melt Faces: Analyst Predicts 10000% Surge Above $5.2 In the future, it is not immediately clear whether LDO and IMX prices will edge higher. For now, it remains on an uptrend but is generally volatile and not galloping higher like BLUR. The token is up 80% from October 2023 lows at press time. Meanwhile, IMX is extending gains at 2023 highs, looking at price action in the daily chart. Feature image from Canva, chart from TradingView"
  }
]