[
  {
    "source": "CoinDesk",
    "date": "2023-10-04T17:41:45.000Z",
    "title": "The Protocol: Which Ethereum Layer-2 Project ISN’T Competing to Land Celo?",
    "url": "https://www.coindesk.com/tech/2023/10/04/the-protocol-which-ethereum-layer-2-project-isnt-competing-to-land-celo/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "In this week’s issue of The Protocol, we highlight layoffs hitting key firms as well, and how blockchain projects are competing for new mandates – specifically big Ethereum layer-2 developers like OP Labs, Polygon and Matter Labs vying to provide the technology for the Celo blockchain’s new network"
  },
  {
    "source": "Decrypt",
    "date": "2023-10-04T18:01:02.000Z",
    "title": "Introducing Emerge: Decrypt's New Hub Exploring Beyond the Cutting Edge",
    "url": "https://decrypt.co/199925/emerge-emerging-technology-news-hub",
    "description": "Step through our portal to the far side of the future, where AI is only the beginning."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T17:43:30.000Z",
    "title": "Price analysis 10/4: BTC, ETH, BNB, XRP, SOL, ADA, DOGE, TON, DOT, MATIC",
    "url": "https://cointelegraph.com/news/price-analysis-10-4-btc-eth-bnb-xrp-sol-ada-doge-ton-dot-matic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/7dd9720e-f6c7-4699-b28e-18a2d925f210.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin is consolidating at the top of its range and this is inspiring traders' confidence in a variety of altcoins.</p>\n                    <p><p>United States 10-year Treasury yields <a href=\"https://www.cnbc.com/2023/10/03/stock-market-today-live-updates.html\" target=\"_blank\" rel=\"noopener nofollow\">soared</a> above 4.8% on Oct. 3, their highest level since 2007. DoubleLine Capital CEO Jeffrey Gundlach said in a <a href=\"https://twitter.com/TruthGundlach/status/1709358346879349122\" target=\"_blank\" rel=\"noopener nofollow\">post</a> on X (formerly Twitter) that the spread between the 2-year and 10-year Treasury yields has narrowed from 109 basis points a few months ago to 35 basis points. He cautioned that this “should put everyone on recession warning.”</p><p>Arthur Hayes, former CEO of crypto exchange BitMEX, warned in a recent X thread that the <a href=\"https://cointelegraph.com/news/bitcoin-bull-market-us-faces-bear-steepener-arthur-hayes\">government will have to print money</a> to save the bond market as a faster bear steepener — a condition where long-term interest rates rise more quickly than short-term rates — will cause firms to collapse. Some investors believe that this could trigger a cryptocurrency bull market.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/54f7769f-c676-4f1c-a811-e25f3f26f2ba.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>It also looks like the institutional investors have started to warm up to cryptocurrencies. CoinShares’ latest Digital Asset Fund Flows Weekly Report <a href=\"https://cointelegraph.com/news/bitcoin-solana-ethereum-xrp-drives-digital-asset-inflows-6-weeks\">shows inflows of $21 million</a> into digital asset investment products for the first time in six weeks. </p><p>In this uncertain macro environment, let’s take a look at the charts to determine the next potential move.</p><h2>Bitcoin price analysis</h2><p>Bitcoin  (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) rose above $28,143 on Oct. 2 but the long wick on the candlestick shows the bears are aggressively selling at higher levels. The bears tried to build upon their advantage on Oct. 3 but the bulls held their ground at $27,160.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/3b42c54e-438b-4478-a34e-862ab34ab40d.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The upsloping 20-day exponential moving average ($26,903) and the relative strength index (RSI) in the positive territory indicate that bulls have the upper hand. Buyers will once again try to clear the overhead resistance at $28,143.</p><p>A close above this level will complete a short-term double bottom pattern, which has a target objective of $31,486.</p><p>This positive view will be invalidated if the price once again turns down from the overhead resistance and plummets below the 20-day EMA. That could yank the price to $26,000. The BTC/USDT pair could then continue to consolidate between $24,800 and $28,143 for a while longer.</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) turned down sharply from the overhead resistance of $1,746 on Oct. 2, indicating that the bears are fiercely guarding this level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/7fa14d20-b95c-4f3e-b4b2-3c9904ae1b1f.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AETHUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The 20-day EMA ($1,640) is flattening out and the RSI is near the midpoint, indicating a balance between supply and demand. If the price turns up from the current level, the bulls will again try to overcome the obstacle at $1,746. If they can pull it off, the ETH/USDT pair will complete a double bottom pattern, having a target objective of $1,961.</p><p>On the other hand, if the price continues lower and tumbles below the moving averages, it will suggest that the pair may extend its stay inside the $1,531 to $1,746 range for some more time. </p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) jumped above the $220 resistance on Oct. 2 but the bulls could not sustain the breakout as seen from the long wick on the day’s candlestick.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/756a4722-a20e-4cc1-bf8b-627fd80e6428.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABNBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The failure of the bulls to maintain the price above the 20-day EMA ($214) is a negative sign. It shows that traders are rushing to the exit. The BNB/USDT pair could next fall to the uptrend line. </p><p>If the price rebounds off this level, the bulls will again try to push the pair above $220. A close above this resistance could signal the start of an up-move to $235 and thereafter to $250. Instead, if the price breaks below the uptrend line, the pair may decline to the formidable support at $203.</p><h2>XRP price analysis</h2><p>Buyers pushed XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) above the symmetrical triangle pattern on Sep. 29 and then foiled several attempts by the bears to pull the price back into the triangle. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/4c7b499f-c16c-447c-8b30-20d084daf29a.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AXRPUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls will next try to surmount the overhead resistance at $0.56. If they are successful, it will signal the start of a new uptrend. The XRP/USDT pair could then start its journey toward the pattern at $0.66.</p><p>Conversely, if the price turns down from $0.56 and dives below the uptrend line, it will suggest that the bulls are booking profits. That could keep the pair range-bound between $0.56 and $0.41 for a few more days. </p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) has been oscillating inside a large range between $14 and $27.12. The price action of the past few days has resulted in the formation of a potential inverse head and shoulders pattern.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/3ad5e3e8-8fbb-4424-bf58-7feed62a5c1c.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASOLUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Although setups formed inside a range tend to be less reliable, still they should not be neglected. If the price turns up and breaks above the neckline, the SOL/USDT pair could attempt a rally to $27.12 and eventually to the pattern target of $32.81.</p><p>The critical support to watch on the downside is the 20-day EMA ($20.95). If the price slides below this level, it will suggest that the bulls have given up. That could open the gates for a possible drop to $17.33.</p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) turned down from $0.27 on Oct. 2 and reached the 20-day EMA ($0.25) on Oct. 4. This is an important level to keep an eye on in the near term.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/ce86243a-db73-4cf1-9239-effe041ff275.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AADAUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If the price rebounds off the 20-day EMA, it will indicate a change in sentiment from selling on rallies to buying on dips. The bulls will then try to shove the price above $0.27 and start an up-move to $0.29 and later to $0.32.</p><p>If bears want to prevent the rally, they will have to drag the price below the 20-day EMA. The ADA/USDT pair may then once again descend to the vital support at $0.24. The bulls are likely to protect this level with vigor.</p><h2>Dogecoin price analysis</h2><p>The bulls pushed Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) above the 50-day SMA ($0.06) on Oct. 2 but could not sustain the higher levels. This suggests that bears are selling on every minor relief rally.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/6b63767d-1e9f-4140-a7fb-3444d15deb4b.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOGEUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The DOGE/USDT pair has reached the formidable support at $0.06. The repeated retest of a support level within a short interval tends to weaken it. If the $0.06 level cracks, the pair may slump to the next major support at $0.055. </p><p>A minor advantage in favor of the buyers is that the RSI has formed a bullish divergence. This suggests the bears may be losing their grip. The indicators are not providing clarity about the next move. Hence, it is best to wait for the price to close above the 50-day SMA or plunge below $0.06 to place directional bets.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-traders-27k-btc-price-volatile-us-dollar\"><strong><em>Bitcoin traders hope $27K holds as BTC price ignores volatile US dollar</em></strong></a></p><h2>Toncoin price analysis</h2><p>Toncoin (TON) fell below the 20-day EMA ($2.09) on Sep. 30 and the bears thwarted attempts by the bulls to reclaim the level on Oct. 1. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/9bac93aa-7cec-4174-aa8f-d5cc1a0c05d0.png\"  /><figcaption style=\"text-align: center;\"><em>TON/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ALTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears are trying to solidify their position by sinking the price to the 50-day SMA ($1.86). This level may result in a rebound that is likely to face selling at the 20-day EMA.</p><p>If the price turns down from this resistance, it will suggest that the sentiment has turned bearish and traders are selling on rallies. That will increase the likelihood of a drop below the 50-day SMA.</p><p>On the contrary, if the price turns up and surges above the 20-day EMA, it will suggest that the markets have rejected the lower levels. The TON/USDT pair could then rise to $2.32 where the bears will again try to halt the up-move.</p><h2>Polkadot price analysis</h2><p>Polkadot (<a href=\"https://cointelegraph.com/polkadot-price-index\">DOT</a>) turned down sharply from the 50-day SMA ($4.24) on Oct. 2 and broke below the 20-day EMA ($4.10) on Oct. 3.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/44d28f3e-28d0-4926-8273-de9b4d47457d.png\"  /><figcaption style=\"text-align: center;\"><em>DOT/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOTUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears challenged the important support at $3.91 on Oct. 4 but the long tail on the candlestick shows strong buying at lower levels. The RSI has formed a bullish divergence, indicating that the sellers may be losing their grip.</p><p>If the bulls push the price above the 20-day EMA, it will suggest that the DOT/USDT pair may extend its stay inside the $4.33 to $3.91 range for some more time. The bears will have to sink the price below $3.91 to start the next leg of the downtrend to $3.50.</p><h2>Polygon price analysis</h2><p>After witnessing a tough battle between the bulls and the bears near the moving averages, Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) bounced on Oct. 4, indicating that buyers are trying to take charge.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/e188fa88-6174-45f7-bd1b-30e7c3df577c.png\"  /><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AMATICUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls are trying to build upon the strength and propel the price above the overhead resistance at $0.60. If they manage to do that, it will signal the start of a sustained recovery. The MATIC/USDT pair could then rise to $0.70.</p><p>Contrary to this assumption, if the price turns down and breaks below the 20-day EMA, it will indicate that the bears are active at higher levels. The pair may then retest the crucial support at $0.49. This level is likely to attract solid buying by the bulls.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T17:42:16.000Z",
    "title": "Opening arguments begin in Sam Bankman-Fried trial",
    "url": "https://cointelegraph.com/news/opening-arguments-sam-bankman-fried-trial",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/68182887-e1c4-4171-9681-d12405cea614.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>\"His girlfriend will tell you how they stole money together,\" said Assistant U.S. Attorney Thane Rehn in an opening statement about the former FTX CEO.</p>\n                    <p><p>Prosecutors and defense attorneys in the criminal case of former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a>, also known as SBF, painted a very different picture for the jury to consider during the trial.</p><p>In a New York courtroom on Oct. 4, Assistant United States Attorney Thane Rehn and SBF attorney Mark Cohen delivered opening arguments to a jury of 12 people on the events leading up to the collapse of crypto exchange FTX as well as Bankman-Fried’s alleged role. The remarks followed Judge Lewis Kaplan finalizing a selection of 12 members of the jury and 6 alternates after more than a day of questioning.</p><p>According to an X (formerly Twitter) thread from Inner City Press at the event, Rehn <a href=\"https://twitter.com/innercitypress/status/1709614458983628982\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> in court that SBF used FTX customer funds to enrich himself as well as convince lawmakers — through campaign donations and testimony — that he was trustworthy. The Assistant U.S. Attorney reportedly argued that Bankman-Fried repeatedly lied to users, employees, and the general public regarding “the hole” FTX found itself in during November 2022 when financial information on the exchange was released.</p><p>“The hole was too big,” said Rehn. “So defendant blamed a downturn in the crypto market. But he had committed fraud. That is what the evidence in this trial will show. You will hear from his inner circle. His girlfriend will tell you how they stole money together.”</p><p>Cohen, who delivered his opening statement after Rehn, reportedly blamed some of the issues leading to FTX’s downfall on SBF’s former girlfriend and former Alameda Research CEO Caroline Ellison as well as Binance CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/changpeng-zhao\">Changpeng Zhao</a>, or CZ. He claimed Ellison had failed to act to hedge some of Alameda’s investments despite Bankman-Fried’s urging to do so, and CZ’s social media posts had directly led to a run on FTX.</p><p>SBF’s defense team presented the former FTX CEO as someone who “acted in good faith” amid a company growing exponentially in a volatile crypto market. He also pushed back against the narrative SBF was a \"bad guy\" by spending funds, with a penthouse in The Bahamas and paying celebrities to endorse FTX: “It's not a crime to try to get Tom Brady”.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/highlights-ftx-founder-sam-bankman-fried-first-day-trial\"><strong><em>5 highlights of Sam Bankman-Fried’s first day of trial</em></strong></a></p><p>Oct. 4 marked the second day of Bankman-Fried’s first criminal trial, which is expected to last roughly six weeks. He has pleaded not guilty to 7 charges related to alleged fraud at FTX, and will appear in court again in March 2024 for a second trial.</p><p>Among the highlights of SBF’s first week in court included the former FTX CEO appearing with a new haircut for the first time. Ellison along with other former executives connected to the crypto exchange may <a href=\"https://cointelegraph.com/news/ftx-execs-witnesses-sam-bankman-fried-criminal-trial\">testify against SBF</a> as the trial continues. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-04T18:00:54.000Z",
    "title": "Polygon co-founder Jaynti Kanani steps down after six years with project",
    "url": "https://cryptoslate.com/polygon-co-founder-jaynti-kanani-steps-down-after-six-years-with-project/",
    "description": "<p>Jayanti Kanani, one of the pioneering figures behind Polygon (MATIC), announced his exit from the day-to-day operations of the company. Announcing his departure on X (formerly Twitter): &#8220;After kickstarting Polygon in 2017, around 6 months back, I decided to step back from the day-to-day grind&#8230; I&#8217;m more confident in Polygon&#8217;s bright future and passionate community. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/polygon-co-founder-jaynti-kanani-steps-down-after-six-years-with-project/\">Polygon co-founder Jaynti Kanani steps down after six years with project</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T17:56:47.000Z",
    "title": "IBM CEO Discusses Impact of AI on Jobs and Global Competition",
    "url": "https://www.cryptopolitan.com/ibm-ceo-discusses-impact-of-ai-on-jobs/",
    "description": "IBM CEO Arvind Krishna addressed the ongoing debate surrounding the impact of automation and artificial intelligence (AI) on jobs during his appearance at Fortune&#8217;s CEO Initiative conference in Washington, D.C. Krishna emphasized that the misconception linking productivity gains to job losses should be dispelled. He argued that technology will create more jobs than it eliminates ... <a title=\"IBM CEO Discusses Impact of AI on Jobs and Global Competition\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ibm-ceo-discusses-impact-of-ai-on-jobs/\" aria-label=\"More on IBM CEO Discusses Impact of AI on Jobs and Global Competition\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T17:56:25.000Z",
    "title": "How ICP Asia Alliance plans to redefine the Web3 and AI landscape",
    "url": "https://www.cryptopolitan.com/icp-asia-alliance-redefine-web3-ai-landscape/",
    "description": "The blockchain industry never sleeps. Amidst the whirlwind of crypto innovations, the launch of the ICP Asia Alliance seeks to carve a niche for itself in the buzzing Web3 and AI industry. But the real question stands &#8211; Is this a game-changer, or just another event destined to get buried in the annals of tech ... <a title=\"How ICP Asia Alliance plans to redefine the Web3 and AI landscape\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-asia-alliance-redefine-web3-ai-landscape/\" aria-label=\"More on How ICP Asia Alliance plans to redefine the Web3 and AI landscape\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T17:50:27.000Z",
    "title": "AI in Cybersecurity: A Mixed Bag for Vulnerability Detection",
    "url": "https://www.cryptopolitan.com/ai-in-cybersecurity/",
    "description": "In a recent report released by NCC Group, the intersection of artificial intelligence (AI) and cybersecurity has been scrutinized, shedding light on both the promises and limitations of generative AI in the context of code vulnerability detection. The report, titled &#8220;Safety, Security, Privacy &#38; Prompts: Cyber Resilience in the Age of Artificial Intelligence,&#8221; offers a ... <a title=\"AI in Cybersecurity: A Mixed Bag for Vulnerability Detection\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-in-cybersecurity/\" aria-label=\"More on AI in Cybersecurity: A Mixed Bag for Vulnerability Detection\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T17:43:30.000Z",
    "title": "Crypto Exchange FTX Capitalizes on High-Growth AI Startup",
    "url": "https://www.cryptopolitan.com/ftx-capitalizes-on-high-growth-ai-startup/",
    "description": "In a surprising turn of events, cryptocurrency exchange FTX finds itself on the verge of a potential windfall as its strategic investment in Anthropic, a rising AI startup, gains substantial momentum. Anthropic, currently embroiled in discussions to secure over $2 billion in fresh funding, has recently received a substantial investment commitment of $1.25 billion from ... <a title=\"Crypto Exchange FTX Capitalizes on High-Growth AI Startup\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ftx-capitalizes-on-high-growth-ai-startup/\" aria-label=\"More on Crypto Exchange FTX Capitalizes on High-Growth AI Startup\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-04T18:05:50.000Z",
    "title": "Bloomberg analyst reports Ether futures ETF activity is slow",
    "url": "https://crypto.news/bloomberg-analyst-reports-ether-futures-etf-activity-is-slow/",
    "description": "Following a busy week of Ether futures ETF activity, a senior ETF analyst for Bloomberg shares that Ether futures ETF activity flows are off to a slow start."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-04T18:00:17.000Z",
    "title": "Is XRP Growth Real Or Just Smoke And Mirrors? Here’s What Liquidation Data Shows",
    "url": "https://www.newsbtc.com/news/is-xrp-growth-real-or-just-smoke-and-mirrors-heres-what-liquidation-data-shows/",
    "description": "XRP, the digital currency associated with Ripple Labs, has been making headlines with its recent price rally. However, a report suggests that the hype surrounding its performance might be overstated, as market data paints a different picture.  Despite a positive legal ruling and a robust community, XRP seems to struggle to gain the same level of confidence as Bitcoin (BTC) and Ethereum (ETH) among investors. Liquidation data from CoinGlass reveals that in the past 24 hours, approximately $4.20 million worth of XRP has been liquidated. Interestingly, the short positions accounted for a mere $66.13K in losses, while long traders recorded a substantial $2.09 million loss.  Source: Coinglass Related Reading: Shiba Inu Investors Beware: 425 Billion Tokens On The Move – Is It A Sell-Out? Liquidation Data Raises Questions On XRP’s Price Rally This data underscores the fact that the recent ruling by Judge Analisa Torres, which classified XRP as not a security when traded on exchanges, failed to ignite significant bullish sentiment for the cryptocurrency. Comparing this liquidation data with that of Bitcoin and Ethereum reveals a stark contrast, further suggesting that XRP is still considered a less promising digital asset. This contrast raises doubts about the bullish predictions made by some experts following the recent legal ruling. It appears that despite its strong community support, XRP&#8217;s growth indicators are not aligning with the optimism that has surrounded it. XRP market cap currently at $28.4 billion. Chart: TradingView.com Currently priced at $0.529 according to CoinGecko, XRP has seen a 5.0% growth in the past 24 hours and a seven-day rally of 7.4%. Despite these gains, market observers remain cautious about the coin&#8217;s long-term potential. XRP Trajectory: Contrasting Perspectives In a separate report, there is a contrasting perspective that suggests XRP could still experience significant growth in value. This report highlights the fact that during the prolonged legal battle with the US Securities and Exchange Commission that began in December 2020, XRP has shifted its focus to overseas markets. This strategic move has led to impressive client wins in emerging markets, where Ripple&#8217;s payment platform has the potential to make a substantial impact. XRP seven-day price action. Source: Coingecko Related Reading: Is Dogecoin On Life Support? Analyzing Its Recent Price Downturn These client wins have paved the way for promising developments, particularly in projects related to cross-border payment systems and Central Bank Digital Currencies (CBDCs). These initiatives hold the potential to drive the long-term value of XRP, as they expand its use cases beyond speculative trading. XRP&#8217;s recent price surge may have garnered attention, but skepticism remains prevalent in the market. While some believe in its potential for further growth, the current data and market sentiment suggest that XRP still has hurdles to overcome to solidify its position as a top-tier digital currency. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T17:57:35.000Z",
    "title": "Ripple’s James Wallis Foresees Bright Future for Retail CBDCs – Can XRP Price Profit and Rise to $5?",
    "url": "https://www.crypto-news-flash.com/ripples-james-wallis-foresees-bright-future-for-retail-cbdcs-can-xrp-price-profit-and-rise-to-5/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-james-wallis-foresees-bright-future-for-retail-cbdcs-can-xrp-price-profit-and-rise-to-5",
    "description": "<img width=\"1038\" height=\"584\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-48x27.png 48w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />Wallis highlighted in a recent interview that CBDCs have a higher level of security than traditional money systems and are capable of eliminating high friction, especially in last-mile transactions. The XRPL is expected to play a crucial role in retail CBDC mainstream adoption in the Web3 ecosystem amid regulatory clarity for Ripple in the United [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T17:53:34.000Z",
    "title": "Metacade and Polygon Labs Redefine Gaming: A Powerful Partnership Emerges",
    "url": "https://www.crypto-news-flash.com/metacade-and-polygon-labs-redefine-gaming-a-powerful-partnership-emerges/?utm_source=rss&utm_medium=rss&utm_campaign=metacade-and-polygon-labs-redefine-gaming-a-powerful-partnership-emerges",
    "description": "<img width=\"1000\" height=\"469\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/SmartPhotoLab-Zusammenarbeit-Kooperation.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/SmartPhotoLab-Zusammenarbeit-Kooperation.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/SmartPhotoLab-Zusammenarbeit-Kooperation-300x141.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/SmartPhotoLab-Zusammenarbeit-Kooperation-768x360.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The collaboration between Metacade and Polygon will significantly help the former obtain more users seeking to tap into the web3 gaming industry through a secure and scalable channel. Following the partnership announcement, Metacade&#8217;s (MCADE) price gained over 8.8 percent in the past 24 hours to trade around $0.0052 on Wednedsay. The Polygon (MATIC) network, a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T17:45:34.000Z",
    "title": "Uniswap Thrives Amid Crypto Market Turbulence, Gains Over 300 Million Swaps in Milestone Achievement",
    "url": "https://www.crypto-news-flash.com/uniswap-thrives-amid-crypto-market-turbulence-gains-over-300-million-swaps-in-milestone-achievement/?utm_source=rss&utm_medium=rss&utm_campaign=uniswap-thrives-amid-crypto-market-turbulence-gains-over-300-million-swaps-in-milestone-achievement",
    "description": "<img width=\"1201\" height=\"601\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Uniswap\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card.png 1201w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card-300x150.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card-1024x512.png 1024w\" sizes=\"(max-width: 1201px) 100vw, 1201px\" />Uniswap records booming activities as daily active users increase, signifying a growing interest in the ecosystem. The entire crypto market is in &#8220;red&#8221; as Bitcoin, Ethereum, Dogecoin, Solana, etc. break key support levels. Amidst the backdrop of uncertainty and &#8220;negative to neutral&#8221; readings of various metrics of the general crypto market, Uniswap emerged as one [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T17:41:22.000Z",
    "title": "XRP Set to Soar to $2: A Breakout from the Four-Month Descending Channel",
    "url": "https://www.crypto-news-flash.com/xrp-set-to-soar-to-2-a-breakout-from-the-four-month-descending-channel/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-set-to-soar-to-2-a-breakout-from-the-four-month-descending-channel",
    "description": "<img width=\"1280\" height=\"819\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-768x491.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />XRP analyst EGRAG predicts a significant rally to $2, citing historical $2 price significance and a breakout from a descending channel. EGRAG&#8217;s analysis focuses on 4-month price movements, offering a more accurate view of XRP&#8217;s trajectory. A prominent crypto analyst, EGRAG, is stirring anticipation within the XRP community with a rather audacious prediction. EGRAG firmly [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-04T18:05:55.000Z",
    "title": "This Ethereum-Based Altcoin Will Explode 100% After ‘Final Correction’, Says Michaël van de Poppe",
    "url": "https://dailyhodl.com/2023/10/04/this-ethereum-based-altcoin-will-explode-100-after-final-correction-says-michael-van-de-poppe/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/altcoin-projects-explode.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/altcoin-projects-explode.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/altcoin-projects-explode.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/altcoin-projects-explode.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/altcoin-projects-explode.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/altcoin-projects-explode.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/altcoin-projects-explode.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An Ethereum-based (ETH) altcoin is likely facing a final leg to the downside before it doubles in price, according to a popular crypto analyst. Crypto strategist Michaël van de Poppe tells his 668,000 followers on the social media platform X that the decentralized oracle provider Chainlink (LINK) is due for a final correction and a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/04/this-ethereum-based-altcoin-will-explode-100-after-final-correction-says-michael-van-de-poppe/\">This Ethereum-Based Altcoin Will Explode 100% After &#8216;Final Correction&#8217;, Says Michaël van de Poppe</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]