[
  {
    "source": "Decrypt",
    "date": "2024-01-18T22:21:38.000Z",
    "title": "Former OpenSea Exec Argues NFT Insider Trading Conviction Violated Law",
    "url": "https://decrypt.co/213440/former-opensea-exec-argues-nft-insider-trading-conviction-violated-law",
    "description": "Nathaniel Chastain was convicted last year for profiting off of information he was privy to as an executive at NFT marketplace OpenSea."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-18T22:30:11.000Z",
    "title": "Polygon’s Transfer Troubles: Is MATIC Facing A Trust Crisis?",
    "url": "https://www.newsbtc.com/matic/polygons-transfer-troubles-is-matic-facing-a-trust-crisis/",
    "description": "Recently, the blockchain intelligence firm ChainArgos brought to light some unsettling findings about the Polygon network. According to ChainArgos, suspicious transaction patterns have emerged, raising questions about Polygon&#8217;s adherence to its initial token allocation plan. ChainArgos’ investigation revealed multiple transactions from Polygon&#8217;s network to various exchanges seemed &#8220;questionable.&#8221; Particularly, the firm pointed out &#8220;anomalies&#8221; in the flow of tokens from Polygon&#8217;s vesting contract, which is responsible for the systematic release of tokens. This contract, distinct from the foundation contract that governs overall allocations, displayed inconsistencies in outflow patterns. The firm&#8217;s latest analysis, detailed in a series of posts on X, scrutinizes the movement of significant quantities of MATIC tokens, Polygon’s native cryptocurrency. Related Reading: Bombshell Report: Polygon Team’s Secret MATIC Sales Lead To Depressed Price Concerns Over Large MATIC Transfers The investigative reports from ChainArgos delved deeper into the token flows. The firm noted that a specific wallet received approximately 470 million MATIC from two sources &#8211; the foundation and an insider wallet, particularly 340 million and 170 million, respectively. The largest transfer identified was linked to a wallet associated with the plasma bridge, including two additional transactions to untagged wallets. Adding to the intrigue, ChainArgos observed that a sum of 178 million MATIC was transferred to the prominent exchange Binance, with the last transaction dated May 23, 2021. These findings were substantiated by a chart from Etherscan, illustrating the token movements. 5/ All 178mm were sent from 0x30b7 to binance. Last transfer 23-May-2021. Check the price chart friends. pic.twitter.com/iT6CVCOxtz — ChainArgos (@ChainArgos) January 18, 2024 In the wake of these revelations, Polygon&#8217;s native token, MATIC, has experienced significant market turbulence. Over the past week, the cryptocurrency decreased by exceeding 10%, with a 4.2% drop in just the past 24 hours. MATIC is valued at $0.81 at the time of writing, marking a mere 2.5% increase over the past month. This bearish performance contrasts sharply with the broader altcoin market, which has generally shown substantial gains during the same period. The declining market position of MATIC is reflected in its slide to the 16th rank among cryptocurrencies by market capitalization. Furthermore, its trading volume has plummeted from over $1 billion last Thursday to a mere $493 million, indicating a significant reduction in trading activity. Analysts&#8217; Take On MATIC&#8217;s Future Despite these challenges, some analysts remain optimistic about MATIC&#8217;s prospects. Crypto analyst Ali, for instance, predicts a potential rebound for MATIC soon. Ali&#8217;s bullish stance is grounded in the TD Sequential indicator, a tool to pinpoint trend exhaustion and imminent price reversals. Related Reading: Crypto Analyst Forecasts MATIC Price Recovery With This 16% Swing Ali’s analysis suggests that the TD indicator currently signals a buy opportunity for MATIC. He contends that if buying pressure intensifies around its current price levels, MATIC could experience a notable upswing. #Polygon &#124; The TD Sequential presents a buy signal on $MATIC 4-hour chart. A spike in buying pressure around the current levels could see #MATIC rebound, potentially toward $0.88, and even as high as $0.96. pic.twitter.com/lj96zgPh7k — Ali (@ali_charts) January 6, 2024 His projections point to a potential climb towards the $0.88 to $0.96 range, translating to an approximate 16% increase from its current valuation. This optimistic forecast assumes that Polygon’s underlying technology and market position can outweigh the recent concerns raised by ChainArgos’ findings. Featured image from Unsplash, Chart from TradingView"
  }
]