[
  {
    "source": "Decrypt",
    "date": "2024-01-31T21:13:53.000Z",
    "title": "Argentina President Javier Milei Drops Crypto Tax Plan",
    "url": "https://decrypt.co/215122/argentina-president-javier-milei-drops-crypto-tax-plan",
    "description": "Argentine President Javier Milei has rewritten the country’s sweeping reform bill and jettisoned crypto amidst debate over more fundamental issues."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-31T21:16:39.000Z",
    "title": " US lawmakers push back on proposed CFPB rule, citing potential impact on crypto  ",
    "url": "https://cointelegraph.com/news/us-lawmakers-proposed-cfpb-rule-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMGMxYWE0NTEtNDE3OS00ODQwLWFmZTEtYTcyNjVlY2MyZWJjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Representatives Patrick McHenry, Mike Flood, and French Hill called for an additional 60 days for a CFPB proposal to consider the impact on digital assets.</p>\n                    <p><p>Leaders of the United States House Financial Services Committee and Subcommittee on Digital Assets, Financial Technology and Inclusion called for a longer comment period on a proposed rule from the Consumer Financial Protection Bureau (CFPB), claiming its impact on the digital asset space would be “unclear” if implemented.</p><p>In a Jan. 30 letter to CFPB director Rohit Chopra, Representatives Patrick McHenry, Mike Flood, and French Hill <a href=\"https://financialservices.house.gov/uploadedfiles/2024-01-30mchenry_hill_flood_cfpb_lpr_comment_letter_final.pdf\" target=\"_blank\" rel=\"noopener nofollow\">questioned</a> how a November 2023 proposal “would apply to specific entities within the digital asset ecosystem.” The CFPB rule <a href=\"https://cointelegraph.com/news/us-cfpb-proposes-supervising-digital-app-providers-including-crypto-wallets\">suggested extending its supervisory authority</a> over depository institutions, including digital assets in its definition of “funds,” and allowing it to target wallets.</p><p>The three lawmakers said a lack of clarity for affected crypto exchanges could dissuade firms from allowing peer-to-peer transactions through wallets hosted on the platforms. They requested the CFPB open the proposal to public comments for an additional 60 days, accepting and considering feedback on crypto.</p><p><a href=\"https://cointelegraph.com/news/us-lawmakers-proposed-cfpb-rule-crypto\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-31T21:27:06.000Z",
    "title": "Solana’s JUP surpass $450 million trading volume in less than six hours",
    "url": "https://cryptobriefing.com/solana-jup-token-450-million-trading-volume/?utm_source=feed&utm_medium=rss",
    "description": "Despite the significant volume, the token is trapped within a price range that remains even after its listing on major centralized exchanges."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-31T21:39:19.000Z",
    "title": "Vitalik Buterin reflects on his meeting with Putin, depicts the FTX collapse",
    "url": "https://crypto.news/vitalik-buterin-reflects-on-his-meeting-with-putin-depicts-the-ftx-collapse/",
    "description": "In a recent introspective blog post, Ethereum co-founder Vitalik Buterin candidly addressed the complexities of his journey in the crypto world and its intersection with global politics. "
  },
  {
    "source": "BTCManager",
    "date": "2024-01-31T21:13:08.000Z",
    "title": "PEPE memecoin fork PORK above $200m market cap in 48 hours",
    "url": "https://crypto.news/pepe-memecoin-fork-pork-above-200m-market-cap-in-48-hours/",
    "description": "PORK, a pink Pepe-The-Frog-themed memecoin spin-off of PEPE, surged over 450% in less than two days."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-31T21:30:28.000Z",
    "title": "Ethereum to $20,000: Analyst Sees Spot Ethereum ETFs Fueling Bull Run",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-to-20000-spot-ethereum-etfs-bull-run/",
    "description": "A crypto analyst, Eric, believes Ethereum (ETH) could spike to $20,000 in the upcoming bull run. The analyst said the potential launch of spot Ethereum exchange-traded funds (ETFs) in the United States will propel this upswing. Ethereum To $20,000 Possible In a post on X, Eric cited Ethereum&#8217;s historical tendency to mirror Bitcoin (BTC), albeit with a one-cycle lag. In the previous bull market, the analyst noted that Bitcoin surged 22-fold from $3,100 to $69,000. Therefore, if Ethereum follows a similar trajectory, reaching $20,000 would be a realistic possibility. As the analyst noted, Ethereum&#8217;s recent bear market bottom of $880 in 2022, if extrapolated using the 22x growth rate seen in BTC, places the coin at $19,360. However, the analyst believes Ethereum might surpass expectations, making $20,000 a base and a psychological round number to monitor closely.  Related Reading: Crypto Analyst Predicts Bitcoin To Reach $60,000, Here’s Why Supporting this forecast is the possible approval of a spot Ethereum ETFs. Like the spot Bitcoin ETF, this authorization will likely attract institutional investors and significantly boost Ethereum prices and liquidity. Institutional investors can gain exposure to Ethereum through these complex derivative products without the complexities of directly trading or storing the coin. While the optimism remains, the United States Securities and Exchange Commission (SEC) will likely follow the same path it took before approving the first spot of Bitcoin ETFs in January. For context, the strict agency failed to approve any spot Bitcoin ETF for over ten years, citing market manipulation risks and the absence of proper monitoring tools. Will The US SEC Approve A Spot Ethereum ETF? However, in a recent statement by The Block, Standard Chartered, a global bank, said the US SEC will likely approve Ethereum ETF&#8217;s first spot in May 2023. By then, the bank added, ETH prices will be trading at around $4,000, propelled by general market optimism.  The bank notes that the failure of the agency to classify ETH as a security further adds weight to this expectation. At the same time, Grayscale Investments, which is issuing Grayscale Ethereum Trusts (ETHE), wants to convert this product into an ETF. Each share traded at around $20 as of January 30. Earlier, Grayscale won against the US SEC&#8217;s arguments, wishing to prevent the conversion of their Bitcoin Trust into an ETF. This win set the ball rolling for the eventual approval of the first spot Bitcoin ETFs in the United States.  Related Reading: XRP Price Turns Red As Risk of More Downsides Escalate Additionally, the fact that Ethereum Futures ETFs were recently approved and listed on the Chicago Mercantile Exchange is a net positive, paving the way for a potential listing in May 2024.  Feature image from Canva, chart from TradingView"
  }
]