[
  {
    "source": "CryptoGlobe",
    "date": "2024-03-19T08:19:29.000Z",
    "title": "Grayscale’s Spot Bitcoin ETF Experiences Record Outflows, Causing BTC Price to Fall Below $65,000",
    "url": "https://www.cryptoglobe.com/latest/2024/03/grayscales-spot-bitcoin-etf-experiences-record-outflows-leading-btc-price-to-fall-below-65000/",
    "description": "Grayscale’s spot Bitcoin ETF saw an unprecedented outflow of more than $640 million on March 18. This marks the largest single-day outflow since the fund’s conversion from an institutional fund to a spot ETF on January 11. According to data from Farside Investors, Grayscale’s Bitcoin ETF experienced a staggering $642.5 million in outflows on March […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T08:12:27.000Z",
    "title": "WEEKLY CRYPTO PRICE ANALYSIS: BTC, ETH, BNB, SOL, XRP, ADA, And DOGE",
    "url": "https://www.cryptopolitan.com/weekly-crypto-price-analysis/",
    "description": "Weekly crypto price analysis for major tokens such as Bitcoin( BTC),  Ethereum (ETH), Binance(BNB), Solana(SOL), XRP, Cardano(ADA), and Dogecoin(DOGE) has seen an impressive surge over the past month showing a promising outlook for the market. However, Most digital assets display a sideways trend in the past week, with bulls and bears struggling to gain control. [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-19T08:25:27.000Z",
    "title": "Pushd presale intensifies, attracting XLM, ATOM communities",
    "url": "https://crypto.news/pushd-presale-intensifies-attracting-xlm-atom-communities/",
    "description": "As Pushd (PUSHD) enters the spotlight with its presale, it draws attention from Stellar (XLM) and Cosmos (ATOM) communities, signaling a shift toward user-focused online commerce through blockchain. #partnercontent"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-19T08:15:36.000Z",
    "title": "Japan’s $1.5 Trillion Pension Fund To Assess Bitcoin For Diversification",
    "url": "https://www.newsbtc.com/news/bitcoin/japans-1-5-trillion-pension-fund-assess-bitcoin/",
    "description": "The Government Pension Investment Fund (GPIF) of Japan, the world’s largest pension fund with assets totaling $1.5 trillion, has officially announced its initiative to explore diversification opportunities that include Bitcoin, alongside traditional investments such as gold and more unconventional assets like forests and farmland. This exploration marks a monumental potential pivot in the investment strategy of a fund traditionally associated with more conservative asset classes. Japan GPIF Seeks Information On Bitcoin According to a Bloomberg report dated March 19, 2024, GPIF is in the initial phase of this exploration, focusing on an information request stage rather than signaling an imminent expansion of its investment portfolio. The fund currently diversifies its holdings across a vast array of assets, including domestic and international stocks and bonds, infrastructure, and real estate. With assets under management valued at approximately 225 trillion yen as of the end of December 2023, the GPIF&#8217;s interest in Bitcoin and other illiquid assets underscores a notable shift towards broadening its investment aperture. Related Reading: Profit-Taking Panic, Short-Term Bitcoin Holders Sell Off – What’s Next For BTC? The GPIF stated, &#8220;In addition to basic knowledge about the assets targeted for information provision, we are also seeking information on how overseas pension funds incorporate them into their portfolios and actual investment cases.&#8221; This reflects a methodical approach to understanding the potential benefits and risks associated with diversifying into less traditional and more volatile asset classes like Bitcoin. Recent years have seen the GPIF actively seeking to enhance the sophistication and diversity of its portfolio. &#8220;Since the fall of 2022, a total of 56 active funds have been selected in North American, developed country, and Japanese stocks,&#8221; the GPIF noted, highlighting its ongoing efforts to refine its investment strategies. The inclusion of Bitcoin and other non-traditional assets would represent a further step in these diversification efforts. However, the GPIF has cautiously noted, &#8220;This announcement is a request for information and does not indicate that the company will expand its investment targets in the future.&#8221; This statement clarifies that any decision to incorporate Bitcoin or other proposed assets into its investment strategy will depend on the outcomes of its current research phase. Related Reading: Standard Chartered Predicts Bitcoin At $150,000, ETH At $8,000 By Year-End This move by the GPIF comes amid broader regulatory changes in Japan regarding Bitcoin and crypto investments. Just one month prior to this announcement, Japan&#8217;s administration, led by Prime Minister Fumio Kishida, moved to enable investment funds to hold Bitcoin and other cryptocurrencies directly. &#8220;The bill states that &#8216;measures will be taken to add crypto assets to the list of assets that can be acquired and held by investment limited partnerships,'&#8221; according to a statement from the Ministry of Economy, Trade, and Industry. The GPIF&#8217;s exploration of Bitcoin and alternative assets not only underscores the growing institutional interest in Bitcoin, but is also in line with Japan&#8217;s regulatory advances aimed at integrating digital assets into the country&#8217;s economic framework. The potential inclusion of Bitcoin in the world&#8217;s largest pension fund would be huge news and could have implications for other countries and their investment strategies. At press time, BTC traded at $64,589. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-19T08:38:03.000Z",
    "title": "SUI and JUP Rallies Defy Market Downturn: Next Stop $2?",
    "url": "https://coinedition.com/sui-and-jup-rallies-defy-market-downturn-next-stop-2/",
    "description": "<img width=\"512\" height=\"288\" src=\"https://coinedition.com/wp-content/uploads/2024/03/unnamed-2.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SUI and JUP Price Eye $2 Amid Rally\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/unnamed-2.png 512w, https://coinedition.com/wp-content/uploads/2024/03/unnamed-2-300x169.png 300w, https://coinedition.com/wp-content/uploads/2024/03/unnamed-2-380x214.png 380w, https://coinedition.com/wp-content/uploads/2024/03/unnamed-2-127x70.png 127w, https://coinedition.com/wp-content/uploads/2024/03/unnamed-2-159x89.png 159w, https://coinedition.com/wp-content/uploads/2024/03/unnamed-2-255x143.png 255w, https://coinedition.com/wp-content/uploads/2024/03/unnamed-2-313x175.png 313w, https://coinedition.com/wp-content/uploads/2024/03/unnamed-2-440x247.png 440w, https://coinedition.com/wp-content/uploads/2024/03/unnamed-2-414x233.png 414w, https://coinedition.com/wp-content/uploads/2024/03/unnamed-2-293x165.png 293w, https://coinedition.com/wp-content/uploads/2024/03/unnamed-2-375x211.png 375w, https://coinedition.com/wp-content/uploads/2024/03/unnamed-2-328x185.png 328w, https://coinedition.com/wp-content/uploads/2024/03/unnamed-2-144x81.png 144w, https://coinedition.com/wp-content/uploads/2024/03/unnamed-2-123x70.png 123w, https://coinedition.com/wp-content/uploads/2024/03/unnamed-2-129x73.png 129w, https://coinedition.com/wp-content/uploads/2024/03/unnamed-2-355x200.png 355w\" sizes=\"(max-width: 512px) 100vw, 512px\" /><p>Sui (SUI) and Jupiter (JUP) are both eyeing the $2 price milestone, a goal that hinges on various market and internal project factors.&#160; Market Dynamics and Investor Sentiment For Sui (SUI), current trading patterns indicate a period of consolidation, with the price hovering around the 50-day Exponential Moving Average (EMA) mark. This range-bound movement reflects [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/sui-and-jup-rallies-defy-market-downturn-next-stop-2/\">SUI and JUP Rallies Defy Market Downturn: Next Stop $2?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-19T08:22:23.000Z",
    "title": "BOME Price Plunges After Top Holder Unloads 340 Million Tokens for $3.6M",
    "url": "https://coinedition.com/bome-price-plunges-after-top-holder-unloads-340-million-tokens-for-3-6m/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/03/Bome-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/Bome-3.jpg 730w, https://coinedition.com/wp-content/uploads/2024/03/Bome-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/Bome-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/Bome-3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/03/Bome-3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/03/Bome-3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/03/Bome-3-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/03/Bome-3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/03/Bome-3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/03/Bome-3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/03/Bome-3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/03/Bome-3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/03/Bome-3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/03/Bome-3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/03/Bome-3-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/03/Bome-3-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The newly launched Solana-based memecoin, BOOK OF MEME (BOME), slumped after its top holding address, sundayfunday.sol, sold 340 million units of the crypto token. The sale reportedly generated 18,660 SOL, with an average selling price of $0.0107 and a profit of $3.62 million. On-chain data shows the holder executed the transaction in seven installments, six [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bome-price-plunges-after-top-holder-unloads-340-million-tokens-for-3-6m/\">BOME Price Plunges After Top Holder Unloads 340 Million Tokens for $3.6M</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]