[
  {
    "source": "CoinDesk",
    "date": "2023-07-31T14:44:46.000Z",
    "title": "U.S. SEC Sues Richard Heart, Hex, PulseChain on Unregistered Securities, Fraud Allegations",
    "url": "https://www.coindesk.com/policy/2023/07/31/us-sec-sues-richard-heart-hex-pulsechain-on-unregistered-securities-fraud-allegations/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Securities and Exchange Commission (SEC) sued internet marketer Richard Schueler, known online as Richard Heart, and his projects Hex, PulseChain and PulseX, alleging he raised over $1 billion across three different unregistered securities offerings."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-31T14:43:49.000Z",
    "title": "Bank of Korea to Exclude Seoul From CBDC Pilot Study Next Year: Report ",
    "url": "https://www.coindesk.com/policy/2023/07/31/bank-of-korea-to-exclude-seoul-from-cbdc-pilot-study-next-year-report/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Jeju, Busan and Incheon are in the running to be considered."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-31T14:55:12.000Z",
    "title": "SEC files complaint against HEX founder for allegedly offering unregistered securities",
    "url": "https://cointelegraph.com/news/sec-files-complaint-hex-founder-offering-unregistered-securities",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/34bf9c65-e767-4891-8145-543e1e72c3de.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to the SEC, Richard Heart allegedly used more than $12 million of investor funds to buy \"a 555-carat diamond, expensive watches, and high-end automobiles.”</p>\n                    <p><p>The United States Securities and Exchange (SEC) has filed a lawsuit against Richard Schueler, better known in the crypto space as Richard Heart, for alleged unregistered offerings of three tokens. </p><p>In a July 31 filing in U.S. District Court for the Eastern District of New York, the SEC claimed Heart had raised more than $1 billion through “the unregistered offer and sale of crypto asset securities”, which included HEX, PulseChain (PLS), and PulseX (PSLX). According to the complaint, Heart touted the tokens “as a pathway to grandiose wealth for investors”, hiring developers to maintain the framework behind the crypto assets.</p><p>The SEC alleged Heart violated federal securities laws and defrauded retail investors both in the U.S. and abroad. Many of the allegations focused on the HEX founder promising large returns for investors in exchange for hundreds of millions of dollars in deposits. For example, he allegedly accepted more than 2.3 million Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) — worth roughly $678 million at the time — in exchange for HEX tokens, $354 million in exchange for the promise of future delivery of PLS tokens, and $676 million in exchange for the promise of future delivery of PLSX tokens.</p><p>“Heart and PulseChain defrauded investors by misappropriating at least $12.1 million of PulseChain investor funds,” said the complaint. “Instead of using these investor funds to develop and market the PulseChain network, or even to fulfill Heart’s explicit statement that invested funds supported ‘freedom of speech’ Heart and PulseChain used at least $12.1 million of investor funds for Heart’s personal luxury purchases, including a 555-carat diamond, expensive watches, and high-end automobiles.”</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-31T14:52:55.000Z",
    "title": "ENS-Auctioned Ether Moved by Whale; Worth $74M",
    "url": "https://cryptobriefing.com/ens-auctioned-ether-moved-by-whale/?utm_source=feed&utm_medium=rss",
    "description": "An Ethereum whale has reclaimed 39,712 ETH, equivalent to $119 million, from the Ethereum Name Service (ENS) auction. The funds, associated with the domain darkmarket.eth, were locked in the ENS..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T15:04:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-31T15:00:28.000Z",
    "title": "Is It A Good Idea To Buy Curve Now? Here’s What This Founder Thinks",
    "url": "https://www.newsbtc.com/news/defi/is-it-a-good-idea-to-buy-curve-now/",
    "description": "In the wake of a massive exploit, the price of the Curve (CRV) token has declined drastically, recording double-digit losses in the last day. This has led to what some would call an opportunity to buy cheap coins and Matrixport and Bitdeer founder Jihan Wu is one of the believers. A Good Time To Buy Curve (CRV)? Jihan Wu recently tweeted that he bought the CRV dip. According to Wu, he remains a strong believer in the token because of its future applications. Wu’s tweet comes at a time when Decentralized Finance (DeFi) platform Curve DAO’s native token CRV has been down by more than 12% in the last 24 hours. This dip came following an exploit in some of Curve’s stablecoin pools.  Related Reading: Here’s How Long The Majority Of New Ethereum Wallets Are Used Before They’re Dumped The exploit on the protocol reportedly occurred due to a bug in the Vyper programming language, which is used to power part of the DEX’s ecosystem.  Despite this occurrence, Wu believes that this is a good time to invest in the CRV tokens as these tokens will play a significant role in the coming RWA (Real World Assets) wave in reference to the tokenization of physical assets. “In the coming RWA wave, $crv is one of the most important infrastructures. I have BTFD. NFA,” the founder said in the tweet. Without a doubt, the tokenized industry is growing and boasts immense potential. Last year, a World Economic Forum survey projected the tokenized assets industry to account for almost 10% of the global GDP by 2027.  The tokenization of real-world assets will involve bringing physical assets like houses, arts, and precious metals on-chain. This will undoubtedly provide easier access and promote fractional ownership of these assets.  CRV price declines over 14% following exploit &#124; Source: CRVUSD on Tradingview.com As Wu has highlighted, DeFi protocols like Curve and tokens like CRV will play an integral role in facilitating transactions involving the transfer and trade of these tokenized assets.  DeFi Security Remains A Stumbling Block The several exploits on DeFi protocols continue to remain a huge problem in the DeFi ecosystem and something which many consider a stumbling block to the wider adoption of DEXs over CEXs by many crypto users. Recently, Curve Finance’s Omnipool platform, Conic Finance, suffered an exploit that resulted in the hacker stealing over $3 million in Ether. Related Reading: Ahead Of The Pack: Binance Moves Forward With New License in Dubai A report from Web3 portfolio app De.Fi found that over $204 million was lost to hacks and exploits in the DeFi ecosystem in Q2 of 2023 alone. The number of incidents (117) in Q2 this year translated to an “almost 7 times” increase in comparison with Q2 of 2022 (17 incidents).  According to the report, over $665 million have been lost to such exploits this year. And these breaches further highlight the need for DeFi protocols to implement enhanced security mechanisms on their platforms. Featured image from The Coin Republic, chart from Tradingview.com"
  }
]