[
  {
    "source": "CoinDesk",
    "date": "2023-05-26T12:53:45.000Z",
    "title": "Stablecoins Are the 'Glue' Between the Real Economy and Blockchain: Binance Japan General Manager",
    "url": "https://www.coindesk.com/business/2023/05/26/stablecoins-are-the-glue-between-the-real-economy-and-blockchain-binance-japan-general-manager/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Tsuyoshi Chino added that Binance J.apan may be still \"a long way off\" its business and activities being properly understood in gaining regulatory acceptance"
  },
  {
    "source": "Decrypt",
    "date": "2023-05-26T13:00:30.000Z",
    "title": "Ethereum, Bitcoin Balances on Exchanges Edges Toward 5-Year Low",
    "url": "https://decrypt.co/142507/ethereum-bitcoin-balances-exchanges-edges-5-year-lows",
    "description": "The collapse of FTX, the rise in self-custody interest, and Ethereum’s latest upgrade appear to be fueling the latest exchange exodus. "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T12:51:00.000Z",
    "title": "Binance Launches NFT Loan Feature",
    "url": "https://cryptodaily.co.uk/2023/05/binance-launches-nft-loan-feature",
    "description": "<p>The Binance crypto exchange has started its NFT journey by launching a loan feature, which will allow users to use their NFTs as collateral to borrow cryptocurrency.&nbsp;</p>\nBorrow Crypto Against NFT\n<p>The move marks the entry of the world&rsquo;s largest cryptocurrency exchange into the NFT lending space. After launching its NFT marketplace in June 2021, the latest NFT lending feature will give users easy and quick access to funds without having to sell their NFTs, allowing them to borrow cryptocurrencies by just putting their digital assets as collateral.&nbsp;</p>\n<p>Head of Product at Binance, Mayur Kama, announced the news, saying,</p>\n\n<p>&ldquo;Binance NFT is building! We&rsquo;ve added many features that make it a one-stop shop for NFT trading and financial services for our community. We already have low fees and the Binance peace of mind; now NFT Loans will add a new form of liquidity for NFT holders, allowing them to participate in the market without letting go of their precious NFTs.&rdquo;</p>\n\nDeFi Benefits For Users\n<p>The feature will allow users to initially borrow only Ether (ETH) against NFTs that have been marked as &ldquo;blue-chip.&rdquo; These include popular digital asset collections like the Bored Ape Yacht Club (BAYC), Mutant Ape Yacht Club (MAYC), Azuki, and Doodles. Collectors with NFTs from any of these collections will be able to put their assets as collateral and borrow ETH.&nbsp;</p>\n<p>The announcement from the company has claimed that more NFT collections will be added to the &ldquo;blue-chip&rdquo; list, broadening the borrowing opportunities for its users.&nbsp;</p>\n<p>The feature also allows users to tap into the DeFi-related benefits in the Binance NFT community, as it operates on a &ldquo;Peer to Pool&rdquo; mechanism, where data is sourced from multiple providers, including the oracle service Chainlink and the OpenSea NFT marketplace. The Binance NFT marketplace acts like a loan pool, and the floor price of the collateralized NFTs decides the amount of ETH a user can borrow.&nbsp;</p>\nNo Gas fees\n<p>One notable advantage of the Binance NFT loan feature is the absence of gas fees or Ethereum transaction fees, making it a cost-effective solution for users seeking liquidity. In addition, the interest rates on NFT loans currently stand at 7.91% per annum, with loan-to-value ratios ranging from 40% to 60%, as stated on the Binance NFT website.</p>\n<p>Binance's foray into NFT lending further expands its NFT offerings, complementing its NFT marketplace that was introduced in April 2021. Since its launch, Binance has continually added features to enhance user experience, including the recent integration of Ordinals, Bitcoin-based NFTs, alongside existing blockchain support for Ethereum, Polygon, and Binance's native BNB Chain.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "NullTX",
    "date": "2023-05-26T13:00:45.000Z",
    "title": "Centralized exchanges in trouble, Investors are looking at hybrid exchange Tradecurve",
    "url": "https://nulltx.com/centralized-exchanges-in-trouble-investors-are-looking-at-hybrid-exchange-tradecurve/",
    "description": "Centralized exchanges (CEX) have long been the go-to platform for cryptocurrency traders, offering a convenient way to buy and sell digital assets. However, recent events have highlighted the potential vulnerabilities of these exchanges and raised concerns about their future. From security breaches to regulatory crackdowns, centralized exchanges are facing mounting challenges. But as these exchanges [&#8230;]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-26T12:50:00.000Z",
    "title": "Total Crypto Market Cap Drops Slightly to $1.16 Trillion",
    "url": "https://coinedition.com/total-crypto-market-cap-drops-slightly-to-1-16-trillion/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Total_Crypto_Market_Cap_is_down_slightly_It_is_currently_at_1_1-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Total_Crypto_Market_Cap_is_down_slightly_It_is_currently_at_1_1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Total_Crypto_Market_Cap_is_down_slightly_It_is_currently_at_1_1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Total_Crypto_Market_Cap_is_down_slightly_It_is_currently_at_1_1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Total_Crypto_Market_Cap_is_down_slightly_It_is_currently_at_1_1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Total_Crypto_Market_Cap_is_down_slightly_It_is_currently_at_1_1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Total_Crypto_Market_Cap_is_down_slightly_It_is_currently_at_1_1.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The total market capitalization of the cryptocurrency market has dropped $1.16 trillion amid slowing market volatility. Data from the cryptocurrency aggregation platform, CoinGecko shows the total crypto market cap reached a yearly high of $1.34 trillion in the middle of April 2023. The total crypto market capitalization measures the cumulative value of all circulating cryptocurrencies. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/total-crypto-market-cap-drops-slightly-to-1-16-trillion/\">Total Crypto Market Cap Drops Slightly to $1.16 Trillion</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]