[
  {
    "source": "Cryptopolitan",
    "date": "2023-09-04T04:36:39.000Z",
    "title": "Generative AI Disruption Threatens Australian Economy, Deloitte Report Reveals",
    "url": "https://www.cryptopolitan.com/generative-ai-disruption-australian-economy/",
    "description": "In a groundbreaking report released today, Deloitte Access Economics and the Deloitte AI Institute have sounded the alarm, warning that Australia&#8217;s economic landscape is on the brink of significant upheaval due to the rapid integration of Generative AI (GAI). The study pinpoints Finance, ICT, media, professional services, education, and wholesale trade as the sectors most ... <a title=\"Generative AI Disruption Threatens Australian Economy, Deloitte Report Reveals\" class=\"read-more\" href=\"https://www.cryptopolitan.com/generative-ai-disruption-australian-economy/\" aria-label=\"More on Generative AI Disruption Threatens Australian Economy, Deloitte Report Reveals\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-04T04:38:55.000Z",
    "title": "Ethereum Bears Hold Strong – Why ETH Could Resume Downtrend Below $1,600",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-bears-strong-1700/",
    "description": "Ethereum price tested the $1,600 zone and is currently recovering against the US Dollar. ETH is facing many hurdles near $1,650 and $1,670. Ethereum started a recovery wave from the $1,600 support level. The price is trading below $1,650 and the 100-hourly Simple Moving Average. There is a connecting bearish trend line forming with resistance near $1,665 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase unless there is a close above the $1,700 level. Ethereum Price Faces Key Resistance Ethereum’s price extended its decline below the $1,650 support zone. ETH price even spiked below the $1,620 and tested the $1,600 handle, like Bitcoin. A low was formed near $1,600 and the price recently started an upside correction. There was a move above the $1,620 and $1,630 levels. The price climbed above the 23.6% Fib retracement level of the downward move from the $1,748 swing high to the $1,600 low. Ether is still trading below $1,650 and the 100-hourly Simple Moving Average. Besides, there is a connecting bearish trend line forming with resistance near $1,665 on the hourly chart of ETH/USD. On the upside, the price might face resistance near the $1,650 level and the 100 hourly SMA. The next resistance is near the $1,660 level and the trend line. It is close to the 50% Fib retracement level of the downward move from the $1,748 swing high to the $1,600 low. Source: ETHUSD on TradingView.com A close above the $1,665 level might send the price toward the $1,700 zone. To start a fresh increase, Ethereum must settle above the $1,700 pivot level. The next resistance might be near $1,750. Any more gains might send the price toward the $1,800 resistance. Another Decline in ETH? If Ethereum fails to clear the $1,665 resistance, it could start another decline. Initial support on the downside is near the $1,630 level. The first key support is close to $1,600. The next major support is near the $1,580 level. If there is a downside break below $1,580, the price could extend its decline toward the $1,540 level. Any more losses might send the price toward the $1,480 level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,600 Major Resistance Level – $1,665"
  }
]