[
  {
    "source": "Cointelegraph",
    "date": "2023-09-15T04:20:27.000Z",
    "title": "Decentralized stablecoins could dominate crypto: MakerDAO founder ",
    "url": "https://cointelegraph.com/news/decentralized-stablecoins-could-dominate-makerdao-founder",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/6d4392b5-0fa9-4ad7-b3fb-e180b4d6917d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>MakerDAO’s Rune Christensen says appropriate regulation will see stablecoins become mainstream, but the real opportunity is in decentralized stablecoins.</p>\n                    <p><p>Decentralized stablecoins may eventually dominate the stablecoin market, so long as crypto “ends up living up to its potential,” says Rune Christensen, the co-founder of DeFi pioneer MakerDAO.</p><p>Speaking to Cointelegraph’s Andrew Fenton at the Korea Blockchain Week 2023, Christensen aired his thoughts on the future of decentralized stablecoins such as Dai (<a href=\"https://cointelegraph.com/dai-price-index\">DAI</a>) and their role in the wider crypto economy.</p><p>They discussed a presentation by Castle Island Ventures partner <a href=\"https://cointelegraph.com/news/nic-carter-dives-into-proof-of-reserves-ranks-exchange-attestations\">Nic Carter</a> at the TOKEN2049 conference in Singapore in which he said that interest-bearing stablecoins could become 30% of the market within two years.</p><p>Christensen agreed but said it would probably depend on the macro situation, adding “if high inflation high rates continue, then probably,” stablecoin dominance will increase. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/d5c18c8d-142e-4638-b7b6-665bea68f120.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>MakerDAO presentation at Token2049. Source: Cointelegraph</em></figcaption></figure><p>When asked whether a decentralized stablecoin could compete with its centralized cousins, he replied:</p><blockquote>“Easily I mean, I think if the space ends up living up to its potential, then decentralized stablecoins will be the entire market like centralized stablecoins would be the edges that connect us to like the legacy system.”</blockquote><p>He added that if crypto “delivers” and becomes regulated, centralized stablecoins will become more mainstream. However, the real potential is in decentralized stablecoins, he suggested:</p><blockquote>“I think the real killer advantage of decentralized stablecoins, run by actual data like Maker, is this ability to gamify your savings.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/makerdao-publishes-5-phase-roadmap-featuring-funding-for-open-source-ai-projects\"><strong><em>MakerDAO publishes 5-phase roadmap featuring funding for open-source AI projects</em></strong></a></p><p>In mid-2022, Christiansen <a href=\"https://cointelegraph.com/news/maker-founder-proposes-metadaos-and-synthetic-eth-in-endgame-plan\">proposed</a> MakerDAO’s “Endgame Plan”. The plan proposes making DAI a free-floating asset, initially collateralized by real-world assets (RWA).</p><p>There will be a three-year period when DAI remains pegged to the dollar. During this period, the protocol will double down on RWA to accumulate as much Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) as possible which increases the ratio of decentralized collateral.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/489d538b-6e15-499d-96e3-64968df12164.png\"  /><figcaption style=\"text-align: center;\"><em>MakerDAO Endgame. Source: </em><a href=\"https://forum.makerdao.com/t/endgame-plan-timeline-to-free-floating-dai/17529\" target=\"_blank\" rel=\"noopener nofollow\"><em>forum.makerdao.com</em></a></figcaption></figure><p>Rune believes that Maker has built a very solid and stable foundation but it has been overtaken by scammy and illegitimate projects. </p><p>He wants to try and <a href=\"https://cointelegraph.com/news/future-of-gamefi-beyond-the-hype-and-toward-accessibility-through-identity\">gamify</a> to make the protocol fun and more appealing to younger users. “It's what people want,” he said before adding, “Things are designed like a game and that's the kind of interface they will use.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/a2415718-254f-44ad-b916-8613dbbe7f71.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>MakerDAO presentation at Token2049. Source: Cointelegraph</em></figcaption></figure><p><em><strong>Magazine: </strong></em><a href=\"https://cointelegraph.com/magazine/gta-owner-blockchain-game-bitcoin-casino-sunflower-land-review-web3-gamer/\"><strong><em>Web3 Gamer: GTA owner joins Web3, Bitcoin casino, Sunflower Land review</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-15T04:30:00.000Z",
    "title": "Economist and Gold Bug Peter Schiff Predicts a ‘Massive Crisis’ Is Coming",
    "url": "https://www.cryptoglobe.com/latest/2023/09/economist-and-gold-bug-peter-schiff-predicts-a-massive-crisis-is-coming/",
    "description": "In a recent in-depth interview Peter Schiff, a well-known economist and gold advocate, revealed mounting concerns regarding the stability of the U.S. dollar, saying there’s “going to be a massive crisis,” that will send “the economy into a tailspin.” The interview, with David Rodriguez, saw Schiff address the growing debt of the U.S. government and […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T04:30:45.000Z",
    "title": "Are We on the Verge of a Quantum AI Revolution? Exploring the Possibilities",
    "url": "https://www.cryptopolitan.com/verge-quantum-ai-revolution-possibilities/",
    "description": "In a world where technological advancements continuously redefine the boundaries of possibility, the convergence of Quantum Computing and Artificial Intelligence (AI) heralds the dawn of a new era. The quantum AI revolution, driven by the synergy between these two cutting-edge fields, has the potential to reshape industries, accelerate scientific discoveries, and address some of the ... <a title=\"Are We on the Verge of a Quantum AI Revolution? Exploring the Possibilities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/verge-quantum-ai-revolution-possibilities/\" aria-label=\"More on Are We on the Verge of a Quantum AI Revolution? Exploring the Possibilities\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-15T04:17:17.000Z",
    "title": "Ethereum Price Nears Make-or-Break Resistance, Can Bulls Make It?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-resistance-1650/",
    "description": "Ethereum price is eyeing a key upside break above $1,650 against the US Dollar. ETH could gain bullish momentum if there is a close above $1,650 and $1,670. Ethereum is moving higher toward the $1,650 resistance. The price is trading above $1,610 and the 100-hourly Simple Moving Average. There is a short-term rising channel forming with support near $1,630 on the hourly chart of ETH/USD (data feed via Kraken). The pair could rise steadily if there is a close above $1,650 and $1,670. Ethereum Price Eyes Upside Break Ethereum’s price formed a base above the $1,580 level and extended its increase. ETH traded above the $1,620 resistance to move into a positive zone, like Bitcoin. The price is now trading near a key barrier at $1,650, above which it could accelerate higher. Ether is now trading above $1,610 and the 100-hourly Simple Moving Average. It is also above the 23.6% Fib retracement level of the recent increase from the $1,582 swing low to the $1,644 high. Besides, there is a short-term rising channel forming with support near $1,630 on the hourly chart of ETH/USD. On the upside, the price might face resistance near the $1,645 level. The next resistance is near the $1,650 level. A close above the $1,650 resistance might push the price toward the $1,670 resistance. Source: ETHUSD on TradingView.com To start a steady increase, the price must settle above the $1,670 resistance. The next major hurdle is near the $1,750 level. A close above the $1,750 level might send Ethereum further higher toward $1,880. Another Rejection in ETH? If Ethereum fails to clear the $1,650 resistance, it could start another decline. Initial support on the downside is near the $1,630 level and the channel trend line. The first key support is close to $1,610, the 100-hourly Simple Moving Average, and the 50% Fib retracement level of the recent increase from the $1,582 swing low to the $1,644 high. The next key support is $1,580. A downside break below $1,580 might start another bearish wave. In the stated case, the price could even decline toward the $1,520 level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,610 Major Resistance Level – $1,650"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-15T04:10:36.000Z",
    "title": "Ripple Expands Its Liquidity Hub into $5,000,000,000,000 Market with Further Acquisitions and Infrastructure Expansion – Can XRP Price Rise to $1?",
    "url": "https://www.crypto-news-flash.com/ripple-expands-its-liquidity-hub-into-5000000000000-market-with-further-acquisitions-and-infrastructure-expansion-can-xrp-price-rise-to-1/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-expands-its-liquidity-hub-into-5000000000000-market-with-further-acquisitions-and-infrastructure-expansion-can-xrp-price-rise-to-1",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T101600.077.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T101600.077.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T101600.077-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T101600.077-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple&#8217;s infrastructure now has the potential to cater to 90% of the daily FX market, approximating an immense $5 trillion. Experts are beginning to view XRP as the future global bridge currency for international trade. Ripple&#8217;s Robust Liquidity Solutions Set to Dominate the Crypto Sphere The evolution of technology has always been marked by innovative [...]"
  }
]