[
  {
    "source": "Cointelegraph",
    "date": "2023-09-01T12:57:00.000Z",
    "title": "AI could revolutionize human resources, but there are risks",
    "url": "https://cointelegraph.com/news/ai-human-resources-risks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/a4732d4b-c9b1-466d-9085-ce467e0cc1d7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>While AI has the power to revolutionize human resources, it also leaves HR professionals open to certain risks.</p>\n                    <p><p>As businesses globally grapple with the challenges of talent acquisition, employee retention and optimizing workplace dynamics, the potential of artificial intelligence (AI) to offer innovative solutions has become a focal point of discussion among human resources (HR) professionals. </p><p>For many industry insiders and observers, AI’s integration into HR represents a promising fusion of data-driven efficiency and enhanced decision-making. Organizations increasingly turn to AI-driven tools to streamline processes that were once time-consuming and reliant on human intuition. </p><p>For instance, sophisticated AI algorithms can sift through vast pools of job applications, identifying candidates whose profiles best match the job description. This has the potential to speed up the recruitment process and ensure that the shortlisted candidates are a closer fit to the company’s requirements. </p><p>Beyond recruitment, AI’s influence in HR manifests in various other domains. Predictive analytics powered by AI enable companies to anticipate potential employee turnover, allowing HR professionals to intervene proactively and address underlying issues. This proactive approach could enhance employee satisfaction, potentially reducing attrition rates. </p><p>However, while the benefits of AI in HR could be numerous, its integration is not without challenges. Concerns about data privacy, the potential for algorithmic biases, and the fear of an over-reliance on technology at the expense of human intuition are topics of ongoing debate. </p><p>As the HR sector navigates these complexities, the overarching goal remains clear: to harness the power of AI in ways that complement human expertise, ensuring that the human-centric ethos of HR remains undiluted. </p><h2>The potential of tailored AI in HR</h2><p>The emerging AI trend is a move away from generic, one-size-fits-all solutions. The modern business environment, characterized by its diversity and unique challenges, demands more bespoke AI solutions tailored to specific needs. This is especially true for the HR sector, where the nuances of company culture, employee dynamics and organizational goals can vary widely. </p><p>For instance, a multinational corporation with a diverse workforce spread across various geographies might benefit from an AI system designed to understand and cater to regional employment laws, cultural nuances and local talent pools. </p><p>On the other hand, a startup in the tech sector might seek an AI solution that emphasizes skills matching, rapid onboarding and remote work dynamics. </p><p>Several companies are stepping up to address this challenge, arguing that AI teams can match or even surpass human efficiency while being more cost-effective. Olympia is one such company. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/8ace4962-e951-493e-beb7-3522d7c7a46f.jpg\"  /></figure><p>Catering primarily to startups and solo business owners, it provides businesses with AI teams tailored to their specific needs. These AI teams are designed to learn the intricacies of a company’s operations, from real-time collaboration needs to in-depth data analytics.</p><p>Victoria Loskutova, Olympia’s co-founder and CEO, told Cointelegraph: “AI presents a transformative solution for managing human resources. It allows organizations to automate routine tasks, precisely analyze large data sets and provide immediate responses around the clock. In contrast to human HR, AI never tires; it provides consistent service, eliminates unconscious bias from decision-making, and scales effortlessly. The power of AI is in revolutionizing the HR landscape, maximizing efficiency and fairness while freeing human professionals to focus on strategic, complex tasks where their unique capabilities truly shine.” </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/ai-analysis-finance-crypto-trading\">How AI analysis can change finance and crypto trading</a></em></strong></p><p>Yet, the journey toward fully realizing the potential of tailored AI in HR is filled with learning curves. It demands a symbiotic relationship where businesses continuously provide feedback, ensuring the AI remains aligned with their evolving objectives. </p><h2>Challenges and considerations with AI in HR</h2><p>The dialogue surrounding AI in HR often circles back to the intrinsic value of human insight. While technology offers tools and solutions, the essence of HR is deeply rooted in understanding, empathy and the ability to perceive nuances beyond mere data.</p><p>Speaking to Cointelegraph, Brenda Neckvatal, author of <em>Best Practices in Human Resources: How to Claw Your Way from Want-to-Be to VP</em>, said, “In the age of AI and automation, it’s essential to remember that HR’s core is about human connections. Technology can aid our processes, but it’s the human touch, understanding and empathy that truly drive HR forward. These are elements that no machine can fully replicate.”</p><p>Her perspective resonates with many in the HR community who believe that while technology can provide tools, the essence of HR is about building relationships and creating a workplace culture that connects with individuals.</p><p>Neckvatal added, “Although the intention of AI is to help reduce the workload and increase efficiency, AI, however, has not been programmed to take into consideration biases that can open employers up for risk.”</p><p>If training data is inherently biased, AI-based decisions could mirror these biases, leading to possible unfair or discriminatory outcomes in recruitment and other HR processes. Neckvatal further stated:</p><blockquote>“AI sites such as ChatGPT are not equipped with the programming to mitigate language that creates disparity and discrimination within the context of employment law and preventative best practices.”</blockquote><p>Data privacy and security also emerge as significant concerns. With AI systems processing extensive personal and professional data, safeguarding this information is crucial. A breach or misuse could have legal ramifications and impact employee trust and morale. </p><p>The evolution of AI further necessitates adaptability. Businesses will need to ensure their HR teams remain updated with the latest advancements, possibly involving continuous training and upskilling. </p><h2>Navigating the future of HR</h2><p>The integration of AI into HR is introducing new paradigms and challenges. While AI offers the promise of streamlined processes and predictive insights, the essence of HR has historically revolved around understanding people’s aspirations and building trust.</p><p>Loskutova said, “HR is evolving under AI’s profound influence — it’s more than a tool; it’s a storm reshaping our landscape. We’re teetering on the brink of an automated future where AI doesn’t just impact our industries; it reinvents them. The tale of HR will soon morph from a narrative about individuals to a saga of our dance and clash with algorithms. It’s not just about adjusting to a new work order — it’s about navigating the deluge of our entire societal overhaul.”</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\">How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</a></em></strong></p><p>Contrastingly, Neckvatal emphasized caution for those in HR who are considering the immediate integration of AI: </p><blockquote>“It’s highly advisable that HR professionals learn how AI opens up risk to their companies before utilizing it.”</blockquote><p>In this evolving domain, businesses and HR professionals are presented with varied perspectives on the role and influence of AI, reflecting the multifaceted nature of the ongoing discourse in the HR landscape. As the integration of AI continues to shape certain aspects of HR, the industry stands at a pivotal juncture where the synthesis of technology and human intuition will determine the trajectory of workforce dynamics for years to come.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-01T12:40:25.000Z",
    "title": "US regulators deny blocking AI chip exports to Middle East",
    "url": "https://cointelegraph.com/news/us-regulators-deny-blocking-ai-chip-exports-to-middle-east",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/4e48860f-5068-4904-a035-c6d49d1f9b8f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The U.S. Department of Commerce denied blocking AI chip sales to the Middle East and remained silent about whether the requirements were only imposed on specific countries.</p>\n                    <p><p>The United States Department of Commerce said on Aug. 31 that the Biden administration has “not blocked chip sales to the Middle East,” according to a <a href=\"https://www.reuters.com/technology/us-says-it-has-not-blocked-chip-sales-middle-east-2023-08-31/\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from Reuters. </p><p>This comes after disclosures were <a href=\"https://cointelegraph.com/news/us-curbs-export-nvidia-ai-chip-to-some-middle-eastern-countries\">revealed in a Nvidia report</a> that the U.S. government had expanded requirements for export licenses for artificial intelligence (AI) chips. </p><p>Advanced Micro Devices (AMD), a direct competitor of Nvidia, also received a similar letter from regulators. </p><p>The Department of Commerce did not comment on whether the requirements were imposed on specific U.S. companies. However, the new rules would require Nvidia and AMD to obtain licenses before selling flagship chips to “some Middle Eastern countries,” according to the filing. </p><p>Neither of the two companies has revealed if they have applied for said licenses or if there was any feedback on licensing for that region. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ai-chip-developer-gets-100-million-from-samsung-and-hyundai\"><strong><em>AI chip developer gets $100 million from Samsung and Hyundai</em></strong></a></p><p>Nvidia warned regulators in its quarterly report that being “effectively excluded from all or part of China” could potentially “harm” long-term results for the company. </p><p>In October 2022, the Biden administration issued the initial export controls in an effort to slow China from developing high-level AI systems with powerful semiconductor chips made by U.S. companies. </p><p>Officials in Washington said they are <a href=\"https://cointelegraph.com/news/us-considers-tightening-restrictions-on-ai-chip-exports\">considering tightening the aforementioned regulations</a> even more in a statement made on June 29, which would further limit the computing power on chips available in the Chinese market. </p><p>The moves made by the U.S. government have <a href=\"https://cointelegraph.com/news/us-china-ai-tech-standoff-spread-overseas\">been under close watch</a> from other regulators around the world. Shortly after the U.S.’s initial regulations came into effect, an <a href=\"https://apnews.com/article/technology-district-of-columbia-netherlands-china-business-6801d6c5f65b0bc1df6186e2e89a6f7d\" target=\"_blank\" rel=\"noopener nofollow\">agreement</a> was made with the Netherlands and Japan to restrict exports of semiconductor manufacturing equipment to China. </p><p>Officials in the United Kingdom, France and <a href=\"https://cointelegraph.com/news/germany-proposes-to-screen-chinese-ai-investment\">Germany have all openly said</a> they are considering screening Chinese foreign direct investment in crucial sectors such as AI. </p><p>China has responded by saying it will control the export of gallium and germanium products, the primary raw materials needed to produce AI chips.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-better-results-being-nice-to-chatgpt-ai-fake-child-porn-debate-amazons-ai-reviews/\"><strong><em>AI Eye: Get better results being nice to ChatGPT, AI fake child porn debate, Amazon’s AI reviews</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-01T13:00:49.000Z",
    "title": "Bitcoin’s bearish stance underlines market disquiet as it trails key averages",
    "url": "https://cryptoslate.com/insights/bitcoins-bearish-stance-underlines-market-disquiet-as-it-trails-key-averages/",
    "description": "<p>Quick Take The current trading position of Bitcoin paints a rather bearish picture as it lingers below multiple moving averages and cost basis. Hovering around the $26,000 mark, Bitcoin is trading below the short-term holder cost basis of $28,247. This cost basis is significant as it is the average on-chain acquisition price for coins stored [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-bearish-stance-underlines-market-disquiet-as-it-trails-key-averages/\">Bitcoin&#8217;s bearish stance underlines market disquiet as it trails key averages</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-09-01T12:42:40.000Z",
    "title": "China’s Court Says Crypto, Digital Assets are Legally Protected",
    "url": "https://cryptobriefing.com/chinas-court-says-crypto-legally-protected/?utm_source=feed&utm_medium=rss",
    "description": "A recent report from China identifies digital assets, including crypto, as legal properties within the country's legal framework."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-01T12:41:26.000Z",
    "title": "1inch Investment Fund Acquires $10m in $ETH",
    "url": "https://cryptodaily.co.uk/2023/08/1inch-investment-fund-acquires-10m-in-eth",
    "description": "The investment comes on the heels of a profitable period for the 1inch-affiliated wallet."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-01T12:44:13.000Z",
    "title": "Smart Contract Automation Platform Clockwork Announces Closure",
    "url": "https://cryptodaily.co.uk/2023/08/smart-contract-automation-platform-clockwork-announces-closure",
    "description": "Despite its pending shutdown, Garfield confirmed that Clockwork’s code will remain open-source and freely available."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-01T12:46:00.000Z",
    "title": "Friend.tech Declines as Trading and Fees Plummet",
    "url": "https://cryptodaily.co.uk/2023/08/friendtech-declines-as-trading-and-fees-plummet",
    "description": "Friend.tech initially generated significant buzz, especially after its fees eclipsed both Uniswap and the Bitcoin network, reaching over $1 million within a day on Aug. 19."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-01T12:47:03.000Z",
    "title": "Ethereum AMM Balancer Exploited for Roughly $900k Following Vulnerability Warning",
    "url": "https://cryptodaily.co.uk/2023/08/ethereum-amm-balancer-exploited-for-roughly-900k-following-vulnerability-warning",
    "description": "Upon the revelation of the vulnerability, merely 1.4% or over $5 million of Balancer's entire assets were at jeopardy."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-01T12:58:11.000Z",
    "title": "SBF potential expert witness fees revealed",
    "url": "https://www.cryptopolitan.com/sbf-potential-expert-witness-fees-revealed/",
    "description": "As the trial date for Sam Bankman-Fried (SBF), the co-founder of FTX, approaches, new court documents reveal that SBF is prepared to pay substantial fees to his expert witnesses, potentially exceeding the compensation offered to prosecution witnesses. The trial, which is currently scheduled for October 2, 2023, centers around allegations of fraud, and SBF intends ... <a title=\"SBF potential expert witness fees revealed\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sbf-potential-expert-witness-fees-revealed/\" aria-label=\"More on SBF potential expert witness fees revealed\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-01T12:41:04.000Z",
    "title": "13th Africa Bank 4.0 Summit – West Africa: Scaling Digitally Upwards for a Financially Inclusive Future",
    "url": "https://www.cryptopolitan.com/13th-africa-bank-4-0-summit-west-africa-scaling-digitally-upwards-for-a-financially-inclusive-future/",
    "description": "Summary: 13th Africa Bank 4.0 Summit – West Africa (ICPS – Presenting Partner) is scheduled to be hosted from the 10th to 12th of October 2023, at the EKO Hotels and Suites, Lagos – Nigeria. Lagos, Nigeria &#8211; Date* – Joined by ICPS as Presenting Partner, the 13th Africa Bank 4.0 Summit – West Africa, ... <a title=\"13th Africa Bank 4.0 Summit – West Africa: Scaling Digitally Upwards for a Financially Inclusive Future\" class=\"read-more\" href=\"https://www.cryptopolitan.com/13th-africa-bank-4-0-summit-west-africa-scaling-digitally-upwards-for-a-financially-inclusive-future/\" aria-label=\"More on 13th Africa Bank 4.0 Summit – West Africa: Scaling Digitally Upwards for a Financially Inclusive Future\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-01T12:48:36.000Z",
    "title": "IBM proposes ideas for digital euro implementation",
    "url": "https://crypto.news/ibm-proposes-ideas-for-digital-euro-implementation/",
    "description": "A group of IBM specialists has prepared some ideas regarding implementing the digital euro that the European Commission could consider. The tech consulting company highlighted five topics that could help design the digital currency. The five areas where the company&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-01T13:00:26.000Z",
    "title": "BNB Price Forecast: Will It Break Through Resistance At $225?",
    "url": "https://www.newsbtc.com/news/bnb-price-forecast-will-it-break-through-resistance-at-225/",
    "description": "As Binance Coin (BNB) grapples with a turbulent market, its recent struggles have highlighted a decline in network activity, fueling a lack of buying pressure. The latest roadblock at the formidable $225 resistance level has compounded the altcoin&#8217;s long-term bearish bias, casting a shadow over its prospects in the crypto landscape. Taking a closer look at BNB&#8217;s recent performance, the altcoin faced a flurry of selling pressure in mid-August, a critical moment that saw the key support level of $225 transform into a major resistance. This shift firmly established bearish dominance on the higher timeframes, shaking investor confidence in BNB&#8217;s ability to rally. However, not all hope was lost as bulls rallied from the nearby support level just above $205, providing a glimmer of optimism amidst the prevailing bearish sentiment. Related Reading: The ApeCoin Quandary: Why Additional Losses Could Persist BNB&#8217;s Price and On-Chain Metrics BNB&#8217;s price, currently hovering at $213 according to CoinGecko, reflects the ongoing volatility. Over the past 24 hours, BNB has witnessed a 4.5% decline, while its seven-day performance shows a modest gain of 0.4%. BNB price action today. Source: Coingecko The Relative Strength Index (RSI), after a recent surge that took it above the neutral 50, experienced a sharp drop from the 60-mark, signaling unstable demand and wavering investor sentiment. Examining BNB&#8217;s on-chain metrics, we find interesting developments among market speculators. Coinalyze data reveals that the futures market reacted strongly to the short-term pump on August 29, with a sharp drop in Open Interest (OI). This indicates that traders may be growing cautious as they navigate the unpredictable waters of the BNB market. Source: Coinalyze Prospects for the Future Looking ahead, the fate of BNB appears to hinge on the weekly time frame and the closing price of its charts. If the week concludes with a strong closure above the $230 mark, buyers may seize the initiative. This potential resurgence could pave the way for a further climb towards the $240 zone, offering a glimmer of hope for BNB enthusiasts. However, a separate report highlights that such a scenario remains relevant only until mid-September, and the market&#8217;s mood can shift rapidly. BNB market cap currently at $32.9 billion. Chart: TradingView.com Related Reading: Hedera Falls To Critical Support Level: Can HBAR Rebound This September? BNB faces significant challenges as it grapples with declining network activity and a persistent lack of buying pressure. The recent rejection at the $225 resistance level has cemented a bearish bias on the higher timeframes, leaving investors to closely monitor BNB&#8217;s price movements and on-chain metrics for signs of a potential turnaround. Amidst this uncertainty, market participants must remain vigilant and adaptable, as the cryptocurrency landscape is known for its rapid fluctuations and ever-changing dynamics. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Telegaon"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-01T13:00:34.000Z",
    "title": "Crypto Market Downturn Forces Investors to Leave Near Protocol (NEAR) and Zilliqa (ZIL) for Watchvestor (WVTR)",
    "url": "https://www.crypto-news-flash.com/crypto-market-downturn-forces-investors-to-leave-near-protocol-near-and-zilliqa-zil-for-watchvestor-wvtr/",
    "description": "<img width=\"512\" height=\"349\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-8.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-8.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-8-300x204.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Near Protocol (NEAR) and Zilliqa (ZIL) have been eye-catching for investors and crypto enthusiasts. With their exponential growth rate, the coins have been promising and assuring traders of maximum returns on investment. However, the tide has changed as the sudden crypto market downturn has created a different experience. Follow closely to understand the impact of [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-01T12:59:00.000Z",
    "title": "BlackRock’s Bitcoin ETF in Limbo: What’s Behind the SEC’s Latest Delay?",
    "url": "https://coinedition.com/blackrocks-bitcoin-etf-in-limbo-whats-behind-the-secs-latest-delay/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/The_@SECGov_has_delayed_the_@BlackRock_BTC_Spot_ETF_decision-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The U.S. Securities and Exchange Commission (SEC) has, once again, delayed its ruling on spot market Bitcoin exchange-traded funds (ETFs). Led by Gary Gensler, the Commission opted to postpone a decision on seven spot Bitcoin ETFs, which include BlackRock, Bitwise, VanEck, Fidelity, Valkyrie, Invesco Galaxy, and WisdomTree, citing the need for further evaluation. As per [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/blackrocks-bitcoin-etf-in-limbo-whats-behind-the-secs-latest-delay/\">BlackRock&#8217;s Bitcoin ETF in Limbo: What&#8217;s Behind the SEC&#8217;s Latest Delay?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-01T12:50:13.000Z",
    "title": "Maker Price Prediction 2023-2030: Will MKR reach $2000 Soon?",
    "url": "https://coinedition.com/maker-mkr-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Maker-MKR-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Maker (MKR) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Maker-MKR-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Maker-MKR-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Maker-MKR-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Maker-MKR-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Maker-MKR-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>What is Maker (MKR)? Maker (MKR) is the native token of the Maker Stablecoin Collateral Dai (SCD). It is an Ethereum ERC-20 token used for transactions within the open-sourced protocol. Although it started in 2014, its Stablecoin Dai was formed in December 2017 by Rune Christensen. Maker is a lending platform for decentralized applications (DEFI) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/maker-mkr-price-prediction/\">Maker Price Prediction 2023-2030: Will MKR reach $2000 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-01T12:45:52.000Z",
    "title": "Expanded BRICS To Command Over 40% of Global Crude Oil Output, Think Tank Dubs Move a ‘Warning’ to America",
    "url": "https://dailyhodl.com/2023/09/01/expanded-brics-to-command-over-40-of-global-crude-oil-output-think-tank-dubs-move-a-warning-to-america/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Stable-Global-Financial-Playing.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Stable-Global-Financial-Playing.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Stable-Global-Financial-Playing.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Stable-Global-Financial-Playing.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Stable-Global-Financial-Playing.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Stable-Global-Financial-Playing.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Stable-Global-Financial-Playing.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A Washington-based think tank believes that an expanded BRICS set to control a significant portion of global crude oil output is a shot across the bow for the United States. In a new blog post, Atlantic Council&#8217;s Jonathan Panikoff says that the addition of new countries to the economic bloc is a sign of &#8220;shifting [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/01/expanded-brics-to-command-over-40-of-global-crude-oil-output-think-tank-dubs-move-a-warning-to-america/\">Expanded BRICS To Command Over 40% of Global Crude Oil Output, Think Tank Dubs Move a ‘Warning’ to America</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]