[
  {
    "source": "Cointelegraph",
    "date": "2023-10-02T18:16:22.000Z",
    "title": "Crypto liquidity provider GSR receives regulatory approval in Singapore",
    "url": "https://cointelegraph.com/news/crypto-liquidity-provider-gsr-singapore-regulatory-approval",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/b3722c60-c499-43e4-a65c-fbc9f9840db8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The license allows GSR to provide crypto and fiat-related services to Singaporean residents and entities. </p>\n                    <p><p>Cryptocurrency trading firm and liquidity provider GSR's Singaporean subsidiary, GSR Markets Pte. Ltd, has <a href=\"https://www.businesswire.com/news/home/20231002794121/en/GSR-Receives-In-Principle-Approval-from-the-Monetary-Authority-of-Singapore\" target=\"_blank\" rel=\"noopener nofollow\">received</a> an in-principal approval from the Monetary Authority of Singapore (MAS) for a Major Payment Institution (MPI) license. </p><p>\"GSR is proud to have met the rigorous admission requirements set by MAS and will be working diligently towards a full license,\" the firm said in its Oct. 2 announcement. GSR plans to use its Singaporean subsidiary as a hub for expanding into the Asia-Pacific region. </p><p>An MPI license allows institutions to provide crypto and fiat-related services to residents of Singapore. Licensed firms are authorized to conduct payment services without being subjected to single transaction limits of 3 million Singaporean Dollars ($2.2 million) and monthly limits of 6 million Singaporean Dollars ($4.4 million). \"MAS has led the way providing a clear framework for digital asset utility,\" said Xin Song, COO of GSR.</p><p>Founded in 2013 in New Jersey, the firm conducts over-the-counter crypto trading alongside derivatives, market making, and venture capital investments. The firm holds Money Service Business licenses across several states.</p><p>On Oct. 1, Cointelegraph reported that crypto exchange Coinbase <a href=\"https://cointelegraph.com/news/coinbase-secures-payment-license-singapore\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinbase-secures-payment-license-singapore/amp\">obtained a full MPI license</a> from the MAS. The regulatory approval allows Coinbase to offer digital token services to both individuals and institutions in Singapore. </p><p>According to <a href=\"https://www.coinbase.com/blog/coinbase-obtains-major-payment-institution-licence-from-the-monetary\" target=\"_blank\" rel=\"noopener nofollow\">data</a> provided by Coinbase, 25% of surveyed Singaporeans consider crypto to be the future of finance, with 32% of respondents claiming that they are either current or past owners of crypto. The city-state is home to over Web3 700 companies. </p><p><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/dao-hyped-voting-decentralization/\">Are DAOs overhyped and unworkable? Lessons from the front lines</a></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-02T18:38:43.000Z",
    "title": "New AI Method Shows Promise in Detecting Signs of Life on Other Planets",
    "url": "https://www.cryptopolitan.com/ai-method-in-detecting-signs-of-life/",
    "description": "Researchers have developed an artificial intelligence (AI) method that can detect subtle molecular patterns indicating biological signals, even in ancient samples. The system boasts a 90% accuracy rate and holds the potential to be used in robotic space explorers, including lunar and Martian landers, as well as spacecraft orbiting potentially habitable worlds. Scientists have made ... <a title=\"New AI Method Shows Promise in Detecting Signs of Life on Other Planets\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-method-in-detecting-signs-of-life/\" aria-label=\"More on New AI Method Shows Promise in Detecting Signs of Life on Other Planets\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-02T18:27:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-02T18:15:17.000Z",
    "title": "The Evolution of AI-Generated Content",
    "url": "https://www.cryptopolitan.com/the-evolution-of-ai-generated-content/",
    "description": "In the realm of marketing, Artificial Intelligence (AI) once held the promise of a revolution, offering the potential to generate content at unparalleled speeds and reduced costs. However, initial enthusiasm waned as AI-generated content often lacked the human touch and emotional connection essential to engage readers and drive conversions. Nevertheless, a new era is dawning, ... <a title=\"The Evolution of AI-Generated Content\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-evolution-of-ai-generated-content/\" aria-label=\"More on The Evolution of AI-Generated Content\">Read more</a>"
  }
]