[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T19:40:00.000Z",
    "title": "VeChain Price Prediction 2023-2031: What’s the Growth Potential of VET?",
    "url": "https://www.cryptopolitan.com/vechain-price-prediction/",
    "description": "VeChain Price Prediction 2023-2032 Since its launch, Vechain’s focus has been building technologies that solve obstacles impeding the mass adoption of blockchain technology. Two months ago, one of the most important pieces of technology in this mission was officially launched — VORJ. VORJ is a no-code Web3-as-a-Service platform that enables anyone to create, deploy and ... <a title=\"VeChain Price Prediction 2023-2031: What&#8217;s the Growth Potential of VET?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/vechain-price-prediction/\" aria-label=\"More on VeChain Price Prediction 2023-2031: What&#8217;s the Growth Potential of VET?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-28T19:54:45.000Z",
    "title": "100k OpenAI credentials on sale for crypto",
    "url": "https://crypto.news/100k-openai-credentials-on-sale-for-crypto/",
    "description": "In a startling revelation, Group-IB, a leading cybersecurity firm based in Singapore, has identified over 100,000 devices infected with stealer malware that contain saved ChatGPT credentials."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T20:00:09.000Z",
    "title": "Michael Saylor Doubles Down On Bitcoin, Adds 12,333 BTC To MicroStrategy’s Holdings",
    "url": "https://www.newsbtc.com/bitcoin-news/michael-saylor-doubles-down-on-bitcoin-adds-12333-btc-to-microstrategys-holdings/",
    "description": "MicroStrategy, a publicly traded software company, has once again invested heavily in Bitcoin, adding another 12,333 BTC to its already substantial holdings.  The purchase, which was announced by the company&#8217;s former CEO Michael Saylor, cost around $347 million at an average price of $28,136 per Bitcoin. MicroStrategy Goes All-In On Bitcoin As of June 28th, MicroStrategy now owns a total of 152,333 Bitcoin, which were acquired at an average purchase price of $29,668, for a total cost of approximately $4.52 billion. This latest purchase reaffirms the company&#8217;s bullish stance on BTC, with MicroStrategy now owning one of the largest Bitcoin holdings of any publicly traded company. MicroStrategy has acquired an additional 12,333 BTC for ~$347.0 million at an average price of $28,136 per #bitcoin. As of 6/27/23 @MicroStrategy hodls 152,333 $BTC acquired for ~$4.52 billion at an average price of $29,668 per bitcoin. $MSTR https://t.co/joHo1gEnR0 — Michael Saylor⚡️ (@saylor) June 28, 2023 MicroStrategy&#8217;s decision to invest heavily in Bitcoin has been a topic of discussion and debate within both the traditional financial world and the cryptocurrency community. The company&#8217;s former CEO, Michael Saylor, has been a vocal advocate for BTC, frequently extolling its virtues as a store of value and an inflation hedge. Related Reading: Cardano Set To Be Delisted On Huobi – Will It Dent ADA Price? MicroStrategy&#8217;s initial purchase of Bitcoin in August 2020 was seen as a bold move, given the cryptocurrency&#8217;s reputation for volatility. However, the company&#8217;s investment has paid off handsomely, with the value of its Bitcoin holdings more than doubling in value since its initial purchase. MicroStrategy&#8217;s latest BTC purchase, while significant, is not the first time the company has added to its holdings. In fact, the company has been on a buying spree, having purchased over 100,000 Bitcoin since August 2020. This has made MicroStrategy one of the largest holders of Bitcoin in the world. Nevertheless, the company&#8217;s decision to invest so heavily in BTC has not been without criticism. Some experts have questioned the wisdom of investing such a large amount of capital into a single asset, particularly one as volatile as Bitcoin.  Others have expressed concern over the potential regulatory risks that come with holding such a large amount of cryptocurrency. Despite these concerns, Michael Saylor remains bullish on Bitcoin and continues to advocate for its adoption as a mainstream asset. He has even gone so far as to offer BTC as a form of compensation to MicroStrategy&#8217;s board of directors, demonstrating his commitment to the cryptocurrency&#8217;s long-term prospects. Related Reading: Whale Trades LINK And BNB For PEPE And ETH In High-Value Transaction Overall, MicroStrategy&#8217;s investment in BTC represents a significant shift in the way that traditional companies view cryptocurrencies. While some may view the company&#8217;s actions as risky or imprudent, others see it as a bold and visionary move that could pay off handsomely in the long run. Only time will tell which of these viewpoints proves to be correct. At present, Bitcoin, the leading cryptocurrency in terms of market capitalization, has been experiencing a decline in value but has managed to maintain the $30,000 threshold. As of now, BTC is being traded at $30,100, indicating a 2% decrease in the past 24 hours. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-28T20:00:56.000Z",
    "title": "Fundstrat’s Tom Lee Calls Bitcoin Battle Tested, Says There’s Reason To be Optimistic on BTC",
    "url": "https://dailyhodl.com/2023/06/28/fundstrats-tom-lee-calls-bitcoin-battle-tested-says-theres-reason-to-be-optimistic-on-btc/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/tom-lee-calls-bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/tom-lee-calls-bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/tom-lee-calls-bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/tom-lee-calls-bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/tom-lee-calls-bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/tom-lee-calls-bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/tom-lee-calls-bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Fundstrat Global Advisors’ managing partner Tom Lee says that he is optimistic about the future of Bitcoin (BTC) after the crypto king has survived many challenges. In a new CNBC “Squawk Box” interview, Lee says that Bitcoin’s ability to perform well despite a regulatory crackdown indicates the digital asset is here to stay. “It&#8217;s pretty [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/28/fundstrats-tom-lee-calls-bitcoin-battle-tested-says-theres-reason-to-be-optimistic-on-btc/\">Fundstrat&#8217;s Tom Lee Calls Bitcoin Battle Tested, Says There&#8217;s Reason To be Optimistic on BTC</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-28T19:55:30.000Z",
    "title": "KuCoin Rolls Out Mandatory KYC Rules for All Customers To ‘Embrace Regulation’",
    "url": "https://dailyhodl.com/2023/06/28/kucoin-rolls-out-mandatory-kyc-rules-for-all-customers-to-embrace-regulation/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/kucoin-dispelling-fud.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/kucoin-dispelling-fud.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/kucoin-dispelling-fud.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/kucoin-dispelling-fud.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/kucoin-dispelling-fud.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/kucoin-dispelling-fud.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/kucoin-dispelling-fud.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A major crypto exchange platform is adding compulsory Know Your Customer (KYC) rules for its customers as a means of embracing regulations. According to a new press release, KuCoin, a Seychelles-based crypto exchange, will be rolling out mandatory KYC authentication rules for its customers starting on July 15, 2023. The change would force current customers [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/28/kucoin-rolls-out-mandatory-kyc-rules-for-all-customers-to-embrace-regulation/\">KuCoin Rolls Out Mandatory KYC Rules for All Customers To ‘Embrace Regulation’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]