[
  {
    "source": "Cointelegraph",
    "date": "2024-04-08T20:56:28.000Z",
    "title": " Bitcoin halving could be a ‘sell-the-news’ event, at least for a few months ",
    "url": "https://cointelegraph.com/news/bitcoin-halving-could-be-a-sell-the-news-event-at-least-for-a-few-months",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvNGVmMWM3OTgtNDIxYy00ZDNjLTlkMTItMjkwZTg1NDMwY2Q1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Analysts say Bitcoin’s halving could be a sell-the-news event as short-term speculators and BTC ETF purchasers book profits.</p>\n                    <p><p>Many crypto traders expect the <a href=\"https://cointelegraph.com/news/bitcoin-halving-2024\">Bitcoin halving </a>event to be a pivotal moment in 2024, that significantly impacts the crypto market. However, analysts at Steno Research anticipate that it will be a “buy the rumor, sell the news” event. </p><p>There have been three halving events in <a href=\"https://cointelegraph.com/history-of-crypto\">Bitcoin’s history</a>, reducing miner rewards from 50 BTC to 25 BTC in 2012, then to 12.5 BTC in 2016, and 6.25 BTC at the last halving on May 11, 2020. </p><p>Steno Research says that BTC is likely to repeat 2016 halving where selling pressure piled up to four months later.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-halving-could-be-a-sell-the-news-event-at-least-for-a-few-months\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-08T20:43:51.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">A new viral wave of memecoins could upend the likes of Dogecoin and Shiba Inu in the current crypto market cycle, according to a leading venture capitalist. According to CryptoQuant, Bitcoin price must stay above $80,000 after the halving if miners are to remain profitable. Meanwhile, Coinbase’s layer-2 network Base has crossed $4 billion in total value locked as its 30-day transactions outpaced Ethereum and Arbitrum. </p><p>Crypto venture capital founder Andrew Kang <a href=\"https://cointelegraph.com/news/new-profitable-memecoins-crypto-vc-founder-dogecoin-politics\">believes memecoins</a> have carved out a strong niche in the digital asset space, and could be a major driver of profitability in the current market cycle. </p><p>In an April 7 post on X, Kang, who founded Mechanism Capital, likened memecoins to “culture coins,” and said the new class of tokens could exceed Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) and Shiba Inu (<a href=\"https://cointelegraph.com/shiba-inu-price-index\">SHIB</a>) in popularity.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-04-08T21:00:13.000Z",
    "title": "BlackRock and Fidelity’s Bitcoin ETFs make history with record streak of inflows",
    "url": "https://cryptoslate.com/blackrock-and-fidelitys-bitcoin-etfs-make-history-with-record-streak-of-inflows/",
    "description": "<p>BlackRock&#8217;s iShares Bitcoin Trust (IBIT) and the Fidelity Wise Origin Bitcoin Trust (FBTC) have broken another record by becoming two of the top 20 exchange-traded funds with the longest streak of continuous inflows of all time. Bloomberg ETF analyst Eric Balchunas observed on April 8 that the two spot Bitcoin ETFs have seen continuous inflows since [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/blackrock-and-fidelitys-bitcoin-etfs-make-history-with-record-streak-of-inflows/\">BlackRock and Fidelity&#8217;s Bitcoin ETFs make history with record streak of inflows</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-08T21:00:38.000Z",
    "title": "Expert Maps Out Timeline For The XRP Price To Cross $1,000",
    "url": "https://www.newsbtc.com/analysis/xrp/timeline-xrp-price-cross-1000/",
    "description": "Crypto Expert BarriC has raised eyebrows with his recent analysis of the XRP price, in which he stated that the crypto token could rise to $1,000. As part of his analysis, he also elaborated on why this price level is attainable and not an “arbitrary number” he has pulled out for fun.  When Will The XRP Price Rise To $1,000? BarriC suggested in an X (formerly Twitter) post that the XRP price will rise to $1,000 in the next five to ten years. He explained that this would happen due to the new money flowing into the crypto space during that period. Specifically, he alluded to the “400 trillion dollars of personal wealth” and also institutional money yet to come into crypto, which could help drive up XRP’s price.  Related Reading: $115-Million Bitcoin Whale Wakes Up From 10-Year Slumber – What’s Next? To drive home his point, he drew his followers’ attention to the Spot Bitcoin ETFs and how they have so far contributed to Bitcoin’s bullish momentum and price surge. As such, he believes that XRP could also benefit from such institutional demand once institutions begin to show interest in other crypto ETFs like a potential XRP Spot ETF. BarriC boldly claimed that to say that XRP will not hit $1,000 “is to say that the entire crypto market as a whole will never grow or evolve or that new money will not come in.” He also suggested that the only way the XRP price wouldn’t hit $1,000 was if Ripple somehow failed in everything they had set out to do.  However, he believes all that is unlikely and that the crypto space and Ripple will continue to grow the same way they have since 2016, even though he admitted that people “aren’t ready to fathom price action like a $1,000 $XRP.” He added that this is the same way no one in 2016 could have fathomed Bitcoin at $74,000, but it eventually happened.  XRP To $2,500 Is Also A Possibility Crypto analyst Egrag Crypto once raised the possibility of the XRP price hitting $2,500 by 2029 while sharing his encounter with a top banker. Egrag mentioned that the banker told him XRP would hit this price level, and he agreed. Like BarriC, Egrag claimed that the banker spoke about how ETH hitting $2,500 seemed impossible then, but it happened.  Related Reading: ADA Price Ready To Soar As Cardano Network Hits New 88.6 Million Transaction Milestone However, XRP YouTuber Moon Lambo will have reservations about these price predictions. He once suggested that there isn’t enough money in the world to drive XRP’s price to four or five digits. He also noted that any new money that flows into crypto won’t only go into the XRP ecosystem. As such, one can’t base such an ambitious price prediction solely on money that has yet to come into crypto.  At the time of writing, the XRP price is trading at around $0.60, up in the last 24 hours according to data from CoinMarketCap. XRP price sitting at $0.6 &#124; Source: XRPUSD on Tradingview.com Featured image from CryptoRank, chart from Tradingview.com"
  }
]