[
  {
    "source": "CoinDesk",
    "date": "2023-08-15T18:15:23.000Z",
    "title": "Binance to Shut Down Crypto Payments Service Amid Refocus On Core Products",
    "url": "https://www.coindesk.com/business/2023/08/15/binance-to-shut-down-buy-and-sell-service-amid-refocus-on-core-products/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto exchange Binance has decided to shut down its buy-and-sell service Binance Connect, formerly known as Bifinity, just one year after its launch, the company said in a statement."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-15T17:47:37.000Z",
    "title": "Scaramucci's SkyBridge 'Strongly Disagrees' With Grayscale on Bitcoin ETF",
    "url": "https://decrypt.co/152572/skybridge-anthony-scaramucci-grayscale-bitcoin-spot-etf-sec-applications",
    "description": "SkyBridge claims that Coinbase should be more than adequate as a surveillance-sharing partner."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-15T17:21:51.000Z",
    "title": "Mired in Controversy, A Film Gives HEX and Richard Heart the Hollywood Treatment",
    "url": "https://decrypt.co/152557/documentary-film-gives-hex-richard-heart-hollywood-treatment",
    "description": "“The Highest of Stakes,” a new documentary, attempts to give voice to advocates and critics of the controversial HEX founder. But how much is really up for debate?"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-15T18:20:41.000Z",
    "title": "Eagerly-awaited Jacobi Bitcoin ETF sees lukewarm reception on debut",
    "url": "https://cryptoslate.com/eagerly-awaited-jacobi-bitcoin-etf-sees-lukewarm-reception-on-debut/",
    "description": "<p>Early indications show that Europe&#8217;s &#8220;first&#8221; Bitcoin (BTC) exchange-traded fund (ETF), Jacobi Bitcoin ETF, is not generating much interest as anticipated, as its transaction volume of only four transactions during the first day of its trading. Data from Euronext shows that the Jacobi ETF recorded only four transactions, with a volume of 113 as of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/eagerly-awaited-jacobi-bitcoin-etf-sees-lukewarm-reception-on-debut/\">Eagerly-awaited Jacobi Bitcoin ETF sees lukewarm reception on debut</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-15T17:45:00.000Z",
    "title": "Navigating the Best PR Agencies in the Blockchain Realm",
    "url": "https://cryptodaily.co.uk/2023/08/navigating-the-best-pr-agencies-in-the-blockchain-realm",
    "description": "<p class=\"s5\">The enduring enigma around the inability of most contemporary crypto enterprises to surpass their competitors endures due to a fundamental overlook in understanding the importance of cryptocurrency marketing agencies. It is high time we acknowledged the crucial significance of crypto marketing agencies, whose function is essential in promoting innovation and engaging the intended audience.</p>\n<p class=\"s5\">Ensuring the dissemination of a project's narrative to the appropriate audience is of similar significance compared to creating a compelling whitepaper and roadmap. This means achieving success is contingent upon these fundamental principles: Building a project that solves a problem and comprehending the intricate mechanics of marketing.</p>\n<p class=\"s5\">To establish a connection between technological expertise and successful marketing strategies, companies need to understand cryptocurrency marketing agencies' significant contribution to every crypto project's success. In this article, we'd look at key crypto marketing firms that have proved reliable over the years in the crypto space.</p>\nCrypto Marketing Agencies With Proven Track Records\nIdolMe Agency\n<p class=\"s5\">Empowering tech and crypto companies since 2013, IdolMe Agency stands as an influential PR and marketing lab. The team's expertise unlocks early-stage project potential, propelling crypto businesses into market leaders. Also, their services encompass analytics, brand promotion, AMA sessions, and influence marketing across various social networks.</p>\n<p class=\"s5\">IdolMe Agency understands that tailored strategies for startups and corporations reflect a deep understanding of this fast-evolving industry. The team engages in unique content strategies that range from op-eds to social media posts, cultivating strong project communities. They also engage in vast influencer and media contacts that ensure features and releases resonate with clients' target audiences.</p>\nCoinband\n<p class=\"s5\">Coinband is a leading marketing agency for Web3 &amp; Crypto &amp; NFT projects. The company has cutting-edge client-side expertise to create better solutions for their client's marketing challenges. Their client gets access to the best financial and crypto media and influencers. The team engages in best practices in content management and the web3 community to enable their clients to have a complete marketing solution.</p>\n<p class=\"s5\">Over the past year, the team has worked with projects such as ByBit, OKX, NEAR, ChainGPT, and LayerAI and ranked among the best crypto marketing companies. By working with Coinband, clients can access 400+ Crypto &amp; Finance media outlets and exclusive publishing opportunities.</p>\nBlockfluence\n<p class=\"s5\">Blockfluence, accessible via blockfluence.io, is a premier agency specializing in crypto marketing and press services. Catering to the unique demands of the cryptocurrency world, they extend their expertise to crypto projects, ensuring they gain the visibility and traction they deserve.</p>\n<p class=\"s5\">Moreover, Blockfluence strongly emphasizes personal branding, recognizing the importance of positioning founders and thought leaders at the forefront of the crypto movement. With a blend of strategic marketing campaigns, impactful press releases, and bespoke branding solutions, Blockfluence is the trusted partner for crypto innovators seeking to establish a formidable presence in the competitive digital domain.</p>\nCTRL-PR\n<p class=\"s5\">CTRL-PR gets your story out there. The firm is a PR Agency specializing in developing modern and innovative PR solutions for startup businesses worldwide. CTRL-PR offers success-based, convenient, and cost-effective media and PR services. CTRL-PR specializes in content marketing, press releases, editorial media placements, tech PR, crypto PR, success-based PR, and SEO.</p>\n<p class=\"s5\">With over 100+ effective marketing campaigns, the team assists companies in expanding their global presence by connecting them with influential media outlets and KOLs. They are passionate about creating a difference for clients and helping crypto, fintech, NFTs, and Blockchain ventures to establish strong audience relationships.&nbsp;</p>\nFINPR Agency&nbsp;\n<p class=\"s5\">FINPR Agency is counted amongst the top Dubai-based crypto marketing firms, owing to its profoundly experienced team. Although located in the Middle East, FINPR covers the whole world, especially the United States, Europe, Asia Pacific, and (of course) MENA.</p>\n<p class=\"s5\">Projects and firms prefer FINPR Agency due to its ever-expanding range of services, including; Crypto PR, Influencer marketing, Crypto Advertising, Community management, Crypto SEO, Marketing strategy creation, Crypto exchange listings, and Crypto copywriting.</p>\nFinal Thoughts\n<p class=\"s5\">In the world of cryptocurrency, there's a puzzle we need help figuring out: why do so many new crypto businesses struggle to do better than their rivals? The answer might be that they're not paying enough attention to something important &ndash; companies that help promote cryptocurrencies; crypto marketing agencies.</p>\n<p class=\"s5\">It's time we realize how crucial these agencies are. They're like the people who tell others about a new story or idea. It's not enough to make something cool &ndash; you have to help people understand why it's cool, too. Success comes from knowing how the market works and being creative. Companies must connect their technical skills with marketing. That's where crypto marketing agencies come in. They're like friends who make sure everyone knows about the cool thing you made.</p>\n<p class=\"s10\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-15T18:00:10.000Z",
    "title": "Michael Burry Bets $1.6 Billion Against Market: ‘Big Short’ Investor Takes Bearish Stance on S&P 500 and Nasdaq",
    "url": "https://news.bitcoin.com/michael-burry-bets-1-6-billion-against-market-big-short-investor-takes-bearish-stance-on-sp-500-and-nasdaq/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/9089999-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/9089999-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/9089999-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/9089999-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/9089999-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/9089999-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/9089999-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/9089999.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In filings with securities authorities released on Monday, renowned hedge fund manager Michael Burry, whose exploits were famously captured in the film &#8220;The Big Short,&#8221; took a bearish stance on the market. Burry&#8217;s Scion Asset Management shorted the S&#38;P 500 and Nasdaq 100 for the close of the second quarter, wagering approximately $1.6 billion on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T18:37:09.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T18:32:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past month, BNB, and the entire crypto market have once again lost momentum. BNB prices have dropped by 6.46% since touching $260 in July 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin price is ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T18:14:03.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain‘s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T18:13:29.000Z",
    "title": "EEOC Makes Landmark Move with First-Ever AI-Based Antidiscrimination Settlement",
    "url": "https://www.cryptopolitan.com/eeoc-moves-with-ai-based-antidiscrimination/",
    "description": "In a groundbreaking development in the realm of employment law, the Equal Employment Opportunity Commission (EEOC) has recently entered into what is being hailed as the &#8220;First-Ever AI-Based Antidiscrimination Settlement.&#8221; This unprecedented settlement marks a significant step forward in leveraging technology to combat workplace discrimination. At the heart of this landmark agreement is Joseph C. ... <a title=\"EEOC Makes Landmark Move with First-Ever AI-Based Antidiscrimination Settlement\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eeoc-moves-with-ai-based-antidiscrimination/\" aria-label=\"More on EEOC Makes Landmark Move with First-Ever AI-Based Antidiscrimination Settlement\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T17:56:03.000Z",
    "title": "Dialpad Unveils DialpadGPT, A Revolutionary AI for Enterprises",
    "url": "https://www.cryptopolitan.com/dialpad-unveils-dialpadgpta/",
    "description": "Dialpad, Inc., a leading Ai-Powered Customer Intelligence Platform, has launched DialpadGPT, a domain-specific large language model (LLM) designed to automate tasks for enterprises of all sizes. This innovative AI aims to enhance customer service, sales, and recruiting experiences by harnessing the power of AI automation and AI assistance at scale. A game-changer in the AI ... <a title=\"Dialpad Unveils DialpadGPT, A Revolutionary AI for Enterprises\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dialpad-unveils-dialpadgpta/\" aria-label=\"More on Dialpad Unveils DialpadGPT, A Revolutionary AI for Enterprises\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T17:55:31.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T17:52:29.000Z",
    "title": "Cybercriminals Exploiting AI and ML Technologies for Malicious Purposes",
    "url": "https://www.cryptopolitan.com/cybercriminals-exploiting-ai-and-ml/",
    "description": "A new research paper jointly produced by Trend Micro, the United Nations Interregional Crime and Justice Research Institute (UNICRI), and Europol reveals how cybercriminals are exploiting artificial intelligence (AI) and machine learning (ML) technologies for malicious purposes. AI and ML in business AI and ML are rapidly fueling the development of a more dynamic world. ... <a title=\"Cybercriminals Exploiting AI and ML Technologies for Malicious Purposes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cybercriminals-exploiting-ai-and-ml/\" aria-label=\"More on Cybercriminals Exploiting AI and ML Technologies for Malicious Purposes\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T17:42:08.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T17:39:01.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices to consider when investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T17:34:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-15T17:38:50.000Z",
    "title": "NvirWorld appoints former Binance strategy manager as CMO for web3 expansion",
    "url": "https://crypto.news/nvirworld-appoints-former-binance-strategy-manager-as-cmo-for-web3-expansion/",
    "description": "NvirWorld, a web3 solution project, has announced the hiring of Jason Y., a former strategy manager at Binance, to enhance its market exposure and global competitiveness"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-15T18:00:31.000Z",
    "title": "This Event Causes Bitcoin Traders’ Sentiment To Rise, Will BTC Surpass $30,000?",
    "url": "https://www.newsbtc.com/bitcoin-news/this-event-causes-bitcoin-traders-sentiment-to-rise-will-btc-surpass-30000/",
    "description": "The Bitcoin price continues to compress around its current levels, but during today’s trading session, there was an uptick in volatility. The rise in this metric could hint at a shift in the narratives influencing BTC’s price action. Related Reading: Bitcoin Prediction: Crypto Analyst Forecasts New ATH by 2024 – Can It Happen? As of this writing, Bitcoin trades at $29,300 with sideways movement in the last 24 hours. In the previous seven days, the cryptocurrency saw similar action pushing other assets in a similar direction or no direction as the sector flatlines in the short term. Bitcoin ETF Becomes Dominant Narrative In Crypto Market? In a recent market update, crypto analysis firm Blofin pointed to an uptick in market sentiment. Coupled with a rise in volatility, market participants are reacting to the potential announcement from the US Securities Exchange Commission (SEC) around a spot Bitcoin ETF. The Commission is set to rule on asset manager Grayscale’s petition to transform their Grayscale Bitcoin Trust (GBTC) into an ETF. The decision was supposed to come out today, Blofin stated, but it could drag on until this Friday, August 18th. If the SEC postpones the decision for any reason, as it did with Ark’s petition, the market will likely keep moving sideways. In that sense, development around the ETF decision is gaining strength over macroeconomic dynamics. This change in dynamics is more evident in the derivatives sector, with options traders becoming more bullish for the coming months. Blofin noted the following on this dynamic: (…) The news above (on the Bitcoin ETF approval) has promoted the rapid rise of short-term bullish sentiment and uncertainty in the market (…). It appears that investors are waiting for good news related to the spot Bitcoin ETF. And “smart” traders are positioning accordingly. The report notes that the open interest for options contracts is skewed to the call (buy) side. Related Reading: XRP Price at Potentially Significant Turning Point, Key Support Nearby As data from the derivatives platform Deribit shows, traders are betting that the price of Bitcoin will rise above $30,000 by the end of August or September. As seen on the chart below, 57,000 contracts will expire by the end of this month and 90,700 next month. Coupled with the rise in Open Interest skewed to the call side, the chart above shows that traders are betting on a Bitcoin rally above $30,000 to $40,000. The spot BTC ETF decision will move the market, particularly at the end of August and September. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T17:55:15.000Z",
    "title": "BREAKING: SEC Delays All Bitcoin ETF Decisions to 2024 – Will It Push BTC Price to $20,000? Report",
    "url": "https://www.crypto-news-flash.com/breaking-sec-delays-all-bitcoin-etf-decisions-to-2024-will-it-push-btc-price-to-20000-report/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-sec-delays-all-bitcoin-etf-decisions-to-2024-will-it-push-btc-price-to-20000-report",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-20.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-20.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-20-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-20-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The US SEC extends Bitcoin ETF approval decision to early 2024, providing a 240-day window for evaluation. Leading asset management firms such as BlackRock and ARK Invest await approval, prompting renewed interest in crypto ETFs. Spotlight on SEC and Crypto ETFs The United States Securities and Exchange Commission (SEC), a pivotal regulatory authority in the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T17:33:32.000Z",
    "title": "Grayscale Bitcoin Spot ETF Decision from SEC Expected This Friday – Is Now the Time to Fill Your Bags? Report",
    "url": "https://www.crypto-news-flash.com/grayscale-bitcoin-spot-etf-decision-from-sec-expected-this-friday-is-now-the-time-to-fill-your-bags-report/?utm_source=rss&utm_medium=rss&utm_campaign=grayscale-bitcoin-spot-etf-decision-from-sec-expected-this-friday-is-now-the-time-to-fill-your-bags-report",
    "description": "<img width=\"1000\" height=\"666\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The Grayscale and SEC Bitcoin ETF legal tussle is nearing its end. Industry analysts are projecting an end this week. A verdict is expected this week from the D.C. Circuit Court of Appeals on the lawsuit between investment management firm Grayscale and the United States Securities and Exchange Commission (SEC). After so much speculation about [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-15T18:36:00.000Z",
    "title": "Michael Burry Shorts Stock Market With $1.6 Billion Worth Put Options",
    "url": "https://coinedition.com/michael-burry-shorts-stock-market-with-1-6-billion-worth-put-options/",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://coinedition.com/wp-content/uploads/2022/09/businessman-holding-tablet-showing-holographic-graphs-stock-market-statistics-gain-profits-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/businessman-holding-tablet-showing-holographic-graphs-stock-market-statistics-gain-profits-scaled.jpg 2560w, https://coinedition.com/wp-content/uploads/2022/09/businessman-holding-tablet-showing-holographic-graphs-stock-market-statistics-gain-profits-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/businessman-holding-tablet-showing-holographic-graphs-stock-market-statistics-gain-profits-1024x576.jpg 1024w, https://coinedition.com/wp-content/uploads/2022/09/businessman-holding-tablet-showing-holographic-graphs-stock-market-statistics-gain-profits-768x432.jpg 768w, https://coinedition.com/wp-content/uploads/2022/09/businessman-holding-tablet-showing-holographic-graphs-stock-market-statistics-gain-profits-1536x864.jpg 1536w, https://coinedition.com/wp-content/uploads/2022/09/businessman-holding-tablet-showing-holographic-graphs-stock-market-statistics-gain-profits-2048x1152.jpg 2048w, https://coinedition.com/wp-content/uploads/2022/09/businessman-holding-tablet-showing-holographic-graphs-stock-market-statistics-gain-profits-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/businessman-holding-tablet-showing-holographic-graphs-stock-market-statistics-gain-profits-600x337.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/businessman-holding-tablet-showing-holographic-graphs-stock-market-statistics-gain-profits-696x391.jpg 696w, https://coinedition.com/wp-content/uploads/2022/09/businessman-holding-tablet-showing-holographic-graphs-stock-market-statistics-gain-profits-1392x783.jpg 1392w, https://coinedition.com/wp-content/uploads/2022/09/businessman-holding-tablet-showing-holographic-graphs-stock-market-statistics-gain-profits-1068x601.jpg 1068w, https://coinedition.com/wp-content/uploads/2022/09/businessman-holding-tablet-showing-holographic-graphs-stock-market-statistics-gain-profits-1920x1080.jpg 1920w, https://coinedition.com/wp-content/uploads/2022/09/businessman-holding-tablet-showing-holographic-graphs-stock-market-statistics-gain-profits-747x420.jpg 747w, https://coinedition.com/wp-content/uploads/2022/09/businessman-holding-tablet-showing-holographic-graphs-stock-market-statistics-gain-profits-1493x840.jpg 1493w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" /><p>The “Big Short” star Michael Burry has reportedly shorted the market with $1.6 billion. On August 14, it was reported that Scion Asset Management, under Burry&#8217;s direction, acquired put options worth approximately $739 million for the Invesco QQQ Trust ETF and separate put options valued at around $886 million for the SPDR S&#38;P 500 ETF. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/michael-burry-shorts-stock-market-with-1-6-billion-worth-put-options/\">Michael Burry Shorts Stock Market With $1.6 Billion Worth Put Options</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-15T17:28:00.000Z",
    "title": "Solana (SOL) May Be Showing Promising Signs of a Long Rally",
    "url": "https://coinedition.com/solana-sol-may-be-showing-promising-signs-of-a-long-rally/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/SOL-considering-how-its-performing-better-in-the-market-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>For the past few weeks, the cryptocurrency market has continued to continue its dynamic ebb and flow trend. Like Bitcoin (BTC), most altcoins have also traded tightly as the market continues to exhibit low volatility. However, unlike the other altcoins, Solana (SOL) seems to have decoupled from the trend. According to CoinMarketCap, SOL has gained [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/solana-sol-may-be-showing-promising-signs-of-a-long-rally/\">Solana (SOL) May Be Showing Promising Signs of a Long Rally</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-15T18:05:09.000Z",
    "title": "Coinbase, Binance and Kraken All Announce Support for New Layer-1 Crypto Project",
    "url": "https://dailyhodl.com/2023/08/15/coinbase-binance-and-kraken-all-announce-support-for-new-layer-1-crypto-project/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/layer-after-chinese-into.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/layer-after-chinese-into.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/layer-after-chinese-into.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/layer-after-chinese-into.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/layer-after-chinese-into.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/layer-after-chinese-into.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/layer-after-chinese-into.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Three top cryptocurrency exchanges are simultaneously announcing support for a new layer-1 crypto project. In new statements, Coinbase, Binance, and Kraken all announce support for Sei (SEI) on the Sei Network. Says US-based exchange Coinbase, &#8220;Coinbase will add support for Sei (SEI) on the Sei network. Do not send this asset over other networks or your [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/15/coinbase-binance-and-kraken-all-announce-support-for-new-layer-1-crypto-project/\">Coinbase, Binance and Kraken All Announce Support for New Layer-1 Crypto Project</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]