[
  {
    "source": "CryptoGlobe",
    "date": "2023-06-09T22:47:00.000Z",
    "title": "Ancient Bitcoin Whale Comes Back to Life, Moves $38 Million After Making 13,500% Gain",
    "url": "https://www.cryptoglobe.com/latest/2023/06/ancient-bitcoin-whale-comes-back-to-life-moves-38-million-after-making-13500-gain/",
    "description": "A Bitcoin wallet that had been dormant for over 10 years has, in a move that caught the attention of the wider cryptocurrency community, sudden sprung to life, transferring a substantial 1,432.93 Bitcoin, worth around $38.1 million, to a new address. According to on-chain analytics firm Lookonchain, the whale’s wallet had received its coins back […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T23:00:47.000Z",
    "title": "HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?",
    "url": "https://www.cryptopolitan.com/hbar-price-prediction/",
    "description": "HBAR Price Prediction 2023-2032 Hedera Hashgraph is a trending cryptocurrency focused on providing a sustainable, enterprise-grade blockchain.&#160; The asset has been performing extremely well recently, prompting investors everywhere to search for a Hedera Hashgraph price prediction. So that is a heads-up in crypto winter despite the doom which tends to pull everyone else connected to ... <a title=\"HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hbar-price-prediction/\" aria-label=\"More on HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-09T23:01:35.000Z",
    "title": "Bitcoin “Throwback” Could Trigger Flawless Technical Bottom Formation",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-throwback-flawless-technical-bottoming-formation/",
    "description": "Bitcoin price is struggling after failing to make it above resistance last month. Combined with the recent pressure on the crypto market applied by the US SEC, things aren&#8217;t looking great for bulls. However, the correction has stopped precisely at a key level that could indicate a &#8220;throwback&#8221; is in process. If confirmed, BTCUSD could trade above $40,000 per coin in the near future. A Closer Look At The Technical Bottom Formation In Crypto The study of technical analysis uses past price history to predict probabilities in future market movements. Certain patterns have been discovered time and time again, that produce reasonably replicable results. From the size or shape of the pattern, analysts can derive roughly how far the associated breakout should travel. Related Reading: Bitcoin Retests Moving Average That Marked All Major Market Bottoms Bitcoin price action over the last year has formed what appears to be a technically flawless inverse head and shoulders pattern. The inverse head and shoulders is a bullish reversal pattern that appears at the bottom of a trend as it change direction. It consists of a left shoulder, head, a right shoulder, and a neckline. The head must be lower than each shoulder, and the neckline is of extra importance, because that&#8217;s where the abundance of orders are associated. Is this a throwback to the neckline? &#124; BTCUSD on TradingView.com What Exactly Is A Bitcoin Throwback, And Why Does It Matter? A throwback occurs after a breakout of the neckline, when the market isn&#8217;t convinced of the bullish move. The neckline holding is a sign to others that the pattern could confirm, and more traders pile in creating a breakout and strong move higher. When using the example as a comparison, the resulting breakout could reach as much as over $40,000 per BTC. Related Reading: Rare Crypto Signal Emerges That Could Spark Another 2017-Style Boom When bullish patterns fail, the result is called a &#8220;busted&#8221; pattern and can cause a further crash as long traders are stopped out below the neckline. Stop loss levels are placed below the neckline, because a confirmed pattern will not breach below this point. Therefore, for the pattern to confirm, holding the neckline is especially critical. Will we see this bullish chart pattern ultimately confirm, or fail? This chart appeared in issue #7 of CoinChartist VIP alongside a dozen other exclusive crypto charts. Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-09T23:00:31.000Z",
    "title": "Crypto Investor Sentiment Refuses To Budge, But Can The Weekend Change This?",
    "url": "https://www.newsbtc.com/crypto/crypto-investor-sentiment-refuses-to-budge-but-can-the-weekend-change-this/",
    "description": "Crypto investor sentiment has been in the same place for over a month as investors have been hard-pressed to make a decision. This comes amid heightened regulatory headwinds with the United States Securities &#38; Exchange Commission suing the likes of Binance and Coinbase. But could a change be coming soon? Crypto Fear &#38; Greed Index Remains Neutral Following the market surge of Q1 2023 where Bitcoin was able to reclaim the $30,000 level, the market has been in a somewhat downward spiral since then. This has cumulated in investors being unwilling to place bets on whether the market will move up or down, bringing the Crypto Fear &#38; Greed Index to one of its longest stretches in neutral territory. Related Reading: Cardano (ADA) Declines As Market Recovers Amid Security Charges Presently, the index is sitting at a complete dead center of 50 on the scale which ranks sentiment from 1-100. 1-25 marks the extreme fear territory, 26-46 marks the fear level, 54-75 means greed and 76-100 is extreme greed. The 47-53 range is reserved for the neutral territory. At this point, the index points to a lack of activity from investors. This is understandable given that investors are currently waiting for more clarity from regulators to determine if investing in the digital assets right now is a good idea or not. Fear &#38; Greed Index spends over one month in neutral &#124; Source: alternative.me The index has now spent the better part of the last month in this neutral territory as the tug-of-war between the bulls and the bears come to a standstill. So there is no significant movement expected in either direction while it remains this way. Can The Weekend Shift Market Sentiment? The weekend has historically been a period of time characterized by low volatility due to reduced market participation from investors as they take a break from the markets. However, there have also been times when the weekend has come with the most bullish or bearish movements for the market. Total market cap sitting at $1.074 trillion as investors capitulate &#124; Source: Crypto Total Market Cap on TradingView.com As the market heads into another weekend, the possibility of a shift occurring during this time, although not very high, remains present. This is because, with low momentum, it is easier for the markets to swing one way or another with less volume than required on a weekday. Related Reading: Here’s Why Ethereum Could Be At Risk Of Falling To $1,000 Again Given this, there could be a rapid surge if bulls are able to beat the $27,000 level for Bitcoin in the next couple of days. But bears are awarded just as much opportunity during this time, especially if Bitcoin fails to hold the $26,000 support. Nevertheless, a swift movement in either direction could shake investors out of their current wary state to jump back into the market once more. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]