[
  {
    "source": "Crypto Daily",
    "date": "2023-08-27T20:31:00.000Z",
    "title": "\n                        Thailand Elects New Prime Minister with Crypto Interests\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/thailand-elects-new-prime-minister-with-crypto-interests",
    "description": "\n                        <p class=\"MsoNormal\" style=\"line-height: 150%;\">Real estate tycoon Srettha Thavisin will become Thailand&rsquo;s next prime minister. He was the former CEO of one of Thailand's largest real estate developers and has a cryptocurrency background.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Thailand recently elected its new Prime Minister &ndash; Srettha Thavisin. Thavisin was the president and CEO of Sansiri, one of the country's largest real estate developers and an active investor in Thailand's digital asset industry.&nbsp;</p>\nPheu Thai Party Plans to Reintroduce Digital Wallet Programme\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">On August 22, Thavisin was elected as Thailand's next prime minister after receiving 482 out of a possible 747 votes in parliament. The former real estate tycoon was the only candidate the Pheu Thai Party nominated. Thavisin will become prime minister after receiving approval from the King of Thailand &ndash; King Maha Vajiralongkorn.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Thailand's next prime minister resigned from his post at Sansiri in April after speculation arose that he would become Prime Minister. Thavisin also sold his 4.4% stake in Sansiri. Sansiri participated in a $225 million capital raise for a crypto-friendly investment management firm, XSpring Capital, in 2021. Since the fundraiser, XSpring launched a crypto trading platform and aims to become a top-three company in the crypto exchange market as soon as 2025.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The Bangkok Post recently reported that one of Srettha's campaign promises was to reintroduce a national \"airdrop\" where each Thai citizen over the age of 16 will receive 10,000 Thai baht ($300). According to a spokesperson for the Pheu Thai Party, the 10,000 Thai baht can only be spent within a four-kilometre range of their homes. The Bangkok Post further reports that the airdrop will use a form of national token, not an existing digital asset or crypto. Business owners can convert the national token to cash at designated banks.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Thavisin's government will assume office by the end of September.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The country's next prime minister took to Twitter days before the vote to assure Thai citizens that he aims to \"improve the country and the economy.\" </p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">He said: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">\"My enemies are poverty and the inequality of the people. My goal is the well-being of all Thai people.\"</p>\n\nThailand Embraces Crypto \n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Thailand has been dramatically fostering the digital asset industry and has introduced measures to invite investment into the sector. In March, the Thai cabinet agreed to offer tax breaks for corporate income and value-added tax for companies issuing digital investment tokens. </p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-27T20:17:47.000Z",
    "title": "IBM CTO Raises Concerns Over Financial Viability of ChatGPT-Like Language Models",
    "url": "https://www.cryptopolitan.com/ibm-cto-concerns-financial-chatgpt-like-llms/",
    "description": "In a recent interview with CGTN, Xie Dong, the Chief Technology Officer (CTO) at IBM Greater China Group, shared his insights on the financial sustainability of ChatGPT-like large language models (LLMs). Xie emphasized that while these models have ignited interest and excitement in the AI community, their implementation comes at an extraordinary cost that might ... <a title=\"IBM CTO Raises Concerns Over Financial Viability of ChatGPT-Like Language Models\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ibm-cto-concerns-financial-chatgpt-like-llms/\" aria-label=\"More on IBM CTO Raises Concerns Over Financial Viability of ChatGPT-Like Language Models\">Read more</a>"
  }
]