[
  {
    "source": "Decrypt",
    "date": "2023-07-12T19:29:44.000Z",
    "title": "Elon Musk Takes Aim at OpenAI and Other Tech Giants With New AI Startup xAI",
    "url": "https://decrypt.co/resources/elon-musk-ai-xai-understand-reality-openai-google-microsoft",
    "description": "After acquiring Twitter in a bid to change social media, the Dogecoin-loving Tesla and SpaceX CEO now wants to untangle the very fabric of reality."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T19:35:00.000Z",
    "title": "PwC hedge fund survey finds crypto remains viable despite recent market turmoil",
    "url": "https://cointelegraph.com/news/pwc-hedge-fund-survey-crypto-remains-viable-despite-recent-market-turmoil",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/3944f212-8d87-482b-a4f5-d72467539d26.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The portion of traditional hedge funds investing in crypto fell, but many of those still in the market plan to increase crypto investing this year.</p>\n                    <p><p>PwC released its fifth annual global crypto hedge fund report on July 12 based on surveys of crypto-native and traditional hedge funds conducted in the first quarter of this year. Against the backdrop of the recent crypto winter and continuing regulatory uncertainty in the United States and elsewhere, the report found a rather positive outlook among the funds.</p><p>Crypto-native hedge funds are “working towards achieving a new industry dynamic which centres around rebuilding confidence and making their needs heard,” and nearly all of them (93%) expect the market cap to rise over the year, the report <a href=\"https://www.pwc.com/gx/en/new-ventures/cryptocurrency-assets/5th-annual-global-crypto-hedge-fund-report-july-2023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">found</a>. The majority of them (53%) reported no exposure to FTX or the Terra Luna ecosystem.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">imagine paying your crypto hf 2% comish on this performance <br><br>per pwc 5th annual hf report <a href=\"https://t.co/TJk1cf7CKw\">pic.twitter.com/TJk1cf7CKw</a></p>&mdash; Monty (@MontyHall_) <a href=\"https://twitter.com/MontyHall_/status/1679163453733322757?ref_src=twsrc%5Etfw\">July 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Most of the funds performed better than the price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) in 2022. The report found:</p><blockquote>“Crypto hedge funds remain popular investment vehicles for investors seeking exposure to the crypto-asset market.”</blockquote><p>More than half of the funds (54%) have operations in the United States, but those funds did not respond differently from others to U.S. regulations, with 42% saying those regulations are not expected to impact them. The funds listed segregation of assets (75%), financial audits (62%) and an independent statement of reserve assets (60%) as requirements they would like to see for trading venues.</p><p>Tokenization seems not to have made a big splash in the sector. Only 15% of funds are considering investing in tokenized securities, and only 4% tokenize units in their own funds. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/crypto-report-the-crypto-custody-market-reached-448-billion-in-2022\">Crypto custody market reached $448 billion in 2022: Report</a></em></strong></p><p>The portion of traditional hedge funds that invest in crypto fell from 37% in 2022 to 29% this year. Of the funds still investing in crypto, 62% hold less than 5% of their assets under management in crypto and only 8% hold more than 20% in crypto. Forty-six percent of those respondents said they would increase crypto investing this year, down from 67% last year. None of them said they would decrease their capital levels deployed in crypto. </p><p>Among the funds not investing in crypto, “client reaction or reputational risk” has overtaken “regulatory uncertainty” as the main reason, but 40% said that the removal of regulatory barriers would not move them to begin investing in crypto. </p><p>PwC partnered with alternative asset manager CoinShares to survey 131 crypto-native funds. The Alternative Investment Management Association obtained data from 59 traditional hedge funds for that section.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/explained-what-really-crypto-otc-desk/\">What really goes on at a crypto OTC desk?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T19:34:57.000Z",
    "title": "ARK Invest sells massive Coinbase shares as price spikes",
    "url": "https://www.cryptopolitan.com/ark-invest-sells-massive-coinbase-shares/",
    "description": "In an investment landscape where Bitcoin takes center stage, veteran advocate Cathie Wood has her firm, ARK Invest, skimming some gains off its substantial stake in Coinbase. The operation coincides with a recent surge in Coinbase&#8217;s share price, illustrating ARK&#8217;s strategic acumen in capitalizing on favorable market trends. Cashing in on the crypto exchange On ... <a title=\"ARK Invest sells massive Coinbase shares as price spikes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ark-invest-sells-massive-coinbase-shares/\" aria-label=\"More on ARK Invest sells massive Coinbase shares as price spikes\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-12T19:36:46.000Z",
    "title": "Astar Foundation partners with NTT Digital to foster web3 innovation and drive adoption",
    "url": "https://crypto.news/astar-foundation-partners-with-ntt-digital-to-foster-web3-innovation-and-drive-adoption/",
    "description": "Astar Foundation, a smart contract platform for multi-chain solutions, has partnered with NTT Digital to advance the innovation and mass adoption of decentralized technologies"
  }
]