[
  {
    "source": "Decrypt",
    "date": "2023-09-22T17:46:54.000Z",
    "title": "Gucci's Milan Fashion Week Show Debuts on Roblox and Zepeto",
    "url": "https://decrypt.co/198384/guccis-milan-fashion-week-show-debuts-on-roblox-and-zepeto",
    "description": "Gucci creative director Sabato de Sarno's first runway show for the fashion giant is also now in the metaverse."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-22T18:00:00.000Z",
    "title": "Real estate or Bitcoin: Which is more reliable?",
    "url": "https://cointelegraph.com/news/real-estate-bitcoin-which-more-reliable",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/8cccf89d-7520-490d-ac59-865e561b4ea9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Marcel Pechman explains whether real estate or Bitcoin is a better store of value and breaks down Instacart’s current valuation and why investors may want an alternate investment.</p>\n                    <p><p>On this week’s episode of <em>Macro Markets</em>, Cointelegraph analyst Marcel Pechman discusses the real estate markets, highlighting stagnant mortgage demand, attributed to rising rates. With an average 30-year fixed-rate mortgage interest rate of 7.27%, refinancing and home purchase applications have dropped significantly.</p><p>Still, Pechman speculates that house prices might rise if inflation continues to grow. While some sellers may be distressed, real estate, especially urban residential, has historically been a reliable store of value. He concludes by highlighting that other investment options may not provide a safer haven in the current economic climate.</p><p>In the second segment, Pechman discusses Instacart’s initial public offering, which established its valuation at roughly $10 billion, significantly lower than its $39 billion peak valuation. This reflects the challenges faced by venture capitalists in the current economic climate. Pechman suggests a shift in investor metrics, emphasizing the need for a reliable store of value, where cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) could play a role.</p><p>Pechman notes that not all cryptocurrencies seek growth through user bases and fees. Bitcoin can operate as a transparent reserve system for banks and nations, issuing Bitcoin-backed digital assets without requiring a billion users. This shift in perspective highlights the need for a reliable store of value. Unlike precious metals with auditing challenges, Bitcoin and cryptocurrencies can fill this role regardless of everyday user adoption.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/TKFaHW_Lft8\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>For additional details and the complete analysis, check out the <a href=\"https://www.youtube.com/@cointelegraph\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph YouTube channel</a>.</p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-22T18:00:58.000Z",
    "title": "16 Joules per Terahash: Bitmain Unveils High-Efficiency S21 Bitcoin Miners at Hong Kong Summit",
    "url": "https://news.bitcoin.com/16-joules-per-terahash-bitmain-unveils-high-efficiency-s21-bitcoin-miners-at-hong-kong-summit/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/bitmainsnsnd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"16 Joules per Terahash: Bitmain Unveils High-Efficiency S21 Bitcoin Miners at Hong Kong Summit\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/bitmainsnsnd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bitmainsnsnd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bitmainsnsnd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bitmainsnsnd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bitmainsnsnd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bitmainsnsnd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/bitmainsnsnd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitmain, a leading bitcoin mining rig manufacturer, has introduced the newest addition to its Antminer products: the S21 series. The newest models have an efficiency rating under 20 joules per terahash (J/T) and produce between 200 terahash per second (TH/s) and 335 TH/s. Bitmain Launches 2 New Antminers; Invests $54M in Core Scientific At the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-22T18:03:12.000Z",
    "title": "Generation Z Workers Navigate AI: Balancing Excitement and Concerns",
    "url": "https://www.cryptopolitan.com/generation-z-workers-navigate-ai/",
    "description": "The latest generation to enter the workforce, Generation Z (Gen Z), is making significant strides in leveraging artificial intelligence (AI) to enhance productivity. Born between the mid-1990s and early 2010s, Gen Z employees are recognized for their adaptability to AI technologies. However, their journey is marked by optimism and unease as they grapple with the ... <a title=\"Generation Z Workers Navigate AI: Balancing Excitement and Concerns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/generation-z-workers-navigate-ai/\" aria-label=\"More on Generation Z Workers Navigate AI: Balancing Excitement and Concerns\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-22T17:51:11.000Z",
    "title": "Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?",
    "url": "https://www.cryptopolitan.com/rollbit-price-prediction/",
    "description": "Rollbit coin price prediction 2023-2032 Rollbit has quickly become one of the most popular crypto casinos and trading platforms. Launched in 2019, Rollbit offers a wide range of gaming, sports betting, futures trading, and NFT options for users. With no KYC requirements and support for numerous cryptocurrencies, Rollbit provides an easy entry into the world ... <a title=\"Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rollbit-price-prediction/\" aria-label=\"More on Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-22T17:40:35.000Z",
    "title": "Bitcoin critic Sen. Menendez faces federal bribery allegations",
    "url": "https://www.cryptopolitan.com/bitcoin-critic-menendez-face-federal-bribery/",
    "description": "U.S. Senator Bob Menendez, a prominent critic of Bitcoin&#8217;s adoption in El Salvador, finds himself amid a federal bribery scandal. The New Jersey Democrat and Chairman of the Foreign Relations Committee, a powerhouse position in the Senate, now faces allegations of questionable relationships with local business moguls. The indictment, issued by a grand jury in ... <a title=\"Bitcoin critic Sen. Menendez faces federal bribery allegations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-critic-menendez-face-federal-bribery/\" aria-label=\"More on Bitcoin critic Sen. Menendez faces federal bribery allegations\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-22T18:05:55.000Z",
    "title": "ByBit to pause operations in the UK following new crypto rules",
    "url": "https://crypto.news/bybit-to-pause-operations-in-the-uk-following-new-crypto-rules/",
    "description": "Dubai-based cryptocurrency exchange Bybit announced plans to suspend its services to customers in the U.K. shortly before the deadline for crypto firms to comply with the country&#8217;s laws on advertisements and promotions. Bybit announced the news in a press release&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-22T18:00:10.000Z",
    "title": "Exploring Bitcoin’s path to a renewable mining future",
    "url": "https://crypto.news/exploring-bitcoins-path-to-a-renewable-mining-future/",
    "description": "While Bitcoin's journey toward sustainability shows promise, much work is ahead to assess its environmental consequences fully."
  },
  {
    "source": "BTCManager",
    "date": "2023-09-22T17:43:54.000Z",
    "title": "Polkadot’s evolution toward asynchronous backing: The journey to 1,000 parachains",
    "url": "https://crypto.news/polkadots-evolution-toward-asynchronous-backing-the-journey-to-1000-parachains/",
    "description": "Polkadot (DOT), an avant-garde interoperability network, is set to undergo transformative expansion, with plans to enhance its ecosystem by introducing the asynchronous backing update. Currently, the ecosystem accommodates a limit of 100 parachains—individual blockchains interlinked within Polkadot&#8217;s structure. Yet, the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-22T18:00:43.000Z",
    "title": "Privacy For All: Brave To Integrate Zcash Protocol On Native Crypto Wallet",
    "url": "https://www.newsbtc.com/analysis/zec/privacy-for-all-brave-to-integrate-zcash-protocol-on-native-crypto-wallet/",
    "description": "During the Messari Mainnet event, the company behind the internet browser Brave announced a partnership with the Electric Coin Co. (ECC) and the Filecoin Foundation. These entities are the leading developers of the Zcash (ZEC) protocol and Filecoin (FIL). Related Reading: Bitcoin And Crypto Face Turbulence As 10-Year US Treasury Yield Hits 15-Year High Brave Brings Zcash Tools Into Web3 According to an official announcement, the cooperation aims to “improve” privacy for Brave’s Web3 wallet. This feature allows users to transact with cryptocurrencies, including the Basic Attention Token (BAT), which people can earn by interacting with websites. Zcash’s native token, ZEC, will become the latest to integrate with the wallet. The company behind Brave claims that this cooperation underscores its “commitment” to provide privacy tools for its users. The integration will allow users to transact privately or publicly with other users and “have greater control” over their Web3 activity. Zooko Wilcox, CEO of the Electric Coin Co., stated: I’m excited about integrating Zcash into the Brave web browser because privacy should be normal. The Brave browser is a tool that tens of millions of people are using for everyday communication, web browsing, shopping, and other activities. This gives them access to money that respects their security and consent. I’m thrilled for this launch — and what’s to come — as a result of this partnership with Brave and Filecoin Foundation. Since its inception, Brave has provided its users with more control over their data and activity. The company behind the browsers has been increasing its privacy features recently by launching easy ways to delete cookies, profiles, and any traces of interaction with a website. In that sense, Yan Zhu from Brave added: This partnership with like-minded organizations reinforces Brave’s mission for a more private and user-first Web. Not only do we hope to make it simple to use ZEC for private transactions, but we also aim to maximize privacy during key moments of purchase or exchange. More Privacy, More Features In addition to the above, the partners hinted at launching a new privacy-based tool to send and receive messages and multimedia files supported by the Zcash protocol. The content will be stored using the InterPlanetary File System (IPFS), which supports Filecoin. Related Reading: XRP Hurdle In The Run-Up To ‘Proper Party’ – Will Altcoin Price Slip? Marta Belcher, president of the Filecoin Foundation, said: We’re thrilled to be a part of this important project. We believe cryptocurrency can be the foundation for a better Internet — an alternative to big tech that puts people in control of their own data, protects user privacy and security, and permanently preserves humanity’s most important information. As of this writing, neither ZEC nor BAT has seen any upside driven by the announcement. However, Brave users will likely benefit long-term by leveraging a privacy-oriented tool and an alternative to Google and other big tech companies seemingly growing more hungry for people’s data. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-22T18:00:05.000Z",
    "title": "3 Reasons Why Buying $QUBE, $ROE, and $LDO Can Make You Rich in 2023",
    "url": "https://www.crypto-news-flash.com/3-reasons-why-buying-qube-roe-and-ldo-can-make-you-rich-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=3-reasons-why-buying-qube-roe-and-ldo-can-make-you-rich-in-2023",
    "description": "<img width=\"512\" height=\"326\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-117.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-117.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-117-300x191.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-117-312x198.jpg 312w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Finding cryptocurrencies with high growth potential can be difficult, especially since there are many options on the market. However, three tokens—$QUBE, $ROE, and $LDO— are considered by many to be the top crypto to buy  for high returns this year. There are many reasons for this, including their role in advancing technology, market potential, and [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-22T18:09:00.000Z",
    "title": "Shiba Inu Warns of Potential Scam in Calcium Token Trading",
    "url": "https://coinedition.com/shiba-inu-warns-of-potential-scam-in-calcium-token-trading/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Shibburns-New-Radio-App-to-Supplement-Shiba-Inu-Burn.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shibburn’s-New-Radio-App-to-Supplement-Shiba-Inu-Burn\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Shibburns-New-Radio-App-to-Supplement-Shiba-Inu-Burn.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Shibburns-New-Radio-App-to-Supplement-Shiba-Inu-Burn-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Shibburns-New-Radio-App-to-Supplement-Shiba-Inu-Burn-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Shibburns-New-Radio-App-to-Supplement-Shiba-Inu-Burn-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Shibburns-New-Radio-App-to-Supplement-Shiba-Inu-Burn-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Kaal Dhairya, a Shiba Inu developer, has warned members of the meme coin’s community against a potential scam. In a recent post on X (formerly known as Twitter), Dhairya advised SHIB users not to buy or trade the Calcium token. According to him, the digital token has no liquidity, and claims of large losses are [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/shiba-inu-warns-of-potential-scam-in-calcium-token-trading/\">Shiba Inu Warns of Potential Scam in Calcium Token Trading</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-22T18:05:06.000Z",
    "title": "There’s a ‘Good Chance’ Altcoins Will Be Struggling Over Coming Months, According to Benjamin Cowen – Here’s Why",
    "url": "https://dailyhodl.com/2023/09/22/theres-a-good-chance-altcoins-will-be-struggling-over-coming-months-according-to-benjamin-cowen-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Altcoins-Could-Go-Vertical.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Altcoins-Could-Go-Vertical.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/Altcoins-Could-Go-Vertical.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Altcoins-Could-Go-Vertical.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/Altcoins-Could-Go-Vertical.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/Altcoins-Could-Go-Vertical.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/Altcoins-Could-Go-Vertical.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analyst Benjamin Cowen says that altcoins will likely perform poorly for the remainder of 2023 based on historical patterns. Cowen tells his 787,000 YouTube subscribers that altcoins will likely struggle to close out the year as they had in other pre-halving years. The next Bitcoin (BTC) halving is expected in April 2024, when miner [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/22/theres-a-good-chance-altcoins-will-be-struggling-over-coming-months-according-to-benjamin-cowen-heres-why/\">There’s a ‘Good Chance’ Altcoins Will Be Struggling Over Coming Months, According to Benjamin Cowen – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]