[
  {
    "source": "Cointelegraph",
    "date": "2024-02-29T04:44:13.000Z",
    "title": " Shido token plummets 94% as exploiter drains Ethereum staking contract ",
    "url": "https://cointelegraph.com/news/shido-token-plummet-attacker-drains-staking-contract",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYmI0MDUxMWEtNzhiNi00ZTM2LTgxODUtOTlmMTg2ZTBjYTUwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>An attacker was able to get control of the Shido blockchain’s Ethereum staking contract and transfer out billions of Shido tokens, according to PeckShield.</p>\n                    <p><p>The token for the layer 1 blockchain Shido dropped as much as 94% in just 30 minutes after suffering an exploit.</p><p>Blockchain security firm PeckShield alerted to the drop in a Feb. 29 X <a href=\"https://twitter.com/PeckShieldAlert/status/1763050945162981669\" target=\"_blank\" rel=\"noopener nofollow\">post</a>. In a follow-up post, it explained an exploiter managed to transfer the blockchain’s Ethereum staking contract to another address with the new owner then upgrading the contract with a hidden function to withdraw staked tokens.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><p><a href=\"https://cointelegraph.com/news/shido-token-plummet-attacker-drains-staking-contract\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T05:08:08.000Z",
    "title": "With $2.1M Raised In Presale, Crypto Leaders Are Choosing BlockDAG Over Litecoin and Rebel Satoshi",
    "url": "https://www.cryptopolitan.com/with-2-1m-raised-in-presale-crypto-leaders-are-choosing-blockdag-over-litecoin-and-rebel-satoshi/",
    "description": "Litecoin&#8217;s price has hit the bullish reversal trend, while the Rebel Satoshi presale is slated to end on Feb 29th. In the meantime, BlockDAG presale raised $2 million in batch 2 and aims to hit $600 million by the end of 2024, which is believable after the massive success in the past few weeks turning [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T05:03:38.000Z",
    "title": "Injective Blockchain Challenges Ethereum Dominance, Investors Bet on ALGT for Exponential Gains",
    "url": "https://www.cryptopolitan.com/injective-blockchain-challenges-ethereum-dominance-investors-bet-on-algt-for-exponential-gains/",
    "description": "While Ethereum&#8217;s competitors like Solana, Avalanche, and Injective are still far from surpassing its market value, they frequently challenge its status quo in blockchain advancement strategies. Injective is aiming to compete with Ethereum&#8217;s ERC-20 standard by introducing the CW-404 standard.&#160; With the Injective blockchain shaking the Ethereum ecosystem, Investors are looking for new investment opportunities [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T05:01:31.000Z",
    "title": "3 Reasons Why New DeFi Sensation Retik Finance (RETIK) Will Outperform Polygon (MATIC) and Cardano (ADA) in 2024",
    "url": "https://www.cryptopolitan.com/3-reasons-why-new-defi-sensation-retik-finance-retik-will-outperform-polygon-matic-and-cardano-ada-in-2024/",
    "description": "With new projects emerging to challenge established players like Polygon (MATIC) and Cardano (ADA). One such project gaining attention is Retik Finance (RETIK), touted as a new DeFi sensation with the potential to outperform its competitors in 2024. Lets delve into three key reasons why Retik Finance could surpass Polygon and Cardano in the DeFi [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T04:45:58.000Z",
    "title": "Will AI Music Generation Elevate Artistry or Marginalize Musicians?",
    "url": "https://www.cryptopolitan.com/will-ai-music-generation-artistry-musicians/",
    "description": "In a musical revolution that challenges the conventional boundaries of creativity, the emergence of AI music generation has taken center stage, allowing musicians to transform abstract ideas into fully produced compositions within minutes. This groundbreaking technology, capable of incorporating diverse musical styles, from surf rock to reggae, has sparked a wave of excitement and apprehension [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-29T04:59:25.000Z",
    "title": "Bitcoin Poised To Reclaim $64K, Now Back Halfway To $63,000 – New ATH Coming For March?",
    "url": "https://www.newsbtc.com/news/bitcoin-poised-to-reclaim-64k-now-back-halfway-to-63000-new-ath-coming-for-march/",
    "description": "In a blazing start to March, the feverish activity of Bitcoin has set it up for its largest monthly increase in almost three years early Thursday. Money pouring into listed bitcoin funds is fueling a huge gain, and bitcoin is now just a stone&#8217;s throw away from a record high. Related Reading: Bitcoin Fast Approaching $60,000 As BTC F&#38;G Index Hits ‘Extreme Greed’ – Details Source: Coingecko Investor Frenzy As Bitcoin Set To Reclaim $64K The primary cryptocurrency rose as much as 14% late Wednesday to momentarily reach $64,000 — its first move above $60,000 since November 2021 — before reversing part of the gains. BTC was trading at $62,540 as of this writing, according to data from Coingecko. Due to &#8220;fear of losing out&#8221; on potential price increases, investors are rushing to buy cryptocurrencies, which brings back memories of the crypto bull market that drove the main cryptocurrency asset to a record high of around $69,000 in November 2021. Since the beginning of the year, the value of bitcoin has more than tripled, recovering from a 64% decline in 2022. That is an incredible recovery from a slew of scandals and bankruptcy that had cast doubt on the sustainability of digital assets. Meanwhile, the sudden changes in price have been whipsawing both bulls and bears. According to CoinGlass, centralized exchanges had short liquidations of $176 million and long liquidations of $86.1 million over the previous day. Bitcoin market cap currently at $1.22 trillion. Chart: TradingView.com Crypto Rising After prices crashed during the &#8220;crypto winter&#8221; of 2022, investors lost interest in spot bitcoin exchange-traded funds. However, this year&#8217;s approval and introduction of these funds to the US market has rekindled interest in cryptocurrencies. According to LSEG statistics, the top 10 spot bitcoin ETFs saw inflows of $420 million on Wednesday alone, the highest amount in nearly two weeks. Voltages increased when the three most well-known, operated by Grayscale, Fidelity, and BlackRock (IBIT.O), ignited a whole new interest. Ahead of April&#8217;s halving event, which occurs every four years and reduces the rate at which tokens are generated by half as well as the prizes paid to miners, more traders have now been flocking to bitcoin. Source: Alernative.me What The Experts Are Saying &#8220;Bitcoin optimism is fueled by factors like spot BTC ETF inflows, the imminent halving reducing new issuance, and renewed confidence in the crypto asset class, according to Jonathon Miller, managing director at Kraken Australia.&#8221; “When people see these kinds of increases in a short period of time . . . then it just draws in people and Fomo does kick in,” said Timo Lehes, co-founder of blockchain company Swarm. &#8220;It&#8217;s just insane.&#8221; “We could see the all-time high being broken any day now,” said Simon Peters, an analyst at trading firm eToro. “The driving force behind it is without a doubt the [bitcoin funds].” Related Reading: XRP Sinking? A Double Blow Of Underperformance And Address Exodus A New ATH This March? As Bitcoin experiences brief but notable fluctuations, reaching $64,000 before retracing to the $62,000 mark, the cryptocurrency market remains dynamic and full of anticipation. Investors and enthusiasts are closely monitoring the price movements, speculating on the possibility of a new all-time high (ATH) in March. Featured image from Pexels , chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-29T04:58:40.000Z",
    "title": "Dogecoin Price Soars 25%, Why DOGE Bulls Are Not Done Yet",
    "url": "https://www.newsbtc.com/analysis/doge/dogecoin-price-soars-25/",
    "description": "Dogecoin is up over 25% against the US Dollar. DOGE cleared the $0.120 resistance and might continue to rise toward the $0.132 resistance. DOGE started a strong increase after it broke the $0.0850 resistance against the US dollar. The price is trading above the $0.120 level and the 100 simple moving average (4 hours). There was a break above a key contracting triangle with resistance at $0.0845 on the 4-hour chart of the DOGE/USD pair (data source from Kraken). The price could extend its rally above the $0.1280 and $0.130 resistance levels. Dogecoin Price Pumps Above $0.12 In the past few sessions, Dogecoin price started a strong increase from the $0.080 support zone. DOGE cleared many hurdles near $0.0850 to enter a positive zone. There was a break above a key contracting triangle with resistance at $0.0845 on the 4-hour chart of the DOGE/USD pair. It even broke the $0.100 resistance to move further into a positive zone like Bitcoin and Ethereum. It is up over 25% and trading above $0.120. A new multi-week high was formed near $0.1282 and the price is now correcting gains. The price is well above the 23.6% Fib retracement level of the recent surge from the $0.0845 swing low to the $0.1282 high. Source: DOGEUSD on TradingView.com DOGE is also trading above the $0.1220 level and the 100 simple moving average (4 hours). On the upside, the price is facing resistance near the $0.1280 level. The next major resistance is near the $0.1320 level. A close above the $0.1320 resistance might send the price toward the $0.1450 resistance. The next major resistance is near $0.150. Any more gains might send the price toward the $0.1620 level. Downside Correction in DOGE? If DOGE’s price fails to gain pace above the $0.1280 level, it could start a downside correction. Initial support on the downside is near the $0.120 level. The next major support is near the $0.1065 level or the 50% Fib retracement level of the recent surge from the $0.0845 swing low to the $0.1282 high. If there is a downside break below the $0.1065 support, the price could decline further. In the stated case, the price might decline toward the $0.100 level. Technical Indicators 4 Hours MACD – The MACD for DOGE/USD is now gaining momentum in the bullish zone. 4 Hours RSI (Relative Strength Index) – The RSI for DOGE/USD is now in the overbought zone. Major Support Levels – $0.120, $0.1065 and $0.10. Major Resistance Levels – $0.1280, $0.1320, and $0.150."
  }
]