[
  {
    "source": "CryptoSlate",
    "date": "2023-05-31T08:47:02.000Z",
    "title": "Wall Street firms to take on Binance, Coinbase, other crypto-native exchanges",
    "url": "https://cryptoslate.com/wall-street-firms-to-take-on-binance-coinbase-other-crypto-native-exchanges/",
    "description": "<p>Traditional financial firms, including Standard Chartered, Nomura, and Charles Schwab, are busy building or funding new crypto exchange and custody platforms, FT reported on May 31. These well-known Wall Street firms are betting that fund managers are still interested in trading crypto even after last year&#8217;s market downturn and the string of crypto scandals. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/wall-street-firms-to-take-on-binance-coinbase-other-crypto-native-exchanges/\">Wall Street firms to take on Binance, Coinbase, other crypto-native exchanges</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-31T08:43:41.000Z",
    "title": "Bitcoin hash rate soars, as difficulty to adjust positively on May 31",
    "url": "https://cryptoslate.com/insights/bitcoin-hash-rate-soars-as-difficulty-to-adjust-positively-on-may-31/",
    "description": "<p>Quick Take The Bitcoin hash rate has reached all-time highs, increasing by 4% in the past two weeks. The current hash rate has reached 368 EH/s, demonstrating significant growth in 2023. As a result, the difficulty adjustment is expected to be positive tonight, May 31, at roughly 8 PM GMT, and surpass 50T with a positive [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-hash-rate-soars-as-difficulty-to-adjust-positively-on-may-31/\">Bitcoin hash rate soars, as difficulty to adjust positively on May 31</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-31T08:41:00.000Z",
    "title": "ByBit Joins Long List Of Crypto Exchanges To Exit Canada",
    "url": "https://cryptodaily.co.uk/2023/05/bybit-joins-long-list-of-crypto-exchanges-to-exit-canada",
    "description": "<p>ByBit has become the latest cryptocurrency exchange to exit Canada and plans to shutter all services and products offered in the country. The announcement was made on the 30th of May.</p>\n<p>ByBit joins a growing list of cryptocurrency exchanges that are exiting Canada, citing an unfavorable regulatory environment.&nbsp;</p>\nByBit To Shutter Canadian Operations\n<p>ByBit added that Canadian users would be unable to access any services and products offered by the exchange. Furthermore, Canadian users will also be unable to open new accounts on the exchange starting from the 31st of May. The exchange announced the news in a blog post, stating,&nbsp;</p>\n\n<p>&ldquo;It has always been Bybit&rsquo;s primary objective to operate our business in compliance with all relevant rules and regulations in Canada. In light of recent regulatory development, Bybit has made the difficult but necessary decision to pause the availability of our products and services.&rdquo;</p>\n\n<p>Additionally, existing users will not be able to trade or make deposits on the platform after the 31st of July, 2023. The exchange also asked its users in Canada to close out their positions by the 30th of September. Failure to wind down the positions would result in the automatic liquidation of any and all positions in both derivative contracts and margin products.</p>\n\n<p>&nbsp;&ldquo;Canadian Customers who are implicated by these measures should take steps by the 30th of September, 2023, 8 AM UTC, to wind down and manage their positions. Failing which, open positions in any margin products and derivative contracts, including the following products listed below, will be liquidated, and the liquidated funds will be available for withdrawal.&rdquo;</p>\n\nA Mass Exodus&nbsp;\n<p>ByBit becomes the latest in a long line of cryptocurrency exchanges that have chosen to leave the Canadian markets, citing the unfavorable regulatory environment prevailing in the country. Canada had imposed several new regulations on the crypto industry in the country and given exchanges the option of complying with them or leaving the markets. The new rules bar crypto exchanges from offering any type of leverage, including margin and credit.&nbsp;</p>\n<p>Furthermore, exchanges were also prevented from allowing the purchase or deposit of stablecoins without obtaining prior written consent from regulators, leading to a de-facto ban on stablecoins in the country. This de-facto ban on stablecoins is the primary driver of the mass exodus of cryptocurrency exchanges from the country. Some of the notable exits include Paxos, dYdX, Bittrex, OKX, and Binance.&nbsp;</p>\n<p>Binance had halted its services for Canadian users under similar circumstances back in May, stating that the current regulatory landscape made operations unfavorable. The exchange had stated at the time,&nbsp;</p>\n\n<p>&ldquo;Unfortunately, new guidance related to stablecoins and investor limits provided to crypto exchanges makes the Canadian market no longer tenable for Binance at this time. We put off this decision as long as we could to explore other reasonable avenues to protect our Canadian users, but it has become apparent that there are none.&rdquo;</p>\n\n<p>OKX had announced the suspension of services in Canada as early as March. This was followed by dYdX and Paxos in April, with both announcing they were withdrawing from the Canadian markets.</p>\nNot All Exchanges Eying An Exit&nbsp;\n<p>However, not all exchanges are looking to exit the Canadian markets and have decided to comply with the new regulations, despite the restrictions. Kraken and Coinbase are two of the major exchanges that have pledged to continue operations in Canada and have gone on record to state they would comply with the new rules. Coinbase Canada, the exchange&rsquo;s Canadian arm, has signed a pre-registration undertaking (PRU) with regulators and has pledged to help create a strong regulatory framework.&nbsp;</p>\n\n<p>&ldquo;We applaud the Canadian securities regulators&rsquo; efforts to bring clarity to the industry and look forward to continuing our collaboration with them on regulation that protects consumers while embracing innovation.&rdquo;</p>\n\n<p>Coinbase vice-president of international and business development, Nana Murugesan, stated that the Canadian approach to crypto is better than America&rsquo;s because the rules are clearly defined.&nbsp;</p>\n\n<p>&ldquo;There&rsquo;s a couple of ways we see regulators acting: one is regulation by engagement; the other one is regulation by enforcement. The latter part is tough because you don&rsquo;t know what the rules are. But the Canadian regulator is definitely the former, which is regulation by engagement &ndash; which we love.&rdquo;</p>\n\n<p>Kraken also made its intention of staying in the Canadian markets clear by announcing that it had filed a PRU with Canadian regulators. Kraken pointed out an OSC survey stating that 31% of Canadians planned to buy crypto next year as the main reason to stay in the market. Other exchanges that have filed a PRU with Canadian regulators include Gemini, Shakepay, and BitBuy. BitBuy is one of the top exchanges in Canada and was brought under the regulatory umbrella much before others, such as Kraken, Coinbase, and Gemini.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T08:57:42.000Z",
    "title": "TMS Network (TMSN) In a League of Its Own as Neo (NEO)  and Polkadot (DOT) Face Mounting Loss",
    "url": "https://www.cryptopolitan.com/tms-network-tmsn-in-a-league-of-its-own-as-neo-neo-and-polkadot-dot-face-mounting-loss/",
    "description": "As the cryptocurrency market experiences a tumultuous phase,&#160;TMS Network (TMSN)&#160;emerges as a standout player, seemingly immune to the mounting losses faced by industry giants Neo (NEO) &#160;and Polkadot (DOT). While the two heavyweights grapple with market pressures, TMS Network (TMSN) is carving its own path with steadfast growth and innovation. In this article, we delve ... <a title=\"TMS Network (TMSN) In a League of Its Own as Neo (NEO)  and Polkadot (DOT) Face Mounting Loss\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tms-network-tmsn-in-a-league-of-its-own-as-neo-neo-and-polkadot-dot-face-mounting-loss/\" aria-label=\"More on TMS Network (TMSN) In a League of Its Own as Neo (NEO)  and Polkadot (DOT) Face Mounting Loss\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T09:00:00.000Z",
    "title": "DigiToads poised to challenge Shiba Inu in 2023",
    "url": "https://crypto.news/digitoads-poised-to-challenge-shiba-inu-in-2023/",
    "description": "With digitoads (TOADS) practical features, experts believe it will soon outperform top crypto coins like shiba inu (SHIB)"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T09:00:04.000Z",
    "title": "Ripple (XRP) and Solana (SOL) breakthrough: How TMS Network (TMSN), can skyrocket in the meantime",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-and-solana-sol-breakthrough-how-tms-network-tmsn-can-skyrocket-in-the-meantime/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-xrp-and-solana-sol-breakthrough-how-tms-network-tmsn-can-skyrocket-in-the-meantime",
    "description": "<p>The cryptocurrency landscape in 2023 has displayed significant advancement compared to the previous year. Despite intermittent surges, the market exhibits immense untapped potential. While prominent cryptocurrencies like Ripple (XRP) and Solana (SOL) are poised for the next phase, astute investors with a forward-thinking approach have already identified TMS Network (TMSN). Recently, TMS Network has witnessed [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/ripple-xrp-and-solana-sol-breakthrough-how-tms-network-tmsn-can-skyrocket-in-the-meantime/\">Ripple (XRP) and Solana (SOL) breakthrough: How TMS Network (TMSN), can skyrocket in the meantime</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-05-31T08:55:11.000Z",
    "title": "Top Potential Gems",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-potential-gems/",
    "description": "<p>As the cryptocurrency market swings into a bullish phase, now is the best time for crypto enthusiasts and investors to familiarize themselves with digital assets with the potential for significant growth in price in the upcoming months. This post will look at some hidden crypto gems that are all primed to have a big influence [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-potential-gems/\">Top Potential Gems</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]