[
  {
    "source": "Decrypt",
    "date": "2023-07-25T10:01:02.000Z",
    "title": "Delabs Games Raises $4.7 Million to Build on Polygon",
    "url": "https://decrypt.co/149821/delabs-games-raises-4-7-million-build-polygon",
    "description": "Founded by South Korean game studio 4:33 Creative Lab, Delabs is the team behind Rumble Racing Star and other upcoming titles."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-25T09:49:17.000Z",
    "title": "Binance Expected to Launch Crypto Services in Japan by August",
    "url": "https://decrypt.co/149937/binance-expected-launch-crypto-services-japan-august",
    "description": "The world's largest crypto exchange Binance by trading volume is set to make a return to Japan before the end of the summer."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-25T09:46:43.000Z",
    "title": "$DOGE: Dogecoin Price Surges on Speculation Over Its Potential Use for Payments in X (Formerly Known As Twitter)",
    "url": "https://www.cryptoglobe.com/latest/2023/07/doge-dogecoin-price-surges-on-speculation-over-its-potential-use-for-payments-in-x-formerly-known-as-twitter/",
    "description": "In a fascinating turn of events, Dogecoin (DOGE), the cryptocurrency that started as a meme and has since gained a cult following, recently saw a 10% uptick in its price. According to data from TradingView, on Coinbase, earlier today (around 5:35 a.m. UTC), the DOGE price hit a high of $0.07846, up 12.61% from its […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T09:59:00.000Z",
    "title": "Controversial Arkham Intel Goes After Do Kwon’s Crypto Wallets",
    "url": "https://cryptodaily.co.uk/2023/07/controversial-arkham-intel-goes-after-do-kwons-crypto-wallets",
    "description": "<p>The highly controversial Arkham Intel Exchange has approved its first-ever bounty hunt, with crypto sleuths set to go after crypto wallets belonging to Terra co-founder Do Kwon.&nbsp;</p>\n<p>With Do Kwon currently languishing in a Montenegrin jail, crypto users have long been trying to seek out any information regarding his crypto wallets.&nbsp;</p>\n&ldquo;Deanonymizing The Blockchain&rdquo;\n<p>The Arkham Intel Exchange is a highly controversial platform, acting as a marketplace that facilitates the trading of on-chain data. The platform recently approved its first-ever bounty submission after two crypto sleuths found evidence of crypto wallets belonging to Do Kwon. An anonymous user, along with a pseudo-anonymous Twitter user going by the name of @ErgoBTC, were paid around 9500 ARKM tokens, worth around $5000 for their submission.&nbsp;</p>\n\n<p>&ldquo;The Arkham Intel Exchange now has its first approved submission: new evidence of wallets owned by Do Kwon / Terraform Labs. An anonymous on-chain sleuth and @ErgoBTC were the successful bounty hunters.&rdquo;&nbsp;</p>\n\n<p>It further added,&nbsp;</p>\n\n<p>&ldquo;Expanded labels for the LFG BTC address activity after running off with funds intended for the defense of the UST depeg have been added to Arkham as a part of their bounty program.&rdquo;</p>\n\n<p>According to Arkham Intel, the anonymous user and Ergo sent the platform considerable evidence they had found wallets owned by Do Kwon and Terra. Ergo stated this evidence contradicts public statements made by Terra that it holds only one Luna Foundation Guard wallet. Luna Foundation Guard stated that 80,081 BTC, which comprised over 99% of its reserves, had exited the fund. LFG had claimed that the reason behind the sale of the crypto asset was to shore up and support the overall health of the Terra ecosystem.&nbsp;</p>\nErgoBTC&rsquo;s Findings&nbsp;\n<p>Ergo shared further details about his research, which was first made public in October when the Luna Foundation Guard claimed it had only one Bitcoin wallet containing 313 BTC. Ergo had written at the time,&nbsp;</p>\n\n<p>&ldquo;While it may be true that this is the only formally &lsquo;declared&rsquo; wallet controlled by the LFG, they seem to have failed to account for the trail of bread crumbs left by the change outputs used to fund their new declared wallet.&rdquo;</p>\n\n<p>The crypto sleuth continued to track the funds over the next few months and noted that they were moving even after Do Kwon&rsquo;s arrest in March.&nbsp;</p>\n\n<p>&ldquo;Kwon may have been rolled up for faking a passport. But LFG and the BTC are still moving.&rdquo;</p>\n\n<p>The wallet being tracked has been officially christened &ldquo;Terraform Labs&rdquo; on the Arkham Intel Exchange and currently holds around $160 million worth of crypto, out of which around $153 million is in Bitcoin.&nbsp;</p>\nThe Arkham Intel Exchange&nbsp;\n<p>The Arkham Intel Exchange was launched on the 10th of July to generally negative reactions by members of the crypto space, with most describing it as a glorified snitching service. Many in the crypto space have also stated that the platform could be used to dox innocent individuals. Users on the platform can place bounties for information related to blockchain transactions, which would then be released to the public within 90 days following approval from the platform. Going by this timeline, information about the Do Kwon and Terra wallets could be available in the public domain sometime in October.&nbsp;</p>\nThe Terra Collapse&nbsp;\n<p>The Terra collapse was one of the most crippling events in the history of crypto when the collapse of its algorithmic stablecoin TerraUSD and its cryptocurrency LUNA triggered chaos in the market. Following TerraUSD&rsquo;s de-pegging and the ecosystem&rsquo;s collapse, the United States Securities and Exchange Commission (SEC) charged Do Kwon with securities violations for selling unregistered transactions of crypto asset securities. He was also charged for failing to provide truthful disclosures and providing investors with misleading information.&nbsp;</p>\n<p>Kwon&rsquo;s whereabouts were unknown until March 2023, when he was apprehended by authorities in Montenegro and was sentenced to four months in prison for traveling using forged travel papers. Several other individuals connected to Terra are also under investigation by authorities in South Korea. Recently, co-founder Hin Hyun-seong had his first hearing for charges related to illegal profits from the sale of LUNA tokens.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T09:48:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T09:42:03.000Z",
    "title": "How AI Impact is Revolutionizing the Video Gaming Industry",
    "url": "https://www.cryptopolitan.com/how-ai-impact-game-industry/",
    "description": "The video game industry, with its ever-expanding reach and enormous economic impact, is experiencing a groundbreaking transformation fueled by the rapid advancement of artificial intelligence (AI). From major studios in San Francisco to Tokyo and Hong Kong, companies are increasingly embracing AI tools to navigate the challenges posed by escalating costs and stagnating prices. In ... <a title=\"How AI Impact is Revolutionizing the Video Gaming Industry\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-ai-impact-game-industry/\" aria-label=\"More on How AI Impact is Revolutionizing the Video Gaming Industry\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T10:00:00.000Z",
    "title": "Shiba burning millions of SHIB, struggling to compete with InQubeta",
    "url": "https://crypto.news/shiba-burning-millions-of-shib-struggling-to-compete-with-inqubeta/",
    "description": "This article will delve into the challenges faced by Shiba Inu's burning approach and explore the reasons behind InQubeta's growing influence in crypto space"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T09:42:29.000Z",
    "title": "Pro-XRP attorney’s Twitter hacked to promote fake giveaways ",
    "url": "https://crypto.news/pro-xrp-attorneys-twitter-hacked-to-promote-fake-giveaways/",
    "description": "Prominent XRP advocate Attorney Jeremy Hogan's Twitter account hacked! Scammers used it to promote fake XRP giveaways. XRP community rallies to spread awareness and support."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T10:00:25.000Z",
    "title": "Bitcoin Retreat Below $30,000: A Threat To Crypto’s 2023 Dominance Over Stocks?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-retreat-below-30000-a-threat-to-cryptos-2023-dominance-over-stocks/",
    "description": "As the year 2023 continues to unfold, Bitcoin&#8217;s retreat below the pivotal $30,000 mark raises questions about the overall strength and stability of the cryptocurrency market. Once, the crypto market held a significant lead over traditional stocks, according to Bloomberg. However, this advantage seems to be dwindling as Bitcoin &#8211; a leading market indicator &#8211; exhibits signs of struggle. The year-to-date rise of the top 100 digital tokens now stands at 46%, narrowing the gap with the 41% increase of the tech-driven Nasdaq 100 Index. Related Reading: Bitcoin’s Realized Cap Nears $400 Billion Despite Price Struggle At $30,000 Technology stocks, particularly those influenced by artificial intelligence hype, have been rapidly gaining ground. This surge resulted in the Nasdaq 100 Index briefly surpassing the MVIS CryptoCompare Digital Assets 100 Index in June. Impact of Regulatory Changes And Fed Decisions Previously, the crypto market received a positive push from both regulatory efforts on digital assets that face a stumbling block in US court on digital assets and the hope that spot Bitcoin exchange-traded funds (ETFs) would be authorized in the US.  However, these boosting factors have waned. Investors are now cautiously considering how the anticipated interest-rate hike by the Federal Reserve could impact both traditional and digital markets. According to Caroline Mauron, co-founder of digital-asset derivatives liquidity provider OrBit Markets, the rally has lost momentum since the initial excitement sparked by the ETF news. &#8220;There are no other visible catalysts on the horizon,&#8221; she noted. She also hinted at a potential silver lining, pointing out that the &#8220;downside risk should be limited as the Fed is near the end of the current rate hiking cycle, which should support risk assets including crypto.&#8221; Bitcoin Chart Patterns Signal Warning Signs Further cause for concern is seen in the various chart patterns that track Bitcoin&#8217;s performance. A key indicator, Bitcoin’s 20-week Bollinger bandwidth, has contracted to its narrowest in seven years. This tightening suggests that moves in the value of Bitcoin could intensify, according to Bloomberg. If crucial thresholds aren&#8217;t maintained, it&#8217;s likely we could see a downward trend. The Bollinger study also provides an invaluable method for analyzing the volatility of this digital asset. Market analyst at IG Australia Pty, Tony Sycamore, noted the potential for Bitcoin&#8217;s drop to continue, &#8220;Bitcoin should extend toward $26,000/$25,000 before finding support,&#8221; he predicted. Related Reading: Galaxy Digital Founder Anticipates BTC Price Surge Due To This Reason Meanwhile, Bitcoin price has continued to swim in red over the past week following its fall below the $30,000 mark. Particularly, in the past 24 hours, the asset has traded slightly above $29,000 down by 1.3%. This price action has resulted in more than 45,000 traders caught in the crypto market total liquidation of over $130 million in the past day. Furthermore, Bitcoin currently has a 24-hour high of $29,762 and a 24-hour low of $29,983, at the time of writing. The asset’s market cap has plunged from a high of $583 billion seen last Tuesday to $567 billion, as of today. Additionally, BTC trading volume has also declined in the past week indicating less trading activity. Featured image iStock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T10:01:12.000Z",
    "title": "Just In: BNB Chain Burns Roughly 2 Million Coins, QUBE Pumping As InQubeta Raises Over $1.7 Million",
    "url": "https://www.crypto-news-flash.com/just-in-bnb-chain-burns-roughly-2-million-coins-qube-pumping-as-inqubeta-raises-over-1-7-million/?utm_source=rss&utm_medium=rss&utm_campaign=just-in-bnb-chain-burns-roughly-2-million-coins-qube-pumping-as-inqubeta-raises-over-1-7-million",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T100507.708.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T100507.708.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T100507.708-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T100507.708-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />When it comes to the world of cryptocurrency, things are heating up. Following the recent news that Binance Smart Chain (BNB) has burned approximately 2 million coins, attention has turned to InQubeta, an AI-centric blockchain project that is pumping with excitement. It has already raised an impressive $1.7 million and is not showing signs of [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-25T09:42:01.000Z",
    "title": "How X (Formerly Twitter) Plans to Embrace Cryptos?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-x-formerly-twitter-plans-to-embrace-cryptos/",
    "description": "<p>The company&#8217;s decision marks a significant turning point for X and the crypto industry, as it opens up new opportunities for mass adoption and mainstream recognition. This article delves into X&#8217;s plans for cryptocurrency integration and explores the potential effects it may have on the broader crypto landscape. X&#8217;s Vision for Cryptocurrency Integration X&#8217;s decision [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-x-formerly-twitter-plans-to-embrace-cryptos/\">How X (Formerly Twitter) Plans to Embrace Cryptos?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-07-25T09:56:52.000Z",
    "title": "Bitfinex to List OP, Native Token of Optimism Blockchain",
    "url": "https://blog.bitfinex.com/media/bitfinex-to-list-op-native-token-of-optimism-blockchain/",
    "description": "<p>ROAD TOWN, British Virgin Islands – July 25, 2023 – Bitfinex (www.bitfinex.com/), a state-of-the-art digital token trading platform, announced today that it will be listing OP, the native token of Optimism, a decentralised, Ethereum-based layer-2 blockchain that enables scalable smart contracts and instant transactions. Built...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/media/bitfinex-to-list-op-native-token-of-optimism-blockchain/\">&lt;strong&gt;Bitfinex to List OP&lt;/strong&gt;, &lt;strong&gt;Native Token of Optimism Blockchain&lt;/strong&gt;</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]