[
  {
    "source": "CoinDesk",
    "date": "2024-02-06T21:01:48.000Z",
    "title": "BlackRock’s Bitcoin ETF Inflows Climb to Fifth-Highest Among All ETFs in 2024",
    "url": "https://www.coindesk.com/markets/2024/02/06/blackrocks-bitcoin-etf-inflows-climb-to-fifth-highest-among-all-etfs-in-2024/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Only 17 days after its launch, the BlackRock iShares Bitcoin Trust (IBIT) has become one of the top five exchange-traded funds (ETFs) of 2024 based on inflows, according to data from Bloomberg Intelligence."
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-06T20:53:40.000Z",
    "title": "U.S. SEC Clears 'Dealer' Rule Expansion That Could Rope in DeFi",
    "url": "https://www.coindesk.com/policy/2024/02/06/us-sec-clears-dealer-rule-expansion-that-could-rope-in-defi/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Securities and Exchange Commission (SEC) widened its definition of a dealer today to pull many more financial operations into its jurisdiction – including, as it warned in a footnote of its original proposal – those dealing in crypto securities."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-06T20:56:29.000Z",
    "title": "Digital Currency Group Slams Genesis Payment Plan",
    "url": "https://decrypt.co/216150/digital-currency-group-slams-genesis-repayment-plan",
    "description": "Because of appreciation in the value of the crypto holdings in question, DCG says says its subsidiary’s repayment schedule will unfairly enrich some claimants."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-06T21:08:25.000Z",
    "title": "COPA claims visible forgery in Craig Wright’s Bitcoin origin document",
    "url": "https://crypto.news/copa-forgery-craig-wright-bitcoin-origin/",
    "description": "On the second day of the Craig Wright v. COPA trial, the plaintiff claimed that Wright had forged the date in his infamous “Nakamoto is the Japanese Adam Smith” document."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-06T21:00:42.000Z",
    "title": "XRP, SOL Among Coins With Red Sentiment, Time To Buy Against Crowd?",
    "url": "https://www.newsbtc.com/xrp-news/xrp-sol-coins-red-sentiment-buy-against-crowd/",
    "description": "Data shows various cryptocurrencies like XRP and Solana are currently witnessing bearish majority sentiment on social media platforms. XRP, SOL, And Other Assets Are Sharing A Red Mentality Currently According to data from the analytics firm Santiment, a notable bearish sentiment has emerged among cryptocurrency traders during the past week. The relevant indicator is the &#8220;Weighted Sentiment,&#8221; based on two other metrics: the Sentiment Balance and Social Volume. The Sentiment Balance keeps track of the net sentiment present among users on the major social media platforms. The metric calculates this score by reviewing social media posts and applying a machine-learning model to filter for positive and negative sentiments. Related Reading: Dogecoin Trounced: Chainlink’s 34% Jump Kicks DOGE Out Of Top 10 List Once the indicator has found the scores for these bullish and bearish sentiments, it takes their difference to give the average or net sentiment present among the traders. The other relevance metric here, the Social Volume, tells us about the amount of discussion related to any topic or term on social media platforms. The Weighted Sentiment takes the Sentiment Balance and then weighs it against this Social Volume. This means that the indicator&#8217;s value only spikes (in either direction) when not only is there some notable imbalance present in the market (that is, the net sentiment has a significant value), but the volume of social media discussion about these sentiments is also high. This fact makes the Weighted Sentiment more reliable than the Sentiment Balance, as it can provide a better picture of the trend among the traders as a whole (since the Social Volume would only spike when there are many users involved in discussions). Now, here is a chart that shows the trend in the Weighted Sentiment for six different cryptocurrencies: Bitcoin (BTC), Ethereum (ETH), BNB (BNB), XRP (XRP), Cardano (ADA), and Solana (SOL). The value of the metric appears to be negative for all of these assets right now &#124; Source: Santiment on X As displayed in the above graph, these assets have had a negative Weighted Sentiment recently, suggesting that bearish sentiment has dominated social media users. More specifically, the indicator is around -0.36 for XRP, while it&#8217;s about -0.64 for Solana. Historically, cryptocurrency markets have been more likely to move in the direction opposite to what the crowd is expecting. As such, price rebounds become more probable the more negative the sentiment gets, while tops can occur when the traders share a highly bullish mentality. Followers of contrarian investing exploit this to time their buying and selling moves. Warren Buffet&#8217;s famous quote sums up this idea, &#8220;be fearful when others are greedy, and greedy when others are fearful.&#8221; Related Reading: Bitcoin CDD Shows Bullish Breakout, Rally Returning In Full Flow? Given the red sentiment XRP and others are witnessing, a contrarian trader might think it is the right time to buy into these cryptocurrencies. XRP Price XRP had attempted recovery earlier, but the move appears to have failed as the asset has returned under the $0.50 level. Looks like the price of XRP hasn't moved much recently &#124; Source: XRPUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-06T21:00:23.000Z",
    "title": "‘Easy’ Rallies Underway for Bitcoin and Risk Assets Amid Global Currency Debasement: Raoul Pal",
    "url": "https://dailyhodl.com/2024/02/06/easy-rallies-underway-for-bitcoin-and-risk-assets-amid-global-currency-debasement-raoul-pal/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/easy-rallies-risk-pal.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/easy-rallies-risk-pal.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/02/easy-rallies-risk-pal.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/easy-rallies-risk-pal.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/easy-rallies-risk-pal.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/easy-rallies-risk-pal.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/02/easy-rallies-risk-pal.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Former Goldman Sachs executive Raoul Pal says Bitcoin (BTC) is witnessing &#8220;easy&#8221; rallies amid the debasement of fiat currencies across the globe. Pal notes that BTC has demonstrated an average of +110% annual returns and the Nasdaq has +21% annual returns, both from &#8220;doing nothing.&#8221; &#8220;Looking forward to the &#8216;It&#8217;ll end in tears&#8217; and &#8216;correlation [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/06/easy-rallies-underway-for-bitcoin-and-risk-assets-amid-global-currency-debasement-raoul-pal/\">‘Easy’ Rallies Underway for Bitcoin and Risk Assets Amid Global Currency Debasement: Raoul Pal</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-06T20:55:42.000Z",
    "title": "Here’s The Next Big Memecoin for This Bull Market Cycle, According to Closely Followed Crypto Analyst",
    "url": "https://dailyhodl.com/2024/02/06/heres-the-next-big-memecoin-for-this-bull-market-cycle-according-to-closely-followed-crypto-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Dogecoin-in-New-Disbelief.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Dogecoin-in-New-Disbelief.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/Dogecoin-in-New-Disbelief.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Dogecoin-in-New-Disbelief.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Dogecoin-in-New-Disbelief.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Dogecoin-in-New-Disbelief.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Dogecoin-in-New-Disbelief.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist is naming the one memecoin he believes will outperform all others in the current bull market cycle. Pseudonymous analyst Inmortal tells his 206,200 followers on the social media platform X that dog-themed crypto asset Floki (FLOKI) is gearing up for a massive rally. &#8220;FLOKI is THE memecoin for this bull [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/06/heres-the-next-big-memecoin-for-this-bull-market-cycle-according-to-closely-followed-crypto-analyst/\">Here’s The Next Big Memecoin for This Bull Market Cycle, According to Closely Followed Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]