[
  {
    "source": "CoinDesk",
    "date": "2023-07-19T21:33:34.000Z",
    "title": "XRP Soars 10%, Lifting Altcoins as Bitcoin Dominance Teeters at 1-Month Low",
    "url": "https://www.coindesk.com/markets/2023/07/19/xrp-soars-10-lifting-altcoins-as-bitcoin-dominance-teeters-at-1-month-low/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin’s stall despite the recent wave of positive news is a cause for concern, one observer said."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-19T21:35:10.000Z",
    "title": "How to Start Playing Dr. Disrespect's 'Deadrop'—Do You Need an NFT?",
    "url": "https://decrypt.co/resources/how-to-start-playing-dr-disrespects-deadrop-do-you-need-an-nft",
    "description": "Deadrop is currently in limited early access. Here’s how to unlock the first-person shooter game from Midnight Society."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-19T21:23:49.000Z",
    "title": "No impact from Ripple ruling? SEC chair cites risks from crypto in budget request ",
    "url": "https://cointelegraph.com/news/sec-chair-cites-risks-crypto-budget-request",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/a99519db-3b0b-4132-807d-2842b1762c36.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Gary Gensler cited the “Wild West of the crypto markets” that was “rife with noncompliance” in requesting more than $2.4 billion for the commission's 2024 fiscal budget.</p>\n                    <p><p>United States Securities and Exchange Commission (SEC) chair Gary Gensler has called for “new tools, expertise, and resources” aimed at addressing misconduct in the crypto space in the regulator’s 2024 budget request.</p><p>In prepared testimony for a July 19 hearing of the Subcommittee on Financial Services and General Government with the U.S. Senate Appropriations Committee, Gensler <a href=\"https://www.appropriations.senate.gov/imo/media/doc/download_testimony6.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a> he supported the Biden administration’s request allocating more than $2.4 billion to the SEC for the 2024 fiscal year. The SEC chair cited the “Wild West of the crypto markets” that was “rife with noncompliance” as part of the reasons behind the budgetary request.</p><p>With the funding, Gensler said he expected the SEC to increase the number of full-time positions from 4,685 in 2023 to 5,139 in 2024. According to SEC data, the commission’s enforcement division brought more than 750 enforcement actions in 2022, but “rapid technological innovation” had led to misconduct in the crypto space.</p><p>“Our authorities at the SEC are quite robust — we could always use some more resources,” <a href=\"https://www.appropriations.senate.gov/hearings/review-of-the-fy-2024-budget-for-the-us-securities-and-exchange-commission\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Gensler in response to questions raised by Illinois Senator Dick Durbin. “If this committee were to see fit and want us to have more resources, we could use them.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/81da3c24-1829-40f9-9b76-187c5b4090ee.png\"  /><figcaption style=\"text-align: center;\"><em>SEC chair Gary Gensler addressing U.S. lawmakers at a July 19 hearing</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/lawmakers-propose-sec-chair-consider-legislation-not-enforcement-approach-crypto\"><strong><em>US lawmakers propose SEC chair consider legislation, not enforcement approach to crypto</em></strong></a></p><p>The SEC chair said he hoped to get an additional $70 million in funding to an agreed-upon budget to add another 170 people to the commission, some of whom would focus on enforcement. He also faced questioning from lawmakers on the SEC’s role in overseeing bankruptcy crypto exchange FTX. </p><p>Gensler’s remarks followed a ruling in the SEC v. Ripple lawsuit in which a federal judge said <a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a> was not necessarily a security. Though the SEC chair said the commission would be <a href=\"https://cointelegraph.com/news/lawmaker-calls-sec-chair-reassess-stance-crypto-following-ripple-ruling\">assessing the case</a>, his testimony before the committee suggested that his position may not have changed on regulation by enforcement.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-19T21:11:58.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting the Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Several spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund applications made their way to the Federal Register this week, giving investors a clearer timeline on the Securities and Exchange Commission's path to either approving or rejecting the filings. Global securities marketplace Nasdaq is halting the launch of its own cryptocurrency custody, previously planned to roll out by the end of the second quarter 2023. Meanwhile, Democratic presidential candidate Robert F. Kennedy Jr. has vowed to back the U.S. dollar with Bitcoin or precious metals.</p><h2>Spot Bitcoin ETF applications make their way to Federal Register</h2><p>Multiple spot Bitcoin ETF applications have been <a href=\"https://cointelegraph.com/news/spot-crypto-etf-applications-federal-register-sec-approval\">published in the Federal Register</a>, raising optimism in the crypto community that the path to approval was gradually being laid.</p><p>According to July 19 records, the Federal Register listed the spot Bitcoin ETF applications of BlackRock, Fidelity, Invesco Galaxy, VanEck and WisdomTree. The listings give the Securities and Exchange Commission a window of up to 240 days to accept or request the applications’ proposed rule changes that would pave the wave for a spot Bitcoin ETF to be listed. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">UPDATE: Not much of one though... As predicted and as expected those <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ETF applications all hit the federal register today.<br><br>BlackRock, VanEck, WisdomTree, Fidelity, and Invesco/Galaxy. <a href=\"https://t.co/aAFxK1Rqp7\">https://t.co/aAFxK1Rqp7</a> <a href=\"https://t.co/B9C1oF3yhQ\">pic.twitter.com/B9C1oF3yhQ</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1681664749166051329?ref_src=twsrc%5Etfw\">July 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Before crypto enthusiasts get too excited, it’s important to note that the Federal Register publications were expected after the firms filed the initial applications in June. To date, the SEC has not given any indication that it’s prepared to approve a spot investment vehicle for digital assets. </p><h2>Nasdaq halts launch of cryptocurrency custody service</h2><p>Global securities marketplace Nasdaq is halting the launch of its own cryptocurrency custody that it previously planned to roll out by the end of the second quarter 2023.</p><p>Nasdaq has suspended the launch of its digital asset custody business because of regulatory risks in the United States, CEO Adena Friedman <a href=\"https://ir.nasdaq.com/events/event-details/nasdaq-second-quarter-2023-results\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> during the Q2 results call.</p><p>“This quarter, considering the shifting business and regulatory environment in the United States, we have made the decision to halt our launch of the U.S. digital assets custodian business and our related efforts to pursue relevant license,\" Friedman stated.</p><p>Nasdaq CEO emphasized that the company remains committed to digital asset business development, stating:</p><blockquote>\"We continue to build and deliver technology capabilities that position Nasdaq as a leading digital assets software solutions provider to the broader global industry. This includes advancing our custody solution as a technology platform to serve the broader, global digital assets marketplace.\"</blockquote><p>Friedman also added that Nasdaq will be closely monitoring the market for potential regulatory events in the coming months.</p><h2>RFK Jr. vows Bitcoin-backed US dollar if made president</h2><p>United States presidential hopeful Robert F. Kennedy Jr. <a href=\"https://cointelegraph.com/news/rfk-jr-will-back-us-dollar-with-bitcoin-if-president\">promised to back</a> the U.S. dollar with Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) if he's elected president in 2024.</p><p>Kennedy spoke at an event on July 19 and claimed backing the dollar with precious metals or Bitcoin — what he called \"hard currency\" — could help re-stabilize the American economy.</p><blockquote>“My plan would be to start very, very small, perhaps 1% of issued T-bills would be backed by hard currency, by gold, silver platinum or Bitcoin.”</blockquote><p>The backing process would be gradual and the amount of backing for the dollar would be adjusted depending on the plan’s success, he said.</p><p>Kennedy also vowed that Bitcoin to U.S. dollar conversions would be exempted from capital gains taxes under his presidency.</p><p>The proposed exemptions would spur investment and incentivize business to the U.S. instead of other crypto-friendly jurisdictions such as Singapore or Switzerland, Kennedy believes.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-19T21:30:33.000Z",
    "title": "US Securities Regulator Accepts Valkyrie’s Spot Bitcoin ETF Application",
    "url": "https://news.bitcoin.com/us-securities-regulator-accepts-valkyries-spot-bitcoin-etf-application/",
    "description": "<img width=\"768\" height=\"433\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2187267093-768x433.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Securities Regulator Accepts Valkyrie’s Spot Bitcoin ETF Application\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2187267093-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2187267093-1024x577.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2187267093-768x433.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2187267093-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2187267093-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2187267093-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2187267093.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Securities and Exchange Commission (SEC) has formally accepted the spot bitcoin ETF application filed by asset manager Valkyrie. The move, which opens the door to an official review process, follows last week’s acknowledgment of Blackrock’s bitcoin ETF application. U.S. SEC to Review Valkyrie’s Bitcoin ETF Application, Expects Public Feedback The United States’ securities [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T21:36:51.000Z",
    "title": "How To Use The High-Frequency Cryptocurrency Market’s Adaptive Market Hypothesis",
    "url": "https://www.cryptopolitan.com/cryptocurrency-adaptive-market-hypothesis/",
    "description": "The emergence of digital currencies, particularly cryptocurrencies, has brought significant changes to the financial landscape. As these digital assets gain popularity and attention, it becomes crucial to understand the dynamics of their market efficiency, especially in relation to time-varying conditions. Market efficiency, a concept extensively studied in neoclassical finance, determines whether prices fully reflect all ... <a title=\"How To Use The High-Frequency Cryptocurrency Market’s Adaptive Market Hypothesis\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cryptocurrency-adaptive-market-hypothesis/\" aria-label=\"More on How To Use The High-Frequency Cryptocurrency Market’s Adaptive Market Hypothesis\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T21:23:13.000Z",
    "title": "Does China determine Hong Kong’s crypto aspirations?",
    "url": "https://www.cryptopolitan.com/china-determine-hong-kong-crypto-aspirations/",
    "description": "As the crypto whirlwind sweeps across the globe, Hong Kong seems to be caught in its gust. However, this adoption wave isn&#8217;t just a local phenomenon; it&#8217;s a telltale sign of the undercurrents coursing through mainland China. The frenetic pace of cryptocurrency and Web3 adoption in Hong Kong, as suggested by Animoca&#8217;s co-founder, Yat Siu, ... <a title=\"Does China determine Hong Kong&#8217;s crypto aspirations?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-determine-hong-kong-crypto-aspirations/\" aria-label=\"More on Does China determine Hong Kong&#8217;s crypto aspirations?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T21:25:24.000Z",
    "title": "BREAKING: No Bitcoin Sale From Tesla, Electric Car Giant Holds On As BTC Bounces Back To $30,000",
    "url": "https://www.newsbtc.com/breaking-news-ticker/breaking-no-bitcoin-sale-from-tesla-electric-car-giant-holds-on-as-btc-bounces-back-to-30000/",
    "description": "Tesla has released its Q2 2023 earnings report, which has been highly anticipated by investors, and it shows no signs of Bitcoin movement for the electric car giant in the previous quarter. The report shows that the company has had a record-breaking quarter, with the best-ever production and deliveries and revenue approaching $25 billion in a single quarter, despite the current macroeconomic environment. Tesla Stands Firm On BTC Investment One important aspect of the report is the section on Tesla&#8217;s balance sheet, which shows the company&#8217;s holdings in digital assets, specifically Bitcoin (BTC). As of June 30, 2023, Tesla&#8217;s digital assets holdings stood at $184 million, which is the same amount as the previous quarter.  This indicates that the company has not sold any of its Bitcoin holdings, despite the recent volatility in the cryptocurrency market. Related Reading: Dogecoin Barks Upwards: Elon Musk’s Twitter Feed Sends DOGE Up 3% Tesla&#8217;s decision to hold onto its Bitcoin holdings is significant, as it shows the company&#8217;s confidence in the long-term potential of digital assets.  This is in line with Elon Musk&#8217;s previous statements about Bitcoin and other cryptocurrencies, in which he has expressed support for their underlying technology and potential to transform the financial industry. Bitcoin Rebounds To $30,000 At present, the largest cryptocurrency in terms of market capitalization and trading volume has surpassed the $30,000 threshold, recovering from its sharp decline to $29,400 on Tuesday.  Despite reaching a new yearly high of $31,800 on July 13th, Bitcoin&#8217;s bullish momentum suddenly dissipated, causing a retracement of over 1.6% in the last 14 days. However, the cryptocurrency has managed to maintain a 12% gain over the 30 days. In the event of further price drops and a failure to consolidate above the $30,000 mark, Bitcoin has the advantage of its 50-day Moving Average, which could serve as a strong support level at $29,100. However, sudden price movements have become increasingly common in recent months, following the thaw of the crypto winter.  Related Reading: Bitcoin Exchange Inflow Spikes, Is This Bearish? Typically, when Bitcoin experiences a price drop, it is followed by a period of consolidation. As long as BTC does not drop below its 50-day and 200-day Moving Averages, it can be seen as a short-term victory for Bitcoin bulls who have weathered another round of selling pressure. It remains to be seen whether BTC&#8217;s nearest support level will be able to hold and prevent another decline attempt.  Featured image from Unsplash, chart from TradingView.com"
  }
]