[
  {
    "source": "CoinDesk",
    "date": "2023-11-15T13:50:00.000Z",
    "title": "Ethereum Platform Infura's Step Toward Decentralization Includes Microsoft, Tencent ",
    "url": "https://www.coindesk.com/tech/2023/11/15/ethereum-platform-infuras-step-toward-decentralization-includes-microsoft-tencent/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Infura, from the Ethereum developer ConsenSys, is so dominant that it's been cast as a potential single point of failure. Now it's creating a \"decentralized infrastructure network\" to help protect against outages – enlisting a \"federated\" group of partners."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-15T14:01:15.000Z",
    "title": "Play-to-Earn Mobile Dog Training Game 'Dogami Academy' Launched",
    "url": "https://decrypt.co/206108/play-to-earn-mobile-dog-training-game-dogami-academy-launched",
    "description": "Exclusively playable by Dogami NFT holders, Dogami Academy is an iOS and Android game that pays out crypto token rewards to players."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-15T14:01:11.000Z",
    "title": "NHL Breakaway Hockey NFT Collectibles Platform Opens to the Public",
    "url": "https://decrypt.co/206100/nhl-breakaway-hockey-nft-collectibles-platform-opens-public",
    "description": "The NHL's take on NBA Top Shot has opened up to everyone, with video highlights minted as collectibles on the Polygon network."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-15T14:01:02.000Z",
    "title": "Phantom Galaxies Launches in Early Access on Epic Games Store and Steam",
    "url": "https://decrypt.co/203678/phantom-galaxies-launches-in-early-access-on-epic-games-store-and-steam",
    "description": "The mecha combat title’s early access launch includes hours of core story gameplay, PvE multiplayer bounties and PvP battles."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-15T14:03:00.000Z",
    "title": "New York MoMA now has tokenized artworks in its permanent collection",
    "url": "http://cointelegraph.com/news/new-york-moma-token-art-nfts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/99bb26b6-0551-4ce9-b112-b3567358be9e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The museum’s acquisition of two NFTs marked its first on-chain and AI holdings. </p>\n                    <p><p>Generative art is proving Web3’s creative anchor in the traditional art world. Last month, New York’s Museum of Modern Art (MoMA) made headlines by acquiring Refik Anadol’s “Unsupervised — Machine Hallucinations” (2022) alongside an edition from last year’s “3FACE” project by Ian Cheng. These two mark the first-ever artificial intelligence (AI) and nonfungible token (NFT) additions to MoMA’s collection, already home to relics such as Andy Warhol’s soup cans and Vincent Van Gogh’s “Starry Night.”</p><p>The landmark acquisitions also supplement MoMA’s longtime legacy of pioneering exhibitions at the intersection of technology and art, from its 1968 show “The Machine as Seen at the End of the Mechanical Age” through this year’s “Signals: How Video Transformed the World.”</p><p>MoMA’s announcement arrived in tandem with an outline of the institution’s digital art programming for the fall and winter seasons ahead, including the debut of video artist Leslie Thornton’s latest work, “HANDMADE” (2023), and an online exhibition with Feral File opening early next year. Weeks before, MoMA had announced its on-chain Postcard project, too.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/91e6277e-9085-4a78-bc0a-d6b605a2bdae.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Sample data visualization, Unsupervised — Machine Hallucinations. Source: MoMA</em></figcaption></figure><p>“These new initiatives underscore MoMA’s longstanding commitment to support artists who experiment with emerging technologies to expand their visual vocabularies and creative exploration, increase the impact of their work and help us understand and navigate transformative change in the world,” the Museum’s release around their acquisitions states.</p><p>“I’m very proud to be included,” Cheng told Cointelegraph. “MoMA had previously acquired my ‘Emissaries’ trilogy of simulations in 2017. Their openness and enthusiasm for acquiring dynamic digital art is rare for an institution.”</p><h2>Unsupervised</h2><p>It’s the screensaver heard around the world. Whether you’re enamored or suspicious of this one-time Google artist-in-residence’s prolific and mesmerizing machine-learning abstractions, the odds are you’ve seen them. Anadol designed this one in particular with help from Nvidia. It feeds 138,151 pieces of visual metadata from MoMA’s collection to an algorithm that produces an AI imagination of art history through Anadol’s signature undulations. </p><p>Since its release in November 2022, “Unsupervised” has been reviewed by critics at Vulture, Artforum and more. The time it took to write those reviews says more than anything about the work’s import. Jerry Saltz’s half-baked hot takes don’t detract from the mental energy his writing requires. Haters alone haven’t made Anadol famous — he has scores of devoted fans if not collectors. MoMA opted to extend the work’s 24-foot tall display several times. It just came down on Oct. 29, but visitors who minted their proof-of-attendance protocol, or POAP, from the posted QR code still have a piece of the spectacle. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/73228722-9826-49dc-b521-671708e2511d.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Sample data visualization, Unsupervised — Machine Hallucinations. Source: MoMA</em></figcaption></figure><p>Noted NFT collector and founder of the club 1 OF 1 Ryan Zurrer made the work’s acquisition possible, along with the “RFC Collection,” led by Pablo Rodriguez-Fraile and Desiree Casoni. </p><p>“I tip my hat to the folks at MoMA for understanding the cultural zeitgeist of the moment,” Zurrer told <a href=\"https://www.artnews.com/art-news/artists/moma-acquires-refik-anadol-unsupervised-digital-art-nfts-1234681622/\" target=\"_blank\" rel=\"noopener nofollow\">ARTnews</a>. “Unsupervised went up two weeks before ChatGPT went public. AI is the defining topic of the moment, and MoMA captured that. I’m excited to donate this work to MoMA. But I need to acknowledge that this isn’t just a donation from me and [collector] Pablo Rodriguez-Fraile, but from Refik. He is bringing the servers and screens and the other components. The NFT is one part of this conceptual artwork that belongs to MoMA now.”</p><p><strong><em><a href=\"https://cointelegraph.com/magazine/i-spent-a-week-working-in-vr-it-was-mostly-terrible-however/\">Magazine: I spent a week working in VR. It was mostly terrible, however…</a></em></strong></p><p>While the Museum couldn’t clarify whether Anadol outright donated the hardware that enabled “Unsupervised” to go on view, we can assume that’s the case. Their release said Thornton’s “HANDMADE” will go on view in the same Gund Lobby where they displayed “Unsupervised” on a screen the very same size, “designed by and realized with thanks to Refik Anadol Studio.” </p><h2>3FACE</h2><p>Meanwhile, Cheng evades branding. A lifelong exploration of psychology through cutting-edge technologies defines his practice more than any single aesthetic. In fact, there are 4,096 unique editions of “3FACE” in existence, and not one of them was designed explicitly by Cheng’s hand. Works in the generative project depict adaptive, ongoing visual portraits of their owners, crafted using data gleaned from their wallets at any given moment. MoMA calls it his “most ambitious experimental artwork to date to explore blockchain technologies and the decentralization of data,” which expands upon “the artist’s interest in the capacity of humans to relate to change.” </p><p>In his efforts to represent and shape the ephemeral mind, Cheng told <a href=\"https://www.rightclicksave.com/article/can-ai-unlock-the-unconscious\" target=\"_blank\" rel=\"noopener nofollow\">Right Click Save</a> last year he believes “art can play a role in upgrading the unconscious response we have to complexity.” “3FACE” honors the depths of every person — and, because it’s dynamic, their ability to change.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/fae7b6fe-1ce0-4379-a743-134556dc92f1.png\"  /><figcaption style=\"text-align: center;\"><em>Image from 3FACE. Source: MoMA</em></figcaption></figure><p>The NFT platform Outland Art donated its “3FACE” to MoMA’s collection. “Jason Li and Chris Lew advised a lot and helped flesh out the team to turn the idea into a reality,” Cheng told Cointelegraph. “I would not have made ‘3FACE’ without Outland.” </p><p>The work’s <a href=\"https://www.moma.org/collection/works/442076\" target=\"_blank\" rel=\"noopener nofollow\">public entry</a> on MoMA’s website doesn’t list what number out of the whole series it is or what wallet it belongs to. MoMA didn’t respond to Cointelegraph’s request for comment, but based on the way “3FACE” works and the fact that MoMA just started collecting on-chain artworks, this might be the “3FACE” interpretation of a wide open wallet populated only by Anadol’s “Unsupervised.”</p><h2>Another chapter in art history</h2><p>Carrying the torch from former contentious and pioneering art forms like photography, generative art has forced this generation of artists to reassess what exactly makes art valuable. </p><p>“The endgame of generative AI tooling is a new immediacy between thought and visual articulation,” Cheng mused about what’s next for AI art. “We’re used to the immediacy between thought and written or verbal expression. A writer, with no intermediary help, can construct a novel. Imagine if you, with no intermediary help, could construct a movie. As with writing fiction, the filmmaker is capped only by their own imagination, their taste, the quality of their questions, their courage to pursue gray truths, and their understanding of human behavior.” </p><p>Technology will continually evolve, but it’s the evolution of artists’ abilities in using it that divides what’s merely eye-catching from what’s impactful. Not that those two are mutually exclusive — even though MoMA’s Anadol acquisition is akin to the institution buying itself a Louis Vuitton bag, what society calls luxury is history on its own. </p><p><strong><em><a href=\"https://cointelegraph.com/news/binance-blockchain-week-turkey-crypto-industry-cz\">Recent: No CZ, no problem: Binance Blockchain Week showcases Turkish crypto industry</a></em></strong></p><p>Anadol and Cheng both work predominantly with data while making AI art. The emergent properties of their processes have implications. “Unsupervised” begs the question: <em>What is art history?</em> — a fraught topic traditional art historians argue over without even breaching painting alone. By virtue of its premise, “3FACE” asks those who engage with it how they’d quantify a gnarled human psyche. It’s one of the few projects that uses the ledger as anything more than a manner of transacting.</p><p>Museums such as the Los Angeles County Museum of Art and the Centre Pompidou started collecting NFTs back in the boom days. MoMA’s decision to lend credence to such works now marks a new watershed moment.</p><p>“We pinch our nose at ‘AI art’ right now because the first experiments look like experiments, but zoom out 10 years from now,” Cheng said. “The ease of producing visually refined expression will unlock a lot of artistic agency from a greater plurality of people, and this is a good thing.”</p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-15T13:50:00.000Z",
    "title": "Microsoft, Tencent and other tech giants join Decentralized Infura Network",
    "url": "http://cointelegraph.com/news/microsoft-tencent-infura-network-partnership",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/ef26f0cf-4425-476e-99a0-f9c28b2138dd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Infura said the partnerships mark a major milestone in decentralizing and making its network more censorship-resistant.</p>\n                    <p><p>Microsoft, Tencent and 16 other Web2 giants have partnered with Consensys on its mission to decentralize the Infura network — the key point of access to Ethereum for much of the decentralized finance (DeFi) sector.</p><p>The partnerships aim to increase decentralization on the Infura network — key to preventing outages of the Web3 services that leverage it, including the wallet service MetaMask.</p><p>Speaking to Cointelegraph, Consensys senior product manager Andrew Breslin said the significance of the partnerships was less about “who they were” and more about the big-name firms aligning with Infura in “wanting to decentralize every layer of the blockchain infrastructure stack.”</p><p>Scheduled for a Q4 launch, the Decentralized Infura Network (DIN) stands as a solution to the problem of centralization for Infrua, with the network currently controlled by Consensys, meaning there remains a single point of failure. </p><p>“The cost and complexity involved with running a service like Infura was kind of limiting in terms of who we could partner with to serve this traffic,” said Breslin. “Now there’s this huge flourishing ecosystem of Web3 infrastructure providers that can provide a service that’s complimentary to Infura.”</p><p>Breslin said one of the first major features offered in the DIN is “failover support” for the Ethereum and Polygon networks. Failover support means that traffic can be re-routed to one or multiple DIN partners in an outage, guaranteeing higher uptime rates in the long run. </p><p>Upon launch, the DIN will allow for more reliable and censorship-resistant access to Ethereum as decentralized applications (DApps) won’t need to rely on a single service provider located in just one place, Breslin said. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">️ Infura, alongside our partners, is pushing the boundaries of decentralization. <br><br>We&#39;re making a significant stride in the development of the Decentralized Infrastructure Network (DIN), Read the two-part series </p>&mdash; Infura (@infura_io) <a href=\"https://twitter.com/infura_io/status/1724507748727926954?ref_src=twsrc%5Etfw\">November 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Developed by the blockchain software giant Consensys, Infura offers a development suite that provides API access to the Ethereum and IPFS networks. At present, Infura is the access point for most DApps to access real-time on-chain data from the Ethereum blockchain.</p><p>In November 2020, the centralization issue came to light when the MetaMask wallet stopped working <a href=\"https://cointelegraph.com/news/infura-is-to-blame-for-metamask-s-violation-of-the-crypto-spirit\">due to Infura suffering a temporary outage</a>. Several centralized exchanges and DeFi projects were also affected by the downtime.</p><p>Decentralizing blockchain data providers on the Infura network is critical for censorship resistance in the long term because, at present, centralized data providers can be shut down with a single well-planned attack or sufficient legal action.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/consensys-sunsets-truffle-ganache-shift-focus-metamask-snaps-sdk\"><strong><em>‘End of an era’ — Consensys sunsets Truffle, Ganache amid shift to MetaMask Snaps</em></strong></a></p><p>Speaking to the roster of newly announced partners, Breslin said the current lineup was not a closed set and that Infura wanted to let other “highly reliable” internet infrastructure providers know that Infura is open to them joining the DIN as well. </p><blockquote>“The success of DIN is reliant on us collaborating with more and more operators over time.”</blockquote><p>The cohort of new companies is working with Infura in what Breslin called the “federated phase” of the DIN — a temporary trial period where the network remains centralized. </p><p>“Infura and these 18 partners are now participating in this federated phase of DIN, which means that we work as equal partners,” said Breslin.</p><p>In the future, Breslin said the DIN would ideally be governed as a decentralized autonomous organization or some other type of governance structure that ensures each partner has a democratically weighted say in the direction of the network. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-zero-knowledge-voting-finance/\"><strong><em>Beyond crypto — Zero-knowledge proofs show potential from voting to finance</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-15T13:45:43.000Z",
    "title": "Singapore’s Monetary Authority launches new asset tokenization pilots with Project Guardian expansion",
    "url": "https://cryptoslate.com/singapores-monetary-authority-launches-new-asset-tokenization-pilots-with-project-guardian-expansion/",
    "description": "<p>The Monetary Authority of Singapore (MAS) has escalated its efforts to expand its asset tokenization initiatives under Project Guardian. This move aims to catalyze the institutional adoption of digital assets, aiming to unleash liquidity, unlock new investment opportunities, and enhance the efficiency of financial markets. A key advancement in this endeavor is the initiation of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/singapores-monetary-authority-launches-new-asset-tokenization-pilots-with-project-guardian-expansion/\">Singapore&#8217;s Monetary Authority launches new asset tokenization pilots with Project Guardian expansion</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-15T13:54:41.000Z",
    "title": "GigaChadGPT Unveils Innovative AI-Driven Cryptocurrency Advancements",
    "url": "https://cryptodaily.co.uk/2023/11/gigachadgpt-unveils-innovative-ai-driven-cryptocurrency-advancements",
    "description": "GigaChadGPT Unveils Innovative AI-Driven Cryptocurrency Advancements"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-15T13:52:16.000Z",
    "title": "dYdX Chain Enters Beta Mainnet Stage: Launches Active Trading",
    "url": "https://cryptodaily.co.uk/2023/11/dydx-chain-enters-beta-mainnet-stage-launches-active-trading",
    "description": "The beta mainnet stage of the dYdX chain has finally gone live, thus launching active trading across different markets."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-15T13:39:33.000Z",
    "title": "Experts Named Three Altcoins To Watch This Week – Avalanche (AVAX), Fantom (FTM), Chainlink (LINK)",
    "url": "https://cryptodaily.co.uk/2023/11/experts-named-three-altcoins-to-watch-this-week-avalanche-avax-fantom-ftm-chainlink-link",
    "description": "Discover insights from leading experts on three promising altcoins to watch this week: Avalanche (AVAX), Fantom (FTM), and Chainlink (LINK). Get an in-depth analysis of market trends, performance forecasts, and investment potential for these emerging cryptocurrencies."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-15T14:08:44.000Z",
    "title": "PlayStation Plus November 2023: A Mixed Bag of Free Games",
    "url": "https://www.cryptopolitan.com/playstation-plus-november-2023/",
    "description": "As the gaming world eagerly anticipates the monthly offerings from PlayStation Plus, November 2023 brings a varied selection of free games to subscribers across different tiers. With titles ranging from exciting new releases to remastered classics, the latest lineup has elicited mixed reactions from the gaming community. PlayStation plus premium tier: Evil West For PlayStation ... <a title=\"PlayStation Plus November 2023: A Mixed Bag of Free Games\" class=\"read-more\" href=\"https://www.cryptopolitan.com/playstation-plus-november-2023/\" aria-label=\"More on PlayStation Plus November 2023: A Mixed Bag of Free Games\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-15T13:54:44.000Z",
    "title": "GigaChadGPT Unveils Innovative AI-Driven Cryptocurrency Advancements",
    "url": "https://www.cryptopolitan.com/gigachadgpt-unveils-innovative-ai-driven-cryptocurrency-advancements/",
    "description": "NYC, New York, November 15th, 2023, Chainwire In the ever-evolving landscape of the cryptocurrency world, a new legend is emerging – GigaChadGPT ($GIGA). This revolutionary token combines the alpha energy of the internet legend GigaChad with the unmatched power of Artificial Intelligence. GigaChadGPT is the combination of the intellect of a genius paired with the physique ... <a title=\"GigaChadGPT Unveils Innovative AI-Driven Cryptocurrency Advancements\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gigachadgpt-unveils-innovative-ai-driven-cryptocurrency-advancements/\" aria-label=\"More on GigaChadGPT Unveils Innovative AI-Driven Cryptocurrency Advancements\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-15T14:00:03.000Z",
    "title": "Lido DAO (LDO) New All-Time High? One Analyst’s Perfect Setup To $37",
    "url": "https://www.newsbtc.com/lido-dao/lido-dao-ldo-high-37/",
    "description": "Lido DAO has grown over the years to become the leading liquid staking protocol on the Ethereum network and its native LDO token has enjoyed tremendous success on the back of this. The protocol’s continuous growth has been purported to be what will push LDO to new all-time highs and one crypto analyst has revealed how high the token’s price could go. Lido DAO To Beat Previous $7.22 All-Time High Back in the bull run of 2020-2021, the price of Lido DAO’s native LDO token soared with the rest of the market and eventually touched its all-time high price of $7.22. Naturally, this has been the level that bulls have been trying to get back to that would put all holders back in profit. However, crypto analyst Weslad expects the altcoin to completely clear this all-time high price by at least a 4x. Related Reading: BlackRock’s XRP ETF Filing, Everything You Need To Know In an analysis posted on the TradingView website, Weslad reveals the roadmap for LDO’s price to rise another 1,400% from here. According to the analyst, the LDO/USDT has been showing a “robust ascending triangle pattern.” This pattern, the analyst says, suggests that LDO could move to test the Neckline which is a critical supply zone for the asset. The analyst who is obviously very bullish on LDO expects that this level will be breached and that the altcoin will eventually turn this resistance mark into support. “The Buy back area on the chart should give all the bull an opportunity to accumulate the coin before major move begins and at same time the chart indicates the outlined target,” Weslad says. The first target in this setup is already above its ATH price at $9.,176. From here, the analyst expects another bounce up to take the Lido DAO price above $15.9, double its previous all-time high. But it still doesn’t end here. Source: Tradingview.com A final setup outlined by the crypto analyst brings the next target to $29.3. After that comes the coveted $37 level, which is at the very peak of this expected rally. Just below the buy back zone at around $1.9, the analyst outlines a stop loss zone below $1.473. “The stop loss range is an important area that need to be watched closely should incase price turn around,” the analyst warns. LDO Enters Top Gainers The bullishness surrounding Lido DAO and the native token LDO is not without metric, especially given the token’s performance in the last week. LDO has seen its price rise approximately 27% in one week to breach the $2.47 mark. Related Reading: Bitcoin Price Ready To Go ‘Supersonic’, Analyst Says Even more impressive is its 24-hour positive moves that have come out to 10.5%. This rise puts it in the list of the top 10 gainers in the last day behind the likes of Kaspa (KAS) and PancakeSwap (CAKE). LDO’s large transaction volume has also fallen in the last week which suggests that whales are winding down their activities. While this could mean there is not a lot of buying going on by these large whales, it also suggests there is not a lot of selling happening either. This could point toward a tendency to hold and wait for better prices rather than selling tokens now. LDO breaks above $2.5 &#124; Source: LDOUSDT on Tradingview.com Featured image from Coins.ph, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-15T14:02:00.000Z",
    "title": "5 Best Altcoins To Buy This Week as the Market Begins to Rebound",
    "url": "https://coinedition.com/5-best-altcoins-to-buy-this-week-as-the-market-begins-to-rebound/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"5 Best Altcoins To Buy This Week as the Market Begins to Rebound\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Meanwhile, he also predicted that MATIC could rise to as high as $1.50 if it breaks above $0.92. In a YouTube video, the analyst mentioned that an upcoming gaming conference could lead to GMT and YGG surging. An analyst from Crypto Banter shared that RUNE, SOL, MATIC, YGG, and GMT are good altcoins to purchase [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/5-best-altcoins-to-buy-this-week-as-the-market-begins-to-rebound/\">5 Best Altcoins To Buy This Week as the Market Begins to Rebound</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-15T13:41:00.000Z",
    "title": "Delaware Alerts the DOJ Regarding a Fake Blackrock XRP ETF Filing",
    "url": "https://coinedition.com/delaware-alerts-the-doj-regarding-a-fake-blackrock-xrp-etf-filing/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/Delaware_Alerts_the_DOJ_Regarding_a_Fake_Blackrock_XRP_ETF_Filing-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A hoax filing for a BlackRock Inc. &#8220;iShares XRP Trust&#8221; fund has prompted the Delaware Office of the Secretary of State to report the matter to the Department of Justice, as reported by Bloomberg Law. The fictitious registration appeared on the official state government website, implying that the asset management giant was getting ready to [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/delaware-alerts-the-doj-regarding-a-fake-blackrock-xrp-etf-filing/\">Delaware Alerts the DOJ Regarding a Fake Blackrock XRP ETF Filing</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-15T13:40:20.000Z",
    "title": "MultiversX (EGLD) Price Prediction 2023-2030: Will EGLD Price Hit $100 Soon?",
    "url": "https://coinedition.com/multiversx-elrond-egld-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Elrond-EGLD-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Elrond (EGLD) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Elrond-EGLD-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Elrond-EGLD-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Elrond-EGLD-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Elrond-EGLD-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Elrond-EGLD-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The bullish EGLD price prediction ranges from $75.73 to $79.61. EGLD price might also reach $84.58 in 2023. EGLD’s bearish market price prediction for 2023 is $14.04. MultiversX, formerly known as Elrond, is a blockchain protocol that utilizes sharding to provide incredibly fast transaction rates. The project identifies itself as a technology ecosystem for the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/multiversx-elrond-egld-price-prediction/\">MultiversX (EGLD) Price Prediction 2023-2030: Will EGLD Price Hit $100 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]