[
  {
    "source": "Decrypt",
    "date": "2023-08-08T23:41:01.000Z",
    "title": "Moody's Bearish Bank Ratings Could Presage Another Volatile Season",
    "url": "https://decrypt.co/151787/moodys-bearish-bank-ratings-could-presage-another-volatile-season",
    "description": "Traditional finance firms have previously been dinged for crypto exposure."
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-09T00:02:26.000Z",
    "title": "ARK Invest’s CEO Says SEC Could Approve Multiple Spot Bitcoin ETFs Simultaneously",
    "url": "https://www.newsbtc.com/news/bitcoin/sec-could-approve-multiple-bitcoin-etfs/",
    "description": "ARK Invest CEO Cathie Wood has sparked speculation with her recent prediction that the United States Securities and Exchange Commission (SEC) may potentially grant approval for multiple Spot Bitcoin exchange-traded funds (ETFs) simultaneously. Deviation From The Norm For Spot Bitcoin ETFs In a recent interview with Bloomberg on August 7, Cathie Wood shared her insight that the SEC might opt for a groundbreaking strategy by approving more than one Bitcoin ETF at the same time. Related Reading: PayPal’s PYUSD Launch Triggers Calls For Stablecoin Bill Wood&#8217;s assertion, &#8220;I think the SEC, if it’s going to approve a Bitcoin ETF, will approve more than one at once,&#8221; has captured attention, especially given her prior assurance that her firm would lead in securing approval for a spot Bitcoin ETF. Wood&#8217;s projection deviates from the conventional practice of sequential ETF approvals. By envisioning a simultaneous approval scenario, she introduces a novel approach that could streamline the regulatory process. This potential shift aims to foster a balanced and inclusive investment landscape, catering to an expected demand of over $50 billion. Implications For The Cryptocurrency Industry Historically, the SEC has not granted approval for spot Bitcoin ETFs, while permitting the listing of ETFs tied to crypto futures. Wood&#8217;s forward-looking statement emerges amidst a surge in applications from major players like BlackRock Inc, Fidelity, WisdomTree, VanEck, and Invesco, all vying for the approval of similar crypto ETFs as ARK.  Wood&#8217;s forecast also emphasizes the significance of strategic marketing. Given the anticipated resemblance among various funds, Wood suggests that issuers&#8217; marketing prowess will be crucial in setting them apart as a race for dominance is expected. This insight underscores the competitive edge sought by applicants in a rapidly evolving sector. BTC price recovers as positive sentiment grows &#124; Source: BTCUSD on Tradingview.com As Cathie Wood&#8217;s prediction reverberates through the financial realm, industry observers await  SEC&#8217;s response. With a significant deadline for ARK&#8217;s application looming on August 13, amidst speculation of potential delays, Wood suggested that the deadline might pass and be extended but then the date will be eagerly waited on.  Although Ark Invest filed for its spot Bitcoin ETFs application on May 15, earlier than others like BlackRock who filed its application on June  15, this was thought to be a race for winners or losers according to Cathie&#8217;s &#8220;first in line&#8221; phrase to favor Ark Invest. However, her revised view makes the race for Spot Bitcoin ETFs and SEC ruling more interesting. This innovative forecast accentuates the intersection of forward-thinking and regulatory dynamics, highlighting an era where digital assets are increasingly integrated within traditional financial frameworks, especially the recent push for ETFs. Related Reading: Valkyrie Unveils Double-Barreled Approach To Launch An Ethereum ETF Alongside A Bitcoin ETF Wood is known for her unwavering conviction in disruptive innovations and the companies behind them with her investment management firm ARK Invest boasting numerous high-value stocks like CoinBase Global (COIN), Tesla(TSL), and Block (SQ), among others.  Wood also reportedly bought $100,000 worth of Bitcoin years ago when it was sold for $250 apiece and the CEO revealed that she has never sold a single BTC. Featured image from MarketWatch, chart from Tradingview.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-08T23:59:48.000Z",
    "title": "Will Record Low Volatility Awaken A Behemoth Bitcoin Surge? 4,000% Signal Returns",
    "url": "https://www.newsbtc.com/bitcoin-news/will-record-low-volatility-awaken-a-behemoth-bitcoin-surge-4000-signal-returns/",
    "description": "Bitcoin price has been ranging around $30,000 for most of 2023, taking even the highest timeframes down to a record low volatility state — something highly unusual for cryptocurrencies. As a result, Historical Volatility in the 6W BTCUSD chart has fallen to the second lowest ever reading. The last time this signal appeared, it awakened a behemoth rally. Prices soared in the short- and long-term. Keep reading to find out by how much. Low Volatility Suggests Behemoth Bitcoin Rally Could Be Coming NewsBTC has extensively covered the lack of volatility in Bitcoin using the Bollinger Bands. The Bollinger Bands are part of a trend-following, band-breakout trading system that also can be used to measure volatility. But it’s not the only way to read it. Other volatility metrics include Implied Volatility, which uses the VIX to potentially predict future volatility, and Historical Volatility (HV). HV, just like it sounds, looks at volatility from the past. Related Reading: Why Low Volatility Bitcoin Could Last A Lot Longer The 6W Historical Volatility in BTCUSD is now at its second-lowest level ever. This is important because when an extended sideways phase ends, it ends by awakening a monster rally or decline. Historical Volatility is the second lowest ever &#124; BTCUSD on TradingView.com Is Another Monster 4,000% Move In BTCUSD Possible Considering it’s only happened once before, the sample size is too small to come to a conclusion about which direction prices might head. However, the last time the 6W Historical Volatility got this low, and then broke out, the direction was up. Related Reading: Bitcoin Bollinger Bands Are The Tightest Ever, What Happens Next? Not only was it up, but it was an immediate more than 60% move higher in a single 6W candle. The move that began around March 2016 also kicked off a more than year-long bull market that ended with more than 4,000% ROI following the period of inactivity. The power of volatility once it returns to an asset long trending sideways cannot be understated. Another 4,000% is unlikely after seven years of adoption, but something massive is waking up regardless of the final numbers and direction. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-09T00:00:00.000Z",
    "title": "Crypto Analyst Predicts USTC Repeg Following Community Efforts",
    "url": "https://coinedition.com/crypto-analyst-predicts-ustc-repeg-following-community-efforts/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Crypto Analyst Shares Some of His Strategies for Finding Gems\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-4-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-4-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-4-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a video posted on Youtube, ClayBro, a crypto analyst, says the LUNC USTC repeg is back on track. In recent weeks, the Terra Luna Classic community has made several proposals and plans towards the LUNC USTC repeg. According to the YouTuber, these current efforts show the community may achieve their desired goals. The community [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-analyst-predicts-ustc-repeg-following-community-efforts/\">Crypto Analyst Predicts USTC Repeg Following Community Efforts</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-09T00:00:11.000Z",
    "title": "Analyst Predicts Deep Correction for Sam Altman’s Worldcoin, Updates Outlook on Solana and Two Other Altcoins",
    "url": "https://dailyhodl.com/2023/08/08/analyst-predicts-deep-correction-for-sam-altmans-worldcoin-updates-outlook-on-solana-and-two-other-altcoins/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/deep-correction-worldcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/deep-correction-worldcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/deep-correction-worldcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/deep-correction-worldcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/deep-correction-worldcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/deep-correction-worldcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/deep-correction-worldcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed analyst believes that the native token of the crypto project co-created by ChatGPT founder Sam Altman looks poised for a severe correction. Pseudonymous analyst Altcoin Sherpa tells his 196,400 X followers that he&#8217;s bearish on Worldcoin (WLD), an artificial intelligence-based crypto project that uses iris-scanning technology. According to the trader, WLD is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/08/analyst-predicts-deep-correction-for-sam-altmans-worldcoin-updates-outlook-on-solana-and-two-other-altcoins/\">Analyst Predicts Deep Correction for Sam Altman’s Worldcoin, Updates Outlook on Solana and Two Other Altcoins</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]