[
  {
    "source": "Crypto Daily",
    "date": "2023-07-03T17:45:00.000Z",
    "title": "Monolith Crypto Price Prediction: Uwerx (WERX) Continues To Soar",
    "url": "https://cryptodaily.co.uk/2023/07/monolith-crypto-price-prediction-uwerx-werx-continues-to-soar",
    "description": "<p class=\"s7\">Uwerx is a new project seeking to reconceptualize the gig economy with its revolutionary features. This accounts for its presale success and the increased adoption it has been gaining. Due to these, analysts predict a bright future for the project, which has shown strong potential to keep soaring in the crypto winter. </p>\n<p class=\"s7\">On the other hand, Monolith (TKN) is struggling to beat bearish sentiments as the bears continue to dominate over the token. This article looks at Monolith&rsquo;s (TKN) predictions, what Uwerx is all about, and why you should quickly become a WERX holder.</p>\n<p class=\"s9\">&gt;&gt;BUY WERX TOKENS NOW&lt;&lt;</p>\nWhat The Charts Say About Monolith (TKN)\n<p class=\"s7\">The crypto market considers Monolith (TKN) a near-dead crypto as it has only recorded a few transactions or trading activities for a long time. This has caused Monolith (TKN) to see a huge plunge without signs of recovery. </p>\n<p class=\"s7\">Monolith (TKN) currently dines with the bear as it has remained at the bottom, with predictions showing it might record only a negligible price increase. Monolith (TKN) has declined by almost 5% in the past week, and further decline is imminent. </p>\n<p class=\"s7\">Monolith (TKN) is seeing increased selling pressure as most token holders quickly sell their tokens and move to more active platforms.</p>\n<p class=\"s7\">Monolith (TKN) Launched Its Visa Debit Card</p>\n<p class=\"s7\">Monolith (TKN) is a decentralized banking powered by Ethereum (ETH), enabling users to use its Visa debit card to store or spend their tokens globally. Monolith (TKN) provides a DeFicontract wallet where users can store their tokens and use the Visa debit card to make in-app crypto purchases. </p>\n<p class=\"s9\">&gt;&gt;BUY WERX TOKENS NOW&lt;&lt;</p>\nUwerx (WERX) Continues Smashing Through Its Presale\n<p class=\"s7\">Uwerx's surging presale has been marveling, quickly reaching its final stage, stage 5. This exceeded initial predictions, and due to demands, WERX allocation for the presale was increased to 427,500,000 (57%). Stage 5 has 72,500,000 WERX available, and the total supply of WERX is 750,000,000.</p>\n<p class=\"s7\">The WERX price increase is more surprising. WERX started trading at $0.005 but is now at $0.047725, with more price increases unavoidable. Also, the WERX launch price was increased to $0.095 - $0.115 due to the token&rsquo;s rising value.</p>\n<p class=\"s7\">There is a 15% purchase bonus to increase users&rsquo; profits, and the presale ends on July 31. </p>\nUwerx (WERX) Has Leverage Over Other Freelancing Platforms\n<p class=\"s7\">Global gig workers are expected to reach 78 million in 2023. Hence, Uwerx is making significant moves to increase adoption and stand out from centralized platforms. It brings blockchain technology and a 1% service fee, features yet to be seen in freelancing. There is also the UwerxVault which promotes user rewards and engagement.</p>\n<p class=\"s7\">Its platform&rsquo;s Alpha version launched a few months back and has been gaining traction with more features added. The platform&rsquo;s features now include the Initial Step of Job Creation, My Activity Page, Initial Step of Finding Talent, Hiring Dashboard Page, Logging In and Sign-Up Pages, Freelancer or Client Initiation, Job Creation Process Page, and Forgot Password.</p>\n<p class=\"s7\">The Job Application Page was remodeled to the Post Job and Apply Page to quicken users' job applications. New features like the Tools and Client and Freelancer Dashboards are in the works. </p>\n<p class=\"s7\">Uwerx will transition to the Beta version, which is now in the works so users can test the platform themselves. InterFi Network and SolidProof have performed audit approvals on Uwerxto ensure its security. The platform has gained over 1,825 Telegram members, 1,652 Twitter followers, and 6,953 sign-ups.</p>\n<p class=\"s7\">The team's agile methodology to release the project in bits and modify the platform based on users' feedback has also contributed to the project&rsquo;s success. They are eager to hear from the community, and feedback can be emailed to feedback@uwerx.network. </p>\n<p class=\"s7\">To show their dedication to users, the team&rsquo;s token allocation is now only 7% following their decision to reduce it. For sustainability, they will forfeit ownership of the smart contract once the project becomes listed on centralized exchanges. Also, they began a nine-month liquidity lock on their tokens to prevent rug pulls. This started on June 7, after the 82.8% vote it received from the community to start immediately. </p>\n<p class=\"s7\">A Test Airdrop will be performed to verify wallet addresses for users, for which 98.2% of the community is in support.</p>\n<p class=\"s7\">Uwerx will be a force to reckon with in the freelancing industry. To do that, you have to become a WERX holder. It is best to do so now and maximize the 15% purchase bonus. </p>\nTo learn more or join the presale, follow the links below: \n<p class=\"s7\">Website: https://www.uwerx.network</p>\n<p class=\"s7\">Presale: http://invest.uwerx.network</p>\n<p class=\"s7\">Telegram: https://t.me/uwerx_network</p>\n<p class=\"s7\">Twitter: https://twitter.com/uwerx_network</p>\n<p class=\"s7\">&nbsp;</p>\n<p class=\"s7\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n<p class=\"s7\">&nbsp;</p>\n<p class=\"s7\">&nbsp;</p>\n<p class=\"s7\">&nbsp;</p>\n<p class=\"s7\">&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-03T18:00:12.000Z",
    "title": "Report: Revolut to Delist Polygon, Solana, and Cardano Amidst Evolving US Regulations",
    "url": "https://news.bitcoin.com/report-revolut-to-delist-polygon-solana-and-cardano-amidst-evolving-us-regulations/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/rev-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: Revolut to Delist Polygon, Solana, and Cardano Amidst Evolving US Regulations\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/rev-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/rev-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/rev-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/rev-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/rev-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/rev-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/rev.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to a report published on Monday, the British fintech firm Revolut plans to delist the cryptocurrency assets polygon, solana, and cardano from its U.S.-based platform. Revolut cited evolving regulations in the United States, and users will need to sell the three tokens by September 18th. Revolut Joins Bakkt, Robinhood, and Etoro in Delisting Specific [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T18:00:20.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T17:58:30.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T17:47:45.000Z",
    "title": "How To Buy Dogecoin on eToro and Navigate the Process Smoothly",
    "url": "https://www.cryptopolitan.com/how-to-buy-dogecoin-on-etoro-safely/",
    "description": "If you&#8217;re interested in safely acquiring Dogecoin (DOGE) on the eToro platform, note these valuable tips. Initially created as a joke in 2013, Dogecoin has gained significant popularity in cryptocurrency. Sporting the famous &#8220;Doge&#8221; meme as its logo, it quickly became a sensation on various social media platforms, and how to buy Dogecoin on eToro ... <a title=\"How To Buy Dogecoin on eToro and Navigate the Process Smoothly\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-to-buy-dogecoin-on-etoro-safely/\" aria-label=\"More on How To Buy Dogecoin on eToro and Navigate the Process Smoothly\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T17:45:25.000Z",
    "title": "Is SEC Chairperson, Gary Gensler, resigning?",
    "url": "https://www.cryptopolitan.com/is-sec-chairperson-gary-gensler-resigning/",
    "description": "On Sunday, a rumor arose in the crypto market about the likely resignation of US Securities and Exchange Commission (SEC) Chair Gary Gensler. According to reports from an anonymous official at the regulatory entity, the SEC Chair was poised to quit as a result of an internal agency inquiry.&#160; Gary Gensler&#8217;s fake resignation news crush ... <a title=\"Is SEC Chairperson, Gary Gensler, resigning?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/is-sec-chairperson-gary-gensler-resigning/\" aria-label=\"More on Is SEC Chairperson, Gary Gensler, resigning?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-03T18:00:38.000Z",
    "title": "Terra Luna Classic Community Pool Balance In Jeopardy, Can They Survive The Plunge?",
    "url": "https://www.newsbtc.com/terra-luna/terra-luna-classic-community-pool-balance-in-jeopardy-can-they-survive-the-plunge/",
    "description": "The Terra Luna Classic community pool balance has reached a critical level due to the approval of three community pool spending proposals. The funds have significantly decreased from 2.37 billion LUNC to a mere 416 million LUNC. Consequently, the community is now facing a shortage of funds, hindering their ability to finance further development and maintenance of the chain. Terra Luna Community Proposals And Allocations The Terra Luna Classic community passed three proposals that were responsible for depleting its reserves — from a Quant team for USTC re-peg, Joint L1 Task Force Q3 proposal, and continuing operating Terra Rebels infrastructure and apps. Related Reading: Terra LUNA Classic: Thriving Or Struggling After Ecosystem Collapse? Core developer Joint L1 Task Force Q3 received 1.264 billion LUNC, Quant USTC Repeg Team gets 222.222 million LUNC, and Terra Rebels received 484.367 million LUNC. Now, the community pool balance has only 416.33 million LUNC and 4.49 million USTC. Joint L1 Task Force Q3 proposes to work on reducing LUNC and USTC circulating supply in Q3, upgrading to stable Columbus and Cosmos SDK versions, and other major developments. The L1TF and Professor Edward Kim will assist the Quant team in the USTC re-peg. Meanwhile, the Quant team worked on modeling and simulation for the USTC incremental re-peg buybacks and staking swaps, evaluating and assessing the Market Module and working on other tools. Terra Rebels needs funds to continue operating and maintaining Rebel Station and other apps, as well as testnet and Terra Classic infrastructure. Related Reading: Terra Classic Continues To Brush Off Market Downtrends, Buy Now? In light of recent developments, several prominent figures within the community have expressed concerns regarding the approval of seemingly unnecessary community spending proposals. They believe that a more discerning approach should be taken, with only crucial proposals proceeding for voting after thorough and thoughtful discussions. This sentiment reflects the community&#8217;s desire to prioritize and allocate resources effectively, ensuring that decisions are made in the best interest of the community as a whole. LUNC Price Fluctuations And Trading Activity Following the announcement of Binance&#8217;s 2.65 billion LUNC burn on Saturday, the price of Terra Luna Classic experienced a notable surge of over 3%. However, this increase was short-lived as the price failed to sustain the gains and subsequently retreated to the support level. LUNCUSDT daily chart &#124; Source: TradingView Over the past 24 hours, the LUNC price has exhibited a sideways trading pattern, with the current price hovering around $0.000087. During this period, the recorded low and high values were $0.0000850 and $0.0000877, respectively. It is worth noting that although the price has remained relatively stable, there has been a slight increase in trading volume over the past 24 hours. Featured image from Twitter, charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T17:49:47.000Z",
    "title": "Terra’s Thrilling Updates: Prism Alliance, Cosmos-First NFTs, and Neptune’s Money Market Beta Shake Up the Ecosystem",
    "url": "https://www.crypto-news-flash.com/terras-thrilling-updates-prism-alliance-cosmos-first-nfts-and-neptunes-money-market-beta-shake-up-the-ecosystem/?utm_source=rss&utm_medium=rss&utm_campaign=terras-thrilling-updates-prism-alliance-cosmos-first-nfts-and-neptunes-money-market-beta-shake-up-the-ecosystem",
    "description": "The launch of the Terra Luna Alliance Module was the epitome of development as multichain staking is now available via the Cosmos ecosystem. On-chain activity in the Terra Luna ecosystem has significantly increased in the last few weeks. The Terra Luna ecosystem enjoyed a bullish outlook in the past months following a string of positive [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-03T18:05:45.000Z",
    "title": "Central Bank of China Appoints Anti-Bitcoin Governor As Top Communist Party Official: Report",
    "url": "https://dailyhodl.com/2023/07/03/central-bank-of-china-appoints-anti-bitcoin-governor-as-top-communist-party-official-report/",
    "description": "<img width=\"810\" height=\"475\" src=\"https://dailyhodl.com/wp-content/uploads/2020/03/paving-the-way-china.jpg?w=810\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2020/03/paving-the-way-china.jpg 810w, https://dailyhodl.com/wp-content/uploads/2020/03/paving-the-way-china.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2020/03/paving-the-way-china.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2020/03/paving-the-way-china.jpg?resize=750,440 750w\" sizes=\"(max-width: 810px) 100vw, 810px\" /><p>China’s Communist Party has reportedly appointed a Bitcoin (BTC) skeptic as the central bank’s party secretary, putting him in line to become the next governor. According to a new report by the Wall Street Journal, Chinese leaders named central bank deputy governor Pan Gongsheng as the People’s Bank of China (PBOC) party secretary, the top [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/03/central-bank-of-china-appoints-anti-bitcoin-governor-as-top-communist-party-official-report/\">Central Bank of China Appoints Anti-Bitcoin Governor As Top Communist Party Official: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]