[
  {
    "source": "Cointelegraph",
    "date": "2024-02-19T09:17:22.000Z",
    "title": " South Korean ruling party pledges 2-year delay for crypto tax as elections loom ",
    "url": "https://cointelegraph.com/news/crypto-tax-south-korea-2-year-delay",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZWYxZTkyYzctYTEyZC00ODE4LTljNjUtOTFlNzQ3ZjYxZGNiLkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The ruling party argued it would take two years to establish a system that oversees crypto transactions, similar to the stock exchange.</p>\n                    <p><p data-ct-non-breakable=\"true\">The People Power Party — South Korea’s ruling party — has started a push to delay crypto gains tax for another two years as part of their campaign promises for the upcoming general election in April.  </p><p>Local media outlet Herald Business Daily <a href=\"https://news.heraldcorp.com/view.php?ud=20240219050101\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that the political group shared its stance that creating a general framework for crypto is a must before diving into taxation. The party believes that taxing crypto should only be possible once this base framework has been established. </p><p>A representative from the party also highlighted that the tax base has not yet been established. The official explained that, unlike the stock exchange, there are no entities mandated to oversee crypto transactions. The party argued that two years is necessary to establish such a system. The ruling party official also said that taxation should protect the country’s property and lives, and noted that there are aspects of the government that have “neglected” the crypto market so far. </p><p><a href=\"https://cointelegraph.com/news/crypto-tax-south-korea-2-year-delay\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-19T09:14:33.000Z",
    "title": "ARK Invest sells $90 million worth of Coinbase stock",
    "url": "https://cryptobriefing.com/ark-invest-sells-90-million-worth-coinbase-stock/?utm_source=feed&utm_medium=rss",
    "description": "The stock selloff worth $90 million was made after Coinbase received adowngrade from JPMorgan analysts over two weeks ago."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-19T09:30:07.000Z",
    "title": "Legendary Investor Stanley Druckenmiller Dumps Big Tech, Bets on AI and Gold",
    "url": "https://news.bitcoin.com/legendary-investor-stanley-druckenmiller-dumps-big-tech-bets-on-ai-and-gold/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/522dc731-a06f-4867-866c-55a42e5084a8-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Legendary Investor Stanley Druckenmiller Dumps Tech, Bets on AI and Gold\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/522dc731-a06f-4867-866c-55a42e5084a8-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/522dc731-a06f-4867-866c-55a42e5084a8-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/522dc731-a06f-4867-866c-55a42e5084a8-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/522dc731-a06f-4867-866c-55a42e5084a8-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/522dc731-a06f-4867-866c-55a42e5084a8-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/522dc731-a06f-4867-866c-55a42e5084a8-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/522dc731-a06f-4867-866c-55a42e5084a8.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Stanley Druckenmiller, the legendary investor who was part of George Soros&#8217; Quantum Fund, has dumped traditional tech stocks while putting funds into gold mining companies and artificial intelligence (AI) shares. According to filings, he sold Amazon, Alphabet (Google), and Broadcom stocks while acquiring shares of Barrick Gold and Newmont, two gold miners. Stanley Druckenmiller Sells [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-19T09:37:16.000Z",
    "title": "Digitail Survey Highlights Growing Adoption of AI in Veterinary Medicine",
    "url": "https://www.cryptopolitan.com/growing-adoption-of-ai-veterinary-medicine/",
    "description": "A recent survey conducted by Digitail, in collaboration with the American Animal Hospital Association (AAHA), sheds light on the growing integration of artificial intelligence (AI) in veterinary practices. The study, titled &#8220;AI in Veterinary Medicine: The Next Paradigm Shift,&#8221; gathered insights from 3,968 veterinary professionals, revealing key trends in adoption, sentiment, applications, benefits, concerns, and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-19T09:28:23.000Z",
    "title": "Singapore Sets Sights on AI Leadership with $743 Million Investment",
    "url": "https://www.cryptopolitan.com/singapore-sets-sights-on-ai-leadership-with-743-million-investment/",
    "description": "In a significant move to bolster its position as a global innovation hub, Singapore has announced a substantial investment plan, injecting more than $743 million into artificial intelligence (AI) over the next five years. This strategic initiative, unveiled by Deputy Prime Minister Lawrence Wong during his Budget speech, aims to enhance the nation&#8217;s AI capabilities, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-19T09:15:10.000Z",
    "title": "Daewoong Pharmaceutical Revolutionizes Drug Development with AI Technology",
    "url": "https://www.cryptopolitan.com/daewoong-pharmaceutical-revolutionizes-drug-development-with-ai-technology/",
    "description": "In a significant leap forward for the pharmaceutical industry, South Korea&#8217;s Daewoong Pharmaceutical announced the completion of a groundbreaking drug development system empowered by artificial intelligence (AI). This innovative approach aims to streamline discovering and developing new medications, potentially transforming the pharmaceutical research landscape. Innovative AI system and database creation Daewoong Pharmaceutical has introduced an [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-19T09:14:38.000Z",
    "title": "Sui blockchain surpasses competitors in TVL amidst a surge in inflows",
    "url": "https://www.cryptopolitan.com/sui-blockchain-surpasses-competitors-in-tvl/",
    "description": "In a remarkable turn of events, the Layer 1 blockchain Sui has witnessed a substantial surge in inflows this month, catapulting it ahead of industry rivals such as Cardano, Near, and Aptos regarding total value locked (TVL).&#160; Founded by former Meta (META) employees, Sui has swiftly risen to prominence, now boasting $593 million in capital [&#8230;]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-19T09:19:29.000Z",
    "title": "PaLM AI Unleash NFT Innovation, Token Burn & Gemini 1.5 Pro",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/palm-ai-unleash-nft-innovation-token-burn-gemini-1-5-pro/",
    "description": "<p>PaLM AI is at the forefront of integrating artificial intelligence into the blockchain space. Specializing in creating innovative solutions for digital content creation. This includes NFT minting and AI-driven applications. Here&#8217;s a deeper dive into this transformative partnership and other exciting developments from PaLM AI. A Seamless Fusion of AI and Blockchain At the heart [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/palm-ai-unleash-nft-innovation-token-burn-gemini-1-5-pro/\">PaLM AI Unleash NFT Innovation, Token Burn &#038; Gemini 1.5 Pro</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]