[
  {
    "source": "CoinDesk",
    "date": "2023-08-03T20:50:43.000Z",
    "title": "Figure Abandons Quest to be U.S. Chartered Crypto Bank After Three-Year Fight",
    "url": "https://www.coindesk.com/policy/2023/08/03/figure-abandons-quest-to-be-us-chartered-crypto-bank-after-three-year-fight/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Figure Technologies, Inc., has pulled its application to become a federally chartered bank in the U.S., ending a three-year rollercoaster ride as regulators clamped down on crypto activity and digital assets banking suffered a black eye when regional lenders associated with the tech world cratered earlier this year."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-03T21:01:11.000Z",
    "title": "Jack Dorsey's Block Reports $5.5 Billion in Q2 Revenue—Almost Half of It From Bitcoin",
    "url": "https://decrypt.co/151161/block-announces-increase-in-profit-year-over-year-in-q223-earnings",
    "description": "The company topped profit expectations for its latest quarter. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-03T21:00:00.000Z",
    "title": "‘Computer language that anyone can read’ launches Aeternity compiler",
    "url": "https://cointelegraph.com/news/lexon-computer-language-that-anyone-can-read-launches-aeternity-compiler",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/1633a20e-c8ec-4efb-aac1-bc25b3a62c23.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Lexon now features a compiler that allows users to translate code from it to Solidity, Sophia, or Javascript.</p>\n                    <p><p>Smart contract computer language Lexon (LEX) launched a compiler on Aug. 3, allowing developers to write contracts in Lexon and have them be converted into Solidity, Sophia, or Javascript, according to statements made to Cointelegraph by Lexon founder Henning Diedrich. The compiler runs on the Aeternity (AE) blockchain network and charges LEX tokens as payment for each compilation cycle.</p><p>Dubbed “the computer language anyone can read,” Lexon is a computer language intended to seem like an ordinary written or spoken language. Specifically, the current version is developed to look and sound like ordinary English.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/75aa8b40-24d7-4b01-84a9-0c81c517042b.png\"  /><figcaption style=\"text-align: center;\"><em>Lexon (left) being compiled into Solidity (right). Source: Lexon.</em></figcaption></figure><p>In a conversation with Cointelegraph, Diedrich claimed that the language and compiler provide three main benefits to developers and users. First, it can be used as an educational tool to teach smart contract programming. Remix, a popular tool for learning Solidity, has developed a Lexon plugin that allows students to type agreements in Lexon and see their translations in Solidity, enabling them to understand what the Solidity code means in plain English. In Diedrich’s view, this can help students comprehend how Solidity and smart contracts work.</p><p>Second, contracts can be written in Lexon to make them “self-documenting.” Instead of a technical writer needing to write documentation explaining what the code does, the code itself can be written in a language that ordinary people can understand. Programmers have been trying to develop algorithms that can produce documentation from a set of code, but Lexon approaches the problem differently, making the code readable, Diedrich claimed.</p><p>Third, Lexon can be used to produce better graphical user interfaces (GUIs) and in a more automated way. “You can use the richness of the information to create better GUIs, because you can generate more from [this] human way of expressing the logic, than you can when you take as a starting point the third-generation language like Solidity,” Diedrich stated.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/detect-fake-news-with-natural-language-processing\"><strong>How to detect fake news with natural language processing</strong></a></em></p><p>Diedrich cautioned that the compiler can only translate in one direction, from Lexon to another language. It cannot translate another computer language back into Lexon. This means that it can’t be used, for example, to more easily debug smart contracts that were not initially written in Lexon, as he explained:</p><blockquote>“Natural language is, of course, very much richer than third-generation languages like solidity [...] And the act of leaving things out is actually something that the compiler does [...] This first translation step is losing so much information that the way back is really difficult [...] Because it can never be as good as Lexon itself.”</blockquote><p>However, he argued that if Lexon were to become a common language for smart contract programming, this would make it easier for ordinary people to understand how Web3 apps actually function, which would accomplish the same objective that a Solidity to Lexon compiler would.</p><p>According to Diedrich, the team chose Aeternity because of its low gas fees and high scalability. The team is currently distributing LEX in exchange for AE tokens.</p><p>The difficulty of reading Solidity contracts continues to be a stumbling block for DeFi users. Users who don’t know how to code must often rely on smart contract security auditors to determine whether a contract has a vulnerability, and this can leave them vulnerable to undiscovered exploits. On July 2, an exploiter <a href=\"https://cointelegraph.com/news/chibi-finance-1-million-alleged-rug-pull-how-it-happened\">removed over $1 million of users’ funds</a> from the Chibi Finance app without their permission in what has been described by security researchers as a “rug pull.” The exploiter used a function called “panic” to drain the funds, and most users didn’t know this function existed. </p><p>In a similar example on July 28, investors plowed at least $2 million into the Pond0x memecoin only to find out that its transfer function allowed anyone to transfer Pond0x coins without owners' consent. The Pond0x token quickly <a href=\"https://cointelegraph.com/news/pond0x-token-launch-snafu-leads-millions-dollars-losses\">collapsed in price to near zero</a>.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T21:06:39.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? Today&#8217;s Filecoin price is $4.24 USD, with a 24-hour trading volume of $101,148,403. Filecoin is down 0.66% in the last 24 hours. The current CoinMarketCap ranking is #30, with a live market cap of $1,931,939,927. It has a circulating supply of 438,146,575 FIL coins, and ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-03T21:00:26.000Z",
    "title": "CRV Price Recovers From 6-Month Lows, What’s Driving The Price?",
    "url": "https://www.newsbtc.com/analysis/crv/crv-price-recovers-from-6-month-lows/",
    "description": "Curve Finance’s native token CRV has recovered from a 6-month low, and many believe that the news of Huobi co-founder Jun Du buying CRV tokens has contributed to it.  Jun Du bought 10 million tokens valued at $4 million from Micheal Egorov, founder of Curve. Egorov had offered his tokens for sale to bolster his at-risk loan positions, primarily for borrowing stablecoins using CRV tokens as collateral.  Some Positives For Curve Finance Despite Hack Curve Finance, one of the biggest DeFi protocols on the Ethereum blockchain, recently saw its in-house CRV price recover about 25% at the start of the month. It had previously dropped by 35% between July 30-31 following the panic selloff spearheaded by Curve Finance’s $47 million exploit.  Related Reading: Buying Pressure Incoming? MicroStrategy Files Notice With SEC To Sell $750 Million In Stocks The July reentrancy attack was not the only exploit recorded on Curve Finance as the DeFi protocol had previously lost over $570,000 in August 2022 after hackers compromised the front end of its liquidity pool.  However, the recent acquisition of 10 million tokens by Jun Du projects a positive outlook for CRV tokens, especially the recent attack on its ecosystem. Confirming the transaction, Du noted that he has locked up his investment for a period of one year as veCRV.  Apart from Du, the Aave Chan Initiative, a delegate platform from Aave’s governance forum, recently put forward a proposal for the purchase of about $2 million worth of CRV. After the planned purchase, which is to be made by the Aave Treasury, the CRV tokens would also be locked up as veCRV for about four years.  Token price recovers from weekly lows &#124; Source: CRVUSD on Tradingview.com CRV Remains Popular Among Investors Egorov has so far sold 72 million CRV tokens to various investors and the continued purchase and acceptance of the CRV token demonstrates its popularity and utility.  One such investor who remains bullish on CRV is Justin Sun, founder of the Tron network. He recently acquired 5 million CRV from Egorov by paying using Tether’s USDT in a direct Over-the-counter (OTC) trade. Justin confirmed the purchase in a tweet noting that both platforms “As steadfast partners” will keep being “&#8230;committed to providing support whenever needed.” According to a Twitter post by Sandra from Nansen, other popular purchasers of Curve tokens include Cream Finance, Machi Big Brother, DWF Labs, DCFGod, and Andrew Kang, co-founder of Mechanism Capital.  Related Reading: Ethereum ETFs Heat Up As Filings With SEC Climbs To Six A vast majority of these transactions were conducted through OTC, with Egorov realizing over $20 million, which he applied to balancing his borrowings and removing himself from liquidation. Egorov also sent another huge supply of CRV (17.5 million) to an address starting with 0xf51.  Once the largest DeFi protocol on the Ethereum blockchain, the vast majority of Curve trading volumes still come from Ethereum.  Featured image from iStock, chart from Tradingview.com"
  }
]