[
  {
    "source": "Decrypt",
    "date": "2023-09-11T19:23:28.000Z",
    "title": "Pahdo Labs Raises $15M to Let Players Make Anime Games With AI Tools",
    "url": "https://decrypt.co/155895/pahdo-labs-raises-15-million-players-make-anime-games-ai-tools",
    "description": "The studio behind anime game Halcyon Zero will launch generative AI tools for content creation after raising funding led by Andreessen Horowitz."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-11T19:13:35.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>The extent of FTX's financial woes was revealed in a shareholder presentation on Sept. 11. Binance regional markets head Richard Teng said in an interview that, despite regulatory scrutiny, the company has no parallels to FTX. Meanwhile, Coinbase has refuted a report that it is halting services for Indian customers that was making the rounds on social media.</p><h3>FTX shareholder presentation reveals exchange’s current state</h3><p>The extent of <a href=\"https://cointelegraph.com/news/ftx-shareholder-presentation-222-million-bahamas-real-estate-1300-tokens\">FTX’s financial difficulties</a> were laid out in a shareholder presentation that was released on Sept. 11. </p><p>According to the presentation, over 2,300 non-customer claims have been filed against FTX, including by Genesis, Celsius and Voyager. Those claims are worth a staggering $65 billion but a large chunk are “assumed to be invalid/redundant.”</p><p>FTX has over $7 billion in assets made up of crypto, cash, brokerage investments, real estate and venture portfolio. Of note, the company owns 38 properties in the Bahamas worth a combined $222 million.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Preference Exposure in FTX presentation<br><br>Methodology<br>Withdrawals: Valued at current pricing (31st Aug)<br>Deposits: Transaction time<br><br>Owed to FTX estate<br>15-Day: $11.2bn (intl) + $2.2bn (US)<br>90-Day: $21.4 (intl)+$3.6bn (US) <a href=\"https://t.co/wlsAr8MP6C\">pic.twitter.com/wlsAr8MP6C</a></p>&mdash; Sunil (FTX Creditor Champion) (@sunil_trades) <a href=\"https://twitter.com/sunil_trades/status/1701282373155897715?ref_src=twsrc%5Etfw\">September 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>It was reported that FTX may claw back $86.6 million in political and charitable donations and $190.3 million through potentail actions against vendors. </p><p>Lawyers of former FTX CEO Sam Bankman-Fried have <a href=\"https://cointelegraph.com/news/ftx-sam-bankman-fried-s-lawyers-request-pre-trial-release-citing-poor-internet-connection\">requested a pre-trial release</a> due to a lack of adequate internet in federal prison. Bankman-Fried’s bail was revoked on Aug. 11 after he was found trying to contact and intimidate former FTX employees in the ongoing lawsuit against him.</p><h3>Binance’s Richard Teng denies FTX comparisons: ‘We welcome the scrutiny’</h3><p>Binance regional markets head Richard Teng insists that the global cryptocurrency exchange is financially secure and in no way similar to bankrupt peer FTX despite recent regulatory scrutiny and regional challenges.Speaking exclusively to Magazine editor Andrew Fenton in Singapore ahead of the 2023 Token2049 conference, Teng addressed a variety of different challenges being faced by Binance’s regional arms as well as playing down reports that he is being groomed to take the reigns from founder Changpeng “CZ” Zhao in the future.</p><p>Teng said that, while Binance has faced different issues over the past couple of years, it has managed to tackle these on a case-by-case basis while remaining financially strong and able to process customer withdrawals.</p><p>Commenting on a recent social media post from CZ that highlighted “negative news/rumors, bank runs, lawsuits, closing of fiat channels, product wind downs, employee turnover,” Teng said that comparisons to the failure of FTX were unjustified:</p><blockquote>“There were different rumors and FUD after FTX. People tried to associate us, which is totally untrue. Our assets are backed one-to-one.”</blockquote><p>He also addressed recent Cointelegraph exclusives that revealed high-level executives had departed Binance as well as another report on the company’s ties with Russian banks. Teng said that the exchange’s stellar growth in the space of six years continues to leave it in the spotlight.</p><blockquote>“All this scrutiny will come from being the largest — scrutiny from regulators, scrutiny from the media — and we welcome the scrutiny.”</blockquote><p>Teng said that Binance has not yet made a decision regarding its franchise that serves the Russian market while maintaining that the company continues to adhere to international norms and standards in regards to sanctioned entities and individuals:</p><blockquote>“On our plans for Russia, we have stated very clearly in the last couple of weeks that all options are on the table. We continue to explore what we need to do for that particular franchise going forward.”</blockquote><p>Meanwhile, maturing regulatory frameworks in various jurisdictions are also being welcomed by the global exchange. Teng said that the European Union’s Markets in Crypto-Assets (MiCA) regulation could benefit exchanges universally by creating standardized rules for the industry:</p><blockquote>“This disparate treatment, it makes life very difficult for global platforms like for ourselves. In terms of local deployment, we need to understand how the rules and regulations are very different. So, what we hope for is harmonized standards.”</blockquote><p>Teng said that MiCA was a “step in the right direction” in providing the 23 EU member states with a consistent set of standards, which in turn could lead to a wider convergence of global regulatory guidelines for the industry.</p><h3>Coinbase denies s ceasing services in India</h3><p>Coinbase has issued a clarification after a circulating report suggested that it would soon halt all operations for its Indian customers.</p><p>According to a Sept. 11 <a href=\"https://techcrunch.com/2023/09/10/coinbase-india/\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from TechCrunch, Coinbase India users were reportedly warned via email that all services would be discontinued by Sept. 25, and were urged to to remove any funds that remained on the exchange.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">As reported by Cointelegraph, the notice was not targeted at all Indian customers, but rather those who violated the exchange’s standards.  <a href=\"https://t.co/IiyMAcz7rl\">https://t.co/IiyMAcz7rl</a></p>&mdash; Wu Blockchain (@WuBlockchain) <a href=\"https://twitter.com/WuBlockchain/status/1701104368240787933?ref_src=twsrc%5Etfw\">September 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, it is understood that the notice was not aimed at all Indian customers and was instead aimed at those breaching the exchange's standards. </p><p>\"We are reaching out to inform you that we will be discontinuing all Coinbase Retail services linked to your above-mentioned account, as we will be disabling access for the retail accounts that no longer meet our updated standards for these services,\" according to an email on Sept. 8 — shared by a Coinbase spokesperson to Cointelegraph.</p><p>In a statement, the spokesperson reiterated that the email was only sent to some account holders who they deemed as breaching their \"updated standards.\"</p><p>The original report from TechCrunch has been widely shared on social media, being picked up by a number of prominent accounts on X (formerly known as Twitter) including Wu Blockchain. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T19:37:55.000Z",
    "title": "AI Revolutionizes Poker Game Programming for an Immersive and Challenging Experience",
    "url": "https://www.cryptopolitan.com/ai-revolutionizes-poker-game-programming/",
    "description": "Discover how cutting-edge AI, like GPT technology, is transforming poker game development. Learn about AI's coding speed, player experiences, and potential impacts on the gaming industry, while addressing fairness and security concerns. Explore the exciting future of AI in poker and beyond."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T19:23:01.000Z",
    "title": "What’s the Potential Future of Gaming?",
    "url": "https://www.cryptopolitan.com/whats-the-potential-future-of-gaming/",
    "description": "Gaming, a global phenomenon that has transcended generations, has evolved into a multi-billion-dollar industry, captivating the minds and hearts of millions worldwide. This article delves into the intricate tapestry of gaming, exploring its diverse facets, evolution, and its undeniable influence on contemporary culture. From its humble beginnings as pixelated escapism to the sprawling virtual realms ... <a title=\"What&#8217;s the Potential Future of Gaming?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/whats-the-potential-future-of-gaming/\" aria-label=\"More on What&#8217;s the Potential Future of Gaming?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-11T19:20:35.000Z",
    "title": "Philippines’ Central Bank Turns to Hyperledger for CBDC Testing – Is Ethereum (ETH) or Ripple (XRP) Involved? Report ",
    "url": "https://www.crypto-news-flash.com/philippines-central-bank-turns-to-hyperledger-for-cbdc-testing-is-ethereum-eth-or-ripple-xrp-involved-report/?utm_source=rss&utm_medium=rss&utm_campaign=philippines-central-bank-turns-to-hyperledger-for-cbdc-testing-is-ethereum-eth-or-ripple-xrp-involved-report",
    "description": "<img width=\"1920\" height=\"1344\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/blockchain-3585482_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/blockchain-3585482_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/blockchain-3585482_1920-300x210.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/blockchain-3585482_1920-1024x717.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/blockchain-3585482_1920-768x538.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/blockchain-3585482_1920-1536x1075.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/blockchain-3585482_1920-24x17.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/blockchain-3585482_1920-36x25.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/blockchain-3585482_1920-48x34.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />The Bangko Sentral ng Pilipinas has disclosed that it will use the Hyperledger Fabric blockchain for its CBDC trials.  For now, no mention has been made concerning the involvement of Ripple or Ethereum. In the wake of the Central Bank Digital Currency (CBDC) interest increasing among countries, Bangko Sentral ng Pilipinas (BSP) has been working [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-11T19:15:05.000Z",
    "title": "Terra Luna: 17,000,000 Developers Are Coming to the Ecosystem With Jax.Zone, Bringing JavaScript to Blockchain – Is the Price Poised for a Massive Upswing?",
    "url": "https://www.crypto-news-flash.com/terra-luna-17000000-developers-are-coming-to-the-ecosystem-with-jax-zone-bringing-javascript-to-blockchain-is-the-price-poised-for-a-massive-upswing/?utm_source=rss&utm_medium=rss&utm_campaign=terra-luna-17000000-developers-are-coming-to-the-ecosystem-with-jax-zone-bringing-javascript-to-blockchain-is-the-price-poised-for-a-massive-upswing",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Terra\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-1536x864.png 1536w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />The Terra Classic community is voting on proposals due to concerns about spam following the LUNC price decline.  The blockchain will temporarily pause for the upcoming v2.2.1 core upgrade on September 12, contributing to ongoing high-development activity.  The Terra Classic community is currently voting on several proposals, and there are concerns about an increase in [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-11T19:40:00.000Z",
    "title": "XRP Under Threat After JP Morgan Released Blockchain-Based Token",
    "url": "https://coinedition.com/xrp-under-threat-after-jp-morgan-released-blockchain-based-token/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/JPMorgans_Kelly_Says_Buy_Value_Sell_Crypto_With_Hawkish_Fed.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"JPMorgan’s_Kelly_Says_Buy_Value,_Sell_Crypto_With_Hawkish_Fed\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/JPMorgans_Kelly_Says_Buy_Value_Sell_Crypto_With_Hawkish_Fed.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/JPMorgans_Kelly_Says_Buy_Value_Sell_Crypto_With_Hawkish_Fed-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/JPMorgans_Kelly_Says_Buy_Value_Sell_Crypto_With_Hawkish_Fed-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/JPMorgans_Kelly_Says_Buy_Value_Sell_Crypto_With_Hawkish_Fed-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/JPMorgans_Kelly_Says_Buy_Value_Sell_Crypto_With_Hawkish_Fed-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Analysis channel BitBoy Crypto has recently launched a new video discussing Ripple’s (XRP) potential competitors. On September 8, Bloomberg published a report citing that financial giant JPMorgan is releasing a blockchain-based token for faster cross-border deposits and settlements. While the leading financial firm awaits approval from US regulators, the BitBoy hosts predict that the new [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-under-threat-after-jp-morgan-released-blockchain-based-token/\">XRP Under Threat After JP Morgan Released Blockchain-Based Token</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]