[
  {
    "source": "CoinDesk",
    "date": "2023-06-21T20:45:00.000Z",
    "title": "Reviewing the Tether Documents",
    "url": "https://www.coindesk.com/policy/2023/06/21/reviewing-the-tether-documents/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Last week, CoinDesk received documents in response to a New York state Freedom of Information Law request about the details of Tether’s reserves. These documents were released two years after our original filing in 2021 and only after a full-blown legal fight with Tether, which CoinDesk won in February."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-21T20:44:13.000Z",
    "title": "A Straightforward Explanation for Why Financial Giants Want to Issue a Spot Bitcoin ETF",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/21/a-straightforward-explanation-for-why-financial-giants-want-to-issue-a-spot-bitcoin-etf/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Hint: It has to do with making money."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-21T20:56:20.000Z",
    "title": "Fed Chair Powell Says Bitcoin Has 'Staying Power' as an Asset Class",
    "url": "https://decrypt.co/145703/fed-chair-powell-says-bitcoin-has-staying-power-as-an-asset-class",
    "description": "“We do see payments stablecoins as a form of money,\" Powell said, adding that \"the ultimate source of credibility in money is the central bank.\""
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-06-21T20:55:16.000Z",
    "title": "Monetary Authority of Singapore Unveils Programmable Digital Money Plans",
    "url": "https://cryptobriefing.com/singapores-monetary-digital-money-research/?utm_source=feed&utm_medium=rss",
    "description": "The Monetary Authority of Singapore, the Bank of Italy, the Bank of Korea and the International Monetary Fund has released a white paper exploring the concept of Purpose-Bound Money(PBM) and..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T20:50:40.000Z",
    "title": "ENO Token Lists on LATOKEN to Transform the Wine Industry",
    "url": "https://cryptodaily.co.uk/2023/06/eno-token-lists-on-latoken-to-transform-the-wine-industry",
    "description": "<p>Mexico City, Mexico, June 21st, 2023, Chainwire</p><p>ENO, the native token of an emerging wine industry platform, has been listed on LATOKEN. The news marks a milestone in the history of wine while cementing LATOKEN&rsquo;s reputation as a testbed for innovative new tokens.</p><p>The ENO platform aims to provide access to a rapidly expanding wine ecosystem while distilling the greatest elements of the industry by combining centuries of tradition with web3 technology. Wine culture has fascinated people for centuries, and web3 offers exciting and disruptive opportunities.</p><p>ENO&rsquo;s listing on LATOKEN will allow users of the global exchange to tap into a new web3 vertical and to leverage a digital asset that enables users to enjoy exclusive experiences that combine art, music, web3 technology, and wine. Through the ENO platform, this club provides access to special auctions, unique wine-tasting experiences, and the opportunity to acquire limited-edition wine bottles in collaboration with renowned artists from around the world. Being part of this select group of wine enthusiasts and NFT collectors brings wine culture to a new audience.</p><p>The ENO platform also includes the Wine Academy, an educational portal that uses blockchain technology to issue digital certificates based on the courses aspiring vintners have completed. ENO brings together farmers, vineyards, exporters, importers, consumers, sommeliers, hotels, and wine enthusiasts in a decentralized community, expanding the horizon of wine culture.</p><p>The ENO token listed on LATOKEN on June 20, marking a new chapter in the fusion of tradition and technology.</p><p>About ENO</p><p>ENO is a platform that combines the tradition of wine with technological innovation. Its goal is to facilitate access to the wine ecosystem and promote the growth of wine culture worldwide through the implementation of advanced technologies such as tokenization.</p><p>About LATOKEN</p><p>LATOKEN is a globally recognized token exchange platform. It offers a stable trading environment backed by real assets and provides opportunities for participation in innovative and promising projects.</p><p>For more information about ENO and its inclusion in LATOKEN, please visit:</p><p>Official Website | Twitter | Telegram | Facebook | Instagram | YouTube Channel</p><p></p>ContactCo-FounderAlberto FernandezENOalberto@enotoken.io"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T20:48:29.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T20:48:17.000Z",
    "title": "ENO Token Lists on LATOKEN to Transform the Wine Industry",
    "url": "https://www.cryptopolitan.com/eno-token-lists-on-latoken-to-transform-the-wine-industry/",
    "description": "Mexico City, Mexico, June 21st, 2023, Chainwire ENO, the native token of an emerging wine industry platform, has been listed on LATOKEN. The news marks a milestone in the history of wine while cementing LATOKEN’s reputation as a testbed for innovative new tokens. The ENO platform aims to provide access to a rapidly expanding wine ... <a title=\"ENO Token Lists on LATOKEN to Transform the Wine Industry\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eno-token-lists-on-latoken-to-transform-the-wine-industry/\" aria-label=\"More on ENO Token Lists on LATOKEN to Transform the Wine Industry\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-21T21:00:46.000Z",
    "title": "Here’s Why Bitcoin Whales think DigiToads (TOADS) is a better investment than Chainlink (LINK)",
    "url": "https://nulltx.com/heres-why-bitcoin-whales-think-digitoads-toads-is-a-better-investment-than-chainlink-link/",
    "description": "Up until a few years ago, if you wanted to explore the cryptocurrency market, Bitcoin was the only dependable option available. However, over the years more innovative projects have emerged that are winning over crypto users with their utility-centric models and robust security frameworks. DigiToads (TOADS) is a hybrid DeFi token that is powered by [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-21T21:00:50.000Z",
    "title": "“Yes, This Is A Bull Market” Expert Explains Why Bitcoin Will Outperform Tesla’s +162%",
    "url": "https://www.newsbtc.com/bitcoin-news/yes-this-is-a-bull-market-expert-explains-why-bitcoin-will-outperform-teslas-162/",
    "description": "Bitcoin is finally showing some green over the past week as the cryptocurrency rose from the mid-area of its current levels. The number one crypto by market cap seems poised to extend its rally, can it finally break from its current range? Related Reading: Nansen Forecast For Bitcoin Bull Run: Regulatory Clarity And Lower Inflation As of this writing, Bitcoin (BTC) trades at $29,000 with an 8% profit in the last 24 hours. Over the last week, BTC’s price has displayed a similar performance recording a 12% profit. Other cryptocurrencies in the top 10 by market cap are experiencing profits, but BTC is outperforming other assets in the sector. Bitcoin Next Bull Run, Bad News For Tesla And Tech? The key to tracking Bitcoin’s next bull run could be its correlation with tech equities. The nascent crypto industry has been moving in tandem with this sector since 2021. At that time, the price of Bitcoin reached a new all-time high of around $69,000. The correlation with tech equities, as measured by the performance of the Nasdaq 100, has been decreasing over time and could continue this trajectory. According to the former hedge fund manager for Goldman Sachs, Raoul Pal, Bitcoin, and crypto are on track to outperform tech equities and “all other equities.” Despite the short-term turmoil in 2023, BTC’s price experienced a 75% increase year-to-date (YTD). In that sense, Ethereum (ETH), Tesla (TSLA), and other tech stocks have been rallying and will likely see further profits. As of this writing, ETH and TSLA experienced 50% and 160% profit, respectively. However, Pal believes BTC will take the crown in the short term as the cryptocurrency extend its “bull market.” According to Pal, the bear market for BTC ended in October 2022 as liquidity across the financial sector bottomed out. As seen in the chart below, liquidity and financial conditions have been improving, according to Pal. In the past, whenever liquidity increased, BTC and equities followed. Related Reading: US Bitcoin Investor Trading Volume Rises, Stage Set For Another Massive Rally? The expert added expanding on BTC’s capacity to outperform tech while breaking its long-term correlation with these financial assets: Yes, tech is VERY overbought. Yes, it will correct at some point. Yes, this is a bull market.  When tech corrects, crypto probably explodes to new highs on the year again too. Welcome to the Exponential Age. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T20:52:15.000Z",
    "title": "ENO Token Lists on LATOKEN to Transform the Wine Industry",
    "url": "https://www.crypto-news-flash.com/eno-token-lists-on-latoken-to-transform-the-wine-industry/?utm_source=rss&utm_medium=rss&utm_campaign=eno-token-lists-on-latoken-to-transform-the-wine-industry",
    "description": "Mexico City, Mexico, June 21st, 2023, Chainwire ENO, the native token of an emerging wine industry platform, has been listed on LATOKEN. The news marks a milestone in the history of wine while cementing LATOKEN’s reputation as a testbed for innovative new tokens. The ENO platform aims to provide access to a rapidly expanding wine [...]"
  }
]