[
  {
    "source": "Cointelegraph",
    "date": "2024-04-05T21:00:00.000Z",
    "title": " Crypto Biz: The return of Web3 gaming, Binance appoints board, and more ",
    "url": "https://cointelegraph.com/news/crypto-biz-return-web3-gaming-binance-appoints-board",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvNmEzNmYxMTUtYWE2ZS00N2E2LWI3NGEtYjlkNGY1NzcyNGIwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>This week’s Crypto Biz explores the gaming industry’s renewed optimism, Binance’s first board of directors, Paradigm’s new crypto fund and how Bitcoin miners are gearing up for the halving. </p>\n                    <p><p>The gaming industry is set to release a massive crop of games in 2024, following a few years of development since the last bull cycle, with game developers reimagining business models to attract and retain players amid growing competition. </p><p>Metaverses, nonfungible tokens (NFTs) and even play-to-earn features are still on the table for some studios. Game developer Illuvium, for instance, is working on an interconnected environment that will combine three different titles under the same experience. </p><p>In addition, Illuvium’s upcoming release will offer a revenue-sharing model. “We take all the in-game revenue from players spending to travel, cure shards, purchase cosmetics, and fuel and then use it to buy ILV off the market. We then take the ILV and distribute it to stakers in the protocol. The longer you stake, the higher the amount you receive from each distribution,” Kieran Warwick, Illuvium’s co-founder and CEO, told Cointelegraph. </p><p><a href=\"https://cointelegraph.com/news/crypto-biz-return-web3-gaming-binance-appoints-board\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-04-05T20:44:13.000Z",
    "title": "Coinbase stands strong in consumer lawsuit as case is revived post-appeal",
    "url": "https://cryptoslate.com/coinbase-stands-strong-in-consumer-lawsuit-as-case-is-revived-post-appeal/",
    "description": "<p>Coinbase chief legal officer Paul Grewal responded to a legal development that has revived a consumer lawsuit against the US-based crypto exchange that was dismissed in 2023. On April 5, Grewal said companies such as Coinbase have no private liability for the secondary trading of crypto tokens because &#8220;contracts matter.&#8221; Grewal cited a decision from [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/coinbase-stands-strong-in-consumer-lawsuit-as-case-is-revived-post-appeal/\">Coinbase stands strong in consumer lawsuit as case is revived post-appeal</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-04-05T20:57:08.000Z",
    "title": "Wormhole hacker is eligible to receive over $50,000 in W tokens",
    "url": "https://cryptobriefing.com/wormhole-hacker-eligible-50000-w/",
    "description": "The hacker qualified for the airdrop by using Wormhole's infrastructure during the exploit perpetrated by him in February 2022."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-05T21:00:23.000Z",
    "title": "SimpleSwap Updates Its Loyalty Program With BTC Cashback",
    "url": "https://cryptodaily.co.uk/2024/04/simpleswap-updates-its-loyalty-program-with-btc-cashback",
    "description": "SimpleSwap Updates Its Loyalty Program With BTC Cashback"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-05T21:05:00.000Z",
    "title": "Tron Price Prediction 2024-2033: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2024-2033 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network. TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-05T21:04:09.000Z",
    "title": "Bitcoin support integrated into Ethena Labs’ USDe synthetic dollar",
    "url": "https://www.cryptopolitan.com/bitcoin-support-integrated-into-ethena-usde/",
    "description": "Ethena Labs has stirred the pot yet again, rolling out the red carpet for Bitcoin in its USDe symphony. This isn&#8217;t just any regular update; it&#8217;s a seismic shift aimed at pumping the synthetic dollar-pegged USDe into a new realm of possibilities. The boys at Ethena aren&#8217;t playing small; they&#8217;re looking to scale their $2-billion [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-05T21:00:56.000Z",
    "title": "Dogecoin Finds A Bottom: How The 7-Year Cycle Can Send Price To $40",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-7-year-cycle-40/",
    "description": "Dogecoin has had a rather interesting week, first rallying to cross $0.2, before correcting back downward and eventually losing support at $0.8. Nevertheless, there is still a lot of steam left in the cryptocurrency it seems, as crypto analysts have identified both a bottom and a 7-year cycle that could send its price as high as $40. Dogecoin To Bottom Around $0.16 In an analysis posted on X (formerly Twitter), crypto analyst Trader Mayne posited that Dogecoin could find a bottom around $0.16. He explains that this is the level where bulls are mounting support, making it a critical point for the meme coin. Related Reading: Crypto Analyst Says Bitcoin Hitting $100,000 In 2024 Is Inevitable, Here’s Why Now, if the bulls are able to hold this support level, it would mean that the DOGE price has eventually found its bottom. However, falling below this support level could be detrimental for the meme coin’s price, as Trader Mayne revealed, leading to an even larger correction from here. On the flip side, if bulls are able to hold this support, then it could signal a continuation of the bullish trend. The crypto analyst reports that the RR (Risk Ratio) for longs has skewed positive. So, in this case, holding above the $0.16 support and eventually reclaiming the previous local peak just below $0.24, then “the party continues,” the analyst stated. DOGE Price Headed To $40? Trader Mayne is not the only crypto analyst who has shown bullishness toward Dogecoin in spite of the decline. Another analyst, identified as Tardigrade, also took to X to share a cycle trend in the DOGE price that they had uncovered. The crypto analyst titled the trend the “Cycle of 7 years” which predicts a large move up to new all-time high levels for the meme coin. Tardigrade points to the performance of Dogecoin in the seven years leading up to the 2021 surge, a cycle that they believe is set to repeat again. $Doge is running in the &#8220;Cycle of 7 years&#8221;🔥 We can see a similar price action in the first half of the current cycle, compared to that of last cycle. When we were at $0.0007 in 2017, we never believed $Doge would spike to $0.003, $0.009 &#38; $0.35 T~O~D~A~Y~: We are at $0.22, we… pic.twitter.com/G2tcCNhX2y — Trader Tardigrade (@TATrader_Alan) April 1, 2024 Related Reading: Injective Whales Go On $24.8 Million Buying Spree, Is This The Next Solana? Given that seven years is a wide range, it means that in 2024, the DOGE price is still just halfway to completing it. From here, it would take another four years for the 7-year cycle to be completed, at the end of which Dogecoin is expected to see a massive surge. The cycle ends in 2028 and by this time, the crypto analyst expects that the DOGE price will move above $2, then $9, and all the way to $40. They support this with the fact that the DOGE price moved from $0.0007 in 2017, and reached as high as $0.7 in 2021. Given this, the analyst advises crypto investors not to miss the Dogecoin move up. DOGE price at $0.17 &#124; Source: DOGEUSDT on Tradingview.com Featured image from Fast Company, chart from Tradingview.com"
  }
]