[
  {
    "source": "Decrypt",
    "date": "2024-01-13T00:49:04.000Z",
    "title": "SEC Chair Gary Gensler Recaps Takeover of Agency's Twitter Account",
    "url": "https://decrypt.co/212765/sec-chair-gary-gensler-addresses-cyberattack-on-agencys-twitter-account",
    "description": "The agency head gave an update on the investigation into a cyberattack that falsely announced Bitcoin ETF approvals earlier this week."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-13T01:06:33.000Z",
    "title": " BlackRock CEO doubts Bitcoin will ever become a currency ",
    "url": "https://cointelegraph.com/news/blackrock-ceo-larry-fink-bitcoin-currency",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZjM0YmVmYmEtYzE1My00NGE5LWJhOTctOWRiMTgwZTI4YWE3LkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>BlackRock CEO Larry Fink suggests that Bitcoin may not become the go-to currency for everyday spending and asserts that he hasn't contemplated the potential price trajectory of Bitcoin.</p>\n                    <p><p>BlackRock CEO Larry Fink doubts the practicality of using Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) for everyday transactions, reiterating it should be publicly perceived as purely an asset class.</p><p>During an interview with CNBC on January 11, Fink stated his belief in Bitcoin, viewing it as an alternative form of wealth storage rather than a contender to replace national currencies.</p><p>However, he does believe that Central Bank Digital Currencies (CBDCs) will come to fruition in the near future. </p><p><a href=\"https://cointelegraph.com/news/blackrock-ceo-larry-fink-bitcoin-currency\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-13T00:42:33.000Z",
    "title": "Bitcoin falls 9%, dropping below $42K amidst concerns about GBTC flows",
    "url": "https://cryptoslate.com/bitcoin-falls-9-dropping-below-42k-amidst-concerns-about-gbtc-flows/",
    "description": "<p>Bitcoin (BTC) prices fell significantly on Jan. 12 as Bitcoin ETFs headed into the weekend after their first two days of trading on U.S. markets. The price of Bitcoin fell as low as $41,730 at 10:25 p.m. UTC on Friday, marking a 24-hour loss of approximately 9%. As of 11:25 p.m. UTC, Bitcoin&#8217;s price had [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-falls-9-dropping-below-42k-amidst-concerns-about-gbtc-flows/\">Bitcoin falls 9%, dropping below $42K amidst concerns about GBTC flows</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T00:50:22.000Z",
    "title": "SEC Chair releases official statement concerning cybersecurity breach following false Bitcoin ETF approval tweet",
    "url": "https://www.cryptopolitan.com/sec-official-statement-concerning-breach/",
    "description": "On Friday, the Security and Exchange Commission (SEC) Chair Gary Gensler released an official statement concerning the false Bitcoin ETFs approval tweet on SEC’s X account. According to Gensler’s official statement,&#160; the U.S. Securities and Exchange Commission (SEC) experienced a significant cybersecurity breach on January 9, 2024. The statement declared that an unauthorized entity gained [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-13T01:00:09.000Z",
    "title": "Crypto Analyst Predicts 800% Rally As Dogecoin Enters Buy Zone",
    "url": "https://www.newsbtc.com/news/dogecoin/800-rally-dogecoin-buy-zone/",
    "description": "Compared to other meme coins and large caps in the crypto space, the Dogecoin performance has been quite lackluster, to say the least. Even as Bitcoin sets an out toward its previous highs, Dogecoin price has been muted. Bit this could change soon as one analyst sees a reversal coming. Dogecoin Price Has Entered The Buy Zone Since falling back below the $0.09 level, the dogecoin bulls have struggled to maintain control of the price. With bearish and selling pressure mounting, the best-case scenario was that the meme coin would once again enter an accumulation zone that could help provide support. Related Reading: Shiba Inu Team’s Record 9.35 Billion SHIB Burn Sends Burn Rate Soaring According to a crypto analyst who goes by CryptoCheck on TradingView, the DOGE price may have finally entered this buy zone. The analyst analyzes the DOGE price on different time frames such as the four-hour and the weekly frame, coming up with a rather bullish narrative for the coin. On the 4-hour timeframe, the meme coin showed a lot of strength as a recovery rocked the crypto market. Then moving on to the weekly timeframe, the analyst points out that Dogecoin is currently flashing a buy signal for investors to get back in. This buy signal comes between the $0.078 and $0.084 levels. Now, the levels highlighted for buying here coincide with the analysis from crypto analyst Skew who explained that the risk-reward above $0.087 is higher for investors who are looking to get in on the asset. These levels could present the best buying opportunity before the next leg-up. DOGE price is shaky at $0.084 &#124; Source: DOGEUSD On Tradingview.com DOGE Price Could Fly 800% CryptoCheck’s analyst also predicts a lot of potential upside for the Dogecoin price. They point out that DOGE has gone from a joke to a prominent crypto and this is thanks to the community which has continued to support its growth and development. Related Reading: XRP And XLM Price Correlation Persists, Ripple CTO Explains Why Given the chart position, there is a lot of upside potential for the meme coin going forward in 2024. Some of the developments that could propel this price surge include the fact that Elon Musk’s X is getting ready to launch a peer-to-peer payments platform this year. As always, expectations are that Dogecoin could play a huge role in this. However, while the analyst sees a lot of potential in the future of the altcoin, they explains that DOGE is still quite bearish in the short term. “The price needs to establish support before going higher, and the downward trend means that support hasn&#8217;t been found at the current levels,” CryptoCheck explains. Featured image from CoinMarketCap, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-13T01:04:24.000Z",
    "title": "JPMorgan Chase Warns Massive Tax Hikes May Be Introduced in the US As Debt Explodes to $34,006,270,930,685",
    "url": "https://dailyhodl.com/2024/01/12/jpmorgan-chase-warns-massive-tax-hikes-may-be-introduced-in-the-us-as-debt-explodes-to-34006270930685/",
    "description": "<img width=\"1009\" height=\"569\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/jpmorgan-chase-warning.jpg?w=1009\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/jpmorgan-chase-warning.jpg 1009w, https://dailyhodl.com/wp-content/uploads/2024/01/jpmorgan-chase-warning.jpg?resize=300,169 300w, https://dailyhodl.com/wp-content/uploads/2024/01/jpmorgan-chase-warning.jpg?resize=768,433 768w, https://dailyhodl.com/wp-content/uploads/2024/01/jpmorgan-chase-warning.jpg?resize=750,423 750w\" sizes=\"(max-width: 1009px) 100vw, 1009px\" /><p>The US will extract more money from American taxpayers and businesses as the government&#8217;s liabilities become too much to handle, according to a new forecast from JPMorgan Chase. Michael Cembalest, Chairman of Market and Investment Strategy for JPM&#8217;s Wealth and Asset Management branch, cites data from the Congressional Budget Office (CBO) that suggests all Federal [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/12/jpmorgan-chase-warns-massive-tax-hikes-may-be-introduced-in-the-us-as-debt-explodes-to-34006270930685/\">JPMorgan Chase Warns Massive Tax Hikes May Be Introduced in the US As Debt Explodes to $34,006,270,930,685</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-13T01:00:25.000Z",
    "title": "Top Analyst Predicts Solana-Based Altcoin To Skyrocket Over 350%, Says Ethereum Flashing ‘Very Bullish Signal’",
    "url": "https://dailyhodl.com/2024/01/12/top-analyst-predicts-solana-based-altcoin-to-skyrocket-over-350-says-ethereum-flashing-very-bullish-signal/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/top-says-flashing-signal.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/top-says-flashing-signal.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/top-says-flashing-signal.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/top-says-flashing-signal.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/top-says-flashing-signal.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/top-says-flashing-signal.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/top-says-flashing-signal.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed cryptocurrency analyst and trader is expressing bullish sentiment on a Solana-based memecoin. The analyst pseudonymously known as Bluntz tells his 236,100 followers on the X social media platform that the dogwifhat (WIF) memecoin could potentially appreciate by approximately 359% from the current level. &#8220;If you think this ain’t going to $1 at [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/12/top-analyst-predicts-solana-based-altcoin-to-skyrocket-over-350-says-ethereum-flashing-very-bullish-signal/\">Top Analyst Predicts Solana-Based Altcoin To Skyrocket Over 350%, Says Ethereum Flashing ‘Very Bullish Signal’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]