[
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T08:59:28.000Z",
    "title": "FOMC versus BTC price 'local bottom' — 5 things to know in Bitcoin this week",
    "url": "https://cointelegraph.com/news/fomc-btc-price-local-bottom-5-things-bitcoin-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/3863dedf-64ea-4648-874c-244f92e324c6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin network fundamentals have never looked better, as optimism trickles back when it comes to BTC price strength in a key Fed rate decision week.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) starts the new week with optimism as traders greet the first green weekly candle in over a month.</p><p>BTC price strength appears to be gradually improving after a weak August and start of September, with BTC/USD climbing toward $27,000.</p><p>A solid weekly close provides the backdrop to what promises to be an interesting few days, which will include a key United States macroeconomic event as a potential volatility driver.</p><p>The Federal Reserve will meet to decide on interest rate policy — and any surprises could have significant repercussions for risk assets, including crypto.</p><p>Elsewhere, things are looking promising for Bitcoin, with network fundamentals set to surge higher to new records.</p><p>Strength “under the hood” is similarly being reflected in hodler behavior, with wallet numbers continuing to shoot higher regardless of BTC price action.</p><p>Cointelegraph takes a look at these topics and more as Bitcoin begins what is likely its most eagerly-awaited week of September.</p><h2>Trader eyes BTC price \"local bottom\"</h2><p>Bitcoin <a href=\"https://cointelegraph.com/news/bitcoin-price-key-fed-inflation-week-dawns\">offered little volatility</a> over the weekend, but calmer trading conditions are already being challenged into the new week, data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> shows.</p><p>The Sep. 17 weekly close soon gave way to upside volatility, and at the time of writing, bulls are attempting to build on that foundation to crack new month-to-date highs.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/5d0937ad-c9b7-4420-b8f0-7988f7623459.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><p>Popular trader Credible Crypto thus suggested that the weekend zone could well form a “local bottom.”</p><p>“This region continues to be defended, with buyers stepping in here once again. Has the makings of a local bottom/base being formed imo,” he <a href=\"https://twitter.com/CredibleCrypto/status/1703503926887125377\" target=\"_blank\" rel=\"noopener nofollow\">told</a> X subscribers overnight, alongside a chart of order book liquidity on largest global exchange Binance.</p><blockquote>“I think we probs push back up to 27k+ soon.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/25e7e3de-23d0-4647-9aa3-c8a8fb3e08f4.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD order book data for Binance annotated chart. Source: Credible Crypto/X</em></figcaption></figure><p>A prior post <a href=\"https://twitter.com/MI_Algos/status/1703565692040089845\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> the lack of promise in shorting at weekend levels, with bid liquidity improving.</p><p>The weekly close meanwhile excited Michaël van de Poppe, founder and CEO of trading firm Eight, who saw key support holding at the 200-week exponential moving average (EMA).</p><p>“Bitcoin is closing above the 200-Week EMA, which is vital for bullish continuation,” he <a href=\"https://twitter.com/CryptoMichNL/status/1703470465660989913\" target=\"_blank\" rel=\"noopener nofollow\">explained</a>. </p><blockquote>“Next week we should continue to do so and price starts to look similar to the 2015/2016 cycle.”</blockquote><p>Van de Poppe uploaded a chart showing the interplay between spot price and the 200-week EMA, currently at $25,700, since 2020.</p><p>“Markets are consolidating with a weekly close strongly above the 200-Week EMA for Bitcoin. The chances of the correction to be finished are increasing day by day,” he <a href=\"https://twitter.com/CryptoMichNL/status/1703411428240019770\" target=\"_blank\" rel=\"noopener nofollow\">added</a> in a separate post.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/2acfc288-7186-4287-8586-4270d58f0960.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Michaël van de Poppe/X</em></figcaption></figure><p>Some are staying sober on the outlook for Bitcoin into 2024. Among them is popular trader and analyst Rekt Capital, who continues to eye the potential for a bearish double top pattern to play out on weekly timeframes.</p><p>“Make no mistake - Bitcoin is in an early stage Bull Market,” he <a href=\"https://twitter.com/rektcapital/status/1703473587158446301\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in part of weekend X analysis. </p><blockquote>“Long-term the outlook is bullish. Mid-term? Over the next 7 months, we may or may not get 1 last major correction. Will it happen? It would be wise to at least be ready for it if it does.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/bb4f37c2-0d71-4a5c-a5e8-489761fba1e8.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Rekt Capital/X</em></figcaption></figure><h2> FOMC volatility due with rate pause odds at 99%</h2><p>The word on everyone’s lips this week is FOMC — the Federal Open Market Committee — which will meet to decide on interest rates going forward.</p><p>If history is a guide, the Sep. 20 decision will induce at least some form of volatility across risk assets, with Bitcoin and crypto no exception. </p><p>The landscape surrounding the latest FOMC meeting is mixed — last week’s macro data shows <a href=\"https://cointelegraph.com/news/btc-price-27k-bitcoin-ppi-inflation-surprise\">inflation beating expectations</a>, yet markets overwhelmingly believe that the Fed will not raise rates further to combat it.</p><p>According to CME Group’s <a href=\"https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html\" target=\"_blank\" rel=\"noopener nofollow\">FedWatch Tool</a>, the odds of rates remaining the same are almost unanimous.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/4ae8e91e-5805-4911-8b66-2ded34711b48.png\"  /><figcaption style=\"text-align: center;\"><em>Fed target rate probabilities chart. Source: CME Group</em></figcaption></figure><p>This could reduce the impact of the FOMC event — but conversely, a curveball decision which goes against market appraisals would be felt all the more keenly.</p><p>“This week sets up the rest of 2023,” financial commentary resource The Kobeissi Letter summarized while highlighting upcoming macro data releases and more.</p><p>“Fed guidance on Wednesday sets the tone for the next few meetings. Expect to see lots of volatility this week.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Key Events This Week:<br><br>1. Building Permits data - Tuesday<br><br>2. Housing Starts data - Tuesday<br><br>3. Fed Interest Rate Decision - Wednesday<br><br>4. Fed Press Conference - Wednesday<br><br>5. Jobless Claims - Thursday<br><br>6. Existing Home Sales data - Thursday<br><br>This week sets up the rest of 2023.</p>&mdash; The Kobeissi Letter (@KobeissiLetter) <a href=\"https://twitter.com/KobeissiLetter/status/1703392574847713539?ref_src=twsrc%5Etfw\">September 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Explaining the likely outcome of FOMC, crypto and macro insight resource Ecoinometrics suggested that the market odds were no surprise based on Fed signals.</p><p>“There will be no rate hike at the FOMC meeting on September 20. That’s what the Fed Funds futures are pricing,” it <a href=\"https://twitter.com/ecoinometrics/status/1703379996117717496\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> at the weekend. </p><blockquote>“And actually they have been very consistent about that for a long time now. The fact that the latest inflation numbers aren’t exactly going in the right direction didn’t change anything to that.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/67f2d53d-8452-4d60-abbb-2705a20595bc.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Fed funds futures annotated chart. Source: Ecoinometrics/X</em></figcaption></figure><p>An accompanying chart added that the market “never had doubts” about what would happen in September.</p><h2>Difficulty, hash rate return to new records</h2><p>Back to Bitcoin and a return to the “up only” style of fundamental growth is set to characterize the coming week.</p><p>Mining difficulty, which dipped 2.65% at its last automated readjustment two weeks ago, will cancel out its losses on Sep. 19.</p><p>The latest estimates from <a href=\"https://btc.com/stats/diff\" target=\"_blank\" rel=\"noopener nofollow\">BTC.com</a> suggest that difficulty will increase by a solid 4.6% — taking it to new all-time highs in the process.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/ee36337e-1ba5-4833-a7ce-3617c35ca3d6.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin network fundamentals overview (screenshot). Source: BTC.com</em></figcaption></figure><p>2023 has seen a broad uptrend in difficulty challenged only briefly, even as spot price action delivered more challenging conditions.</p><p>The story is the same for hash rate — the estimated processing power deployed by miners — which continues to set new records of its own.</p><p>A conspicuous spike into the new week has become a talking point in its own right, with optimism increasing among commentators as a result.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Who is responsible for the hashrate jumping up almost 20%? Who do you think?<br><br>This is surreal.<a href=\"https://twitter.com/hashtag/btc?src=hash&amp;ref_src=twsrc%5Etfw\">#btc</a> <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> <a href=\"https://t.co/paIwb57DNm\">pic.twitter.com/paIwb57DNm</a></p>&mdash; Bitcoin Bootcamp  (@BTCbootcamp) <a href=\"https://twitter.com/BTCbootcamp/status/1703375972257374292?ref_src=twsrc%5Etfw\">September 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“The bitcoin network hashrate is at an all time high,” Nicholas Cary, co-founder of Bitcoin data resource Blockchain.com, <a href=\"https://twitter.com/niccary/status/1700531415304090033\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> earlier this month. </p><blockquote>“What does this mean? The difficulty is a measure of how difficult it is to mine a Bitcoin block, or in more technical terms, to find a hash below a given target. A high difficulty means that it will take more computing power to mine the same number of blocks, making the network more secure against attacks.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/fa3fc8b8-15a3-47ba-9266-0d773104812d.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin estimated hash rate chart. Source: Blockchain</em></figcaption></figure><p>Blockchain <a href=\"https://www.blockchain.com/explorer/charts/hash-rate\" target=\"_blank\" rel=\"noopener nofollow\">estimated</a> hash rate at 422 exahashes per second (EH/s) as of Sep. 17, while BTC.com currently puts the figure at 430 EH/s.</p><h2>Bitcoin address numbers reach multi-year highs</h2><p>Just as there is no stopping Bitcoin miners, the user base likewise appears to be relentlessly expanding.</p><p>The number of new BTC wallets being created is now at its highest since late 2017, the time of Bitcoin’s old all-time high of $20,000, data from on-chain analytics firm Glassnode shows.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/07aadc6d-5cfd-4332-9fae-3fb977571f26.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin new addresses chart. Source: Andre Dragosch/X</em></figcaption></figure><p>According to the firm’s address tracking metric, even the later trip to $69,000 failed to spark as big a reaction in new address creation.</p><p>Active addresses, however, do mimic mid-2021, returning to those levels for the first time this month.</p><p>The data was <a href=\"https://twitter.com/Andre_Dragosch/status/1703662067129934008\" target=\"_blank\" rel=\"noopener nofollow\">uploaded</a> to X by Andre Dragosch, head of research at crypto investment firm Deutsche Digital Assets. Dragosch quizzed whether BTC price performance would copy the return to form across the Glassnode metrics.</p><p>“All-time high in addresses with 0.01 Bitcoin or less,” James Straten, research and data analyst at crypto insights firm CryptoSlate, <a href=\"https://twitter.com/jimmyvs24/status/1703450571078857118\" target=\"_blank\" rel=\"noopener nofollow\">added</a> about further Glassnode data. </p><blockquote>“Fifth or so strongest accumulation from this cohort in the past five years. This asset continues to be cornered by a small cohort.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/a242b69a-8957-496c-a7a4-9f56322b6110.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin wallets with a balance of 0.01 BTC or less chart. Source: James Straten/X</em></figcaption></figure><h2>Crypto fear is never far away</h2><p>While things may be looking up across the Bitcoin ecosystem, the average crypto investor is yet to regain their confidence.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-price-prediction-all-time-high-precede-2024-halving\">Bitcoin price all-time high will precede 2024 halving — New prediction</a></em></strong></p><p>According to the latest data from the <a href=\"https://alternative.me/crypto/fear-and-greed-index/\" target=\"_blank\" rel=\"noopener nofollow\">Crypto Fear &amp; Greed Index</a>, the mood characterizing crypto continues to be one of “fear.”</p><p>The extent of the cold feet is modest — the Index, which normalizes sentiment on a 0-100 scale, is now just below its “neutral” 50 mark.</p><p>Fear has nonetheless dominated since mid-August, with price triggers a key influencer.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/9bb74fc2-8a70-46de-b41e-6c0baf8e7ffc.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto Fear &amp; Greed Index (screenshot). Source: Alternative.me</em></figcaption></figure><p>Analzying net unrealized profit and loss data among the BTC supply, meanwhile, popular trader and analyst Titan of Crypto revealed what he called a “striking correlation” between this year’s environment and that seen in the run-up to previous Bitcoin bull runs.</p><p>“I think we might witness a similar price action as Bitcoin had in the first 2 cycles,” part of his commentary forecast.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>  Net Unrealized Profit / Loss striking correlation<br><br>- In 2012, 2016 as NUPL was contracting between Optimism / Anxiety and Hope / Fear areas BTC price was consolidating before resuming its run up. <br>- In 2019 as NUPL was shooting up Bitcoin price was rallying without a… <a href=\"https://t.co/110OMhdGcW\">pic.twitter.com/110OMhdGcW</a></p>&mdash; Titan of Crypto (@Washigorira) <a href=\"https://twitter.com/Washigorira/status/1703429694018744423?ref_src=twsrc%5Etfw\">September 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-18T09:00:55.000Z",
    "title": "Record surge as Bitcoin micro investors reach all-time high",
    "url": "https://cryptoslate.com/insights/record-surge-in-bitcoin-micro-investors/",
    "description": "<p>Quick Take Recent data analysis indicates that addresses holding 0.01 Bitcoin or less have reached an all-time high. This growth marks the fifth significant accumulation event spearheaded by this group in the past five years. This trend demonstrates that despite the size of their holdings, these &#8216;micro investors&#8217; are steadily increasing their presence in the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/record-surge-in-bitcoin-micro-investors/\">Record surge as Bitcoin micro investors reach all-time high</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-18T09:08:04.000Z",
    "title": "CoinEx Pens Open Letter To Hackers, Calls For Negotiations",
    "url": "https://cryptodaily.co.uk/2023/09/coinex-pens-open-letter-to-hackers-calls-for-negotiations",
    "description": "The exchange has promised a significant bug bounty reward if the funds are returned."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T09:07:01.000Z",
    "title": "JPEX faces severe liquidity crisis; Withdrawal fees skyrocket ",
    "url": "https://www.cryptopolitan.com/jpex-severe-liquidity-crisis-fees-skyrocket/",
    "description": "Dubai-based cryptocurrency exchange JPEX, finds itself embroiled in controversy as it grapples with liquidity challenges, placing the blame on third-party market makers. Amidst allegations, operational changes, and user dissatisfaction, the exchange&#8217;s reputation hangs in the balance. Accusations and blame game JPEX, a cryptocurrency exchange hailing from Dubai, has launched a series of accusations against its ... <a title=\"JPEX faces severe liquidity crisis; Withdrawal fees skyrocket \" class=\"read-more\" href=\"https://www.cryptopolitan.com/jpex-severe-liquidity-crisis-fees-skyrocket/\" aria-label=\"More on JPEX faces severe liquidity crisis; Withdrawal fees skyrocket \">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T08:56:46.000Z",
    "title": "Google Cloud’s Web3 head emphasizes business over token prices",
    "url": "https://www.cryptopolitan.com/google-cloud-web3-emphasize-over-token-price/",
    "description": "James Tromans, the Head of Web3 at Google Cloud, recently expressed concerns over the disproportionate emphasis placed on token prices within the cryptocurrency industry. In an exclusive interview, he voiced his thoughts about the need for the crypto community to shift their focus from token supply and demand dynamics to understanding how smart contracts can ... <a title=\"Google Cloud’s Web3 head emphasizes business over token prices\" class=\"read-more\" href=\"https://www.cryptopolitan.com/google-cloud-web3-emphasize-over-token-price/\" aria-label=\"More on Google Cloud’s Web3 head emphasizes business over token prices\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T08:50:45.000Z",
    "title": "Japanese Yen performance declines, upcoming central bank meetings hold influence",
    "url": "https://www.cryptopolitan.com/japanese-yen-performance-weakens/",
    "description": "The Japanese Yen (JPY) is persisting with its relatively weaker performance, as there are still doubts regarding the likelihood of a significant shift in the Bank of Japan&#8217;s (BoJ) dovish stance. At the close last week, the USD/JPY pair recorded a modest gain of 0.04% to reach 147.830. During a volatile session, the USD/JPY pair ... <a title=\"Japanese Yen performance declines, upcoming central bank meetings hold influence\" class=\"read-more\" href=\"https://www.cryptopolitan.com/japanese-yen-performance-weakens/\" aria-label=\"More on Japanese Yen performance declines, upcoming central bank meetings hold influence\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T08:54:29.000Z",
    "title": "Fake Elon Musk crypto giveaway scams flood TikTok",
    "url": "https://crypto.news/fake-elon-musk-crypto-giveaway-scams-flood-tiktok/",
    "description": "Bad actors are now turning to the video-sharing platform to scam people by pretending to be crypto giveaways from celebrities. TikTok is being flooded with fake posts pretending to be crypto giveaways from Elon Musk hourly, BleepingComputer first revealed. According&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T08:50:38.000Z",
    "title": "Hong Kong arrests celebrity linked to JPEX amid investigations",
    "url": "https://crypto.news/hong-kong-arrests-celebrity-linked-to-jpex-amid-investigations/",
    "description": "Police in Hong Kong have arrested an internet celebrity connected to the crypto platform JPEX, which is said to be unregulated. According to a local report on Sept. 18, the Police Commercial Crime Bureau of Hong Kong arrested Lam Zuo,&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T08:46:36.000Z",
    "title": "Chainlink surges amid high exchange inflows and social volume",
    "url": "https://crypto.news/chainlink-surges-amid-high-exchange-inflows-and-social-volume/",
    "description": "Chainlink’s (LINK) price has constantly risen since Sept. 11, after the asset hit a local bottom of $5.7 with a market cap of $3.1 billion. LINK is up by 5% in the past 24 hours and is trading at $6.56&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T08:42:23.000Z",
    "title": "Coinbase limits Zcash trading as ViaBTC poses risks of 51% attack",
    "url": "https://crypto.news/coinbase-limits-zcash-trading-as-viabtc-poses-risks-of-51-attack/",
    "description": "Coinbase changed the Zcash confirmation requirement to 110 blocks, increasing deposit time from 40 minutes to 2.5 hours. Crypto exchange Coinbase has limited trading with Zcash (ZEC) after it found that a single mining pool now controls more than 50%&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-18T08:50:47.000Z",
    "title": "Toncoin Shatters Bearish Predictions With 40% Rally – What’s The Story?",
    "url": "https://www.newsbtc.com/news/toncoin-shatters-bearish-predictions-with-40-rally-whats-the-story/",
    "description": "Toncoin (TON), in a surprising turn of events amidst a bearish market, has witnessed an extraordinary surge in its price value over the last seven days. Market indicators and metrics have overwhelmingly favored TON, painting a bullish picture for the cryptocurrency.  This unexpected rally was ignited by the breaking news of a partnership involving the renowned messaging app Telegram, further solidifying TON&#8217;s position as a preferred blockchain for Web3 infrastructure. Related Reading: Cardano Analysis: How Much Energy Do ADA Bulls Have To Hit $0.3 Milestone? Endorsement Of Toncoin Fuels Bullish Momentum The catalyst behind TON&#8217;s remarkable surge was the official endorsement of the TON network by Telegram. This strategic partnership has positioned TON as the go-to blockchain solution for Telegram&#8217;s Web3 infrastructure. What&#8217;s particularly exciting is the seamless integration of Telegram&#8217;s user interface with the TON network, promising a synergy that could reshape the landscape of decentralized applications (DApps) and decentralized finance (DeFi). Toncoin&#8217;s price action immediately reflected the positive sentiment following the Telegram partnership announcement. In a market where leading cryptocurrencies like Bitcoin (BTC) and Ethereum (ETH) had been struggling, TON stood out with a remarkable seven-day surge of 38.9%, showcasing its resilience and growth potential. TON market cap at $8.1 billion on the daily chart: TradingView.com As of the latest data from CoinGecko, TON is currently valued at $2.34, demonstrating a robust performance even amidst a brief 2.6% decline over the past 24 hours. Coinglass reported a notable increase in TON&#8217;s open interest during this price uptick, suggesting that the bullish momentum may persist in the days to come. Price analysis reports an uptick in TON&#8217;s open interest, signaling that the current bullish trend might persist in the coming days. Additionally, the cryptocurrency&#8217;s daily active addresses have surged significantly, suggesting increased user engagement and network activity. LunarCrush&#8217;s data adds another layer of optimism to the mix, as it highlights a substantial increase in TON&#8217;s trading volume – a classic bull signal. &#160; TON daily addresses climb. Source: LunarCrush Navigating High Volatile Zone As investors and traders keep a close eye on Toncoin&#8217;s meteoric rise, the Bollinger Bands indicate that TON&#8217;s price is firmly situated within a highly volatile zone. This volatility adds an element of excitement and potential opportunity for those looking to ride the wave of continued northbound price movement. Related Reading: Algorand (ALGO) May Have A Chance At A Bullish Streak – Here’s How Toncoin&#8217;s recent surge stands as a testament to the power of strategic partnerships and the growing influence of Web3. With Telegram&#8217;s official endorsement, TON has not only garnered increased attention but also gained credibility as a blockchain infrastructure provider.  Investors and enthusiasts alike will undoubtedly be watching closely to see if this bullish momentum is here to stay. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Pinterest"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T09:00:55.000Z",
    "title": "Why Are Stacks, Filecoin and Everlodge the Top Crypto Picks for 2023?",
    "url": "https://www.crypto-news-flash.com/why-are-stacks-filecoin-and-everlodge-the-top-crypto-picks-for-2023/?utm_source=rss&utm_medium=rss&utm_campaign=why-are-stacks-filecoin-and-everlodge-the-top-crypto-picks-for-2023",
    "description": "<img width=\"512\" height=\"299\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-74.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-74.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-74-300x175.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Everlodge (ELDG) is an upcoming marketplace for real estate investments that enables anyone to own fractional shares starting at $100, and the project can dominate the industry. Stacks (STX) has seen an upward momentum based on its on-chart data and can soon surge in value. On the other hand, the Victor Chang Cardiac Research Institute [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-18T08:40:34.000Z",
    "title": "FTX to Liquidate Assets: Will SOL Suffer?",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/ftx-to-liquidate-assets-will-sol-suffer/",
    "description": "<p>FTX has spent the last few months sourcing ways to repay its creditors. In a hearing in April, FTX revealed that it has recovered almost $7.3 billion in liquid assets. Interestingly, $4.8 billion of that total consisted of assets retrieved as of November 2022. However, the exchange recently received clearance from a bankruptcy judge to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/ftx-to-liquidate-assets-will-sol-suffer/\">FTX to Liquidate Assets: Will SOL Suffer?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]