[
  {
    "source": "Cointelegraph",
    "date": "2023-10-23T05:48:35.000Z",
    "title": "Worldcoin to cease paying Orb operators in USDC as early as November",
    "url": "https://cointelegraph.com/news/worldcoin-cease-usdc-payments-native-token-wld",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/98a725f4-58c5-4f87-bca3-9d0d867baa8b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Aside from ditching USDC for its native token, Worldcoin announced some changes to the terms of its WLD loans to market makers.</p>\n                    <p><p>Worldcoin is set to begin paying its Orb Operators — those rewarded for scanning people's eyes — with its native Worldcoin (WLD) token, phasing out USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) as early as next month.</p><p>According to an Oct. 22 <a href=\"https://worldcoin.org/blog/announcements/update-circulating-supply-evolution-renewal-market-maker-loan-agreements\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, Worldcoin says Orb Operators — who are “independent ecosystem participants” tasked with scanning people’s irises in exchange for WLD tokens — will cease to be paid in USDC as of November. The change will affect most jurisdictions.</p><p>Worldcoin said the move to pay orb operators entirely in WLD was part of a “transitional phase” <a href=\"https://cointelegraph.com/news/worldcoin-launch-divides-crypto-community\">following the official launch of the project</a> on July 24. On Oct. 10, the Worldcoin Foundation kicked off a pilot program to grant select operators with payment in WLD tokens. </p><blockquote>“In November 2023, the Worldcoin Foundation expects that the transition process will be completed such that all Operators will receive WLD going forward.”</blockquote><p>In the blog post, Worldcoin noted that the Worldcoin tokens are currently not available to people or companies who are living in the United States as well as “certain other restricted territories.”</p><p>Data <a href=\"https://dune.com/worldcoin/worldcoin\" target=\"_blank\" rel=\"noopener nofollow\">from</a> Worldcoin’s official Dune Analytics dashboard shows that the supply of the WLD token has grown from approximately 100 million at the time of launch to around 134 million at the time of publication.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/b0fa6a6c-2d26-4585-b1e8-23e028778aca.png\"  /><figcaption style=\"text-align: center;\"><em>The current circulating supply of Worldcoin (WLD) tokens. Source: Dune Analytics</em></figcaption></figure><p>Of the roughly 134 million WLD tokens issued so far, 100 million were distributed as loans to market makers while the remaining 34 million were given out to Orb operators and new users in the form of “free user grants.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/kenya-parliamentary-committee-shutdown-worldcoin\"><strong><em>Parliamentary committee calls for shutdown of Worldcoin in Kenya</em></strong></a></p><p>According to Worldcoin, a total of five market making entities received the 100 million WLD loans which were due to expire on Oct. 24, 2023. However, Worldcoin said that it would extend the expiration date of these loans to Dec. 15, with a reduced amount of 75 million WLD. </p><p>“The market makers will return or, alternatively, purchase some or all of the remaining 25 million as part of the agreement,” read the announcement. </p><p>The price of Worldcoin’s native WLD token has regained slightly in recent weeks following a somewhat prolonged post-launch slump. </p><p>WLD reached an all-time-high of $2.65 on July 27, before falling 63% to reach as low as $0.97 on Sept. 13. It is currently changing hands for $1.64 according to data from TradingView. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/06aacf7f-0779-446f-ae13-d01543a25fa5.png\"  /><figcaption style=\"text-align: center;\"><em>Worldcoin notched its all-time high in late-July before falling as low as $0.97. Source: TradingView</em></figcaption></figure><p><strong><em>AI Eye: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-real-ai-usecases-crypto-gemini-gpt-4-rival-roblox-assistant-ai-cheating/\"><strong><em>Real uses for AI in crypto, Google’s GPT-4 rival, AI edge for bad employees</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]