[
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T04:27:57.000Z",
    "title": "SEC freezes assets of DEBT Box, alleging $50M node license 'sham'",
    "url": "https://cointelegraph.com/news/sec-freeze-assets-debt-box-alleging-fraud",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/abf31005-16b8-413f-b159-06fcdc60da66.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchain mining software firm DEBT Box has been accused of lying to investors about its involvement in crypto mining and its \"node licenses.\"</p>\n                    <p><p>The United States Securities and Exchange Commission has obtained a temporary asset freeze against Utah-based crypto company Digital Licensing Inc, accusing the firm of perpetrating a $50 million fraudulent crypto scheme.</p><p>On Aug. 3 the SEC <a href=\"https://www.sec.gov/news/press-release/2023-146\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> it had obtained a temporary asset freeze, restraining order, and other emergency relief against Digital Licensing Inc., which was operating as “DEBT Box.”</p><p>The firm’s four principals, Jason Anderson, his brother Jacob Anderson, Schad Brannon, and Roydon Nelsonand, and 13 other defendants were included in the enforcement action. </p><p>The SEC has alleged the firm was selling unregistered securities since March 2021, which it called “node licenses.” </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/83f30a74-f294-433d-b27b-32ae57c5c863.PNG\"  /><figcaption style=\"text-align: center;\"><em>Screenshot shows DEBT Box's explainer of how the node license works. Source: DEBT Box</em></figcaption></figure><p>On its website, DEBT Box claims to be a decentralized eco-friendly blockchain “where crypto meets commodities.” It claims to sell “software mining licenses” which need to be activated before they begin mining. </p><p>Daily rewards are promised via a number of “projects” that appear to be linked to various industries such as real estate, commodities, agriculture, and technology. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3472e1da-292f-4f32-86c6-c6ed8fa48d1b.jpg\"  /><figcaption style=\"text-align: center;\">“Mining” projects offered on DEBT Box. Source: thedebtbox.com</figcaption></figure><p>The firm has 30,000 X (Twitter) <a href=\"https://twitter.com/TheDebtBox\" target=\"_blank\" rel=\"noopener nofollow\">followers</a> and was still active up until Aug. 3. It has a native token called DEBT which has tanked 52% since the SEC action. </p><p>In its complaint, the SEC said the firm falsely claimed that these “nodes” would generate crypto tokens through mining and that revenue-generating businesses would drive up the token values, resulting in huge gains for investors.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We obtained a temporary asset freeze, restraining order, and other emergency relief against DEBT Box and its four principals, Jason Anderson, his brother Jacob Anderson, Schad Brannon, and Roydon Nelson in connection with a fraudulent scheme to sell crypto asset securities.</p>&mdash; U.S. Securities and Exchange Commission (@SECGov) <a href=\"https://twitter.com/SECGov/status/1687149881796804614?ref_src=twsrc%5Etfw\">August 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In a statement, the SEC called the node licenses a “sham” intended to obscure the fact that the total supply was created by the company using blockchain code.</p><p>Tracy Combs, director of the SEC’s Salt Lake Regional Office, said:</p><blockquote>“We allege that DEBT Box and its principals lied to investors about virtually every material aspect of their unregistered offering of securities, including by falsely stating that they were engaged in crypto asset mining,”</blockquote><p>The defendants also allegedly lied about the revenues of businesses supposedly increasing the token values, according to the SEC.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cryptocurrency-versus-the-sec-a-fight-for-fair-digital-investing\"><strong><em>Cryptocurrency versus the SEC: A fight for fair digital investing</em></strong></a></p><p>The SEC is seeking permanent injunctions, return of ill-gotten gains, and civil penalties against the firm.</p><p>Cointelegraph reached out to Digital Licensing Inc. for comment but did not receive an immediate response.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk — What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T04:39:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. BNB prices have dropped by 23.95% since April 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  }
]