[
  {
    "source": "Cointelegraph",
    "date": "2024-03-27T06:30:03.000Z",
    "title": " KuCoin deemed ‘fine’ by analyst, despite criminal allegations ",
    "url": "https://cointelegraph.com/news/kucoin-withdrawals-deemed-fine-cryptoquant-analyst-despite-criminal-allegations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYmNkYWYyYzUtZTE3My00ZTVhLWFhMjUtODJhMGJmNWI2NDkyLkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Despite legal action against KuCoin's founders and a drastic uptick in withdrawals from the exchange, CryptoQuant CEO Ki Young Ju claims there's no reason to be overly concerned. </p>\n                    <p><p>The Seychelles-based crypto exchange KuCoin has been declared “fine” by Ki Young Ju, the founder and CEO of crypto analytics service CryptoQuant, despite criminal allegations and mounting concerns over its reserves among its users. </p><p>“BTC and ETH withdrawals surged, driven mainly by retail users, with a small impact on the overall reserve,” CryptoQuant CEO Ki Young Ju <a href=\"https://x.com/ki_young_ju/status/1772820598198313298?s=20\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> in a post on X.</p><p>“They appear to not commingle customers' funds and have sufficient reserves to process user withdrawals,” Ju stated, claiming that from an on-chain perspective, the exchange appears to be “fine.”</p><p><a href=\"https://cointelegraph.com/news/kucoin-withdrawals-deemed-fine-cryptoquant-analyst-despite-criminal-allegations\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-27T06:37:18.000Z",
    "title": "BBC Halts AI Experiment in Doctor Who Promotion After Fan Backlash",
    "url": "https://www.cryptopolitan.com/bbc-halts-ai-in-doctor-after-fan-backlash/",
    "description": "The BBC has decided to discontinue its utilization of generative AI to promote the long-standing science fiction series Doctor Who, following significant backlash from its devoted fanbase. The decision comes after the broadcaster faced criticism from fans and Doctor Who Companion website administrators who expressed disdain towards the implementation of AI in promoting the iconic [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-27T06:26:59.000Z",
    "title": "New Trends in AI Integration in Newsrooms: Simplifying Journalism with Technology",
    "url": "https://www.cryptopolitan.com/ai-integration-in-simplifying-journalism/",
    "description": "Newsrooms are seeing a major change in focus toward using Artificial Intelligence (AI) tools to expedite editorial processes and improve content creation in a quickly changing landscape where media constantly adjusts to technological improvements. News businesses are redesigning their approaches to incorporate these revolutionary shifts as experts stress the significance of utilizing AI efficiently rather [&#8230;]"
  }
]