[
  {
    "source": "NewsBTC",
    "date": "2023-11-06T04:36:21.000Z",
    "title": "Ethereum Price Grinds Higher and Liftoff Toward $2,000 Seems Imminent",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-grinds-higher-2000/",
    "description": "Ethereum price is moving higher above $1,850 against the US dollar. ETH is outperforming Bitcoin and might climb further higher toward the $2,000 resistance. Ethereum is gaining pace for a move toward the $2,000 level. The price is trading above $1,850 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support near $1,870 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move higher above the $1,920 and $1,950 levels. Ethereum Price Outperforms Bitcoin Ethereum remained in a positive zone above the $1,780 support zone. ETH started a fresh increase and was able to clear the $1,850 resistance, outperforming Bitcoin. The price even spiked above the $1,900 level. It traded to a new multi-week high at $1,912 and the price is now consolidating gains. It is now trading near the 23.6% Fib retracement level of the upward move from the $1,781 swing low to the $1,912 high. Ethereum is now trading above $1,850 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support near $1,870 on the hourly chart of ETH/USD. Source: ETHUSD on TradingView.com On the upside, the price is facing resistance near the $1,900 level. The first major resistance sits at $1,920. If ETH surpasses the $1,920 resistance, it could rise toward the $1,950 barrier. Any more gains might open the doors for a test of the $2,000 handle. The next key resistance is near $2,050, above which the price could accelerate higher toward the $2,120 level. Are Dips Limited in ETH? If Ethereum fails to clear the $1,920 resistance, it could start a downside correction. Initial support on the downside is near the $1,870 level or the trend line. The next key support is $1,850 or the 100 hourly SMA. It is also near the 50% Fib retracement level of the upward move from the $1,781 swing low to the $1,912 high. A downside break below the $1,850 support might spark a bearish wave. In the stated case, Ether could drop toward the $1,780 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,850 Major Resistance Level – $1,920"
  }
]