[
  {
    "source": "CoinDesk",
    "date": "2023-06-05T16:55:01.000Z",
    "title": "Cryptocurrencies Crash After the SEC Charges Binance With Sale of Unregistered Securities   ",
    "url": "https://www.coindesk.com/markets/2023/06/05/cryptocurrencies-tumble-after-the-sec-charges-binance-with-sale-of-unregistered-securities/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The SEC on Monday charged the crypto exchange and its CEO with violating a number of securities laws, including offering unregistered securities to the public."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-05T16:52:31.000Z",
    "title": "Liquidations surpass $200M in 1 hour after SEC’s Binance lawsuit",
    "url": "https://cryptoslate.com/liquidations-surpass-200m-in-1-hour-after-secs-binance-lawsuit/",
    "description": "<p>The U.S. Securities and Exchange&#8217;s (SEC) lawsuit against Binance wiped off over $200 million within one hour from crypto traders who held positions on the market. Following the news, CryptoSlate&#8217;s data showed that the total market cap of digital assets declined 2.87% to $1.12 trillion. Nearly $300M in the last 24 hours The crypto market [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/liquidations-surpass-200m-in-1-hour-after-secs-binance-lawsuit/\">Liquidations surpass $200M in 1 hour after SEC’s Binance lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-05T16:45:03.000Z",
    "title": "El Salvador’s Bitcoin Volcano in sight",
    "url": "https://cryptoslate.com/el-salvadors-bitcoin-volcano-in-sight/",
    "description": "<p>El Salvador continues its dedication to becoming a global leader in the Bitcoin mining industry through the development of its ambitious Volcano Energy project. The country plans to add 241 MW of renewables and 1.3 Eh/s of Bitcoin mining, marking a further step towards &#8220;economic freedom,&#8221; energy competitiveness, and &#8220;self-reliance,&#8221; as shared on Twitter by [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/el-salvadors-bitcoin-volcano-in-sight/\">El Salvador&#8217;s Bitcoin Volcano in sight</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-05T16:56:32.000Z",
    "title": "Binance Strikes Back: A Response to the SEC’s Legal Offensive",
    "url": "https://www.cryptoglobe.com/latest/2023/06/binance-strikes-back-a-response-to-the-secs-legal-offensive/",
    "description": "In a blog post published on June 5, 2023, Binance, the world’s largest crypto asset trading platform, expressed disappointment in the U.S. Securities and Exchange Commission’s (SEC) decision to file a complaint against the company and its CEO (“CZ”). The company stated that it had actively cooperated with the SEC’s investigations and had worked diligently […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-05T16:45:46.000Z",
    "title": "SEC Sues Binance and Its CEO, Changpeng Zhao",
    "url": "https://cryptodaily.co.uk/2023/06/sec-sues-binance-and-its-ceo-changpeng-zhao",
    "description": "<p>The SEC on Monday sued Binance and its CEO, Changpeng Zhao, for allegedly mishandling funds and lying to regulators. </p>\n<p>On Monday, the US Securities and Exchange Commission (SEC) accused cryptocurrency exchange Binance of allegedly mishandling customer funds and lying to investors and regulators about its operations.</p>\n<p>The SEC also sued Binance founder Changpeng Zhao, alleging that he and the exchange failed to restrict US customers from its platform and mislead investors about its market surveillance controls. The regulator further accused Binance of operating as an unregistered securities exchange, Reuters reports.</p>\n<p>In a press release, the SEC said:</p>\n\n<p>The Securities and Exchange Commission today charged Binance Holdings Ltd. (&ldquo;Binance&rdquo;), which operates the largest crypto asset trading platform in the world, Binance.com; U.S.-based affiliate, BAM Trading Services Inc. (&ldquo;BAM Trading&rdquo;), which, together with Binance, operates the crypto asset trading platform, Binance.US; and their founder, Changpeng Zhao, with a variety of securities law violations.</p>\n\n<p>In a case filed in federal court in Washington, DC, the SEC said the exchange has been mixing &ldquo;billions of dollars&rdquo; in customer funds and secretly sent them to Merit Peak Limited, a separate company controlled by Zhao. The SEC&rsquo;s complaint details that Binance and Zhao controlled customers&rsquo; assets, allowing them to mix and divert funds and that Binance created separate US entities &ldquo;as part of an elaborate scheme to evade US federal securities laws.&rdquo;</p>\n<p>Gary Gensler, Chair of the SEC, said:</p>\n\n<p>Through thirteen charges, we allege that Zhao and Binance entities engaged in an extensive web of deception, conflicts of interest, lack of disclosure, and calculated evasion of the law.</p>\n\n<p>Adding:</p>\n\n<p>As alleged, Zhao and Binance misled investors about their risk controls and corrupted trading volumes while actively concealing who was operating the platform, the manipulative trading of its affiliated market maker, and even where and with whom investor funds and crypto assets were custodied.</p>\n<p>They attempted to evade US securities laws by announcing sham controls that they disregarded behind the scenes so that they could keep high-value US customers on their platforms. The public should beware of investing any of their hard-earned assets with or on these unlawful platforms.</p>\n\nCZ Dismisses Charges\n<p>Zhao dismissed the charges on Twitter by saying &ldquo;4,&rdquo; a popular reference in the Binance community that urges users to ignore FUD (fear, uncertainty, and doubt).</p>\n\n<p dir=\"ltr\" lang=\"en\">4.Our team is all standing by, ensuring systems are stable, including withdrawals, and deposits. We will issue a response once we see the complaint. Haven't seen it yet. Media gets the info before we do.🙏</p>\n&mdash; CZ 🔶 Binance (@cz_binance) June 5, 2023\n<p>\n\n</p>\n<p>Zhao assured the community that Binance&rsquo;s systems are stable, with deposits and withdrawals operating per usual.&nbsp;</p>\n<p>Binance published its response to the suit shortly after the news broke. The exchange said:</p>\n\n<p>We are disappointed that the U.S. Securities and Exchange Commission chose to file a complaint today against Binance seeking, among other remedies, purported emergency relief.&nbsp; From the start, we have actively cooperated with the SEC&rsquo;s investigations and have worked hard to answer their questions and address their concerns.&nbsp;</p>\n<p>Most recently, we have engaged in extensive good-faith discussions to reach a negotiated settlement to resolve their investigations.&nbsp; But despite our efforts, with its complaint today the SEC abandoned that process and instead chose to act unilaterally and litigate.&nbsp; We are disheartened by that choice.&nbsp;</p>\n\nCrack Down on Binance Continues\n<p>The newest suit adds to the list of regulatory action taken against the exchange by US regulators. In March, the Commodity Futures Trading Commission (CFTC) sued Binance and Zhao, accusing the exchange of trading on its own platform and alleging that the founder partook in insider trading. &nbsp;</p>\n<p>CZ outright denied the allegations stating that Binance does not and will never trade for profit or &ldquo;manipulate&rdquo; the market. Despite CZ&rsquo;s denial, users withdrew around $400 million in 24 hours from the exchange.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-05T17:00:54.000Z",
    "title": "Rollman Mining Marks Its Ascent as the World’s First Provider of Professional Bitcoin Mining for The Everyday Retail and Institutional Investor",
    "url": "https://news.bitcoin.com/rollman-mining-marks-its-ascent-as-the-worlds-first-provider-of-professional-bitcoin-mining-for-the-everyday-retail-and-institutional-investor/",
    "description": "<img width=\"768\" height=\"403\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/ss-768x403.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/ss-300x157.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ss-1024x537.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ss-768x403.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ss.png 1431w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Tallinn, Estonia, June 5, 2023 – With continued rising interest in bitcoin as an asset class, the everyday investor keen on participating in institutional-grade bitcoin mining can now tap into the world&#8217;s first provider of these specialised services with Rollman Mining. The multi-strategy firm was created to provide investors of all sizes with [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T17:00:08.000Z",
    "title": "SEC comes for Binance and Changpeng Zhao",
    "url": "https://www.cryptopolitan.com/sec-comes-for-binance-and-changpeng-zhao/",
    "description": "The United States Securities and Exchange Commission (SEC) has levied serious accusations against Binance, the largest crypto exchange in the world, and its CEO Changpeng Zhao. The charges include violation of US securities laws, casting a significant shadow over Binance&#8217;s future operations. Accusations piling up: A detailed account The SEC&#8217;s allegations are extensive and paint ... <a title=\"SEC comes for Binance and Changpeng Zhao\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-comes-for-binance-and-changpeng-zhao/\" aria-label=\"More on SEC comes for Binance and Changpeng Zhao\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-05T17:04:24.000Z",
    "title": "El Salvador and Tether work together to create ‘Volcano Energy’ bitcoin mining center",
    "url": "https://crypto.news/el-salvador-and-tether-work-together-to-create-volcano-energy-bitcoin-mining-center/",
    "description": "El Salvador is embarking on an initiative to establish a renewable energy power generation park in the Metapán area, aiming to become a center in the global bitcoin mining industry. "
  },
  {
    "source": "BTCManager",
    "date": "2023-06-05T16:43:27.000Z",
    "title": "DataDash issues bitcoin stagnation warning, correction needed",
    "url": "https://crypto.news/datadash-issues-bitcoin-stagnation-warning-correction-needed/",
    "description": "In a recent video, Nicholas Merton, the crypto YouTuber from DataDash, addressed the stagnation that bitcoin has been experiencing since March 2023. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-05T16:46:31.000Z",
    "title": "Cardano (ADA) A Security? Price Collapses On SEC v. Binance Lawsuit",
    "url": "https://www.newsbtc.com/breaking-news-ticker/cardano-ada-a-security-price-collapses-on-sec-v-binance-lawsuit/",
    "description": "Cardano (ADA) and the crypto market just took a punch from the U.S. Securities and Exchange Commission (SEC). The regulator filed a lawsuit against Binance and its CEO, Changpeng Zhao, contributing to the decline in prices across the nascent market. Related Reading: Shiba Inu (SHIB) Poised For Significant Breakout: Here&#8217;s What To Watch Out For Cardano (ADA) trades at $0.35 as of this writing, recording a 6% loss in the last 24 hours. In the last week, the cryptocurrency recorded a 7% and stands amongst the worst performers in the top 10 by market capitalization, only surpassed by Binance Coin (BNB). SEC Fight Against Binance Splashes Cardano (ADA) According to the complaint filed by the U.S. regulator in the District of Columbia, Binance has been offering &#8220;unregistered securities&#8221; since its inception. These alleged securities under U.S. laws include Cardano (ADA), Polygon (MATIC), Solana (SOL), Filecoin (FIL), Cosmos Hub (ATOM), Algorand (ALGO), and others. On the document, the SEC classifies ADA as a &#8220;crypto security,&#8221; a term which they coined in the last two years. The regulator provides an overview of the token&#8217;s history, claiming the following and potentially arguing against ADA&#8217;s decentralization: Today, three entities are responsible for Cardano: (1) the Cardano Foundation, a Swiss entity that is the legal custodian of the Cardano protocol and owner of its brand; (2) IOHK, an engineering company controlled by Hoskinson and Wood responsible for designing, building and maintaining the Cardano blockchain; and (3) Emurgo (…). To sustain their argument, the SEC claims that these entities hold over 16.7% of ADA&#8217;s total supply or 31.1 billion ADA. The regulator also claims that the companies sold the token to fund development, marketing, business operations, and other critical project areas. As of this writing, there is no official reply from these entities, or IOHK (IOG), the company behind Cardano&#8217;s development. Crypto Market Participating Over-reacting To Binance Lawsuit? Despite the lawsuit, some crypto community members call the event a &#8220;nothing burger.&#8221; The U.S. regulator is still to provide a clear legal framework for what constitutes a security in this country. In that sense, legal expert Collins Belton believes that today&#8217;s bad news could turn into a positive development for the long haul. Via his Twitter account, the expert stated: (…) this should actually be seen as a bit of a tension reliever for anyone that hasn’t been wildly deluded on Hopium. This complaint has been hanging above us like a sword of Damocles and letting it fall now in the depths of a bear is probably the best we could hope for. Related Reading: Ethereum Top 10 Whales Now Hold 31.8M ETH, A New All-Time High Belton also believes the crypto market could be &#8220;overstating&#8221; the complaint. The lawsuit could finally release tension from key actors in the sector in the future, but in the short term, &#8220;not much change from status quo,&#8221; the expert concluded. Chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-05T16:46:38.000Z",
    "title": "Filecoin Becomes the Largest Deployed zk-SNARK Network, Generating Millions of New PoREP Daily",
    "url": "https://www.crypto-news-flash.com/filecoin-becomes-the-largest-deployed-zk-snark-network-generating-millions-of-new-porep-daily/?utm_source=rss&utm_medium=rss&utm_campaign=filecoin-becomes-the-largest-deployed-zk-snark-network-generating-millions-of-new-porep-daily",
    "description": "<p>The Filecoin Network currently produces an impressive count of 6-7 million zk-SNARK proofs daily. In the realm of cryptographic proofs, Filecoin&#8217;s trusted setup enables the creation of circuits capable of handling up to 2^27 (approximately 134 million) constraints.  Open-source blockchain-based platform and data storage marketplace Filecoin (FIL) has said they are the largest deployed zk-SNARK [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/filecoin-becomes-the-largest-deployed-zk-snark-network-generating-millions-of-new-porep-daily/\">Filecoin Becomes the Largest Deployed zk-SNARK Network, Generating Millions of New PoREP Daily</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-05T16:55:40.000Z",
    "title": "Mooky.io – $750,000 Raised Within a Matter of Days",
    "url": "https://dailyhodl.com/2023/06/05/mooky-io-750000-raised-within-a-matter-of-days/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>The crypto world is buzzing with excitement as a rising star emerges on the horizon – Mooky.io. With its unique blend of innovation, community empowerment and cutting-edge technology, Mooky.io has the potential to disrupt the crypto landscape as we know it. In this article, we embark on an exhilarating journey to explore how Mooky.io aims [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/05/mooky-io-750000-raised-within-a-matter-of-days/\">Mooky.io – $750,000 Raised Within a Matter of Days</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-05T16:55:13.000Z",
    "title": "Elizabeth Warren Claims Drug Lords and ‘Rogue Nations’ Using Crypto To Launder Money",
    "url": "https://dailyhodl.com/2023/06/05/elizabeth-warren-claims-drug-lords-and-rogue-nations-using-crypto-to-launder-money/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/Still-Not-in-Crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/Still-Not-in-Crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/Still-Not-in-Crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/Still-Not-in-Crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/Still-Not-in-Crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/Still-Not-in-Crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/Still-Not-in-Crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>US Senator Elizabeth Warren says crypto is helping to facilitate all kinds of crime and illicit financial activity. The Massachusetts Senator says that &#8220;rogue nations,&#8221; oligarchs and drug dealers are using cryptocurrency to fund their criminal regimes. The long-time crypto critic says she has proposed a bill that could address the illegal use of digital [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/05/elizabeth-warren-claims-drug-lords-and-rogue-nations-using-crypto-to-launder-money/\">Elizabeth Warren Claims Drug Lords and ‘Rogue Nations’ Using Crypto To Launder Money</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]