[
  {
    "source": "Crypto Daily",
    "date": "2023-07-15T07:55:00.000Z",
    "title": "BlockFi CEO Disregarded Warnings About FTX, Ignored Risk Team",
    "url": "https://cryptodaily.co.uk/2023/07/blockfi-ceo-disregarded-warnings-about-ftx-ignored-risk-team",
    "description": "<p>Court documents have revealed that Zac Prince, CEO of bankrupt crypto lending firm BlockFi, ignored warnings from the company&rsquo;s risk management team regarding exposure to FTX and Alameda Research.&nbsp;</p>\n<p>By the time it filed for bankruptcy, BlockFi had around $1.2 billion in assets tied to FTX and Alameda.&nbsp;</p>\nWarnings Ignored&nbsp;\n<p>The document revealing the details was filed on behalf of former customers of BlockFi. According to the document, Prince disregarded and blatantly ignored several warnings from the company&rsquo;s risk management team over lending to FTX&rsquo;s sister entity, Alameda Research. However, Price allegedly dismissed all concerns from the team, with BlockFi lending Alameda Research around $217 million by August 2021. The risk management team had also flagged several risks associated with the FTT token used to secure the loans if they required liquidation. However, these warnings were also ignored. The filing stated that the risk management team flagged concerns as early as 2021.&nbsp;</p>\n\n<p>&ldquo;As early as August 2021, BlockFi&rsquo;s risk management team was advised that Alameda&rsquo;s balance sheet was largely comprised of &lsquo;~7bb unlocked FTT and 11bb total including locked tokens based on unaudited financials. This set off alarms at BlockFi. Mr. Prince dismissed the concerns, urging the risk team to learn to &lsquo;get comfortable [with Alameda] being a three arrows size borrower, just with FTT and other collateral types instead of GBTC shares.&rdquo;</p>\n\n<p>In January 2022, the risk management team stopped issuing warnings to Prince about loaning to Alameda Research. Instead, discussions moved to Slack, where the CEO occasionally acknowledged BlockFi&rsquo;s exposure to FTX and Alameda. BlockFi had around $1.2 billion in assets tied to Alameda and FTX when it filed for bankruptcy. Subsequently, BlockFi halted withdrawals on the 10th of November, 2022, citing the collapse of FTX and Alameda Research.&nbsp;</p>\nBad Business Practices&nbsp;\n<p>When BlockFi filed for bankruptcy, it stated that it had significant exposure to FTX and its associated entities. Furthermore, FTX US received a $400 million credit line from BlockFi, further deepening their association.&nbsp;</p>\n\n<p>&ldquo;BlockFi recalled its loans from Alameda [in June 2022], and Alameda repaid its outstanding balance to almost zero. BlockFi then could have walked away from the relationship. Instead, it re-lent Alameda nearly $900 million (between July and September 2022), almost exclusively collateralized by FTT.&rdquo;</p>\n\n<p>The filing further stated that while the FTX collapse triggered BlockFi&rsquo;s downfall, poor decision-making and bad business practices were the ultimate reason behind BlockFi&rsquo;s bankruptcy.&nbsp;</p>\n\n<p>&ldquo;It may be true that Alameda/FTX&rsquo;s downfall triggered BlockFi&rsquo;s downfall, but BlockFi&rsquo;s demise was rooted in business practices and decisions well preceding Alameda/FTX&rsquo;s bankruptcy filing.&rdquo;</p>\n\n<p>The filing described BlockFi&rsquo;s functioning as a &ldquo;flawed business model&rdquo; and that the company took an unnecessary and unreasonable risk, leading to cataclysmic losses. It also added that BlockFi was not a regulated lending institution and challenged claims that BlockFi debtors are in a better position compared to FTX debtors.&nbsp;</p>\nBlockFi Disagrees&nbsp;\n<p>A representative from BlockFi responded to the filing, stating the company disagrees with the report, adding that the report cherry-picked statements and does not deliver an objective analysis. BlockFi blamed direct exposure to FTX as the reason for its bankruptcy.&nbsp;</p>\n\n<p>&ldquo;Ultimately, BlockFi failed because FTX and Alameda were and are fraudulent enterprises, and the Special Committee [of independent directors] has not uncovered any evidence that the Released Parties knew, should have known, or reasonably could have known, about FTX&rsquo;s and Alameda&rsquo;s true nature.&rdquo;</p>\n\n<p>Meanwhile, FTX and other companies have opposed BlockFi&rsquo;s bankruptcy plans in court filings, leading to delays in the execution of those plans. BlockFi currently owes between $1 billion to $10 billion to creditors.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-15T07:58:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. BNB prices have dropped by 23.95% since April 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-15T07:58:07.000Z",
    "title": "Ripple’s XRP Surges after a win over SEC, Bitcoin (BTC) Dominance Plummets: Is it Altcoin Season?",
    "url": "https://www.crypto-news-flash.com/ripples-xrp-surges-after-a-win-over-sec-bitcoin-btc-dominance-plummets-is-it-altcoin-season/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-xrp-surges-after-a-win-over-sec-bitcoin-btc-dominance-plummets-is-it-altcoin-season",
    "description": "<img width=\"1000\" height=\"664\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/mkarco-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/mkarco-Ripple.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/mkarco-Ripple-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/mkarco-Ripple-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/mkarco-Ripple-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Bitcoin&#8217;s market dominance drops significantly after a strong pump in the altcoin space following the Ripple XRP ruling on Thursday. Industry players are carefully observing whether this is the beginning of the new altcoin season or FOMO at play. On Thursday, July 13, the Southern District Court of New York announced that the programmatic sales [...]"
  }
]