[
  {
    "source": "CoinDesk",
    "date": "2023-08-01T10:02:13.000Z",
    "title": "Binance Japan Starts Onboarding Users",
    "url": "https://www.coindesk.com/policy/2023/08/01/binance-japan-starts-onboarding-users/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Two years earlier, the exchange was warned by Japanese regulators that it was operating in the country without permission."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-01T09:53:22.000Z",
    "title": "Curve Founder Deploys New Liquidity Pool to Address FRAX Debt Situation",
    "url": "https://www.coindesk.com/markets/2023/08/01/curve-founder-deploys-new-liquidity-pool-to-address-frax-debt-situation/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Egorov has created a new liquidity pool on Curve for FraxLend's CRV/FRAX market, called crvUSD/fFRAX. Analysts said it is an attempt to incentivise liquidity to FraxLend's pool from where Erogov has taken loan of 15.8 million FRAX."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-01T09:41:10.000Z",
    "title": "Nomura’s Crypto Arm Gains Operating License Approval in Dubai",
    "url": "https://www.coindesk.com/business/2023/08/01/nomuras-crypto-arm-gains-operating-license-approval-in-dubai/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Laser Digital will start its trading and asset management business in the coming months."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-01T10:00:00.000Z",
    "title": "Curve Finance founder's $100M debt could trigger a DeFi implosion: Report",
    "url": "https://cointelegraph.com/news/curve-finance-founder-100-million-debt-could-trigger-defi-implosion",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/adee3af3-16bb-47f7-b90d-8cd034f23ad6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Curve Finance founder Michael Egorov has a total of $100 million in debt backed by over 400 million CRV tokens. </p>\n                    <p><p>While Curve Finance is still weathering the aftermath of the recent <a href=\"https://cointelegraph.com/news/curve-finance-pools-exploited-over-24-reentrancy-vulnerability\">$47 million hack</a>, another issue concerning holders of the <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> protocol’s token has surfaced on the internet, sparking theories on how a massive dump can potentially happen. </p><p>On Aug. 1, crypto research firm Delphi Digital published a Twitter thread detailing the loans taken by Curve Finance founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2022/michael-egorov\">Michael Egorov</a> that are backed by 47% of the circulating supply of Curve DAO (CRV). According to the research firm, Egorov has around $100 million in loans across various lending protocols backed by 427.5 million CRV. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ Yesterday, several <a href=\"https://twitter.com/CurveFinance?ref_src=twsrc%5Etfw\">@CurveFinance</a> pools were exploited.<br><br>Curve founder, Michael Egorov, currently has a ~$100M loan backed by 427.5m <a href=\"https://twitter.com/search?q=%24CRV&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$CRV</a> (about 47% of the entire CRV circulating supply).<br><br>With <a href=\"https://twitter.com/search?q=%24CRV&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$CRV</a> down 10% over the past 24 hours, the health of Curve is in jeopardy. ⬇️ <a href=\"https://t.co/EKpQCkDs6W\">pic.twitter.com/EKpQCkDs6W</a></p>&mdash; Delphi Digital (@Delphi_Digital) <a href=\"https://twitter.com/Delphi_Digital/status/1686187959303708672?ref_src=twsrc%5Etfw\">August 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On Aave, Egorov has 305 million CRV backing a 63.2 million Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) loan. Delphi Digital noted that at a liquidation threshold of 55%, the position is eligible to be liquidated at $0.3767. At the time of writing, CRV trades at around $0.5975. This means that a 36% drop could potentially trigger a liquidation. </p><p>On Frax Finance, Egorov has 59 million CRV backing a debt of 15.8 million Frax. While the amount is lower, Fraxlend's time-weighted variable interest rate makes the loan more risky. The loan is currently at 100% utilization, and because of this, the interest rate for the loan doubles every 12 hours. While the interest rate is only 81.2%, Delphi Digital said that it can go up to 10,000% in just 3.5 days. This can lead to liquidation regardless of the price of the CRV token. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/white-hat-returns-5-million-curve-finance-hack\"><strong><em>Ethical hacker retrieves $5.4M for Curve Finance amid exploit</em></strong></a></p><p>Recognizing the risks, Egorov has already made moves to lower the debt and utilization rate by paying a total of 4 million FRAX in the last 24 hours. However, as soon as Egorov pays, users are quick to remove liquidity. </p><p>To combat this, Egorov deployed a Curve pool to incentivize liquidity toward the lending market. The pool gained $2 million in liquidity just 4 hours after its launch and decreased the utilization rate from 100% to 89%. </p><blockquote class=\"twitter-tweet\"><p lang=\"qme\" dir=\"ltr\"> <a href=\"https://t.co/UWKVYZO9gn\">pic.twitter.com/UWKVYZO9gn</a></p>&mdash; Chago0x (@chago0x) <a href=\"https://twitter.com/chago0x/status/1686136067353628672?ref_src=twsrc%5Etfw\">July 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Various community members commented on the situation with some <a href=\"https://twitter.com/julianhosp/status/1686266306440654848\" target=\"_blank\" rel=\"noopener nofollow\">comparing</a> it to FTX founder Sam Bankman-Fried using FTT as collateral and others <a href=\"https://twitter.com/AutismCapital/status/1686251750632853504\" target=\"_blank\" rel=\"noopener nofollow\">describing</a> it as a “black eye for the industry” that could set the industry back by a few years and spooking those who were considering dipping their toes in DeFi. </p><p>Cointelegraph reached out to Michael Egorov but did not get an immediate response. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethics-101-crypto-projects-negotiate-hackers/\"><strong><em>Should crypto projects ever negotiate with hackers? Probably</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-01T10:00:14.000Z",
    "title": "Bitcoin’s price drop supported by 100x leverage",
    "url": "https://cryptoslate.com/insights/bitcoins-price-drop-supported-by-100x-leverage/",
    "description": "<p>Quick Take Open Interest and Liquidation Event During the early hours of the morning on Aug. 1, open interest in Bitcoin increased on Binance, moving from 106,000 Bitcoin to 111,000 Bitcoin, a change of roughly $145 million. Subsequently, funding rates began to drop, triggering liquidations alongside. Long Liquidations The impact was felt significantly, with roughly [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-price-drop-supported-by-100x-leverage/\">Bitcoin&#8217;s price drop supported by 100x leverage</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-01T10:05:08.000Z",
    "title": "Enjinstarter IDO investors win big with AI",
    "url": "https://cryptodaily.co.uk/2023/08/enjinstarter-ido-investors-win-big-with-ai",
    "description": "<p>Singapore, Singapore, August 1st, 2023, Chainwire</p><p class=\"ql-align-center\">Launchpad delivers 142.4% ROI YTD thanks to carefully curated selection of AI projects</p><p class=\"ql-align-justify\">Leading IDO launchpad, Enjinstarter, announced today that its stable of AI-powered Web3 projects has earned investors an average ROI of 142.4% YTD in 2023. This puts Enjinstarter firmly in the top 3 of IDO providers worldwide, according to industry-leading ranking service, CryptoRank.</p><p class=\"ql-align-justify\">Continued success in Q2 comes on the back of a successful Q1 in which Enjinstarter was ranked by TokenHunter as the top-performing IDO launchpad with an average ROI of 538.49%.</p>&ldquo;Our number one goal is to deliver maximum value to our IDO participants. We conduct an exhaustive study of every launchpad applicant to bring our token holders a carefully curated selection of projects set to revolutionize the industry,&rdquo; said Prakash Somosundram, co-founder and CEO of Enjinstarter. &ldquo;At the beginning of the year, our team correctly identified the growing trend towards generative AI and was quick to adapt. Our overall success this year can be attributed to our team&rsquo;s ability to find the best among a proliferation of AI-powered Web3 projects.&rdquo;<p class=\"ql-align-justify\">2023 has been the year of AI. The continued evolution of OpenAI&rsquo;s GPT algorithm has led to a proliferation of generative AI-powered apps. Of the 13 IDOs conducted by Enjinstarter so far this year, 8 leverage the power of AI:</p><ul><li class=\"ql-align-justify\">ChainGPT - Infrastructure enabling the future of Web3 innovation with AI</li><li class=\"ql-align-justify\">Orbofi AI - Advanced platform for creating AI-generated content and fine-tuned AI models.</li><li class=\"ql-align-justify\">Eldarune - AI-powered RPG with PvE and PvP modes</li><li class=\"ql-align-justify\">Cogito Protocol - A decentralized and AI-driven tracercoin called GCOIN</li><li class=\"ql-align-justify\">KAIF Platform - AI-powered decentralized society (DeSoc) platform.</li><li class=\"ql-align-justify\">HyperGPT - A Web3-based AI marketplace</li><li class=\"ql-align-justify\">DexCheck - AI-boosted analytics for crypto and NFT trading</li><li class=\"ql-align-justify\">SophiaVerse - An advanced artificial general intelligence initiative revolutionizing the world of AI and gaming</li></ul><p class=\"ql-align-justify\">The top performing IDO launched through Enjinstarter in 2023 is ChainGPT with an ROI of 704% at the time of writing. SophiaVerse is a close second at 602%. Data provided by CryptoRank.</p><p class=\"ql-align-justify\">Building on the success of its IDO launchpad, Enjinstarter plans to build two additional launchpads. The first is an INO platform to connect utility-driven NFT projects with investors. The second is a platform specifically designed for Web3 climate startups to raise funds from impact investors.</p><p class=\"ql-align-justify\">Looking ahead, Enjinstarter has 5 IDO projects in the pipeline: SeaPad, Kvants AI, Boss Fighters, AITECH, and Backstage. It is also planning the release of an expansive storytelling AI NFT game based on an advanced earth concept where factions are embarking on quests and battles throughout the Enjinstarter ecosystem to gather resources and earn rewards.</p><p class=\"ql-align-justify\">To date, the company has helped launch over 80 Web3 projects and platforms since its inception in 2021.</p><p>For further media enquiries, please contact:</p><p>media@pariahdao.xyz</p><p>About Enjinstarter</p><p>Launched in 2021, Enjinstarter is a next-generation ecosystem and launchpad for promising Web3 gaming, entertainment and metaverse projects. They have supported 70 companies since</p><p>inception. They have a collective community of more than 200,000 across various social platforms and manage localised communities in South East Asia, India, Turkey and Spain. They have also launched dedicated market-launchers for North America and Indonesia.</p><p>Enjinstarter also has a fast growing Web3 Innovation Consulting practice that works with brands, large corporates and Web2 companies looking to develop a Web3 strategy. Clients that they have supported include Hatten Land and GCEX. Enjinstarter is also a member of the Open Metaverse Alliance.</p><p>Enjinstarter raised US$5 million in their Series A round from True Global Ventures 4 Plus, an equity venture capital firm that invests in serial tech entrepreneurs globally. The company has also received initial approval from Dubai&rsquo;s Virtual Assets Regulatory Authority, indicating progress in obtaining full permission to operate within Dubai.</p><p>Get connected with Enjinstarter:</p><p>https://linktr.ee/enjinstarter</p>ContactSocial Media LeadChris Sylvester BasilEnjinstarterchris@enjinstarter.com"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-01T10:01:12.000Z",
    "title": "Bitcoin repeating phase 1 of the bull - all is well",
    "url": "https://cryptodaily.co.uk/2023/08/bitcoin-repeating-phase-1-of-the-bull-all-is-well",
    "description": "<p>The Bitcoin bull market is just going through the same 3 steps it has taken in its previous bull markets.</p>\n<p>Seasoned trader Steve Courtney of CryptoCrewUniversity has been repeating his mantra for a good while now that Bitcoin is doing what it does every bull market, and that thus far it is following the pattern which puts it in stage one of the bull market.</p>\n<p>Courtney points out that right now Bitcoin is holding above the 200-week moving average and therefore even if it comes down to test it, which would take it down to around $27,000, all would be perfectly fine as long as this huge last line in the sand holds fast.</p>\n<p>The trader&rsquo;s next area to keep an eye on is the relative strength indicator (RSI) where Bitcoin needs to continue building a base structure above the mid level. Here, on the weekly time frame, support can be found at the 51 level. Courtney has the view that this is all-important, and should Bitcoin fall below and make this resistance, a lot of trouble could be heading Bitcoin&rsquo;s way.</p>\n<p>The Stochastic RSI, which measures momentum is Courtney&rsquo;s next port of call. The veteran trader points out that every 6 months there is a cross on the Stochastic RSI and remarks that each one of these crosses heralds the biggest moves for Bitcoin.</p>\n<p>For the previous cross, Bitcoin rallied from about $25,000 up to just under $32,000, from which it has fallen to its current level of around $29,000.&nbsp;</p>\n<p>For the 3 steps, Courtney states that step number 1 is triggered by the Pi Cycle. A cross up for this indicator always leads to a huge rally which is then met by resistance that is not broken for quite some period of time.</p>\n<p>However, this part of the bull market may not be plain sailing. Courtney says that if price does not hold above the red line, it will always fall to the green, quite a drop in price, leading to an extended phase 1, but which would still mean that Bitcoin stays in its bull market unless falling below the green line.</p>\n<p>For his second step Courtney uses the Dynamic Traders Index which tells him when Bitcoin moves into phase 2 of the bull market. He remarks that this indicator is not showing that we are near phase 2 of the bull yet.</p>\n<p>For Courtney, phase 2 is when price holds support above the resistance at $30,000 (phase 1) and then consolidates for many months. A breakout and consolidation above this would lead to stage 3 and big increases in price action until the top of this particular bull market is reached.</p>\n<p>Due to reducing gains in each successive bull market, Courtney is of the opinion that Bitcoin probably won&rsquo;t reach $100,000, which runs contrary to the view of most other analysts. Time will prove him right or wrong.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T10:01:26.000Z",
    "title": "Enjinstarter IDO investors win big with AI",
    "url": "https://www.cryptopolitan.com/enjinstarter-ido-investors-win-big-with-ai/",
    "description": "Singapore, Singapore, August 1st, 2023, Chainwire Launchpad delivers 142.4% ROI YTD thanks to carefully curated selection of AI projects Leading IDO launchpad, Enjinstarter, announced today that its stable of AI-powered Web3 projects has earned investors an average ROI of 142.4% YTD in 2023. This puts Enjinstarter firmly in the top 3 of IDO providers worldwide, ... <a title=\"Enjinstarter IDO investors win big with AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/enjinstarter-ido-investors-win-big-with-ai/\" aria-label=\"More on Enjinstarter IDO investors win big with AI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T09:55:58.000Z",
    "title": "GPT-4 Chatbot Demolishes AI-Guardian of Image Classifier in Research Experiment",
    "url": "https://www.cryptopolitan.com/gpt-4-chatbot-ai-guardian-image-classifier/",
    "description": "A Google scientist has demonstrated how OpenAI&#8217;s GPT-4 large language model (LLM) can be wielded as a research assistant to circumvent AI-Guardian, a defense against adversarial attacks on machine learning models. Nicholas Carlini, a research scientist for Google&#8217;s Deep Mind, reveals in his paper titled &#8220;A LLM Assisted Exploitation of AI-Guardian&#8221; how GPT-4 was directed ... <a title=\"GPT-4 Chatbot Demolishes AI-Guardian of Image Classifier in Research Experiment\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gpt-4-chatbot-ai-guardian-image-classifier/\" aria-label=\"More on GPT-4 Chatbot Demolishes AI-Guardian of Image Classifier in Research Experiment\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-01T10:04:14.000Z",
    "title": "What happens if Binance collapses?",
    "url": "https://crypto.news/what-happens-if-binance-collapses/",
    "description": "With all the regulatory hurdles Binance, the largest cryptocurrency exchange by trading volume, has faced over the past months, investors have taken a cautious approach toward the exchange. It all started with the US commodity futures trading commission (CFTC) taking&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-01T10:05:29.000Z",
    "title": "Enjinstarter IDO investors win big with AI",
    "url": "https://www.crypto-news-flash.com/enjinstarter-ido-investors-win-big-with-ai/?utm_source=rss&utm_medium=rss&utm_campaign=enjinstarter-ido-investors-win-big-with-ai",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Top_Launchpad_1690793927i9E9UoEXOu.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Top_Launchpad_1690793927i9E9UoEXOu.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Top_Launchpad_1690793927i9E9UoEXOu-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Top_Launchpad_1690793927i9E9UoEXOu-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Top_Launchpad_1690793927i9E9UoEXOu-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Singapore, Singapore, August 1st, 2023, Chainwire Launchpad delivers 142.4% ROI YTD thanks to carefully curated selection of AI projects Leading IDO launchpad, Enjinstarter, announced today that its stable of AI-powered Web3 projects has earned investors an average ROI of 142.4% YTD in 2023. This puts Enjinstarter firmly in the top 3 of IDO providers worldwide, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-01T10:00:22.000Z",
    "title": "Chainlink (LINK) and Tron (TRX) Lag as VC Spectra Triumphs with Remarkable Investment Returns!",
    "url": "https://www.crypto-news-flash.com/chainlink-link-and-tron-trx-lag-as-vc-spectra-triumphs-with-remarkable-investment-returns/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-link-and-tron-trx-lag-as-vc-spectra-triumphs-with-remarkable-investment-returns",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T122032.617.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T122032.617.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T122032.617-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Chainlink (LINK) and Tron (TRX), two notable cryptocurrencies, have recently experienced lagging performance. While Chainlink (LINK) and Tron (TRX) have recently seen a downturn in their trading volumes—46.40% and 10.26%, respectively, in the last 24 hours—VC Spectra (SPCT) stands apart.  VC Spectra (SPCT) has reported impressive 37.5% investment returns, setting a benchmark in the crypto [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-01T09:55:07.000Z",
    "title": "Join the Revenue Sharing Pool: Earn from PancakeSwap’s v3 Trading Fee Revenues by Staking CAKE",
    "url": "https://www.crypto-news-flash.com/join-the-revenue-sharing-pool-earn-from-pancakeswaps-v3-trading-fee-revenues-by-staking-cake/?utm_source=rss&utm_medium=rss&utm_campaign=join-the-revenue-sharing-pool-earn-from-pancakeswaps-v3-trading-fee-revenues-by-staking-cake",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T104611.721.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T104611.721.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T104611.721-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T104611.721-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />PancakeSwap introduces the Revenue Sharing Pool, allowing Fixed-Term CAKE stakers to earn 5% of the trading fee revenues from all v3 trading pairs with 0.01% and 0.05% fee tiers on a weekly basis. The new sustainable model offers real yield and continued growth, benefiting CAKE holders and promoting community-driven growth. PancakeSwap, the beloved decentralized exchange [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-01T09:46:59.000Z",
    "title": "Discover This SUPER Early AI Crypto Gem",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/discover-this-super-early-ai-crypto-gem/",
    "description": "<p>Don’t Miss this again! Last week we shared this massive IDO opportunity with you. I am not sure how many of you got in early but those who did Congrats! Your bag pumped 782.6%.  Now that the coin has already pumped why am I talking about it? Because for those who did not get in, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/discover-this-super-early-ai-crypto-gem/\">Discover This SUPER Early AI Crypto Gem</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]