[
  {
    "source": "Decrypt",
    "date": "2023-08-09T22:51:19.000Z",
    "title": "Supreme Court Says Apple App Store Rules Can Stand—For Now",
    "url": "https://decrypt.co/151950/apple-app-store-rules-epic-games-purchases-nfts",
    "description": "Epic Games will have to wait even longer for its opportunity to prove that Apple’s policies constitute unfair competition."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-09T23:06:23.000Z",
    "title": "Jury trial in SEC v. Ripple Labs to be set for Q2 2024",
    "url": "https://cryptoslate.com/jury-trial-in-sec-v-ripple-labs-to-be-set-for-q2-2024/",
    "description": "<p>Two Ripple executives named in a federal securities case have been scheduled for a jury trial, according to a court filing dated Aug. 9. The upcoming proceedings concern Ripple CEO Brad Garlinghouse and Ripple co-founder Chris Larsen. The U.S. Securities and Exchange Commission (SEC) previously alleged that the two individuals engaged in unlawful securities offerings [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/jury-trial-in-sec-v-ripple-labs-to-be-set-for-q2-2024/\">Jury trial in SEC v. Ripple Labs to be set for Q2 2024</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-09T23:00:16.000Z",
    "title": "Coinbase’s Ethereum layer-2 chain Base is live to the public",
    "url": "https://cryptoslate.com/coinbases-ethereum-layer-2-chain-base-is-live-to-the-public/",
    "description": "<p>Coinbase, a leading U.S. crypto exchange, officially launched Base, its Ethereum layer 2 network, to the general public on August 9, 2023. The Base testnet launched in February, followed by a developer-specific release in July. Built on Optimism&#8217;s software stack known as the OP Stack, Base operates as a rollup network, a scaling solution that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinbases-ethereum-layer-2-chain-base-is-live-to-the-public/\">Coinbase&#8217;s Ethereum layer-2 chain Base is live to the public</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-09T22:54:00.000Z",
    "title": "Bitcoin ($BTC) Will Keep Going Up by 100% a Year, Says Analyst Preston Pysh",
    "url": "https://www.cryptoglobe.com/latest/2023/08/bitcoin-btc-will-keep-going-up-by-100-a-year-says-analyst-preston-pysh/",
    "description": "Popular cryptocurrency investor Preston Push has recently predicted that the price of the flagship cryptocurrency Bitcoin ($BTC) is set to see a 100% rise per year when compared to fiat currencies like the U.S. dollar. During a recent discussion with Scott Melker, Pysh elaborated on his Bitcoin price prediction, pointing to its ascent as a […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-09T23:00:39.000Z",
    "title": "Toncoin (TON) Surges As Crypto Market Rebounds, Can Bulls Send The Price To $2?",
    "url": "https://www.newsbtc.com/toncoin-ton/toncoin-ton-surges-as-crypto-market-rebounds-can-bulls-send-the-price-to-2/",
    "description": "The TON price currently hovers at $1.28, representing a 4.54% price increase in the last 24 hours. Its price gain in the last 7 days stands at 7.58%. Toncoin is likely benefiting from the positive outlook of the global crypto market, standing at $1.18 trillion, representing a 1.42% gain in the last 24 hours. But how far can the rally go?  What Could Be Driving TON’s Price Gains? According to a Ton Developer Report, the ecosystem recorded a massive increase in developer involvement of up to 102% in 2023. This is a significant increase from its previous levels in 2016. In addition, the report noted several events within the ecosystem that could be spurring the present surge. They include the DoraHacks Hackathon, TON Wiki Challenge, and the TON Grants program.  Related Reading: XRP Price: Breaking This Key Resistance Could Propel Crypto To $21 By 2025 – Analyst Also, the TON Developers Chats community grew by 6.5% in Q2 2023, with 9,134 members by the end of June. This indicates rising interest among developers in the Toncoin network.  The DoraHacks Hackathon was a significant event for the ecosystem&#8217;s growth, as it boosted community engagement. The TON Wallet challenge also recorded 101 submissions from developers competing for a share in the $40,000 prize pool.  Similarly, the TON Wiki Challenge received 50 valuable contributions and rewarded 30 participants with a total prize of $5,000 in USD. Furthermore, the TVM challenge recorded the presentation of 11 projects with new features. The participants competed for a share in the $54,000 prize pool.  Finally, the Ton Web App Challenge presents concepts that cut across various ecosystems and their progress.  Aside from challenges, the TON Grants program supported 34 projects with approximately $66,000 in funding. These projects will likely positively affect the ecosystem once they are complete.  With these strategic programs, TON is transforming into a developers’ hub, and the increased activity on the network is driving its price gains.  Can TON Reach $2? TON shows limited trading activity with the small candles formed on the daily chart. It is trading below its 50-day and 200-day Simple Moving Average (SMA), expressing a bearish sentiment. Also, the 50-day SMA is about to drop below the 200-day SMA, forming a Death cross which confirms an increase in bearish pressure.  The Relative Strength Index (RSI) shows a value of 31.42, close to the oversold region 30. However, the RSI is moving sideways, confirming price volatility for the asset.  The Moving Average Convergence/Divergence (MACD) is below the signal line, also expressing a bearish sentiment. However, the Histogram bars are fading, hinting at a short-term price surge.  Related Reading: Bitcoin Price Losses Steam Above $30K But The Bulls Are Not Done Yet With all the indicators screaming bearish pressure, Toncoin will find it hard to sustain the rally in the short term and likely succumb to the rising pressure from the bears in the coming days. Featured image from Pixabay and chart from TradingView.com"
  }
]