[
  {
    "source": "CryptoSlate",
    "date": "2023-05-31T22:33:32.000Z",
    "title": "Elizabeth Warren highlights crypto’s role in fentanyl trade; plans to combat with bill",
    "url": "https://cryptoslate.com/elizabeth-warren-highlights-cryptos-role-in-fentanyl-trade-plans-to-combat-with-bill/",
    "description": "<p>Senator Elizabeth Warren said during a May 31 Senate hearing that she aims to combat cryptocurrency&#8217;s role in the illegal fentanyl trade. Fentanyl trade Warren said to the Senate Banking Committee: &#8220;Crypto is supposedly banned in China &#8230; but more than 90 companies based in China are raking in tens of millions of dollars worth [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/elizabeth-warren-highlights-cryptos-role-in-fentanyl-trade-plans-to-combat-with-bill/\">Elizabeth Warren highlights crypto&#8217;s role in fentanyl trade; plans to combat with bill</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-05-31T22:30:00.000Z",
    "title": "Cardano-based Decentralized Exchange Minswap Hits New All-Time High Daily Trading Volume",
    "url": "https://www.cryptoglobe.com/latest/2023/05/cardano-based-decentralized-exchange-minswap-hits-new-all-time-high-daily-trading-volume/",
    "description": "Minswap, a decentralized exchange (DEX) operating on the Cardano ($ADA) blockchain has recently experienced a record-breaking day of trading volume, reaching an all-time high volume of 54.98 million ADA, equivalent to approximately $20.93 million. The volume, according to the cryptocurrency exchange, accounted for a little over 90% of all the trading volume among decentralized exchanges […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-31T22:30:41.000Z",
    "title": "Did The US SEC Just Endorse Ethereum After This Settlement?",
    "url": "https://www.newsbtc.com/news/ethereum/did-the-us-sec-just-endorse-ethereum-after-this-settlement/",
    "description": "On May 30, the United States Securities and Exchange Commission (SEC) announced that Ishan Wahi, the former Coinbase product manager, and his brother, Nikhil Wahi, had agreed to settle charges brought forth by the regulator accusing them of engaging in an insider trading scheme. SEC Settlement With Former Coinbase Product Manager In this way, the two defendants also agreed that their actions violated Section 10(b) of the Securities Exchange Act.  Accordingly, Ishan has been sentenced to two years in prison, while his brother, Nikhil, will serve ten months behind bars. In a statement, the SEC also said the former Coinbase product manager forfeited 10.97 ETH and 9,440 USDT. On the other hand, Nikhil has submitted to the state 892,500 USDT.  Related Reading: Russia scraps plans for a national cryptocurrency exchange, as HedgeUp (HDUP) Prepares for world Domination migrating on Stellar This is part of the settlement and forfeiture of securities the SEC said were ill-gotten. The case was settled roughly a year after the SEC filed the suit at the District Court for the Western District of Washington, accusing the former Coinbase product manager of using confidential information to benefit from trading crypto assets, most of which, the regulator claims, were securities. According to the Director of the SEC’s Division of Enforcement, Gurbir S. Grewal, their actions amounted to insider trading. Grewal stated: While the technologies at issue, in this case, may be new, the conduct is not. We allege that Ishan and Nikhil Wahi, respectively, tipped and traded securities based on material nonpublic information, and that’s insider trading, pure and simple. How Will The SEC Handle Ethereum? While the SEC succeeded, questions are being asked about how the regulator will allow the forfeiture of those digital assets, including Ethereum, in a way that the regulator considers legal and lawful.  Though there is an argument that all assets received from the two brothers will be forfeited to the Department of Justice (DoJ), some maintain that the SEC must first confirm receipt. Recently, Gary Gensler, the chairman of the SEC, failed to clarify whether Ethereum, like Bitcoin, is a commodity that should be treated as a property and its capital gains tax. While in front of the House Financial Services Committee, Gensler repeatedly said the agency was learning more about Ethereum.  This didn’t help ETH since a clear endorsement from the SEC, the principal regulator, could lead to regulatory clarity, possibly driving prices and on-chain activity. SEC’s position differs from the Commodity Futures Trading Commission (CFTC), which classifies Bitcoin, Ethereum, and Litecoin as commodities, not securities. Related Reading: Car Rental Owner Arrested In Bali For Accepting Crypto Payments Still, a statement from the SEC declaring ETH a commodity is much awaited by the community and could help prices. In late 2020, the SEC sued payment company Ripple and its executives, claiming XRP is an unregistered security. A ruling on this case is expected in the coming few months. Feature Image From Canva, Chart From TradingView"
  }
]