[
  {
    "source": "CryptoSlate",
    "date": "2024-02-23T11:45:18.000Z",
    "title": "Bitcoin hits new all-time highs against 14 national currencies – Balaji",
    "url": "https://cryptoslate.com/insights/bitcoin-hits-new-all-time-highs-against-14-national-currencies-balaji/",
    "description": "<p>Quick Take Analysis shared by Network State author Balaji Srinivasan indicates that Bitcoin has surpassed its all-time highs against currencies of fourteen different countries, which collectively represent over a billion people and account for more than $7 trillion in GDP. Among these countries are Argentina and Japan, which just entered a technical recession due to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-hits-new-all-time-highs-against-14-national-currencies-balaji/\">Bitcoin hits new all-time highs against 14 national currencies &#8211; Balaji</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T12:02:38.000Z",
    "title": "Financial Regulators Face Criticism Over Proposed AI Rules",
    "url": "https://www.cryptopolitan.com/regulators-face-criticism-over-ai-rules/",
    "description": "Financial regulators are under scrutiny for handling proposed rules regarding using artificial intelligence (AI) in investment advising and brokerage. The Securities and Exchange Commission (SEC) is facing backlash for its Conflicts of Interest Associated with the Use of Predictive Data Analytics (PDA) proposal, with critics arguing that it could stifle innovation and impose undue burdens [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T12:00:00.000Z",
    "title": "Crypto Asset Inflows Soar As JPM Turns Bullish; $GFOX Offers 10X Potential",
    "url": "https://www.cryptopolitan.com/crypto-asset-inflows-soar-as-jpm-turns-bullish-gfox-offers-10x-potential/",
    "description": "Trends and attitudes are constantly shifting in the crypto world, as evidenced by people like BlackRock’s Larry Fink (once an outspoken critic of Bitcoin) suddenly becoming one of crypto’s greatest proponents. Now it seems the same phenomenon has just occurred at the once-staunchly anti-crypto JP Morgan. As crypto asset inflows surge to record highs and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T11:53:45.000Z",
    "title": "Educators Pioneer Ethical Co-Creation with AI in Arts Education",
    "url": "https://www.cryptopolitan.com/ethical-co-creation-with-ai-in-art-education/",
    "description": "In an era where artificial intelligence (AI) is increasingly permeating various facets of society, educators in the arts are taking proactive measures to equip students with the necessary knowledge and skills to engage with AI ethically.&#160; Rather than viewing AI as enigmatic &#8216;black boxes,&#8217; educators are fostering critical understanding and dialogue surrounding its integration into [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T11:51:41.000Z",
    "title": "GRID Partners with KeSPA to Bring Official Esports Data to South Korea",
    "url": "https://www.cryptopolitan.com/partners-kespa-to-bring-official-esports/",
    "description": "In a significant move poised to shape the landscape of esports in South Korea, the renowned data platform GRID has forged a groundbreaking partnership with the South Korean e-Sports Association (KeSPA).&#160; This collaboration marks the first of its kind, as KeSPA, established in 2000 and backed directly by the South Korean government, joins forces with [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T11:47:46.000Z",
    "title": "From skeptic to advocate: Donald Trump’s new Bitcoin stance",
    "url": "https://www.cryptopolitan.com/from-skeptic-to-advocate-donald-trumps-btc-stance/",
    "description": "Former President Donald Trump has recently demonstrated a more open attitude towards Bitcoin. During an appearance on Fox News’ “The Ingraham Angle,” Trump acknowledged the growing popularity of Bitcoin, particularly among younger demographics and African American communities. Despite his continued preference for the traditional currency, the dollar, Trump&#8217;s comments suggest a nuanced understanding of the [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-23T12:00:59.000Z",
    "title": "$IMX, $APE and $RON All Up Over 20% as GameFi Narrative Grabs Market; $GFOX Hits $3.5 Million",
    "url": "https://www.crypto-news-flash.com/imx-ape-and-ron-all-up-over-20-as-gamefi-narrative-grabs-market-gfox-hits-3-5-million/?utm_source=rss&utm_medium=rss&utm_campaign=imx-ape-and-ron-all-up-over-20-as-gamefi-narrative-grabs-market-gfox-hits-3-5-million",
    "description": "<img width=\"1200\" height=\"799\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-23T093240.619.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-23T093240.619.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-23T093240.619-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-23T093240.619-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-23T093240.619-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-23T093240.619-450x300.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />As the crypto market continues to evolve, three altcoins have been making waves with impressive gains fueled by the growing GameFi narrative. $IMX, $APE, and $RON have all surged by over 20%, capturing the attention of investors seeking exposure to the booming gaming sector within the cryptocurrency space. Meanwhile, the best cheap crypto to buy [...]"
  }
]