[
  {
    "source": "Cointelegraph",
    "date": "2023-06-12T07:24:48.000Z",
    "title": "How Bitcoin can help secure proof-of-stake blockchain protocols ",
    "url": "https://cointelegraph.com/news/how-bitcoin-can-help-secure-proof-of-stake-blockchain-protocols",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/8251a1f4-ad3f-4621-88aa-8aee8df3da12.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Stanford University professor David Tse has pioneered a way to use Bitcoin as a means to secure proof-of-stake blockchains.</p>\n                    <p><p>The proof-of-work consensus mechanism of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) could become a useful means of securing a variety of <a href=\"https://cointelegraph.com/learn/proof-of-stake-vs-proof-of-work:-differences-explained\">proof-of-stake (PoS)</a> smart contract blockchain protocols thanks to efforts from a Stanford University professor.</p><p>David Tse and his research team are driving the use of the preeminent cryptocurrency to provide added security to PoS networks. Tse’s proprietary Babylon blockchain aims to use Bitcoin to bolster network security and incentivize BTC holders to participate in what is ostensibly a new approach allowing staking of Bitcoin on proof-of-stake chains. </p><p>In an interview with Cointelegraph, Tse outlined how Babylon uses the Bitcoin scripting language to connect a PoS-based slashing mechanism to the Bitcoin network. This allows for the creation of smart contracts that are able to set specific spending conditions:</p><blockquote>“Although the Bitcoin scripting language is limited in its ability to express complex spending conditions, we have used advanced cryptography to translate the slashing conditions of a PoS chain into a spendable transaction on the Bitcoin blockchain.”</blockquote><p>Tse said that Babylon’s BTC staking protocol enables BTC to be used to secure its network without having to alter or fork the Bitcoin protocol. This also allows BTC holders the ability to earn rewards for contributing to the security of PoS network’s by staking their BTC.</p><blockquote>“Our method essentially transforms the slashing condition of a Proof-of-Stake chain into a spendable Bitcoin transaction. This way the staked BTC does not need to be bridged to the PoS chain at all.”</blockquote><p>The Stanford professor also added that the simplicity of the approach also maximizes the security of blockchains by avoiding potential vulnerabilities associated with <a href=\"https://cointelegraph.com/news/cross-chains-in-the-crosshairs-hacks-call-for-better-defense-mechanisms\">cross-chain bridges</a>. As Cointelegraph has previously explored, cross-chain hacks and exploits have been rife, leading to over<a href=\"https://cointelegraph.com/news/2b-in-crypto-stolen-from-cross-chain-bridges-this-year-chainalysis\"> $2 billion being fleeced</a> over the past year.</p><p>Bitcoin remains unrivaled as the largest cryptocurrency by market capitalization and continues to operate on the original specifications set out by its pseudonymous creator Satoshi Nakamoto. </p><p>Nevertheless the ecosystem has seen renewed interest and growth with the inception of <a href=\"https://cointelegraph.com/explained/what-are-bitcoin-ordinals\">Bitcoin Ordinals</a>, which allow users to to inscribe nonfungible tokens (NFTs) onto individual satoshis, the smallest denomination of a unit of BTC.</p><p>Similarly, Professor Tse believes that protocol’s like Babylon expand the utility of Bitcoin beyond being a simple store of value or medium of exchange by sharing Bitcoin's robust security with other chains and applications:</p><blockquote>“We aim to scale Bitcoin's security in a way similar to Ethereum's scaling efforts, effectively sharing Bitcoin's robust security with the rest of the decentralized world.”</blockquote><p>Novel approaches to blockchain consensus continue to be developed by the wider cryptocurrency ecosystem. Proof-of-stake chains have benefitted and are quickly adopting new approaches like zero-knowledge proofs (zk-proofs). The likes of StarkWare co-founder Eli Ben-Sasson, who pioneered the technology, <a href=\"https://cointelegraph.com/news/are-zk-proofs-the-answer-to-bitcoin-ordinal-and-brc-20-problem\">also believes that zk-proofs could be of great benefit </a>to the proof-of-work based Bitcoin blockchain. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ethereums-layer-2-zk-rollups-can-become-interoperable/\">Here’s how Ethereum’s ZK-rollups can become interoperable</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2023-06-12T07:25:43.000Z",
    "title": "The Undisclosed Impact Of SEC Lawsuits On The Cryptocurrency Market",
    "url": "https://nulltx.com/the-undisclosed-impact-of-sec-lawsuits-on-the-cryptocurrency-market/",
    "description": "The cryptocurrency industry has grown and fluctuated significantly in recent years. The regulatory environment pertaining to cryptocurrencies, however, continues to be intricate and dynamic. The Securities and Exchange Commission (SEC), one of the most powerful regulatory authorities in the United States, has been actively investigating the sector and bringing legal actions against significant firms as [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T07:31:21.000Z",
    "title": "USDC’s Stellar Rise: Circle’s Unstoppable IPO Plans Amid SEC Action Expected to Propel XLM Price to New All-Time Highs",
    "url": "https://www.crypto-news-flash.com/usdcs-stellar-rise-circles-unstoppable-ipo-plans-amid-sec-action-expected-to-propel-xlm-price-to-new-all-time-highs/?utm_source=rss&utm_medium=rss&utm_campaign=usdcs-stellar-rise-circles-unstoppable-ipo-plans-amid-sec-action-expected-to-propel-xlm-price-to-new-all-time-highs",
    "description": "Circle reinstated its decision to go public. It is believed that this would be a huge task following the recent actions against crypto firms. Law enforcement against crypto-related firms has forced companies including Ripple to postpone their Initial Public Offering (IPO). The unclear regulatory environment within the US has also forced others to abandon that [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-12T07:20:54.000Z",
    "title": "Sturdy Finance Loses 442 ETHs Worth $800,000 in an Exploitation",
    "url": "https://coinedition.com/sturdy-finance-loses-442-eths-worth-800000-in-an-exploitation/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Lending_protocol_Sturdy_Finance_drained_of_800000_in_security-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Lending_protocol_Sturdy_Finance_drained_of_800000_in_security-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Lending_protocol_Sturdy_Finance_drained_of_800000_in_security-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Lending_protocol_Sturdy_Finance_drained_of_800000_in_security.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The DeFi lending protocol Sturdy Finance was attacked today causing a loss of 442 Ether, accounting for an amount of almost $800,000. As per reports, the security attack was executed by an unidentified hacker who misused the re-entrancy vulnerability to manipulate a faulty price oracle. The blockchain analytics firm PeckShield, took to Twitter earlier today [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sturdy-finance-loses-442-eths-worth-800000-in-an-exploitation/\">Sturdy Finance Loses 442 ETHs Worth $800,000 in an Exploitation</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]