[
  {
    "source": "CryptoSlate",
    "date": "2023-11-06T09:45:47.000Z",
    "title": "Binance saw almost half of the $114M liquidations in the past 24 hours",
    "url": "https://cryptoslate.com/insights/binance-saw-almost-half-of-the-114m-liquidations-in-the-past-24-hours/",
    "description": "<p>Quick Take Bitcoin has been struggling to regain the $35,000 price level over the weekend, causing a wave of liquidations in the crypto market. In the past 24 hours, the crypto market witnessed approximately $114 million in liquidations — $66 million on the long side and $48 million on the short side. Nearly half of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/binance-saw-almost-half-of-the-114m-liquidations-in-the-past-24-hours/\">Binance saw almost half of the $114M liquidations in the past 24 hours</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-06T10:06:18.000Z",
    "title": "$MEME's New Contender: Memeinator Soars Past $1M Raise in Under 4 Weeks",
    "url": "https://cryptodaily.co.uk/2023/11/memes-new-contender-memeinator-soars-past-1m-raise-in-under-4-weeks",
    "description": "$MEME's New Contender: Memeinator Soars Past $1M Raise in Under 4 Weeks"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-06T09:58:33.000Z",
    "title": "Elon Musk Sparks Controversy with Shifting Stance on AI Limits, Igniting Debate",
    "url": "https://www.cryptopolitan.com/elon-musk-stance-ai-limits-igniting-debate/",
    "description": "In a stunning twist that challenges the very essence of his advocacy for AI limits, Elon Musk, the visionary behind xAI, has conceded that signing the open letter demanding a pause on powerful AI training systems, including his own ChatGPT, was, in his own words, &#8220;futile.&#8221; Musk clarified that his intention was simply to be ... <a title=\"Elon Musk Sparks Controversy with Shifting Stance on AI Limits, Igniting Debate\" class=\"read-more\" href=\"https://www.cryptopolitan.com/elon-musk-stance-ai-limits-igniting-debate/\" aria-label=\"More on Elon Musk Sparks Controversy with Shifting Stance on AI Limits, Igniting Debate\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-06T09:40:13.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-06T09:46:45.000Z",
    "title": "Ledger wallet holders lose $800k to fake app",
    "url": "https://crypto.news/ledger-wallet-holders-lose-800k-to-fake-app/",
    "description": "A fraudulent crypto wallet application on the Microsoft store has swindled users out of $768,000 in Bitcoin and Ethereum. On Nov. 5, crypto investigator ZachXBT issued a warning via the X platform (formerly Twitter) about the fraudulent application named Ledger&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-06T09:41:08.000Z",
    "title": "FTX is ready to sell Grayscale and Bitwise trust assets",
    "url": "https://crypto.news/ftx-is-ready-to-sell-grayscale-and-bitwise-trust-assets/",
    "description": "Bankrupt crypto exchange FTX filed in Delaware bankruptcy court to sell certain trust assets worth about $744 million owned by Grayscale and Bitwise. According to a joint statement from FTX and its debtors, this initiative will help prepare for payments&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-06T09:40:27.000Z",
    "title": "Bitcoin And Ethereum Rally Not Over: Crypto Capital Inflows Reach One-Year High",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-and-ethereum-crypto/",
    "description": "Many had speculated that the rally in the crypto market was going to wane following the Spot Bitcoin ETF rumors fading out. That hasn’t been the case, though, and a recent revelation from a prominent crypto analyst suggests that the two largest cryptocurrencies by market cap, Bitcoin and Ethereum, could continue to see an upward trend.  New Liquidity Coming Into The Market Could Boost Bitcoin, Ethereum In a post shared on his X (formerly Twitter) platform, Crypto analyst Ali Martinez revealed that the crypto market has seen close to $10.97 billion in positive capital inflows, which represents the highest level this year. According to him, this inflow of capital into crypto could potentially mean that investors are heavily bullish on these assets.  Related Reading: Shiba Inu Whales Bet Big As Shibarium Grows – Road To $0.1? Source: X Meanwhile, there is also further evidence that the market, most especially Bitcoin, could see an influx of new money in the coming days, as Martinez mentioned in a subsequent post that over 700,000 new BTC addresses were created on November 4. The analyst believes that such a happening is an important milestone as Bitcoin’s network growth is one of the best price predictors. Source: X  It is uncertain what could be behind these inflows and the revived interest in the crypto market. However, some believe that it could be institutional investors who are taking positions ahead of a possible approval of the pending Spot Bitcoin ETF applications by the Securities and Exchange Commission.  Others believe that the Bitcoin Halving could be contributing to the resurgence in Bitcoin’s price and the crypto market by extension. Historically, Bitcoin has seen significant gains in the period leading up to the Halving event. The next Halving is expected to happen in April 2024.  Whatever the reason, there is no doubt the influx of new money into the ecosystem is a positive development. A particular crypto analyst had once noted that many altcoins were tepid due to the lack of liquidity in the market and that they could pick up once there is renewed interest in the market. Institutional Interest Coming From Overseas According to a Bloomberg report, Hong Kong’s financial regulator, the Securities and Financial Commission (SFC), is considering allowing the launch of exchange-traded funds (ETFs) that allow investors to invest directly in the cryptocurrency itself (Spot trading).  Related Reading: Bitcoin Falls Under $35,000 But 86% Of Supply Remains Unmoved – Temporary Setback? This development comes amid the US SEC’s reluctance to approve the pending Spot Bitcoin ETF applications, which would allow US investors to have direct exposure to the flagship cryptocurrency, Bitcoin.  This further highlights the stark contrast between the treatment that the crypto industry has received overseas and in the United States. The positive approach taken by regulators overseas is, however, commendable as the crypto industry continues to see interest from such regions.  BTC bulls try to reclaim $35,000 &#124; Source: BTCUSD on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-06T09:42:35.000Z",
    "title": "How to Learn About Bitcoin Playing in Roblox",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-to-learn-about-bitcoin-playing-in-roblox/",
    "description": "<p>Roughly 45% of Roblox&#8217;s user base consists of individuals aged 12 or below, as indicated by Roblox&#8217;s SEC filing report in December 2022. Moreover, 60% of users fall within the 16 or younger age group, while only 17% are 25 years or older. This demographic distribution is noteworthy, especially considering Roblox&#8217;s impressive 65.5 million daily [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-to-learn-about-bitcoin-playing-in-roblox/\">How to Learn About Bitcoin Playing in Roblox</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]