[
  {
    "source": "CoinDesk",
    "date": "2023-08-10T17:44:02.000Z",
    "title": "Is Coinbase Disillusioned With Crypto?",
    "url": "https://www.coindesk.com/consensus-magazine/2023/08/10/is-coinbase-disillusioned-with-crypto/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The exchange recently argued that cryptos are like Beanie Babies. So does it still think Bitcoin and Ethereum are the future of finance?"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-10T18:00:00.000Z",
    "title": "Telegram to Integrate a Crypto Wallet Called TON Space",
    "url": "https://cryptodaily.co.uk/2023/08/telegram-to-integrate-a-crypto-wallet-called-ton-space",
    "description": "<p>The waitlist for the integration of a self-custody wallet TON Space within Telegram Messenger is now available for developers.</p>\nMerging Web2 and Web3\n<p>On Wednesday, August 9, the TON, a blockchain system originally created by Telegram, announced the launch of its self-custodial crypto wallet TON Space that would be integrated in the prominent messaging app. The product is now in its beta phase and available for developers only.</p>\n<p>By applying for the beta version of TON Space, developers will have a chance to integrate the wallet into their apps before everyone else.&nbsp;</p>\n<p>TON Space aims at facilitating the Web3 adoption by offering the whole user experience entirely within Telegram Messenger. Developers will be able to build their apps, integrate the blockchain, and unboard their users without leaving the platform.</p>\n\n<p>&ldquo;The developers&rsquo; beta is a critical moment in launching the first self-custodial wallet built into a thriving Web2 platform,&rdquo; said Jordan Dunne, Head of DeFi at Wallet. &ldquo;The introduction of TON Space will allow blockchain developers to build Web3 services that feel like the intuitive mobile app experiences users have every day. Easy-to-use and all without ever leaving Telegram, with 800 million users every month, this opens up a staggering growth opportunity for builders.&rdquo;</p>\n\nMain Features of TON Space\n<p>As a self-custody wallet, TON Space will provide its users with full control over their assets, allowing them to store, trade, and manage crypto within Telegram. One of the unique advantages of TON Space is that it can be seamlessly linked to any app built on Telegram, all integrated within a single ecosystem. According to the press release, TON Space is the most highly anticipated feature among the users who wish to have full access to the TON network within Telegram Messenger.</p>\n<p>The custodial wallet is expected to open for consumer use by the end of Q3 2023. The team also plans to integrate NFT collectables and swapping services into the product by that time.</p>\n\n<p>&ldquo;The launch of TON Space is a significant milestone that establishes a new infrastructure layer for the TON ecosystem,&rdquo; commented Justin Hyun, Director of Growth at TON Foundation. &ldquo;The power to build decentralized applications and bots fully integrated inside of Telegram cannot be underestimated. These services, and their users, will now enjoy the infinite possibilities that come with the power to store, manage, and trade assets within Telegram.&rdquo;</p>\n\nTelegram vs Twitter?\n<p>By integrating the crypto wallet, Telegram, which has always had an unwavering emphasis on privacy and security, is now officially entering the Web3 space. The move makes the global messenger a key player in the industry, which could potentially compete with such giants as X (previously known as Twitter), recently bought and rebranded by Elon Musk.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T17:54:59.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T17:54:48.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T17:40:57.000Z",
    "title": "US Government Launches $20 Million AI Cyber Challenge to Strengthen National Cybersecurity",
    "url": "https://www.cryptopolitan.com/us-government-launches-20-million-ai-cyber-challenge-to-strengthen-national-cybersecurity/",
    "description": "In a significant move to bolster national cybersecurity, the US government has announced the AI Cyber Challenge, an innovative competition offering a staggering $20 million in rewards to hackers who utilize artificial intelligence (AI) to fortify critical national infrastructure against cyber threats. This collaborative effort involves prominent AI firms such as Anthropic, Google, Microsoft, and ... <a title=\"US Government Launches $20 Million AI Cyber Challenge to Strengthen National Cybersecurity\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-government-launches-20-million-ai-cyber-challenge-to-strengthen-national-cybersecurity/\" aria-label=\"More on US Government Launches $20 Million AI Cyber Challenge to Strengthen National Cybersecurity\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-10T18:00:32.000Z",
    "title": "Shanghai Upgrade Drives 25% Boost In ETH Staking Activity",
    "url": "https://www.newsbtc.com/analysis/eth/shanghai-upgrade-drives-25-boost-in-eth-staking-activity/",
    "description": "The Shanghai upgrade was one of the most anticipated blockchain events of 2023, expected to introduce a higher level of speed and scalability to the Ethereum network. However, the most important feature of the Shanghai upgrade was allowing validators and stakers to finally withdraw their staked ETH from the Ethereum Beacon Chain. To explain, the Beacon Chain was created to aid the smooth transition of Ethereum from a Proof-of-Work consensus model to a Proof-of-Stake mechanism, i.e., ETH 2.0. Since its launch in 2020, many users have been staking their ETH tokens on the Beacon chain to facilitate network security and earn rewards. Albeit, those assets and the rewards they generate were inaccessible until after the Shanghai upgrade in 2023.  Prior to this network upgrade which occurred on April 12, 2023, the total number of staked ETH stood at 18.1 million, according to data by Dune Analytics. Four months later, the token analytics website Token Unlocks has offered more insight into how the Shanghai Upgrade has impacted the ETH staking activity so far. Related Reading: Ethereum: Historical Playbook Points To $3,800 In Coming Months Shanghai Upgrade Sparks Confidence In ETH Staking  On August 10, Token Unlocks posted on social media platform X that the Ethereum Shanghai upgrade has yielded a positive result on ETH staking, with a significant rise in demand for LSD protocols &#8211; a liquid staking aggregator project designed to promote maximum yields for ETH stakers.  🔥 Wrapped Up for Shanghai Upgrade 🔥 The Shanghai Upgrade fueled sector growth, and the demand for the LSD protocol keeps rising. Here&#8217;s what you can&#8217;t afford to miss: 🔐 22.99m $ETH staked, ~18.86% of circulation (Overall) ✅ 5.84m $ETH staked, ~4.8% of circulation (Since… pic.twitter.com/ZReOpNVTzD — Token Unlocks (@Token_Unlocks) August 10, 2023 According to the report by Token Unlocks, there are currently 22.99 million staked ETH on the Ethereum network, accounting for about 18.86% of ETH’s circulating supply. The report also highlights that 25% of this currently staked ETH was staked after the Shanghai upgrade in April. This means that about 5.84 million ETH, constituting about 4.8% of ETH circulating supply, has been staked in the last four months. To emphasize the impact of the Shanghai upgrade on ETH staking, Token Unlocks noted that the net ETH staking ratio is up by 147%, with about 9.82 million ETH deposited and only 3.97 million ETH withdrawn post-upgrade. It is worth stating that there were some speculations that the Shanghai upgrade would lead to a large-scale withdrawal of ETH, which could negatively affect the crypto market. Interestingly, the report above paints a different reality, with many users now willing to stake ETH as they have the freedom to withdraw at will.  ETH trading at $1,856.8 on the hourly chart &#124; Source: ETHUSD chart on Tradingview.com ETH Elites Strengthen Grip On Coin Supply In other news, on-chain analytics firm Santiment reports a wealth accumulation trend in the ETH market. According to Santiment, the top 10 ETH addresses have significantly increased their ETH holdings in the last five years. Within this period, the market intelligence firm notes that these wallets have acquired 27.86 million ETH, increasing their holdings from 11.2% to 34.6% of the token’s supply. Related Reading: Ethereum Price Prints Bullish Technical Pattern, Why Close Above $1,880 Is Critical At the time of writing, ETH is trading at $1,855.86, with a 0.68% decline in the last 24 hours based on data from CoinMarketCap. With a market cap of $222.18 billion, the Ethereum native token remains the 2nd largest cryptocurrency in the market. Featured image from Finbold, chart from Tradingview."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-10T18:00:20.000Z",
    "title": "DigiToads Early Investors Up 400%, TOADS is A Ticket For Financial Freedom",
    "url": "https://www.crypto-news-flash.com/digitoads-early-investors-up-400-toads-is-a-ticket-for-financial-freedom/?utm_source=rss&utm_medium=rss&utm_campaign=digitoads-early-investors-up-400-toads-is-a-ticket-for-financial-freedom",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-1.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-1-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-1-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />With a total market capitalization of more than $1.2 trillion, the global cryptocurrency industry is replete with tokens that could be your ticket to financial freedom. With thousands of assets to explore that involve no hidden charges, cryptocurrencies are one of the trusted options available to people today for becoming financially independent. DigiToads (TOADS) has [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-10T18:05:26.000Z",
    "title": "Analyst Predicts One Memecoin Will Outperform Dogecoin and Shiba Inu, Updates Outlook on Polygon and Fantom",
    "url": "https://dailyhodl.com/2023/08/10/analyst-predicts-one-memecoin-will-outperform-dogecoin-and-shiba-inu-updates-outlook-on-polygon-and-fantom/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/whales-spend-pepe.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/whales-spend-pepe.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/whales-spend-pepe.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/whales-spend-pepe.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/whales-spend-pepe.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/whales-spend-pepe.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/whales-spend-pepe.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says that one memecoin will likely outperform dog-themed rivals Dogecoin (DOGE) and Shiba Inu (SHIB). Pseudonymous trader Altcoin Sherpa tells his 196,400 X followers that Pepe (PEPE) bounced off a critical support level at $0.00000122 and likely has more room to run. He uses Fibonacci retracement levels, a method of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/10/analyst-predicts-one-memecoin-will-outperform-dogecoin-and-shiba-inu-updates-outlook-on-polygon-and-fantom/\">Analyst Predicts One Memecoin Will Outperform Dogecoin and Shiba Inu, Updates Outlook on Polygon and Fantom</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]