[
  {
    "source": "NewsBTC",
    "date": "2023-12-19T02:00:01.000Z",
    "title": "Crypto Funds’ 11-Week Inflow Streak Snapped: Bitcoin Faces $33M Exodus As Altcoins Shine",
    "url": "https://www.newsbtc.com/bitcoin-news/crypto-funds-11-week-inflow-streak-snapped-bitcoin-faces-33m-exodus-as-altcoins-shine/",
    "description": "The crypto investment landscape has experienced a notable shift recently, as digital asset investment products saw their first net outflows in 11 weeks. This development was predominantly led by Bitcoin, which had previously enjoyed a consistent inflow into various crypto funds. In a recent report by CoinShares, a leading digital asset management firm, last week marked a break in an 11-week streak of inflows, with a net outflow of $16 million. This change signals a potential reevaluation among investors regarding their positions in digital assets. Related Reading: Bitcoin’s Unshakable Bottom: Analyst Reveals The Price BTC Won’t Drop Below Bitcoin Funds Encounter Turbulence Bitcoin-based funds were at the forefront of this movement, experiencing significant outflows. Last week, these funds experienced a net outflow of $32.8 million, while short Bitcoin investment products also saw a minor outflow of $300,000. Despite this, trading activity for Bitcoin remained robust, grossing $3.6 billion last week, substantially higher than the $1.6 billion yearly average. James Butterfill, Head of Research at CoinShares, analyzed the outflows and suggested that the net flows were primarily driven by the US and German markets, which saw outflows of $18.3 million and $9.7 million, respectively. In contrast, markets such as Switzerland and Canada saw inflows, indicating a mixed regional response that leans more towards profit-taking rather than a wholesale sentiment shift in the asset class, according to Butterfill. Altcoins Gain Traction As Blockchain Equities Surge Interestingly, while Bitcoin and other major assets like Ethereum and Avalanche experienced outflows, altcoins such as Solana, Cardano, and XRP bucked the trend. They mainly registered inflows of $10.6 million, $3 million, and $2.7 million, respectively. These movements underscore the diversification within the crypto asset class and highlight investor interest in a broader range of digital currencies beyond the dominant Bitcoin and Ethereum. Blockchain equities also reflected a favourable sentiment, with inflows amounting to $122 million last week. This marks the continuation of a nine-week streak, accumulating $294 million in total — the largest streak to date. This uptick in blockchain equities underscores the growing investor confidence in the technological infrastructure underpinning cryptocurrencies. Related Reading: Market Jolt: Bitcoin Falls Below $42,000 As Short Term Holders Rush To Cash In Regarding price performance, the past week saw mixed results among top crypto assets. While Bitcoin recorded a relatively modest decline of 1.8%, XRP and Ethereum saw more significant drops of 4.4% and 3.7%, respectively. Conversely, altcoins such as Solana, Cardano, and Avalanche showcased appreciable gains. Avalanche led the pack with an increase of over 10% in the past week, followed by Solana and Cardano with gains of 3.1% and 3.6%, respectively. Featured image from iStock, Chart from TradingView"
  }
]