[
  {
    "source": "CoinDesk",
    "date": "2023-11-29T19:57:38.000Z",
    "title": "U.S. Treasury Campaigning for Amplified Powers to Chase Crypto Overseas",
    "url": "https://www.coindesk.com/policy/2023/11/29/us-treasury-campaigning-for-amplified-powers-to-chase-crypto-overseas/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Department of the Treasury is pressing lawmakers for a new set of powers that would give the government unprecedented enforcement and sanctions authority over the crypto sector, including the ability to roam well beyond American borders and get involved with transactions that don't involve its citizenry."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-29T20:06:02.000Z",
    "title": "Crypto Sponsorships Are Back? University of Miami Strikes Deal With Helium Mobile",
    "url": "https://decrypt.co/207929/crypto-sponsorships-back-university-miami-strikes-deal-helium-mobile",
    "description": "Helium Mobile—a service built on a decentralized, crypto-powered network—is the newest sponsor of Miami Hurricanes sports teams."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-29T20:05:01.000Z",
    "title": "Another Bitcoin ETF Hopeful Enters the Race",
    "url": "https://decrypt.co/207898/another-bitcoin-etf-hopeful-enters-race",
    "description": "Swiss firm Pando Asset has filed an application with the SEC to offer its Spot Bitcoin Trust to U.S. investors."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-29T20:00:04.000Z",
    "title": "Why is the crypto market down today?",
    "url": "http://cointelegraph.com/news/why-is-the-crypto-market-down-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-09/8032812d-1d50-46ab-b965-a0cb6dd41a63.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto market is down today as regulatory enforcement against the sector reaches a head and short-sellers jockey for the lead in liquidations.</p>\n                    <p><p>The crypto market is down today as a slew of regulatory enforcement events weigh on Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) and altcoin prices. The markets continue to reel since the Nov. 21 Department of Justice (DOJ) <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\">settlement</a> against Changpeng “CZ” Zhao and Binance to the tune of a $4.3 billion fine.</p><p>Price action across the crypto market remains tilted to the downside as investors and money managers further digest the potential fallout from increased regulatory actions taken against the industry. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/6dd38f24-fd0d-4858-9753-15c1cff2ad6e.png\"  /><figcaption style=\"text-align: center;\"><em>Cryptocurrency market performance, 1-day chart. Source: Coin360</em></figcaption></figure><h2>US-led regulatory pressure against crypto is in full-steam-ahead mode</h2><p>The cryptocurrency industry and regulators have a long history of not getting along either due to various misconceptions or mistrust over the actual use case of digital assets.</p><p>On Nov. 21, the DOJ announced enforcement actions and a settlement related to <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/changpeng-zhao\">CZ</a> and Binance in which both pleaded guilty. </p><p>According to the settlement, Binance will pay $4.3 billion in fines, and CZ will pay $159 million in penalties. The settlement covered civil regulatory enforcement actions by government departments, including the U.S. Treasury and Commodity Futures Trading Commission (CFTC). </p><p>Following the settlement, <a href=\"https://cointelegraph.com/news/binance-richard-teng-ceo-amid-changpeng-zhao-s-forced-departure\">CZ announced</a> that he had stepped down as CEO of Binance. On Nov. 28, CZ made his departure as <a href=\"https://cointelegraph.com/news/changpeng-zhao-steps-down-binance-us-chair\">Binance.US</a> chair official. The departure comes after <a href=\"https://cointelegraph.com/news/sec-looking-evidence-potential-fraud-binance-us-changpeng-zhao\">reports suggest</a> the Securities and Exchange Commission (SEC) is still looking for potential FTX-style fraud at Binance.U.S. </p><p>Cardano founder Charles Hoskinson reflected on the <a href=\"https://cointelegraph.com/news/binance-ceo-downfall-end-era-charles-hoskinson\">settlement</a>, calling it “the end of an era.” The initial indication from the DOJ and Attorney General Merrick Garland <a href=\"https://www.justice.gov/live\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> that strong actions would be taken against the crypto sector, but the message was not specific. On Nov. 28, <a href=\"https://cointelegraph.com/news/coinbase-warns-customers-subpoena-cftc-bybit-probe\">Coinbase warned customers</a> about a subpoena in a CFTC probe against Bybit exchange. </p><p>Risk assets are heavily impacted by investor sentiment, and this trend extends to Bitcoin and altcoins. To date, the threat of <a href=\"https://cointelegraph.com/news/blockchain-association-support-suit-lifting-tornado-cash-sanctions\">unfriendly cryptocurrency regulation</a> or, in the worst case, an outright ban continues to impact crypto prices on a monthly basis.</p><h2>ETH and BTC spot ETF euphoria could be waning </h2><p>Market sentiment boomed due to optimism about a potential spot Bitcoin exchange-traded fund (ETF) approval to happen in November but was later delayed by the SEC on Nov. 17. The euphoria helped to send <a href=\"https://cointelegraph.com/news/bitcoin-make-break-zone-btc-price-back-to-38k\">Bitcoin price</a> to an 18-month high above $38,000. </p><p>However, the euphoria seems to be easing, with the BTC price down below the key $38,000 level on Nov. 29 intraday. Now, Bitcoin is struggling to maintain positive momentum for the month of November after a strong “Uptober.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/6a6d5d2a-25cc-42a1-b882-503ab4d0b766.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin historical returns by month. Source: Newhedge</em></figcaption></figure><p>While BlackRock does not believe the SEC has any legitimate reason not to approve a <a href=\"https://cointelegraph.com/news/blackrock-argues-sec-has-no-grounds-to-treat-crypto-futures-and-spot-etfs-differently\">cryptocurrency spot ETF</a>, the SEC seems <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-january-approvals-possible-analysts\">poised to delay</a> until 2024. </p><p>On Nov. 15, the <a href=\"https://www.sec.gov/files/rules/sro/nysearca/2023/34-98944.pdf\" target=\"_blank\" rel=\"noopener nofollow\">SEC</a> delayed a decision on Grayscale’s Ether futures ETF. Some analysts believe the 19b-4 form submitted by Grayscale is a potential “<a href=\"https://cointelegraph.com/news/grayscale-eth-futures-etf-trojan-horse-spot-eth-etf\">trojan horse</a>” for the agency. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/magazine/real-ai-use-cases-crypto-3-ai-smart-contract-audits-cybersecurity/\"><strong><em>Real AI use cases in crypto, No. 3: Smart contract audits &amp; cybersecurity</em></strong></a><em> </em></p><p>Notably, the securities regulator decided to <a href=\"https://cointelegraph.com/news/bitcoin-etf-bitgo-ceo-mike-belshe\">delay applications</a> from Hashdex and Global X ETFs on Nov. 17. On Nov. 28, the SEC extended the <a href=\"https://cointelegraph.com/news/sec-public-comments-request-franklin-templeton-hashdex-bitcoin-btc-etfs\">public comment window</a> of Franklin Templeton’s Bitcoin ETF, pushing approval further into 2024.</p><p>For now, traders are likely securing profits at the current multi-month high prices in the crypto market because of this potentially long wait. Some analysts see the <a href=\"https://cointelegraph.com/news/buy-the-rumor-sell-the-news-bitcoin-etf-tradfi-sell-off\">Bitcoin ETF</a> as a “Buy the rumor, sell the news” event. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-price-fails-38-5-k-breakout-us-gdp-fed-hard-landing\"><strong><em>Bitcoin price fails $38.5K breakout as US GDP fuels Fed hard landing woes</em></strong></a><em> </em></p><h2>Futures liquidations send the crypto market lower</h2><p>The decline across major cryptocurrencies has led to a rush of liquidations across the derivative market. While long and short position derivative traders are battling, short-sellers are in command on Nov. 29. </p><p>In the past 24 hours, over $44.9 million in long positions have been liquidated across the crypto market, with $34 million being wiped out in the previous 12 hours. Crypto market prices are negatively affected when long derivative positions are liquidated without buying pressure from trading volume.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/10b96382-3142-4a88-97c9-a776a6ca5277.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto market liquidations. Source: Coinglass</em></figcaption></figure><p>In the short term, the cryptocurrency market will continue to navigate multifaceted challenges, and the ebb and flow of various economic and regulatory factors will undoubtedly shape its trajectory for the foreseeable future.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-29T20:00:00.000Z",
    "title": "Square Enix auction dates, Azuki DAO rebrands to Bean: Nifty Newsletter",
    "url": "http://cointelegraph.com/news/square-enix-auction-dates-azuki-dao-rebrands-to-bean-nifty-newsletter",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/86043350-1cba-4388-9a39-346a8691dbc8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Game developer Square Enix announced the auction dates for NFTs of its upcoming blockchain game Symbiogenesis.</p>\n                    <p><p>In this week’s newsletter, read about footballer Cristiano Ronaldo facing a lawsuit after promoting <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a> tied to crypto exchange Binance, and find out how an NFT collector thwarted a hacking attempt by a person impersonating a journalist. In other news, Azuki DAO is rebranding to Bean, game developer Square Enix announces an NFT collection, and one user claimed tokens worth $11 million in the recent Blur airdrop. </p><h2>Cristiano Ronaldo sued for promoting Binance, unregistered securities</h2><p>Football superstar Cristiano Ronaldo faces a class-action lawsuit for allegedly participating in the sale of unregistered securities in partnership with crypto exchange Binance. The famous football player entered a multiyear partnership with the exchange to promote NFT collections tied to Binance’s NFT-focused arm.  </p><p>The legal complaint argued that Ronaldo encouraged his millions of followers to invest using Binance and contributed to its growth. The plaintiffs also allege that Ronaldo’s NFT sales successfully promoted the exchange, leading to a 500% increase in searches after the first sale. </p><p><a href=\"https://cointelegraph.com/news/cristiano-ronaldo-class-action-lawsuit-over-binance-promotion\"><strong>Continue reading</strong></a></p><h2>Asked to get a banana, a BAYC owner narrowly avoids a fake Forbes scam</h2><p>Pseudonymous NFT trader “Crumz” avoided a scam that could have stolen NFTs from his stash. According to the trader, a person impersonating a Forbes journalist asked for an interview about the Bored Ape Yacht Club (BAYC) collection. </p><p>During the interview, the scammer asked Crumz to click a button to allow them to record the interview and tried to distract him by asking him to say something resembling his BAYC NFT. The scammers took control of his screen, but Crumz thwarted the hacking attempt before he lost anything. </p><p><a href=\"https://cointelegraph.com/news/banana-bored-ape-yacht-club-bayc-owner-avoids-fake-forbes-journalist-scam\"><strong>Continue reading</strong></a></p><h2>Azuki DAO rebrands to “Bean” as it drops lawsuit against founder</h2><p>Azuki DAO, an unofficial decentralized autonomous organization (DAO) made for the NFT collection of the same name, announced it is rebranding to “Bean.” The DAO is also dropping its proposed lawsuit against Zagabond, the founder of Azuki. </p><p>According to Azuki developers, the DAO will become a memecoin project and join the ecosystem of Blast, an Ethereum layer-2 platform. The developers also claimed that Bean has already secured a $10 million investment for its development and acceleration. </p><p><a href=\"https://cointelegraph.com/news/azuki-dao-rebrands-bean-drops-lawsuit-against-founder\"><strong>Continue reading</strong></a></p><h2>Square Enix announces auction dates for Symbiogenesis NFTs</h2><p>Square Enix, the developer of popular game franchises like Final Fantasy and Kingdom Hearts, has started the auction of its Symbiogenesis NFTs. A social media announcement highlighted that the first batch’s schedule is from Nov. 27–28, while a second batch will go out from Nov. 30 to Dec. 4. There will also be a third batch of NFTs to hit the auctions on Dec. 2–3. </p><p>Symbiogenesis is a blockchain game that Square Enix is currently developing. The game will feature Web3 elements such as Ethereum-based NFTs. </p><p><a href=\"https://cointelegraph.com/news/square-enix-announces-auction-dates-symbiogenesis-nfts\"><strong>Continue reading</strong></a></p><h2>User claims $11 million in Blur token rewards at NFT marketplace’s season 2 airdrop</h2><p>A user participating in the recent airdrop of the NFT marketplace Blur has claimed tokens worth around $11 million. A wallet with the ENS tag <em>“hanwe.eth”</em> claimed over 22 million Blur tokens in the NFT platform’s season two airdrop. The owner of the address celebrated on social media and posted their rewards for everyone to see.  </p><p>While some seemed happy with the results, NFT whale Jeffrey Hwang cursed at Blur after the airdrop, seemingly unhappy with the rewards. Hwang is known to have attempted what some consider the largest NFT dump, which aimed to generate more profits through the airdrop. </p><p><a href=\"https://cointelegraph.com/news/blur-token-rewards-nft-marketplace-airdrop\"><strong>Continue reading</strong></a></p><p class=\"post-content__accent post-content__accent_big\"><a href=\"https://cointelegraph.com/podcasts/nft-steez\">CHECK OUT COINTELEGRAPH’S <em>NFT STEEZ</em> PODCAST</a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-01/43adc850-7dbd-4fa8-811b-9eb32b6c1983.jpg\"  alt=\"Games, Blockchain Game, Gaming\"  title=\"Square Enix auction dates, Azuki DAO rebrands to Bean: Nifty Newsletter\"  /></figure><p><em>Thanks for reading this digest of the week’s most notable developments in the NFT space. Come again next Wednesday for more reports and insights into this actively evolving space.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-29T20:03:00.000Z",
    "title": "Bitcoin (BTC) Supply on Exchanges Drops to 6-Year Low as Tether Whales Eye Market Entry",
    "url": "https://www.cryptoglobe.com/latest/2023/11/bitcoin-btc-supply-on-exchanges-drops-to-6-year-low-as-tether-whales-eye-market-entry/",
    "description": "The price of the flagship cryptocurrency Bitcoin has moved up over 130% over the past year and the accumulation has seemingly seen the supply of BTC on cryptocurrency trading platforms drop to its lowest level since December 2017 to now stand at 5.38%. According to on-chain analytics firm Santiment, Bitcoin’s supply on exchanges has been […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-29T19:50:26.000Z",
    "title": "The Cardano (ADA) Price Could Hit $1, While ScapesMania Crypto Presale Passes $875K",
    "url": "https://cryptodaily.co.uk/2023/11/the-cardano-ada-price-could-hit-1-while-scapesmania-crypto-presale-passes-875k",
    "description": "Explore the dynamic world of cryptocurrencies in this insightful article, where we delve into Cardano (ADA)'s potential to reach the $1 mark amidst regulatory challenges and market trends. Discover how ADA's technical analysis reveals a mix of bullish and bearish signals, and understand the implications of Charles Hoskinson's confrontation with the SEC on ADA's future. Stay informed on the latest in crypto with a balanced view of Cardano's prospects and challenges."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T19:57:25.000Z",
    "title": "SoFi Technologies Announces Termination of Crypto Services",
    "url": "https://www.cryptopolitan.com/sofi-technologies-termination-crypto-service/",
    "description": "In a significant development for the cryptocurrency market, SoFi Technologies, a prominent United States personal finance company, has announced that it will cease its crypto trading services by December 19. The announcement, made on November 29, marks a pivotal change in the company’s strategy and offerings in the digital asset space. Effective immediately, SoFi will ... <a title=\"SoFi Technologies Announces Termination of Crypto Services\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sofi-technologies-termination-crypto-service/\" aria-label=\"More on SoFi Technologies Announces Termination of Crypto Services\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-29T19:46:27.000Z",
    "title": "Bitcoin Ordinals marketplace Bioniq launches on ICP",
    "url": "https://crypto.news/bitcoin-ordinals-marketplace-bioniq-launches-on-icp/",
    "description": "Bioniq, a new marketplace for Bitcoin Ordinals, introduces a distinctive approach by operating on the Internet Computer blockchain."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-29T20:00:11.000Z",
    "title": "Whale’s Move: $19.5 Million XRP Shifted To Exchange, Massive Sell Off On The Horizon?",
    "url": "https://www.newsbtc.com/analysis/xrp/whales-move-xrp-shifted-to-exchange-massive-sell-off/",
    "description": "Whale Alert, a renowned blockchain tracker, reported a substantial transfer of XRP tokens to the Bithumb crypto exchange. This transfer, involving over 32 million XRP tokens valued at roughly $19.5 million, originated from an unidentified wallet and was executed today at 05:15:10 UTC. The substantial nature of this transaction places it firmly in the category of &#8216;whale transactions,&#8217; which are often scrutinized due to their potential influence on market dynamics. In the crypto space, such significant transfers are typically indicative of strategic moves by influential players within the market. Related Reading: XRP Price Set For 20% Leap In Coming Days: Crypto Analyst While the specific intention behind this transaction remains undisclosed, and the whale&#8217;s identity is unknown, its occurrence has not led to any notable immediate price fluctuations in XRP, with only a marginal decrease of 0.1% observed so far. Massive Sell-Off On The Horizon? Historically, the transfer of substantial amounts of crypto to exchanges by whales has been linked with either an intent to liquidate or to swap for other digital assets. This makes such movements anticipated to result in a price drop following a significant sell-off. However, a technical analysis of the current situation suggests a different narrative for XRP. Looking at the asset&#8217;s chart on the 4-hour time frame, XRP has recently tapped into an order block on the sell side, which could signal an impending price reversal to the upside in trading parlance. Mainly, an order block in financial markets is essentially a zone where the initiation or absorption of a large volume of orders occurs. It is considered a crucial area on price charts, as traders often expect a reversal when the price taps into these zones. In essence, an order block represents a consolidation area where significant trading activities previously took place, and revisiting these zones can often lead to a shift in market momentum. So far, XRP has shown signs of reversal after tapping this orderblock. Particularly, the asset has moved from the price zone of $0.59, where the order block is located, and surged past $0.61 before showing a current retracement that brings its price to trade at $0.60. Bullish Forecasts for XRP Meanwhile, the XRP community has been witnessing a series of optimistic analyses from prominent crypto market analysts. Notably, Egrag, a renowned figure in the crypto analysis sphere, recently shared his insights on XRP, indicating a potential bullish reversal for the digital asset. #XRP Inverse Head &#38; Shoulder Formation in progress (UPDATE): https://t.co/JRvvFEVhBv pic.twitter.com/wy90z4kCO4 — EGRAG CRYPTO (@egragcrypto) November 29, 2023 His analysis identified an inverse head and shoulders (H&#38;S) pattern on XRP’s chart, a technical indicator often suggesting a trend change from bearish to bullish. Related Reading: XRP On The Verge Of A Surge: Analyst Pinpoints Next Bullish Targets This positive sentiment is echoed by another market analyst, Ali Chart, who has projected a promising future for XRP. Ali’s analysis shows that the altcoin seems to be making a decisive break from a descending parallel channel. #Ripple &#124; $XRP appears to be breaking out from a descending parallel channel, which may result in an upswing to $0.65 &#8211; $0.66 for #XRP. pic.twitter.com/gvfeEMKIDX — Ali (@ali_charts) November 23, 2023 According to his assessment, such a breakout could propel XRP’s price to the $0.65 to $0.66 range. These analyses collectively paint an encouraging picture for XRP, hinting at a potential shift in momentum and opening the possibility for significant price movements in the near term. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-29T20:08:53.000Z",
    "title": "Dogecoin’s Lunar Ascent: DOGE-1 Mission Gets NTIA Nod",
    "url": "https://www.crypto-news-flash.com/dogecoins-lunar-ascent-doge-1-mission-gets-ntia-nod/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoins-lunar-ascent-doge-1-mission-gets-ntia-nod",
    "description": "<img width=\"1200\" height=\"680\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/dogecoin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Dogecoin\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/dogecoin.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/dogecoin-300x170.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/dogecoin-1024x580.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/dogecoin-768x435.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />SpaceX is launching the DOGE-1 mission to the moon, funded entirely by Dogecoin in partnership with Geometric Energy Corporation. The mission set a new precedent for using cryptocurrency in space commerce, but Dogecoin&#8217;s market price remained stable despite the announcement. SpaceX, the leading private space exploration company, has partnered with Geometric Energy Corporation (GEC) to [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-29T19:50:00.000Z",
    "title": "Data Reveals GameFi Battles Existential Crisis, 2,127 of 2,817 Dead Games",
    "url": "https://coinedition.com/data-reveals-gamefi-battles-existential-crisis-2127-of-2817-dead-games/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/GameFi_and_crypto_‘natural_fit_for_game_publishers_KBW_2022.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"GameFi_and_crypto_‘natural_fit’_for_game_publishers_KBW_2022\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/GameFi_and_crypto_‘natural_fit_for_game_publishers_KBW_2022.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/GameFi_and_crypto_‘natural_fit_for_game_publishers_KBW_2022-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/GameFi_and_crypto_‘natural_fit_for_game_publishers_KBW_2022-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/GameFi_and_crypto_‘natural_fit_for_game_publishers_KBW_2022-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/GameFi_and_crypto_‘natural_fit_for_game_publishers_KBW_2022-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The prominent market tracker Coingecko has published a new research report capturing the failures of the crypto-based GameFi industry. According to the report, the GameFi market, once hailed as the future of play-to-earn (P2E) gaming, is facing a crisis with a staggering failure rate of 75.5% among Web3 and crypto-focused games. Specifically, Coingecko disclosed that [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/data-reveals-gamefi-battles-existential-crisis-2127-of-2817-dead-games/\">Data Reveals GameFi Battles Existential Crisis, 2,127 of 2,817 Dead Games</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-29T20:07:35.000Z",
    "title": "Duelbits Announces Landmark Collaboration With Football Icon Luis Suárez",
    "url": "https://dailyhodl.com/2023/11/29/duelbits-announces-landmark-collaboration-with-football-icon-luis-suarez/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-Duelbits-Industry-Announcement-Featured-Image-Template.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-Duelbits-Industry-Announcement-Featured-Image-Template.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-Duelbits-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-Duelbits-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-Duelbits-Industry-Announcement-Featured-Image-Template.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-Duelbits-Industry-Announcement-Featured-Image-Template.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-Duelbits-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-Duelbits-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-Duelbits-Industry-Announcement-Featured-Image-Template.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-Duelbits-Industry-Announcement-Featured-Image-Template.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>November 29, 2023 – Willemstad, Curaçao Duelbits, a leading name in the global crypto sportsbook and casino gaming arena, is thrilled to unveil a groundbreaking collaboration with one of football&#8217;s most illustrious talents, Luis Suárez. This partnership celebrates Suarez&#8217;s remarkable legacy, including his victories in the Champions League, Copa America and securing the Golden Boot [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/29/duelbits-announces-landmark-collaboration-with-football-icon-luis-suarez/\">Duelbits Announces Landmark Collaboration With Football Icon Luis Suárez</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-29T19:45:24.000Z",
    "title": "SEC Probing Binance.US for Evidence of Potential Fraud, Despite Guilty Pleas From Binance and CZ: Report",
    "url": "https://dailyhodl.com/2023/11/29/sec-probing-binance-us-for-evidence-of-potential-fraud-despite-guilty-pleas-from-binance-and-cz-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/sec-probing-fraud-pleas.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/sec-probing-fraud-pleas.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/sec-probing-fraud-pleas.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/sec-probing-fraud-pleas.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/sec-probing-fraud-pleas.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/sec-probing-fraud-pleas.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/sec-probing-fraud-pleas.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Securities and Exchange Commission (SEC) is reportedly still investigating Binance CEO Changpeng Zhao and the company&#8217;s US branch despite both parties already pleading guilty to other charges levied by the Department of Justice (DOJ). According to a new report by The Wall Street Journal, both Binance and Zhao will be probed for evidence [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/29/sec-probing-binance-us-for-evidence-of-potential-fraud-despite-guilty-pleas-from-binance-and-cz-report/\">SEC Probing Binance.US for Evidence of Potential Fraud, Despite Guilty Pleas From Binance and CZ: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-29T19:41:40.000Z",
    "title": "U.S. Government Enacts Sanctions on Crypto Mixer Sinbad Under Allegations of Aiding North Korean Money Laundering",
    "url": "https://dailyhodl.com/2023/11/29/u-s-government-enacts-sanctions-on-crypto-mixer-sinbad-under-allegations-of-aiding-north-korean-money-laundering/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/North-Korean-Hackers-Have.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/North-Korean-Hackers-Have.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/North-Korean-Hackers-Have.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/North-Korean-Hackers-Have.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/North-Korean-Hackers-Have.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/North-Korean-Hackers-Have.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/North-Korean-Hackers-Have.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. government is sanctioning another crypto mixing protocol, accusing it of aiding North Korea in laundering hundreds of millions of dollars worth of stolen digital assets. In a new press release, the U.S. Department of the Treasury says that its Office of Foreign Assets Control (OFAC) is sanctioning the crypto tumbler Sinbad for allegedly [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/29/u-s-government-enacts-sanctions-on-crypto-mixer-sinbad-under-allegations-of-aiding-north-korean-money-laundering/\">U.S. Government Enacts Sanctions on Crypto Mixer Sinbad Under Allegations of Aiding North Korean Money Laundering</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]