[
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T03:28:44.000Z",
    "title": "Mark Cuban, John Reed Stark clash over the cause of FTX’s collapse",
    "url": "https://cointelegraph.com/news/mark-cuban-john-reed-stark-debate-sec-and-ftx-collapse",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/268428cd-1238-4954-95b5-c0c43c5156ad.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Mark Cuban thinks the SEC could have saved U.S. customers from FTX had it adopted Japan’s approach to crypto regulation, but John Reed Stark disagrees.</p>\n                    <p><p>Billionaire entrepreneur Mark Cuban has again locked horns with former securities chief John Reed Stark, this time over who was ultimately to blame for FTX’s collapse and the impact on creditors. </p><p>During a heated back-and-forth <a href=\"https://twitter.com/JohnReedStark/status/1676240265663610882\" target=\"_blank\" rel=\"noopener nofollow\">exchange</a>, Cuban argued had the United States Securities and Exchange Commission set “clear regulations,” no one would have lost money from its collapse. </p><p>Stark earlier suggested cryptocurrency and stablecoins — including central bank digital currencies — solve no problems and that the crypto industry operates without regulatory oversight, consumer protections and audits, among other things. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">You should read up on how Japan deals with regulation. <a href=\"https://t.co/yHCVwZAqvG\">https://t.co/yHCVwZAqvG</a><br><br>When FTX crashed, NO ONE IN FTX JAPAN LOST MONEY. <br><br> If the USA/SEC had followed their example by setting clear regulations that required the separation of customer and business  funds and clear… <a href=\"https://t.co/Msvn9o9PCU\">https://t.co/Msvn9o9PCU</a></p>&mdash; Mark Cuban (@mcuban) <a href=\"https://twitter.com/mcuban/status/1676258204924407808?ref_src=twsrc%5Etfw\">July 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Cuban argued that Japanese regulators — an increasingly Web3 friendly jurisdiction — are an example of a regulator that has done it right. </p><p>“When FTX crashed, NO ONE IN FTX JAPAN LOST MONEY,” he said. </p><p>Stark — <a href=\"https://cointelegraph.com/news/former-sec-chief-blasts-bogus-catchphrase-regulation-by-enforcement\">a cryptocurrency skeptic</a> — shot back, saying it “seems a bit of a stretch”  to blame the SEC for the collapses of FTX, BlockFi, Celsius, Terra and Voyager, or what he called “dumpster fires.” </p><p>While Stark conceded that the SEC isn’t always right, he claimed the regulator saved investors “millions, perhaps even billions” in crypto losses.</p><p>The ex-SEC official claimed while the cryptocurrency industry seeks regulatory clarity, whenever rules are promulgated or proposed, “the crypto industry cries foul” and often responds by filing a “flashy legal challenge to its enactment.”</p><p>Cuban hit back, explaining the “best way” to prevent cryptocurrency fraud is to implement “brightline investor protection regulations.” He added:</p><blockquote>“Anyone who doesn't register is de-facto in violation, can't operate and will be shut down. That's how you protect crypto investors.”</blockquote><p>Stark, however, claims that the SEC only charged the likes of Binance, Coinbase, Beaxy and Bittrex months after the regulator made it clear that those firms were not in compliance.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-wrong-to-target-gary-gensler\"><strong><em>Lawmakers are wrong to target Gary Gensler </em></strong></a></p><p>“[These firms] opted to ignore the SEC — and reap profits for as long as possible without registering,” Stark added.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">That is worthy of study Mark, thanks.<br><br>The laws in Japan require crypto exchanges to register with authorities, to keep customer money separate from their own accounts, to hold at least 95% of customers’ digital assets in a cold wallet and to entrust clients’ holdings of…</p>&mdash; John Reed Stark (@JohnReedStark) <a href=\"https://twitter.com/JohnReedStark/status/1676368940258283520?ref_src=twsrc%5Etfw\">July 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>It is the second time in three weeks that the pair have clashed over <a href=\"https://cointelegraph.com/news/mark-cuban-sec-john-reed-stark-crypto-derangement-syndrome\">how cryptocurrency should be regulated.</a></p><p>On June 11, Cuban called out the SEC for purportedly failing to provide cryptocurrency firms with <a href=\"https://cointelegraph.com/news/impossible-to-know-what-is-a-security-mark-cuban-on-sec\">a clear registration process.</a></p><p>He claimed it’s “near impossible to know” what constitutes security because the SEC’s “Framework for ‘Investment Contract’ Analysis of Digital Assets”<a href=\"https://www.sec.gov/files/dlt-framework.pdf\" target=\"_blank\" rel=\"noopener nofollow\"> document</a> fails to explain how cryptocurrency firms can come into compliance.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-05T03:30:54.000Z",
    "title": "Mark Cuban Says SEC Makes Mistakes in Crypto Regulation, Calls Regulator ‘Arrogant’",
    "url": "https://news.bitcoin.com/mark-cuban-says-sec-makes-mistakes-in-crypto-regulation-calls-regulator-arrogant/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/mark-cuban-sec-mistakes-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Mark Cuban Says SEC Chose Wrong Path to Regulate Crypto, Calls Regulator &#039;Arrogant&#039; for Assuming Its Rules Cover All\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/mark-cuban-sec-mistakes-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/mark-cuban-sec-mistakes-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/mark-cuban-sec-mistakes-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/mark-cuban-sec-mistakes-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/mark-cuban-sec-mistakes-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/mark-cuban-sec-mistakes-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/mark-cuban-sec-mistakes.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Mark Cuban, a Shark Tank star and owner of the NBA team Dallas Mavericks, has slammed the U.S. Securities and Exchange Commission (SEC) for taking a wrong approach to regulating the crypto industry. “The SEC is not infallible. It makes mistakes,” the billionaire stressed, adding that if the SEC had taken a similar approach to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T03:25:31.000Z",
    "title": "Bitcoin Price Could See Fresh “Liftoff” if It’s Able to Hold One Key Level",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-liftoff-30k/",
    "description": "Bitcoin price corrected gains and retested the $30,650 support. BTC could start a fresh increase if it stays above the $30,000 support zone. Bitcoin is holding gains above the $30,650 support zone. The price is trading above $30,700 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $30,700 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it stays above the $30,650 support zone. Bitcoin Price Remains Stable Bitcoin price struggled to clear the key $31,400 resistance zone. BTC started a downside correction below the $31,000 and $30,800 levels. The price declined below the 50% Fib retracement level of the upward move from the $30,192 swing low to the $31,372 high. However, the bulls were seen active near the $30,650 support zone and the 100 hourly Simple moving average. Bitcoin also tested the 61.8% Fib retracement level of the upward move from the $30,192 swing low to the $31,372 high. It is now trading above $30,700 and the 100 hourly Simple moving average. There is also a key bullish trend line forming with support near $30,700 on the hourly chart of the BTC/USD pair. Immediate resistance is near the $31,050 level. The first major resistance is near the $31,250 level, above which the price might start rise toward $31,400. Source: BTCUSD on TradingView.com A close above the $31,400 resistance could start another strong increase. The next major resistance is near the $32,000 level. Any more gains could open the doors for a move toward the $32,500 resistance zone. More Losses in BTC? If Bitcoin’s price fails to clear the $31,050 resistance, it could continue to move down. Immediate support on the downside is near the $30,650 level and the trend line and the 100 hourly Simple moving average. The next major support is near the $30,470 level, below which there could be a drop toward $30,200. Any more losses might send the price toward the $30,000 zone, under which there is a risk of a larger decline. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is below the 50 level. Major Support Levels – $30,650, followed by $30,200. Major Resistance Levels – $31,050, $31,400, and $32,000."
  }
]