[
  {
    "source": "CoinDesk",
    "date": "2023-08-16T21:01:21.000Z",
    "title": "Trump Owns Even More Crypto Than First Known, New Documents Show",
    "url": "https://www.coindesk.com/markets/2023/08/16/trump-owns-even-more-crypto-than-first-known-new-documents-show/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The former U.S. president currently holds $2.8 million in ETH after debuting an NFT collection last year, fresh disclosures reveal."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T21:06:26.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? Today&#8217;s Filecoin price is $3.71, with a 24-hour trading volume of $101,148,403. Filecoin is down 2.49% in the last 24 hours. The current CoinMarketCap ranking is #30, with a market cap of $1,931,939,927. It has a circulating supply of 438,146,575 FIL coins, and the max. ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T20:46:49.000Z",
    "title": "PayPal’s stock prices drop by 3% after new CEO announcement",
    "url": "https://www.cryptopolitan.com/paypal-stock-prices-drop-3-percent/",
    "description": "Following the unveiling of PayPal&#8217;s forthcoming CEO, the payment behemoth recorded a downturn in its stock prices. Just after the revelation, the stock valuation decreased by 3%, positioning it just shy of the $60 benchmark. The looming exit of Dan Schulman, steering the company for nearly a decade, is believed to be the trigger behind ... <a title=\"PayPal’s stock prices drop by 3% after new CEO announcement\" class=\"read-more\" href=\"https://www.cryptopolitan.com/paypal-stock-prices-drop-3-percent/\" aria-label=\"More on PayPal’s stock prices drop by 3% after new CEO announcement\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T20:52:37.000Z",
    "title": "Binance Connect winds down, cites shift in market dynamics",
    "url": "https://crypto.news/binance-connect-winds-down-cites-shift-in-market-dynamics/",
    "description": "Binance Connect, which allowed users to process fiat-to-crypto payments for Binance, is shutting down today on Aug. 16"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-16T21:00:33.000Z",
    "title": "SEC Approval Could Propel Bitcoin To New Heights: Analyst Forecasts $150,000 Clearing Price",
    "url": "https://www.newsbtc.com/bitcoin-news/sec-approval-could-propel-bitcoin-to-new-heights-analyst-forecasts-150000-clearing-price/",
    "description": "In a recent interview, Tom Lee, CNBC’s head of research, shared his insights on the potential impact of a Spot Bitcoin exchange-traded fund (ETF) approval by the Securities and Exchange Commission (SEC) on the price of the largest cryptocurrency in the market.  Lee expressed optimism that introducing a Bitcoin ETF could propel the digital asset to price levels of $150,000 or even $180,000, representing a significant surge from current levels.  Optimistic View On BTC Lee&#8217;s bullish stance on the potential for a Bitcoin ETF to drive price appreciation reflects the growing anticipation within the cryptocurrency community, as an ETF would provide traditional investors with a regulated and easily accessible vehicle for gaining exposure to Bitcoin, potentially attracting substantial capital inflows into the market.  According to Lee, if the SEC were to approve a Spot Bitcoin ETF, it could unlock a new wave of investor interest and significantly boost the price of Bitcoin.  He estimated that this approval could drive the cryptocurrency to $150,000 or even $180,000, representing a substantial appreciation from its current levels.  The endorsement of a regulated ETF would likely instill confidence among institutional investors who have hesitated to enter the cryptocurrency market due to concerns about custody and regulatory oversight. Related Reading: SEI Token Breaks Into Top 100 One Day Post-Debut On Major Exchanges However, Lee also acknowledged the influence of the upcoming Bitcoin halving event on the price trajectory. Bitcoin&#8217;s protocol is designed to undergo halvings approximately every four years, reducing the block reward miners receive by half.  Considering the impact of the halving, Lee tempered expectations of Bitcoin reaching six-figure prices in the immediate aftermath. While he expressed confidence in the long-term potential of the digital asset, he suggested that the effects of the halving might delay the realization of such high valuations.  Bitcoin Holds Critical Zone Amidst Intensifying Bull-Bear Battle While continuing to experience a consolidation phase and decide which side will crack first,  Bitcoin has found itself in a critical zone, prompting both bullish and bearish sentiments among market participants.  Keith Alan, co-founder of the analysis firm Material Indicators, has highlighted vital indicators and technical levels that are currently shaping the market&#8217;s direction.  While the bears actively seek to test support and potentially trigger a macro bear market, the bulls have maintained the trading range thus far, keeping the macro bull market prospects alive. The significance of maintaining the range cannot be understated. According to Alan’s analysis, key Moving Averages and the green resistance/support (R/S) Flip Zone have demarcated critical levels that Bitcoin must hold.  As BTC’s price approaches the lower end of the range, below $29,000, Alan closely observes the technical support at the 21-Week Moving Average, as a breach of this level could have far-reaching implications for the overall market sentiment. According to Keith, a break below the range and the subsequent formation of a Lower Low (LL) in price action would signal the onset of a macro bear market. This would imply a prolonged period of downward price pressure and a potential shift in the broader market trend.  Related Reading: Is An XRP Spot ETF Coming To The US Soon? Bloomberg Analyst Answers Conversely, a successful defense of the range, coupled with a clearance of the 100-Week Moving Average and the formation of a Higher High (HH), would indicate the potential for a macro bull market characterized by sustained upward momentum. Despite the bearish signs of “price erosion” and diminishing liquidity, the bulls can still find solace in the fact that they are currently holding the range. This suggests that the market is yet to tip in favor of the bears decisively.  However, the bears remain determined to test this support, making it a crucial juncture for determining the near to mid-term trend of Bitcoin. Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-16T21:00:00.000Z",
    "title": "Coinbase Starts Regulated BTC and ETH Futures Contracts to U.S. Client",
    "url": "https://coinedition.com/coinbase-starts-regulated-btc-and-eth-futures-contracts-to-u-s-client/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coinbase Starts Regulated BTC\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Coinbase-Starts-Regulated-BTC-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The U.S.-based crypto exchange Coinbase has secured regulatory approval to start a crypto derivative market for eligible Americans. In a recent tweet, Coinbase revealed that it received approval from the National Futures Association (NFA). The NFA is a designated self-regulatory organization under the Commodity Futures Trading Commission (CFTC). Under this license, Coinbase will operate as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-starts-regulated-btc-and-eth-futures-contracts-to-u-s-client/\">Coinbase Starts Regulated BTC and ETH Futures Contracts to U.S. Client</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]