[
  {
    "source": "Decrypt",
    "date": "2023-10-09T19:46:15.000Z",
    "title": "Why NFL Alumni Are Turning to NFTs to Support Retired Football Players",
    "url": "https://decrypt.co/200684/why-nfl-alumni-turning-nfts-support-retired-football-players",
    "description": "The NFL Alumni Association is teaming with Aventus to help veteran players launch NFTs via Polkadot, with the aim of supporting former pros."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-09T19:47:24.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Ripple’s CFO steps down amid SEC lawsuit, meanwhile prosecutors have asked the judge in Sam Bankman-Fried’s trial to forbid his legal team from making any arguments relating to the potential recovery of FTX customer assets invested in Anthropic. In related news, the crypto community has continued to savor the testimony of former FTX Chief Technology Officer Gary Wang, accusing FTX of using Python code to misrepresent the value of its backstop fund.</p><h2>Ripple’s CFO steps down amid SEC lawsuit</h2><p>Ripple’s chief financial officer, Kristina Campbell, has stepped down. According to their LinkedIn page, they’ve taken a similar position at digital healthcare services provider Maven Clinic. </p><p>Campbell joined Ripple in April 2021, half a year after the United States Securities and Exchange Commission filed a lawsuit against the company for alleged violations of securities laws. </p><p><a href=\"https://cointelegraph.com/news/ripple-cfo-steps-down\">The former Ripple CFO described their time with the company as “memorable”</a> on LinkedIn, it’s unclear at this time whether the executive’s departure had anything to do with the ongoing SEC suit. </p><h3>Sam Bankman-Fried $500M Anthropic stake irrelevant to case, prosecutors say</h3><p>United States prosecutors have requested the court presiding over Sam Bankman-Fried’s trial to bar his legal team from making any arguments relating to the potential recovery of FTX customer assets invested in Anthropic.</p><p>Bankman-Fried invested $500 million in the artificial intelligence startup in April 2022; however, the U.S. government is set to present evidence that the Anthropic investment was made using misappropriated funds from FTX customer deposits.</p><p>Anthropic made headlines in recent weeks as it looks to raise fresh funds from investors, courting the likes of Amazon and Google, which could lead to a $20–$30 billion valuation.</p><p>U.S. prosecutors note that recent reports focused on the potentially high valuation of the company would also increase the value of Bankman-Fried’s investment, which could aid the potential recovery of funds for FTX customers and other creditors in the FTX bankruptcy.</p><p>The prosecutors believe that this evidence is intended to be used to support the argument that FTX customers and other victims would be fully compensated for their losses, which the court has previously indicated as an “impermissible purpose:”</p><h3>FTX used Python code to fake its insurance fund figure: Gary Wang</h3><p>Crypto exchange FTX used hidden Python code to <a href=\"https://cointelegraph.com/news/ftx-insurance-fund-sam-bankman-fried-fraud-trial-gary-wang-testimony\">misrepresent the value of its insurance fund</a> — a pool of funds meant to prevent user losses during huge liquidation events — according to testimony from FTX co-founder Gary Wang. </p><p>In the damning new <a href=\"https://twitter.com/BitMEXResearch/status/1710416199115247926\" target=\"_blank\" rel=\"noopener nofollow\">testimony</a> on Oct. 6, FTX's former chief technology officer, Gary Wang, said that FTX’s so-called $100 million insurance fund in 2021 was actually fabricated, and also never actually contained any of the exchanges’ FTX tokens (FTT) as <a href=\"https://twitter.com/FTX_Official/status/1360858165802197003?lang=en\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a>.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Please see below the exhibit, with the code showing the random number field in the formula to calculate the FTX insurance fund figure to publish <a href=\"https://t.co/jbKqMQxT8B\">https://t.co/jbKqMQxT8B</a> <a href=\"https://t.co/5c9yS0sXq4\">pic.twitter.com/5c9yS0sXq4</a></p>&mdash; BitMEX Research (@BitMEXResearch) <a href=\"https://twitter.com/BitMEXResearch/status/1710739315611877533?ref_src=twsrc%5Etfw\">October 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Instead, the figure shown to the public was calculated by multiplying the daily trading volume of the FTX Token by a random number close to 7,500.</p><p>An exhibit in the Oct. 6 trial shows the alleged code used to generate the size of the so-called \"Backstop Fund” or public insurance fund. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Subscribe to our ‘1 Minute Letter’ NOW for daily deep-dives straight to your inbox! ⚖️ Be the first to know every twist and turn in the Sam Bankman-Fried case! Subscribe now: <a href=\"https://t.co/jQOIYUv6IW\">https://t.co/jQOIYUv6IW</a>  <a href=\"https://twitter.com/hashtag/SBF?src=hash&amp;ref_src=twsrc%5Etfw\">#SBF</a> <a href=\"https://t.co/gp7zJu5sgy\">pic.twitter.com/gp7zJu5sgy</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1709911708049772942?ref_src=twsrc%5Etfw\">October 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-10-09T19:52:42.000Z",
    "title": "Crypto firms assemble aid fund amid Israeli-Hamas war",
    "url": "https://crypto.news/crypto-firms-assemble-aid-fund-amid-israeli-hamas-war/",
    "description": "Several web3 companies have banded together to open donations via the Crypto Aid Israel platform, pulling together resources to finance humanitarian aid for displaced Israelis."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-09T20:00:24.000Z",
    "title": "These Bullish Factors Prove XRP Price Rally Is Not Over Yet",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-rally-not-over-yet/",
    "description": "The XRP price has retraced a good portion of its gains following its surge above $0.54 last week. Naturally, this could signal that the end is in sight for an XRP rally but this is not necessarily the case when you look at the altcoin’s metrics and performance even amid its price decline. XRP Daily Transaction Count Remains Above 1 Million The XRP daily transaction count first skyrocketed above 1 million back in July when Judge Analisa Torres ruled that programmatic XRP sales did not constitute investment contracts. The XRP price had rallied more than 60% as a result of this and daily transaction counts shot up as well. By the time August rolled around, XRP’s daily transaction counts had surpassed that of Bitcoin and Ethereum, and the network has not slowed down since. Looking at data from BitInfoCharts, XRP is still maintaining its more than 1 million transactions per day numbers. Daily transaction count remains above 1 million &#124; Source: BitInfoCharts Since the start of October, the altcoin’s daily transaction figures have also come out consistently above that of Bitcoin and Ethereum, showing that interest in the network has not diminished. XRP Ledger Crosses 83 Million Blocks As transaction counts have been on the high side, block production on the XRP Ledger also shows active participation from users. Late last week, the blockchain marked its 83 millionth block. Related Reading: 39-Month Cycle Says XRP Price Is Poised For Breakout To $1,000, Here’s When This was confirmed by the XRPScan account on X (formerly Twitter), coming less than two months after the Ledger marked its 82 millionth block. XRP Ledger successfully closed 83 millionth ledger a few moments ago: https://t.co/USQVIHBcmY https://t.co/HwDv3m2nHb pic.twitter.com/wuwTZBMtGx — XRPScan (@xrpscan) October 5, 2023 The rapid rise in usage is shown by the over 46,000 payments already made in the current block at the time of writing. Additionally, there have been 392,000 transactions and rising, with an average Transaction Per Second (TPS) of 20 TPS. XRP sees rocky start to the new week &#124; Source: XRPUSD on Tradingview.com Daily Trading Volume Jumps 56% Another major factor that could point to the XRP price rally not being over is the jump in daily trade volume. Between Sunday and Monday, the XRP daily trading volume rose more than 56% to reach approximately $480 million. This follows a jump above $500 million previously before the cool-down. Related Reading: Crypto Analyst Presents Data To Prove That XRP Is Deflationary Just like other factors listed above, the jump in trading volume suggests rising interest. Given that the XRP price has not been in free fall, it could point to the volume being skewed more toward buying rather than selling. In such a case, a rally is more likely to ensue. XRP Price Rally Could Continue Despite the XRP price falling to bearish pressure over the last few days, it could quickly recover as metrics continue to flash bullish. As one crypto analyst points out, the XRP price is reaching the point in its 39-month cycle where it could bounce toward another rally. For the top of this rally, the analyst puts the price at $1,000. Currently, the XRP price is sitting at $0.5141, registering a 1.49% loss in the last 24 hours. Featured image from Crypto News, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-09T19:46:48.000Z",
    "title": "Flutterwave and Hedera (HBAR) Join Forces for Instant Payments Revolution in Africa",
    "url": "https://www.crypto-news-flash.com/flutterwave-and-hedera-hbar-join-forces-for-instant-payments-revolution-in-africa/?utm_source=rss&utm_medium=rss&utm_campaign=flutterwave-and-hedera-hbar-join-forces-for-instant-payments-revolution-in-africa",
    "description": "<img width=\"836\" height=\"508\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/HEDERA-.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Flutterwave\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/HEDERA-.png 836w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/HEDERA--300x182.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/HEDERA--768x467.png 768w\" sizes=\"(max-width: 836px) 100vw, 836px\" />Flutterwave and Hedera have partnered to integrate the stablecoin USDC on the Hedera network to enhance cross-border financial transactions in Africa. The partnership was announced at the Africa Money &#38; DeFi Summit West Africa, a platform that fosters collaborations in the fintech and cryptocurrency sectors. Flutterwave, a foremost African payments company, and Hedera, a notable [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-09T20:00:18.000Z",
    "title": "Crypto Analyst Predicts More Rallies for Ethereum-Based Altcoin, Says Crazy Moves Ahead for Bitcoin (BTC)",
    "url": "https://dailyhodl.com/2023/10/09/crypto-analyst-predicts-more-rallies-for-ethereum-based-altcoin-says-crazy-moves-ahead-for-bitcoin-btc/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/the-Fire-of-Crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/the-Fire-of-Crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/the-Fire-of-Crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/the-Fire-of-Crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/the-Fire-of-Crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/the-Fire-of-Crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/the-Fire-of-Crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist says more rallies are likely in sight for a low-cap altcoin running on the Ethereum (ETH) blockchain. Pseudonymous analyst Altcoin Sherpa tells his 196,700 followers on the social media platform X that the native asset of the image-synthesizing ecosystem Render Network (RNDR) is likely due for a 33% rally from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/09/crypto-analyst-predicts-more-rallies-for-ethereum-based-altcoin-says-crazy-moves-ahead-for-bitcoin-btc/\">Crypto Analyst Predicts More Rallies for Ethereum-Based Altcoin, Says Crazy Moves Ahead for Bitcoin (BTC)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-09T19:55:36.000Z",
    "title": "‘Most Brutal Part of the Market Cycle’ Now Unfolding for Crypto Markets, Says Analyst Benjamin Cowen",
    "url": "https://dailyhodl.com/2023/10/09/most-brutal-part-of-the-market-cycle-now-unfolding-for-crypto-markets-says-analyst-benjamin-cowen/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/04/quantum-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/04/quantum-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/04/quantum-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/04/quantum-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/04/quantum-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/04/quantum-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/04/quantum-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto strategist Benjamin Cowen says that the crypto market is entering one of the most &#8220;brutal&#8221; stages of its cycle. Cowen tells his 768,800 followers on the social media platform X that Bitcoin’s (BTC) dominance, or its total share of the crypto market capitalization, is now going up as risk appetite for the asset class [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/09/most-brutal-part-of-the-market-cycle-now-unfolding-for-crypto-markets-says-analyst-benjamin-cowen/\">‘Most Brutal Part of the Market Cycle’ Now Unfolding for Crypto Markets, Says Analyst Benjamin Cowen</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]