[
  {
    "source": "Cointelegraph",
    "date": "2024-04-05T13:00:52.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Expecting mining profitability to drop after the Bitcoin halving? Think again, says a market maker interviewed by Cointelegraph. Solana’s non-vote transaction failure rate has hit a record 75% amid reports of degraded user experience on the network. Meanwhile, memecoins have become a major focal point of the 2024 crypto bull market.</p><p>Bitcoin mining profitability <a href=\"https://cointelegraph.com/news/bitcoin-mining-profitability-wont-fall-halving\">won’t necessarily fall</a> after the upcoming Bitcoin halving, despite a 50% Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) supply issuance reduction, Laurent Benayoun, the CEO of Acheron Trading, told Cointelegraph.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-halving-2024\">The Bitcoin halving</a> is set to reduce block issuance rewards from 6.25 BTC to 3.125 BTC on April 20. Following previous halvings, smaller mining firms were forced out of business due to the decreased block rewards.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2024-04-05T13:07:24.000Z",
    "title": "INJ elevates ETH as spotlight turns to Aave and new AI altcoin",
    "url": "https://crypto.news/inj-elevates-eth-as-spotlight-turns-to-aave-and-new-ai-altcoin/",
    "description": "Injective Protocol's Ionic upgrade enhances not only its own ecosystem but also significantly impacts the Ethereum network and altcoins like AAVE and Borroe Finance. #partnercontent"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-05T13:00:10.000Z",
    "title": "Cardano Price Tumbles As Grayscale Sells All ADA From Large Cap Fund",
    "url": "https://www.newsbtc.com/news/cardano/cardano-price-tumbles-grayscale-sells-ada/",
    "description": "The Cardano (ADA) price is experiencing a notable decrease, dropping by 12% since the start of the week, with a 2.6% dip recorded today alone. Despite this, with a market capitalization of $20.27 billion, ADA maintains its position as the 9th largest cryptocurrency. This recent downturn comes amidst a broader crypto market experiencing mostly sideways to downward movement, with ADA recording more significant losses compared to its peers like ETH, which is down by 7.4%, BNB by 6.4%, Solana by 6.3%, and XRP by 6.1%. Grayscale Dumps Cardano From GDLC A pivotal factor behind Cardano&#8217;s sharper decline could be linked to the recent liquidation of all ADA holdings by the Grayscale Digital Large Cap Fund (GDLC). The fund, which currently boasts assets under management (AUM) worth $579 million, had Cardano constituting 1.62% of its portfolio on January 4, which amounts to approximately $9.4 million. Related Reading: Cardano Rides The ETF Wave: Inflows Surge To Over $1 Million – Details On Thursday, Grayscale Investments announced the decision as part of its first quarter 2024 review. According to the official press release, the adjustment to GDLC&#8217;s portfolio entailed the selling of Cardano and reallocating the cash proceeds to existing Fund Components, proportional to their weightings. This rebalancing led to the removal of ADA from GDLC&#8217;s portfolio. The final composition of the fund as of April 3, 2024, includes Bitcoin (70.96%), Ethereum (21.84%), Solana (4.52%), XRP (1.73%) and Avalanche (0.95%). The press release detailed, &#8220;In accordance with the CoinDesk Large Cap Select Index methodology, Grayscale has adjusted GDLC’s portfolio by selling Cardano (ADA), and using the cash proceeds to purchase existing Fund Components in proportion to their respective weightings. As a result of the rebalancing, Cardano (ADA) has been removed from GDLC.&#8221; Related Reading: Panel Of Experts Reveal When The Cardano Price Will Reach $3 Grayscale also highlighted the quarterly evaluations of the GDLC, DEFG, and GSCPxE Fund compositions, aimed at updating existing Fund Components or including new ones based on index methodologies provided by the Index Provider. This practice ensures that the funds&#8217; holdings reflect the most current market trends and asset performance. Notably, the Grayscale Smart Contract Platform Ex-Ethereum Fund still contains Cardano. The cryptocurrency is the second-largest position after Solana (58.41%), with a weighting of 14.56%. In response to these developments, Charles Hoskinson, the founder of Cardano, offered a terse commentary via X, stating, &#8220;Wall Street give; Wall Street take.&#8221; This succinct remark encapsulates the volatile nature of crypto investments and the significant impact that major financial players like Grayscale can have on the market dynamics of digital assets. Wall Street give; Wall Street take https://t.co/dkyrhHW4WS &#8212; Charles Hoskinson (@IOHK_Charles) April 5, 2024 At press time, ADA was trading at $0.57. In the short term, the 100-day EMA at $0.58 is the key resistance that ADA needs to overcome in order to develop new bullish momentum. The 100-day EMA has served as strong support three times since mid-January. After the recent dip below this indicator, ADA is struggling to reclaim it. In the medium term, the bulls need to break above the $0.68 level. Featured image from Guarda Wallet, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-04-05T13:02:53.000Z",
    "title": "Bitget Announces Listing of MUMU, a New Memecoin with a Mission",
    "url": "https://www.crypto-news-flash.com/bitget-announces-listing-of-mumu-a-new-memecoin-with-a-mission/?utm_source=rss&utm_medium=rss&utm_campaign=bitget-announces-listing-of-mumu-a-new-memecoin-with-a-mission",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/Chainwire-1200_720_25_17123146319HByPLChkR.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/Chainwire-1200_720_25_17123146319HByPLChkR.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/Chainwire-1200_720_25_17123146319HByPLChkR-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/Chainwire-1200_720_25_17123146319HByPLChkR-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/Chainwire-1200_720_25_17123146319HByPLChkR-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/Chainwire-1200_720_25_17123146319HByPLChkR-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Victoria, Seychelles, April 5th, 2024, Chainwire Bitget, a world-leading cryptocurrency exchange and Web3 company, is thrilled to announce the listing of MUMU, the latest addition to its growing roster of digital assets. MUMU on Solana is not just a cryptocurrency; it&#8217;s a movement aimed at bringing together crypto enthusiasts from all walks of life. Born [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-04-05T12:54:57.000Z",
    "title": "Binance Implements Mandatory KYC for Sub-Accounts in Compliance Push",
    "url": "https://coinedition.com/binance-implements-mandatory-kyc-for-sub-accounts-in-compliance-push/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/04/image1-9.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance Implements Mandatory KYC for Sub-Accounts in Compliance Push\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/04/image1-9.jpg 730w, https://coinedition.com/wp-content/uploads/2024/04/image1-9-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/04/image1-9-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/04/image1-9-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/04/image1-9-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/04/image1-9-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/04/image1-9-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/04/image1-9-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/04/image1-9-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/04/image1-9-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/04/image1-9-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/04/image1-9-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/04/image1-9-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/04/image1-9-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/04/image1-9-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/04/image1-9-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent update, Binance has introduced stringent identity verification requirements for all its sub-accounts under the Binance Link Program, aiming to enhance compliance standards. According to the update, the exchange has been imposing restrictions on sub-accounts that lack the necessary Know Your Customer (KYC) documentation since March 20, 2024.&#160; Moreover, the firm explained that [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/binance-implements-mandatory-kyc-for-sub-accounts-in-compliance-push/\">Binance Implements Mandatory KYC for Sub-Accounts in Compliance Push</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]