[
  {
    "source": "CoinDesk",
    "date": "2023-06-16T18:13:40.000Z",
    "title": "Coinbase Policy Chief Shirzad Squares Off With SEC Enforcement Director Grewal",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/16/coinbase-policy-chief-shirzad-squares-off-with-sec-enforcement-director-grewal/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A sneak peek of the looming crypo regulatory prize fight highlights that everyone is talking past each other."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-16T18:10:01.000Z",
    "title": "The Weeknd and Binance Enter the Metaverse",
    "url": "https://decrypt.co/144944/weeknd-launches-metaverse-game-amid-binance-backed-tour",
    "description": "The digital experience arrives amid The Weeknd's Binance-sponsored, \"crypto-powered\" world tour, which is currently in Europe."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-16T18:19:35.000Z",
    "title": "Price analysis 6/16: BTC, ETH, BNB, XRP, ADA, DOGE, SOL, MATIC, LTC, DOT",
    "url": "https://cointelegraph.com/news/price-analysis-6-16-btc-eth-bnb-xrp-ada-doge-sol-matic-ltc-dot",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/412dd23d-cb46-4696-ac10-ae1b38f2bc35.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin has reclaimed the $26,000 level, but will large cap altcoins follow BTC's rebound?</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is witnessing a tough battle between buyers and sellers near the $25,000 mark. A minor cause of worry for the bulls is that even the news of <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">BlackRock having filed an application</a> for a Bitcoin spot exchange-traded fund could not boost prices higher. This suggests that investors remain cautious due to the regulatory overhang.</p><p>However, this does not mean that professional investors have abandoned plans to invest in cryptocurrencies. The Laser Digital Investor Survey of institutional investors conducted in April shows that <a href=\"https://cointelegraph.com/news/investors-crypto-institutional-backing-nomura-survey\">90% of the respondents were ready to consider</a> putting money into crypto if the asset was backed by a “large traditional financial institution.” Another positive was that 82% of the investors polled were positive on crypto’s prospects over the next 12 months. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/f929c430-b8ac-4683-bd0d-03ceeab13102.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>Glassnode co-founders Yann Allemann and Jan Happel said in a tweet on June 15 that a traditional technical analysis indicator and two on-chain <a href=\"https://cointelegraph.com/news/bitcoin-price-metrics-similarities-2020-breakout\">indicators for Bitcoin were looking similar</a> to how they did in Q3 2020, just before Bitcoin soared above its 2017 high of $20,000.</p><p>Could Bitcoin and the altcoins start a recovery from the current levels? Let’s study the charts of the top-10 cryptocurrencies to find out.</p><h2>Bitcoin price analysis</h2><p>Bitcoin plunged below the crucial support at $25,250 on June 14, indicating aggressive selling by the bears.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/bbee5ccb-5014-40ab-939d-ca1750368cbf.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>Although the bulls managed to push the price back above $25,250 on June 15, they will have to overcome the obstacle at the 20-day exponential moving average ($26,320) to start a meaningful bounce. The BTC/USDT pair could then attempt a rally to the 50-day simple moving average ($27,210) and subsequently to the resistance line of the descending channel.</p><p>Contrary to this assumption, if the price turns down from the 20-day EMA, the bears will again attempt to sink the pair to the support line of the channel. The bulls are expected to defend this level with all their might because a break below it may clear the path for a crash to the psychologically critical level of $20,000.</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) slipped below the $1,700 level on June 14, indicating that the failure to start a strong rebound may have intensified selling by the bears.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/c0d87a7a-698f-42ab-995b-c162d78b6f7d.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls are trying to push the price back above $1,700 but the bears are expected to protect the level with vigor. If the price turns down from $1,700, the possibility of a break below $1,600 increases. If that happens, the ETH/USDT pair may tumble to the next major support at $1,352.</p><p>Alternatively, if the pair rises above $1,700, it will suggest strong demand at lower levels. The pair may then rise to the 20-day EMA ($1,779) where the bears will try to halt the recovery. If they fail in their endeavor, the prospects of a rally to $1,928 and thereafter to $2,000 increase.</p><h2>BNB price analysis</h2><p>BNB’s (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) rebound fizzled out at the 38.2% Fibonacci retracement level of $252.50 on June 14, indicating that bears continue to sell on minor rallies.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/96430107-9f94-4dad-9280-01d440508dee.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The real test will be at the $220 level. If bears succeed in pulling the price below it, the BNB/USDT pair could start the next leg of the downtrend. The pair could then collapse to the crucial support at $183.</p><p>Another possibility is that the bulls buy the dips to the $220 support. In that case, the pair may swing between $252 and $220 for some time. If buyers drive the price above $252, the pair may rise to $265 where the bears are again expected to mount a strong defense.</p><h2>XRP price analysis</h2><p>The failure to sustain XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) above the overhead resistance at $0.56 on June 13 may have tempted several short-term traders to book profits.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/23756984-41ce-491f-bf18-198644db9cbc.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The price fell below the 50-day SMA ($0.47) on June 14 and 15 but did not close below the level. Buyers could not capitalize on this window of opportunity and push the price higher. That may have accelerated selling on June 16. If the price sustains below the 50-day SMA, the XRP/USDT pair could dive to $0.41.</p><p>If bulls want to make a comeback, they will have to quickly push the price back above the 20-day EMA. The pair may then make one more attempt to rise above the overhead resistance at $0.56.</p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) turned down on June 14 but the bears are finding it difficult to sink the price to the next support at $0.24.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/dd0ab1f0-a416-4731-83b1-b6e62c2a0359.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: TradingView</em></figcaption></figure><p>This suggests that buyers are attempting to stall the decline near $0.24. The oversold levels on the RSI indicate the possibility of a short-term consolidation or a relief rally in the next few days. The ADA/USDT pair may oscillate between $0.24 and $0.30 for some time.</p><p>If buyers want to start a sustained relief rally, they will have to overcome the obstacle at the 20-day EMA ($0.31). The pair could then climb to the 50-day SMA ($0.35). Contrarily, if the price breaks below $0.24, the pair may slump to $0.22 and then to $0.20.</p><h2>Dogecoin price analysis</h2><p>The bears made an attempt to resume the decline by pulling Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) below the strong support at $0.06 but the bulls purchased the drop as seen from the long tail on the candlestick.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/c9273537-241e-4552-8be7-82c606cfd3de.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: TradingView</em></figcaption></figure><p>Buyers will try to start a relief rally that could reach the 20-day EMA ($0.07). This remains a formidable hurdle for the bulls to cross because the bears have repeatedly stopped recovery attempts at this level since April 20. </p><p>On the downside, the $0.06 level is an important support for the bulls to defend because if it gives way, the DOGE/USDT pair could plummet to the next support at $0.05. Conversely, a break above the 20-day EMA may result in a move higher to $0.08.</p><h2>Solana price analysis</h2><p>The failure of the bulls to push and sustain Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) above the breakdown level of $15.28 attracted a fresh bout of selling on June 14.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/c4ae0c35-e2f6-4413-92ba-23f8966b703b.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bears tried to sink the price to the June 10 intraday low of $12.80 but the bulls purchased the dip near $14. This suggests that the buyers have not given up and are accumulating on dips.</p><p>Buyers will have to push and sustain the price above $16 to suggest the start of a stronger recovery toward the 20-day EMA ($17.52). This remains the key level to watch out for because a break above it could result in a retest of the breakdown level at $18.70. </p><p>The bears will have to yank the price below $12.80 to start the next leg of the downward move to $10.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-price-eases-downside-traders-24-5k-support-holds\"><strong><em>Bitcoin price eases downside as traders demand $24.5K support holds</em></strong></a></p><h2>Polygon price analysis</h2><p>Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) turned down from the breakdown level of $0.69 on June 13, indicating that the bears are trying to flip the level into resistance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/5aa38452-3525-4cb9-82f4-e48b756a2fd9.png\"  /><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>Although the downsloping moving averages indicate advantage to bears, the oversold levels on the RSI suggest a minor consolidation is possible. The MATIC/USDT pair may stay between $0.69 and $0.50 for some time.</p><p>Buyers will have to kick the price above the 20-day EMA ($0.73) to indicate that the lower levels have been rejected. That could start a relief rally toward $1. This view will invalidate if the price continues lower and plunges below $0.50. That could open the doors for a fall to $0.44 and then to $0.32.</p><h2>Litecoin price analysis</h2><p>The $75 support cracked on June 14, indicating that the bears are trying to sink Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) to the next support at $65.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/037486a9-5f3a-44dc-aeb8-ae6228f5e723.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>A minor positive in favor of the bulls is that they did not allow the price to sustain below the $75 level. This indicates that lower levels are attracting buyers. The bulls need to drive the price above the 20-day EMA ($83) else, the LTC/USDT pair may witness another round of aggressive selling.</p><p>If the price turns down and breaks below $75, the possibility of a drop to $65 increases. This level may again attract buyers but if they fail to defend the level, the pair could slide to $61.</p><h2>Polkadot price analysis</h2><p>Polkadot (<a href=\"https://cointelegraph.com/polkadot-price-index\">DOT</a>) turned down from the 20-day EMA ($4.86) on June 14, indicating that the sentiment remains negative and bears are selling on rallies.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/4fd9da52-0558-4a8a-9769-d11d50b84232.png\"  /><figcaption style=\"text-align: center;\"><em>DOT/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The RSI has dipped back into the oversold territory, indicating that a minor consolidation or a relief rally is possible. If the price turns up from the current level, the DOT/USDT pair could again rise to the 20-day EMA. This remains the key level to watch out for on the upside because a break above it could push the pair to $5.15.</p><p>The bears are likely to have other plans. They will try to strengthen their position further by pulling the price below the $4.22 support. If they manage to do that, the pair may slide to $4 and later to $3.50.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-16T18:29:03.000Z",
    "title": "Mark Cuban debates crypto regulations with former SEC official",
    "url": "https://cryptoslate.com/mark-cuban-debates-crypto-regulations-with-former-sec-official/",
    "description": "<p>A recent Twitter exchange between two prominent figures in the world of finance and technology, entrepreneur Mark Cuban and former SEC official John Reed Stark, has drawn attention as an example of positive, civil discourse around complex and contentious issues. The billionaire and the former enforcement official engaged in a spirited debate over the intricacies [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/mark-cuban-debates-crypto-regulations-with-former-sec-official/\">Mark Cuban debates crypto regulations with former SEC official</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T18:38:51.000Z",
    "title": "Emmanuel Macron aims to join BRICS summit in South Africa",
    "url": "https://www.cryptopolitan.com/macron-to-join-brics-summit-in-south-africa/",
    "description": "Leading the way in an unprecedented diplomatic move, French President Emmanuel Macron appears to be positioning himself on a new global chessboard, displaying an interest in attending the BRICS summit in Johannesburg this summer. This engagement with a consortium typically viewed as challenging the global leadership of the United States signifies a potential new direction ... <a title=\"Emmanuel Macron aims to join BRICS summit in South Africa\" class=\"read-more\" href=\"https://www.cryptopolitan.com/macron-to-join-brics-summit-in-south-africa/\" aria-label=\"More on Emmanuel Macron aims to join BRICS summit in South Africa\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T18:25:26.000Z",
    "title": "Media companies meet AI companies to talk about this",
    "url": "https://www.cryptopolitan.com/media-meet-ai-companies-to-talk-about-this/",
    "description": "In an era where technology and news media often intersect, a ground-breaking series of negotiations are on the horizon. Forefront players in artificial intelligence, including OpenAI, Google, Microsoft, and Adobe, are engaging in dialogues with top media houses to explore collaborations over the use of news content in training their AI technologies. AI technology meets ... <a title=\"Media companies meet AI companies to talk about this\" class=\"read-more\" href=\"https://www.cryptopolitan.com/media-meet-ai-companies-to-talk-about-this/\" aria-label=\"More on Media companies meet AI companies to talk about this\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T18:19:02.000Z",
    "title": "U.S. judge weighs Terra tokens’ security status",
    "url": "https://www.cryptopolitan.com/us-judge-weighs-terra-tokens-security-status/",
    "description": "As the growing influence of digital currencies disrupts financial markets globally, the nature of these digital assets and their regulatory status are under intense scrutiny. A pivotal case involving Terraform Labs and its founder, Do Kwon, is at the epicenter of this scrutiny, with a U.S. judge currently deliberating over the company&#8217;s digital assets and ... <a title=\"U.S. judge weighs Terra tokens&#8217; security status\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-judge-weighs-terra-tokens-security-status/\" aria-label=\"More on U.S. judge weighs Terra tokens&#8217; security status\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T18:13:04.000Z",
    "title": "Everything you need to know about Prometheum",
    "url": "https://www.cryptopolitan.com/everything-you-need-to-know-about-prometheum/",
    "description": "Get ready to dive into the complex world of Prometheum, a Special Purpose Broker-Dealer (SPBD) that&#8217;s been making waves in the cryptosphere. Serving as the first officially SEC-licensed platform for trading digital asset securities, Prometheum is taking center stage in the discussion of cryptocurrency regulation. Yet, the road to its current standing is as winding ... <a title=\"Everything you need to know about Prometheum\" class=\"read-more\" href=\"https://www.cryptopolitan.com/everything-you-need-to-know-about-prometheum/\" aria-label=\"More on Everything you need to know about Prometheum\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T18:12:33.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T18:33:31.000Z",
    "title": "Ripple, Binance, and Coinbase Battle Gary Gensler and the SEC – Who Will Come Out Victorious? Latest Updates and Potential Impact on Bitcoin, XRP, and the Market",
    "url": "https://www.crypto-news-flash.com/ripple-binance-and-coinbase-battle-gary-gensler-and-the-sec-who-will-come-out-victorious-latest-updates-and-potential-impact-on-bitcoin-xrp-and-the-market/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-binance-and-coinbase-battle-gary-gensler-and-the-sec-who-will-come-out-victorious-latest-updates-and-potential-impact-on-bitcoin-xrp-and-the-market",
    "description": "Ripple, Binance, and Coinbase are determined to come out victorious against an overreaching SEC. Their cases will have a far-reaching effect and potentially define the future of the entire crypto industry.  The SEC has recently taken it upon itself to come after the crypto industry. The regulator&#8217;s attack on the industry threatens to break the [...]"
  }
]