[
  {
    "source": "Decrypt",
    "date": "2023-12-27T22:29:19.000Z",
    "title": "Crypto Gaming Predictions: Will 2024 Be the Breakout Year?",
    "url": "https://decrypt.co/210772/crypto-gaming-predictions-2024-breakout-year",
    "description": "Crypto industry leaders remain optimistic about the future of blockchain gaming. Here's what they expect in 2024."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-27T22:10:29.000Z",
    "title": "Trump’s Ethereum wallet moves $2.4M in crypto to Coinbase",
    "url": "https://cryptoslate.com/trumps-ethereum-wallet-moves-2-4m-in-crypto-to-coinbase/",
    "description": "<p>An Ethereum wallet thought to belong to former U.S. President Donald Trump recently moved millions in crypto earned from sales of non-fungible tokens, according to reports from Arkham Intelligence on Dec. 27. Arkham noted that Trump&#8217;s wallet began to send his ETH holdings to Coinbase three weeks ago and has moved 1,075 ETH, worth $2.4 [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/trumps-ethereum-wallet-moves-2-4m-in-crypto-to-coinbase/\">Trump&#8217;s Ethereum wallet moves $2.4M in crypto to Coinbase</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-27T22:12:59.000Z",
    "title": "MicroStrategy buys $615 million worth of Bitcoin",
    "url": "https://cryptobriefing.com/microstrategy-buys-615-million-worth-bitcoin/?utm_source=feed&utm_medium=rss",
    "description": "MicroStrategy expands Bitcoin trove by 14K BTC purchased for $623M, bringing total holdings to 189K BTC now valued at over $8B."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-27T22:30:20.000Z",
    "title": "Lavrov Highlights 30 Nations’ Interest in BRICS as China-Saudi Pact Poses Challenge to US Dollar",
    "url": "https://news.bitcoin.com/lavrov-highlights-30-nations-interest-in-brics-as-china-saudi-pact-poses-challenge-to-us-dollar/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/lav-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Lavrov Highlights 30 Nations&#039; Interest in BRICS as China-Saudi Pact Poses Challenge to US Dollar\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/lav-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lav-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lav-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lav-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lav-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lav-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lav.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent statement by Sergey Lavrov, Russia&#8217;s Foreign Affairs Minister, he noted that the BRICS bloc is set to expand in 2024 with new members including the United Arab Emirates (UAE), Iran, and Saudi Arabia. He revealed that approximately “30 countries would like to establish partner ties with BRICS.” Additionally, as November drew to [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-27T22:19:52.000Z",
    "title": "IOTA Network Unveils LayerZero Cross-Chain Messaging Tech, Price Hits 6% Increase",
    "url": "https://nulltx.com/iota-network-unveils-layerzero-cross-chain-messaging-tech-price-hits-6-increase/",
    "description": "IOTA Network&#8217;s ShimmerEVM has unveiled plans to incorporate LayerZero&#8217;s cross-chain messaging technology, enabling users to engage and transact seamlessly across multiple networks. Shimmer, situated within the IOTA ecosystem, serves as a blockchain platform granting developers access to unique features for creating and launching decentralized apps (dApps). ShimmerEVM, the platform&#8217;s layer [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-27T22:30:18.000Z",
    "title": "When Will Bitcoin Bull Run Begin? This Could Be The Metric To Watch",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bull-run-begin-could-metric-watch/",
    "description": "A pattern in the supply of the Bitcoin long-term holders could provide some hints about when the next bull run might begin in earnest. Bitcoin HODLer Balance Has Followed A Specific Pattern In Previous Cycles According to the market intelligence platform IntoTheBlock, the supply of the BTC HODLers is &#8220;an excellent indicator for measuring market cycles.&#8221; The &#8220;HODLers&#8221; or long-term holders (LTHs) refer to the Bitcoin investors who have held onto their coins since at least a year ago without having sold or transferred them on the blockchain. Related Reading: Polygon Breaks Out Of Symmetrical Triangle, Analyst Puts This Target The LTHs are the resolute hands in the market, which rarely sell their coins even when a profitable opportunity has presented itself or a deep price crash has occurred. One way to track the behavior of these diamond hands is through the combined amount of balance they carry in their wallets. The chart below shows this Bitcoin metric trend over the past few years. The value of the metric seems to have been steadily going up in recent months &#124; Source: IntoTheBlock on X As displayed in the above graph, the Bitcoin supply held by the HODLers has been showing some growth over the past couple of years, suggesting that the LTHs have been accumulating. This rise in the indicator has also continued through the latest rally, implying that the LTHs aren&#8217;t yet ready to start taking their profits. Something to note is that when the metric goes up, it doesn&#8217;t mean buying is happening in the present. The indicator naturally has a 1-year lag associated with it, as coins must mature for that long before they can be included in the cohort. However, this only applies to buying as the holders moving their coins to sell instantly reset the age back to zero and, hence, remove them from the group. In the chart, the analytics firm has highlighted a pattern that the Bitcoin LTH supply has observed during the leadup to past bull runs. It would appear that the HODLers have shown accumulation in such periods. On the other hand, the start of selling from this cohort coincided with the beginning of the bull rally in proper. So far, the HODLers have only been accumulating recently, implying that the market may be in the pre-bull run phase. Related Reading: Fantom (FTM) To Rocket Up To $1.60 If This Happens: Analyst If the historical pattern indeed holds for the current cycle as well, then the HODLer supply could be one to watch, as a significant downtrend in it could turn out to be a signal that the bull run has begun once more. BTC Price Bitcoin had plunged towards the $41,700 mark yesterday, but the asset has already seen some sharp recovery as its price is now trading around the $43,000 level. Looks like BTC has jumped up during the past day &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, IntoTheBlock.com"
  }
]