[
  {
    "source": "CoinDesk",
    "date": "2024-02-26T20:43:31.000Z",
    "title": "Ether is Now the Largest Institutional Crypto Asset: Bybit Research",
    "url": "https://www.coindesk.com/markets/2024/02/26/ether-is-now-the-largest-institutional-crypto-asset-bybit-research/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Ether is now the largest single asset held by institutions, with Bybit speculating that this may be because of an upward swing from the Dencun upgrade."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-26T20:44:55.000Z",
    "title": " Appellate court rejects new trial for ‘My Big Coin’ founder ",
    "url": "https://cointelegraph.com/news/appeal-rejected-my-big-coin-founder-verdict",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvODgxNWEwYTYtZDRlNi00M2JjLWFjZjQtODk0YmQ1OGFhYzY3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Three judges rejected arguments that a court violated Randall Crater’s Sixth Amendment rights and included testimony from a crypto expert he claimed was unqualified.</p>\n                    <p><p>An appellate court has upheld the fraud conviction of Randall Crater, who founded cryptocurrency project My Big Coin and was sentenced to more than eight years in prison.</p><p>In a Feb. 23 filing for the United States Court of Appeals for the First Circuit, a three-judge panel affirmed Crater’s conviction more than a year after a jury <a href=\"https://cointelegraph.com/news/founder-of-7-5m-brazen-fraud-scheme-to-see-8-years-behind-bars\">found the crypto founder guilty</a> of four counts of wire fraud, three counts of unlawful monetary transactions and one count of operating an unlicensed money-transmitting business. Appellate Judges Gustavo Gelpí, Jeffrey Howard and Julie Rikelman issued opinions arguing that Carter was not owed a new trial for participating in the crypto scheme.</p><p>Crater’s legal team argued that the court violated his Sixth Amendment rights by not enforcing subpoenas against witnesses he claimed would help his case, and including testimony from a crypto expert he argued was unqualified — Pamela Clegg, vice president of financial investigations at blockchain intelligence firm CipherTrace. According to the judges, no argument by Crater’s counsel “merits reversal.” </p><p><a href=\"https://cointelegraph.com/news/appeal-rejected-my-big-coin-founder-verdict\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-26T21:07:44.000Z",
    "title": "Appellate court upholds fraud conviction of crypto founder Randall Crater",
    "url": "https://www.cryptopolitan.com/fraud-conviction-of-crypto-founder-randall/",
    "description": "In a recent development in crypto-related legal proceedings, the United States Court of Appeals for the First Circuit has upheld the conviction of Randall Crater, the founder of My Big Coin, a cryptocurrency project. Crater was found guilty of multiple charges, including wire fraud, unlawful monetary transactions, and operating an unlicensed money-transmitting business. Upholding conviction [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-26T21:01:24.000Z",
    "title": "WEEKLY CRYPTO PRICE ANALYSIS: BTC, ETH, BNB, SOL, XRP, ADA, And DOGE",
    "url": "https://www.cryptopolitan.com/weekly-crypto-price-analysis-2024-27-02/",
    "description": "Weekly crypto analysis indicates a varied performance among digital currencies, with alternating upward and downward trends. Stability with minor price changes characterizes the broader market, although some tokens have seen significant shifts. The optimistic outlook from investors reflects a belief in the enduring value of cryptocurrencies. Source: Coin360 Bitcoin continues to steer the market, recently [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-26T20:51:27.000Z",
    "title": "Institutions continue to flock to crypto investment products, surpassing $598M in weekly inflows",
    "url": "https://www.cryptopolitan.com/institutions-continue-to-flock-to-crypto/",
    "description": "Institutional investment in crypto remains robust, with digital assets manager CoinShares reporting a fourth consecutive week of significant inflows. According to the latest Digital Asset Fund Flows report by CoinShares, institutional investors injected a staggering $598 million into crypto investment products over the past week alone, bringing the year-to-date inflows close to the $6 billion [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-26T20:58:59.000Z",
    "title": "Lido Staked Ether takes over XRP in market cap as Ethereum reached $3.2k",
    "url": "https://crypto.news/lido-staked-ethereum-xrp-market-cap/",
    "description": "Lido Staked Ether has surpassed XRP to become the sixth-largest cryptocurrency, with a market cap of over $31 billion."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-26T21:00:12.000Z",
    "title": "Bitcoin Rally: Crypto Analyst Says New Peak Is Within Arms’ Reach",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-rally-crypto-analyst-predicts-new-peak-within-erms-reach/",
    "description": "With the price movement of Bitcoin becoming less volatile and the markets becoming unstable once more, some people think a crash is imminent for BTC, while some believe and anticipate a potential for further upward surge. New All-Time High For Bitcoin Is Within An Arms Reach In a recent development on the social media platform X (formerly Twitter), Cryptocurrency analyst and investor, Crypto Jelle, has shared a bold prediction regarding Bitcoin &#8211; the leading crypto asset. Related Reading: Bitcoin Bullish Outlook: Analyst Predicts Near-Term Surge To $61,000 The crypto expert&#8217;s analysis came in light of the bearish speculations within the community around the price action of BTC. According to him, many people are discussing the bearish signs, pullbacks, and corrections that BTC could witness in the near future. However, Crypto Jelle has asserted that despite the negative sentiments it &#8220;does not change anything about the bigger picture&#8221; for BTC. Furthermore, he has urged investors to &#8220;stick to the plan,&#8221; noting that a new all-time high is just &#8220;within arms reach.&#8221; The post read: Lots of people talking about bearish signs, pullbacks, and corrections, but these things change nothing about the bigger picture. Stick to the plan, all-time highs are within an arms reach. Jelle has also highlighted another reason why he is bullish on Bitcoin and sticking with the digital asset. In another X post, Jelle stated that BTC is still holding above $50,000, with the entire crypto market cap approaching $2 trillion. Nonetheless, the &#8220;average Joe still does not care,&#8221; prompting him to believe that &#8220;the cycle is not over&#8221; yet. He further pointed out that there will be lucid indications that retail is about to flood the market. As a result of this, Bitcoin is set to witness higher adoption as search interest for BTC will surge higher. Jelle anticipates that during this time, American-based crypto exchange Coinbase will return to its top spot in the app store. BTC Compared To Warren Buffett&#8217;s Berkshire Hathaway Stock Lately, a lot of market experts have appeared to be bullish about Bitcoin. One of these is Max Keiser, a BTC advocate, who has compared the crypto asset to the well-known Warren Buffett&#8217;s Berkshire Hathaway Stock. Related Reading: Crypto Platform Which Predicted Bitcoin To Reach $50,000 Has Released A New Target According to Max Keiser, acquiring BTC today is just like buying Berkshire Hathaway shares in its initial days. It is noteworthy that during its earlier days, the stocks were sold for $1,500 each, which is now being sold for $628,000. With this comparison, Keiser advocates that BTC could potentially rise by over 41,000% at its present price of $51,000.  This price of Bitcoin is down by over 2% in the past 7 days, currently trading at $51,147. CoinMarketCap&#8217;s data shows that its market cap is down by 0.86%, while its trading volume is up by over 6%. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-26T20:53:10.000Z",
    "title": "Aethir Unveils Its First Decentralized AI Node Sale",
    "url": "https://www.crypto-news-flash.com/aethir-unveils-its-first-decentralized-ai-node-sale/?utm_source=rss&utm_medium=rss&utm_campaign=aethir-unveils-its-first-decentralized-ai-node-sale",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/PR_1708593766DkI9lGzUgz.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/PR_1708593766DkI9lGzUgz.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/PR_1708593766DkI9lGzUgz-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/PR_1708593766DkI9lGzUgz-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/PR_1708593766DkI9lGzUgz-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/PR_1708593766DkI9lGzUgz-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Singapore, Singapore, February 26th, 2024, Chainwire Aethir, a leader in decentralized GPU cloud infrastructure, has announced its highly anticipated Node Sale. Aethir is an enterprise-grade, AI and Gaming-focused GPU-as-a-service provider. Aethir&#8217;s decentralized cloud computing infrastructure enables GPU providers to connect with enterprise clients who need the raw power of NVIDIA&#8217;s H100 chips for sophisticated AI/ML [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-26T20:47:17.000Z",
    "title": "Litecoin Investors Display Unshakeable Conviction with 2.4-Year Holding Average",
    "url": "https://www.crypto-news-flash.com/litecoin-investors-display-unshakeable-conviction-with-2-4-year-holding-average/?utm_source=rss&utm_medium=rss&utm_campaign=litecoin-investors-display-unshakeable-conviction-with-2-4-year-holding-average",
    "description": "<img width=\"1800\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Litecoin-LTC-on-mobile-Phone.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Litecoin-LTC-on-mobile-Phone\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Litecoin-LTC-on-mobile-Phone.jpg 1800w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Litecoin-LTC-on-mobile-Phone-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Litecoin-LTC-on-mobile-Phone-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Litecoin-LTC-on-mobile-Phone-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Litecoin-LTC-on-mobile-Phone-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Litecoin-LTC-on-mobile-Phone-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Litecoin-LTC-on-mobile-Phone-450x300.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Litecoin-LTC-on-mobile-Phone-1200x800.jpg 1200w\" sizes=\"(max-width: 1800px) 100vw, 1800px\" />Litecoin&#8217;s price rose by 6.4% in February, with long-term holders showing strong commitment, holding on for an average of 2.4 years, akin to Bitcoin. Despite slipping to 21st in market cap rankings, Litecoin remains resilient, trading at $69.90, with analysts expressing optimism for future price appreciation. Recent data analysis from IntoTheBlock demonstrates the Litecoin investors&#8217; [...]"
  }
]