[
  {
    "source": "Cryptopolitan",
    "date": "2023-11-28T03:04:29.000Z",
    "title": "Specialized LLMs to Revolutionize Enterprise Growth through Customization ",
    "url": "https://www.cryptopolitan.com/specialized-llms-enterprise-growth/",
    "description": "In the rapidly evolving landscape of Artificial Intelligence (AI), Generative AI stands out as a transformative force, revolutionizing industries globally. At the forefront of this revolution is Open AI&#8217;s GPT, a Large Language Model (LLM) that has redefined human-computer interactions. Despite the groundbreaking capabilities of LLMs, a significant gap exists between their potential and practical ... <a title=\"Specialized LLMs to Revolutionize Enterprise Growth through Customization \" class=\"read-more\" href=\"https://www.cryptopolitan.com/specialized-llms-enterprise-growth/\" aria-label=\"More on Specialized LLMs to Revolutionize Enterprise Growth through Customization \">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-28T02:45:26.000Z",
    "title": "Global Cybersecurity Agencies Advocate ‘Secure by Design’ Approach in AI Security Guidance",
    "url": "https://www.cryptopolitan.com/global-agencies-ai-security-guidance/",
    "description": "The U.K. National Cyber Security Center (NCSC) and the U.S. Cybersecurity and Infrastructure Security Agency (CISA), joined by 22 cyber partners worldwide, have unveiled a comprehensive set of guidelines for ensuring the security of artificial intelligence (AI) systems. Emphasizing a &#8220;secure by design&#8221; philosophy, the guidance delves into crucial aspects of AI development, aiming to ... <a title=\"Global Cybersecurity Agencies Advocate &#8216;Secure by Design&#8217; Approach in AI Security Guidance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/global-agencies-ai-security-guidance/\" aria-label=\"More on Global Cybersecurity Agencies Advocate &#8216;Secure by Design&#8217; Approach in AI Security Guidance\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-28T03:00:38.000Z",
    "title": "$3.1 Billion TUSD Stablecoin Shaky, Briefly Depegs—What’s Happening?",
    "url": "https://www.newsbtc.com/stablecoin/tusd-shaky-briefly-depegs/",
    "description": "TrueUSD (TUSD), a stablecoin with a market cap exceeding $3.1 billion, appears &#8220;shaky&#8221; and briefly depegged on November 22, dropping to as low as $0.9976 before restoring its peg. The temporary depeg was attributed to a deluge of selling orders, according to Kaiko, a blockchain analytics firm. TUSD Briefly Depegs, Large Selling Orders Rolling Through Riyad Carey, a researcher at Kaiko, noted that large sell orders, including one for $3 million, triggered the turbulence that caused the stablecoin&#8217;s price to dip below the dollar peg. This brief deviation resulted in users who redeemed TUSD receiving less USD. Ideally, any redemption of a fiat-backed stablecoin should result in a 1:1 reception of the collateral. The incident highlights the potential impact of large order blocks on liquidity and the potential for slippage. TUSD, theoretically backed by USD and issued by TrustToken, is popular in Binance, an exchange that delisted USDC and 2023. Because of this limitation, TUSD is one of the most liquid stablecoins paired with leading coins like Bitcoin (BTC). However, despite its popularity, it trails Tether (USDT), the world&#8217;s largest stablecoin by market cap.  The TEURO Mystery This depegging occurred a few weeks after tough security questions were raised about TUSD. In mid-October, the minter was forced to disclaim TEURO, a token deployed from the same address, suggesting that private keys associated with TUSD may have been compromised. Related Reading: Circle And SBI Holdings Partnership To Boost USDC In Japan Curiously, funds tied to TEURO, the fake token, were also linked to the deployment of TCNY, another fake token unaffiliated with TrueUSD. Following these incidents, the community began raising questions about the security of the stablecoin and, more importantly, its underlying infrastructure. This was expected, considering that a centralized entity issues TUSD though all transactions are on-chain.  Despite these challenges, TrueUSD maintains that its smart contracts are secure. The company emphasizes that it has gained ownership of the TUSD minting contract since the end of 2020. Related Reading: Analyst Sets $47,000 Target For Bitcoin If This Happens In early May 2023, TUSD depegged, rising to as high as $1.20 on multiple exchanges, particularly on Binance. This was attributed to an increase in activity on the SUI farming pool.  Still, this is not the first time popular stablecoins have depegged. In March 2023, USDC and DAI, two of the world&#8217;s largest stablecoins, depegged, leading to widespread fear in the market. However, the team restored parity. Moreover, to improve confidence, stablecoin issuers regularly publish attestation reports. Feature image from Canva, chart from TradingView"
  }
]