[
  {
    "source": "Cointelegraph",
    "date": "2023-07-18T22:13:27.000Z",
    "title": "Bitcoin price falls to $29.5K, but on-chain data reflects investors' growing interest",
    "url": "https://cointelegraph.com/news/bitcoin-price-falls-to-29-5k-but-on-chain-data-reflects-investors-growing-interest",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/8c55deb9-a162-4432-a8d1-8fdcdaa4bc84.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price dropped below $30,000 again today, but the recent crab market price action is also backed by compelling investor activity on-chain.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC)</a> price dropped below the $30,000 level on July 18, which given the developments of the last month, retail investors may not have expected, but does today’s downside move represent an upcoming shift in the trend? </p><p>Data suggests that over the longer-term it does not. </p><p>To get to the positives first, Bitcoin price is still attempting to flip the $30,000 level to support after about 10 attempts since April of this year, but price is continuously finding buyers in the $28,000 to $25,000 range which buyers seem to be viewing as an accumulation zone.</p><p>On-chain data from Glassnode’s Bitcoin Accumulation Trend Score supports this sentiment and could be a positive, depending on how investors’ look at things given that the behavior of investors at $30,000 BTC price mirrors the same accumulation behavior seen in the $28,000 to $24,000 zone and the near the supposed $16,800 bottom. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/a7513e76-9201-4525-8a93-26c60da5f367.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Accumulation Trend Score. Source: glassnode</em></figcaption></figure><p>According to glassnode, “an Accumulation Trend Score of closer to 1 indicates that on aggregate, larger entities (or a big part of the network) are accumulating, and a value closer to 0 indicates they are distributing or not accumulating.”</p><p>Basically, buyers strongly accumulated from Nov. 2022 to Dec. 2022 and they were heavy accumulators from March to April 2023 when BTC recaptured $30,000 and the metric suggests they are doing the same in July as BTC attempts to either conquer the $30,000 resistance or received a boost from all the ETF and <a href=\"https://cointelegraph.com/news/lawmaker-calls-sec-chair-reassess-stance-crypto-following-ripple-ruling\">XRP SEC news</a>.</p><h2>Bitcoin is in a crab market</h2><p>The current price action and derivatives market data suggest that Bitcoin is in a crab market, where price remains range bound and consolidates for a prolonged period of time. As JLabs analyst JJ the Janitor pointed out last week, a strong push through the $32,000 level would catalyze a CME gap fill from the Luna Terra-crash era. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/d65a5d0f-fc10-453c-b437-22ac56c35e36.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin CME Futures showcasing Luna crash CME Gap. Source: JJ The Janitor</em></figcaption></figure><p>From the perspective of Bitcoin’s weekly market structure, the $30,000 level is an important pivot point that has functioned as support in the previous bull market cycle (and now as resistance) but a grab above that level would essentially set a higher high on the longer time frame and be confirmation of a trend reversal where the next point of resistance is around the $37,000 level. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/553463fa-6f8a-45a3-a352-f221a3bf802b.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT 1-week chart. Source: TradingView</em></figcaption></figure><p>Traders’ activity in the derivatives market is another factor contributing to the current crab market. Funding is down, open interest is relatively muted and besides retail plebs who are attempting to long breakouts and long lower support retests, or short breakouts and getting liquidated in both instances, a meaningful surge in these metrics that would inspire confidence that price is on the verge of some massive breakout has yet to emerge.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/de125d17-b5cb-4808-bdc5-e2bb7791dea3.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT derivatives data, daily chart. Source: JJ The Janitor</em></figcaption></figure><p>Sure, <a href=\"https://cointelegraph.com/news/btc-traders-30k-5-things-bitcoin-this-week\">DXY took a dip below 100</a> last week but I think that’s more connected to investors reacting to the Fed’s positive steps on inflation and too tight of a timeframe to expect some massive reaction from BTC immediately. </p><p>The price action in crypto exchange futures highlights degen longs and shorts trying to get ahead of price breakouts and that they are not having much success in the short term. </p><p>JJ the Janitor suggests that a metric to watch is aggregate open interest, if that breaks down sharply from the current range then some true buy the dip opportunities could emerge. Currently, it’s still in an uptrend, albeit sideways, but seeing a surge in OI could also be interesting and likely news, regulatory or legislative event driven. </p><p><em><strong>Related:</strong> </em><a href=\"https://cointelegraph.com/news/bitcoin-price-falls-under-30k-as-macro-and-regulatory-worries-take-center-stage\"><strong><em>Bitcoin price falls under $30K as macro and regulatory worries take center stage</em></strong></a></p><p>While Bitcoin’s short-term price action might raise some concern among newer investors and day-traders, the on-chain perspective remains quite compelling. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> Long-Term Holder Supply remains at an ATH of 14.5M BTC. This suggests mature investors are preferring to accumulate Bitcoin, rather than distribute. <a href=\"https://t.co/VkY9uTAVGG\">pic.twitter.com/VkY9uTAVGG</a></p>&mdash; glassnode (@glassnode) <a href=\"https://twitter.com/glassnode/status/1681297865346547712?ref_src=twsrc%5Etfw\">July 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>At the same time, the Total Balance in Accumulation Addresses metric has also resumed its uptrend since March 16, when BTC price traded at $25,000. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/106b0543-d6ea-44ad-a100-a04bb1477642.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Total Balance in Accumulation Addresses (BTC). Source: glassnode</em></figcaption></figure><p>Readers should also note that the metric also shows the total balance in accumulation addresses increasing since January 2022, when Bitcoin price was trading at $47,800 per coin. What is apparent is that through the worst of the crypto market collapse and Bitcoin price sell-off, multiple on-chain metrics show investors continuing to increase their allocation to BTC. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-18T22:21:43.000Z",
    "title": "Historic Vitalik Buterin portrait from 2014 being auctioned as NFT",
    "url": "https://cryptoslate.com/historic-vitalik-buterin-portrait-from-2014-being-auctioned-as-nft/",
    "description": "<p>Celebrated Canadian photographer Andrew Miller has announced an exclusive auction of the first professional and never-before-sold portrait of Ethereum founder Vitalik Buterin, tokenized as an NFT. The auction coincides with the 10th anniversary of the Ethereum concept, the open-source, decentralized blockchain recognized globally for its smart contract functionality. The auction is set to commence on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/historic-vitalik-buterin-portrait-from-2014-being-auctioned-as-nft/\">Historic Vitalik Buterin portrait from 2014 being auctioned as NFT</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  }
]