[
  {
    "source": "Cointelegraph",
    "date": "2024-01-18T11:19:37.000Z",
    "title": " Thailand opens doors to retail investments in infrastructure-backed digital tokens ",
    "url": "https://cointelegraph.com/news/thailand-eases-restrictions-infrastructure-backed-digital-tokens",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZjE2NDVjZGEtNzNkNS00ZTQ4LTliZWUtMTNmM2I4OWVlMTU5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The new rules cancel the previous limit of 300,000 baht ($8,500) for retail investors concerning investments in digital tokens backed by real estate or infrastructure. </p>\n                    <p><p>Thailand's Securities and Exchange Commission (TSEC) has lifted restrictions on retail investors purchasing digital tokens backed by real estate or infrastructure projects. Previously, retail investors were limited to investing a maximum of 300,000 baht ($8,500) in these types of tokens. </p><p>The updated rules, <a href=\"https://www.sec.or.th/TH/Pages/News_Detail.aspx?SECID=10459\" target=\"_blank\" rel=\"noopener nofollow\">published in the Royal Gazette</a> on January 16, 2024, remove this limit, allowing retail investors to invest more freely in the real estate and infrastructure-backed digital token (REIT) market.</p><p>The TSEC's decision to lift the investment limit comes as the country's cryptocurrency market is gaining momentum. In September 2023, Thailand's largest bank, KBank, <a href=\"https://cointelegraph.com/news/thailand-kasikorn-bank-crypto-satang\">acquired the crypto exchange business Satang</a>, signaling the growing acceptance of digital assets in the Thai financial system.</p><p><a href=\"https://cointelegraph.com/news/thailand-eases-restrictions-infrastructure-backed-digital-tokens\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-18T11:12:30.000Z",
    "title": "Texas freeze leads to dip in Bitcoin hash rate",
    "url": "https://cryptoslate.com/insights/texas-freeze-leads-to-dip-in-bitcoin-hash-rate/",
    "description": "<p>Quick Take Bitcoin&#8217;s hash rate is currently experiencing a 6% dip from its all-time high of approximately 545 eh/s. On a 7-day moving average, it stands at around 513 eh/s. This noticeable downturn can likely be attributed to the freezing temperatures in Texas leading to power adjustments, as Pierre Rochard, VP of Research at Riot [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/texas-freeze-leads-to-dip-in-bitcoin-hash-rate/\">Texas freeze leads to dip in Bitcoin hash rate</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-18T11:11:20.000Z",
    "title": "Algorand’s New Update Speeds Up Block Time By 20%",
    "url": "https://cryptodaily.co.uk/2024/01/algorands-new-update-speeds-up-block-time-by-20",
    "description": "The latest Dynamic Lambda upgrade on the Algorand blockchain has successfully sped up the process by shaving off 20% of the block time."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T11:35:18.000Z",
    "title": "Rocket Boy Secures $110M Funding for Ambitious Gaming Ventures",
    "url": "https://www.cryptopolitan.com/rocket-boy-secures-110m-funding/",
    "description": "Build A Rocket Boy, the Edinburgh-based gaming studio founded by Leslie Benzies has secured over $110 million in a series D funding round, paving the way for the launch of its ambitious projects. RedBird Capital Partners led the recent funding round, bringing their extensive experience in media and entertainment investments.&#160; Julia Wittlin, a partner at [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T11:34:35.000Z",
    "title": "DePIN: Introducing PKT and the PKT Network",
    "url": "https://www.cryptopolitan.com/depin-introducing-pkt-and-the-pkt-network/",
    "description": "PKT is a decentralized physical infrastructure (DePIN) ecosystem built to support the decentralized web. TL;DR PKT refers to both the PKT Network and its native coin. It is a decentralized physical infrastructure (DePIN) blockchain and wifi mesh network that launched on August 19, 2019. The PKT cryptocurrency is a community coin with no central server [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T11:19:38.000Z",
    "title": "South Korea reviews crypto tax policy amid financial reforms",
    "url": "https://www.cryptopolitan.com/south-korea-reviews-crypto-tax-policy/",
    "description": "South Korea is evaluating the possibility of amending its tax regulations concerning cryptocurrency gains, aligning them with broader changes in the country&#8217;s financial investment taxation policies. This development comes as the nation prepares to implement a new tax regime for financial investments to foster wealth accumulation and prudent financial planning among its citizens. Implications of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T11:15:54.000Z",
    "title": "Polkadot Price Prediction 2024-2033: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T11:15:00.000Z",
    "title": "Binance Coin Price Prediction 2024-2033: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2024-2033 After notable changes in its executive team, Binance has shown notable resilience and prospects for recovery. The departure of Changpeng Zhao, Binance&#8217;s CEO, who was also embroiled in legal challenges, initially caused a decline in the value of Binance Coin (BNB). Despite this initial setback, the cryptocurrency has shown a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T11:13:26.000Z",
    "title": "Supreme Court hears argument on cryptocurrency regulation",
    "url": "https://www.cryptopolitan.com/supreme-court-hears-argument-cryptocurrency/",
    "description": "In a recent Supreme Court case, attorney Paul D. Clement has drawn attention to the urgent need for congressional action regulating cryptocurrencies. The case, Loper Bright Enterprises et al. v. Gina Raimondo, has ignited a legal debate surrounding the oversight and regulation of the rapidly evolving cryptocurrency industry.&#160; Ripple CTO David Schwartz shared Clement&#8217;s statements, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-18T11:36:41.000Z",
    "title": "Manta Network addresses RPC flood, amidst MANTA airdrop hype",
    "url": "https://crypto.news/manta-network-addresses-rpc-flood-amidst-manta-airdrop-hype/",
    "description": "Manta Network successfully navigates RPC flood on the Manta Pacific chain, ensuring uninterrupted blockchain functionality and user service continuity. Manta Network, a Layer 2 modular blockchain, recently confronted a technical disturbance within its Manta Pacific chain triggered by an RPC&#8230;"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-18T11:21:11.000Z",
    "title": "Trump Rejects Using a CBDC in the US",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/trump-rejects-using-a-cbdc-in-the-us/",
    "description": "<p>Trump declared that he would never allow the implementation of a Central Bank Digital Currency under his watch. He referred to a multitude in New Hampshire. Let&#8217;s discover more about what Trump thinks about implementing a CBDC. Diverse Concerns: From Economic Stability to Personal Privacy He argues that using a CBDC could threaten the liberty [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/trump-rejects-using-a-cbdc-in-the-us/\">Trump Rejects Using a CBDC in the US</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-18T11:20:00.000Z",
    "title": "Analyst Downplays Chances of a SHIB ETF, Says Size and Volume Too Low",
    "url": "https://coinedition.com/analyst-downplays-chances-of-a-shib-etf-says-size-and-volume-too-low/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Analyst Downplays Chances of a SHIB ETF, Says Size and Volume Too Low\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent video, Clay, the host of the cryptocurrency YouTube channel ClayBro, explained why the Shiba Inu community may have to wait longer to see the launch of a Shiba Inu exchange-traded fund (ETF).&#160; Following the launch of spot Bitcoin ETFs, chances of other crypto-focused ETFs have since raised optimism among several communities. As [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/analyst-downplays-chances-of-a-shib-etf-says-size-and-volume-too-low/\">Analyst Downplays Chances of a SHIB ETF, Says Size and Volume Too Low</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]