[
  {
    "source": "CoinDesk",
    "date": "2023-07-11T17:42:59.000Z",
    "title": "EthCC and Crypto's Latent Biases",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/11/ethcc-and-cryptos-latent-biases/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A major Ethereum conference set for Paris is not drawing the same criticisms and concerns around last year's DevCon in Bogota, Colombia. If the industry wants to grow, it must take a truly global perspective."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-11T17:49:22.000Z",
    "title": "Bitcoin ETF hopium fades as on-chain and futures data reflect traders’ muted activity ",
    "url": "https://cointelegraph.com/news/bitcoin-etf-hopium-fades-as-on-chain-and-futures-data-reflect-traders-muted-activity",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/90d129a6-de94-4b2b-89c9-356c4f8433dc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price soared on investors’ ETF hopes, but on-chain and derivatives metrics indicate a limited inflow of new investors</p>\n                    <p><p>The price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has been trading between $29,900 and $31,160 for the past 18 days, causing concern among investors who are looking for explanations for the lack of a clear trend. </p><p>After a 25.5% rally between June 15 and June 23 leading to Bitcoin’s highest level in 13 months one would expect investors to become more active and optimistic, but the lack of BTC’s ability to sustain prices above $31,000 and neutral on-chain and derivatives data do not corroborate this thesis.</p><h2>Bitcoin ETF expectations faced a harsh regulatory environment</h2><p>The current price situation is particularly worrisome because of the expectations that arose after BlackRock, the world's largest fund manager, <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner\">applied for a spot Bitcoin ETF on June 16</a>. Some analysts have predicted a Bitcoin price of $100,000 by the end of the year, adding to the frustration of traders who are betting on further gains.</p><p>It's worth noting that in mid-April, investors experienced a consolidation of prices around $30,000, but it didn't last longer than a week, and the price <a href=\"https://cointelegraph.com/news/bitcoin-ignores-us-jobs-data-as-btc-price-dip-puts-28k-support-at-risk\">eventually dropped to $28,000</a>. This movement explains why investors are hesitant to build positions at the current price levels and prefer range trading.</p><p>Despite the initial excitement about the possibility of the U.S. Securities and Exchange Commission (SEC) approving a Bitcoin instrument for traditional finance markets, there's negative price pressure due to the <a href=\"https://cointelegraph.com/news/sec-targeting-coinbase-binance-proxies-crypto\">regulatory actions against leading exchanges</a> like Coinbase and Binance.</p><p>This combination of positive triggers and a stricter regulatory environment is likely the main cause of Bitcoin's recent price movement, and analyzing blockchain data could provide insights into the network's use.</p><h2>Bitcoin on-chain activity does not show a significant improvement in activity</h2><p>When it comes to blockchain-based analysis, network activity should be the starting point. This analysis should entail looking beyond just trading and exchange flows. Cryptocurrencies were designed to facilitate free transactions and the registration of digital assets, so the number of active users is crucial.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/251f9a0e-322d-4579-a941-94a4f5f48367.png\"  /><figcaption style=\"text-align: center;\"><em>7-day average active Bitcoin address. Source: CoinMetrics</em></figcaption></figure><p>Bitcoin's 7-day active addresses have failed to exceed 1 million, only reaching the same levels as three months ago. Moreover, the peak of 1.02 million addresses in April 2023 was 16% lower than the all-time high in January 2021. Therefore, on-chain data indicates a stagnation in the number of active users on the Bitcoin network, using addresses as a proxy.</p><p>One might argue that reclaiming the level of active addresses back in April 2023 is good enough, but to evaluate the demand from institutional investors one should analyze the network's address count with a minimum of 100 Bitcoin, which is worth over $3 million at current price levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/65b0c4d1-b85d-467b-942a-300bcc0a35ee.png\"  /><figcaption style=\"text-align: center;\"><em>Addresses holding over 100 BTC. Source: CoinMetrics</em></figcaption></figure><p>Upon closer examination, it becomes evident that the indicator has remained unchanged for the past few months in 15,900 addresses. This suggests that there hasn't been an increase in the number of whales accumulating Bitcoin during that period. </p><p>Considering this, along with the fact that active addresses haven't reached new highs, on-chain metrics suggest that the ETF launch hasn't yet triggered a bullish momentum.</p><h2>Bitcoin derivatives improve but are majority neutral</h2><p>To confirm whether the price reflects stagnant network activity, one should analyze Bitcoin derivatives metrics and measure the demand for leverage from professional traders. In neutral markets, Bitcoin <a href=\"https://cointelegraph.com/explained/margin-trading-vs-futures-what-are-the-differences\">quarterly futures contracts</a> typically trade at a 5 to 10% annualized premium, known as contango, which is not unique to crypto markets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/ea09421c-cfa9-4a69-9e2d-5a87579f44bc.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 3-month futures contracts premium. Source: Laevitas.ch</em></figcaption></figure><p>The Bitcoin futures premium crossed the neutral 5% threshold on June 26, just five days after the $30,000 support level was breached. It took investors a <a href=\"https://cointelegraph.com/news/bitcoin-futures-premium-18-month-high-flip-bullish/amp\">full 18 months to turn bullish</a> using leveraged long positions, reaching the highest price point since June 2022. This significantly increases the likelihood of liquidations and panic selling if the Bitcoin price drops by 8% in a short period.</p><p>Looking at the options markets is also helpful, as the 25% delta skew is a telling sign of when arbitrage desks and market makers overcharge for upside or downside protection. In essence, if traders anticipate a Bitcoin price drop, the skew metric will rise above 7%, and phases of excitement tend to have a negative 7% skew.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/d1e6dd63-5b9b-4fd0-a24d-d0bcb0a9a765.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin options 25% delta skew. Source: Laevitas.ch</em></figcaption></figure><p>However, the 25% delta skew failed to sustain levels below the neutral threshold for more than four days. The only period of moderate bullishness, according to the options pricing indicator, was from July 1 to July 5. The current balanced demand between call and protective put options indicates a lack of confidence from professional traders.</p><p>These findings are particularly disappointing considering that senior Bloomberg analysts estimated a <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-grayscale-sec\">50% chance of Bitcoin ETF approval</a>. After the recent price rally above $30,000, one would expect on-chain and derivatives data to reflect more optimism, which might be influenced by Bitcoin's price being 56% below its all-time high, or the impending court rulings against the exchanges. </p><p>Ultimately, at the moment, on-chain and derivatives data fail to support the bullish momentum to sustain further price gains.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T18:08:37.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T17:58:44.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here&#8217;s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T17:50:22.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T17:45:41.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-11T18:00:30.000Z",
    "title": "ConsenSys To Launch Linea, Its ZK-Rollup Network, On Main Ethereum Network",
    "url": "https://www.newsbtc.com/news/ethereum/consensys-to-launch-linea-its-zk-rollup-network-on-main-ethereum-network/",
    "description": "MetaMask developer ConsenSys plans to deploy its layer-2 network, Linea, on the main Ethereum network this week. Linea incorporates the use of zero-knowledge (ZK) cryptography, which is regarded as one of the most significant blockchain trends of the year. Zero-knowledge (ZK) cryptography, provides more cost-effective and expedited blockchain transactions. This layer-2 network aims to improve scalability and transaction processing on Ethereum, addressing network congestion and high gas fees. According to ConsenSys, the fee rates for transactions on Linea will be 15 times lower than those on Ethereum main network. The roll-up network implemented by Linea is commonly referred to as zkEVM, which stands for zero-knowledge Ethereum Virtual Machine. This roll-up network is designed to be fully compatible with the Ethereum Virtual Machine (EVM) programming environment. Roll-ups are also regarded as a crucial component of Ethereum&#8217;s development plan. Related Reading: Bulls Remain Resilient Despite Litecoin’s Fall Below $100, Key Levels To Watch Linea is being launched following a successful testnet phase, during which 5.5 million unique wallets performed over 46 million transactions in three months. According to ConsenSys, this achievement makes Linea one of the most active initiatives on Ethereum&#8217;s Goerli testnet. App developers can deploy their projects to Linea&#8217;s &#8220;alpha&#8221; network on Friday, and the general public will have access to it starting next week. Key Features Of Linea&#8217;s Alpha Mainnet Phase Linea has introduced several significant upgrades with the release of its alpha mainnet stage. This includes a new outer-proof system and a dynamic fee mechanism. Linea&#8217;s alpha mainnet stage includes a feature called batch conflation. This feature optimizes the number of layer-2 transactions and blocks that can fit into a layer-1 submitted batch. By doing so, Linea is able to reduce the fixed costs associated with layer 1 and provide a more cost-effective transaction experience. Ethereum was priced at $1,860 on the one-day chart &#124; Source: ETHUSD on TradingView In addition to the lower transaction fees, the launch of Linea&#8217;s alpha mainnet stage is expected to reduce friction for developers and improve onboarding with fast finality, a capital-efficient bridge, and inherited Ethereum security. These upgrades will enable Linea to offer transaction costs that are substantially cheaper than Ethereum&#8217;s base layer. MetaMask To Include Linea Support As Well MetaMask, a wallet offered by Consensys, will also support Linea soon. It will allow users to access the network through MetaMask Portfolio and its Bridge, Swap, and Buy features. The integration is expected to be rolled out in the coming weeks and MetaMask users will be able to interact with Linea&#8217;s decentralized applications and protocols with ease. Related Reading: Dogecoin (DOGE) Price Downtrend Set To Persist – What To Expect ConsenSys has also announced the Linea Ecosystem Investment Alliance (EIA). The EIA aims to support developers and builders by providing funding and resources, in addition to the launch of Linea Mainnet Alpha. Featured image from The Information, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-11T18:05:09.000Z",
    "title": "Rich Dad Poor Dad Author Makes Huge 2024 Bitcoin Prediction Amid BRICS Push To Dethrone Dollar",
    "url": "https://dailyhodl.com/2023/07/11/rich-dad-poor-dad-author-makes-huge-2024-bitcoin-prediction-amid-brics-push-to-dethrone-dollar/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/bank-whipped-up-frenzy.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/bank-whipped-up-frenzy.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/bank-whipped-up-frenzy.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/bank-whipped-up-frenzy.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/bank-whipped-up-frenzy.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/bank-whipped-up-frenzy.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/bank-whipped-up-frenzy.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The author of personal finance best-seller Rich Dad Poor Dad is making a huge Bitcoin (BTC) prediction for next year as efforts to dethrone the dollar advance. Robert Kiyosaki tells his 2.4 million Twitter followers that he believes the king crypto will soar to $120,000 in 2024, a more than 290% increase from its current [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/11/rich-dad-poor-dad-author-makes-huge-2024-bitcoin-prediction-amid-brics-push-to-dethrone-dollar/\">Rich Dad Poor Dad Author Makes Huge 2024 Bitcoin Prediction Amid BRICS Push To Dethrone Dollar</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]