[
  {
    "source": "Cointelegraph",
    "date": "2023-05-30T20:32:42.000Z",
    "title": "Crypto exchange Bybit exits Canada, citing 'recent regulatory development'",
    "url": "https://cointelegraph.com/news/crypto-exchange-bybit-exits-canada-citing-recent-regulatory-development",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/cf45cf0c-a999-43a9-9502-9f8636c6bb82.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Headquartered in Dubai, Bybit plans to leave Canada while exploring expanding into new markets like Kazakhstan.</p>\n                    <p><p>Cryptocurrency exchange Bybit has announced it will be pausing its products and services to residents and nationals of Canada following certain developments in the regulatory space.</p><p>In a May 30 blog post, Bybit <a href=\"https://announcements.bybit.com/article/notice-on-exit-from-canadian-market-bltc1bfb8746d077fda/#\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it will not accept account opening applications from Canadians starting on May 31. Current users of the crypto exchange will have until July 31 to make deposits and “increase any of their existing positions” before these services are phased out, with other positions liquidated after Sept. 30. </p><p>Bybit did not offer any explanation for the market exit other than “recent regulatory development” in Canada. The Ontario Securities Commission <a href=\"https://cointelegraph.com/news/canadian-regulator-takes-enforcement-actions-against-bybit-and-kucoin\">issued financial penalties</a> against the exchange in June 2022, and Bybit said it planned to <a href=\"https://cointelegraph.com/news/bybit-to-introduce-mandatory-kyc-requirements-starting-may-8\">introduce mandatory Know Your Customer requirements</a> for all users starting in May 2023. </p><p>“As the adoption of crypto continues to grow, our mission is to provide safer and sustainable trading experience to all crypto enthusiasts while maintaining necessary safeguards.” said Bybit.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bybit-crypto-exchange-launches-crypto-lending-services\"><strong><em>Bybit joins crypto exchanges offering crypto lending services</em></strong></a></p><p>Headquartered in Dubai, Bybit plans to exit Canada came amid the exchange expanding into new markets. On May 29, the company <a href=\"https://cointelegraph.com/news/bybit-crypto-exchange-in-principal-approval-in-kazakhstan\">said it had received</a> “in-principle” approval from regulators in Kazakhstan. This move followed Bybit introducing cryptocurrency lending services.</p><p>Bybit was the latest crypto firm to announce it would be pulling out of Canada in light of regulations. In April, decentralized exchange dYdX <a href=\"https://cointelegraph.com/news/decentralized-exchange-dydx-announces-winding-down-of-services-for-canadian-users\">announced a “winding down” of its services</a> for Canadian users in response to the country’s “regulatory climate.” Major crypto exchange Binance <a href=\"https://cointelegraph.com/news/binance-calls-it-quits-in-canada-blames-new-rules\">said in May</a> it was “proactively withdrawing” from Canada, citing rules by the Canadian Securities Administrators.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-city-ultimate-guide-toronto/\"><strong><em>Your guide to crypto in Toronto: Crypto City</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-30T20:24:12.000Z",
    "title": "SEC settles Coinbase insider trading scheme charges with Wahi brothers",
    "url": "https://cryptoslate.com/sec-settles-coinbase-insider-trading-scheme-charges-with-wahi-brothers/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) said on May 30 that it has settled with two individuals involved in a Coinbase insider trading scheme. SEC settlement The SEC said that Ishan Wahi, formerly a product manager at Coinbase, and his brother Nikhil Wahi settled the relevant charges. The regulator alleged that Ishan Wahi informed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-settles-coinbase-insider-trading-scheme-charges-with-wahi-brothers/\">SEC settles Coinbase insider trading scheme charges with Wahi brothers</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T20:32:10.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T20:30:09.000Z",
    "title": "Polkadot price analysis: DOT maintains value at $5.45",
    "url": "https://www.cryptopolitan.com/polkadot-price-analysis-2023-05-30/",
    "description": "Polkadot price analysis reveals a relatively upbeat approach today; the price has gained most of its lost value. In recent days, there has been a noticeable surge in the prevailing market sentiment favoring the cryptocurrency DOT (Polkadot), resulting in a substantial appreciation of its value. Specifically, on May 29, there was an abrupt increase in its ... <a title=\"Polkadot price analysis: DOT maintains value at $5.45\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-analysis-2023-05-30/\" aria-label=\"More on Polkadot price analysis: DOT maintains value at $5.45\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T20:21:52.000Z",
    "title": "Cardano price analysis: ADA continues positive movement with $0.40 resistance in sight",
    "url": "https://www.cryptopolitan.com/cardano-price-analysis-2023-05-30/",
    "description": "Cardano price analysis shows a positive uptrend taking shape, as price over the past 24 hours rose slightly to reach up to $0.38. ADA has been trending upwards since touching the support zone at $0.35 on May 26, and inclined over 5 percent in a single day on May 28. Now, bulls will be looking ... <a title=\"Cardano price analysis: ADA continues positive movement with $0.40 resistance in sight\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-analysis-2023-05-30/\" aria-label=\"More on Cardano price analysis: ADA continues positive movement with $0.40 resistance in sight\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-30T20:30:06.000Z",
    "title": "Avalanche Price At Critical Support Level: What Direction Lies Ahead?",
    "url": "https://www.newsbtc.com/avalanche/avalanche-price-at-critical-support-level-what-direction-lies-ahead/",
    "description": "Despite the lingering bearish sentiment in the market, the Avalanche (AVAX) price has shown some upward movement. AVAX is hovering around a significant support line that has historically propelled its price in previous months. AVAX has experienced a slight 0.1% downward movement on the daily chart, while the weekly chart reflects a loss of approximately 2% in value. Related Reading: Polkadot Experiences Correction After Reaching $5.54: What’s Next In Store? Technical indicators for Avalanche indicate a bearish influence, with demand and accumulation remaining low. For buyers to regain confidence in the market, AVAX must maintain its support level and attempt to break through its resistance level. The appreciation of Bitcoin has also influenced altcoins, prompting some attempts at price increases. However, if Bitcoin&#8217;s price falls below the $27,500 mark, it is unlikely that Avalanche will be able to surpass its next price ceiling. On the other hand, if AVAX manages to break through the overhead resistance, it may experience a rally. The decrease in the AVAX market capitalization suggests that selling pressure still exists in the market. Avalanche Price Analysis: One-Day Chart At the time of writing, AVAX was priced at $14.48. If sellers do not exert further pressure, the altcoin will likely make gradual progress on its chart. The immediate overhead resistance for AVAX is set at $14.70, and surpassing this level could pave the way for further upward movement toward $15 and beyond. On the other hand, a decline from the current price level could bring AVAX down to $14 and potentially lower. However, if buyers step in and provide a slight push, AVAX bulls can strengthen their position in the market. The trading volume of AVAX in the last session was in red, indicating that selling strength was influencing the price action. Technical Analysis Throughout May, AVAX has experienced a lack of positive demand. The Relative Strength Index (RSI) has remained below the 50-mark, indicating that sellers have outnumbered buyers. The consistent rejection at the current price level could further diminish demand. Furthermore, AVAX has fallen below the 20-Simple Moving Average (SMA) line, suggesting that sellers have been dictating the price momentum at the time of writing. This indicates a bearish sentiment in the market. In line with other technical indicators, the buy signal for AVAX has been diminishing. The Moving Average Convergence Divergence (MACD) indicator, which measures price momentum and reversals, has shown declining green histograms, indicating a decrease in buy signals. Additionally, the Bollinger Bands, which depict price volatility and the potential for price fluctuations, have significantly narrowed. This suggests that AVAX may experience a period of consolidation, with the potential for explosive price action in the upcoming trading sessions. Related Reading: Rare Crypto Signal Emerges That Could Spark Another 2017-Style Boom If AVAX can maintain its position above the current price level, there is a possibility that it might attempt a rally. However, the success of this rally will depend largely on the overall strength of the broader market and the support from buyers. Featured Image From UnSplash, Charts From TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-30T20:19:37.000Z",
    "title": "Live Coin Watch App: Your One-Stop Destination for Crypto Analytics",
    "url": "https://coinedition.com/live-coin-watch-app-your-one-stop-destination-for-crypto-analytics/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Live-coin-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Live-coin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Live-coin-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Live-coin-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Live-coin-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Live-coin-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Live-coin-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Live-coin.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>After a successful launch of its popular iOS app, Live Coin Watch is thrilled to unveil its mobile app for Android, now available for free on Google Play. The native app is designed to cater to the requirements of both proficient and novice cryptocurrency enthusiasts by offering a comprehensive range of advanced features that are [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/live-coin-watch-app-your-one-stop-destination-for-crypto-analytics/\">Live Coin Watch App: Your One-Stop Destination for Crypto Analytics</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]