[
  {
    "source": "CoinDesk",
    "date": "2023-06-05T18:58:55.000Z",
    "title": "BNB, CAKE Plummet Following SEC Crackdown on Binance",
    "url": "https://www.coindesk.com/markets/2023/06/05/bnb-cake-plummet-following-sec-crackdown-on-binance/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Both are significant tokens in the Binance ecosystem and had their prices drop by more than 8% over a four-hour period."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T19:08:15.000Z",
    "title": "Pro-XRP lawyer tips Ripple’s triumph over SEC at less than 3%",
    "url": "https://www.cryptopolitan.com/pro-ripple-lawyer-tips-win-over-sec-at-3/",
    "description": "According to pro-Ripple attorney John Deaton, the Securities and Exchange Commission&#8217;s (SEC) chances of succeeding in its legal battle against Ripple are less than 3%. According to the attorney, Ripple has a 25% chance of outright victory over the SEC and a 50% chance of winning by &#8220;splitting the baby.&#8221; The verdict rendered by Judge ... <a title=\"Pro-XRP lawyer tips Ripple&#8217;s triumph over SEC at less than 3%\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pro-ripple-lawyer-tips-win-over-sec-at-3/\" aria-label=\"More on Pro-XRP lawyer tips Ripple&#8217;s triumph over SEC at less than 3%\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T18:51:04.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-05T19:00:51.000Z",
    "title": "Bitcoin Current Position Is Sensitive, Glassnode Explains Why",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-current-position-sensitive-glassnode-explains-why/",
    "description": "Data from Glassnode shows that the current Bitcoin price is where the cost basis of a large number of coins lies. Here’s what this means. 780,000 BTC Was Acquired Near The Current Spot Prices According to data from the on-chain analytics firm Glassnode, 4.6% of the entire circulating Bitcoin supply has its acquisition price near the current spot prices of the asset. The relevant indicator here is the “entity-adjusted UTXO Realized Price Distribution (URPD),” which, in simple terms, tells us about how the cost basis of the investors is distributed right now. The cost basis here refers to the price at which they bought their coins, so this distribution shows us at which price how many coins were acquired by the holders. Note that this indicator has been adjusted for entities, meaning that all internal movements between the wallets owned by a single investor are removed from this data (an “entity” refers to a collection of addresses that Glassnode has identified to belong to the same holder). Naturally, this adjustment has been made because any movement between the addresses of the same entity would otherwise count as a sale. Thus, a fresh cost basis would be given to the investor (when in reality, it wouldn’t be so). Related Reading: Bloomberg’s Senior Macro Strategist Predicts More Pain Ahead For Bitcoin Now, here is a chart that shows what the URPD in the Bitcoin market looks like right now: Looks like the levels around the current price have a large amount of coins concentrated &#124; Source: Glassnode on Twitter As highlighted in the above graph, the levels around the current spot price of the cryptocurrency seem to be the largest center of cost basis in the market right now. In total, 780,000 tokens were purchased at these prices, which amount to around 4.6% of the entire circulating supply of the cryptocurrency. Because of this reason, the current price range that Bitcoin is trading in might be crucial for where the asset could go from here. Related Reading: Bitcoin Price Topside Bias Vulnerable If It Continues To Struggle Below $28K “With such large swathes of Bitcoin concentrated within a tight price range, a move in either direction would send a significant amount of coins into a position of profit or loss, highlighting the acute sensitivity of our current position,” explains Glassnode. Major cost basis centers have historically played a notable role in the market because they act as important psychological levels. During bearish trends, investors prefer to sell when the prices fall to their cost basis, as they want to avoid getting into a loss. Similarly, holders prefer to buy more at their cost basis during bullish trends, considering it a profitable buying opportunity. It remains to be seen how the market will respond to the current situation in the coming days. BTC Price At the time of writing, Bitcoin is trading around $26,000, down 5% in the last week. The value of the asset seems to have plunged down during the past day or so &#124; Source: BTCUSD on TradingView Featured image from Thought Catalog on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-05T18:45:37.000Z",
    "title": "About Half of Crypto Hacks and Exploits in May Targeted BNB Chain, According to DappRadar",
    "url": "https://dailyhodl.com/2023/06/05/about-half-of-crypto-hacks-and-exploits-in-may-targeted-bnb-chain-according-to-dappradar/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/bnb-roadmap-faster.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/bnb-roadmap-faster.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/bnb-roadmap-faster.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/bnb-roadmap-faster.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/bnb-roadmap-faster.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/bnb-roadmap-faster.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/bnb-roadmap-faster.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New data reveals that 50% of all crypto hacks and exploits during the month of May targeted BNB Chain (BNB), the blockchain of Binance, the world’s largest crypto exchange platform. According to a new report by market intelligence platform DappRadar, May saw two dozen incidents amounting to $54 million in losses, a sharp decrease from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/05/about-half-of-crypto-hacks-and-exploits-in-may-targeted-bnb-chain-according-to-dappradar/\">About Half of Crypto Hacks and Exploits in May Targeted BNB Chain, According to DappRadar</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]