[
  {
    "source": "CryptoSlate",
    "date": "2023-12-07T15:00:00.000Z",
    "title": "Bitcoin’s supply last active over a year ago reached ATH",
    "url": "https://cryptoslate.com/bitcoins-supply-last-active-over-a-year-ago-reached-ath/",
    "description": "<p>Bitcoin&#8217;s &#8216;supply last active over a year ago&#8217; is a barometer for long-term holding trends and market liquidity. This metric reflects the quantity of Bitcoin that has remained dormant, without transactions or movements, for over a year. Its significance lies in revealing the propensity of investors to hold their assets for extended periods, a behavior [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoins-supply-last-active-over-a-year-ago-reached-ath/\">Bitcoin’s supply last active over a year ago reached ATH</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-07T14:57:41.000Z",
    "title": "Waku Launches First Decentralised, Privacy-Preserving DoS Protections For Peer-to-Peer Messaging",
    "url": "https://cryptodaily.co.uk/2023/12/waku-launches-first-decentralised-privacy-preserving-dos-protections-for-peer-to-peer-messaging",
    "description": "Waku Launches First Decentralised, Privacy-Preserving DoS Protections For Peer-to-Peer Messaging"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-07T14:54:19.000Z",
    "title": "Spirit Blockchain Capital raises funds from EOS Network Ventures",
    "url": "https://cryptodaily.co.uk/2023/12/spirit-blockchain-capital-raises-funds-from-eos-network-ventures",
    "description": "Blockchain investment firm Spirit Blockchain Capital (SBC) has announced the completion of a major funding round. A number of investors participated in the raise including EOS Network Ventures (ENV), the venture firm focused on supporting innovation on the EOS Network."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-07T15:00:36.000Z",
    "title": "Exploring the Role of AI in Cinema: A Fresh Perspective on Synthetic Intelligence",
    "url": "https://www.cryptopolitan.com/exploring-the-role-of-ai-in-cinema/",
    "description": "Movies have played a pivotal role in shaping public perceptions of artificial intelligence (AI), often veering toward dramatic and apocalyptic scenarios. An ethics fellow at the Alan Turing Institute shares a curated list of films that deviate from the clichéd narrative, offering a more nuanced view of AI&#8217;s role in society. In the realm of ... <a title=\"Exploring the Role of AI in Cinema: A Fresh Perspective on Synthetic Intelligence\" class=\"read-more\" href=\"https://www.cryptopolitan.com/exploring-the-role-of-ai-in-cinema/\" aria-label=\"More on Exploring the Role of AI in Cinema: A Fresh Perspective on Synthetic Intelligence\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-07T14:54:18.000Z",
    "title": "Netmarble Unveils DEMIS RE: BORN at G-Star",
    "url": "https://www.cryptopolitan.com/netmarble-unveils-demis-re-born-at-g-star/",
    "description": "In a recent showcase at the G-Star gaming expo, Netmarble revealed their latest project, DEMIS RE: BORN, an RPG set to revolutionize the genre. This game, which is part of the Grand Cross universe, is scheduled for release in 2024 and promises to bring a fresh perspective to traditional RPG gameplay. DEMIS RE:BORN stands out ... <a title=\"Netmarble Unveils DEMIS RE: BORN at G-Star\" class=\"read-more\" href=\"https://www.cryptopolitan.com/netmarble-unveils-demis-re-born-at-g-star/\" aria-label=\"More on Netmarble Unveils DEMIS RE: BORN at G-Star\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-07T15:00:01.000Z",
    "title": "Binance CEO Disputes JPMorgan Chief’s Critique Of Crypto",
    "url": "https://www.newsbtc.com/binance/binance-ceo-disputes-jpmorgan-chiefs-critique-of-crypto/",
    "description": "Richard Teng, the Chief Executive Officer (CEO) of the world&#8217;s largest crypto exchange Binance challenged JPMorgan Chase’s CEO Jamie Dimon&#8217;s stance on cryptocurrencies. Binance CEO Disagrees With Jamie Dimon The Binance CEO recently defended cryptocurrencies by opposing the anti-crypto narrative promoted by the JPMorgan CEO in a hearing held on Wednesday. Teng took to X (formerly Twitter) to share his displeasure with Dimon&#8217;s narrative against crypto. Related Reading: Banking Giant CEO Trashes Crypto – Again – And Warns Of Ban: Here’s Why The JPMorgan CEO&#8217;s critics were set on the legitimacy and regulation of cryptocurrencies. According to Dimon, he has &#8220;never supported cryptocurrencies&#8221; and believes the &#8220;only real use case for crypto is criminals.&#8221;  He further added that he would close down crypto if he had the power to do so. The CEO stated: I&#8217;ve always been deeply opposed to crypto, the only true use case for it is criminals. If I were the government I&#8217;d close it down.  Teng underscored the need to compare the scope of illegal activity in cryptocurrency to that of traditional fiat money. He further highlighted the data compiled by Dr. Andrzei Gwizdalki from sources like the UN and the World Economic Forum. The data shows that illegal activities connected to fiat currencies are over 100 times bigger than crypto. According to the data, cryptocurrencies are linked to an estimated $20 billion in illegal activities.  Meanwhile, fiat currencies such as the United States dollar are implicated in approximately $3.2 trillion in illegal activities yearly. However, due to the secret nature of money laundering, it is difficult to determine the total amount that has been lost.  So far, Dr. Andrzei Gwizdalki believes the corruption and money laundering in connection with fiat &#8220;casts a dark shadow.&#8221; He also added that this is a reputation that the crypto space should not mirror. Furthermore, Gwizdalki has urged policymakers to be well-informed and handle real issues within their traditional systems. He believes using crypto for illegal reasons is &#8220;stupid and dangerous&#8221; since every transaction is transparently recorded. The Crypto Firm Faces Potential Collapse Former United States Securities and Exchange Commission (SEC) official John Reed Stark has highlighted a potential collapse for Binance. Stark&#8217;s belief is due to the Binance plea agreement by the former CEO of the crypto exchange Changpeng CZ Zhao. Stark stated: The Binance Plea Agreement is Already Blowing Up. More Evidence of the Possibility of a Binance Collapse (And a 10-Year Sentence for CZ). He also highlighted Teng&#8217;s failure to provide answers to simple questions during an interview as another potential reason. In the interview, journalist Scott Chipolina asked Teng where Binance is headquartered, but the CEO refused to provide specific answers. Related Reading: Binance New CEO Affirms Strength In Company’s Fundamentals So far, Stark has voiced doubts about the exchange&#8217;s capacity to comply with the stringent DOJ/FinCEN monitoring and cooperation requirements. He believes that while investigations are still ongoing, the government will bring more accusations against Binance and Changpeng Zhao. Featured image from Shutterstock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-07T15:03:06.000Z",
    "title": "Shiba Inu’s Shibarium: A Major Hard Fork Signals Exciting Changes",
    "url": "https://www.crypto-news-flash.com/shiba-inus-shibarium-a-major-hard-fork-signals-exciting-changes/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-shibarium-a-major-hard-fork-signals-exciting-changes",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shibarium\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-2048x1152.jpg 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />The Shibarium hard fork marks the end use of Ethereum’s testnet ecosystem Goerli network and a leap to the Sepolia network, to offer DeFi developers more scalable and secure options. The major network upgrade introduces a more enhanced SHIB burning mechanism, which has helped reignite the Shibarmy with Shiba Inu price up 17 percent in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-07T14:44:59.000Z",
    "title": "Versatus: Leading the Web3 with an Innovative Stateless Rollup",
    "url": "https://www.crypto-news-flash.com/versatus-leading-the-web3-with-an-innovative-stateless-rollup/?utm_source=rss&utm_medium=rss&utm_campaign=versatus-leading-the-web3-with-an-innovative-stateless-rollup",
    "description": "<img width=\"901\" height=\"544\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Versatus.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Versatus Labs a Peer-to-Peer Web Services Protocol\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Versatus.png 901w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Versatus-300x181.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Versatus-768x464.png 768w\" sizes=\"(max-width: 901px) 100vw, 901px\" />Versatus Labs raises $2.3M, valuing the company at $50M, to launch Versatus LASR, the first stateless rollup. Versatus offers seamless transition from Web2 to Web3, improving efficiency and security in smart contract development. In a significant breakthrough for the blockchain technology world, Versatus Labs has announced a successful fundraising of $2.3 million, bringing the company&#8217;s [...]"
  }
]