[
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T04:28:25.000Z",
    "title": "Meta’s Twitter rival Threads to launch July 6, but will the crypto community budge?",
    "url": "https://cointelegraph.com/news/will-crypto-community-move-to-meta-twitter-rival-threads",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/2920548d-e053-4eaa-93c0-803086663b0d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Meta's microblogging platform is set for launch, with Twitter co-founder Jack Dorsey pointing out the apps centralization and data harvesting.</p>\n                    <p><p>Meta is planning to launch its new Twitter rival, Threads, on July 6, only days after Twitter’s “rate limit” debacle which has temporarily <a href=\"https://cointelegraph.com/news/twitter-down-elon-musk-rate-limit-exceeded\">capped how many posts</a> users can read per day.</p><p>The platform, which is heavily tied to the photo and video-sharing social network Instagram, is expected to be released on Thursday according to a Meta-launched countdown <a href=\"https://www.threads.net/\" target=\"_blank\" rel=\"noopener nofollow\">site</a>. Threads has also <a href=\"https://apps.apple.com/us/app/threads-an-instagram-app/id6446901002\" target=\"_blank\" rel=\"noopener nofollow\">appeared</a> for pre-order on Apple’s App Store bearing an expected date of July 6.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/c383ce8e-edbb-4170-8b58-950c2f1327a8.jpg\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of Threads’ listing on the App Store. Source: Apple</em></figcaption></figure><p>Despite an arguably well-timed launch, the app appears to have seen limited fanfare, at least from Twitter’s avid crypto community. </p><p>Concerns have been raised around data mining and privacy issues and a lack of confidence the standalone app would even survive. </p><p>Crypto Twitter <a href=\"https://cointelegraph.com/magazine/tiffany-fong-flames-celsius-ftx-and-ny-post-hall-of-flame/\">influencer Tiffany Fong</a>, who has 66,600 followers on the platform, told Cointelegraph she hadn’t even heard of Threads until now, stating \"I have no clue what the Meta alternative is.” Fong has an active Instagram account with 10,400 followers. </p><p>Meanwhile, an ongoing Twitter poll from crypto influencer Kyle Chassé, a self-proclaimed “Bitcoin and crypto OG” has seen over 87% of the 125 respondents signal support for “Team Twitter” over “Team Meta.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> META IS ABOUT TO RELEASE &#39;THREADS&#39; ON JULY 7th<br><br>Which team are you on?</p>&mdash; Kyle Chassé (@kyle_chasse) <a href=\"https://twitter.com/kyle_chasse/status/1676134335529861120?ref_src=twsrc%5Etfw\">July 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Former Twitter CEO Jack Dorsey highlighted the Threads app privacy policy which indicated that Threads developer, Instagram Inc, would have access to a wide array of user data including financial info and identifiers.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">All your Threads are belong to us <a href=\"https://t.co/FfrIcUng5O\">https://t.co/FfrIcUng5O</a> <a href=\"https://t.co/V7xbMOfINt\">pic.twitter.com/V7xbMOfINt</a></p>&mdash; jack (@jack) <a href=\"https://twitter.com/jack/status/1676018291918372864?ref_src=twsrc%5Etfw\">July 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, Twitter has almost exactly the same permissions as Threads and collects similar data, according to researchers who responded to Dorsey's post.</p><p>Others have raised concerns over the possible longevity of the app given Meta’s previous standalone app launches have either been shut down or had the features rolled into its other products. </p><p>“What Meta doesn't want you to remember is that they already shut down Threads back in Dec 2021 after shutting down another standalone app called Direct,\" <a href=\"https://twitter.com/nickfloats/status/1676068996628590592\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Nick St. Pierre, a Twitter user that posts about artificial intelligence developments.</p><blockquote>“They have a history of releasing standalone apps for attention, shutting them down, then rolling the features into [Instagram].”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/memecoin-ai-twitter-bot-suspended-after-elon-musk-claims-scam\"><strong><em>Twitter suspends memecoin-linked AI bot after Elon Musk’s ‘scam crypto’ claim</em></strong></a></p><p>Meta’s expected Threads launch would come just days after Twitter’s rate limit debacle, which has imposed a <a href=\"https://cointelegraph.com/news/twitter-down-elon-musk-rate-limit-exceeded\">temporary restriction</a> on the number of posts that a user can view in a day.</p><p>Instead of users having to rebuild a following from scratch, Threads will port Instagram users’ followers and following lists.</p><p>According to reports earlier this year, a company spokesperson <a href=\"https://www.moneycontrol.com/news/business/startup/meta-mulls-a-twitter-competitor-codenamed-p92-that-will-be-interoperable-with-mastodon-10223961.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> that the stand-alone Threads app will support ActivityPub, the decentralized social networking protocol powering Twitter rival Mastodon.</p><p>Meanwhile, decentralized Twitter rival Mastodon has seen a recent <a href=\"https://cointelegraph.com/news/mastodon-twitter-rival-active-user-base-increases-by-100k\">surge in activity</a> with an increase in active users since Twitter imposed its read restrictions. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/\">Cryptocurrency trading addiction: What to look out for and how it is treated</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T04:29:17.000Z",
    "title": "Ethereum Price Lacks Momentum Above $1,950 But Dips Could Be Limited",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-lacks-momentum-1950/",
    "description": "Ethereum price failed to test $2,000 and corrected lower against the US Dollar. ETH is testing the $1,930 support and might start a fresh increase. Ethereum is correcting gains from the $1,975 zone. The price is trading above $1,930 and the 100-hourly Simple Moving Average. There is a short-term declining channel forming with resistance near $1,950 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start another increase if it remains stable above $1,930 in the near term. Ethereum Price Holds Support Ethereum’s price attempted an upside break above the $1,975 zone but failed. ETH struggled to gain pace for a move toward $2,000 and corrected gains, similar to Bitcoin. There was a drop below the $1,950 support. The price declined below the 23.6% Fib retracement level of the upward move from the $1,890 swing low to the $1,975 high. However, the bulls were active near the $1,930 support zone. It also tested the 50% Fib retracement level of the upward move from the $1,890 swing low to the $1,975 high. Ether price is now trading above $1,930 and the 100-hourly Simple Moving Average. Immediate resistance is near the $1,950 level. There is also a short-term declining channel forming with resistance near $1,950 on the hourly chart of ETH/USD. The next major resistance is near the $1,975 level. A clear move above the $1,975 resistance could push the price toward $2,000. Source: ETHUSD on TradingView.com The next resistance sits near $2,050, above which the price could rise toward the $2,120 level. Any more gains could send Ether toward the $2,200 resistance. More Losses in ETH? If Ethereum fails to clear the $1,950 resistance or $1,950, it could continue to move down. Initial support on the downside is near the $1,930 level and the 100-hourly Simple Moving Average. The first major support is near the $1,910 level. The next major support is near the $1,900 level. If there is a move below the $1,900 support, the price could drop toward the $1,870 support level. Any more losses may perhaps send the price toward the $1,820 support in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,930 Major Resistance Level – $1,975"
  }
]