[
  {
    "source": "CoinDesk",
    "date": "2024-01-11T11:13:18.000Z",
    "title": "Ether ETF Hopes Drive Smart Money Bets After Historic Bitcoin ETF Approval",
    "url": "https://www.coindesk.com/markets/2024/01/11/ether-etf-hopes-drive-smart-money-bets-after-historic-bitcoin-etf-approval/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bets on Ethereum tokens may spark a reversal of fortunes for ETH investors, especially as the token underperformed bitcoin in 2023."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-11T11:35:43.000Z",
    "title": " Bitcoin ETF: ‘Sell the news’ event or pivotal crypto adoption moment?  ",
    "url": "https://cointelegraph.com/news/bitcoin-etf-sell-news-crypto-adoption",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOGY3MDVhMGYtZDZmYS00MzNmLWE2MTUtMjBkMzU1NWY2Y2ZhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>What will the approval of a spot Bitcoin ETF mean for BTC’s price in the long term? </p>\n                    <p><p>The United States Securities and Exchange Commission (SEC) <a href=\"https://cointelegraph.com/news/sec-spot-bitcoin-etf-approvals\">approved the first-ever spot Bitcoin exchange-traded fund (ETF)</a> to trade publicly in the U.S. on Jan. 10. </p><p>In the landmark judgment, the SEC approved the 19b-4 applications from ARK 21Shares, Invesco Galaxy, VanEck, WisdomTree, Fidelity, Valkyrie, BlackRock, Grayscale, Bitwise, Hashdex and Franklin Templeton, allowing their spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETFs to be listed and traded on regulated exchanges. The trading of the ETFs will begin when markets open on Jan. 11.</p><p>The approval of the spot Bitcoin ETF paves the way for investors to gain direct exposure to the price of Bitcoin without buying it. Investors would instead buy shares in listed ETFs holding physical Bitcoin as their underlying asset.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-etf-sell-news-crypto-adoption\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-11T11:18:53.000Z",
    "title": " Spot Bitcoin ETFs: A week of high stakes and expectations ",
    "url": "https://cointelegraph.com/news/spot-bitcoin-etfs-update",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNGY3MmJhYTItNGY3MS00NjNkLWE4OTYtOWIyMWJlMmQ4NDJhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know everything that’s happening around spot Bitcoin ETF approvals? Here is the latest news on daily trends and events surrounding the anticipated ruling.</p>\n                    <p><p data-ct-non-breakable=\"true\">After a dramatic false start on Jan. 9, the United States Securities and Exchange Commission (SEC) has now given the green light to several spot Bitcoin ETFs. </p><p>BlackRock’s iShares Bitcoin Trust with ticker symbol IBIT started <a href=\"https://finance.yahoo.com/quote/IBIT/?guccounter=1\" target=\"_blank\" rel=\"noopener nofollow\">trading </a>in the pre-market and is currently up by 22.25%, trading at $26.81. The iShares trust is listed on the Nasdaq exchange.</p><p>Apart from BlackRock, Grayscale’s Bitcoin Trust (GBTC) ETF was another spot BTC ETF to begin trading in the pre-market at press time. The GBTC shares were up by 2% during the pre-market trading hours. GBTC is listed on the New York Stock Exchange (NYSE).</p><p><a href=\"https://cointelegraph.com/news/spot-bitcoin-etfs-update\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2024-01-11T11:27:00.000Z",
    "title": "Analyst: Pushd can outperform Solana and Dogecoin",
    "url": "https://crypto.news/analyst-pushd-can-outperform-solana-and-dogecoin/",
    "description": "As investors exit from Dogecoin and Solana falls, analysts are turning to Pushd"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-11T11:21:13.000Z",
    "title": "Solana meme coin Dogwifhat soars 70% amid buzz of potential Binance listing",
    "url": "https://crypto.news/solana-meme-coin-dogwifhat-soars-70-amid-buzz-of-potential-binance-listing/",
    "description": "Dogwifhat (WIF), a Solana blockchain meme token, soared over 70% in the last 24 hours, driven by substantial whale investments and speculation about a Binance listing. The price jump coincided with a flurry of large buy orders from an investor&#8230;"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-11T11:34:59.000Z",
    "title": "Vitalik Buterin Proposes Changes to Ethereum’s Gas Limits",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/vitalik-buterin-proposes-changes-to-ethereums-gas-limits/",
    "description": "<p>The Ethereum Foundation&#8217;s Research Team recently had a Reddit AMA where Vitalik Buterin, co-founder of Ethereum, proposed changing the network&#8217;s gas limit. Citing the greatest period of stagnancy in Ethereum&#8217;s history—nearly three years—Buterin suggested a 33% increase in the gas limit, possibly reaching 40 million. Let&#8217;s discover more about this important news. Vitalik Buterin Advocates [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/vitalik-buterin-proposes-changes-to-ethereums-gas-limits/\">Vitalik Buterin Proposes Changes to Ethereum’s Gas Limits</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-11T11:33:39.000Z",
    "title": "$Garbage and Rekt Announce The Oscars Meme Awards",
    "url": "https://www.altcoinbuzz.io/partnerships/garbage-and-rekt-announce-the-oscars-meme-awards/",
    "description": "<p>Imagine having a crypto version of the Oscars Awards, rewarding users with an impressive sense of humor. Well, that’s what Garbage and Rekt are set to achieve. Both projects are partnering up to launch the Oscars Meme Awards. Rekt and Garbage have a thing for hilarious, anti-establishment memes. So, their partnerships kick off a bi-monthly [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/partnerships/garbage-and-rekt-announce-the-oscars-meme-awards/\">$Garbage and Rekt Announce The Oscars Meme Awards</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-11T11:18:26.000Z",
    "title": "The Secret Agenda of Big Crypto Players",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-secret-agenda-of-big-crypto-players/",
    "description": "<p>ETF! ETF! It’s the one thing dominating crypto news right now. A big decision on the first ETF application update from Cathy Wood’s ARK Investment is coming down this week. We could see huge fireworks in the crypto market. Or maybe not, even. No one knows. We are bullish. But here’s one question. Why do [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-secret-agenda-of-big-crypto-players/\">The Secret Agenda of Big Crypto Players</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]