[
  {
    "source": "CoinDesk",
    "date": "2023-06-30T16:45:12.000Z",
    "title": "Will Europe’s Digital Euro Really Protect Privacy?",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/30/will-europes-digital-euro-really-protect-privacy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "EU officials pay lip service on data rights, but its proposals for a CDBC don’t offer much reassurance for users, says CoinDesk’s Michael Casey."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-30T16:54:37.000Z",
    "title": "Don’t be naive — BlackRock's ETF won't be bullish for Bitcoin",
    "url": "https://cointelegraph.com/news/blackrock-etf-isnt-bullish-for-bitcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/16ac74f1-2ad2-40a8-9f30-94cb31df6e0d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Are regulators trying to disarm crypto-native companies in order to pave the way for Blackrock to steamroll the industry?</p>\n                    <p><p>There is no doubt that <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-grayscale-sec\">BlackRock’s spot Bitcoin exchange-traded fund (ETF) application</a> — and the flood of contenders that followed — has buoyed the bulls. It could signal the winds of change in the regulatory sphere, they say. It could bring Bitcoin exposure to the masses, they holler. </p><p>While there might be some truth in these statements, we need to take a step back and look at the bigger picture. We should not be in a world where the mere possibility of a spot Bitcoin ETF coming to fruition in the United States sends markets into overdrive. BlackRock’s potentially oversized impact on Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price trajectory should give everyone in the Bitcoin community pause for thought rather than be a cause of celebration. </p><p>A spot Bitcoin ETF would clearly be a simple way for U.S. retirement funds to gain exposure to Bitcoin’s upside, and it’s very possible that an approved ETF in the U.S. would drive significant price appreciation in the years that follow. But what will it do to further Bitcoin’s cause — to decentralize finance, empower the unbanked and revolutionize how we interact with money globally? Very little, if anything.</p><h2>The TradFi invasion</h2><p>BlackRock’s application and the discussions around it have certainly served as a reminder of the distrust that exists between some parts of the crypto community and the traditional finance world.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ripple-verdict-bull-market-more-malaise\"><strong><em>Ripple verdict could spark a new bull market — or more malaise</em></strong></a></p><p>The timing of BlackRock’s foray into Bitcoin ETFs is particularly intriguing and has sent conspiracists wild. Given the Securities and Exchange Commission’s lawsuits against <a href=\"https://cointelegraph.com/news/judge-denies-motion-binance-alleged-misleading-sec-statements\">Binance</a> and Coinbase, some believe the agency is disarming crypto-native firms to pave the way for the likes of BlackRock to take over the crypto mantle. </p><p>Of course, such claims are unsubstantiated speculation. However, they demonstrate how the more deeply involved traditional finance (TradFi) entities become in the digital assets space, the more we risk Bitcoin becoming just another asset class and losing sight of its intended purpose and true value proposition.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">These are the key dates and timeline for the BlackRock Spot Bitcoin ETF<br><br>This is how I&#39;m positioning over the coming weeks... <a href=\"https://t.co/V1Kwvbh8Rc\">pic.twitter.com/V1Kwvbh8Rc</a></p>&mdash; Ξ huf (@hufhaus9) <a href=\"https://twitter.com/hufhaus9/status/1673447437271453698?ref_src=twsrc%5Etfw\">June 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>When you delve further into the details of BlackRock’s <a href=\"https://www.sec.gov/Archives/edgar/data/1980994/000143774923017574/bit20230608_s1.htm\" target=\"_blank\" rel=\"noopener nofollow\">filing</a>, the alarm bells start ringing louder. The filing makes a provision that in the event of a hard fork, BlackRock can “use its discretion to determine which network should be considered the appropriate network for the Trust’s purposes.” This could potentially be significant, enabling BlackRock to attempt to weigh in on Bitcoin’s direction — or at least steer institutional allocations and mainstream uptake. </p><p>Oversized influence on what is intended to be a decentralized monetary system is clearly a cause for concern in and of itself, but the broader issue with ETFs is that investors cannot withdraw the underlying Bitcoin. It’s in the ownership of Bitcoin that the true benefits lie. </p><h2>Upholding Bitcoin’s ethos</h2><p>Let’s not forget that Bitcoin was created as a direct response to the bailouts and quantitative easing that followed the 2008 financial crisis. Unlike traditional currencies, Bitcoin has a limited supply, is genuinely scarce and operates with decentralized governance. </p><p>Fifteen years on from the crash, central banks around the world can still not break the habit of printing money, using it as a “get out of jail free” card. Except it is nothing but free. Ordinary, hard-working individuals the world over are paying the price as their currencies are debased, which is now exacerbated by soaring nontransitory inflation.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/gary-gensler-hurting-little-guys-for-wall-street\"><strong><em>Gary Gensler is hurting the little guys for Wall Street </em></strong></a></p><p>While central banks play Russian roulette with public finances, Bitcoin’s ethos is to empower individuals by providing a censorship-resistant, borderless form of money. As an open-source monetary network, Bitcoin has the power to transform the way we interact with money. It could significantly reduce the importance of centralized institutions — perhaps even render them obsolete — which the conspiracists would say TradFi knows only too well.</p><p>Bitcoin ETFs seem at odds with this empowerment ethos. <a href=\"https://cointelegraph.com/news/el-salvador-bitcoin-maxi-economic-advisor\">El Salvador</a> — with its radical approach to Bitcoin adoption — is arguably more aligned with Bitcoin’s core aims than any ETF could ever be. While El Salvador seeks to empower the unbanked through actively promoting Bitcoin ownership, Bitcoin ETF investors will be left without any of the benefits of Bitcoin while lining the pockets of — and cementing the status of — TradFi institutions.</p><h2>Ownership over price speculation</h2><p>Bitcoin spot ETFs are likely to establish a stronger presence within the cryptocurrency ecosystem in the years to come and appeal to a certain class of investors, yet their role should not overshadow the trajectory of Bitcoin’s future. If we only focus on giving people exposure to price movements without actual ownership, then we will have totally missed the point of what could be a revolutionary monetary system. And no, if a rule is ever proposed that demands retail can only invest via ETFs rather than through direct ownership, this is not “consumer protection.” It spells their disempowerment. </p><p>Our industry should maintain a cautious stance, understanding that the increasing involvement of ETFs and traditional finance in the cryptosphere could pose risks to the underlying purpose of Bitcoin. Being alert to these risks means not getting blinded by the hype, but remaining committed to the original ethos of Bitcoin — a tool to transform the world’s financial systems, not merely an asset for speculation.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Ben Caselin</strong> is vice president and chief strategy officer at MaskEX, a digital assets trading platform headquartered in Dubai, UAE. Focused on driving the mass adoption of Bitcoin and digital assets, he is responsible for MaskEX’s global expansion efforts across business development, marketing and communications. Prior to joining MaskEX, he held various senior executive roles at AAX. He holds a BSc degree in cultural anthropology and development sociology from Utrecht University and an MSc in global migration studies from UCL.</div></div><p><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T17:07:48.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T17:04:34.000Z",
    "title": "Golteum (GLTM) Token Presale: Your Golden Opportunity Over Pepe Coin (PEPE) And Optimism (OP)",
    "url": "https://www.cryptopolitan.com/golteum-gltm-token-presale-your-golden-opportunity-over-pepe-coin-pepe-and-optimism-op/",
    "description": "In the highly volatile crypto market, three tokens have been making waves recently: Pepe Coin (PEPE), Optimism (OP), and the newcomer on the block, Golteum (GLTM). Each of these coins has its unique selling points and has garnered a significant following among crypto enthusiasts. However, if you&#8217;re looking for the next big thing in the ... <a title=\"Golteum (GLTM) Token Presale: Your Golden Opportunity Over Pepe Coin (PEPE) And Optimism (OP)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/golteum-gltm-token-presale-your-golden-opportunity-over-pepe-coin-pepe-and-optimism-op/\" aria-label=\"More on Golteum (GLTM) Token Presale: Your Golden Opportunity Over Pepe Coin (PEPE) And Optimism (OP)\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T16:53:17.000Z",
    "title": "How Does Melinda Gates Propose to Reduce Potential Bias In AI Systems?",
    "url": "https://www.cryptopolitan.com/melinda-gates-bias-in-ai-development/",
    "description": "In a recent interview with CNN, philanthropist, and entrepreneur Melinda Gates spoke out about her concerns regarding the potential bias embedded in artificial intelligence (AI) systems. She highlighted the lack of female representation in the field of computer science and emphasized the importance of diverse perspectives in developing unbiased AI technologies. These remarks can be ... <a title=\"How Does Melinda Gates Propose to Reduce Potential Bias In AI Systems?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/melinda-gates-bias-in-ai-development/\" aria-label=\"More on How Does Melinda Gates Propose to Reduce Potential Bias In AI Systems?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-30T17:00:29.000Z",
    "title": "Is Binance (BNB) Closing its doors? Investors have faith in Defi Coin Alex The Doge (ALEX)",
    "url": "https://nulltx.com/is-binance-bnb-closing-its-doors-investors-have-faith-in-defi-coin-alex-the-doge-alex/",
    "description": "In the mercurial world of cryptocurrencies, even the giants can stumble. Recent rumors have raised concerns about Binance (BNB), one of the world&#8217;s largest and most respected cryptocurrency exchanges. Yet, amidst the uncertainty surrounding Binance (BNB), investors are finding renewed hope in the DeFi token Alex The Doge (ALEX). &#62;&#62;&#62;&#62;BUY $ALEX PRESALE NOW&#60;&#60;&#60;&#60; Binance (BNB): [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-30T17:00:14.000Z",
    "title": "Driving Positive Change: Alex The Doge (ALEX) And Bitcoin (BTC)",
    "url": "https://nulltx.com/driving-positive-change-alex-the-doge-alex-and-bitcoin-btc/",
    "description": "As we delve deeper into the digital age, cryptocurrencies like Bitcoin (BTC) and Alex The Doge (ALEX) continue to reshape our world. While Bitcoin has already established its reputation as a trailblazer, Alex The Doge (ALEX), with its recent entry into the cryptosphere, is also driving significant changes within the industry. Let&#8217;s examine how these [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-30T16:58:26.000Z",
    "title": "Uncategorized Ordinals sold for $1.8m",
    "url": "https://crypto.news/uncategorized-ordinals-sold-for-1-8m/",
    "description": "Despite trouble for blue-chip NFT Azuki Elemantals earlier this week, bitcoin ordinals are showing continued interest with a $1.8 million dollar sale early on June 30."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T17:00:24.000Z",
    "title": "XRP Dips After SEC’s ETF Blow But A Rebound Looks Likely",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-dips-after-secs-etf-blow-but-a-rebound-looks-likely/",
    "description": "The United States Securities and Exchange Commission (SEC) has raised concerns about the recent filings for spot Bitcoin exchange-traded funds (ETFs), stating that they are insufficient. This comes after asset management giants BlackRock and Fidelity submitted their applications to launch spot Bitcoin ETFs. Related Reading: Cardano Shows Signs of Recovery: When Will it Reach $0.30? The Wall Street Journal reported that the SEC shared its perspective on the filings with Nasdaq and Cboe. Specifically, the agency expressed that the filings lacked clarity and comprehensiveness. Following the release of this news, Bitcoin experienced a drop of nearly 2% in its value. Similarly, other altcoins, including XRP, also saw a decline in their respective charts. Over the past 24 hours, XRP witnessed a decrease of approximately 1%, while on the weekly chart, it recorded a loss of more than 4%. As a result, the technical outlook turned bearish, leading to a decrease in investor interest. The charts reflected a decline in both demand and accumulation. Currently, XRP is hovering around a crucial support level, and a breach of this level may potentially trigger an upward movement for XRP. The market capitalization of XRP decreased, indicating that sellers had a stronger grip on the market. XRP Price Analysis: One-Day Chart As of the time of writing, the altcoin XRP was trading at $0.46. Currently, XRP has reached its lowest level since the end of May. This level has historically acted as a significant support level for the coin. This level is often referred to as a bullish order block, and it has the potential to drive price recovery. Looking ahead, the first hurdle for XRP would be the resistance at $0.48, followed by a potential move above the $0.50 mark. However, if XRP faces another rejection at $0.50, it could lead to a return to trading at $0.46 and possibly even a further decline to $0.43. Technical Analysis Due to low demand, there has been a decline in buying interest. The Relative Strength Index (RSI) is currently below the half-line and close to the 40-mark, suggesting that buyers have lost their influence and sellers have gained control. Similarly, XRP has dropped below the 20-Simple Moving Average line. This indicates a weakening demand and implies that sellers are currently driving the price momentum in the market As demand for the altcoin decreased, the altcoin generated sell signals, although these signals were diminishing in size. This indicates that the bearish momentum might be subsiding. The Moving Average Convergence Divergence (MACD) showed red histograms associated with the sell signals, but their size was decreasing. This suggests that while bearish sentiment still existed, the price could potentially experience a rebound in the near future. Related Reading: Slovakian Lawmakers Pass Amendment Lowering Cryptocurrency Taxation When considering volatility, the Bollinger Bands are used. In this case, the bands were wide and parallel, indicating a range for the altcoin. The upper band, which aligned with the $0.52 price level, is expected to serve as a significant resistance level. Featured image from Unsplash, charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T17:00:07.000Z",
    "title": "Bitcoin’s (BTC) Rollercoaster Ride or Alex The Doge’s (ALEX) Predicted Gains",
    "url": "https://www.crypto-news-flash.com/bitcoins-btc-rollercoaster-ride-or-alex-the-doges-alex-predicted-gains/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoins-btc-rollercoaster-ride-or-alex-the-doges-alex-predicted-gains",
    "description": "Bitcoin (BTC) is undeniably the flagship cryptocurrency, the first of its kind, and has set the standard for all others that have followed since its inception in 2009. Bitcoin’s (BTC) rollercoaster ride in the market has been a source of intrigue for investors worldwide. But today, the limelight is on a new player in the [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-30T17:04:06.000Z",
    "title": "OKX Named Official Sleeve Partner of Manchester City in Expansion of Partnership",
    "url": "https://dailyhodl.com/2023/06/30/okx-named-official-sleeve-partner-of-manchester-city-in-expansion-of-partnership/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>June 30, 2023 – Manchester, United Kingdom Manchester City and OKX – one of the leading crypto exchanges by trading volume and a leading Web 3.0 technology company – today announced OKX as the club’s official sleeve partner in a new multi-year agreement. As part of the expanded deal, the OKX brand will feature on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/30/okx-named-official-sleeve-partner-of-manchester-city-in-expansion-of-partnership/\">OKX Named Official Sleeve Partner of Manchester City in Expansion of Partnership</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-30T16:55:14.000Z",
    "title": "Lawmakers in Canada Push Government To Promote Use of Blockchain and Cryptocurrency",
    "url": "https://dailyhodl.com/2023/06/30/lawmakers-in-canada-push-government-to-promote-use-of-blockchain-and-cryptocurrency/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/lawmakers-in-canada-push.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/lawmakers-in-canada-push.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/lawmakers-in-canada-push.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/lawmakers-in-canada-push.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/lawmakers-in-canada-push.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/lawmakers-in-canada-push.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/lawmakers-in-canada-push.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Canadian lawmakers from the House of Commons say that the government should embrace blockchain technology and crypto following a comprehensive study of the digital assets industry. In a new report, the members of the Standing Committee on Industry and Technology say that the testimonies they gathered indicate that blockchain technology is already changing the digital [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/30/lawmakers-in-canada-push-government-to-promote-use-of-blockchain-and-cryptocurrency/\">Lawmakers in Canada Push Government To Promote Use of Blockchain and Cryptocurrency</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-30T16:44:30.000Z",
    "title": "Memecoin MOOKY Raises $900,000 Ahead of Its Final Presale Stage",
    "url": "https://dailyhodl.com/2023/06/30/memecoin-mooky-raises-900000-ahead-of-its-final-presale-stage/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>June 30, 2023 – New York, New York Memecoin MOOKY is gearing up for its final presale phase, having raised $900,000 to date. More than just a novel crypto token, Mooky aims to support the environment through a major tree-planting campaign. Mooky will be a community-driven platform whose governance lies in the hands of its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/30/memecoin-mooky-raises-900000-ahead-of-its-final-presale-stage/\">Memecoin MOOKY Raises $900,000 Ahead of Its Final Presale Stage</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]