[
  {
    "source": "CoinDesk",
    "date": "2023-06-28T06:43:24.000Z",
    "title": "Israel Seizes Millions in Crypto From Iranian Military and Hezbollah: Report",
    "url": "https://www.coindesk.com/policy/2023/06/28/israel-seizes-millions-in-crypto-from-iranian-military-and-hezbollah-report/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Israel's government has seized millions of dollars in cryptocurrency from accounts linked to the Iranian military and the Iran-backed Hezbollah militant group in Lebanon."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-28T06:57:27.000Z",
    "title": "BitGo CEO says traditional financial firms will remain ‘mostly out’ of crypto",
    "url": "https://cryptoslate.com/bitgo-ceo-says-traditional-financial-firms-will-remain-mostly-out-of-crypto/",
    "description": "<p>BitGo CEO Mike Belshe commented on the state of U.S. cryptocurrency regulations in a conversation with CNBC on June 27. CEO notes institutions&#8217; regulatory concerns Belshe suggested that regulators have adopted a stringent approach toward the crypto industry &#8211; forcing institutions and institutional investors to focus on regulations, adding: &#8220;I think the net effect is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitgo-ceo-says-traditional-financial-firms-will-remain-mostly-out-of-crypto/\">BitGo CEO says traditional financial firms will remain &#8216;mostly out&#8217; of crypto</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-28T07:00:34.000Z",
    "title": "Digital Arms in Partnership With Barrett Firearms to Launch Historic Barrett M82A1 NFT Drop",
    "url": "https://cryptodaily.co.uk/2023/06/digital-arms-in-partnership-with-barrett-firearms-to-launch-historic-barrett-m82a1-nft-drop",
    "description": "<p>Sydney, Australia, June 28th, 2023, Chainwire</p><p>In a first-of-its-kind collaboration, Digital Arms and Barrett Firearms are thrilled to announce the launch of the Barrett M82A1 Non-Fungible Token (NFT) collection on 28th June. This innovative partnership brings the legendary Barrett M82A1, renowned for its performance and reliability, to the digital world, offering collectors a unique opportunity to own a piece of digital histoNon-fungible tokens, or NFTs, are unique digital assets stored on the blockchain, providing verifiable digital ownership rights. Unlike other digital assets, each NFT is unique, making them the perfect vehicle for digital collectibles. The Barrett M82A1 NFT collection, crafted from original 3D CAD files used in the actual manufacturing of Barrett firearms, embodies this uniqueness, making it a desirable collector's item.</p><p>The Barrett M82A1 NFT is not just a digital asset, it's a part of digital history and a testament to the convergence of technology, art, and history. Owning a Barrett M82A1 NFT is akin to holding a digital first-edition book or a unique piece of art. As the world's first IP-licensed firearm NFT, it offers exclusivity and desirability unprecedented in the digital collectibles market.</p><p>The Barrett M82A1 NFT brings a variety of benefits to its owners:</p><ol><li>In-Game Utility Across Partner Games: The Barrett NFT is a functional piece of gaming gear, enhancing your gaming experience across various partner platforms.</li><li>Exclusive Access Within the Digital Arms Ecosystem: As a Barrett NFT holder, you gain access to exclusive events, boosted APY in our HNTR Token staking platform, and unique content.</li><li>Join a Visionary Community: By acquiring a Barrett NFT, you join a forward-thinking community of gamers and investors.</li><li>Investment in the Future: The Barrett M82A1 NFT represents a strategic investment in the rapidly expanding market of blockchain technology.</li></ol><p>The NFT drop includes a total of 2222 Barrett M82A1 NFTs, comprising five distinct skins of varying rarity. The public sale begins on 28th June at 5 PM AEST (07:00 UTC). However, early birds with whitelist access can start claiming their NFTs 24 hours ahead, at 5 PM AEST (07:00 UTC) on 27th June.</p><p>The Barrett M82A1 NFT drop is an opportunity to be part of a historical digital revolution. More than just a digital asset, each NFT is a ticket to an exclusive community and a stake in the rapidly expanding world of blockchain technology. Secure your stake, enhance your gaming experience, and join us in this thrilling journey on the 28th June.</p><p>For more information, visit the Digital Arms Marketplace.</p><p>About Digital Arms</p><p>Digital Arms is an NFT creator and marketplace leveraging blockchain technology's interoperability to bring real firearms and greater authenticity to Web3 gaming. As an NFT creator, Digital Arms builds scarce blockchain-based in-game items for first-person shooters, hunting and sports shooting titles. The platform is already partnered with some of the biggest names in the weapon manufacturing industry, including Blackwater, Primary Arms, Head Down Firearms and Barrett Firearms.</p><p class=\"ql-align-center\">Website | Twitter | Facebook | Telegram | Discord | Medium | Youtube</p><p>&nbsp;</p><p>About Barrett</p><p>Headquartered in Murfreesboro, Tennessee, Barrett is the world leader in large-caliber ri&#64258;e design and manufacturing. In 2023, the company became part of the NIOA Group &ndash; a family-owned global munitions company based in Australia.</p><p>Barrett products are used by civilian sport shooters, law enforcement agencies, the United States military and more than 75 State Department approved countries across the world. The Barrett Quality Management System (QMS) has received the prestigious ISO 9001:2015 certi&#64257;cation for the design and manufacture of &#64257;rearms, ammunition, and accessories, and to provide training for those systems.</p><p>Disclaimers and Legal Information</p><p>Please note that participation in the Barrett M82A1 NFT drop involves certain risks and potential financial loss. The value of NFTs can be highly volatile, and there is no guarantee of future performance or value. This document does not constitute investment advice, and you should always do your own research before participating in any NFT sale.</p><p>All transactions will be subject to the terms and conditions of the Digital Arms Marketplace, and you must agree to these terms before you can participate in the NFT drop. Please read these terms carefully. They govern your use of the marketplace, your rights and obligations as a buyer, and our respective legal rights and responsibilities.</p><p>The Barrett M82A1 NFTs are digital assets that use blockchain technology. They are subject to various legal and regulatory requirements, which may vary significantly between jurisdictions. You are solely responsible for understanding and complying with any applicable laws, regulations, and duties in your jurisdiction.</p><p>Finally, please note that owning a Barrett M82A1 NFT does not confer any legal or ownership rights in the physical Barrett M82A1 firearm, the Barrett brand, or any other intellectual property owned by Barrett Firearms Manufacturing. The NFTs are purely digital assets, and their ownership is limited to the blockchain.</p><p>By participating in the Barrett M82A1 NFT drop, you acknowledge and agree to these terms, and you understand the risks associated with NFTs and cryptocurrency transactions. If you have any questions or concerns, we encourage you to seek independent legal advice.</p>ContactBen Clarkebclarke@digital-arms.com"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-28T07:00:00.000Z",
    "title": "Bitcoin cash gaining traction, DigiToads presale raises over $5.7 million",
    "url": "https://crypto.news/bitcoin-cash-gaining-traction-digitoads-presale-raises-over-5-7-million/",
    "description": "DigiToads presale is gaining traction and the project has so far raised over $5.7 million. Meanwhile, Bitcoin Cash is slowly gnawing Bitcoin's market share"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-28T06:57:37.000Z",
    "title": "Magic Eden welcomes BRC-20 tokens to its multi-chain platform",
    "url": "https://crypto.news/magic-eden-welcomes-brc-20-tokens-to-its-multi-chain-platform/",
    "description": "In a stride towards diversification, NFT marketplace Magic Eden has recently divulged its initiative to assimilate BRC-20 token functionality within its open-source secondary marketplace and creator launchpad. The NFT trading platform, Magic Eden, has disclosed its intention to embed BRC-20&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T06:55:27.000Z",
    "title": "Kaching! Bitcoin Cash (BCH) Price Explodes Over 100% – What’s Powering It?",
    "url": "https://www.newsbtc.com/news/bitcoin-cash/kaching-bitcoin-cash-price-explodes-over-100-whats-powering-it/",
    "description": "Bitcoin Cash (BCH) recently experienced a remarkable surge, registering more than 100% increase. As one of the leading digital currencies, Bitcoin Cash has often been compared to its predecessor, Bitcoin (BTC), but it has also carved its own path in the ever-evolving crypto landscape. BCH, a cryptocurrency born out of a hard fork from Bitcoin in August 2017, shares the same underlying technology as its predecessor but aims to address some of the scalability issues that Bitcoin faced. With its larger block size and faster transaction times, Bitcoin Cash aimed to become a more efficient and accessible form of digital currency. However, it has faced its fair share of scrutiny and volatility over the years.  Now, with its recent meteoric rise, the question on everyone&#8217;s mind is: What factors are driving this surge in Bitcoin Cash&#8217;s price, and what does it mean for the future of this digital asset? Bitcoin Cash Emerges As Top Performer Bitcoin Cash BCH has exhibited an exceptional performance, positioning itself as one of the leading performers over both short and long timeframes. Over the past seven days, BCH has shown an impressive surge, soaring by a remarkable 106.3%. Source: Coingecko Even in the past 24 hours, it remains a top contender with a gain of 2.8%, defying the prevailing sentiment of stagnation observed in recent days. The current trading price for BCH, according to CoinGecko, stands at $226.69, further solidifying its upward trajectory. Meanwhile, Bitcoin, the flagship cryptocurrency, experienced a significant breakthrough by surpassing the $30,000 mark with remarkable momentum, briefly breaching the $31,000 threshold before the start of the weekend. BCH market cap currently at $4.5 billion. Chart: TradingView.com However, the bullish momentum was unable to sustain itself, leading to a resurgence of selling pressure and subsequently pushing the price back towards the $30,000 level. At the time of writing, the primary cryptocurrency is trading around $30,444, reflecting a meager setback in its upward trajectory. Factors Driving BCH Price Surge Recent developments have shed light on the factors driving the impressive surge in the price of Bitcoin Cash (BCH). According to a new BCH price report, the launch of EDX Markets, a cryptocurrency exchange backed by industry giants Citadel Securities, Charles Schwab Corp., and Fidelity Digital Assets, has significantly benefited BCH. EDX Markets will offer trading services for various cryptocurrencies, including Bitcoin Cash, providing increased accessibility and liquidity for BCH investors. Bitcoin Cash price trajectory in the last seven days. Source: CoinMarketCap Furthermore, another significant catalyst for the surge of the crypto&#8217;s price can be attributed to its recent game-changing upgrade. In May, Bitcoin Cash underwent a network hard fork that not only enhanced the network&#8217;s security and privacy measures but also introduced plans for CashTokens. This innovative feature holds immense potential for building decentralized applications (dApps) on the Bitcoin Cash blockchain, opening up new possibilities and driving increased adoption. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Wit Olszewski/Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T07:00:51.000Z",
    "title": "Top 3 Cryptocurrencies for July 2023: Comparing Caged Beasts, Ethereum, and Ripple",
    "url": "https://www.crypto-news-flash.com/top-3-cryptocurrencies-for-july-2023-comparing-caged-beasts-ethereum-and-ripple/?utm_source=rss&utm_medium=rss&utm_campaign=top-3-cryptocurrencies-for-july-2023-comparing-caged-beasts-ethereum-and-ripple",
    "description": "As the cryptocurrency market continues to evolve, investors are constantly seeking new opportunities to earn passive income. In this article, we will analyze the top three cryptocurrencies for July 2023: Caged Beasts Coin (BEASTS), Ethereum (ETH), and Ripple (XRP). Whether you&#8217;re a seasoned investor or just starting, these cryptocurrencies offer a promising chance to earn [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T06:54:21.000Z",
    "title": "Legal Drama Unfolds: Dogecoin Plaintiffs Seek Removal of Musk and Tesla Counsel Following ‘Leaked’ Sanctions Letter",
    "url": "https://www.crypto-news-flash.com/legal-drama-unfolds-dogecoin-plaintiffs-seek-removal-of-musk-and-tesla-counsel-following-leaked-sanctions-letter/?utm_source=rss&utm_medium=rss&utm_campaign=legal-drama-unfolds-dogecoin-plaintiffs-seek-removal-of-musk-and-tesla-counsel-following-leaked-sanctions-letter",
    "description": "Dogecoin plaintiffs demand the removal of Elon Musk and Tesla&#8217;s legal counsel. The request follows the leak of a sanctions letter in the ongoing legal battle. Elon Musk, the CEO of Tesla, is facing allegations of insider trading in a proposed class action filed by investors who claim that he manipulated the cryptocurrency dogecoin, resulting [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T06:40:54.000Z",
    "title": "Ripple Breaking Barriers: XRP, IOU, and ERC-20 Tokens Connect Seamlessly with XLS-38d Specification, Bridging the XRP Ledger and EVM Sidechain",
    "url": "https://www.crypto-news-flash.com/ripple-breaking-barriers-xrp-iou-and-erc-20-tokens-connect-seamlessly-with-xls-38d-specification-bridging-the-xrp-ledger-and-evm-sidechain/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-breaking-barriers-xrp-iou-and-erc-20-tokens-connect-seamlessly-with-xls-38d-specification-bridging-the-xrp-ledger-and-evm-sidechain",
    "description": "A new version of the EVM sidechain for the XRPL is available now on Devnet (v2). This version adds support for XRP, IOU, and ERC-20 token transfers in both directions between the XRP Ledger and EVM sidechain. The XRP Ledger is broadening its functionality with the EVM sidechain for the XRP Ledger (XRPL) available on [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-28T06:51:05.000Z",
    "title": "Bullish Signal as The Bitcoin Exchange Supply Drops to 2017 Lows",
    "url": "https://coinedition.com/bullish-signal-as-the-bitcoin-exchange-supply-drops-to-2017-lows/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin Exchange Supply Drops\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Exchange-Supply-Drops-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Data from Roots, the Bitcoin on-chain and cycle analyst, shows that the Bitcoin exchange supply has dropped to its 2017 level. According to Roots, centralized crypto exchanges (CEX) hold less than 12.5% of Bitcoin’s circulating supply, and chances are institutions with over $10 trillion in assets under management (AUM) may be coming after that. Additional [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bullish-signal-as-the-bitcoin-exchange-supply-drops-to-2017-lows/\">Bullish Signal as The Bitcoin Exchange Supply Drops to 2017 Lows</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-28T07:04:58.000Z",
    "title": "Crypto Analyst Issues Bitcoin Warning, Says It May Be Time for BTC Pullback After 25% Rally",
    "url": "https://dailyhodl.com/2023/06/28/crypto-analyst-issues-bitcoin-warning-says-it-may-be-time-for-btc-pullback-after-25-rally/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/BTC-Pullback-After-25.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/BTC-Pullback-After-25.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/BTC-Pullback-After-25.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/BTC-Pullback-After-25.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/BTC-Pullback-After-25.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/BTC-Pullback-After-25.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/BTC-Pullback-After-25.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto analyst is warning that a Bitcoin (BTC) correction may be looming after the crypto king&#8217;s strong performance last week. In a new blog post, trader Justin Bennett says that BTC launched an &#8220;impressive&#8221; rally since June 15th, surging by about 25% in just less than two weeks. However, Bennett says that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/28/crypto-analyst-issues-bitcoin-warning-says-it-may-be-time-for-btc-pullback-after-25-rally/\">Crypto Analyst Issues Bitcoin Warning, Says It May Be Time for BTC Pullback After 25% Rally</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]