[
  {
    "source": "Crypto Daily",
    "date": "2024-01-20T12:08:08.000Z",
    "title": "Vitruveo rolls out the World’s First Auto-rebasing Protocol",
    "url": "https://cryptodaily.co.uk/2024/01/vitruveo-rolls-out-the-worlds-first-auto-rebasing-protocol",
    "description": "Vitruveo is not just another blockchain platform; it is a dedicated Blockchain for Creators, utilizing an EVM-based protocol as the bedrock for constructing a decentralized ecosystem."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-20T12:00:19.000Z",
    "title": "Cogwise (COGW) Projected to Reach Top 30 Tokens on CoinMarketCap in 2024",
    "url": "https://news.bitcoin.com/cogwise-cogw-projected-to-reach-top-30-tokens-on-coinmarketcap-in-2024/",
    "description": "<img width=\"468\" height=\"253\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/picture1.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/picture1-300x162.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/picture1.png 468w\" sizes=\"(max-width: 468px) 100vw, 468px\" />The world of cryptocurrency has seen a surge in popularity over the past few years, with many investors turning to digital currencies as a way to diversify their portfolios. However, with the increasing number of cryptocurrencies on the market, it can be difficult to make informed investment decisions. This is where AI technology comes in. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-20T12:00:00.000Z",
    "title": "Pepecoin (PEPE) Investors Lose Confidence, Shift Towards Pandoshi (PAMBO)",
    "url": "https://www.cryptopolitan.com/pepecoin-pepe-investors-lose-confidence-shift-towards-pandoshi-pambo/",
    "description": "The ever-shifting landscape of cryptocurrency investments has witnessed a significant shift recently, with investors of Pepecoin (PEPE) reevaluating their positions. Amidst growing uncertainties and fluctuating confidence in PEPE, a new focus has emerged: Pandoshi (PAMBO). This rising star in the crypto world is rapidly gaining traction, attracting investors with its promising outlook and innovative approach. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-20T11:58:56.000Z",
    "title": "Elon Musk and Bloomberg clash over xAI financial milestones",
    "url": "https://www.cryptopolitan.com/elon-musk-and-bloomberg-clash-over-xai/",
    "description": "Elon Musk, the CEO of Tesla and SpaceX, recently refuted a Bloomberg report concerning the funding of his artificial intelligence company, xAI. Musk labeled the report, which claimed that xAI had secured $500 million in investor commitments with a potential $1 billion funding goal, as “fake news” by Musk. This dispute has sparked discussions in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-20T11:44:01.000Z",
    "title": "PEPE Price Prediction: Will Pepe Coin Dominate Dogecoin And Shiba Inu In 2024?",
    "url": "https://www.cryptopolitan.com/pepe-price-prediction/",
    "description": "PEPE Price Predictions 2024-2033 Meme coins are renowned in the cryptocurrency market for boosting investor morale, particularly during periods of market turbulence or stagnation. For enthusiasts of meme coins, the newly-introduced &#8220;PEPE&#8221; coin is one not to be overlooked. It has established a remarkable benchmark, experiencing an extraordinary surge of nearly 7,000% since its debut [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-20T12:00:36.000Z",
    "title": "As Cardano (ADA), Ethereum (ETH) and Ripple (XRP) Reflect a Weekly Downturn, Pullix (PLX) Maintains Growth With Less Than 40% Of Stage 6 Remaining",
    "url": "https://nulltx.com/as-cardano-ada-ethereum-eth-and-ripple-xrp-reflect-a-weekly-downturn-pullix-plx-maintains-growth-with-less-than-40-of-stage-6-remaining/",
    "description": "The onset of the new year has ushered in notable fluctuations and increased volatility within the cryptocurrency market. While certain altcoins show signs of a bullish trajectory in anticipation of Bitcoin&#8217;s upcoming halving, top crypto coins such as Cardano, Ethereum, and Ripple coin have experienced a persistent decline over the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-20T11:57:08.000Z",
    "title": "Hitachi US Joins Forces with Hedera (HBAR) to Propel Real-World Web3 Advancements; Optimism (OP) Surges, Meme Moguls (MGLS) Emerges as Best Crypto Investment Choice",
    "url": "https://nulltx.com/hitachi-us-joins-forces-with-hedera-hbar-to-propel-real-world-web3-advancements-optimism-op-surges-meme-moguls-mgls-emerges-as-best-crypto-investment-choice/",
    "description": "Hedera is excited to have Hitachi US on board, bringing real-world solutions and taking a big step forward in decentralized tech innovation through Web3. In line with this new collaboration, Hedera coin is bound to see significant growth. Optimism is another cryptocurrency anticipated to see more gains, maintaining its all-time [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-20T12:09:00.000Z",
    "title": "Stop kicking the can on web3 development if we want adoption to grow | Opinion",
    "url": "https://crypto.news/stop-kicking-the-can-on-web3-development-if-we-want-adoption-to-grow-opinion/",
    "description": "Unlocking web3’s true potential and reaching mass adoption demands developers and leaders in the web3 space to stop kicking infrastructure refinement further down the line."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-20T12:00:10.000Z",
    "title": "Chainlink Gets Whale Backing: LINK Price Up 14% Amid Market Dip",
    "url": "https://www.newsbtc.com/news/chainlink-gets-whale-backing-link-price-up-14-amid-market-dip/",
    "description": "In the midst of the recent turbulence within the cryptocurrency market, Chainlink (LINK) has emerged as a notable outlier, demonstrating resilience against the sweeping downturn that has left major altcoins crumbling. Surprisingly, LINK has steadfastly clung to the $16 mark, showcasing a 14% rally in the last seven days and defying the prevailing market trends. However, investors are left to ponder whether this is a promising sign for Chainlink&#8217;s future or merely a momentary blip in the radar. Related Reading: Robinhood Goes Shiba Crazy, Buys 230 Billion SHIB In 24 Hours – Here’s The Scoop Source: Coingecko Massive Chainlink Whale Purchase This positive signal coincides with a notable $8.9 million whale purchase, injecting a substantial dose of confidence into the market. Yet, beneath the surface, murmurs of a whale exodus are causing concern. After the price of $LINK dropped today, a whale spent 8.9M$ to buy 601,949 $LINK at $14.81 with 3 new wallets.https://t.co/W7BjWM2XsP pic.twitter.com/xlFPqWv4ko — Lookonchain (@lookonchain) January 19, 2024 This purchase also dampens some worries especially following a recent selling spree by Chainlink investors, who offloaded a significant 2.3 million tokens since January 12th. The positive signal also comes after recent concerns in the absence of a noteworthy uptick in fundamental growth metrics such as network usage. Without substantial real-world adoption, the coveted $20 price point for Chainlink might remain an elusive mirage. LINK market cap currently at $9.044 billion. Chart: TradingView.com Chainlink&#8217;s Strengths Persist Amid Market Uncertainty Meanwhile, IntoTheBlock&#8217;s global in/out of the money (GIOM) chart uses the historical entry prices of the current LINK holders to highlight critical levels of support and resistance. Source: IntoTheBlock In the near term, investors may opt for short-covering maneuvers to prevent falling into a net-loss position, a strategy that could lead to the consolidation of Chainlink&#8217;s (LINK) price just below the $15 threshold in the upcoming days. Conversely, bullish market participants could potentially counter this bearish scenario by successfully pushing the price beyond the $20 territory. However, a potential hurdle arises from the fact that over 94,000 holders have accumulated 51 million LINK at a minimum price of $18.8. This sizable accumulation suggests the possibility of bears establishing a formidable sell-wall in that price range, potentially triggering a retreat in LINK&#8217;s value. The interplay of these dynamics underscores the delicate balance between short-term tactical moves and broader market sentiment that currently characterizes the trajectory of Chainlink&#8217;s price. Despite the prevailing turbulence, the core strengths of Chainlink should not be overlooked. Its established role as a leading oracle provider within the blockchain ecosystem remains undiminished. Related Reading: Will X Unleash The Doge? Platform Users Eager To Embrace The Meme Coin If the broader crypto market stages a recovery and fundamental growth aligns, a resurgence for Chainlink is not out of the realm of possibility. Featured image from Freepik"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-20T12:00:12.000Z",
    "title": "3 Upcoming Meme Tokens With 6-Figure Earning Potential",
    "url": "https://www.crypto-news-flash.com/3-upcoming-meme-tokens-with-6-figure-earning-potential/?utm_source=rss&utm_medium=rss&utm_campaign=3-upcoming-meme-tokens-with-6-figure-earning-potential",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-20T093745.271.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-20T093745.271.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-20T093745.271-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-20T093745.271-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-20T093745.271-450x300.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The quest for the best cheap crypto to buy right now is an ongoing pursuit. Investors are perpetually on the lookout for meme tokens with substantial earning potential. Three upcoming meme tokens are turning heads and can deliver six-figure gains: ApeMax, Shiba Memu, and Galaxy Fox. ApeMax: Boosting the Altcoin Arena ApeMax is a coin [...]"
  }
]