[
  {
    "source": "CoinDesk",
    "date": "2023-07-28T13:00:00.000Z",
    "title": "Yuga Labs Hopes to Rile Up Its Bored Apes With Latest Otherside Demo",
    "url": "https://www.coindesk.com/web3/2023/07/28/yuga-labs-hopes-to-rile-up-its-bored-apes-with-latest-otherside-demo/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Web3 company has been laser-focused on building out its Otherside metaverse this past year. The latest live demo in Los Angeles hopes to revive interest among its forgotten Bored Ape community."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-28T12:54:23.000Z",
    "title": "Worldcoin Being Probed by French Privacy Regulator for ‘Questionable’ Practices",
    "url": "https://www.coindesk.com/policy/2023/07/28/worldcoin-being-probed-by-french-privacy-regulator-for-questionable-practises/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Sam Altman’s latest eyeball-scanning initiative is attracting attention from data protection regulators."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-28T13:01:02.000Z",
    "title": "Bored Apes Take Center Stage in Exclusive 'Otherside' Game Test",
    "url": "https://decrypt.co/150415/bored-apes-take-center-stage-exclusive-otherside-game-test",
    "description": "Yuga Labs took over part of the CBS backlot Thursday to showcase the addition of Bored Ape Yacht Club avatars and locales in the game."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T13:00:00.000Z",
    "title": "Is 2023 the year we’re able to take control of our data?",
    "url": "https://cointelegraph.com/innovation-circle/is-2023-the-year-were-able-to-take-control-of-our-data",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/1fe3349d-7a17-4961-a158-97283376398e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Given the importance of sovereignty and data today, it is not possible for people to be fully sovereign without entrusting sovereignty over their own data.</p>\n                    <p><h3><strong>What is happening to my data?</strong></h3> <p>Although true control is limited in the digital age, our relationship with big tech and big media can be parasitic. During the mobile revolution, users traded away autonomy for convenience, and in hindsight, we should have looked deeper into the Terms of Service.</p> <p>The New York Times <a href=\"https://www.nytimes.com/interactive/2019/12/19/opinion/location-tracking-cell-phone.html\">unveiled</a> the uncomfortable truth that millions of people are sharing data without their explicit consent constantly. Countless websites and social platforms have also been fined for the collection and sale of personal data to third parties — <a href=\"https://www.newsweek.com/facebook-sued-billions-over-harvesting-peoples-data-1669352\">Meta</a> being sued for $3.1 billion as a result.</p> <p><a href=\"https://www.hollywoodreporter.com/business/business-news/tiktok-lawsuits-in-app-browser-data-harvesting-1235347111/\">TikTok</a> is also unable to escape the heat, having been thrust into litigation over browser data harvesting — harvesting that could potentially land a social media user in court, especially with current political and social discourse. Perhaps even more unsettling, a user can be blocked from accessing their own data in these products or even losing that data on a whim through account suspensions or deletions.</p> <p>Regardless of where one stands, it all boils down to autonomy. In the Web2 world, a user has limited control over what is done with their data — whether that be preserving privacy, permanence or access — but self-sovereignty has the power to change that.</p> <h3><strong>What is self-sovereignty?</strong></h3> <p>The term “self-sovereign identity” (SSI) <a href=\"https://www.identityblog.com/stories/2005/05/13/TheLawsOfIdentity.pdf\">surfaced</a> in 2005 when Microsoft systems architect Kim Cameron described what a safe, secure data model should possess. Simply put, self-sovereignty is the concept of owning and controlling your online identity and arbitrating who can access that personal data. It also means that one’s data does not require a higher authority for validation or authentication. An Ethereum address can be self-sovereign because it can be generated without a higher authority and signatures can be validated without up-level approval.</p> <p>Without self-sovereignty, large-scale systems can become fragile because larger systems fail in a void of authority. For example, a standalone, non-connected video game cartridge can be played on the console regardless of whether Nintendo exists, but modern games require signing into a server or receiving updates from an external source, which may become unavailable if that company goes under.</p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://circle.cointelegraph.com/learn-more?utm_campaign=Coin&_ga=2.123197772.699257063.1649682515-719256619.1645538730\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <p>Moving beyond Web2 infrastructures and toward self-sovereignty requires blockchain and cryptographic technologies. Unlike centralized systems, decentralization unlocks the value of emerging Web3 applications by granting individual control of one’s data, identities and credentials.</p> <p>So, we have a potential solution to these issues. We’ll use blockchain technology to become self-sovereign and bestow control over how, when and where our personal information is shared online. Unfortunately, it’s not that simple.</p> <h3><strong>Why should we care about sovereignty?</strong></h3> <p>There are many examples of self-sovereignty in everyday life, especially in modern free society. If you go down the list of U.S. Constitutional Amendments, you will find that many are focused on protecting sovereignty.</p> <p>The First Amendment affirms sovereignty over your own thoughts and right to express them, meaning you do not have to get approval from an authority to speak, and the Second Amendment affirms sovereignty over your own defense. The same can be said about the Fifteenth to Twenty-Sixth Amendments — affirming sovereignty as a citizen in a democracy.</p> <p>Sovereignty is the most important concept in modern society, and often the most contentious, especially when one person’s sovereignty overlaps with another. So, why have we not adopted these plans online and how can we do that?</p> <h3><strong>What can we do?</strong></h3> <p>There are many reasons why companies should take accountability and bestow sovereignty to users, but the likelihood of it happening without legal intervention is low. Companies and entire industries are profiting from our data, and in spite of the high risk and frequent breaches, government support and wider adoption of Web3 are both a prerequisite to action.</p> <p>Healthcare is one of the few industries with mediation to grant patient sovereignty at the state level. The state of Washington recently put forward a comprehensive bill called My Health My Data Act to <a href=\"https://iapp.org/news/a/washington-on-track-to-pass-health-data-privacy-law/\">protect</a> residents’ health data and prevent the unknowing sale of it to third parties. This is where exploring and supporting Web3 technologies is a must. The promise and premise of Web3 can offer individuals peace of mind regarding the safety and security of data. </p> <h3><strong>Making room for self-sovereignty</strong></h3> <p>Given the importance of sovereignty and data today, it is not possible for people to be fully sovereign without entrusting sovereignty over their own data. Following suit, people’s sovereignty over their data requires their identity and data also be self-sovereign. With the wider adoption of technologies like artificial intelligence (AI), genetic modification and robotics, establishing self-sovereign lines becomes increasingly critical.</p> <p>Centralized solutions like Web2 are fundamentally defined by authoritative control. One person or entity owns the system that stores and accesses the data, giving them full control of that data, regardless of what they pledge.</p> <p>There are several obstacles to face with the adoption of Web3, from educating users to perfecting smart UX design. People have been interacting with the internet for too long to accept its pitfalls that assign them as pawns in Big Tech’s game.</p> <p>There is a long road ahead when it comes to making self-sovereign data useful. The technology is still in its infancy and requires the construction of real-world infrastructure along with the adoption of new coding paradigms. Beyond making the technology function, it’s important to streamline UX to boost adoption and make decentralized networks more approachable.</p> <p>Despite the most common discourse focused on Web3’s connection to blockchain or cryptocurrency, it’s really about sovereignty; and just like freedom, we must constantly strive for it lest we lose it.</p> <p><em><a href=\"https://arietrouw.com/\">Arie Trouw</a> is the co-founder of XYO and founder of XY Labs.</em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\" /> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T12:46:51.000Z",
    "title": "Indian Supreme Court raps Union government on crypto rules delay: Report",
    "url": "https://cointelegraph.com/news/cryto-india-supreme-court-union-gov-crypto-regulations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/92dbc740-34f4-4937-88c3-0bd8e0bcf9fd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Supreme Court bench asked the union government to file a report on whether the latter is capable of setting up a federal agency to investigate crypto-related crimes. </p>\n                    <p><p>The Indian Supreme Court on July 27 reprimanded the Union government for the lack of crypto regulations in the country, according to a report in a local media outlet. </p><p>The Supreme Court in its observation noted that it is “unfortunate” that the government has yet to release any clear guidelines around cryptocurrencies. The observation from the court came amid growing instances of criminal activities involving cryptocurrencies and directed the Union government to bring on record whether it plans to set up any dedicated federal agency to investigate such crypto criminal cases, the local daily <a href=\"https://www.hindustantimes.com/india-news/supreme-court-terms-absence-of-law-on-crypto-unfortunate-101690516129783.html\" target=\"_blank\" rel=\"noopener nofollow\">reported</a>.</p><p>According to the report, Justices Surya Kant and Dipankar Datta said: </p><blockquote>“You still don’t have any law, unfortunately. Do you have an agency at the national level to understand these cases and investigate them properly? We want you to identify a national specialised agency, in the national interest.” </blockquote><p>The court’s observation came during the hearing of petitions booked in connection with cryptocurrency fraud cases in different states of India. The court asked the government to file a response on whether they are capable of setting up a mechanism to investigate such cases.</p><p>The fight for clear government-issued crypto regulations in India has been a long-drawn one. The government started working on a crypto bill on the instructions of the Supreme Court as early as 2018. However, the government is yet to introduce the final draft of the crypto bill despite assuring it would be completed repeatedly over the past four years.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/tax-man-india-s-new-tax-policies-could-prove-fatal-for-crypto-industry\"><strong><em>Taxman: India’s new tax policies could prove fatal for crypto industry</em></strong></a></p><p>While the Indian government is yet to come up with crypto guidelines, it was very quick to impose <a href=\"https://cointelegraph.com/news/30-crypto-tax-becomes-law-in-india-following-finance-bill-approval\">crypto taxation laws, which came into effect in April 2022</a>. The law was first introduced during the bull market when India became one of the leading crypto markets with a number of crypto unicorns and trading volumes soaring into billions of dollars. However, the tax laws had a drastic impact on the thriving crypto market as the majority of the established firms decided to move away from India due to a lack of regulatory clarity.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/crypto-friendly-blackrock-to-launch-digital-first-offering-in-india&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/wolf-of-all-streets-world-bitcoin-hits-1m-1-million-hall-of-flame/\"><strong><em>Hall of Flame: Wolf Of All Streets worries about a world where Bitcoin hits $1M</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-07-28T12:46:51.000Z",
    "title": "Indian Supreme Court raps Union government on crypto rules delay: Report",
    "url": "https://cointelegraph.com/news/cryto-india-supreme-court-union-gov-crypto-regulations",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/92dbc740-34f4-4937-88c3-0bd8e0bcf9fd.jpg\"></p><p>The Supreme Court bench asked the union government to file a report on whether the latter is capable of setting up a federal agency to investigate crypto-related crimes. </p>\n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-28T12:51:42.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Hangs on to $29,000 Level, Despite Increased Market Volatility ",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-hangs-on-to-29000-level-despite-increased-market-volatility/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1635530845-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Manages Hangs on to $29,000 Level, Despite Increase Market Volatility \" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1635530845-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1635530845-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1635530845-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1635530845-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1635530845-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1635530845-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1635530845-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin remained above a key support point on Friday, despite bears attempting to push the price below $29,000. Today&#x2019;s session saw sentiment once again shift bearish, as U.S. consumer sentiment data looms. Ethereum was mostly unchanged in today&#x2019;s session. Bitcoin Bitcoin (BTC) continued to trade above the $29,000 mark on Friday, despite bearish pressure intensifying [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T13:08:27.000Z",
    "title": "Is This the Hottest AI Stock of the Year? A 250% Surge Tells All!",
    "url": "https://www.cryptopolitan.com/hottest-ai-250-surge-tells-all/",
    "description": "The AI industry has been a hotbed of excitement, with numerous companies vying for attention. Among them, C3.ai has emerged as a standout performer, witnessing an astounding surge of over 250% in its stock value this year. As investors bet big on artificial intelligence&#8217;s potential, C3.ai&#8217;s stock has soared, but it faces a formidable challenge ... <a title=\"Is This the Hottest AI Stock of the Year? A 250% Surge Tells All!\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hottest-ai-250-surge-tells-all/\" aria-label=\"More on Is This the Hottest AI Stock of the Year? A 250% Surge Tells All!\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T12:47:45.000Z",
    "title": "Is Generative AI Sustainable for Responsible Adoption? Points for Consideration",
    "url": "https://www.cryptopolitan.com/is-generative-ai-sustainable-for-responsible-adoption-points-for-consideration/",
    "description": "As generative AI gains momentum, concerns arise about its significant carbon footprint and the potential environmental impact. Organizations must proactively address this sustainability problem before it becomes a mainstream issue. Recent reports highlight the high energy consumption and emissions associated with training and deploying generative AI models, underscoring the urgency for responsible adoption. Sometimes, all ... <a title=\"Is Generative AI Sustainable for Responsible Adoption? Points for Consideration\" class=\"read-more\" href=\"https://www.cryptopolitan.com/is-generative-ai-sustainable-for-responsible-adoption-points-for-consideration/\" aria-label=\"More on Is Generative AI Sustainable for Responsible Adoption? Points for Consideration\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-28T13:00:49.000Z",
    "title": "Why This Billionaire Continues To Advocate For Bitcoin Amid Surging US Debt?",
    "url": "https://www.newsbtc.com/bitcoin-news/why-this-billionaire-continues-to-advocate-for-bitcoin/",
    "description": "Bitcoin (BTC) has continued to occupy center stage, drawing varied reactions from different financial pundits. One of these voices is billionaire investor Mike Novogratz, who has yet again reiterated his support for the top cryptocurrency despite the unsettling dynamics in the United States economy. The Growing Concern: Skyrocketing Interest Payments The US is currently experiencing an unprecedented increase in debts as its interest payments reach $970 billion. This figure represents a leap of $41 billion in the second quarter alone. Observers anticipate that the rising trajectory could soon see the country&#8217;s debts surge resulting in the interest payments hitting the $1 trillion milestone, which has set off alarm bells in financial circles. Related Reading: Bitcoin Retreat Below $30,000: A Threat To Crypto’s 2023 Dominance Over Stocks? To clarify, interest payments are the actual payments that the borrower makes to the lender, typically on a regular schedule, to repay the interest on a loan or debt. The amount of each payment is determined by the interest rate and the terms of the loan. As such, the sustained upsurge of interest payments in the US economy has triggered growing unease among financial experts. Tax receipts are currently failing to keep pace with the ballooning sovereign debt. Consequently, the issuance of more debt to fund interest payments is becoming an increasingly common occurrence. This scenario has created a vicious cycle, causing concern about the potential repercussions on the nation&#8217;s fiscal health. In light of this, Mike Novogratz has once again expressed his firm support for Bitcoin. His latest advocacy came to the forefront recently when he urged investors to buy Bitcoin as the US national debt spiked by $1 trillion between June and July. Buy $BTC!!! https://t.co/UyGNaGXzyI — Mike Novogratz (@novogratz) July 27, 2023 Novogratz&#8217;s Stance: Bitcoin As A Safe Haven Despite expressing caution regarding the broader economy, Novogratz holds a sanguine view of Bitcoin&#8217;s prospects. He envisions that the cryptocurrency is on the cusp of another growth cycle, following a consolidation phase oscillating between the $28,000 to $32,000 range. However, Novogratz maintains that a significant shift in policy by the Federal Reserve, specifically a reduction in interest rates, is key for this expected surge to come to fruition. Related Reading: Galaxy Digital Founder Anticipates BTC Price Surge Due To This Reason Meanwhile, recent indicators suggest that the central bank may have different intentions. The Federal Reserve&#8217;s current stance seems to diverge from the conditions that Novogratz believes are necessary for a Bitcoin rally. Despite this, the experienced investor continues to champion Bitcoin, viewing it as a potential safe haven amid economic uncertainties. In the meantime, Bitcoin&#8217;s valuation is still persistently working to rise above the recent downward trend. The digital asset experienced a slight dip of 1% in the last day and now has a market cap of $567.5 billion. BTC&#8217;s market price currently stands at $29,309, at the time of writing. This price action follows the asset&#8217;s unsuccessful endeavor to reclaim the $30,000 mark earlier this week.  Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T13:00:26.000Z",
    "title": "$2.5M Polygon-Based NFT Sale Sparks Frenzy – AI Powered NFT Marketplace Borroe Generates Buzz With 100X Potential Gains",
    "url": "https://www.crypto-news-flash.com/2-5m-polygon-based-nft-sale-sparks-frenzy-ai-powered-nft-marketplace-borroe-generates-buzz-with-100x-potential-gains/?utm_source=rss&utm_medium=rss&utm_campaign=2-5m-polygon-based-nft-sale-sparks-frenzy-ai-powered-nft-marketplace-borroe-generates-buzz-with-100x-potential-gains",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T153159.322.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T153159.322.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T153159.322-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T153159.322-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T153159.322-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T153159.322-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-evolving world of cryptocurrencies, non-fungible tokens (NFTs) have emerged as a powerful force, gaining mainstream adoption and impacting numerous industries. Despite market fluctuations, the allure of NFTs remains strong, and their use cases continue to expand.  Recently, the luxury assets industry witnessed a groundbreaking moment as an iconic Ferrari F40 was sold as [...]"
  }
]