[
  {
    "source": "CryptoSlate",
    "date": "2024-02-06T05:00:25.000Z",
    "title": "How ETFs affected Bitcoin’s supply distribution across cohorts",
    "url": "https://cryptoslate.com/how-etfs-affected-bitcoins-supply-distribution-across-cohorts/",
    "description": "<p>There has been a significant shift in the distribution of Bitcoin supply since the beginning of the year. While the distribution of Bitcoin holdings is a regular occurrence and follows market cycles, the launch of spot Bitcoin ETFs in the U.S. seems to have spearheaded these changes. It&#8217;s important to understand the supply distribution across [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/how-etfs-affected-bitcoins-supply-distribution-across-cohorts/\">How ETFs affected Bitcoin&#8217;s supply distribution across cohorts</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T04:54:48.000Z",
    "title": "AI and Ancient Wisdom – AI Deciphers 2000-Year-Old Buried Scroll",
    "url": "https://www.cryptopolitan.com/ai-and-ancient-wisdom-2000-old-buried-scroll/",
    "description": "In a revelation facilitated by artificial intelligence, a team of researchers has successfully deciphered an ancient papyrus scroll buried for over two millennia beneath the volcanic ash from Mount Vesuvius&#8217;s eruption in AD 79, revealing profound insights into AI and ancient wisdom. The winning entry in the Vesuvius Challenge, led by Youssef Nader, Luke Farritor, [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-06T05:07:14.000Z",
    "title": "Chainlink $LINK Token Surges To Yearly High Amidst Growing Investor Interest",
    "url": "https://nulltx.com/chainlink-link-token-surges-to-yearly-high-amidst-growing-investor-interest/",
    "description": "The price of Chainlink&#8217;s ($LINK) token has surged to new heights, reaching $19 and marking a significant 7.22% increase over the past 24 hours, hitting a yearly peak of $19.54.  This surge reflects the massive bullish momentum that LINK has been experiencing, with a remarkable 34% gain over the past [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-06T04:57:44.000Z",
    "title": "Binance Denies Allegations Off KYC Data Breach Amidst Dark Web Rumors",
    "url": "https://nulltx.com/binance-denies-allegations-off-kyc-data-breach-amidst-dark-web-rumors/",
    "description": "Binance has strongly refuted allegations suggesting a breach of its users&#8217; KYC data on the dark web, following purported claims of a GitHub breach. Speculation has emerged in the past two days, indicating that individuals are purportedly selling Binance customer data, including full names, countries, and phone numbers.  The alleged [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-06T05:00:56.000Z",
    "title": "What’s Ahead For Bitcoin? Expert Forecasts Pre-Halving Rally As Early As Next Week",
    "url": "https://www.newsbtc.com/bitcoin-news/whats-ahead-for-bitcoin-expert-forecasts-pre-halving-rally-as-early-as-next-week/",
    "description": "Bitcoin (BTC), the largest cryptocurrency in the market, has seen its price hover between $42,000 and $43,000, halting its recovery from the dip below $38,500.  With the upcoming halving event scheduled for April, market experts and crypto analysts such as Rekt Capital are observing historical patterns that suggest an interesting price action scenario, potentially igniting another significant price surge for Bitcoin. Pre-Halving Rally For Bitcoin Imminent?  Rekt Capital, known for its expertise in analyzing market trends, highlights the significance of historical patterns about previous halving events. These patterns reveal a consistent trend of substantial rallies leading up to the halving, followed by a short period of correction and consolidation before a major bull run and peak. Related Reading: Crypto Analyst Says ADA Price Will Rise To $8, Here’s When According to Rekt Capital, Bitcoin should commence its Pre-Halving Rally as early as next week if history indicates.  This rally, driven by investors &#8220;buying the hype&#8221; in anticipation of the halving, aims to capitalize on the price surge and realize profits by &#8220;selling the news.&#8221; Short-term traders and speculators often exploit this hype-driven rally and sell their positions. The subsequent selling pressure contributes to a phenomenon known as the pre-halving retrace. This retrace typically occurs a couple of weeks before the actual halving event.  In previous halving cycles, the pre-halving retrace reached depths of -38% in 2016 and -20% in 2020. It is worth noting that this phase can last for several weeks, introducing uncertainty among investors regarding whether the halving will act as a bullish catalyst for Bitcoin&#8217;s price. Overall, the historical patterns observed by Rekt Capital point to the possibility of a pre-halving rally in the coming weeks, followed by a correction period known as the pre-halving retrace.  While past performance is no guarantee of future results, these historical trends provide valuable guidance on how the price of Bitcoin may perform in the coming weeks and days before the halving. Long-Term Holder Support And ETF Buying Pressure Despite expected short-term gains for BTC, Crypto Con has recently drawn attention to a historical trend in the Bitcoin market. According to Crypto Con, no Bitcoin cycle has ever escaped a retest of the 150% long-term holder support line.  According to the analyst, this line has acted as a crucial level of support during various market cycles. Even during the unprecedented black swan event and subsequent recovery in 2020, the price retested this line as support. By analyzing this metric, Crypto Con suggests that based on historical patterns, Bitcoin&#8217;s price may need approximately $31,300 to retest the long-term holder support line.  The anticipated impact of ETF buying pressure on Bitcoin&#8217;s price is counterbalancing the argument for further corrections. Introducing ETFs (Exchange-Traded Funds) into the cryptocurrency market is a relatively new development. As such, the effects of ETF inflows on Bitcoin&#8217;s price remain to be seen and are a subject of ongoing observation. Related Reading: Institutions Go All In: Chainlink 30% Rally Makes It The Hot Investment Trend While the potential retest of the long-term holder support line may create temporary price fluctuations, proponents of Bitcoin as an investment opportunity view such a scenario as a buying opportunity.  Ultimately, Crypto Con believes that those who believe in the long-term prospects of Bitcoin may choose to take advantage of any price dips resulting from a retest of support. BTC trades at $42,800, up a slight 0.4% in the past 24 hours as of this writing.  Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-06T04:48:23.000Z",
    "title": "Ethereum Price Topside Bias Vulnerable If It Continues To Struggle Below $2,400",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-vulnerable-2400/",
    "description": "Ethereum price is consolidating above the $2,250 zone. ETH could start a decent increase if it clears the $2,340 and $2,380 resistance levels. Ethereum is struggling to gain pace for a move above the $2,350 zone. The price is trading above $2,300 and the 100-hourly Simple Moving Average. There is a short-term rising channel forming with resistance near $2,350 on the hourly chart of ETH/USD (data feed via Kraken). The pair might start a fresh increase if it manages to clear the $2,350 resistance zone. Ethereum Price Eyes Fresh Increase Ethereum price remained in a range below the $2,350 resistance zone. ETH traded lower below $2,320, but the bulls were active near the $2,280 support zone. A low was formed near $2,282 and the price is now attempting a fresh increase in a range, like Bitcoin. There was a move above the $2,300 resistance zone and the 100-hourly Simple Moving Average. The price even cleared the 61.8% Fib retracement level of the recent decline from the $2,334 swing high to the $2,282 low. Ethereum is now trading above $2,300 and the 100-hourly Simple Moving Average. There is also a short-term rising channel forming with resistance near $2,350 on the hourly chart of ETH/USD. On the upside, the first major resistance is near the $2,325 level or the 76.4% Fib retracement level of the recent decline from the $2,334 swing high to the $2,282 low. The next major resistance is near $2,350, above which the price might rise and test the $2,380 resistance. Source: ETHUSD on TradingView.com If the bulls push the price above the $2,380 resistance, they could aim for $2,450. A clear move above the $2,450 level might send the price further higher. In the stated case, the price could rise toward the $2,500 level. Another Decline in ETH? If Ethereum fails to clear the $2,350 resistance, it could start another decline. Initial support on the downside is near the $2,280 level and the channel trend line. The next key support could be the $2,240 zone. A clear move below the $2,240 support might send the price toward $2,180. The main support could be $2,120. Any more losses might send the price toward the $2,040 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $2,240 Major Resistance Level – $2,350"
  }
]