[
  {
    "source": "Cointelegraph",
    "date": "2023-11-17T02:18:41.000Z",
    "title": "Web3 should draw newcomers, not be a ‘money grab from brands’ — Tech CEO",
    "url": "http://cointelegraph.com/news/build-web3-for-newcomers-not-money-grabs-amy-peck",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/aecb389b-5e85-4882-b19c-7ee2c23562a4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Using Web3 and NFTs to create another slate of millionaires isn’t a good use of the technology, says EndeavourXR CEO Amy Peck.</p>\n                    <p><p>The crypto industry should focus on building blockchain-based solutions everybody can benefit from instead of launching cash grabs for brands, says Amy Peck, CEO of tech-focused consulting firm EndeavourXR.</p><p>Peck told Cointelegraph at the Lisbon Web Summit that Web3 firms should be build-first oriented and create attractive products to draw newcomers.</p><p>She added using Web3 and nonfungible tokens (NFTs) as “just another money grab from brands” to create another slate of multi-millionaires “doesn’t seem like a good look” nor a good use of what is an “elegant technology.”</p><blockquote>“This is an infinite landscape. The money’s going to be there, right? Let’s build a better bread box. We have the opportunity to do something really interesting and reinvent this economic construct, invite more people to the party, not just create another 1%.”</blockquote><p>Obtaining an on-chain proof of identity, taking control and ownership of one’s data, connecting blockchain-based assets to the real world and interacting in the creator economy are among the top things Peck says builders should focus on to extract the most value from Web3. </p><p>Following FTX’s collapse and other industry shortfalls, Peck said much of her firm’s client base says they “don’t want to touch crypto” and that “Web3 is all shenanigans.” </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/36cb3ce3-da4c-46b0-991b-df4f870c47b5.jpg\"  /><figcaption style=\"text-align: center;\"><em>Lisbon Web Summit on Nov. 16. Source: Joe Hall/Cointelegraph</em></figcaption></figure><p>Peck acknowledged it’s currently unrealistic for <a href=\"https://cointelegraph.com/news/web3-industry-products-blockchain-adoption\">big brands to fully transition</a> to Web3 but says there’s already a “Web2.5 center lane” that these firms can leverage.</p><p>Providing consumers with more <a href=\"https://cointelegraph.com/news/web3-is-crucial-for-data-sovereignty-in-the-metaverse\">control and ownership over their data</a> is already possible with blockchain, Peck stressed. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/how-ai-changing-crypto-hype-reality\"><strong><em>How AI is changing crypto: Hype vs. reality</em></strong></a></p><p>She added a more “transparent exchange” is becoming more crucial than ever, particularly with the emergence of devices collecting data such as fingerprints and faces.</p><blockquote>“What is coming with these immersive devices is biometric data that will allow the people who own that data to know more about us than we know, and the level of manipulation will be exponential.”</blockquote><p>On <a href=\"https://cointelegraph.com/news/bitcoin-etf-will-drive-adoption-in-2024-mike-novogratz\">cryptocurrency exchange-traded funds</a>, Peck said it’s great that Wall Street firms are now taking the industry seriously but is wary that they will try to twist what has been built to suit their liking.</p><blockquote>“They’re going to try and wrestle it to the ground and make it behave like these existing financial mechanisms.”</blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/singer-verites-web3-music-nfts-community/\"><strong><em>Singer Vérité’s fan-first approach to Web3, music NFTs and community building</em></strong></a></p><p class=\"post-content__disclaimer\">Additional reporting by Joe Hall. </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]