[
  {
    "source": "Cointelegraph",
    "date": "2023-11-14T01:44:35.000Z",
    "title": "Elon Musk AI project inspired memecoin ‘Grok’ falls 74% on creator scam claim",
    "url": "http://cointelegraph.com/news/elon-musk-ai-memecoin-grok-falls-creator-scam-claim",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/4742b696-e13a-44d7-8c18-bb736e10d8ff.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A memecoin drawing its name from the Grok AI project plummeted after allegations its social media account was recycled from that of a former scam token.</p>\n                    <p><p>The price of a memecoin drawing its namesake from Elon Musk’s artificial intelligence project “Grok” plummeted over 70% after blockchain sleuth ZachXBT alleged the token’s social media account was recycled from a scam token project.</p><p>In a Nov. 13 X (formerly Twitter) post, ZachXBT shared screenshots showing various social media accounts and websites tied to the Grok (GROK) token were repurposed from old projects — including an abandoned memecoin project <a href=\"https://www.dextools.io/app/en/ether/pair-explorer/0x16e3c95fd01f7015753344f6b6290308f3e45627\" target=\"_blank\" rel=\"noopener nofollow\">called</a> ANDY — which has significantly declined from its all-time high. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Not that people in this space will care but <a href=\"https://twitter.com/GROKERC20?ref_src=twsrc%5Etfw\">@GROKERC20</a> <a href=\"https://twitter.com/search?q=%24GROK&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$GROK</a> was created by a scammer. <br><br>Same exact X/Twitter account has been reused for at least one other scam. <br><br>X/Twitter ID: 1690060301465714692 <a href=\"https://t.co/iKu7zb6YeS\">pic.twitter.com/iKu7zb6YeS</a></p>&mdash; ZachXBT (@zachxbt) <a href=\"https://twitter.com/zachxbt/status/1724094712309489810?ref_src=twsrc%5Etfw\">November 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In the five hours following ZachXBT’s post, memecoin enthusiasts watched as GROK plunged 74% from its all-time high of $0.027 to as low as $0.007. Its price has since retracted to $0.011, per DexTools <a href=\"https://www.dextools.io/app/en/ether/pair-explorer/0x69c66beafb06674db41b22cfc50c34a93b8d82a2\" target=\"_blank\" rel=\"noopener nofollow\">data</a>. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/e6e632d5-2f98-4225-97c0-574cbe5f759e.png\"  /><figcaption style=\"text-align: center;\"><em>GROK’s price plunged more than 70% in five hours following ZachXBT’s allegations. Source: DexTools</em></figcaption></figure><p>In a follow-up <a href=\"https://twitter.com/zachxbt/status/1724101329872625815\" target=\"_blank\" rel=\"noopener nofollow\">post</a>, ZachXBT pointed to an Etherscan <a href=\"https://etherscan.io/tx/0xa0c6d2bf73a6ec65048e6337d8a09bf42df136c68e94170da268804f70b3bd36\" target=\"_blank\" rel=\"noopener nofollow\">transaction</a> showing GROK's team sent roughly $1.7 million worth of the token to a burn address in a bid to reduce supply and restore confidence in the token. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/5decf2ca-392e-4d6b-9bb3-eb21299ed80f.jpg\"  /><figcaption style=\"text-align: center;\"><em>The Grok developer burned 90 million GROK tokens after the token's price plummeted. Source: Etherscan</em></figcaption></figure><p>The X account for the GROK token claimed in a Nov. 14 post that the development team had burned all of the tokens from the deployer address, some 180 million GROK worth roughly $2 million at current prices.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">all tokens from the deployer wallet has been 100% burnt.<a href=\"https://t.co/mNr48MoFry\">https://t.co/mNr48MoFry</a><br> <a href=\"https://t.co/VSERX5v9qL\">https://t.co/VSERX5v9qL</a><br><br>GROK GROK</p>&mdash; GROK (@GROKERC20) <a href=\"https://twitter.com/GROKERC20/status/1724113841930539516?ref_src=twsrc%5Etfw\">November 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/elon-slings-ai-artificial-intelligence-generated-insults-gpt-4-open-ai-sam-altman-ceo-mocks-grok\"><strong><em>Elon throws AI-generated insults at GPT-4 after OpenAI CEO mocks Grok</em></strong></a></p><p>At its peak price of $0.027 on Nov. 13, GROK commanded a market capitalization of nearly $200 million, making it one of the largest new memecoins in the current cycle.</p><p>The memecoin was launched on Nov. 5, the same day Elon Musk <a href=\"https://cointelegraph.com/news/elon-musk-launches-ai-chatbot-grok-says-it-can-outperform-chatgpt\">announced his supposed competitor</a> to OpenAI’s ChatGPT, Grok AI. Over the course of the following week, its value increased 33,650% as memecoin traders rushed to capitalize on the hype.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Just released Grok<a href=\"https://t.co/e8xQp5xInk\">https://t.co/e8xQp5xInk</a></p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1721027243571380324?ref_src=twsrc%5Etfw\">November 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\"><strong><em>Exclusive — 2 years after John McAfee’s death, widow Janice is broke and needs answers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-14T02:00:47.000Z",
    "title": "Ethereum Bulls May Propel Price To $3,100, Analyst Suggests",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-bulls-may-propel-price-to-3100-analyst-suggests/",
    "description": "Ethereum (ETH), the second-largest cryptocurrency, has seen a significant price increase over the past month. The recent bullish rush in the crypto market, coupled with BlackRock&#8217;s involvement, has pushed ETH to its year-to-date high of $2,139. Ethereum Outshines Bitcoin And Altcoins According to market data provider Kaiko, ETH has outperformed BTC and many altcoins in recent weeks, signaling a shift in market dynamics. Kaiko&#8217;s report highlights how ETH struggled to gain momentum over the past year, despite successful upgrades such as The Merge in April.  However, the sentiment around ETH changed dramatically when BlackRock filed for a spot ETH exchange-traded fund (ETF), leading to a reversal in the ETH to Bitcoin (BTC) ratio. Related Reading: XRP Price Path To $1: Exploring Two Potential Outcomes From The $0.66 Resistance Level The impact on the market was substantial, with ETH prices surging above $2,000 for the first time since April. Additionally, daily spot trade volumes reached $7 billion, the highest level since the collapse of FTX.  The ETH ETF narrative provided further impetus to the ongoing rally, amplified by improved global risk sentiment and declining US Treasury yields. The dominance of altcoin + ETH volume relative to BTC has risen to 60%, marking its highest level in over a year. During bull rallies, altcoin volume typically increases relative to BTC.  This surge in demand has also led to rising leverage, as reflected in the recovery of ETH open interest to early August levels. Notably, BTC open interest has declined over the past month due to liquidations on Binance, resulting in the Chicago Mercantile Exchange (CME) outpacing Binance as the largest BTC futures market. Furthermore, ETH funding rates, a gauge of sentiment and bullish demand, have reached their highest levels in over a year, indicating a significant shift in sentiment. In November, both BTC and ETH 30-day volatility rose to 40% and 50% respectively, following a multi-year low of around 15% during the summer months. Crypto Expert Predicts ETH Breakout Renowned crypto expert Michael Van de Poppe believes that ETH is on the cusp of a significant breakthrough. According to Van de Poppe, if Ethereum manages to surpass the crucial $2,150 resistance level, it could signify the end of the bear market.  Related Reading: Bitcoin Sharks &#38; Whales Do $2.2 Billion Selloff, But BTC Hangs On At $37,000 Drawing a parallel with Bitcoin&#8217;s critical $30,000 barrier, Van de Poppe suggests that breaching this level could pave the way for a substantial rally, potentially propelling Ethereum towards the price range of $3,100 to $3,600.  However, Ethereum has yet to touch the $2,150 resistance line, as it faces a pre-existing obstacle in the form of its yearly high of $2,139. This pivotal level has halted the cryptocurrency&#8217;s bullish momentum, acting as a formidable resistance.  As a result, Ethereum has been consolidating within a narrow range between $2,050 and $2,100 for the past three days. The forthcoming days will reveal whether Ethereum can overcome its immediate resistance levels and establish a consolidated position above them. Alternatively, it may face a fate similar to Bitcoin, which failed to surpass the $31,000 level for over seven months before reaching its current trading price of $36,000. Featured image from Shutterstock, chart from TradingView.com"
  }
]