[
  {
    "source": "Crypto Briefing",
    "date": "2023-07-31T10:28:56.000Z",
    "title": "DeFi Protocols Rocked by Latest Hacks Exploiting Vyper Language Vulnerabilities",
    "url": "https://cryptobriefing.com/defi-protocols-latest-hacks-exploiting-vyper/?utm_source=feed&utm_medium=rss",
    "description": "Hackers have zeroed in on a vulnerability in the Vyper programming language  a well-known tool widely used for developing Web3 projects that target the Ethereum Virtual Machine (EVM) ..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T10:26:41.000Z",
    "title": "Coinbase CEO reveals SEC’s controversial demand to delist cryptocurrencies",
    "url": "https://www.cryptopolitan.com/coinbase-ceo-reveals-secs-controversial-demand-to-delist-cryptocurrencies/",
    "description": "Coinbase, the largest cryptocurrency exchange in the United States, recently disclosed that the U.S. Securities and Exchange Commission (SEC) had requested the suspension of trading in all cryptocurrencies except bitcoin prior to initiating legal action against the firm. In an interview with the Financial Times, Coinbase CEO Brian Armstrong revealed that the SEC&#8217;s request came ... <a title=\"Coinbase CEO reveals SEC&#8217;s controversial demand to delist cryptocurrencies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-ceo-reveals-secs-controversial-demand-to-delist-cryptocurrencies/\" aria-label=\"More on Coinbase CEO reveals SEC&#8217;s controversial demand to delist cryptocurrencies\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-31T10:19:05.000Z",
    "title": "BSC suffers $73k Vyper attack following Curve Finance exploit",
    "url": "https://crypto.news/bsc-suffers-73k-vyper-attack-following-curve-finance-exploit/",
    "description": "The BNB Smart Chain (BSC) was hit by copycat attacks caused by a vulnerability in the Vyper programming language. It mirrors the Curve Finance defi protocol exploit. Blockchain security firm BlockSec revealed that as of July 30, approximately $73,000 worth&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-31T10:11:09.000Z",
    "title": "Binance unlocks new feature, DigiToads presents opportunities for investors",
    "url": "https://crypto.news/binance-unlocks-new-feature-digitoads-presents-opportunities-for-investors/",
    "description": "DigiToads is growing in popularity while Binance adds new features. TOADS might be listed as a meme coin in days ahead"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-31T10:30:23.000Z",
    "title": "The Litecoin $95 Question: Is A Bullish Breakout In The Pipeline?",
    "url": "https://www.newsbtc.com/news/the-litecoin-95-question-is-a-bullish-breakout-in-the-pipeline/",
    "description": "Litecoin (LTC) is facing a critical juncture in its price surge, with its value hovering just above $89.52 on CoinGecko, showcasing a modest 0.3% increase in the last 24 hours. However, LTC has endured a slump of 3.6% over the past seven days.  As the price continues to hover below the crucial resistance level of $95, investors are wondering if the muted performance of Bitcoin (BTC) will hinder LTC&#8217;s upward trajectory. Furthermore, all eyes are on the upcoming August halving event to determine if it will catalyze significant price action. Source: Coingecko Understanding Litecoin Halving In the context of cryptocurrencies like Litecoin, a halving is a programmed event that occurs when a specific number of blocks are mined on the blockchain. Litecoin, similar to Bitcoin, has a fixed supply cap and new coins are introduced into the market through mining.  Related Reading: Traders’ Interest In XRP Remains Solid Despite Price Retreat, Data Shows Source: Admiral Markets Approximately every four years, the mining reward for each block is cut in half, reducing the rate at which new coins enter circulation. This process is known as &#8220;halving&#8221; and is intended to control inflation by gradually limiting the supply of new coins. LTC&#8217;s price surge beyond $95 has encountered significant resistance, as this level had previously acted as support in early July. However, as BTC&#8217;s performance weakened, the support flipped to resistance, creating an obstacle to Litecoin&#8217;s advancement. The fate of LTC&#8217;s price action remains closely intertwined with Bitcoin&#8217;s performance, as the latter serves as a bellwether for the broader cryptocurrency market. Impact Of BTC&#8217;s Performance Being the most dominant and influential cryptocurrency, Bitcoin often dictates the market&#8217;s direction. If BTC remains weak, with its price currently at $29,414 at CoinGecko, Litecoin&#8217;s ability to break past the immediate $95 resistance level could be hindered.  LTC market cap currently at $6.89 billion on the daily chart: TradingView.com A retest of the 38.2% Fibonacci retracement level at $88 might be possible in such a scenario. On the other hand, a solid and decisive move by Bitcoin could have a positive knock-on effect on Litecoin, propelling it past the resistance and potentially sparking a more significant price rally. Related Reading: Shibarium Hype: Shiba Inu Whales Boost Appetite, Snag 1 Trillion SHIB Tokens As the Litecoin halving approaches, investors are speculating whether this event will drive a significant price surge. Historically, halvings have been associated with bull markets in cryptocurrencies, as the reduced supply of new coins can create a supply-demand imbalance, leading to higher prices. However, it&#8217;s essential to recognize that the market&#8217;s sentiment, overall health, and broader macroeconomic factors also play crucial roles in determining price movements. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from PublishOx"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-31T10:19:01.000Z",
    "title": "8-Year Dormant Ethereum Wallet Just Moved $1.2 Million In ETH, Here’s The Destination",
    "url": "https://www.newsbtc.com/news/ethereum/8-year-dormant-ethereum-wallet-just-moved-1-2-million-in-eth-heres-the-destination/",
    "description": "The Ethereum ecosystem has continued to see fascinating developments in the past weeks. Among the most notable is the sudden movement from a participant in Ethereum&#8217;s initial coin offering (ICO), who, after a roughly eight-year slumber, has sprung into action due to a reason. The Ethereum ICO participant, whose address remained inactive for 2,922 days, stirred up by transferring 641 ether, an amount currently valued at nearly $1.2 million. An Unexpected Move In The Ethereum Ecosystem The intent behind these transactions was revealed through on-chain analytics X (Twitter) account Lookonchain, noting that the Ethereum ICO participant had moved the funds to stake them. This reason has raised speculation among the crypto community as some suggest that the whale behind this move might know something they don&#8217;t. Related Reading: Ethereum Price Recovery Could Soon Fade If ETH Fails To Surpass $1,900 An Ethereum ICO participant woke up after 8 years of dormancy, transferred 641 $ETH out, and started staking. He received 2K $ETH($3.7M currently) at Ethereum Genesis, the ETH ICO price is ~$0.31.https://t.co/hGoCb22LVr pic.twitter.com/ZO09r9uFMd — Lookonchain (@lookonchain) July 31, 2023 Just over eight years ago, the same address received exactly 2,000 ETH from Ethereum&#8217;s Genesis. This amount of ETH at the time was worth $620 as the Ethereum network arranged an exceptional sale event then that made ETH sell for $0.31 per ETH. This event was before the network commenced its own token generation, providing a platform for early participants and co-founders to accrue pre-mined ETH. However, fast forward to nearly a decade later today, this same amount of 2,000 ETH is currently valued at over $3.72 million, showcasing the meteoric rise in the value of ETH since its inception. Notably, the awakening of this long-dormant Ethereum participant is not an isolated incident. It falls into a recent trend, observed over the summer, where several early ICO participants have begun transferring their ETH holdings. ICO Participants Stirring After A Long Hiatus This pattern of dormant Ethereum ICO participants springing into action isn&#8217;t new. Two weeks prior to the latest transaction, a pre-mined stash of Ethereum, which had been lying dormant for nearly eight years, was abruptly moved. At current rates, this stash is estimated to be worth more than $100 million. Related Reading: Pre-Mined Ethereum Worth $116M Moves After 8 Years: Is A Major Price Dip Imminent? This particular &#8216;whale&#8217; move grabbed the attention of the crypto community, stirring speculation and interest in equal measure. Interestingly, the motives behind this transfer remain largely unknown, adding an element of mystery to the whale movement. Regardless of these ICO participants&#8217; movement on the blockchain, Ethereum has seen a continuous downtrend in the past few weeks. Particularly, the asset is currently down by 3.2% in the past 14 days. ETH has declined from a high of trading above $1,900 to a trading price of $1,866, at the time of writing. Featured image from Unsplash, Chart from TradingView"
  }
]