[
  {
    "source": "CoinDesk",
    "date": "2023-10-19T16:13:20.000Z",
    "title": "'Absolutely Not': FTX's Former General Counsel Says He Never Approved Loans of Customer Funds",
    "url": "https://www.coindesk.com/policy/2023/10/19/absolutely-not-former-ftx-general-counsel-says-he-never-approved-loans-of-customer-funds/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Can Sun testified on day 12 of the Sam Bankman-Fried trial."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-19T16:30:00.000Z",
    "title": "Why the 2024 Bitcoin halving may play out differently than in the past ",
    "url": "https://cointelegraph.com/news/why-2024-bitcoin-halving-play-out-differently-than-previous",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/f1ff6c73-1d65-4f4d-bfb9-7217a68195c9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>While the halving event is considered one of the main catalysts for Bitcoin bull markets, it may play out differently next year.  </p>\n                    <p><p>The impact of the Bitcoin halving on crypto prices is often overestimated and the next halving, set for April 2024, may play out differently than previous ones, according to a leading analyst.</p><p>The halving event, which every four years, cuts in half the rate by which new Bitcoins are created, and is generally considered one of the main catalysts driving Bitcoin’s biggest upside moves. </p><p>Despite the bullish narrative surrounding the halving, however, the event by itself does not guarantee the appreciation of Bitcoin. </p><p>If the reduced supply of new Bitcoin is not accompanied by significant demand, prices are unlikely to surge. </p><p>Also, the halving is an entirely predictable event: that means all market participants know in advance when it will occur and therefore its current price may already be reflective of the halving's impact before it happens. </p><p>“Things that we most anticipate generally don't happen,” said Bloomberg analyst Mike McGlone, commenting on the much anticipated event. </p><p>“And that's what I'm concerned about. It's complete consensus,” he continued.</p><p>Also, each time the halving occurs, its impact on the new Bitcoin supply decreases; over time, its impact will eventually become irrelevant. Changes in demand, rather than supply, are therefore becoming the dominant factor influencing the price of Bitcoin. </p><p>So, how will the next Bitcoin halving impact the crypto market? And, if not the halving, what is the catalysts behind Bitcoin’s cyclical upside moves?  To find out, check out our latest Cointelegraph Report on our YouTube channel and don’t forget to subscribe! </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/bFT5QbDnaVI\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-19T16:26:04.000Z",
    "title": "Advocacy groups push back against Sen. Warren linking crypto with terrorism",
    "url": "https://cointelegraph.com/news/crypto-advocacy-groups-rebuttal-links-terrorism",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/1b42a6c6-3d19-416b-88d2-c61847bd866b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Blockchain Association and Crypto Council for Innovation said the terrorist group Hamas had reportedly curtailed using Bitcoin as authorities could more easily track funds.</p>\n                    <p><p>United States-based crypto advocacy organizations are calling out Senator Elizabeth Warren and other lawmakers for some of the claims made regarding connections between the terrorist group Hamas and financing through cryptocurrency.</p><p>On Oct. 17, Sen. Warren and more than 100 lawmakers <a href=\"https://cointelegraph.com/news/sen-warren-100-legislators-write-white-house-treasury-crypto-terrorism\">signed a letter</a> calling for action to “meaningfully curtail illicit crypto activity” used for funding Hamas and the Palestinian Islamic Jihad in the wake of an attack on Israelis. The Massachusetts Senator, a prominent crypto opponent in the U.S. Congress, also <a href=\"https://www.wsj.com/articles/cryptocurrency-feeds-hamass-terrorism-e0db54f5\" target=\"_blank\" rel=\"noopener nofollow\">penned</a> a Wall Street Journal op-ed with Sen. Roger Marshall on Oct. 18 with claims that “crypto-financed terrorism” endangered U.S. citizens by funding such groups as well as the production of illicit drugs. </p><p>Yaya Fanusie, director of anti-money laundering at the Crypto Council for Innovation, said Warren’s proposed solution to some of these issues would not address the problem occurring outside U.S. jurisdictions. Sen. Warren said her bill, the Digital Asset Anti-Money Laundering Act, was aimed at ensuring \"that the same rules to protect traditional payment systems from abuse are extended to crypto”.</p><p>“They are proposing KYC [Know Your Customer] rules akin to suggesting that copy machine manufacturers would need to KYC anyone using their copiers,” said Fanusie. “[Warren and Marshall] unfortunately fail to understand that the underlying blockchain technology actually makes transactions public, providing investigators a digital paper trail to identify terrorist operatives and their financial contributors.”</p><p>The Blockchain Association (BA) responded with similar claims in an Oct. 18 X (formerly Twitter) thread, pointing to <a href=\"https://www.reuters.com/world/middle-east/hamas-armed-wing-announces-suspension-bitcoin-fundraising-2023-04-28/\" target=\"_blank\" rel=\"noopener nofollow\">reports</a> from April that groups within Hamas stopped using Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) for supporting terrorist activities, as authorities could more easily track funds. According to the advocacy group, “only a small fraction of Hamas’s funding has come from crypto” and it was unclear how terrorists benefitted from those funds in the recent attacks on Israel. </p><p>“These proposals [Crypto-Asset National Security Enhancement and Enforcement and Digital Asset Anti-Money Laundering Act] will only punish law-abiding U.S.-based users and push all industry actors to other jurisdictions outside the reach of U.S. law enforcement,” said the BA.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ Any amount of funding that goes to support terrorist activity – in any form – is too much.<br><br>We share many of Sen. Warren’s questions – and we think further examination will reveal the limited and dwindling role that crypto played.<a href=\"https://t.co/jWwHNBe9oH\">https://t.co/jWwHNBe9oH</a></p>&mdash; Blockchain Association (@BlockchainAssn) <a href=\"https://twitter.com/BlockchainAssn/status/1714770551326024036?ref_src=twsrc%5Etfw\">October 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Sen. Warren’s op-ed <a href=\"https://cointelegraph.com/news/us-treasury-sanctions-crypto-operator-tied-hamas\">as well as sanctions imposed</a> by the U.S. Treasury’s Office of Foreign Assets Control followed an Oct. 7 attack by Hamas that resulted in the deaths of many Israelis. Israel has since declared war on the terrorist organization and began bombarding Gaza, creating a humanitarian crisis for hundreds of thousands of people caught in the crosshairs. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-freezes-hamas-linked-accounts-israeli-request\"><strong><em>Binance freezes Hamas-linked accounts after Israeli request</em></strong></a></p><p>Certain U.S. lawmakers, including Sen. Warren, have sometimes pointed fingers at crypto amid an international crisis, such as digital assets being used to <a href=\"https://cointelegraph.com/news/senator-warren-seizes-on-fears-over-crypto-and-sanctions-with-new-bill\">evade sanctions on Russia</a> in the wake of the country’s attack on Ukraine. Prior to Hamas’s attack on Israel, Warren was particularly outspoken in <a href=\"https://cointelegraph.com/news/crypto-bill-us-nine-senators-back-elisabeth-warren\">cracking down on crypto’s alleged role</a> in production of the drug fentanyl and other illicit purposes. </p><p>“Rather than politicizing this issue, [Sens. Warren and Marshall] should look to better support the talented and deeply knowledgeable people across multiple agencies who could use extra resources to help track down bad actors,” said Fanusie. “The U.S. should take proactive steps to make sure that law enforcement and national security officials have the best access to tools, training and expertise, and information that can be used to combat illicit activity, including around crypto.”</p><p>At the time of publication, it was unclear if any of Sen. Warren’s suggested bills would be able to move through Congress amid Republican members of the House of Representatives being unable to unite behind voting in a new Speaker. Since Speaker Kevin McCarthy’s position was declared vacant on Oct. 4, pro-crypto lawmaker and House Financial Services Committee chair Patrick McHenry <a href=\"https://cointelegraph.com/news/pro-crypto-lawmaker-house-speaker-following-vote\">has been acting</a> as interim Speaker. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/us-enforcement-agencies-turning-up-heat-crypto-related-crime/\"><strong><em>US enforcement agencies are turning up the heat on crypto-related crime</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-19T16:30:53.000Z",
    "title": "Unraveling the Online Legacy of Satoshi Nakamoto: Bitcoin’s Mysterious Creator",
    "url": "https://news.bitcoin.com/unraveling-the-online-legacy-of-satoshi-nakamoto-bitcoins-mysterious-creator/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/anon1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Unraveling the Online Legacy of Satoshi Nakamoto: Bitcoin&#039;s Mysterious Creator\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/anon1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/anon1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/anon1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/anon1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/anon1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/anon1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/anon1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The mysterious Satoshi Nakamoto appeared online nearly 600 times through emails and forum posts. Records of Nakamoto&#x2019;s writings indicate he was most active in July and August. While Nakamoto covered many topics, Bitcoin&#x2019;s inventor was notably visible when sharing new release candidates, discussing the addition of password protection to Bitcoin&#x2019;s JSON-RPC interface, and addressing the [&#8230;]"
  }
]