[
  {
    "source": "Decrypt",
    "date": "2024-02-22T02:01:02.000Z",
    "title": "Ronin Adds 'Kaidro' Role-Playing Game Following 'Pixels' Ethereum Token Launch",
    "url": "https://decrypt.co/218486/ronin-kaidro-game-rpg-pixels-token",
    "description": "Originally planned for Immutable X, the webcomic-based Kaidro game will instead launch on Ronin, home of Pixels and Axie Infinity."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-22T01:47:00.000Z",
    "title": "XRP Use Case? Ripple Inks Major Partnership In Egypt for Cross-Border Payments",
    "url": "https://www.cryptoglobe.com/latest/2024/02/xrp-use-case-ripple-inks-major-partnership-in-egypt-for-cross-border-payments/",
    "description": "The Commercial International Bank (CIB), one of Egypt’s largest banks, has partnered with fintech firm Ripple to incorporate blockchain technology into its operations, aiming to enhance the efficiency of cross-border payments. CIB is also venturing into the world of non-fungible tokens (NFTs) by enabling customers to create unique and collectible digital tokens in an initiative […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-22T02:00:34.000Z",
    "title": "Top Memecoins Face Pullback Amid Recent Market Rally",
    "url": "https://www.newsbtc.com/news/top-memecoins-face-pullback-amid-recent-market-rally/",
    "description": "The recent market rally has shown positive signals for many cryptocurrencies and has filled investors with optimistic expectations for the near future. Ignited by the ongoing Bitcoin Exchange-traded Fund (ETF) frenzy, whale accumulation, and meaningful updates from different projects, the market has shown significant growth during the first two months of 2024. Related Reading: Shiba Inu: Shibarium Transaction Activity Spike Amid Market Growth Memecoins Face Pullback Despite Growing Market In the last week, Bitcoin and Ether, the two largest cryptocurrencies by market capitalization, have met important milestones that have set the tone for the general market. BTC surpassed the $50,000 resistance zone 9 days ago and has shown strong support above this level ever since. Similarly, this Tuesday, Ether momentarily surpassed the $3,000 support zone for the first time in almost two years. Both milestones have fueled investor’s excitement for the crypto market. Nonetheless, the market showed signals of a momentary slowdown this Wednesday after many cryptocurrencies started seeing a red light decelerating their numbers. According to CoinGecko data, meme coins are not an exception. The sector&#8217;s market capitalization has declined 7.0% in the last 24 hours, currently at $21.9 billion and a total daily trading volume of $1.35 billion. Top 10 memecoins by market capitalization. Source: CoinGecko Top Memecoins Among The Biggest Losers As the chart above illustrates, eight of the top ten memecoins face a price downtrend in the 1-hour, one-day, and seven-day timeframes. Pepe (PEPE), dogwifhat (WIF), and FLOKI were among the biggest losers since yesterday. However, CorgiAI (CORGIAI) and PepeFork (PORK) prices show green numbers simultaneously. The top 3 memecoins by market capitalization follow the same trend as the memecoin market. At the time of writing, the prices of Dogecoin (DOGE), Shiba Inu (SHIB), and Bonk (BONK) are displaying negative numbers. Bonk BONK is leading the red path as the biggest loser in the memecoin top 10. Recently, the cryptocurrency saw a revival by its meteoric 25% on-day rally that propelled it back to the top 100 cryptocurrencies. The memecoin sits at the 114th spot of all cryptocurrencies, with a market capitalization of $692.3 million, representing a 5.8% decrease in the last 24 hours. BONK is trading at $0,00001148, indicating a 9.3% and 17.6% price drop in the last 24-hour and seven-day timeframes, respectively.  However, the token’s daily trading volume shows a 10,9% increase compared to yesterday, signaling a recent rise in market activity. Dogecoin As previously reported, DOGE has shown signs of embarking on a bullish recovery after whale activity fueled the rise in trading volume. The ecosystem’s activity increased in the last month, with more than 1 million transactions being processed daily since January 30. DOGE’s trading activity on the last day revealed a 39.3% decline in market activity for the token, with $597.9 million worth of trading volume. According to CoinGecko, its market capitalization sits at $11.88 billion. This indicates a 25% one-day decrease in performance that leaves the token out of the top 10 cryptocurrencies by this metric. Likewise, DOGE’s price shows a 3.5% pullback during the last day, currently trading at $0.083. Shiba Inu SHIB, like DOGE and BONK, has seen a considerable price reduction since yesterday and is currently trading at $0,09399, a 3.8% decrease in this time frame. While its market capitalization has also reduced in the last day (a 2.71% decrease), the daily trading volume for the 19th largest cryptocurrency has increased 15% in the previous 24 hours, at $300.8 million. Despite the recent data signaling a momentary loss of momentum for the memecoin market, it’s worth noting that the top 3 memecoins by market capitalization saw positive performance in the 14-day time frame. In the last two weeks, BONK has seen a 12.7% price upsurge, while DOGE and SHIB have increased a notable 5.6% and 5.9%, respectively. Related Reading: Crypto Riches: Altcoin Holders Swim In Profits, But There’s A Potential risk Altcoins market capitalization at $226.114 billion in the 1-day chart. Source: TradingView.com Featured image from Unsplash.com, Chart from TradingView.com and Coingecko.com"
  }
]