[
  {
    "source": "Decrypt",
    "date": "2024-02-29T20:20:06.000Z",
    "title": "Why Most Meme Coins Die Young",
    "url": "https://decrypt.co/219735/why-most-meme-coins-die-young",
    "description": "Meme coins are fun (and often funny), but most of them burn out fast rather than return fabled 1,000x gains. Here’s why."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-29T20:36:50.000Z",
    "title": " Microsoft launches AI-powered ‘Copilot for Finance’ ",
    "url": "https://cointelegraph.com/news/microsoft-launches-ai-artificial-intelligence-powered-copilot-for-finance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMzFmZjIyNjQtMTFkOC00Yjc1LThmNTMtM2U0ZTY2YWFmZmVjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The new service will provide automation features for the Microsoft 365 suite of productivity tools and applications. </p>\n                    <p><p>Microsoft launched “Copilot for Finance” in a public preview on Feb. 29. The new artificial intelligence-powered service integrates with the Microsoft 365 suite of productivity tools and provides generative AI and automation solutions to new and existing workflows.</p><p>Copilot is Microsoft’s version of a virtual AI assistant. Its integration into the Windows and Microsoft 365 ecosystems essentially adds ChatGPT-like functionality in a modality tailored specifically for productivity. </p><p>With the newly-launched “Copilot for Finance” version of the AI service, Microsoft is introducing end-to-end solutions specifically tuned for finance professionals.</p><p><a href=\"https://cointelegraph.com/news/microsoft-launches-ai-artificial-intelligence-powered-copilot-for-finance\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-29T20:15:25.000Z",
    "title": " BlackRock Brazil launching depositary receipts fund mirroring US BTC ETF ",
    "url": "https://cointelegraph.com/news/blackrock-brazil-launching-depositary-receipts-fund-mirroring-us-btc-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYmE4ZTAzNjQtMGRkMi00ZTQ3LTk1YmYtZDI2ZGRiMjM1NzFjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Brazilian ETF will launch March 1 on the B3 platform. There are already 13 Brazilian ETFs with crypto exposure.</p>\n                    <p><p>BlackRock’s iShares spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund will be available in Brazil thanks to the launch of a new BTC BDR (Brazilian Depositary Receipts) ETF. Trading will begin on March 1, the world’s largest asset manager announced on Feb. 29. </p><p>BlackRock will partner with Brazilian financial market infrastructure provider B3 to offer the new product, BlackRock Brazil president Karina Saade said at the company’s headquarters in São Paulo. Saade <a href=\"https://br.cointelegraph.com/news/blackrock-announces-launch-of-new-etf-in-brazil\">said</a>:</p><p>BDRs of foreign ETFs are securities issued in Brazil and backed by shares of ETFs issued abroad. The Brazilian ETF is thus effectively the same BTC ETF that BlackRock launched in the United States in January. It will mirror the U.S. ETF’s performance and carry an administrative fee of 0.25%, offset by a one-year exemption on the first $5 billion of assets under management (AUM). BDRs are fully taxable.</p><p><a href=\"https://cointelegraph.com/news/blackrock-brazil-launching-depositary-receipts-fund-mirroring-us-btc-etf\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-29T20:30:35.000Z",
    "title": "Bank of America’s Merrill and Wells Fargo offer Bitcoin ETF to wealth clients: Report",
    "url": "https://cryptobriefing.com/bank-of-america-merrill-and-wells-fargo-offer-bitcoin-etf/",
    "description": "Eric Balchunas of Bloomberg alerted its X followers about new Bitcoin ETF additions to wirehouse platforms."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-29T20:23:08.000Z",
    "title": "Grayscale CEO advocates for spot Bitcoin ETF options",
    "url": "https://crypto.news/grayscale-bitcoin-etf-options/",
    "description": "Grayscale renewed pressure on the SEC to greenlight options on spot Bitcoin ETF as the investment manager seeks new rails to onboard capital into its crypto fund."
  }
]