[
  {
    "source": "Decrypt",
    "date": "2024-03-18T18:30:39.000Z",
    "title": "Bitcoin Will Hit $150,000 This Year, Standard Chartered Analysts Say",
    "url": "https://decrypt.co/222155/bitcoin-150000-2024-standard-chartered-forecast",
    "description": "Continued success of the new Bitcoin exchange-traded funds will push the price of the cryptocurrency higher, the bank said. "
  },
  {
    "source": "Decrypt",
    "date": "2024-03-18T18:13:49.000Z",
    "title": "Memes Have a New Top Dog: Dogwifhat Ethereum NFT Sells for $4.3 Million",
    "url": "https://decrypt.co/222198/dogwifhat-ethereum-nft-sells-4-3-million",
    "description": "The South Korean parents of the pup featured in the Dogwifhat meme, Achi, will take home some $4.1 million from the NFT sale."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-18T18:35:32.000Z",
    "title": " Facing potential prison time, former Binance CEO hints at new project ",
    "url": "https://cointelegraph.com/news/changpeng-zhao-former-binance-ceo-new-project",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvN2RkMWI5YmItYzdhOC00NmUxLWI4ZTUtYzg3NTQyYTExYTVhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Since his guilty plea in November 2023, Changpeng Zhao has largely stayed off social media but broke this pattern to announce a project with “no new tokens.”</p>\n                    <p><p><a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/changpeng-zhao\">Changpeng “CZ” Zhao</a>, expected to return to court on April 30 to face a judge for sentencing over his guilty plea of one felony count, has hinted at a project with “no new tokens.”</p><p>In a March 18 X post, Zhao <a href=\"https://twitter.com/cz_binance/status/1769781668842471888\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> an education-focused project purportedly related to cryptocurrency or blockchain technology. The former Binance CEO said “no new tokens” would be involved in the mysterious project, adding he planned to release more details soon.</p><p>CZ resigned as CEO of Binance, one of the largest cryptocurrency exchanges in the world, in November 2023 as part of a plea agreement with United States authorities. The deal with the U.S. Justice Department, Department of the Treasury, and Commodity Futures Trading Commission required Binance to <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\">pay $4.3 billion as part of a settlement</a> and Zhao to plead guilty to one count related to failure to maintain an effective Anti-Money Laundering program at the exchange.</p><p><a href=\"https://cointelegraph.com/news/changpeng-zhao-former-binance-ceo-new-project\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-18T18:30:00.000Z",
    "title": " Price analysis 3/18: SPX, DXY, BTC, ETH, SOL, BNB, XRP, ADA, AVAX, DOGE ",
    "url": "https://cointelegraph.com/news/price-analysis-3-18-spx-dxy-btc-eth-sol-bnb-xrp-ada-avax-doge",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNGIwM2E1NzctY2M5ZS00N2Y3LTlhMDYtYjZmNmUzNWI5MDdmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Crypto traders are struggling to hold Bitcoin price above $68,000, and altcoins are suffering as a result of BTC's weakness.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) witnessed profit-booking in the past few days, but the bears could not sink the price below $64,500. However, Bitcoin may come under renewed selling pressure if history repeats itself. </p><p>Crypto analyst Rekt Capital said in a X post that Bitcoin was about to enter the “Danger Zone” when it tends to correct. That period happens to be 14 to 28 days leading up to the halving, which is expected on April 20 in this cycle. <a href=\"https://cointelegraph.com/news/bitcoin-entering-pre-halving-danger-zone-binance-crypto-ceos-bullish\">In 2020, Bitcoin had fallen 20%</a> during the said period, while in 2016, the correction was 40%.</p><p>Analysts will closely monitor the inflows into the spot Bitcoin exchange-traded funds (ETFs). If inflows remain steady during a pullback in Bitcoin, then the likelihood of the uptrend continuing remains high. However, if inflows dry up considerably, then the next leg of the uptrend may get delayed.</p><p><a href=\"https://cointelegraph.com/news/price-analysis-3-18-spx-dxy-btc-eth-sol-bnb-xrp-ada-avax-doge\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-18T18:32:51.000Z",
    "title": "Memecoin volumes are just vanity metrics for desperate blockchains",
    "url": "https://cryptoslate.com/memecoin-volumes-are-just-vanity-metrics-for-desperate-blockchains/",
    "description": "<p>There&#8217;s a misguided belief that memecoins are helping people out of poverty that I believe is really damaging to the space. More so, I think chains like Solana and Avalanche, which are seeing increased attention due to memecoin fervor, are incredibly overheated. Essentially, memecoin volumes are vanity metrics akin to likes and followers on social [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/memecoin-volumes-are-just-vanity-metrics-for-desperate-blockchains/\">Memecoin volumes are just vanity metrics for desperate blockchains</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-18T18:28:44.000Z",
    "title": "Stride and dYdX community consider major staking collaboration to secure network",
    "url": "https://www.cryptopolitan.com/stride-dydx-staking-collaboration-network/",
    "description": "Stride, a multichain liquid staking protocol, has proposed a collaboration with the dYdX community to stake 20 million DYDX tokens, equivalent to $67 million, from its community pool into Stride 2’s liquid staking protocol. The aim of the proposal is to enhance the economic security of the dYdX chain and redistribute stake weight among validators [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-18T18:19:22.000Z",
    "title": "AI Tool Demonstrates High Accuracy in Genetic Counseling Questions",
    "url": "https://www.cryptopolitan.com/ai-tool-demonstrates-high-accuracy-genetic/",
    "description": "In a groundbreaking study presented at the Society of Gynecologic Oncology&#8217;s Annual Meeting on Women&#8217;s Cancer, a team of researchers from NYU Langone Health and its Perlmutter Cancer Center unveiled the remarkable capabilities of a generative AI tool in answering common genetic counseling questions.&#160; Dr. Jharna M. Patel&#8217;s study showcased the potential of AI, particularly [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-18T18:16:52.000Z",
    "title": "Bitcoin long-term investors have started selling, potentially derailing $75k price rally",
    "url": "https://crypto.news/bitcoin-investors-selling-price-rally/",
    "description": "Bitcoin's price started the week positively, rising to reach a daily peak of $68,884, but with BTC long-term holders booking profits ahead of the halving event, the rally could be short-lived."
  }
]