[
  {
    "source": "Bitcoin.com",
    "date": "2024-01-24T05:00:03.000Z",
    "title": "Number of Crypto Owners Globally Reached 580 Million in 2023, Report Shows",
    "url": "https://news.bitcoin.com/number-of-crypto-owners-globally-reached-580-million-in-2023-report-shows/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/cryptocom-report-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Number of Crypto Owners Reached 580 Million Globally in 2023, Report Shows\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/cryptocom-report-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cryptocom-report-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cryptocom-report-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cryptocom-report-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cryptocom-report-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cryptocom-report-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/cryptocom-report.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The number of global crypto owners surged 34% in 2023, reaching 580 million by December, a new report shows. In particular, bitcoin ownership surged 33% while Ethereum saw an even steeper rise of 39%. The report pinpoints the approval of spot bitcoin exchange-traded funds (ETFs) and the Bitcoin Ordinals protocol as key drivers of bitcoin [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T05:00:16.000Z",
    "title": "California court orders Crowd Machine and Metavine to pay over $20M in CMCT case",
    "url": "https://www.cryptopolitan.com/crowd-machine-and-metavine-to-pay-over-20m/",
    "description": "In a recent court ruling, Crowd Machine and Metavine, the issuers of Crowd Machine Compute Tokens (CMCT), have been ordered to pay more than $20 million in disgorgement, interest, and penalties. The case, which began over two years ago, has also found the company&#8217;s founder, Craig Sproule, liable for his involvement. Background of the case [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T04:43:54.000Z",
    "title": "Investor exodus from Grayscale’s Bitcoin Trust (GBTC) drives Bitcoin below $39,000",
    "url": "https://www.cryptopolitan.com/gbtc-drives-bitcoin-below-39000/",
    "description": "Grayscale&#8217;s Bitcoin Trust (GBTC) has experienced a massive investor exodus, causing the price of Bitcoin to drop below the $39,000 mark for the first time in nearly two months. Since its successful transition to a spot Bitcoin exchange-traded fund (ETF) on January 11, GBTC has witnessed over $3.4 billion in outflows. As a response, Grayscale [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T04:36:39.000Z",
    "title": "Phishing attack on Mailer Lite results in $600,000 loss",
    "url": "https://www.cryptopolitan.com/phishing-attack-on-mailer-lite/",
    "description": "In a recent incident that has raised concerns over cybersecurity, digital marketing platform Mailer Lite fell victim to a phishing attack, resulting in a substantial financial loss exceeding $600,000. The attack, orchestrated by an unknown party, exploited a vulnerability within Mailer Lite&#8217;s system, allowing the perpetrator to impersonate web3 firms and send seemingly legitimate emails [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-24T04:50:44.000Z",
    "title": "Ethereum Price Plunge To $2K Imminent as Key Support Line Crumbles",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-plunge-to-2k-imminent-as-key-support-line-crumbles/",
    "description": "Ethereum price extended losses and tested the $2,150 support. ETH is struggling to recover and might continue to move down toward the $2,000 support zone. Ethereum started a fresh decline below the $2,350 and $2,250 levels. The price is trading below $2,250 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance near $2,240 on the hourly chart of ETH/USD (data feed via Kraken). The pair attempt a fresh increase if it clears the $2,240 and $2,280 levels. Ethereum Price Extends Losses Ethereum price remained in a bearish zone below the $2,400 pivot level. ETH extended its decline and traded below the $2,250 support level, like Bitcoin. It even spiked below the $2,000 level. A new weekly low was formed near $2,165 and the price is now consolidating losses. There was a minor increase above the $2,220 level. The price tested the 23.6% Fib retracement level of the downward wave from the $2,480 swing high to the $2,165 low. Ethereum is now trading below $2,250 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,240 level. There is also a key bearish trend line forming with resistance near $2,240 on the hourly chart of ETH/USD. The next hurdle could be $2,280, above which the price could aim for a decent recovery. The next major resistance is now near $2,360 or the 61.8% Fib retracement level of the downward wave from the $2,480 swing high to the $2,165 low. Source: ETHUSD on TradingView.com A clear move above the $2,360 level might start a decent increase. In the stated case, the price could rise toward the $2,415 level. Any more gains might send the price toward the $2,550 zone. More Losses in ETH? If Ethereum fails to clear the $2,440 resistance, it could start another decline. Initial support on the downside is near the $2,200 level. The next key support could be the $2,165 zone. A downside break below the $2,165 support might send the price further lower. In the stated case, Ether could test the $2,120 support. Any more losses might send the price toward the $2,000 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $2,165 Major Resistance Level – $2,480"
  }
]