[
  {
    "source": "CoinDesk",
    "date": "2024-02-01T00:03:12.000Z",
    "title": "Celsius to Distribute $3B Crypto to Creditors as Firm Emerges From Bankruptcy",
    "url": "https://www.coindesk.com/policy/2024/02/01/celsius-to-distribute-3b-crypto-to-creditors-as-firm-emerges-from-bankruptcy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The distribution will be made through PayPal and Coinbase."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-31T23:48:47.000Z",
    "title": "Solana's Jupiter Hits $1.2 Billion in Daily Volume, Outpacing Uniswap on Ethereum",
    "url": "https://decrypt.co/215162/solanas-jupiter-hits-1-2-billion-in-daily-volume-outpacing-uniswap-on-ethereum",
    "description": "Jupiter is seeing surging trading action amid the JUP airdrop on Solana—and it’s way ahead of Ethereum’s Uniswap V3."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-01T00:00:06.000Z",
    "title": " Bitcoin price stumbles after Fed dashes hopes for rate cuts in March ",
    "url": "https://cointelegraph.com/news/bitcoin-price-stumbles-fomc-federal-reserve-dashes-hopes-rate-cuts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMzBmYWM3YWItNGZmYS00NjZiLTk1YmUtNzE5M2Y2ZDUwYWU2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The price of Bitcoin dipped 2.5% after the Fed pressed pause on interest rates and dampened any hope of rate cuts next month. </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) stumbled on Wednesday after the United States Federal Reserve decided to leave interest rates unchanged, hosing down hopes for a potential rate cut in March.</p><p>During the Federal Open Markets Committee press conference on Jan. 31, the Fed Reserve Board <a href=\"https://www.federalreserve.gov/newsevents/pressreleases/monetary20240131a.htm\" target=\"_blank\" rel=\"noopener nofollow\">said</a> interest rates would stay at 5.25%-5.50%, adding that it would need “greater confidence” that inflation pressures had been dealt with before cutting rates. </p><p>The price of Bitcoin fell a little over 2.2% following the FOMC announcement and is currently changing hands for $42,590 — though it is still up 7% for the week, per TradingView <a href=\"https://www.tradingview.com/symbols/BTCUSD/\" target=\"_blank\" rel=\"noopener nofollow\">data</a>. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-stumbles-fomc-federal-reserve-dashes-hopes-rate-cuts\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-31T23:51:46.000Z",
    "title": " Celsius exits bankruptcy, commences return of over $3B to creditors ",
    "url": "https://cointelegraph.com/news/celsius-exits-bankruptcy-return-3b-creditors-ionic-digital",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvY2I0NTM5ZWYtMjc4YS00MWRhLTg5YWQtYTU3MTA1OGNjYjkyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Crypto lender Celsius’ exit from bankruptcy comes more than 18 months after it halted withdrawals, with creditors now set to get a share of $3 billion in crypto and fiat.</p>\n                    <p><p>Celsius has emerged from Chapter 11 Bankruptcy in the United States and is set to start distributing $3 billion worth of crypto and fiat to creditors.</p><p>In a Jan. 31 press <a href=\"https://www.businesswire.com/news/home/20240131994097/en/Celsius-Emerges-from-Chapter-11-and-Commences-Distributions-of-Over-3-Billion-of-Cryptocurrency-to-Creditors/\" target=\"_blank\" rel=\"noopener nofollow\">release</a>, the crypto lender said its bankruptcy exit will also see the creation of a Bitcoin mining company, Ionic Digital, Inc. managed by crypto mining firm Hut 8.</p><p>Hut 8's Chief Commercial Officer Matt Prusak was named CEO of Ionic, whose stock is \"expected to be publicly traded once the requisite approvals are received.\"</p><p><a href=\"https://cointelegraph.com/news/celsius-exits-bankruptcy-return-3b-creditors-ionic-digital\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-01T00:00:20.000Z",
    "title": "BlackRock wants to project Bitcoin ETF ads onto former banks, filing says",
    "url": "https://cryptoslate.com/blackrock-wants-to-project-bitcoin-etf-ads-onto-former-banks-filing-says/",
    "description": "<p>BlackRock proposed a campaign to project spot Bitcoin ETF advertisements onto the sides of buildings in a Jan. 31 SEC filing. The filing describes BlackRock&#8217;s plans in brief, noting: &#8220;The IBIT Signal is an animation designed to be projected onto the facades of former financial institutions in New York City, Miami, and Los Angeles. This [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/blackrock-wants-to-project-bitcoin-etf-ads-onto-former-banks-filing-says/\">BlackRock wants to project Bitcoin ETF ads onto former banks, filing says</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-01T00:00:58.000Z",
    "title": "China’s AML Legal Framework Set to Target Cryptocurrency Transactions in Major Update",
    "url": "https://news.bitcoin.com/chinas-aml-legal-framework-set-to-target-cryptocurrency-transactions-in-major-update/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/china_new_aml_laws-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"China to Tighten Grip on Digital Assets With Revised Anti-Money Laundering Law\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/china_new_aml_laws-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/china_new_aml_laws-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/china_new_aml_laws-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/china_new_aml_laws-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/china_new_aml_laws-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/china_new_aml_laws-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/china_new_aml_laws.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />As part of its ongoing efforts to modernize financial regulations, China is revising its Anti-Money Laundering laws to include stringent measures against cryptocurrency-related transactions. This revision, the first since 2007, aims to plug the legal gaps exploited in the burgeoning world of digital currencies. China to Tighten Grip on Digital Assets With Revised Anti-Money Laundering [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T23:58:13.000Z",
    "title": "US House Committee requests extended comment period on CFPB’s proposed digital asset rule",
    "url": "https://www.cryptopolitan.com/us-committee-request-extended-comment-period/",
    "description": "In a letter addressed to Consumer Financial Protection Bureau (CFPB) Director Rohit Chopra, leaders of the United States House Financial Services Committee and Subcommittee on Digital Assets, Financial Technology, and Inclusion have called for an extended comment period on the proposed rule from the CFPB.&#160; The lawmakers expressed concerns regarding the rule&#8217;s potential impact on [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-01T00:00:10.000Z",
    "title": "Exploit Causes XRP Price Crash: Ripple Co-founder Discloses Losses Of $113 Million",
    "url": "https://www.newsbtc.com/xrp-news/exploit-causes-xrp-price-crash-ripple-co-founder-discloses-losses-of-113-million/",
    "description": "XRP experienced a significant price drop early Wednesday amidst rumors of a potential exploit. The XRP price dropped more than 4% to $0.4853 but later recovered to $0.500 following a clarification from one of Ripple&#8217;s co-founders. Personal XRP Accounts Impacted, Not Ripple&#8217;s Initial reports suggested that Ripple had suffered a significant security breach, which was brought to light by decentralized finance (DeFi) investigator ZachXBT. These reports raised concerns about the overall security of the Ripple protocol. According to investigations, the breach resulted in the theft of more than 213 million XRP tokens, valued at over $112 million. The stolen funds were reportedly laundered through cryptocurrency exchanges, including MEXC, Gate, Binance, Kraken, OKX, HTX, and HitBTC. Related Reading: Why “Overbought” Bitcoin Could Trigger A 107% Rally However, Ripple co-founder Chris Larsen took to X (formerly Twitter) to clarify the situation. In a recent post, Larsen stated:  Yesterday, there was unauthorized access to a few of my personal XRP accounts (not Ripple) – we were quickly able to catch the problem and notify exchanges to freeze the affected addresses. Law enforcement is already involved. XRP Price Analysis Despite the recent security concerns, XRP is trading at $0.5085, marking a 3.4% decrease in the past 24 hours. However, beyond the Ripple co-founder&#8217;s personal account exploit, the XRP price has experienced a significant decline over the past month. Over the last seven days, the token has seen a minor 1.3% drop. The decline has deepened in the previous fourteen days with a 10% decrease. This is more problematic for XRP enthusiasts because the price has lost significant ground over the past 30 days, with an 18% dip. Related Reading: Analyst Compared Solana To Ethereum ICO Boom, What Does This Mean For SOL Price? Nevertheless, XRP bull and crypto analyst EGRAG Crypto provides an intriguing price analysis that could potentially encourage investors toward a price recovery if the token manages to hold and consolidate above the $0.500 level. According to EGRAG, a handful of chart analysts have noted that after wave 1 of the Elliott Wave theory, wave 2 could retrace up to 90% of wave 1. The initial targets of $0.85 to $1 were successfully reached during the July pump, with the price reaching around $0.93 after Ripple&#8217;s partial victory against the SEC in its ongoing legal battle over XRP classification. Currently, EGRAG suggests that a &#8220;wicking event&#8221; down to $0.41 is possible, considering a 10%-15% fluctuation due to the volatile nature of the crypto markets. However, the analyst points out that the upside lies in the upcoming Wave 3, which is influenced by Wave 1 and typically has a ratio of 1.618 compared to Wave 1. If all of this plays out, EGRAG ultimately sees the next short-term target for XRP being the all-time high (ATH) at $5. If the original wave count is adjusted, the range could be between $2.2 and $2.8. Featured image from Shutterstock, chart from TradingView.com"
  }
]