[
  {
    "source": "CoinDesk",
    "date": "2024-03-21T15:00:07.000Z",
    "title": "Protocol Village: Fluence's 'Cloudless Platform' Goes Live as Alternative to AWS, Google Cloud",
    "url": "https://www.coindesk.com/tech/2024/03/20/protocol-village/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of March 21-26."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-21T15:00:46.000Z",
    "title": "Avalanche 'Meme Coin Rush' Offers $1 Million in Rewards for Traders",
    "url": "https://decrypt.co/222671/avalanche-meme-coin-rush-1-million-rewards-traders",
    "description": "The Avalanche Foundation is capitalizing on the meme coin craze with incentives to boost meme coins like Kimbo, Coq Inu, and Gecko."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-21T15:02:11.000Z",
    "title": "Bitcoin’s March madness: Short-term holders bear the brunt of volatility",
    "url": "https://cryptoslate.com/insights/bitcoins-march-madness-short-term-holders-bear-the-brunt-of-volatility/",
    "description": "<p>Quick Take March has proven to be a tumultuous month for Bitcoin, showcasing fluctuations from an opening at roughly $61,000 to a steady rise above $67,000. Despite this progress, the path was not without its challenges. On March 20, Bitcoin experienced a notable decline to $60,700, marking an 18% fall from its peak above $73,000 [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoins-march-madness-short-term-holders-bear-the-brunt-of-volatility/\">Bitcoin&#8217;s March madness: Short-term holders bear the brunt of volatility</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-21T14:52:12.000Z",
    "title": "Solana (SOL) and Avalanche (AVAX) Investors Eye KangaMoon As It Records Over $2M in Presale Funding",
    "url": "https://cryptodaily.co.uk/2024/03/solana-sol-and-avalanche-avax-investors-eye-kangamoon-as-it-records-over-2m-in-presale-funding",
    "description": "The growing interest in the meme coin space has led investors to eagerly watch emerging projects like KangaMoon (KANG) as it recently achieved a remarkable milestone"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-21T14:58:49.000Z",
    "title": "New AI Tools Revolutionize Science Communication",
    "url": "https://www.cryptopolitan.com/ai-tools-revolutionize-science-communication/",
    "description": "The advent of Large Language Model (LLM)&#8211;based AI tools is revolutionizing science communication, offering both unprecedented opportunities and challenges. These tools, integrated into various stages of the scientific process, are reshaping how knowledge is generated, shared, and understood. Expanding reach through AI applications LLM-based AI applications enable rapid summarization of specialist publications into easily digestible [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-21T14:51:45.000Z",
    "title": "Unveiling Rise of the Ronin: A Comprehensive Guide for Players",
    "url": "https://www.cryptopolitan.com/unveiling-rise-of-the-ronin/",
    "description": "With the imminent release of Rise of the Ronin, an action RPG set in the Bakumatsu era of Japan, developers Yosuke Hayashi and Fumihiko Yasuda from Team Ninja have shared valuable insights to enhance players&#8217; gaming experience. Scheduled for launch on March 22nd, 2024, exclusively for the PS5, this game promises an immersive open-world adventure. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-21T14:48:24.000Z",
    "title": "FTX’s caretaker CEO calls Sam Bankman-Fried a deluded criminal",
    "url": "https://www.cryptopolitan.com/ray-sam-bankman-fried-a-deluded-criminal/",
    "description": "John Ray, the man placed in charge of FTX post-disaster, has once again slammed the exchange&#8217;s founder and former CEO, the infamous Samuel Bankman-Fried, as a &#8220;deluded criminal&#8221; responsible for one of the greatest, yet nonsensical, scams in history. Ray&#8217;s new critique comes ahead of Sam&#8217;s impending sentencing, and it accuses him of deceit, arrogance, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-21T14:53:12.000Z",
    "title": "Coinbase chief lawyer urges SEC to approve Ethereum ETFs",
    "url": "https://crypto.news/ethereum-etfs-coinbase-sec/",
    "description": "The SEC has no compelling reason to reject applications to launch an Ethereum ETF, says Coinbase chief legal officer Paul Grewal."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-21T14:41:16.000Z",
    "title": "Shiba Inu and Cardano investors drawn to Pushd’s presale",
    "url": "https://crypto.news/shiba-inu-and-cardano-investors-drawn-to-pushds-presale/",
    "description": "Amidst market shifts, SHIB and ADA holders seek alternative avenues in Pushd's presale, signaling a potential shift in retail investment strategies. #partnercontent"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-21T15:00:48.000Z",
    "title": "Bitcoin Pullback Has Ended? Analyst Declares “Worst Is Over”",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-pullback-has-ended-analyst-declares-worst-is-over/",
    "description": "After a stunning retrace, Bitcoin witnessed a notable recovery as Wednesday closes rising from the $61,000 price mark to $67,000, triggering hopes within the cryptocurrency community that a bullish movement might be imminent. However, the crypto asset has not exactly returned to the point it was a week ago, especially since BTC reached a new all-time high last week when it surged beyond $73,000. Bitcoin Correction Has Bottomed Out With Bitcoin surpassing its previous all-time high and rising even further to set a new peak of $73,000, March has been a momentous month for the cryptocurrency. And following the recent recovery, several cryptocurrency experts and traders believe that the recent price correction has reached rock bottom. Related Reading: Hold Your Horses: ‘Buying The Crypto Dip Is Still Too Early’ Warns Top Analyst — Here’s Why Crypto analyst and enthusiast, Crypto Jelle has offered a positive prediction regarding the price action of Bitcoin and its potential to move upward. His analysis delves into the current state of BTC&#8217;s price and the possibility of the retracement coming to an end. According to Crypto Jelle, the average correction in &#8220;this bull market is almost 20%.&#8221; Meanwhile, the pullback is &#8220;roughly 18% deep&#8221; presently. As a result, Jelle believes that &#8220;we have most likely witnessed the worst of the drop,&#8221; suggesting that the price might be ready to undergo full recovery.  Jelle claims that the fall &#8220;should be bottoming out&#8221; any moment from now. However, this might not be happening soon, since &#8220;these things take time to form,&#8221; urging the crypto community not to rush it. The post read: The average pullback in this bull market is almost 20%. Since the current downturn is just about 18% deep, the worst is most likely behind us. Although these things take time to form, the bottom should be close. Do not rust it. In another X post, Crypto Jelle noted that the market has once again begun to &#8220;display signs of a local bottom.&#8221; Due to this, the largest cryptocurrency asset by market cap still has &#8220;work to do.&#8221; Crypto Jelle anticipates Bitcoin to hold above the $65,300 threshold, in order for the price to &#8220;regain that 2021 bull cycle peak.&#8221; Additionally, when his forecast takes place, he believes that prices &#8220;will be off&#8221; in the upward direction in no time. Amount Of BTC To Buy Using DCA Strategy As Bitcoin continues to struggle, crypto analyst Ali Martinez has underlined the amount of BTC to purchase within specific price levels using the Dollar-Cost Averaging (DCA) strategy. Related Reading: Bitcoin Pre-Halving Dip Expected: Will BTC Rally Before US Fed Decision? According to Martinez, when BTC is within the range of $65,130, $64,130, $63,130, and $62,130, investors should buy 0.5 BTC. Meanwhile, at the $61,130, $60,130, $59,130, and $58,130 levels, investors should acquire about 0.65 BTC. Furthermore, around $57,130, $56,130, $55,130, and $54,130, Martinez advocates the acquisition of 0.8 BTC. Lastly, a portion of 0.95 BTC should be purchased around $53,130, $52,130, $51,130, and $50,130. At the time of writing, Bitcoin was trading at $67,299 on the daily timeframe, indicating an increase of over 4%. Its market cap has risen by 4.97% in the past day, while its trading volume is down by over 12%. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-21T14:42:37.000Z",
    "title": "Bitget Lists Toadie (TOAD) – Unlocking a Realm of Possibilities in the Memecoin World",
    "url": "https://www.crypto-news-flash.com/bitget-lists-toadie-toad-unlocking-a-realm-of-possibilities-in-the-memecoin-world/?utm_source=rss&utm_medium=rss&utm_campaign=bitget-lists-toadie-toad-unlocking-a-realm-of-possibilities-in-the-memecoin-world",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/TOAD_1711030693skfS8pNdqQ.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/TOAD_1711030693skfS8pNdqQ.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/TOAD_1711030693skfS8pNdqQ-300x180.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/TOAD_1711030693skfS8pNdqQ-768x461.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/TOAD_1711030693skfS8pNdqQ-150x90.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/TOAD_1711030693skfS8pNdqQ-450x270.png 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Victoria, Seychelles, March 21st, 2024, Chainwire Bitget, a leading cryptocurrency exchange and Web3 company, is thrilled to announce the listing of Toadie (TOAD), a memecoin project that transforms NFTs into gateways to a vibrant digital ecosystem. In the captivating universe of Toadie, NFTs transcend traditional digital collectibles, serving as keys to unlock a realm of [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-21T14:49:26.000Z",
    "title": "OKX Ends Services in India",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/okx-ends-services-in-india/",
    "description": "<p>OKX clients in India must close positions by April end, then can only withdraw funds. This shift is pivotal for OKX and its Indian users, showing regulatory frameworks&#8217; impact on global crypto exchanges. OKX&#8217;s Departure: A Regulatory Impact Case The decision by OKX is a direct response to the evolving regulatory landscape in India. In [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/okx-ends-services-in-india/\">OKX Ends Services in India</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-21T14:48:00.000Z",
    "title": "DEX Volumes Surge on Fantom, Will FTM Lead The Bull Run in 2024?",
    "url": "https://coinedition.com/dex-volumes-surge-on-fantom-will-ftm-lead-the-bull-run-in-2024/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Fantom-Price-Analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Fantom-Price-Analysis\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Fantom-Price-Analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Fantom-Price-Analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Fantom-Price-Analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Fantom-Price-Analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Fantom-Price-Analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A crypto data analyst at Hashed, Subin An on X, has spotted notable developments in the Fantom decentralized ecosystem. According to An, since the DeFi summer of 2020, decentralized exchange (DEX) volume on Fantom has significantly decreased. However, he observed that the monthly active addresses (MAU) during the same period remained above 400,000. The data [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/dex-volumes-surge-on-fantom-will-ftm-lead-the-bull-run-in-2024/\">DEX Volumes Surge on Fantom, Will FTM Lead The Bull Run in 2024?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]