[
  {
    "source": "Cointelegraph",
    "date": "2023-08-22T15:52:04.000Z",
    "title": "Bitcoin analyst eyes ‘V-shape’ BTC price bounce as RSI hits 5-year low",
    "url": "https://cointelegraph.com/news/bitcoin-analyst-btc-price-bounce-rsi-low",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/59ff5501-346a-4e69-bbc9-c92730c3290c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price’s “death chop” continues to characterize the aftermath of last week's Bitcoin flash crash.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) stayed stubbornly anti-trend on Aug. 22 as $26,000 became a magnet for intraday BTC price action.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3749757a-efd0-4556-aa43-d7cec23b21d0.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>BTC price “death chop” returns</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> tracked a third day of sideways performance for BTC/USD.</p><p>Despite being heavily oversold, according to relative strength index (RSI) readings, Bitcoin refused to offer any form of recovery bounce from levels last seen two months prior.</p><p>Market participants were restless, with popular trader Jelle <a href=\"https://twitter.com/CryptoJelleNL/status/1693980743083417758\" target=\"_blank\" rel=\"noopener nofollow\">referring</a> to intraday movements as the “death chop.”</p><p>“At this stage it feels like a game of chicken to see who is going to make a move to break the chop,” monitoring resource Material Indicators <a href=\"https://twitter.com/MI_Algos/status/1693987249103532224\" target=\"_blank\" rel=\"noopener nofollow\">said</a>.</p><p>Analyzing liquidity on the Binance BTC/USD order book, Material Indicators noted a broad lack of liquidity, increasing the potential for a sharp move in either direction.</p><p>“The market is waiting to see if more bid or more ask liquidity is going to be attracted to the range,” it explained on X (formerly known as Twitter). </p><blockquote>“So far, we are seeing small amounts of bid liquidity ladder up from $20k closer to the active trading zone, but no liquidity of any size (new or moved) has been stacked into the range defending price from a Lower Low.”</blockquote><p>The implications were nonetheless <a href=\"https://cointelegraph.com/news/bitcoin-bearadise-20k-back-btc-price-target\">potentially very serious for bulls</a>, with a lower low (LL) apt to risk even the $20,000 support going forward.</p><p>“Needless to say, printing a LL in this TF has macro implications. Printing 2 LLs would push #BTC down to sub $20k levels,” Material Indicators concluded.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/1990eedd-0e33-4078-b50e-27040c40c2b4.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD order book data for Binance annotated chart. Source: Material Indicators/X</em></figcaption></figure><h2>RSI strengthens “V-shape recovery” thesis</h2><p>Zooming out, hope remained that Bitcoin could rescue its overall uptrend.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-new-bull-cycle-bottomed-70-gains\">Bitcoin is in ‘new bull cycle’ — Metric that bottomed before 70% gains</a></em></strong></p><p>In a dedicated YouTube update on Aug. 22, Michaël van de Poppe, founder and CEO of trading firm Eight, <a href=\"https://www.youtube.com/watch?v=uERoqFZM_Ik\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> the heavily oversold signals being generated by RSI.</p><p>On 12-hour timeframes, the RSI measured less than 19 at the time of writing — near its lowest levels since the 2018 bear market bottom. Daily levels were similar, reaching their lowest since the March 2020 COVID-19 cross-market crash.</p><p>“Every time we see such a move, you get a sort of V-shape recovery back up, and it finds equilibrium on a higher floor,” Van de Poppe said about previous BTC price flash crashes.</p><p>He added that it was “very likely” that Bitcoin could stage a comeback to focus on $26,500 or more next.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/a21f98ca-a1d6-46aa-afcd-3378e8fb3f3e.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 12-hour chart with RSI. Source: TradingView</em></figcaption></figure><p>“Current #Bitcoin price action reminds me of September 2020 -- just before the start of the previous bull market,” Jelle meanwhile <a href=\"https://twitter.com/CryptoJelleNL/status/1693901821180284990\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> alongside a comparative chart. </p><blockquote>“Absorption and slowly grind higher here for a while -- and I could see this play out similarly.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f9aef18b-25e7-47d2-83ea-03a40253431d.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD comparative chart. Source: Jelle/X</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-22T16:00:00.000Z",
    "title": "\n                        BIS says regulate crypto - don’t ban it\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/bis-says-regulate-crypto-dont-ban-it",
    "description": "\n                        <p dir=\"ltr\">The Bank for International Settlements (BIS), in its recent study, emphasised the importance of judiciously regulating cryptocurrencies rather than imposing outright bans.&nbsp;</p>\nCrypto is a mirage\n<p dir=\"ltr\">The study hinted at the increasing allure of digital currencies but cautioned against their mirage-like appeal. The research by BIS, a global financial institution known as the \"central bank for central banks\", pointed out the swelling enthusiasm for digital currencies. They cited their promise for faster and cheaper remittances, increased financial inclusion, and potential as an alternative investment vehicle.</p>\n<p dir=\"ltr\">However, it's not all sunshine and rainbows; the BIS also underlined some inherent vulnerabilities. These include potential misuse for illicit activities, energy concerns associated with crypto mining, and heightened market risks.</p>\nA complete ban is not the answer\n<p dir=\"ltr\">The BIS study further stressed that simply banning these digital currencies might not be the solution. Outlawing them could stifle innovation and push activities to unregulated sectors, increasing risks.&nbsp;</p>\n<p dir=\"ltr\">Instead, the institution recommends establishing robust regulatory frameworks. These frameworks should prioritise transparency, combat illicit activities, and protect consumers while fostering technological advancements in the financial space.</p>\n<p dir=\"ltr\">The paper concludes by highlighting that while cryptocurrencies are indisputably transformative, their optimal utility can only be realised in a well-regulated environment. It's a balance of harnessing their potential while ensuring they don't jeopardise the broader financial ecosystem's stability.</p>\nOpinion\n<p dir=\"ltr\">It should be borne in mind when reading the BIS report that this organisation is set on seeing central bank digital currencies (CBDCs) rolled out across the globe. CBDCs are only an extension of the existing fiat currencies but they can also be used to totally control spending, right down to the individual level.</p>\n<p dir=\"ltr\">The BIS admits to being worried about cryptocurrencies going elsewhere if they are banned in certain countries, so their thinking is to put crypto into a regulatory straitjacket in order to stop private money in its tracks.&nbsp;</p>\n<p dir=\"ltr\">To central banks and central planners decentralised money is anathema. They see the danger to the continuance of the fiat monetary system that bitcoin and cryptocurrencies present and will fight tooth and nail to suppress this new technology in order to be able to establish CBDCs and thereby obtain ultimate control over citizens.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-22T16:00:41.000Z",
    "title": "Biggest Movers: MATIC 5% Lower on Tuesday, Hitting a 2-Month Low",
    "url": "https://news.bitcoin.com/biggest-movers-matic-5-lower-on-tuesday-hitting-a-2-month-low/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2229891563-2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: MATIC 5% Lower on Tuesday, Hitting a 2-Month Low\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2229891563-2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2229891563-2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2229891563-2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2229891563-2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2229891563-2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2229891563-2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2229891563-2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Polygon was one of the biggest movers in crypto markets on Tuesday, as the token fell by over 5% in today&#x2019;s session. The decline saw the token fall to its weakest point in two months, breaking out of a key support point in the process. Cardano was also in the red today. Polygon (MATIC) Polygon [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T15:57:50.000Z",
    "title": "Nomura’s crypto custody firm Komainu wins full operating license in Dubai",
    "url": "https://www.cryptopolitan.com/nomuras-crypto-custody-firm-komainu-wins-full-operating-license-dubai/",
    "description": "Komainu, a digital asset custody joint venture founded by Nomura, CoinShares, and tech firm Ledger, has received a full operating license from Dubai&#8217;s Virtual Asset Regulatory Authority (VARA). This significant milestone comes after Komainu secured its Minimum Viable Product (MVP) license in the previous year, designating it as one of the initial entities to receive ... <a title=\"Nomura’s crypto custody firm Komainu wins full operating license in Dubai\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nomuras-crypto-custody-firm-komainu-wins-full-operating-license-dubai/\" aria-label=\"More on Nomura’s crypto custody firm Komainu wins full operating license in Dubai\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-22T15:50:13.000Z",
    "title": "Shiba Inu Community Leaves Shibarium Launch Troubles Behind As Wallet Count Crossed 10 Million",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-shibarium-launch-wallet/",
    "description": "Shibarium, the scaling solution from the Shiba Inu team, has achieved new milestones after experiencing a significant wave of adoption and user engagement following its launch.  SHIB Community Euphoria Sparks Shibarium Meteoric Rise According to a report on August 21, the Shiba Inu ecosystem recorded an astonishing number of new wallets, with over 10 million wallets registered following the launch of the Shibarium network. The layer-2 network also recorded over 160 million compute units and a large deposit of ETH and BONE tokens, 1,000 and 600,000 respectively.  Related Reading: Gemini Hits Back At SEC Lawsuit With Dismissal Filing Shibarium’s unexpected rise in user adoption has not been the only noteworthy change the layer 2 scaling solution has experienced. According to reports, Shibarium has experienced a staggering increase in BONE staking. Over 7,569,580 BONE Shibaswap tokens were staked on the Shibarium network.  The Shiba Inu community’s response to the Shibarium launch has left the SHIB team members dumbfounded. The enormous engagement from the community reportedly led to a temporary suspension of Shibarium for 30 minutes as the network’s capacity was overwhelmed by the unusual level of user activities.  Lucie, a marketer for the Shiba Inu ecosystem, was astonished by the overwhelming success Shibarium experienced. She revealed in a post on X that the Shiba Inu development team had miscalculated the amount of adoption and interest the Shibarium mainnet would garner.  Let’s be honest! My $BONE, $SHIB, and $LEASH dropped a lot, just like the whole market. Was I unhappy with @ShytoshiKusama? No! They kept their promises, but they made one mistake. They didn&#8217;t understand how much the #SHIBARMY wanted to be on #Shibarium. I&#8217;m glad they… pic.twitter.com/z6kUSpUKQx — 𝐋𝐔𝐂𝐈𝐄 &#124; Summer of Shibarium (@LucieSHIB) August 20, 2023 She also highlighted that the unexpected surge in adoption may have been fueled by the community’s desire to embrace the benefits of potential low-cost transactions and increased efficiency on the Shibarium mainnet.  SHIB falls below critical support level &#124; Source: SHIBUSD on Tradingview.com Shiba Inu Lead Developer Addresses Shibarium Network Issues Following the temporary halt of the Shibarium network, Shiba Inu’s head developer, Shytoshi Kusama addressed investors&#8217; concerns regarding the halt. He pointed out that the issues rose from an unexpected increase in users, while reports revealed that transactions on Shibarium were paused for over 10 hours as a result of a server failure and a faulty bridge.  Related Reading: Dogecoin Proof Of Stake Discussion Heats Up As Lead Dev Chimes In Kusama has, however, reassured the SHIB community, stating that the Shibarium mainnet was proceeding smoothly. He explained that the Shibarium network was undergoing various tests and reconfigurations to ensure that the network can withstand a high influx of users in the future.  He further added that several features have been integrated into the network including a rate-limiting at RPC level and an auto server reset to prevent future outages. Following this, reports suggest that Shibarium’s testing processes have seen significant success and the network is poised to reopen soon.   Featured image from Unsplash, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-22T15:59:18.000Z",
    "title": "Cardano’s NFT Floor Price Surges, Overtaking Ethereum: A Shift in the NFT Landscape",
    "url": "https://www.crypto-news-flash.com/cardanos-nft-floor-price-surges-overtaking-ethereum-a-shift-in-the-nft-landscape/?utm_source=rss&utm_medium=rss&utm_campaign=cardanos-nft-floor-price-surges-overtaking-ethereum-a-shift-in-the-nft-landscape",
    "description": "<img width=\"800\" height=\"533\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154-48x32.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />The NFT market is witnessing a significant shift, with Cardano&#8217;s NFT floor price 22% higher than Ethereum&#8217;s, implying growing interest in Cardano&#8217;s NFT trading potential.  Cardano&#8217;s NFT price surge, Ethereum, maintains trading volume dominance, according to CryptoSlam data.  The NFT market is undergoing a significant change, demonstrated by Cardano&#8217;s NFT floor price index is 22% [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-22T15:50:06.000Z",
    "title": "Vechain Tech Update Series: August 2023 Unveils Cutting-Edge Developments",
    "url": "https://www.crypto-news-flash.com/vechain-tech-update-series-august-2023-unveils-cutting-edge-developments/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-tech-update-series-august-2023-unveils-cutting-edge-developments",
    "description": "<img width=\"1280\" height=\"768\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"VeChain blockchain\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-48x29.jpg 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />VeChain brought enhancements to the Web3-as-a-service platform VORJ, with increased flexibility for both individuals and businesses to deploy digital assets and incorporate blockchain APIs. VeChain is gearing up for the launch of VeWorld, a wallet ecosystem upgrade that introduces several innovative features to elevate user experience and enhance VechainThor&#8217;s capabilities. World&#8217;s leading smart contract platform [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-22T15:41:20.000Z",
    "title": "Meme Coin Crash? Shiba Inu, Dogecoin, and Pepe Coin Slide, While New Meme Coin ApeMax Booms with Presale",
    "url": "https://www.crypto-news-flash.com/meme-coin-crash-shiba-inu-dogecoin-and-pepe-coin-slide-while-new-meme-coin-apemax-booms-with-presale/?utm_source=rss&utm_medium=rss&utm_campaign=meme-coin-crash-shiba-inu-dogecoin-and-pepe-coin-slide-while-new-meme-coin-apemax-booms-with-presale",
    "description": "<img width=\"512\" height=\"287\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-100.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-100.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-100-300x168.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Meme coins like Shiba Inu (SHIB), Dogecoin (DOGE), and Pepe Coin (PEPE) have taken a hit in the market, posting significant losses over the last week. The sudden decline of these popular meme coins comes in stark contrast to the rising star of the meme coin world – ApeMax. This article delves into the meteoric [...]"
  }
]