[
  {
    "source": "Decrypt",
    "date": "2023-08-17T09:35:01.000Z",
    "title": "$1.7M of Ethereum 'Stuck' in SHIB Layer-2 Network Shibarium",
    "url": "https://decrypt.co/152773/1-7m-ethereum-stuck-shib-layer-2-network-shibarium",
    "description": "The much-anticipated Shibarium layer-2 network has been marred by a key technical issue with its bridge contract."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-17T09:25:41.000Z",
    "title": "Sotheby's and Yuga Labs respond to lawsuit from Bored Ape investors",
    "url": "https://cointelegraph.com/news/nft-bored-ape-sotheby-s-and-yuga-labs-respond-to-lawsuit-from-bored-ape-investors",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/9982ade2-fa6a-4ca2-9c3a-d3894d9c36e3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Art broker Sotheby's has been named in the Bored Ape investors case against NFT company Yuga Labs, which said that the new allegations are without merit and described the complaint as \"opportunistic.\"  </p>\n                    <p><p>Fine arts auction firm Sotheby’s has recently been named in the class-action lawsuit filed by Bored Ape Yacht Club (BAYC) investors against BAYC creators Yuga Labs. The investors allege that the auction house helped Yuga Labs “deceptively promote” the <a href=\"https://cointelegraph.com/learn/nonfungible-tokens-how-to-get-started-using-nfts\">nonfungible token (NFT)</a> collection. </p><p>On Dec. 10, BAYC investors <a href=\"https://cointelegraph.com/news/yuga-labs-moonpay-faces-lawsuit-over-celebrities-nft-promotion\">filed a class-action lawsuit</a> against over 40 defendants including Yuga Labs and celebrities like Post Malone, Justin Beiber and Paris Hilton. The lawsuit alleged that Yuga Labs and the celebrities were able to “artificially increase” the prices of the NFTs through celebrity promotions. </p><p>In a new development, Sotheby’s has been named in an <a href=\"https://www.courtlistener.com/docket/66623942/adonis-real-v-yuga-labs-inc/\" target=\"_blank\" rel=\"noopener nofollow\">amendment</a> to the lawsuit. On Sept. 10, 2021, Sotheby's auctioned 101 BAYC NFTs which <a href=\"https://cointelegraph.com/news/101-bored-apes-nft-auction-at-sotheby-s-closes-at-more-than-24m\">generated over $24 million</a> in sales. According to the plaintiffs, the auction house’s 2021 NFT auction allegedly helped make Yuga Labs look legitimate and misled the investors. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/AuctionUpdate?src=hash&amp;ref_src=twsrc%5Etfw\">#AuctionUpdate</a> 101 Bored Ape Yacht Club NFTs just sold for $24.4 million and 101 Bored Ape Kennel Club NFTs achieved $1.8 million in our Ape in! auction - the most significant <a href=\"https://twitter.com/hashtag/BAYC?src=hash&amp;ref_src=twsrc%5Etfw\">#BAYC</a> sale to date. Congrats to all the apes out there  <a href=\"https://t.co/e7UghlgtKy\">pic.twitter.com/e7UghlgtKy</a></p>&mdash; Sotheby&#39;s (@Sothebys) <a href=\"https://twitter.com/Sothebys/status/1435970840340860930?ref_src=twsrc%5Etfw\">September 9, 2021</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, the auction house reportedly <a href=\"https://edition.cnn.com/style/article/bored-apes-sothebys-lawsuit/index.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a statement to mainstream media outlet CNN that the allegations are “baseless.” Sotheby’s also added that they are prepared to “vigorously defend” their company. </p><p>In the same report, Yuga Labs also echoed Sotheby’s sentiments. According to the BAYC creators, the new allegations are completely \"without merit or factual basis.\" The company also described the complaint as \"opportunistic.\" </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/nft-styled-debit-cards-the-future-of-web3-animoca-founder\"><strong><em>NFT-styled debit cards the future of Web3 — Animoca founder on $30M Hi investment</em></strong></a></p><p>Meanwhile, another lawsuit involving Yuga Labs has been settled earlier this year. On Feb. 7, the NFT company <a href=\"https://cointelegraph.com/news/yuga-labs-settles-lawsuit-with-developer-involved-in-copycat-baycs\">settled a lawsuit against</a> a developer involved in the selling of a copycat NFT collection called RR/BAYC. Yuga Labs and the developer Thomas Lehman agreed on a permanent injunction prohibiting the latter from using any similar BAYC imagery or operating social media pages that insinuate any association with Yuga Labs. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/web3-gamer-earn-bitcoin-minecraft-sega-blockchain-plans/\"><strong><em>Web3 Gamer: Earn Bitcoin in Minecraft, BGA’s 50/50 gender split, Oath of Peak hot take</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-17T09:14:24.000Z",
    "title": "Google upgrades search engine with AI-powered enhancements",
    "url": "https://cointelegraph.com/news/google-upgrades-search-engine-with-ai-powered-enhancements",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/335a8b37-d7d9-4742-be09-2e71e92a261f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Google asserts that generative AI streamlines search functions, enabling individuals to discover novel perspectives and insights more effortlessly.</p>\n                    <p><p>Google has introduced a series of enhancements to its search engine, on August 15, incorporating advanced generative <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligence\">artificial intelligence</a> (AI) features it says will enhance online information discovery and comprehension.</p><p>This recent <a href=\"https://blog.google/products/search/google-search-generative-ai-learning-features/\" target=\"_blank\" rel=\"noopener nofollow\">update</a> extends the foundation of the company's Search Generative Experience (SGE), which was <a href=\"https://blog.google/products/search/generative-ai-search/\" target=\"_blank\" rel=\"noopener nofollow\">introduced</a> in beta earlier this year. SGE empowers users with AI-driven contextual overviews and suggestions, and is intended to enhance search results.</p><p>Generative AI, a branch of AI research, concentrates on crafting novel content by drawing from existing sources. Prominent tools in this category encompass ChatGPT, capable of generating text-based outputs like poems and summaries from past knowledge and Stable Diffusion, which generates fresh image-based creations through learning from billions of images.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/40512690-6cfd-4979-a784-71fc110f3f8c.JPG\"  /><figcaption style=\"text-align: center;\"><em>Image showing the newly introduced function of SGE function. Source: Google</em></figcaption></figure><p>The introduced SGE feature is currently undergoing initial testing. Once activated, users can tap a button while perusing a webpage to access an AI-generated summary of the page's core topics. Each point is hyperlinked to the pertinent section, facilitating quick navigation within lengthy or intricate articles.</p><p>The AI engine developed by Google examines webpage content to pinpoint central themes. According to Rany Ng, Google's product lead, this process aids individuals in \"enhancing comprehension and understanding of information,\" whether they're attempting to comprehend intricate concepts or locate specific details in a recipe.</p><p>Microsoft's Bing Chat has already introduced comparable summarization functions, preceding Google's deployment of generative AI in February. Yet, Google asserts its advantage lies in its expertise in comprehending web content and semantics.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/anthropic-ai-raises-100m-from-south-korea\"><strong><em>Anthropic AI raises $100M from South Korea to bolster telecommunications industry</em></strong></a></p><p>Additional enhancements within SGE target facilitating the comprehension of technical subjects. AI-generated coding summaries will showcase highlighted syntax, simplifying understanding. Similarly, hovering over unfamiliar terms in AI-generated responses will reveal definitions and relevant diagrams.</p><p>Google claims that generative AI improves search functions and enables individuals to discover novel perspectives and insights more effortlessly. Nonetheless, some experts caution that excessive dependence on AI could potentially erode individual analytical abilities.</p><p>Google <a href=\"https://cointelegraph.com/news/google-updates-its-privacy-policy-to-allow-data-scraping-for-ai-training\">made updates to its privacy policy</a> on July 1, that now allow it to take any publicly available data and use it for AI training purposes.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-apple-devloping-pocket-ai-deep-fake-music-deal-hypnotize-gpt-4/\"><strong><em>AI Eye: Apple developing pocket AI, deep fake music deal, hypnotizing GPT-4</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-17T09:30:35.000Z",
    "title": "AI mining method for Bitcoin increases reward chance 260% by calculating future blocks",
    "url": "https://cryptoslate.com/uk-researchers-develop-ai-bitcoin-mining-method-boosting-reward-chance-260-by-mining-future-blocks/",
    "description": "<p>In a notable breakthrough in Bitcoin mining, UK-based Quantum Blockchain Technologies (QBT) has developed a highly promising computing method, the Message Scheduling For Cryptographic Hashing (MSFCA), designed to make Bitcoin mining significantly more efficient. The CEO of QBT, Francesco Gardin, defined MSFCA, in its July patent application, as a &#8220;radical change&#8221; that disrupts the &#8220;fundamental [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/uk-researchers-develop-ai-bitcoin-mining-method-boosting-reward-chance-260-by-mining-future-blocks/\">AI mining method for Bitcoin increases reward chance 260% by calculating future blocks</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-17T09:25:41.000Z",
    "title": "Ripple CEO Fires Back at SEC’s Nonsensical Allegations Over XRP Sales by Him and Chris Larsen",
    "url": "https://www.cryptoglobe.com/latest/2023/08/ripple-ceo-fires-back-at-secs-nonsensical-allegations-over-xrp-sales-by-him-and-chris-larsen/",
    "description": "In a recent development in the ongoing legal battle between the U.S. Securities and Exchange Commission (SEC) and Ripple Labs, Ripple’s CEO, Brad Garlinghouse, has expressed his frustration and vehemently countered the SEC’s allegations. The core of the dispute revolves around the SEC’s claim that Ripple and its senior executives, including Garlinghouse and Ripple Co-Founder […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T09:14:38.000Z",
    "title": "MIT & Harvard’s FAn System Reveal a Revolutionizing Real-Time Object Tracking",
    "url": "https://www.cryptopolitan.com/mit-reveal-real-time-object-tracking/",
    "description": "MIT reveals a new real-time object tracking"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T09:13:02.000Z",
    "title": "Ripple Chief Legal Officer opposes SEC’s interlocutory appeal move",
    "url": "https://www.cryptopolitan.com/ripple-chief-legal-officer-opposes-secs-interlocutory-appeal-move/",
    "description": "Ripple Labs has taken a firm stance against the Securities and Exchange Commission&#8217;s (SEC) recent move, aiming to secure an interlocutory appeal following a summary judgment order in an ongoing case that has sent ripples through the cryptocurrency industry. The company&#8217;s Chief Legal Officer, Stuart Alderoty, expressed the company&#8217;s opposition to the social media platform ... <a title=\"Ripple Chief Legal Officer opposes SEC&#8217;s interlocutory appeal move\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-chief-legal-officer-opposes-secs-interlocutory-appeal-move/\" aria-label=\"More on Ripple Chief Legal Officer opposes SEC&#8217;s interlocutory appeal move\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-17T09:10:29.000Z",
    "title": "Fantom DEX SpiritSwap On The Verge Of Shutdown? Here’s What Has Changed",
    "url": "https://www.newsbtc.com/fantom/fantom-dex-spiritswap-on-the-verge-of-shutdown-heres-what-has-changed/",
    "description": "SpiritSwap, a decentralized exchange (DEX) on Fantom, will no longer be shutting down its operations in September after it received a takeover offer from Power, another Fantom-based DeFi protocol. The proposed shutdown was a result of cross-chain protocol Multichain’s collapse, which had a significant impact on the Fantom ecosystem. On August 9, SpiritSwap announced on Discord that it is “winding down” operations and is looking for a team to take over the project after its treasury was drained in the Multichain exploit. The protocol initially planned to shut down by September 1, 2023, but it appears that won&#8217;t be happening anymore after Power’s intervention. This would come as a relief to several SpiritSwap community members, especially those who have the native token SPIRIT locked on the protocol. According to the protocol’s website, there are currently over 410 million SPIRIT tokens locked. Power To Deposit 200,000 USDC Into The SpiritiSwap Treasury On August 16, the SpiritSwap community approved the proposal to hand the keys of the protocol to Power, a non-fungible token platform on Fantom. Power has now proposed to deposit 200,000 USDC into the SpiritSwap treasury. Related Reading: Stellar Breaks Free: Unleashes New Open-Source Disbursement Platform The team behind the NFT platform stated in the proposal that the deployment of these funds into the treasury is the first phase of ensuring that SpiritSwap survives. Meanwhile, Power claims to hold more than $1 million in liquid assets across multiple chains “ready to mobilize for use”. In the proposal, the Power team clarified that it has also been developing its own decentralized exchange, PowerSwap. Then, it laid out plans to integrate some designs of the new DEX into SpiritSwap. It is worth mentioning that Power was also impacted by the Multichain exploit. Fortunately, the protocol’s treasury assets were not bridged to Multichain, leading to relatively small losses. Multichain Exploit &#8211; The Impact On Fantom The Fantom ecosystem was the biggest victim in the Multichain exploit in July, which resulted in a total loss of over $126 million. The attack seemed to have specifically targeted the protocol’s Fantom bridge, causing a drain of more than $120 million worth of assets. Related Reading: Ethereum Price Takes a Bit Hit: Main Reasons $1,720 or $1,650 Are Likely Targets As inferred earlier, the ripple effect of the Multichain hack spread across various projects on the Fantom blockchain. As a result, the total value locked (TVL) on the network has been on a steady decline.  Fantom has seen its TVL drop by more than 61% since July 6 &#8211; the day of the Multichain exploit. As of this writing, the total value locked on the network stands at about $86.2 million, according to data from DefiLlama. FTMUSDT continues downward trend on the daily timeframe &#124; Source: FTMUSDT chart on TradingView Featured image from iStock, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-17T09:15:49.000Z",
    "title": "$500,000 Bitcoin (BTC) Price Now on the Table As Classic Indicator Suggests Parabolic Rally Coming: Plan B",
    "url": "https://dailyhodl.com/2023/08/17/500000-bitcoin-btc-price-now-on-the-table-as-classic-indicator-suggests-parabolic-rally-coming-plan-b/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/plan-b-btc-now-table.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/plan-b-btc-now-table.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/plan-b-btc-now-table.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/plan-b-btc-now-table.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/plan-b-btc-now-table.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/plan-b-btc-now-table.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/plan-b-btc-now-table.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says a historically reliable indicator suggests Bitcoin&#8217;s (BTC) price may surpass six figures in about a year. In a new strategy session, quant analyst PlanB tells his 65,200 YouTube subscribers that Bitcoin’s relative strength index (RSI) appears to be repeating a pattern that previously signaled parabolic rallies. The RSI is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/17/500000-bitcoin-btc-price-now-on-the-table-as-classic-indicator-suggests-parabolic-rally-coming-plan-b/\">$500,000 Bitcoin (BTC) Price Now on the Table As Classic Indicator Suggests Parabolic Rally Coming: Plan B</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]