[
  {
    "source": "CryptoSlate",
    "date": "2023-08-31T19:00:42.000Z",
    "title": "Redefining market metrics: Bitcoin and S&P 500 part ways with global liquidity",
    "url": "https://cryptoslate.com/insights/redefining-market-metrics-bitcoin-and-sp-500-part-ways-with-global-liquidity/",
    "description": "<p>Quick Take Bitcoin&#8217;s recent surge after Grayscale&#8217;s recent win in its lawsuit against the SEC was accompanied by a boost in global liquidity. This measure, encompassing the Federal Reserve balance sheet (less the reverse repo and treasury general account), along with fed remittances and the balance sheets of ECB, BOJ, PBoC, and BOE, plays a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/redefining-market-metrics-bitcoin-and-sp-500-part-ways-with-global-liquidity/\">Redefining market metrics: Bitcoin and S&#038;P 500 part ways with global liquidity</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T19:00:41.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and platform they need to build blockchain solutions. At this time, we can only make educated guesses about ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T18:58:14.000Z",
    "title": "Worldcoin Price Prediction 2023 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, ... <a title=\"Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldcoin-price-prediction/\" aria-label=\"More on Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T18:55:25.000Z",
    "title": "Swift records success in blockchain interoperability test",
    "url": "https://www.cryptopolitan.com/swift-success-blockchain-interoperability/",
    "description": "In a significant leap towards enhancing blockchain interoperability, global interbank messaging service Swift has recently collaborated with over ten financial institutions, including renowned names like Citi, BNP Paribas, and BNY Mellon, to conduct a series of successful tests. These tests aimed to establish seamless connections between various blockchains and traditional financial assets, offering a glimpse ... <a title=\"Swift records success in blockchain interoperability test\" class=\"read-more\" href=\"https://www.cryptopolitan.com/swift-success-blockchain-interoperability/\" aria-label=\"More on Swift records success in blockchain interoperability test\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T18:44:25.000Z",
    "title": "Bitcoin holdings on exchanges continue to decline drastically",
    "url": "https://www.cryptopolitan.com/bitcoin-holding-exchange-decline-drastically/",
    "description": "In a notable shift within the cryptocurrency landscape, the quantity of Bitcoin (BTC) held in addresses linked to centralized exchanges has reached its lowest point in over five years. This development, while reflecting a growing market sophistication, brings about both positive and negative implications for the crypto industry. Cryptoquant report shows a 4% decline in ... <a title=\"Bitcoin holdings on exchanges continue to decline drastically\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-holding-exchange-decline-drastically/\" aria-label=\"More on Bitcoin holdings on exchanges continue to decline drastically\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-31T19:00:09.000Z",
    "title": "Binance Labs launches ColLabs for founders and builders",
    "url": "https://crypto.news/binance-labs-launches-collabs-for-founders-and-builders/",
    "description": "Binance Labs is launching a new platform called ColLabs, targeting web3 founders, builders, and investors"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-31T18:44:15.000Z",
    "title": "PancakeSwap launches on Ethereum layer-2 solution, Base",
    "url": "https://crypto.news/pancakeswap-launches-on-ethereum-layer-2-solution-base/",
    "description": "PancakeSwap, a leading decentralized exchange (DEX), has launched on Base"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-31T19:00:47.000Z",
    "title": "Maker (MKR) Unleashed: Price Soars 12% In One Day – What’s Behind The Surge?",
    "url": "https://www.newsbtc.com/analysis/mkr/maker-mkr-unleashed-price-soars-12-in-one-day-whats-behind-the-surge/",
    "description": "In anticipation of the announcements made by the Ethereum-based Decentralized Finance (DeFi) lending platform team, the price of Maker (MKR) has experienced a remarkable surge of over 12% within hours. Now, what do these developments entail, and how will they impact the future of Maker? Maker Empowers SubDAOs? On August 28th, the Maker team made a significant announcement regarding their plans to introduce SubDAOs in South Korea. This move represents a critical evolution for MakerDAO, marking the &#8220;final effort&#8221; to unlock the potential of Decentralized Autonomous Organizations (DAOs).  Related Reading: XRP Price Prediction for 2023, 2024, 2025, 2030 and Beyond According to the announcements made on August 28th, introducing SubDAOs is expected to streamline, innovate, and strengthen the Maker ecosystem, paving the way for increased opportunity and growth. SubDAOs, which stands for Subsidiary Decentralized Autonomous Organizations, are expected to play a pivotal role in the next phase of MakerDAO&#8217;s development. These entities will leverage liquidity allocation from the Maker Protocol, exploring various yield opportunities across the financial landscape.  From decentralized finance protocols to real-world asset solutions, SubDAOs aim to harness the potential of diversified investment strategies. Per the announcement, this presents a unique opportunity for Korean crypto leaders to engage with the forefront of DeFi developments. Participants will have the chance to be part of forming their own SubDAO or contribute to existing ones.  This involvement offers insights into the success story of Spark Protocol, the first yield product incubated by a future SubDAO. Spark Protocol has demonstrated significant achievements, such as boasting high liquidity, industry-leading borrowing fees, and managing hundreds of millions in liquidity. Additionally, the event encourages forging connections between leaders in centralized finance (CeFi) and decentralized finance. These connections are expected to help bridge the South Korean community to SubDAO token acquisition and farming opportunities, fostering collaboration and growth within the ecosystem. The move into SubDAOs signifies MakerDAO&#8217;s commitment to cultivating innovation across the industry. Participants can explore “cutting-edge” decentralized finance protocols and real-world asset solutions.  The MRK Rally, How Close To A New Annual High? The recent announcements have sparked a surge in MKR&#8217;s price, following a decline that began on August 2nd, which coincided with the token reaching its yearly high of $1,371.  Subsequently, MKR experienced a drop, reaching a low of $984 and breaching the significant psychological level of $1,000 and its 50-day Moving Average (MA), which had previously provided substantial support for the token. Related Reading: Bitcoin, Ethereum Show More Potential For Downside Despite Recent Bounce – Analyst However, with the recent announcements and the excitement surrounding the protocol&#8217;s new phase and increased liquidity entering its ecosystem, MKR has surged by an impressive 12% within 24 hours.  Currently, MKR is trading at $1,170, surpassing and regaining its 50-day MA, which has played a pivotal role in driving Maker&#8217;s rallies throughout the year. Moreover, according to Token Terminal data, MakerDAO&#8217;s Total Value Locked has reached $5.16 billion, indicating a 3.03% uptrend in recent days. Considering these developments, the question arises: Is MKR poised to reach a new yearly high?  During MRK&#8217;s rally, the token reached as high as $1,230 but encountered a strong resistance wall at that level. However, suppose the protocol&#8217;s developments continue to attract liquidity, and MKR bulls can defend its 50-day MA as support, while further consolidating above the $1,260 level. In that case, there is a possibility that, in the coming months, MRK could achieve a new yearly high above $1,375 and even touch the $1,400 level, a threshold not reached since May 2022. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-31T19:00:30.000Z",
    "title": "Best Meme Coin Presale | The Ultimate Guide to the Top Meme Coins Currently in Presale to Buy Now",
    "url": "https://www.crypto-news-flash.com/best-meme-coin-presale-the-ultimate-guide-to-the-top-meme-coins-currently-in-presale-to-buy-now/",
    "description": "<img width=\"512\" height=\"287\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-179.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-179.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-179-300x168.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the dynamic world of cryptocurrencies, meme coins have emerged as a category that combines humor, culture, and serious technology. This comprehensive guide aims to dive deep into this exciting crypto sub-sector, with a particular focus on a standout project: ApeMax. Serving as an essential resource for those intrigued by the meme coin phenomena, this [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-31T18:45:44.000Z",
    "title": "SEC Files ‘Secret’ Sealed Motion in Court Battle Against Top Crypto Exchange Binance",
    "url": "https://dailyhodl.com/2023/08/31/sec-files-secret-sealed-motion-against-crypto-exchange-binances-parent-company/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/sec-secret-motion-parent.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/sec-secret-motion-parent.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/sec-secret-motion-parent.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/sec-secret-motion-parent.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/sec-secret-motion-parent.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/sec-secret-motion-parent.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/sec-secret-motion-parent.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Securities and Exchange Commission (SEC) is seeking the court’s approval to submit confidential documents related to the regulator’s lawsuit against the crypto exchange Binance. On Monday, the SEC filed a sealed motion for leave to file documents under seal. If granted, the agency will be allowed to file sensitive or confidential information with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/31/sec-files-secret-sealed-motion-against-crypto-exchange-binances-parent-company/\">SEC Files ‘Secret’ Sealed Motion in Court Battle Against Top Crypto Exchange Binance</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-31T18:41:29.000Z",
    "title": "FTX Founder Sam Bankman-Fried’s Highly-Anticipated Fraud Trial Could Be Delayed: Report",
    "url": "https://dailyhodl.com/2023/08/31/ftx-founder-sam-bankman-frieds-highly-anticipated-fraud-trial-could-be-delayed-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Violation-Overshadowed-by-FTX.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Violation-Overshadowed-by-FTX.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Violation-Overshadowed-by-FTX.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Violation-Overshadowed-by-FTX.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Violation-Overshadowed-by-FTX.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Violation-Overshadowed-by-FTX.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Violation-Overshadowed-by-FTX.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The highly-anticipated fraud trial of disgraced FTX founder Sam Bankman-Fried reportedly could be delayed after his lawyers complained that he did not have adequate time to review the evidence. According to a new report by Reuters, Judge Lewis Kaplan is considering pushing back the trial five months and combining it with a previously scheduled case [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/31/ftx-founder-sam-bankman-frieds-highly-anticipated-fraud-trial-could-be-delayed-report/\">FTX Founder Sam Bankman-Fried’s Highly-Anticipated Fraud Trial Could Be Delayed: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]