[
  {
    "source": "CoinDesk",
    "date": "2023-05-29T04:21:17.000Z",
    "title": "Singapore's Temasek to Exercise Caution in Crypto Space After FTX Nightmare",
    "url": "https://www.coindesk.com/business/2023/05/29/singapores-temasek-to-exercise-caution-in-crypto-space-after-ftx-nightmare/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Temasek wrote down the entirety of its investment in FTX in November."
  },
  {
    "source": "Decrypt",
    "date": "2023-05-29T04:28:13.000Z",
    "title": "Americans May Not Love Crypto, But These Top Brands Are Into It",
    "url": "https://decrypt.co/142698/americans-may-not-love-crypto-but-these-top-brands-are-into-it",
    "description": "Chick-Fil-A, Toyota, Pfizer and Samsung are among the Top 100 brands to explore the cryptocurrency space. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-29T04:33:29.000Z",
    "title": "BAND Protocol Prices Stabilize After 40% Plunge: Will These Key Developments Help?",
    "url": "https://www.newsbtc.com/all/band-protocol-prices-stabilize-after-a-40-plunge-will-these-key-developments-help/",
    "description": "BAND prices remain stable at the time of writing. However, considering recent development within the Band Protocol ecosystem, there could be more upsides as the project unveils new features and strikes strategic partnerships. Horizen Partnership Recently, Band Protocol, a platform focusing on cross-chain data oracles, partnered with Horizen, a public blockchain offering a scalable ecosystem for decentralized applications (dapps).  The goal is to provide EON, Horizen&#8217;s recently launched EVM-compatible intelligent contracting platform, with access to decentralized oracle services. In this way, decentralized finance (DeFi), gaming, and non-fungible tokens (NFTs) within the EON ecosystem will have real-time pricing information and reliable data via Band Protocol&#8217;s middleware solutions. Related Reading: Monaco, NFTs, And Formula 1: Reasons Polygon Is Bullish EON uses Band Protocol&#8217;s primary Oracle solution to provide real-time token price feeds across several blockchain networks. Integrating these two platforms ensures the integrity of EON&#8217;s data, which will be essential in developing the company&#8217;s DeFi, gaming, and NFT ecosystem. Band Protocol&#8217;s ability to gather and integrate real-world data and APIs to intelligent contracts may help EON become less reliant on centralized oracles, which introduce points of failure. This new link allows programmers to enhance and expand the functionality of EON intelligent contracts. According to Rob Viglione, co-founder, and CEO of Horizon Labs, the relationship with Band Protocol is a broad step forward in the company&#8217;s efforts to provide a safe and scalable environment for DApps.  The reliable oracle services provided by Band Protocol allow programmers to design innovative software for DeFi, gaming, and NFTs. Integrating Band Protocol&#8217;s oracle solution, Horizen EON can now provide their intelligent contracts with accurate, real-time price data. Due to this collaboration, new possibilities in DeFi, gaming, and NFT applications will emerge, and the whole blockchain ecosystem will become more robust and decentralized. Band Protocol Planning For SubDAOs Moreover, Band Protocol has proposed the implementation of SubDAOs.  According to Shine Sutheeravet, head of operations at Band Protocol, the goal is to address challenges in decentralized autonomous organizations (DAOs).  SubDAOs offer solutions for complexity management, efficient resource allocation, specialized expertise, flexibility, inclusivity, and scalability.  The proposal suggests transforming the Cosmos Group module into councils to establish clear governance structures.  Related Reading: European Commission To Present Regulatory Framework For Digital Euro In June At the moment, Band Protocol is seeking community feedback to refine and optimize this governance framework and drive the growth of the SubDAO ecosystem. Amid this development, BAND prices are stable at around $1.39, and likely to recover after dropping 40% from February 2023 highs. -Featured Image From Canva, Chart From TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-29T04:25:07.000Z",
    "title": "Ethereum’s Block Size Surges To 1-Month High – What This Means For ETH",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-block-size-surges-to-1-month-high/",
    "description": "Ethereum, the world&#8217;s second-largest cryptocurrency by market capitalization, has witnessed a significant surge in its mean block size, reaching a new 1-month high. This milestone was recently announced by Glassnode, a renowned on-chain analysis platform. The increase in block size indicates a notable improvement in Ethereum&#8217;s network capacity and transaction throughput, potentially bringing positive implications for the ecosystem. Breaking Down The Block Size Surge The mean block size of Ethereum has skyrocketed, surpassing the previous 1-month high recorded on May 27, 2023. Glassnode&#8217;s data reveals that the current mean block size stands at 121.4 million. This surge highlights a substantial increase in the average data volume accommodated within individual blocks of the Ethereum blockchain. Related Reading: Gas Crisis Averted: NFT Marketplaces Witness Dramatic Reduction in Ethereum Fees Larger block size is indicative of Ethereum&#8217;s ability to handle more data and transactions per block, effectively enhancing the network&#8217;s capacity. With a higher average data volume in recent blocks, ETH showcases its potential for improved scalability and transaction throughput. Ethereum&#8217;s surge in block size signifies a positive development for the ETH ecosystem, as it accommodates the growing demands and usage of the network. What This Means For Ethereum The surge in Ethereum&#8217;s mean block size holds several implications for ETH and its community. Firstly, it signifies the network&#8217;s continued growth and adoption. As more participants engage with the Ethereum blockchain, the increased block size demonstrates the platform&#8217;s ability to handle a higher volume of transactions, leading to enhanced efficiency and reduced congestion. Moreover, the surge in block size also contributes to improved transaction throughput. With larger block sizes, more transactions can be included in each block, resulting in faster confirmation times and smoother user experiences. This development is crucial for applications built on the Ethereum network, such as decentralized finance (DeFi) protocols, non-fungible token (NFT) marketplaces, and various other decentralized applications (dApps). It enables them to process a greater number of transactions within a given timeframe, fostering better scalability and usability. Additionally, Ethereum&#8217;s increased block size may have a positive impact on gas fees. Gas fees, which are transaction fees on the Ethereum network, can be influenced by block size. A larger block size allows for the inclusion of more transactions, potentially alleviating congestion and reducing gas fees. This could lead to a more cost-effective and accessible environment for users and developers utilizing the Ethereum ecosystem. Related Reading: Crypto Expert Predicts Ethereum (ETH) To Reach $457,000 – Here’s How Meanwhile, Ethereum has shown a possible brewing uptick in the past week. The second crypto asset by market capitalization has surged 2.3% in the past week. Over the past 24 hours, ETH  has seen a 1.1% gain. &#160; At the time of writing, Ethereum currently trades at $1,851. Ethereum&#8217;s trading volume has, however, ranged between $3 billion and $5 billion in the past seven days indicating a possible accumulation. Regardless, in the past 24 hours, ETH has had a trading volume of $5.5 billion. -Featured image from Shutterstock, Chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-29T04:12:45.000Z",
    "title": "ADA Price (Cardano) Breaking This Resistance Could Spark Bullish Moves",
    "url": "https://www.newsbtc.com/analysis/ada/ada-price-cardano-bullish-moves-0-385/",
    "description": "Cardano’s price is attempting a recovery wave above $0.375. ADA could gain bullish momentum if it settles above the $0.3850 resistance zone. ADA price is slowly moving higher from the $0.360 zone against the US dollar. The price is trading above $0.370 and the 100 simple moving average (4 hours). There was a break above a key bearish trend line with resistance near $0.369 on the 4-hour chart of the ADA/USD pair (data source from Kraken). The pair could start a decent increase if it settles above the $0.3850 resistance zone. Cardano’s ADA Price Attempts Recovery This past week, Cardano’s price declined toward the key $0.354 support zone. The bulls managed to stay in action and averted a major downside break below $0.3540. A low was formed near $0.3536 and the price started a recovery wave. There was a move above the $0.365 and $0.375 resistance levels. Besides, there was a break above a key bearish trend line with resistance near $0.369 on the 4-hour chart of the ADA/USD pair. The price is up 3% and showing a few positive signs, similar to Bitcoin and Ethereum. The bears are now protecting more gains above the $0.3850 resistance. A high is formed near $0.3850 and the price is consolidating gains. ADA price is trading above $0.370 and the 100 simple moving average (4 hours). It might soon test the 23.6% Fib retracement level of the recent wave from the $0.3536 swing low to the $0.3850 high. Source: ADAUSD on TradingView.com On the upside, immediate resistance is near the $0.385 zone. The next major resistance is forming near the $0.396 zone. If there is an upside break above the $0.385 and $0.396 resistance levels, the price could start a decent increase. In the stated case, the price could even surpass the $0.420 resistance zone. The next key resistance might be $0.432, above which it could test $0.45. Fresh Decline in ADA? If Cardano’s price fails to climb above the $0.385 and $0.396 resistance levels, it could start another decline. Immediate support on the downside is near the $0.375 level. The next major support is near the $0.368 level or the 50% Fib retracement level of the recent wave from the $0.3536 swing low to the $0.3850 high. A downside break below the $0.368 level could open the doors for a fresh decline toward $0.354. The next major support is near the $0.332 level. Technical Indicators 4 hours MACD – The MACD for ADA/USD is losing momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for ADA/USD is now above the 50 level. Major Support Levels – $0.375, $0.368, and $0.354. Major Resistance Levels – $0.385, $0.396, and $0.420."
  }
]