[
  {
    "source": "CoinDesk",
    "date": "2023-08-21T14:42:26.000Z",
    "title": "Friend.tech Gains 100K Users Quickly in Depths of a Bear Market",
    "url": "https://www.coindesk.com/tech/2023/08/21/friendtech-gains-100k-users-quickly-in-depths-of-a-bear-market/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The trending application’s privacy policy has been the subject of criticism in the past few weeks."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T14:41:12.000Z",
    "title": "Binance limits withdrawals in Europe, cites payment processor issues",
    "url": "https://cointelegraph.com/news/binance-limits-withdrawals-in-europe",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/a151b797-a77c-4f41-8a88-d6dc3a3d37a2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In a deleted customer service message, Binance said that the failed withdrawals were caused by temporarily suspended EUR transactions through SEPA.</p>\n                    <p><p>Binance cryptocurrency exchange customers are allegedly facing troubles with fiat withdrawals in Europe due to issues related to the Single Euro Payments Area (SEPA) transfers.</p><p>The exchange has allegedly suspended euro withdrawals and deposits via SEPA, Binance’s customer support wrote in a now-deleted message on X (formerly Twitter) on Aug. 20.</p><p>In the now-deleted message, the cryptocurrency exchange said it doesn’t have a specific time frame for restoring SEPA transfers, adding that its payment provider “can no longer support these transactions.”</p><p>“We understand the inconvenience this has caused, and we're actively working to resolve this as soon as possible,” Binance said in a tweet that has since been deleted.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/6de70e65-e7f0-4e2e-b760-97136b96595a.png\"  /></figure><p>The statement came in response to an alleged Binance user in Europe, who <a href=\"https://twitter.com/Nesh61401966/status/1693324791070048440?s=20\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> to have bought a “large amount of EUR on Binance” a few days ago. The alleged client complained about being unable to withdraw the euros to their bank account or sell them on Binance due to the closure of their Paysafe account. The user added:</p><blockquote>“According to customer support there is nothing I can do about it except waiting for Binance to find a new payment provider. Letting users buy EUR, just to block them from accessing it right afterwards is what you would expect from scam exchanges, not Binance.”</blockquote><p>The news comes a few months after Binance informed users that its current euro banking partner, Paysafe Payment Solutions, would <a href=\"https://cointelegraph.com/news/binance-loses-support-of-euro-banking-partner\">discontinue supporting the crypto exchange</a>. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/paypal-uk-to-halt-crypto-purchases-until-2024\"><strong><em>PayPal UK to halt Bitcoin purchases until early 2024</em></strong></a></p><p>“Users will need to update the banking details used to deposit to their Binance accounts and may be required to accept new terms and conditions to continue using SEPA services after this date,” Binance said at the time.</p><p>In a written response to Cointelegraph, Binance said the customer support message on Twitter/X was \"sent in error,\" adding that the \"SEPA deposit and withdrawal service will continue until 25 September as originally communicated.\"</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/a036c987-c299-4e14-99e0-c7906b87e987.png\"  /></figure><p>Binance's recent withdrawal-related issues in Europe are not rare for the exchange. In May, <a href=\"https://cointelegraph.com/news/binance-halts-bitcoin-withdrawals-for-the-second-time-in-12-hours\">Binance halted Bitcoin</a> (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) withdrawals, citing a large backlog of pending withdrawals. The halt came one day after Binance experienced its first withdrawal outage amid a clogged Bitcoin mempool, with more than <a href=\"https://cointelegraph.com/news/binance-closes-btc-withdrawals-amid-congestion-on-the-bitcoin-network\">400,000 transactions getting stuck on the BTC blockchain</a>.</p><p><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\">Blockchain games aren’t really decentralized… but that’s about to change</a></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-21T15:04:16.000Z",
    "title": "\n                        BTC/USD Hurdle at 26798:  Sally Ho’s Technical Analysis – 22 August 2023\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/btcusd-hurdle-at-26798-sally-hos-technical-analysis-22-august-2023",
    "description": "\n                        <p>Bitcoin (BTC/USD) suffered from bearish momentum early in the Asian session as the pair softened multiple times when testing the 26330 area, a level that represents the 38.2% retracement of the recent appreciating range from 25234.76 to 27007.87. &nbsp; After fading from the 26296 area, some buying pressure emerged around the 25874 area, representing a test of the 61.8% retracement of the appreciating range from 25610 to 26298.78. &nbsp; BTC/USD recently depreciated to the 25234.76 area, its weakest print since mid-June.&nbsp; This fresh multi-month low represented a test of a major downside price objective around the 25128.94 area that is associated with selling pressure that increased around the 31862.21 and 30421.29 levels in July. &nbsp; Major Stops were elected below the 27620.46 area during the decline, another downside price objective linked to recent downward pressure around the 30222 and 29665.27 areas.&nbsp; Major Stops were also elected below the 27991.29 area, representing the 23.6% retracement of the broader appreciating range from 15460 to 31862.21.&nbsp; &nbsp;</p>\n<p>Areas of technical support and potential buying pressure in appreciating ranges from the 15460 and 19568.52 levels include the 23661, 22793, and 21725 levels. &nbsp; Following recent selling pressure, areas of technical resistance and potential selling pressure include the 26798, 27139, 27728, 27766, 28316, 28548, 29154, 29330, and 30443 levels.&nbsp; Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas. &nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 27926.01 and the&nbsp;50-bar MA&nbsp;(Hourly) at 26054.81.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n<p>&nbsp;</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T15:02:15.000Z",
    "title": "ChatGPT for Healthcare: Singapore’s NUHS Taps AI to Boost Clinicians’ Productivity",
    "url": "https://www.cryptopolitan.com/singapore-nuhs-chatgpt-for-healthcare/",
    "description": "The National University Health System in Singapore (NUHS) is tapping into artificial intelligence technology to improve clinicians’ productivity. At the heart of this goal lies its newly-launched GPT tailored for healthcare providers. Reports on Monday revealed NUHS launched a ChatGPT-like tool that can help healthcare providers summarise patient case notes in seconds. Called “RUSSELL-GPT,” the ... <a title=\"ChatGPT for Healthcare: Singapore’s NUHS Taps AI to Boost Clinicians&#8217; Productivity\" class=\"read-more\" href=\"https://www.cryptopolitan.com/singapore-nuhs-chatgpt-for-healthcare/\" aria-label=\"More on ChatGPT for Healthcare: Singapore’s NUHS Taps AI to Boost Clinicians&#8217; Productivity\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T15:00:48.000Z",
    "title": "Kenya forms committee to investigate Worldcoin’s Iris Scan authentication",
    "url": "https://www.cryptopolitan.com/kenya-forms-committee-to-investigate-worldcoins-iris-scan-authentication/",
    "description": "Kenya&#8217;s legislative bodies have set up a dedicated committee to probe the operations of Worldcoin, a controversial cryptocurrency demanding iris scans for user authentication. Comprising 15 members from the Tourism and Wildlife, Communication and Innovation, and Administration and Internal Security sectors, the committee&#8217;s task is to scrutinize Worldcoin within a 42-day timeframe, as directed by ... <a title=\"Kenya forms committee to investigate Worldcoin&#8217;s Iris Scan authentication\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kenya-forms-committee-to-investigate-worldcoins-iris-scan-authentication/\" aria-label=\"More on Kenya forms committee to investigate Worldcoin&#8217;s Iris Scan authentication\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-21T14:56:13.000Z",
    "title": "China introduces new ID metaverse proposal",
    "url": "https://crypto.news/china-introduces-new-id-metaverse-proposal/",
    "description": "The Chinese-based company, Telco, has proposed a new digital ID system for bringing China into the metaverse. Telco’s proposal aims to bring all Chinese citizens into the metaverse using their ID metaverse system. Telco’s system would allow Chinese citizens to&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-21T15:01:15.000Z",
    "title": "Binance Coin Falls Below $210 As BNB Bridge Hacker’s Health Rate Sinks To 0.99",
    "url": "https://www.newsbtc.com/news/binance-coin-drops-below-210-bnb-bridge-hacker-in-trouble/",
    "description": "In a complex tangle of smart contracts, governance proposals, and fluctuating crypto prices, the financial health rate of the infamous Binance BNB Bridge exploiter address (0x48…9bec) has fallen below the critical value of 1, hovering at 0.99. This development is of particular interest, given that the address holds a significant collateral of 784,616.10 BNB and a debt position in the form of USDT and USDC totaling $124 million. The plummeting health rate comes amidst the fall of Binance Coin (BNB) to $207.9, well below the pre-determined liquidation price of $210.80, leading to increased speculation about potential liquidation scenarios. As per a tweet from blockchain security firm PeckShield: &#8220;The health rate of the BNB Bridge Exploiter on Venus is 0.99. BNB has dropped to $207.9. The Venus community has passed a governance proposal to whitelist liquidation of the BNB Bridge exploiter&#8217;s position before.&#8221; Liquidation Contingency: The Binance Plan He Yi, the co-founder of Binance, alleviated some concerns stating, &#8220;The BNB collateral of Venus is covered by Binance. When the price of BNB falls, Binance will liquidate it in time. These BNB will not affect the secondary market price, and Binance will be responsible for burning these additional BNB.&#8221; Related Reading: Binance In Murky Waters? Analyst Explains Why BNB Must Stay Above This Price Nevertheless, the crypto community and analysts alike are closely following the situation, speculating on whether Binance CEO Changpeng Zhao, commonly known as CZ, intends to execute the liquidation to remove the illegitimate BNB from the ecosystem. Renowned analyst Skew remarked regarding the currently ongoing price movements: &#8220;&#8221;BNB Shorts going at it again + -24% APR (24hr). BNB Aggregate CVDs show takers are net sellers on the day so far. BNB Binance Spot: Quite a lot of spot bids below down to $200, so there will need to be a frenzy of spot selling in order to cause price dislocation or a crash. Large limit buyer has been trying to absorb the sell pressure.&#8221; Crypto influencer MartyParty brought this hypothesis into the limelight, stating, &#8220;Is CZ trying to liquidate the Venus loan to burn the 900k illegal BNB? Based on the Venus protocol documentation, the loan would have to be liquidated to burn the illegal BNB. That is the only way to remove it from the ecosystem.&#8221; This liquidity and governance issue comes after an &#8220;exploiter&#8221; illegally minted 2 million $BNB through a vulnerability in BNB Bridge, which has since been repaired. Of this illegally minted BNB, 900,000 BNB was used as collateral on Venus Protocol to obtain a loan exceeding $150 million in stablecoins, which was then dispersed across multiple blockchains. On June 12, 2023, a potential liquidation was averted when Binance stepped in to add $30 million in USDT margin, bringing the liquidation price down to $212. Again on August 17, another liquidation was sidestepped, pulling the liquidation threshold down to $210.80 and consequently the health rate to 1.02. Related Reading: Curve DAO Scores $5 Million Boost From Binance, Eyes BNB Chain Expansion In an earlier reaction to MartyParty&#8217;s query, CZ seemed unfazed: &#8220;Took me a while to understand (IF I even vaguely understand now). So, Marty is worried about a $30-120m worth re-buy of #BNB? Maybe he should check the last BNB burn? or the #SAFU insurance fund size?&#8221; He also commented on the volatility of BNB, adding, &#8220;And where did the $212 magic number come from? #BNB price is determined by the market. A $30m re-buy is less than 4% of a single day&#8217;s volume.&#8221; As of this writing, the market is still uncertain, waiting for further signals from CZ, who hasn&#8217;t commented on the latest developments. Meanwhile, Arkham Intelligence&#8217;s dashboard remains a focal point for real-time updates on the loan status and the health rate of the exploiter&#8217;s account. At press time, no liquidation took place yet. At press time, the BNB price was at $210.5. Featured image from Metal Pay, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T15:00:16.000Z",
    "title": "Analysts’ Top Pick: Everlodge Could Offer Bigger Gains than Pepe and VeChain by 2024",
    "url": "https://www.crypto-news-flash.com/analysts-top-pick-everlodge-could-offer-bigger-gains-than-pepe-and-vechain-by-2024/?utm_source=rss&utm_medium=rss&utm_campaign=analysts-top-pick-everlodge-could-offer-bigger-gains-than-pepe-and-vechain-by-2024",
    "description": "<img width=\"512\" height=\"329\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-89.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-89.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-89-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As we navigate the dynamic landscape of cryptocurrency, one name that is increasingly resonating with analysts is Everlodge (ELDG). Predicted to offer heftier gains than stalwarts like Pepe (PEPE) and VeChain (VET) by 2024, Everlodge is drawing attention for all the right reasons. Interestingly, the project is still in its presale phase, presenting a golden [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T14:49:15.000Z",
    "title": "XRP Ledger NFTs Level Up: New Amendments Set to Revolutionize the Ripple Ecosystem",
    "url": "https://www.crypto-news-flash.com/xrp-ledger-nfts-level-up-new-amendments-set-to-revolutionize-the-ripple-ecosystem/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-ledger-nfts-level-up-new-amendments-set-to-revolutionize-the-ripple-ecosystem",
    "description": "<img width=\"1024\" height=\"538\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/11/xrpl-nft-1024x538-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/11/xrpl-nft-1024x538-1.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/xrpl-nft-1024x538-1-300x158.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/xrpl-nft-1024x538-1-768x404.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/xrpl-nft-1024x538-1-351x185.jpg 351w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />Five key amendments are set to be implemented on XRPL as the UNL vote stays above the 80 percent threshold in almost two weeks. This is expected to fix and advance the functionality, precision, consistency, etc on the XRPL network. One of the most reputable Non-Fungible Token (NFT) marketplaces on the XRP Ledger (XRPL), XRP [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T14:39:50.000Z",
    "title": "Ripple: Industry Expert Says Selling XRP Now is Like Selling Apple, Microsoft, and Amazon Stock in the Early Days – Price is Poised to Reach $10,000",
    "url": "https://www.crypto-news-flash.com/ripple-industry-expert-says-selling-xrp-now-is-like-selling-apple-microsoft-and-amazon-stock-in-the-early-days-price-is-poised-to-reach-10000/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-industry-expert-says-selling-xrp-now-is-like-selling-apple-microsoft-and-amazon-stock-in-the-early-days-price-is-poised-to-reach-10000",
    "description": "<img width=\"800\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"This decline could be just the initial sign of greater challenges for XRP. Whale Alert, a well-known entity tracking significant cryptocurrency transactions, highlighted a remarkable development.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-48x29.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />Industry experts agree that XRP is on a discount and investors selling at the current price are like those who sold Amazon, Microsoft, and Amazon stock in the early days. XRP has lost around 16 percent in the last 7 days as retail investors panic after the SEC&#8217;s latest move in its case against Ripple [...]"
  }
]