[
  {
    "source": "Crypto Daily",
    "date": "2024-03-23T17:45:06.000Z",
    "title": "Can The DeeStream (DST) Streaming Platform See 100X In 2024? Tether (USDT) & Solana (SOL) Holders Join The Presale Bull Run",
    "url": "https://cryptodaily.co.uk/2024/03/can-the-deestream-dst-streaming-platform-see-100x-in-2024-tether-usdt-solana-sol-holders-join-the-presale-bull-run",
    "description": "As the DeeStream (DST) streaming platform advances through its presale stages, attracting a diverse array of crypto holders, speculation arises regarding its potential for exponential growth."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-23T18:00:35.000Z",
    "title": "From Rollups to Sidechains, L2 Watch Catalogs Dozens of Bitcoin Layer 2 Solutions",
    "url": "https://news.bitcoin.com/from-rollups-to-sidechains-l2-watch-catalogs-dozens-of-bitcoin-layer-2-solutions/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/l2ssd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"From Rollups to Sidechains, L2 Watch Catalogs Dozens of Bitcoin Layer 2 Solutions\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/l2ssd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/l2ssd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/l2ssd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/l2ssd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/l2ssd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/l2ssd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/l2ssd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In recent years, attention towards layer two (L2) scaling solutions for Bitcoin has persisted, though bitcoin capacity in the Lightning Network has seen a decline. In recent years, other varieties of L2 solutions have emerged, capturing the attention of the crypto community. On March 19, 2024, the lead developer at Blockchair unveiled L2 Watch, an [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-23T18:03:52.000Z",
    "title": "Tectonic Price Prediction 2024-2033: Will TONIC reach $1?",
    "url": "https://www.cryptopolitan.com/tectonic-price-prediction/",
    "description": "Tectonic Price Prediction 2024-2033 Tectonic is one of the initial blockchain projects with prospects in the digital economy. Investors and traders are already asking questions about the reliability of the Tectonic price predictions, and we attempt to answer them with this Tectonic Price Prediction. What’s on the horizon for TONIC? Tectonic is a cross-chain money [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-23T18:01:09.000Z",
    "title": "United Kingdom court convicts resident for money laundering",
    "url": "https://www.cryptopolitan.com/united-kingdom-convicts-resident-laundering/",
    "description": "A London resident, Jian Wen, has recently faced legal consequences in a United Kingdom court after being discovered in possession of bitcoins valued at over $4.3 billion. Wen’s involvement in a money laundering arrangement has brought attention to the complexities and challenges associated with financial crimes in the digital age. United Kingdom court convicts woman [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-23T18:01:03.000Z",
    "title": "Bitcoin ETF market eyes resurgence amid price dip",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-market-eyes-resurgence/",
    "description": "As Bitcoin (BTC) experiences a price dip, market analysts anticipate a potential resurgence in the spot Bitcoin exchange-traded fund (ETF) market. With new data and insights from industry leaders, the market&#8217;s response to BTC&#8217;s price movements is under scrutiny. BTC Price correction spurs ETF interest Recent data suggests that the spot Bitcoin ETF market could [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-23T17:49:59.000Z",
    "title": "United Nations discusses the involvement of North Korea in crypto heists",
    "url": "https://www.cryptopolitan.com/united-nations-involvement-north-korea-heist/",
    "description": "A recent report issued by a United Nations panel of experts has shed light on the substantial role of cyber crypto heists in providing foreign currency income for North Korea. According to the United Nations findings, these illicit activities have accounted for a significant portion, estimated at 50%, of the country’s foreign currency earnings since [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-23T17:49:51.000Z",
    "title": "Bitcoin faces GBTC outflows, but predictions signal potential price rebound",
    "url": "https://www.cryptopolitan.com/bitcoin-faces-gbtc-outflows-but-predictions/",
    "description": "The Bitcoin market has recently encountered challenges as the Grayscale Bitcoin Trust (GBTC) experienced significant outflows, leading to investor concerns. However, predictions suggest a potential turnaround in BTC price action following next week. GBTC outflows prompt concerns In recent days, the GBTC has witnessed substantial outflows, with March 22 alone seeing a loss of $170 [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-23T18:03:07.000Z",
    "title": "SEC postpones decision on Grayscale Ethereum ETF again",
    "url": "https://crypto.news/grayscale-ethereum-etf-decision-postponed-again-sec/",
    "description": "The U.S. Securities and Exchange Commission (SEC) has once again delayed its decision on the approval of the Grayscale Ethereum (ETH) Futures Trust exchange-traded fund (ETF). "
  }
]