[
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T10:03:12.000Z",
    "title": "Binance faces Thai regulatory hurdles amid $4.3 billion settlement",
    "url": "https://www.cryptopolitan.com/binance-faces-regulatory-hurdles-in-thailand/",
    "description": "The world&#8217;s largest cryptocurrency exchange, Binance, faces significant regulatory scrutiny in its latest expansion effort into Thailand. Despite a recent $4.3 billion settlement with US authorities over anti-money laundering and sanctions violations and the stepping down of CEO Changpeng Zhao, Binance continues to pursue its global growth strategy. This time, the focus is on a ... <a title=\"Binance faces Thai regulatory hurdles amid $4.3 billion settlement\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-faces-regulatory-hurdles-in-thailand/\" aria-label=\"More on Binance faces Thai regulatory hurdles amid $4.3 billion settlement\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T10:01:41.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 As we venture into 2023 to 2032, the next decade promises to be a critical period for Aptos as it strives to establish itself as a significant blockchain platform. The rapidly changing market dynamics, technological advancements, and evolving adoption trends will undoubtedly shape Aptos&#8217;s path. Against this backdrop, investors and stakeholders ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T09:41:14.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: Will APE break $1 support?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: Will APE break $1 support?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: Will APE break $1 support?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-29T10:05:51.000Z",
    "title": "LUNC Soars Over 70% – Temporary Spike Or Sustainable Climb Ahead?",
    "url": "https://www.newsbtc.com/news/lunc-soars-over-70-temporary-spike-or-sustainable-climb-ahead/",
    "description": "Terra has stirred considerable attention of late, experiencing an impressive surge in prices that has left market observers intrigued. The catalyst behind this upward trajectory can be largely attributed to notable advancements within the Terra Ecosystem. A recent substantial capital infusion likely instilled significant confidence among investors, acting as a driving force behind the recent upswing in LUNC prices. Related Reading: Revving Up: Solana Bulls Ready To Charge As Analysts Predict Rally Beyond $80 Examining The Factors Behind LUNC&#8217;s Meteoric Surge In the last month, LUNC has been on quite a ride, marking an impressive 90% surge in its value. This has triggered discussions, prompting questions about whether this surge is just a momentary spike or the initiation of a more enduring upward trajectory. The remarkable boost in LUNC&#8217;s value finds its roots in a couple of noteworthy events unfolding within the Terra ecosystem. Specifically, Terra Classic Labs strategically invested around $500,000 into TerraClassicUSD (USTC), the algorithmic stablecoin linked to the Terra platform. Our $LUNC and $USTC weekly burn numbers have come in. We had a bumper week, with GIGANTIC burns in both.#LUNC finished the 7-day period with 702M 🔥🔥🔥#USTC finished the week with 2.2M 🔥🔥🔥 We are on track to have the biggest month with regards to the #LuncBurn movement… pic.twitter.com/40SVd2IRTa — titan2022 (@titan20221) November 27, 2023 The considerable token burn that has taken place recently is another key driver of the rally. The quantity of LUNC tokens in circulation has decreased to 5.8 trillion due to the destruction of around 78.24 billion of them, which could put more pressure on the token&#8217;s price. The cryptocurrency industry frequently uses this process of token burning to control inflation and increase token value by lowering supply. Related Reading: XRP Market Drama: Ups, Downs And The $3 Horizon – Experts Weigh In On The Future LUNCUSD currently trading at $0.0001199 on the daily chart: TradingView.com LUNC Showing Bullish Side According to data from Coingecko, the price of LUNC has now surged by over 80% this month, with a 71% increase tallied this week in response to the announcement of Mint Cash and Binance&#8217;s launch of the USTC perpetual contract. Furthermore, the increase happens a week after Terraform Labs allocated $10 million in assets among three different liquidity pools. As of writing, LUNC is trading at $0.00011. With a $513 million daily trading volume, LUNC&#8217;s market capitalization of $661 million places it as the 79th largest cryptocurrency asset. LUNC&#8217;s indicators are all in very positive positions, which is not surprising given that the coin has increased by more than 30% in a single day. Before the present rally loses momentum, its relative strength index (purple) may peak at near to 90. Whales are waking up and jumping into #LUNC 👀✈️🚀🚀🚀🚀 — Bull.Lunc (@Bullluncdao) November 27, 2023 The coin&#8217;s 24-hour trading volume, which has increased from less than $20 million to more than $600 million virtually overnight, is arguably the most encouraging of all. This surge implies that whales have finally made a comeback to the token, pilfering more of it and igniting a broader rally. Meanwhile, LUNC and USTC reported milestone price increases over the previous week, according to data from the crypto intelligence tracker Santiment. As a result of the two coins&#8217; historic weekly gains, LUNC and USTC are now the top moving cryptocurrencies on Santiment&#8217;s tracker. Source: Santiment Santiment&#8217;s analysts predict that the milestone price rallies in both cryptocurrencies are probably signs that investors are suffering from FOMO, or the fear of missing out on these tokens&#8217; gains, which has propelled the assets to the top of the list, surpassing both Bitcoin and Cosmos. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-29T09:41:26.000Z",
    "title": "Best Meme Coins of 2023 | Exploring some of the the Top Memecoins and New Trending Meme Tokens this Year",
    "url": "https://www.crypto-news-flash.com/best-meme-coins-of-2023-exploring-some-of-the-the-top-memecoins-and-new-trending-meme-tokens-this-year/?utm_source=rss&utm_medium=rss&utm_campaign=best-meme-coins-of-2023-exploring-some-of-the-the-top-memecoins-and-new-trending-meme-tokens-this-year",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-82.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-82.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-82-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In 2023, the cryptocurrency market is experiencing a remarkable resurgence, with meme coins such as Shiba Inu, Dogecoin, and Pepe Coin at the forefront of this trend. These digital currencies, known for blending internet meme culture with blockchain technology, are capturing widespread attention. In this rapidly expanding space, a new meme coin, ApeMax, is popping [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-29T10:06:54.000Z",
    "title": "Crypto Whale Transfers Over 32M XRP To Bithumb Crypto Exchange",
    "url": "https://coinedition.com/crypto-whale-transfers-over-32m-xrp-to-bithumb-crypto-exchange/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/50_whales_holding_10_million_to_100_million_XRP_have_joined_the.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/50_whales_holding_10_million_to_100_million_XRP_have_joined_the.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/50_whales_holding_10_million_to_100_million_XRP_have_joined_the-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/50_whales_holding_10_million_to_100_million_XRP_have_joined_the-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/50_whales_holding_10_million_to_100_million_XRP_have_joined_the-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/50_whales_holding_10_million_to_100_million_XRP_have_joined_the-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/50_whales_holding_10_million_to_100_million_XRP_have_joined_the-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Whale Alert, blockchain tracker and analytics system for reporting whale crypto transactions, reported that an XRP holder recently transferred 32,078,901 XRP, equivalent to $19,557,285, from an unknown wallet to the Bithumb crypto exchange. Transactions of such magnitude are considered whale transactions and are usually suspected to be intentional. Notably, the transaction’s details on Whale Alert’s [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/crypto-whale-transfers-over-32m-xrp-to-bithumb-crypto-exchange/\">Crypto Whale Transfers Over 32M XRP To Bithumb Crypto Exchange</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]