[
  {
    "source": "Cointelegraph",
    "date": "2023-11-28T05:23:18.000Z",
    "title": "Nic Carter, other pro-Bitcoiners fight climate impact narrative in new paper",
    "url": "http://cointelegraph.com/news/nic-carter-pro-bitcoiners-fight-climate-energy-grid-narrative-research-paper",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e363aac2-e1c0-474f-b564-9f339cedf514.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A newly published working paper on Bitcoin mining has worked to counter claims from anti-crypto politicians that Bitcoin is melting the planet.</p>\n                    <p><p>Bitcoin mining is a “critical tool” for clean energy and balancing the grid, according to a new working paper penned by Bitcoin advocates and the former president of ERCOT, the operator of Texas’ electrical grid. </p><p>The Nov. 22 <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4634256\" target=\"_blank\" rel=\"noopener nofollow\">paper</a> titled “Leveraging Bitcoin Miners as Flexible Load Resources for Power System Stability and Efficiency” argued that Bitcoin mining’s inherent interruptibility and swift load response capabilities could enhance grid flexibility to better integrate variable renewable energy sources.</p><p>Authors of the working paper included Castle Island Ventures partner Nic Carter, Satoshi Action Fund CEO Dennis Porter and  Science Advisor Murray Rudd, former ERCOT (Electric Reliability Council of Texas) President and CEO Brad Jones — who recently passed away, along with Executive vice president of power at Houston-based tech company Lancium, Shaun Connell. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BREAKING: New working paper co-authored by former ERCOT &amp; NYISO CEO, highlights <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> mining as a critical tool for clean energy and balancing the grid. <a href=\"https://t.co/86pXuQ1XxL\">pic.twitter.com/86pXuQ1XxL</a></p>&mdash; Dennis Porter (@Dennis_Porter_) <a href=\"https://twitter.com/Dennis_Porter_/status/1729256906336944626?ref_src=twsrc%5Etfw\">November 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The paper provides case studies of Bitcoin miners participating in demand response programs and providing grid services in Texas, illustrating their unique capabilities as flexible and controllable loads.</p><p>The researchers concluded that this suggests that Bitcoin miners can play an important role in demand response, “thereby bolstering both the technical and economic stability of the grid.”</p><p>Some observers on X (Twitter) pointed out that the findings of the paper contrast arguments made by anti-crypto politicians who have <a href=\"https://cointelegraph.com/news/fossils-vs-renewables-pow-vs-pos-key-policy-issues-around-crypto-mining-in-the-u-s\">blamed Bitcoin miners</a> for high energy usage and loads on grids. </p><p>In October 2022, Senator Warren and six other Democrats <a href=\"https://cointelegraph.com/news/senator-warren-leads-the-charge-against-energy-consumption-claims-on-texas-crypto-miners\">pressed ERCOT for information</a> detailing how much electricity Bitcoin mining operations have consumed. She has also previously attacked New York mining firm Greenidge Generation, claiming at the time that a “crackdown on environmentally wasteful cryptocurrencies” would help fight the climate crisis. </p><p>Bitcoin mining pioneer Marshall Long tagged Senator Warren in a retweet of the paper adding “The people who RUN the grids say you’re wrong,” </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Aye <a href=\"https://twitter.com/SenWarren?ref_src=twsrc%5Etfw\">@SenWarren</a> where u at<br><br>The people who RUN the grids say you’re wrong<br><br>Oops <a href=\"https://t.co/rcwoivLA9q\">https://t.co/rcwoivLA9q</a></p>&mdash; Marshall Long (@OGBTC) <a href=\"https://twitter.com/OGBTC/status/1729272814048354465?ref_src=twsrc%5Etfw\">November 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The researchers concluded that the comprehensive impact of Bitcoin on global energy demand and climate change “remains complex,” but emerging data suggests “its effects might be more nuanced than conventionally believed.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-miners-seek-alternative-energy-sources-to-cut-costs\"><strong><em>Bitcoin miners seek alternative energy sources to cut costs</em></strong></a></p><p>A recently published Cornell University <a href=\"https://pubs.acs.org/doi/10.1021/acssuschemeng.3c05445\" target=\"_blank\" rel=\"noopener nofollow\">study</a> demonstrated how wind and solar projects can profit from Bitcoin mining during their pre-commercial development phases.</p><p>In July, Cointelegraph reported that Bitcoin mining was <a href=\"https://cointelegraph.com/news/bitcoin-mining-becoming-more-environmentally-friendly\">becoming more sustainable</a> thanks to innovations such as hydro-cooling farms and associated petroleum gas. Moreover, in September it was reported that Bitcoin clean energy usage had <a href=\"https://cointelegraph.com/news/bitcoin-clean-energy-usage-exceeds-50-percent-tesla-accepting-btc-payments\">exceeded 50%</a>. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/use-case-ai-crypto-money-payments/\">Real AI use cases in crypto, No. 1: The best money for AI is crypto</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-28T05:30:02.000Z",
    "title": "European Banking Authority Launches New Consultation on Crypto Travel Rule",
    "url": "https://news.bitcoin.com/european-banking-authority-launches-new-consultation-on-crypto-travel-rule/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/8313f11b-9feb-4ce9-945c-9b6e62d9d534-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"European Banking Authority Launches New Consultation on Crypto Travel Rule\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/8313f11b-9feb-4ce9-945c-9b6e62d9d534-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/8313f11b-9feb-4ce9-945c-9b6e62d9d534-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/8313f11b-9feb-4ce9-945c-9b6e62d9d534-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/8313f11b-9feb-4ce9-945c-9b6e62d9d534-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/8313f11b-9feb-4ce9-945c-9b6e62d9d534-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/8313f11b-9feb-4ce9-945c-9b6e62d9d534-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/8313f11b-9feb-4ce9-945c-9b6e62d9d534.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The European Banking Authority (EBA) has recently launched a new consultation process concerning implementing the so-called travel rule for cryptocurrency transactions. The institution is seeking feedback on the defined procedures that crypto assets service providers (CASPs) must complete to collect the needed information to comply with the travel rule, and the actions they must take [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-28T05:31:19.000Z",
    "title": "XRP Market Drama: Ups, Downs And The $3 Horizon – Experts Weigh In On The Future",
    "url": "https://www.newsbtc.com/news/xrp-market-drama-ups-downs-and-the-1-horizon/",
    "description": "XRP has taken investors on an exciting roller coaster ride this year, taking them on a trip through the highs and lows of the market. There have been a lot of ups and downs, from a small rise in March to a huge surge in July and another one in the middle of October. Even though this exciting adventure has ended, XRP is now trading at a mere $0.59, a huge drop of 30% from its all-time high of $0.95. Related Reading: The Dogecoin Surge: Unveiling The Catalyst Behind Rising Transactions Despite this, the current trajectory of XRP showcases a prolonged consolidative pattern spanning multiple months, hinting at a potential windfall for patient investors. For instance, a bullish head-and-shoulders setup is on the brink of completion, adding a positive dimension to the outlook. XRP: Buy The Dip? In the event that the XRP price maintains its upward momentum and successfully breaches resistance, the stage is set for a rapid and substantial rally to the upside, presenting a tantalizing opportunity for those positioned to capitalize on the potential gains. After looking at the current situation, it looks like XRP is definitely in the &#8220;buy the dip&#8221; sector. If you think that XRP will continue to rise in value, buying some of the digital asset right now might seem like a great chance to make a lot of money. People who believe that XRP will go up in value over the long term see investing in it now as a good deal. XRP market cap currently at $32.2 billion. Chart: TradingView.com Even in the face of the recent correction within the cryptocurrency market and the marginal dip in XRP&#8217;s price, certain analysts maintain an optimistic stance, suggesting that Ripple&#8217;s coin is poised for a surge to unprecedented heights. #XRP The Train 🚂Next Stops: $1.3-$3-$5.8-$27: 🔍 Macro View: Reviving echoes from the 2017 surge, aiming for $27 feels like a plausible target. The markers at $3 and $5.8 stand as critical milestones, yet pushing to $6-$7 might come with some turbulence. These ambitious goals… https://t.co/Aojv3sYmtG pic.twitter.com/c0RSHhlFnA — EGRAG CRYPTO (@egragcrypto) November 27, 2023 Notably, Twitter user EGRAG CRYPTO stands as an example, outlining the potential upcoming targets for the token, signaling a prevailing belief in the latent upward potential despite recent market fluctuations. EGRAG said that XRP could go up to $6 or $7 if it went above the &#8220;crucial milestones&#8221; of $3 and $5.80. Based on how it did during the 2017 bull run, the expert went on to say that he thought the token would explode to $27. In the current wave of market optimism, XRP is actively participating, driven by growing anticipation surrounding ETFs and witnessing the most substantial surge in inflows since late 2021. &#160; Based on the latest report from CoinShares, digital asset investment products saw an impressive $346 million influx in the previous week alone. Significantly, this marks the highest weekly inflow during a nine-week streak, sparked by heightened expectations of a spot-based ETF launch in the United States. Notably, this surge is notably the most robust since the bull market observed in late 2021. This bull run will be a special one for $XRP Last cycle we saw HEAVY suppression &#38; inactivity due to the whole lawsuit issue But things have changed since then In fact, change might be an understatement As Ripple has flipped this around into the most BULLISH outcome possible… pic.twitter.com/PzDsPVAyyO — Kyren (@noBScrypto) November 24, 2023 Positive Forecast For XRP Meanwhile, another Twitter user who thinks Ripple&#8217;s coin is going to have a huge surge soon is Kyren. They claim there are a number of reasons why XRP could experience a &#8220;unique&#8221; bull run in the future. The re-listing of XRP on key cryptocurrency exchanges, Ripple&#8217;s engagement with several central banks worldwide, and the company&#8217;s winning streak in its legal battle against the US Securities and Exchange Commission (SEC) are a few of these. Related Reading: BLUR Clears The Way With 80% Blowout – Will Price Continue Soaring? The broader crypto market is currently looking good because investors are looking forward to the Federal Open Market Committee (FOMC) minutes that are coming out soon. The market is also going up because of rumors about the approval of a Bitcoin Spot ETF and other positive events. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Krzysztof Kubicki/Pexels"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-28T05:13:26.000Z",
    "title": "Ripple to Onboard Billion-Dollar Banks Through Metaco Acquisition to Conquer $300 Trillion Market",
    "url": "https://www.crypto-news-flash.com/ripple-to-onboard-billion-dollar-banks-through-metaco-acquisition-to-conquer-300-trillion-market/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-to-onboard-billion-dollar-banks-through-metaco-acquisition-to-conquer-300-trillion-market",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-184.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-184.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-184-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-184-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple&#8217;s partnership with Metaco attracts major banking players like HSBC, signaling a strong adoption of Ripple&#8217;s technology and the XRP token in the financial sector. Ripple is poised to challenge SWIFT in the $300 trillion cross-border payments market, leveraging its XRP-powered solutions for more efficient and cost-effective global transactions. Ripple, a prominent player in the [...]"
  }
]