[
  {
    "source": "CoinDesk",
    "date": "2024-01-17T05:54:38.000Z",
    "title": "Chiliz, Klaytn Tokens Surge Over 10% on M&A Hopes, Bitcoin Listless",
    "url": "https://www.coindesk.com/markets/2024/01/17/chiliz-klaytn-tokens-surge-over-10-on-ma-hopes-bitcoin-listless/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Klyatn and Finschia Foundation have proposed to merge the two blockchains to create a Web3 powerhouse in Asia."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-17T05:48:50.000Z",
    "title": " Bitcoin ETFs top 3X daily volume of all 500 ETFs launched in ’23 combined ",
    "url": "https://cointelegraph.com/news/bitcoin-spot-etfs-see-three-times-trading-volume-all-500-etfs-launched-2023",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYWQ4ZGI0YTktMmE1Ni00NzQyLTk2M2UtODczMTVhNjczZjVlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>On Jan. 16, spot Bitcoin ETFs generated $1.8 billion in volume — more than three times the combined trading volume that same day of all 500 ETFs launched in 2023.</p>\n                    <p><p>The total volume across 10 spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETFs on Jan. 16 has, on the same day, outpaced the total volume for all 500 ETFs launched in 2023 more than three times over. </p><p>Yahoo Finance data compiled by Cointelegraph shows the 10 recently approved spot Bitcoin ETFs generated just over $1.8 billion in total volume on Jan. 16, with funds offered by Grayscale, BlackRock, and Fidelity accounting for $1.6 billion of the total. </p><p>In comparison, the combined Jan. 16 trading volume for all 500 ETFs launched in the United States last year stood at just $450 million, according to Bloomberg ETF analyst Eric Balchunas. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-spot-etfs-see-three-times-trading-volume-all-500-etfs-launched-2023\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-17T05:58:27.000Z",
    "title": "XRP Price Uptrend To Continue? These Could Be The Factors To Watch",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-uptrend-to-continue-0-600/",
    "description": "XRP price is consolidating above the $0.5400 support. The price could start a fresh rally if there is a clear move above the $0.600 resistance. XRP is struggling to clear the $0.588 and $0.600 resistance levels. The price is now trading below $0.5920 and the 100 simple moving average (4 hours). There is a major bearish trend line forming with resistance near $0.600 on the 4-hour chart of the XRP/USD pair (data source from Kraken). The pair start a fresh rally if it clears the $0.588 and $0.600 resistance levels. XRP Price Aims Higher After a decent recovery wave, XRP price was able to settle above the $0.5640 pivot level. A base was formed near $0.5460, and the price started a consolidation phase, unlike Bitcoin and Ethereum. There was a minor increase above the $0.570 resistance zone. However, the bears seem to be active near the $0.5880 resistance zone. It faced a rejection near the 50% Fib retracement level of the recent decline from the $0.6238 swing high to the $0.5545 low. The price is now trading below $0.5920 and the 100 simple moving average (4 hours). On the upside, immediate resistance is near the $0.588 zone. The first key resistance is near $0.600. There is also a major bearish trend line forming with resistance near $0.600 on the 4-hour chart of the XRP/USD pair. The trend line is near the 61.8% Fib retracement level of the recent decline from the $0.6238 swing high to the $0.5545 low. Source: XRPUSD on TradingView.com A close above the $0.600 resistance zone could spark a strong increase. The next key resistance is near $0.625. If the bulls remain in action above the $0.625 resistance level, there could be a rally toward the $0.665 resistance. Any more gains might send the price toward the $0.700 resistance. Downside Break? If XRP fails to clear the $0.600 resistance zone, it could start a fresh decline. Initial support on the downside is near the $0.5450 zone. The next major support is at $0.5220. If there is a downside break and a close below the $0.5220 level, XRP price might accelerate lower. In the stated case, the price could retest the $0.4850 support zone. Technical Indicators 4-Hours MACD – The MACD for XRP/USD is now losing pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $0.5450, $0.5220, and $0.4850. Major Resistance Levels – $0.5880, $0.600, and $0.6250."
  }
]