[
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T10:20:00.000Z",
    "title": "ChatGPT sees traffic fall 10% in June after initial rush from users",
    "url": "https://cointelegraph.com/news/chatgpt-sees-traffic-fall-10-in-june-after-initial-rush-from-users",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/0ef883e3-338c-407d-aa07-c2bbf28dff26.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Despite the decline in traffic, ChatGPT still stays ahead of its AI chatbot competitors like Google’s Bard and Character AI. </p>\n                    <p><p>Worldwide traffic for the popular artificial intelligence (AI) chatbot ChatGPT has witnessed a decline from the month of May to June, suggesting a reduction in interest in the AI assistant tool developed by OpenAI. </p><p>According to data estimates from the traffic analytics site Similarweb, desktop and mobile web traffic for ChatGPT <a href=\"https://www.similarweb.com/blog/insights/ai-news/chatgpt-traffic-drops/\" target=\"_blank\" rel=\"noopener nofollow\">dropped</a> by 9.7% in June. In addition, the site's unique visitors and the amount of time users spend on the site have also declined by 5.7% and 8.5% respectively. In the United States, the recorded month-on-month decline in the website’s traffic was 10.3%.</p><p>Despite the decline in traffic, the website is still ahead of Google’s Bard, Microsoft’s Bing and another competitor called Character AI, another popular AI-powered chatbot. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5ddcd148-867b-436d-87e9-9ebc01c3ca01.png\"  /><figcaption style=\"text-align: center;\"><em>Preliminary data on ChatGPT's traffic performance against Bing, Character AI and Bard. Source: Similarweb</em></figcaption></figure><p>As the data was released, some <a href=\"https://twitter.com/sanderssays/status/1677188459054891008\" target=\"_blank\" rel=\"noopener nofollow\">argued</a> that the reason behind the drop may be due to users of the website being students who are currently on their summer break and the AI chatbot’s novelty starting to wear off. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/chatgpt-bing-integration-paused-for-helping-bypass-paywalls\"><strong><em>OpenAI pauses ChatGPT’s Bing feature, as users were jumping paywalls</em></strong></a></p><p>On the other hand, a community member <a href=\"https://twitter.com/then_there_was/status/1676726031074607104\" target=\"_blank\" rel=\"noopener nofollow\">disputed</a> the reasons behind the drop as it did not include the traffic taken from the AI chatbot’s recently-released iOS application. According to the Twitter user, there could simply be a “change in how ChatGPT is accessed.” </p><p>On May 18, OpenAI officially <a href=\"https://openai.com/blog/introducing-the-chatgpt-app-for-ios\" target=\"_blank\" rel=\"noopener nofollow\">launched</a> ChatGPT’s mobile application for iOS. The firm initially rolled out the app in the United States and promised to expand the release to other countries in the following weeks. </p><p>Meanwhile, Lighting Labs, the development firm behind the Bitcoin Lightning Network has <a href=\"https://cointelegraph.com/news/lightning-labs-tools-let-ai-transact-hold-bitcoin\">announced tools for AI</a> to send and receive Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) on its layer-2 solution. The firm released the toolkit with the aim of helping make payments faster, cheaper and easier for developers working on AI-focused projects. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-travel-booking-bad-3-weird-uses-chatgpt-crypto-plugins/\"><strong><em>AI Eye: AI travel booking hilariously bad, 3 weird uses for ChatGPT, crypto plugins</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-07T10:15:46.000Z",
    "title": "Shifting distribution trends among bitcoin ‘whale’ holders",
    "url": "https://cryptoslate.com/insights/distribution-trend-among-bitcoin-whale-holders/",
    "description": "<p>Quick Take Examining Bitcoin, from a cohort perspective, currently bears a striking resemblance to the period following the SVB collapse back in March. The accumulation and distribution pattern among different groups of Bitcoin holders seems to be repeating itself. For the past few weeks, &#8216;whale&#8217; holders &#8211; those with 10,000 Bitcoins or more &#8211; have [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/distribution-trend-among-bitcoin-whale-holders/\">Shifting distribution trends among bitcoin &#8216;whale&#8217; holders</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T10:31:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. Crypto prices have fallen and the entire crypto market cap has dropped by 18% since April 18, 2023. What does the future hold for Binance Coin? ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-07T10:27:25.000Z",
    "title": "Status’ co-founder shares insights on strengthening civil liberties with politically neutral networks",
    "url": "https://crypto.news/status-co-founder-shares-insights-on-strengthening-civil-liberties-with-politically-neutral-networks/",
    "description": "Jarrad Hope, the co-founder of open source community Status, delivered a thought-provoking speech at the ETHBarcelona conference, highlighting the urgent need to strengthen civil liberties through politically neutral networks. A prominent advocate for privacy and co-founder of open source community&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-07T10:30:55.000Z",
    "title": "Countdown To Litecoin Halving: Is LTC Meeting Expectations?",
    "url": "https://www.newsbtc.com/news/countdown-to-litecoin-halving/",
    "description": "Litecoin (LTC) is generating significant buzz and excitement as its much-anticipated halving event approaches. With the halving just around the corner, whales—large investors—have started to make their moves, injecting a sense of urgency and driving increased interest in this crypto asset.  As the countdown to the halving nears its final stages, whales have begun to enter the market, making strategic moves that have caught the attention of many. Their involvement not only reflects their confidence in Litecoin but also serves as a catalyst for renewed interest and excitement among traders and investors. Will Litecoin&#8217;s halving propel its price to new heights? Countdown To Litecoin Block Half At the time of writing, the Litecoin Block Half countdown indicated that the halving event is 26 days away. The halving, a crucial process within the Litecoin blockchain, is poised to have a significant impact on the cryptocurrency&#8217;s ecosystem. Related Reading: Recent 800 Billion Shiba Inu Dump Has Short Traders Worried – Here’s Why The concept of halving, also known as &#8220;halvening,&#8221; is an essential aspect of cryptocurrencies like Litecoin. It involves a predetermined reduction in the reward given to miners for validating transactions and securing the network. In the case of Litecoin, this reward reduction occurs approximately every four years or after the mining of 840,000 blocks. LTC market cap currently at $7.04 billion. Chart: TradingView.com By halving the block reward, Litecoin aims to maintain a controlled and limited supply of its tokens over time. This scarcity-oriented approach is based on the belief that as the supply becomes scarcer, the demand and value of Litecoin will increase. Whale Activity And Price Surge Accompany Litecoin&#8217;s Halving CoinGecko&#8216;s latest update reveals that LTC is currently priced at $96.93, reflecting an increase of 14% in the last seven days.  Source: Coingecko In addition to the price surge, there has been a notable increase in whale activity within the Litecoin ecosystem. Whales, referring to large-scale investors, have made their presence felt, indicating a growing interest in Litecoin ahead of the halving. Source: Santiment Recent data from a Litecoin price report indicates that over the past five months, an additional 32 addresses holding 10,000 or more LTC have emerged. Related Reading: Solana Shining Moment: What To Expect After SOL Crossed $20 This surge in whale activity has resulted in a significant 6% rise in the number of major LTC holders, bringing the total count of such holders to approximately 579 at the time of writing. These numbers underscore the growing confidence and participation of prominent investors in Litecoin&#8217;s future prospects, especially with the halving event on the horizon. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Algoworks"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-07T10:10:37.000Z",
    "title": "Cardano Foundation Collaborates with Epoch Sports & Merchadise, Boosting Adoption and Driving ADA Price Surge",
    "url": "https://www.crypto-news-flash.com/cardano-foundation-collaborates-with-epoch-sports-merchadise-boosting-adoption-and-driving-ada-price-surge/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-foundation-collaborates-with-epoch-sports-merchadise-boosting-adoption-and-driving-ada-price-surge",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-85.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-85.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-85-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The Cardano Foundation announces a technical partnership with Epoch Sports and Merchadise, launching a blockchain-authenticated limited edition jersey. The collaboration aims to bring blockchain technology to the forefront of the licensed merchandise industry, offering improved authenticity and protection against counterfeiting. A Blockchain Revolution in Sports Merchandising The Cardano Foundation recently revealed its latest technical collaboration [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-07T10:35:44.000Z",
    "title": "Fantom Foundation Remains Resilient as Multichain Faces Crisis",
    "url": "https://coinedition.com/fantom-foundation-remains-resilient-as-multichain-faces-crisis/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Fantom-Price-analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Fantom-Price\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Fantom-Price-analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Fantom-Price-analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Fantom-Price-analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Fantom-Price-analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Fantom-Price-analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Fantom-Price-analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a startling episode, Multichain recently weathered a hefty outflow of $125 million in multichain assets from its cross-chain protocol. The Fantom Bridge bore the brunt of this exodus, witnessing a $122 million drain from its entire portfolio of wBTC, USDC, USDT, and other altcoins. Consequently, the platform announced a temporary suspension of its services. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/fantom-foundation-remains-resilient-as-multichain-faces-crisis/\">Fantom Foundation Remains Resilient as Multichain Faces Crisis</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]