[
  {
    "source": "CoinDesk",
    "date": "2023-10-09T10:00:00.000Z",
    "title": "The DOJ Has Come Out Swinging in the Sam Bankman-Fried Trial",
    "url": "https://www.coindesk.com/policy/2023/10/09/the-doj-has-come-out-swinging-in-the-sam-bankman-fried-trial/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The trial has started off strong for the Department of Justice. Some expected the DOJ to bring its most important witnesses – namely Sam Bankman-Fried’s former inner circle – toward the end of the trial – but oh how wrong we were."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-09T09:49:12.000Z",
    "title": "Bitcoin Is Better Than Digital Gold: Matrixport",
    "url": "https://www.coindesk.com/markets/2023/10/09/bitcoin-is-better-than-digital-gold-matrixport/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "SEC approval of a U.S.-listed spot bitcoin ETF could result in inflows of as much as $30 billion, a report by the crypto service provider said."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-09T09:40:14.000Z",
    "title": "US Prosecutors Calls SBF’s $500 Million Investment in AI Firm Anthropic 'Wholly Irrelevant'",
    "url": "https://decrypt.co/200649/u-s-prosecutors-say-sbf-500-million-investment-ai-firm-anthropic-wholly-irrelevant",
    "description": "Prosecutors request exclusion of evidence related to Sam Bankman-Fried’s $500 million investment in AI startup Anthropic. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-09T09:41:52.000Z",
    "title": "Ukraine rolls out AI regulation roadmap",
    "url": "https://cointelegraph.com/news/ai-regulation-ukraine-rolls-out-roadmap",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/ca25f27a-defc-491e-9a6f-a8a12db8b55b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The roadmap is based on a bottom-up approach that suggests providing businesses with tools to prepare for future requirements before adopting any laws.</p>\n                    <p><p>Ukraine’s Ministry of Digital Transformation presented its regulatory roadmap for artificial intelligence (AI) on Oct. 7. The roadmap was <a href=\"https://www.kmu.gov.ua/news/rehuliuvannia-shtuchnoho-intelektu-v-ukraini-mintsyfry-prezentuvalo-dorozhniu-kartu\" target=\"_blank\" rel=\"noopener nofollow\">published</a> on the ministry’s website and states that it aims to help local companies prepare for adopting a law analogous to the European Union’s AI Act. It also seeks to educate citizens on protecting themselves from AI risks.</p><p>According to the roadmap’s announcement, it is based on a bottom-up approach that suggests moving from less to more, and it will provide businesses with tools to prepare for future requirements before adopting any laws.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ukraine-crypto-businesses-to-provide-financial-statements\"><strong><em>Ukraine demands local crypto businesses provide financials</em></strong></a></p><p>The roadmap sets a preliminary period to allow the companies to adapt to potential laws in the next two to three years. Deputy Minister of Digital Transformation Oleksandr Borniakov outlines: </p><blockquote>“We plan to create a culture of business self-regulation in several ways. In particular, by signing voluntary codes of conduct that will testify to companies’ ethical use of AI by companies. Another tool is a White Paper that will familiarise businesses with the approach, timing, and stages of regulatory implementation.” </blockquote><p>The draft of the Ukrainian AI legislation, according to the roadmap, is expected in 2024, but no sooner than the EU’s AI Act to allow the national law will take it into account. </p><p>In June, the EU AI Act <a href=\"https://cointelegraph.com/news/european-union-ai-act-passes-in-parliament\">passed the European Parliament</a>. Once implemented, the act would prohibit certain AI services and products while limiting or restricting others. </p><p>Among the technologies outright banned are biometric surveillance, social scoring systems, predictive policing, so-called “emotion recognition,” and untargeted facial recognition systems. Generative AI models, such as OpenAI’s ChatGPT and Google’s Bard, would be allowed to operate if their outputs were labeled as AI-generated.</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T09:48:49.000Z",
    "title": "Exclusive Early Access to Amazon’s 2023 Festival best gaming Smartphone Extravaganza",
    "url": "https://www.cryptopolitan.com/early-access-to-amazons-2023-festival/",
    "description": "The Amazon Great Indian Festival is back in 2023, promising Indian consumers a plethora of irresistible smartphone deals. From budget-friendly gaming devices to premium flagship smartphones, this year&#8217;s festival offers something for everyone. With exclusive early access for Prime members, the time is ripe to seize the latest and greatest smartphones at unbeatable prices. Early ... <a title=\"Exclusive Early Access to Amazon&#8217;s 2023 Festival best gaming Smartphone Extravaganza\" class=\"read-more\" href=\"https://www.cryptopolitan.com/early-access-to-amazons-2023-festival/\" aria-label=\"More on Exclusive Early Access to Amazon&#8217;s 2023 Festival best gaming Smartphone Extravaganza\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-09T10:00:37.000Z",
    "title": "Crypto Analyst Presents Data To Prove That XRP Is Deflationary",
    "url": "https://www.newsbtc.com/analysis/xrp/crypto-analyst-xrp-deflationary/",
    "description": "In the past, many have argued whether or not the XRP token was deflationary or not. In support of the former, pro-XRP crypto analyst Panos Mekras has provided data that suggests that the token has deflationary characteristics.  Number Of Tokens Burned So Far In a tweet shared on his X (formerly Twitter) platform, Mekras referenced another tweet showing that over 11 million tokens had been burned. This stat undoubtedly suggests that the token is deflationary since its total supply has decreased over time due to the burn mechanism. Related Reading: 39-Month Cycle Says XRP Price Is Poised For Breakout To $1,000, Here’s When However, another X user (@hasen_van) argued that the token was only deflationary in “respect to all XRP in existence” and that the token will continue to be inflationary as long “as Ripple keeps on selling into the open market.” true with respect to all XRP in existence, but from a holders point of view &#8211; given that mostly all exchanges are using circulating supply (x price) to measure market cap, XRP is inflationary as long as ripple keeps on selling into the open market. #fridayfacts — VanHasen (@hasen_van) October 6, 2023 In response, Mekras tried to correct the belief that some XRP tokens were not yet “in existence” as he stated that XRP’s total supply of 100 billion has existed since “day 1,” meaning that 100% of its supply has been circulating from the beginning and some XRP tokens cannot be classified as ‘non-existent’ yet.  This debate seems to stem from the fact that Ripple has an escrow system in place. As such, some (like VanHansen) believe that the XRP in escrow lockups does not fall under its circulating supply and that this escrow system affects XRP’s deflationary status. However, people like Mekras argue that the escrow system doesn’t change the fact that the token is deflationary. VanHansen further argued that the token cannot be deflationary (except technically) as XRP’s circulating supply gets inflated every time “Ripple releases XRP from the escrow.” Both sides seemed to look at it from different angles, with Mekras abiding by what deflationary meant in the strict sense while VanHansen was trying to provide a context.  Bulls continue to fight to hold support &#124; Source: XRPUSD on Tradingview.com Is XRP Deflationary Or Not? It is worth mentioning that the XRP Ledger doesn’t exactly have a built-in mechanism to decrease the token&#8217;s total supply, unlike some other networks. For instance, Ethereum implemented the London hard fork, which introduced a fee-burning mechanism with some Ether burned immediately after processing a transaction. Related Reading: When Are AMMs Coming To XRP Ledger? Ripple CTO Gives Clear Answer However, in XRP’s case, these token burns have occurred coincidentally rather than being a deflationary model on the network. In July, an engineer at Ripple explained that the monumental increase in the burn rate was mostly because of the XRPL account deletions. He mentioned that 2 XRP are usually burned when an account is deleted.  He further noted that 85,556 old accounts on the Ledger were deleted in June, which led to over 100,000 XRP being burned. Hence, the burned token figure rises every time an account is deleted. Featured image from Facts.net, chart from Tradingview.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-09T10:00:59.000Z",
    "title": "10 Crypto Resources to Go From Zero to Hero",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/10-crypto-resources-to-go-from-zero-to-hero/",
    "description": "<p>Chainalysis released its crypto adoption report in September 2023. And this year’s Global Crypto Adoption Index showed that there’s been an increase in grassroots adoption of cryptocurrencies. This means that more regular people have shown interest in crypto. Joining our industry can be fun. But it has its fair share of frustration. One of the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/10-crypto-resources-to-go-from-zero-to-hero/\">10 Crypto Resources to Go From Zero to Hero</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-09T10:05:37.000Z",
    "title": "Why Bitunix Outshines its Competitors: An Interview with Slater, Head of Bitunix Asia Marketing",
    "url": "https://coinedition.com/why-bitunix-outshines-its-competitors-an-interview-with-slater-head-of-bitunix-asia-marketing/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H.jpg 730w, https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/10/CE-Interview-SLATER-H-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Slater H, the Head of Asia Marketing at Bitunix Innovation Ltd., is a multifaceted professional who has embraced various roles throughout his career, including those of a Trader, Trainer, YouTuber, and more. His remarkable journey commenced a decade ago when he embarked on his path as a forex trader. Fast forward ten years, and he [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/why-bitunix-outshines-its-competitors-an-interview-with-slater-head-of-bitunix-asia-marketing/\">Why Bitunix Outshines its Competitors: An Interview with Slater, Head of Bitunix Asia Marketing</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]