[
  {
    "source": "CoinDesk",
    "date": "2023-11-23T13:01:00.000Z",
    "title": "First Mover Americas: Uniswap’s UNI Rallies and Bitcoin Holds $37K",
    "url": "https://www.coindesk.com/markets/2023/11/23/first-mover-americas-uniswaps-uni-rallies-and-bitcoin-holds-37k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin [BTC] and crypto markets in context for Nov. 23, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-23T13:00:00.000Z",
    "title": "CoinFLEX creditors dissatisfied with restructuring to OPNX: Report  ",
    "url": "http://cointelegraph.com/news/coin-flex-creditors-unsatisfied-with-restructuring-process-to-opnx",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/aa80a8e0-ef94-4e25-90f5-001c329ea298.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>CoinFLEX creditors claim former CEO Mark Lamb and the OPNX exchange “misappropriated” their assets in a court filing. </p>\n                    <p><p>Some creditors of cryptocurrency futures exchange CoinFLEX are alleging that OPNX, a new crypto exchange established in part by Three Arrows Capital (3AC) co-founders Kyle Davies and Su Zhu, was created using CoinFLEX assets without their consent. </p><p>According to a writ of summons filed in the High Court of Hong Kong and seen by Cointelegraph, CoinFLEX creditors claim that OPNX co-founder and former CEO Mark Lamb is “misappropriating and/or otherwise wrongfully using the assets, human resources, intellectual properties, […] trade secrets and other technologies” of CoinFLEX by diverting them into OPNX. It alleges that Lamb performed these actions contrary to his responsibilities to CoinFLEX creditors during his tenure. </p><p>Citing the document, creditors say that Lamb devoted “time, attention, skill and/or effort” to setting up OPNX while simultaneously being employed as the CEO of CoinFLEX. </p><p>The document claims that the former CEO diverted clients and business opportunities to the rival exchange, misappropriated assets that belonged to the creditors, falsely represented that OPNX was associated with CoinFLEX creditors, divulged confidential trade secrets to third parties, solicited employees and contractors to move to OPNX, forged a fake nondisclosure agreement between himself and a third-party, and engaged in other actions that harmed the creditors.</p><p>According to a creditor who spoke with Cointelegraph, CoinFLEX’s terms of service required users to settle disputes through arbitration in Hong Kong, which is why the creditors have pursued legal action in Hong Kong instead of Seychelles, the firm’s place of domicile. The allegations have not been proven in the High Court of Hong Kong.</p><p>The plaintiffs listed in the document are two companies: Liquidity Technologies and Liquidity Technologies Software. According to Crunchbase data, the first is the Seychelles-based legal <a href=\"https://www.crunchbase.com/organization/coinflex\" target=\"_blank\" rel=\"noopener nofollow\">entity</a> under which CoinFLEX originally operated. The document lists Mark Lamb, crypto investor Roger Ver, Open Technologies Holdings, and Open Technology Markets as defendants. Open Technologies holdings and markets are two companies the document claims are associated with the OPNX crypto exchange.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/d8ae04c1-e65f-4cd9-ab0d-7f1de514a997.png\"  /><figcaption style=\"text-align: center;\">List of plaintiffs and defendants in Writ of Summons. Source: Hong Kong High Court.</figcaption></figure><p>In January, a pitch deck for OPNX was <a href=\"https://cointelegraph.com/news/3ac-coinflex-founders-collaborating-to-raise-25m-for-new-claims-trading-exchange\">leaked to the public</a> and was later confirmed by the founding team as authentic. The deck listed Davies and Zhu, Mark Lamb, and Sudhu Arumugam as OPNX co-founders. In September, Zhu <a href=\"https://cointelegraph.com/news/3ac-su-zhu-arrested-in-singapore\">was arrested in Singapore’s Changi International Airport</a> for non-compliance with a Singaporean Court Order regarding 3AC’s bankruptcy proceedings. Davies, too, was sentenced to four months in prison for contempt of court but was not within Singapore’s jurisdiction at the time of sentencing. He has <a href=\"https://cointelegraph.com/news/3ac-co-founder-kyle-davies-spotted-in-bali-report\">since been sighted</a> in Bali, Indonesia. </p><p>Critics, including BitMEX co-founder Arthur Hayes, Tech Crunch founder Michael Arrington, and financial and macro-financial executive Nik Bougalis, previously argued that investors <a href=\"https://cointelegraph.com/news/3ac-new-exchange-triggers-backlash-from-the-crypto-community-no-thank-you\">shouldn’t give OPNX founders more money</a> after they had already lost millions, <a href=\"https://cointelegraph.com/news/three-arrows-liquidators-recoup-losses-from-founders\">if not billions</a>, of dollars in customer assets. </p><p>However, OPNX pushed back against this criticism. When the <a href=\"https://cointelegraph.com/news/crypto-exchange-backed-by-3ac-founders-launches-with-claims-trading-plans\">exchange opened</a> in April, it argued that it would allow creditors to sell their claims on the exchange for quick cash, benefiting them, and therefore was good for creditors of bankrupt firms. Kyle Davies even stated that he would <a href=\"https://cointelegraph.com/news/kyle-davies-donate-future-opnx-earnings-3ac-creditors\">donate his share of the profit to 3AC creditors</a>. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/eb70a9b8-8d0c-4558-bb25-62ad968c6e76.png\"  /><figcaption style=\"text-align: center;\">CoinFLEX Writ of Summons “Indorsement of Claim” section. Source: Hong Kong High Court.</figcaption></figure><p>In February, OPNX CEO Leslie Lamb, who is also the wife of OPNX co-founder and CoinFLEX CEO Mark Lamb, <a href=\"https://www.linkedin.com/posts/leslietlamb_openexchange-opnx-womeninweb3-activity-7039298570130178048-RKkm/\" target=\"_blank\" rel=\"noopener nofollow\">posted</a> to LinkedIn, stating, “We're excited to announce that CoinFLEX will be officially rebranding to Open Exchange (OPNX).” In contrast to this statement, the Writ of Summons filed with the Court claims that OPNX is a separate exchange that CoinFLEX creditors never authorized.</p><p>In a conversation with Cointelegraph, a CoinFLEX creditor, who wished to be identified as “Kirill,” provided further details of the allegations being made by creditors. Kirill claimed he lost “a vast majority of [his] net worth” when CoinFLEX stopped processing withdrawals. According to Kirill, after withdrawals were halted, he and other creditors put together an “ad hoc creditor committee” to sort out what to do with the now-insolvent company. They also involved some of CoinFLEX’s initial investors. After months of deliberating, the committee decided to restructure the company and reopen the exchange.</p><p>Kirill stated that during this time, he became aware that Mark Lamb was talking to Davies and Zhu about investing in the new, restructured company. Kirill claims they were skeptical of involving the 3AC founders in the project. However, they claim that there was no formal way for CoinFLEX to either accept or reject them as investors since the firm was still going through a restructuring in the courts. The restructuring was <a href=\"https://coinflex.com/blog/coinflex-restructuring-is-approved\" target=\"_blank\" rel=\"noopener nofollow\">approved</a> on March 7, according to a CoinFLEX blog post.</p><p>According to Kirill, once the restructuring was approved, CoinFLEX creditors discovered that Mark Lamb was acting against the interests of creditors in the ways described in the Writ of Summons.</p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/roger-ver-denies-coinflex-ceo-s-claims-he-owes-firm-47m-usdc\"><strong>Roger Ver denies CoinFLEX CEO’s claims he owes firm $47M USDC</strong></a></p><p>After discovering these activities, the creditors filed the Writ of Summons, which Kirill claims was a required first step to obtaining an injunction against Mark Lamb to wrest control of the company away from him. They then filed for the injunction, which Kirill claims was granted by the court. The injunction allegedly states that Mark Lamb “cannot hold himself out to be a decision maker for Coinflex without express majority consent of the board.” </p><p>On October 31, the official OPNX account for X (formerly Twitter) <a href=\"https://twitter.com/OPNX_Official/status/1719292219549438246\" target=\"_blank\" rel=\"noopener nofollow\">posted</a> a “Creditor Tender Offer” to CoinFLEX stakeholders. The offer stated that CoinFLEX creditors who accept it “will collectively receive 25% equity in OPNX, distributed in proportion to claim size.” In addition, they will each receive a portion of the exchange’s native token, OX, but these tokens will be vested for ten years. In response, Kirill claimed that this tender offer was not legally valid, stating:</p><blockquote>“It's not legally valid. How's Mark gonna do the offer? You need the shares [to be] transferred by boards. They're not transferred by independent parties. Mark is not on the CoinFLEX board in Seychelles anymore. He doesn't have authority to transfer shares.”</blockquote><p>Kirill also claimed that the tender offer lacks the financial information for investors to make an informed decision. In his view, this makes it unreasonable for an investor to accept the offer. “The one important piece of Mark's offer is that it's completely devoid of any information,” Kirill stated. “Any rational fiduciary would never approve an offer like this.”</p><p>Cointelegraph also obtained an order from the Supreme Court of Seychelles, which sheds some light on Roger Ver’s role in the legal dispute. According to the order, CoinFLEX has accused “a large individual customer (Roger Ver)” of defaulting on a “written manual margin agreement.” This default originally caused the exchange to be unable to process withdrawals, according to CoinFLEX’s claim as quoted by the court’s order.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/48e78081-57f9-40cd-8a54-f989b84c729d.png\"  /><figcaption style=\"text-align: center;\">Caption: Order in CoinFLEX restructuring case. Source: Supreme Court of Seychelles.</figcaption></figure><p>Cointelegraph reached out to Roger Ver for comments. He denied that he walked away from a valid margin agreement. Instead, Ver stated that CoinFLEX made third parties aware of his trading positions, which knowledge they used to trade against him to his detriment. He claimed that CoinFLEX has agreed to an arbitration allowing him to recover the funds from these third parties.</p><p>“I was never in default and never owed CoinFLEX the $82M they initially claimed,” Ver stated. “The reality, and one that CoinFLEX has now agreed to, is that I was the one owed money the entire time, and I am the biggest victim.”</p><p>A spokesperson for OPNX declined to comment on the allegations. Since launching in April, OPNX has <a href=\"https://cointelegraph.com/news/opnx-launches-ousd-credit-currency-for-crypto-margin-trading\">developed a credit currency</a> for margin trading called “oUSD” and has <a href=\"https://cointelegraph.com/news/opnx-eu-spot-crypto-trading-license-lithuania\">obtained a Lithuania license</a> for spot trading throughout the EU. </p><p>According to Coingecko, OPNX currently <a href=\"https://www.coingecko.com/en/exchanges/opnx-derivatives\" target=\"_blank\" rel=\"noopener nofollow\">processes</a> over $32,000 in spot trading volume and over $82 million in derivatives volume each day. Criminal and civil proceedings against OPNX co-founders Davies and Zhu remain ongoing. </p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-23T12:45:46.000Z",
    "title": "FTX’s FTT token rallies 30% — Binance effect or FTX 2.0 reopening?",
    "url": "http://cointelegraph.com/news/ftx-ftt-token-rallies-30-binance-effect-or-ftx-2-0-reopening",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/4a63bfa9-9f85-40bf-8565-a09a3b224414.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This surge suggests significant institutional attention despite the token’s historical association with FTX’s financial challenges.</p>\n                    <p><p>Amid market uncertainties around Changpeng \"CZ\" Zhao’s departure as Binance CEO, the in-house cryptocurrency of the FTX crypto exchange, FTX Token (<a href=\"https://cointelegraph.com/ftx-token-ftt-price-index\">FTT</a>), witnessed a momentary bull run. FTT surged in market value by more than 55% in the past 48 hours and is currently trading at $4.63, reflecting a 30% increase from $3.56.</p><p>FTX’s native token is experiencing another surge following Binance’s $4.3 billion <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\">settlement with the United States Department of Justice</a><a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\"></a>, <a href=\"https://twitter.com/santimentfeed/status/1727479083834224910\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to on-chain analyst firm Santiment. This goes against expectations that FTT would fall in price because it's the new token representing the FTX crypto exchange’s relaunch (FTX 2.0). The token’s value appears to have been boosted, with the ten largest wallets accumulating $12.8 million in coins in 19 days.</p><p>According to Santiment, FTT has recorded 337% growth on the monthly chart, with a significant portion of these gains occurring in the last ten days. Notably, the top 10 whale wallets have been heavily accumulating FTT during this period, leading to a 255% increase in FTT’s market value compared to Bitcoin.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Those who took a chance on <a href=\"https://twitter.com/search?q=%24FTT&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$FTT</a> continue to be rewarded, with a second rally for <a href=\"https://twitter.com/hashtag/FTX?src=hash&amp;ref_src=twsrc%5Etfw\">#FTX</a>&#39;s native token coming after yesterday&#39;s <a href=\"https://twitter.com/hashtag/Binance?src=hash&amp;ref_src=twsrc%5Etfw\">#Binance</a> news. Its price appears to have been boosted by the 10 largest wallets accumulating $12.8M worth of coins in 19 days. <a href=\"https://t.co/V3QNq91asF\">https://t.co/V3QNq91asF</a> <a href=\"https://t.co/DL5pkVfW96\">pic.twitter.com/DL5pkVfW96</a></p>&mdash; Santiment (@santimentfeed) <a href=\"https://twitter.com/santimentfeed/status/1727479083834224910?ref_src=twsrc%5Etfw\">November 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>FTX’s recent approach of liquidating assets and transferring substantial funds across different exchanges has triggered heightened activity in the cryptocurrency market. In a significant move, FTX and its affiliate, Alameda Research, <a href=\"https://twitter.com/spotonchain/status/1727141064174366853\" target=\"_blank\" rel=\"noopener nofollow\">executed</a> a remarkable transfer of assets totaling $474 million. </p><p>However, this move could generate a depreciating effect on the FTT price. Data from Cointelegraph Markets Pro shows a decent chance to establish a price bottom at current lows since the market is now digesting the bad news.</p><p>This move is part of a broader effort to manage the exchange’s financial obligations and potentially pave the way for a new phase known as “FTX 2.0.”  The FTX team plans to <a href=\"https://cointelegraph.com/news/ftx-has-recovered-7-3b-in-assets-will-consider-rebooting-exchange-in-q2-2023\">restart the exchange</a> by the second quarter of 2024. Notably, this rise in FTT price occurs in the context of Binance’s $4.3 billion <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\">settlement with the United States Department of Justice.</a> </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/setting-new-standards-crypto-exchanges-after-ftx-report\"><strong><em>Setting new standards for crypto exchanges in the post-FTX era: Report</em></strong></a></p><p>In contrast, Binance’s <a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a> token <a href=\"https://cointelegraph.com/news/why-is-the-crypto-market-down-today\">declined, experiencing a 13% drop to $235.</a> Data from DefiLlama <a href=\"https://defillama.com/cexs\" target=\"_blank\" rel=\"noopener nofollow\">showed</a> that Binance’s 24-hour outflows topped $1 billion as of 3:30 pm, Hong Kong time on Nov. 22. The exchange’s net outflows over seven days amounted to $703.1 million.</p><p>In his <a href=\"https://cointelegraph.com/news/new-binance-ceo-richard-teng-very-strong-foundation-skeptics\">introductory post on \"X\" (formerly </a><a href=\"https://cointelegraph.com/news/new-binance-ceo-richard-teng-very-strong-foundation-skeptics\">Twitter) as Binance’s new CEO</a>, Richard Teng, who replaced CZ, said that “the foundation on which Binance stands today is stronger than ever.” Teng said he would initially focus on three aspects of the business: reinstating investor confidence, collaboration with regulators and driving Web3 adoption.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-substance-abuse-traders-trading/\"><strong><em>This is your brain on crypto: Substance abuse grows among crypto traders</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-23T12:57:34.000Z",
    "title": "Kraken’s Powell criticizes SEC’s ‘convenience-based’ enforcement actions in crypto industry",
    "url": "https://cryptoslate.com/krakens-powell-criticizes-secs-convenience-based-enforcement-actions-in-crypto-industry/",
    "description": "<p>Kraken co-founder Jesse Powell suggested that the U.S. Securities and Exchanges Commission (SEC) prioritized cases based on convenience, giving examples of the regulatory actions taken against U.S.-based entities like Coinbase, Ripple, and Kraken. In a Nov. 23 statement on social media platform X (formerly Twitter), Powell said these regulatory actions reflect a localized enforcement approach rather [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/krakens-powell-criticizes-secs-convenience-based-enforcement-actions-in-crypto-industry/\">Kraken&#8217;s Powell criticizes SEC&#8217;s &#8216;convenience-based&#8217; enforcement actions in crypto industry</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-23T12:44:41.000Z",
    "title": "Generative AI Chatbot to Enhance User Experience on GOV.UK",
    "url": "https://www.cryptopolitan.com/chatbot-to-enhance-user-experience/",
    "description": "The UK Government Digital Service (GDS) is making strides in improving the user experience on its official website, GOV.UK, with the development of a generative AI chatbot. In an era where digital interactions with government entities are becoming increasingly common, this innovation aims to streamline information access and enhance the overall usability of the platform. ... <a title=\"Generative AI Chatbot to Enhance User Experience on GOV.UK\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chatbot-to-enhance-user-experience/\" aria-label=\"More on Generative AI Chatbot to Enhance User Experience on GOV.UK\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-23T12:42:38.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now: how will this affect our Cosmos Price Prediction? How ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-23T12:45:27.000Z",
    "title": "Grayscale updates spot Bitcoin ETF application after meeting with SEC",
    "url": "https://crypto.news/grayscale-updates-spot-bitcoin-etf-application-after-meeting-with-sec/",
    "description": "Crypto asset manager Grayscale recently unveiled an updated version of its spot Bitcoin exchange-traded fund (ETF) following discussions with the US Securities and Exchange Commission (SEC). According to Bloomberg researcher James Seyffart, the updated documentation contains a plan to change&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-23T13:00:28.000Z",
    "title": "AVAX Holders Beware: $204 Million Token Unlock Could Trigger Price Crash Today",
    "url": "https://www.newsbtc.com/analysis/avax/avax-204-million-price-crash/",
    "description": "Token unlocks for cryptocurrencies such as AVAX are not new but that does not negate the kind of impact that these unlocks can have on the price. Depending on the size of the unlock, it could trigger a market crash as millions of new coins roll into circulation and are dumped on retail. This could certainly be the case for AVAX today given the size of the upcoming unlock. AVAX Unlock At $204 Million AVAX’s most recent unlock is about to see a total of 9.5 million tokens being brought into the open market. With the price of the altcoin trending above $21, this puts the total value of the unlock at approximately $204 million. Related Reading: Cardano Forecast: Crypto Analyst Identifies The Event That Could Send ADA Price To $11 According to data from the Token Unlocks website, this unlock will see another 2.68% of the total token supply added to the circulating supply. This will take the percentage of the total supply already unlocked from 55% to 57.68%. This cliff unlock will continue to inflate the AVAX supply, posing a potential roadblock for rallies as the supply increases. Source: Token Unlocks The standard allocation for this cliff unlock is spread across multiple spheres, with the largest portion going to staking rewards. 50% of the total unlocked tokens usually go to these stakes. Then the team portion is 10%, while the foundation gets 9.3%. Implications For Token Price Naturally, an inflation in supply is not good for the token price and this will likely be reflected in the AVAX price soon after. However, taking a look at the last unlock event carrying the same number of coins which took place on August 23, 2023, the chart shows only a small dip in price, suggesting that the unlock event had already been priced in. If this were to repeat, then it’s possible that the AVAX price could maintain its momentum. But the difference between the current trend and that of August is that the token’s price has risen quickly in the last day. This could trigger selling as investors try to take advantage of the price recovery and secure their gains. Related Reading: Ethereum L2 Blast Crosses $123 Million, Important Things To Know Before You Bridge In As data from IntoTheBlock shows, the percentage of AVAX holders that are currently sitting in profit has reached a new 20-month high. A total of 4.02 million holders are sitting in profit, which makes up 66% of the total holder base. The last time that the holder profitability was this high was back in April 2022 when the price was at $94.93. What followed was aggressive profit-taking that would send the price falling more than 70% in a few months. So a repeat of this could see the AVAX price return toward $10. Token price holds during last unlock &#124; Source: AVAXUSDT on Tradingview.com Featured image from Coin Culture, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-23T13:00:00.000Z",
    "title": "Gate.io Implements Zero-Knowledge Tech in New Proof of Reserves Method",
    "url": "https://coinedition.com/gate-io-implements-zero-knowledge-tech-in-new-proof-of-reserves-method/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/PR-1-139.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/PR-1-139.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-139-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-139-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-139-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-139-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-139-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-139-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-139-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-139-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-139-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-139-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-139-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-139-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-139-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-139-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/PR-1-139-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Gate.io, a leading cryptocurrency exchange and Web3 innovator, has announced upgrades to its Proof of Reserves (PoR) process, which includes a new open-source method utilizing zero-knowledge technology. Following the upgrade, the PoR process will now cover the top 100 digital assets, with certificates published regularly for enhanced transparency. Gate.io pioneered PoR in 2020 by enlisting [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/gate-io-implements-zero-knowledge-tech-in-new-proof-of-reserves-method/\">Gate.io Implements Zero-Knowledge Tech in New Proof of Reserves Method</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-23T12:50:20.000Z",
    "title": "Netflix Director’s Wild Dogecoin Gamble Pays off Big-Time",
    "url": "https://coinedition.com/netflix-directors-wild-dogecoin-gamble-pays-off-big-time/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/DOGECOIN-21.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/DOGECOIN-21.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/DOGECOIN-21-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/DOGECOIN-21-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/DOGECOIN-21-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/DOGECOIN-21-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/DOGECOIN-21-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The director of the Netflix science fiction series “Conquest,” Carl Erik Rinsch, reportedly spent $4 million of the show’s budget on Dogecoin (DOGE) and achieved a substantial gain through this endeavor. This was after the 46-year-old director secured a $61.2 million production contract from the streaming company. According to a report published by The New [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/netflix-directors-wild-dogecoin-gamble-pays-off-big-time/\">Netflix Director’s Wild Dogecoin Gamble Pays off Big-Time</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-23T12:45:30.000Z",
    "title": "$2,907,170,360 in Ethereum Accumulated by 200 Largest ETH Whales in One Year, Says Analytics Firm Santiment",
    "url": "https://dailyhodl.com/2023/11/23/2907170360-in-ethereum-accumulated-by-200-largest-eth-whales-in-one-year-says-analytics-firm-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/200-Largest-ETH-Whales.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/200-Largest-ETH-Whales.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/200-Largest-ETH-Whales.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/200-Largest-ETH-Whales.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/200-Largest-ETH-Whales.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/200-Largest-ETH-Whales.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/200-Largest-ETH-Whales.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A top crypto analytics firm says that the 200 largest Ethereum (ETH) holders went on a massive buying spree in the past year, picking up over $2.9 billion worth of the leading altcoin. According to Santiment, the top 200 ETH whales are now holding more than 62 million ETH valued at about $124.1 billion, an [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/23/2907170360-in-ethereum-accumulated-by-200-largest-eth-whales-in-one-year-says-analytics-firm-santiment/\">$2,907,170,360 in Ethereum Accumulated by 200 Largest ETH Whales in One Year, Says Analytics Firm Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]