[
  {
    "source": "CryptoSlate",
    "date": "2023-06-19T17:52:04.000Z",
    "title": "JP Morgan analysts believe Hinman documents will spur altcoins to mimic Ethereum",
    "url": "https://cryptoslate.com/jp-morgan-believes-hinman-documents-will-spur-altcoins-to-mimic-ethereum/",
    "description": "<p>Wall Street giant JP Morgan Chase &#38; Co.&#8217;s analysts believe the release of the Hinman documents will push altcoins to try and become as decentralized as Ethereum (ETH) to avoid regulatory hurdles, according to a research report seen by CoinDesk. The Hinman documents were released by Ripple on June 12 as part of its defense [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/jp-morgan-believes-hinman-documents-will-spur-altcoins-to-mimic-ethereum/\">JP Morgan analysts believe Hinman documents will spur altcoins to mimic Ethereum</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T17:53:14.000Z",
    "title": "Ethscriptions soars on Ethereum, following in Bitcoin’s footsteps",
    "url": "https://www.cryptopolitan.com/ethscriptions-soars-on-ethereum-btc-inspired/",
    "description": "A new protocol has been implemented on Ethereum that facilitates the making and trading of digital assets. The name &#8220;Ethscriptions&#8221; obviously alludes to a similar project by Ordinals called &#8220;Inscriptions,&#8221; which was deployed on the Bitcoin network. Ethscriptions on the Ethereum network are one of the many fascinating innovations in blockchain technology. Ethscriptions takes its ... <a title=\"Ethscriptions soars on Ethereum, following in Bitcoin&#8217;s footsteps\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethscriptions-soars-on-ethereum-btc-inspired/\" aria-label=\"More on Ethscriptions soars on Ethereum, following in Bitcoin&#8217;s footsteps\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T17:48:25.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-19T18:00:47.000Z",
    "title": "DigiToads (TOADS) Presale Explodes As Avalanche’s Ava Labs And VeChain (VET) Soars Amid Market Downturn",
    "url": "https://nulltx.com/digitoads-toads-presale-explodes-as-avalanches-ava-labs-and-vechain-vet-soars-amid-market-downturn/",
    "description": "Despite the latest market crackdown, crypto projects are still making giant strides. While VeChain&#8217;s price has soared lately, Avalanche&#8217;s Ava Labs is bridging the gap between Web3 and gaming. Meanwhile, DigiToads, a meme coin project with wide utility, has emerged as a major contender in the altcoin market. Through captivating gaming experiences, DigiToads has revolutionized [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-19T18:00:16.000Z",
    "title": "Crypto King Do Kwon Behind Bars: Sentenced To 4 Months In Montenegrin Jail",
    "url": "https://www.newsbtc.com/breaking-news-ticker/crypto-king-do-kwon-behind-bars-sentenced-to-4-months-in-montenegrin-jail/",
    "description": "According to a Reuters report, Crypto entrepreneur Do Kwon, the former CEO of Terraform Labs, has been sentenced to four months in prison by a court in Montenegro for allegedly using forged passports.  Crypto Mogul Faces Jail Time For Passport Forgery Kwon, who is charged with multibillion-dollar fraud in the United States and is wanted by South Korean authorities on similar charges, was detained in March along with Han Chang-Joon, the former finance officer of Terraform Labs, as they attempted to board a flight to Dubai at the airport in Montenegro&#8217;s capital, Podgorica. Both men were charged with forging official documents. Related Reading: Trust Wallet Token (TWT) Tallies 22% In Last Week, Will It Test $1 Mark? Kwon had argued that he believed the Costa Rican passport was a legitimate &#8220;golden passport&#8221; available to wealthy applicants seeking fast-track citizenship in certain countries. However, the court rejected this explanation and handed down the prison sentences. The case has attracted widespread media attention, as Kwon is wanted by US and South Korean authorities on fraud charges related to the collapse of Terra last May. The company&#8217;s collapse led to over $60 billion in losses and sparked investigations into Kwon&#8217;s activities. As Bloomberg reported on June 8th, Terraform Labs co-founder Do Kwon may face multiple jail terms in different countries, according to senior South Korean prosecutor Dan Sunghan.  During an interaction with Bloomberg, Sunghan stated that South Korea had conducted most of the foundational investigation into the collapse of the Terra ecosystem and had more evidence on the matter than US authorities. Related Reading: US Politician Cheers Shiba Inu Price Surge, But Trend Reversal Still Pending Sunghan believes that carrying out the investigation and trial of Kwon in South Korea is the most efficient approach to getting justice. He also suggested that Kwon could face jail sentences for different charges in two separate countries, in addition to the recent decision by Montenegro&#8217;s court.  Featured image from Unsplash, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T18:00:00.000Z",
    "title": "Onboarding Top Altcoins Solana, Avorak AI, and Ethereum is the Best Play for 2023",
    "url": "https://www.crypto-news-flash.com/onboarding-top-altcoins-solana-avorak-ai-and-ethereum-is-the-best-play-for-2023/?utm_source=rss&utm_medium=rss&utm_campaign=onboarding-top-altcoins-solana-avorak-ai-and-ethereum-is-the-best-play-for-2023",
    "description": "The cryptocurrency market has faced a consolidation period in 2023, but the market shows signs of heating up again. Investors have been looking for exciting investments to add to their listing, including major digital assets like Ethereum, Avorak AI, and Solana. These cryptocurrencies are great additions to investor portfolios that have shown promise, such as [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-19T18:05:20.000Z",
    "title": "New ‘Global CBDC Platform’ Must Be Built To Outrun Cross-Border Crypto Adoption: IMF Managing Director",
    "url": "https://dailyhodl.com/2023/06/19/new-global-cbdc-platform-must-be-built-to-outrun-cross-border-crypto-adoption-imf-managing-director/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/02/changing-money.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/02/changing-money.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/02/changing-money.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/02/changing-money.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/02/changing-money.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/02/changing-money.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/02/changing-money.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The International Monetary Fund (IMF) says that a planetary digital currency should be built to connect each country before the rise of cryptocurrencies does the same. Kristalina Georgieva, the IMF&#8217;s director, says that the agency is working on a worldwide platform for central bank digital currencies (CDBCs) to enable transactions between countries, reports Reuters. She [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/19/new-global-cbdc-platform-must-be-built-to-outrun-cross-border-crypto-adoption-imf-managing-director/\">New ‘Global CBDC Platform&#8217; Must Be Built To Outrun Cross-Border Crypto Adoption: IMF Managing Director</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]