[
  {
    "source": "CoinDesk",
    "date": "2024-01-10T19:44:14.000Z",
    "title": "Cboe Says Bitcoin ETFs to Start Trading Thursday, Though the SEC Hasn't Approved Them Yet",
    "url": "https://www.coindesk.com/business/2024/01/10/cboe-says-bitcoin-etf-to-start-trading-thursday-ahead-of-secs-official-approval/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The exchange's website listed six bitcoin ETF applicants to start trading tomorrow."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-10T19:50:53.000Z",
    "title": "Twitch, Unity Layoffs Keep Grim Gaming Industry Trend Alive in 2024",
    "url": "https://decrypt.co/212318/twitch-unity-layoffs-keep-grim-gaming-industry-trend-alive-2024",
    "description": "Gaming firms have already revealed over 2,000 job cuts in 2024, with Unity and Twitch leading the way on layoffs. It's more of the same from last year."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-10T20:00:00.000Z",
    "title": " Logan Paul to buy back NFTs, Bitcoin hosts SNES games: Nifty Newsletter ",
    "url": "https://cointelegraph.com/news/logan-paul-buy-back-nfts-bitcoin-snes-games-nifty-newsletter",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZjcxN2EyMjktOWYxOS00NjlhLWE3YTItNzhlNmQyOTcyN2QyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Developers at Ninjalerts inscribed a Super Nintendo emulator on the Bitcoin blockchain, allowing the community to play classic games. </p>\n                    <p><p>In this week’s newsletter, read about <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> founders who started giving company equity to their holders, and check out how community members responded to YouTuber Logan Paul finally refunding disgruntled investors of his CryptoZoo NFT project. In other news, find out how NFTs are stored and how Ninjalerts developers inscribed the Super Nintendo emulator on the Bitcoin network. </p><p>During the holiday season, Pons Asinorum, the founder of “The Plague” NFT collection, announced their holders would be gifted a percentage of their company shares. Following the announcement, another NFT collection founder, Ovie Faruq, also known as OSF in the NFT space, revealed a similar move on Jan. 1 for holders of the Rektguy NFT collection. </p><p>While this seems like a legal risk, Pons believes the move is legal as it was completely unexpected. The pseudonymous NFT founder told Cointelegraph there was no expectation that the holders would receive equity and clarified that it was a gift. </p><p><a href=\"https://cointelegraph.com/news/logan-paul-buy-back-nfts-bitcoin-snes-games-nifty-newsletter\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-10T19:54:32.000Z",
    "title": " CoinGecko&#039;s X accounts compromised in phishing attack ",
    "url": "https://cointelegraph.com/news/coingecko-x-accounts-compromised-phishing-attack",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYjZmOTFiN2UtNTJkNC00ODQwLWJiNDktNWIwNjY4NTNhN2ZmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The account was briefly compromised on Jan. 10 and developers have since restored control. </p>\n                    <p><p>Cryptocurrency data aggregator CoinGecko's X account and terminal were brieflycompromised on Jan. 10.</p><p>As <a href=\"https://twitter.com/coingecko/status/1745158344191717746\" target=\"_blank\" rel=\"noopener nofollow\">told</a> by CoinGecko developers, \"We're taking immediate steps to investigate the situation and secure our accounts,\" warning that users should not \"click on any links or engage with suspicious content.\" </p><p>For a brief period on Jan. 10, a phishing scam link informing users of a CoinGecko token airdrop was posted to the firm's X account. The post has since been deleted. </p><p><a href=\"https://cointelegraph.com/news/coingecko-x-accounts-compromised-phishing-attack\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-10T19:51:47.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Cboe approves listing of spot Bitcoin ETFs ahead of potential SEC approval, this on the heels yesterday's false start after the X account of the United States Securities and Exchange Commission (SEC) was hacked — posting a fake announcement regarding approval of the ETF product. Just recently, Gary Gensler posted a thread on X reminding investors about the dangers of investing in crypto. </p><p>Despite the Jan. 9 kerfuffle involving the U.S. Securities and Exchange Commission’s X (formerly Twitter) account being hacked, the SEC appears to be inching ever closer to full approval of listing shares of a spot Bitcoin exchange-traded fund (ETF).</p><p>The Cboe BZX Exchange announced that it had approved securities listings from several asset managers, a move which could be leading up to the SEC’s actual approval of one or more spot Bitcoin ETFs. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-10T19:49:55.000Z",
    "title": " US lawmaker reports ETH purchases up to $65K in 2024 ",
    "url": "https://cointelegraph.com/news/us-lawmaker-eth-purchase",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvN2I4NjEyZDAtMmIyOC00NjFlLTkyM2YtZDIyM2E1MmQxNTIyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Representative Mike Collins, who disclosed he had purchased up to $45,000 in Ether in 2023, reported up to $65,000 across two ETH buys in 2024.</p>\n                    <p><p>According to disclosure documents filed with the U.S. House of Representatives, Georgia Representative Mike Collins purchased up to $65,000 worth of Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) in 2024.</p><p>According to a Jan. 9 filing with the House’s Financial Disclosure Reports Database, Rep. Collins <a href=\"https://disclosures-clerk.house.gov/public_disc/ptr-pdfs/2024/20024275.pdf\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> he had purchased up to $15,000 worth of ETH on Jan. 3 and up to $50,000 worth of the token on Jan. 8. The U.S. lawmaker has been trading ETH since at least 2023 according to similar filings, <a href=\"https://disclosures-clerk.house.gov/public_disc/ptr-pdfs/2023/20024042.pdf\" target=\"_blank\" rel=\"noopener nofollow\">reporting</a> total purchases up to $110,000.</p><p>Under the Stop Trading on Congressional Knowledge Act, or STOCK Act, U.S. lawmakers are largely required to report investments to Congress. However, they are still permitted to oversee or propose legislation on matters potentially related to their investments, which many have <a href=\"https://cointelegraph.com/news/alexandria-ocasio-cortez-says-us-lawmakers-shouldn-t-hold-crypto-to-remain-impartial\">called a potential conflict of interest</a> between their public service and personal wealth. </p><p><a href=\"https://cointelegraph.com/news/us-lawmaker-eth-purchase\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-10T19:49:04.000Z",
    "title": " Fidelity app lists the Bitcoin ETFs of ARK 21Shares, VanEck, WisdomTree, Invesco ",
    "url": "https://cointelegraph.com/news/fidelity-app-lists-bitcoin-etfs-ark-21shares-vaneck-wisdomtree-invesco",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYjcwYTE3MDUtZGI5ZC00MGRiLTg5MDctYzI1YjkyN2Q3NzZmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Fidelity web app on January 10 showed pages for some of the as yet unapproved Bitcoin spot ETFs.</p>\n                    <p><p>In a growing sign that spot Bitcoin exchange-traded funds (ETF) may be approved, stock brokerage service Fidelity Investments listed several of the proposed ETFs on its web app on Jan. 10, including the ARK 21Shares Bitcoin ETF (ARKB), Vaneck Bitcoin Trust ETF (HODL), Invesco Galaxy Bitcoin ETF (BTCO), Franklin Bitcoin ETF (EZBC) and Wisdom Tree Bitcoin ETF (BTCW).</p><p>At the time of publication, other proposed spot Bitcoin ETFs are not listed on the app, including the BlackRock iShares Bitcoin Trust (IBTC), BitWise Bitcoin ETF (BITB), Fidelity Wise Origin Bitcoin Trust (FBTC) and Hashdex Bitcoin ETF. The decision not to list these products doesn't necessarily mean they won't eventually be listed.</p><p>The Fidelity app pages for these funds appear to have been populated from templates. They contain stock risk disclaimers and a blank chart. Presently, the shares for these funds cannot be purchased on these pages.</p><p><a href=\"https://cointelegraph.com/news/fidelity-app-lists-bitcoin-etfs-ark-21shares-vaneck-wisdomtree-invesco\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2024-01-10T20:05:40.000Z",
    "title": "Hashdex files updated spot Bitcoin ETF, CBOE to open trading Jan. 11",
    "url": "https://crypto.news/hashdex-files-updated-spot-bitcoin-etf-cboe-to-open-trading-jan-11/",
    "description": "Issuers submitted last-minute amendments on spot Bitcoin ETF deadline day as the Chicago Board Options Exchange disclosed the first trading date. "
  },
  {
    "source": "BTCManager",
    "date": "2024-01-10T19:59:49.000Z",
    "title": "Analyst: What false Bitcoin ETF Approval means for BTC",
    "url": "https://crypto.news/analyst-what-false-bitcoin-etf-approval-means-for-btc/",
    "description": "YouTube analyst Crypto Banter predicts that Bitcoin is still on an uptrend despite a false SEC announcement and Gary Gensler's clarification."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-10T20:00:52.000Z",
    "title": "Crypto Payments Soared To Unprecedented Levels In 2023, CoinGate Report Reveals",
    "url": "https://www.newsbtc.com/news/crypto-payments-soared-to-unprecedented-levels-in-2023-coingate-report-reveals/",
    "description": "The year 2023 witnessed a remarkable surge in crypto payments, signaling a significant milestone in adopting digital currencies for retail and e-commerce transactions.  According to a recent report by CoinGate, a crypto payment processor firm, the number of crypto payments processed reached staggering heights, showcasing robust growth and diversification in the crypto landscape.  Massive Surge In Crypto Payments In 2023, CoinGate processed an astounding 1,294,058 cryptocurrency payments, marking a 39.4% increase compared to the previous record. This exponential growth, equivalent to one payment every 24 seconds, underscores the accelerating pace of crypto adoption.  Notably, approximately one-third (32.35%) of all transactions processed by CoinGate in the last ten years occurred in 2023, emphasizing the surge in the popularity of digital currencies. Related Reading: Cardano Price Explosion: Crypto Analyst Predicts ADA Price To Hit $6 Per the report, integrating Binance Pay wallet into CoinGate&#8217;s payment services in March 2023 played a significant role in driving this growth.  Binance Pay accounted for 8.2% of all crypto payments in 2023, showcasing a steady increase in usage throughout the year. This upward trend, from 4.5% in March to 13% in December, indicates the growing adoption and usage of Binance Pay as a preferred payment method. Lightning Network Surges In Popularity Moreover, CoinGate&#8217;s report highlights the increasing maturity and acceptance of the Lightning Network, an essential component of Bitcoin payments.  In 2023, the Lightning Network facilitated 7.8% of all Bitcoin payments processed by CoinGate, representing a notable increase from previous years.  Furthermore, the overall number of Lightning Network payments grew by 35.9% compared to the previous year, indicating a growing reliance on this technology.  However, Bitcoin, long considered the dominant cryptocurrency for payments, saw a decline in its share of total transactions processed by CoinGate. While Bitcoin accounted for 54.8% of all transactions in 2021, its share dropped to 35.6% in 2023.  Stablecoins, particularly Tether’s USDT, emerged as a popular choice for crypto payments in 2023. The usage of USDT increased from 15.1% in 2022 to an average of 25.4% in 2023, indicating a shift towards stablecoins due to their perceived stability and reliability.  Alternative Payment Solutions  According to CoinGate’s report, crypto-friendly merchants experienced remarkable success in 2023, with a significant portion of their sales attributed to cryptocurrency payments.  Eldorado.gg, a gold and accounts marketplace for gamers, reported crypto payments contributing to 3% of their total sales. IPRoyal, a proxy service provider, saw over 30% of their payments made in cryptocurrencies.  Hostinger, a web hosting provider, captured nearly one-fourth of all crypto-paying customers, showcasing the effectiveness of alternative payment solutions in catering to diverse customer needs. Related Reading: Ethereum’s Bullish Breakout: Analysts Predict Surge To $3,500 – Here’s Why Overall, 2023 demonstrated a paradigm shift in the adoption of cryptocurrency payments. The surge in transactions processed by CoinGate, the increasing usage of Binance Pay and the Lightning Network, and the diversification of cryptocurrencies used for payments all point towards a new era of acceptance and trust in digital currencies.  As crypto-friendly merchants reap the benefits of embracing these payment methods, it becomes evident that cryptocurrency payments offer sales growth, solutions for the unbanked population, and global accessibility.  With the stage set for further expansion in 2024, the transformative power of cryptocurrency payments continues to reshape the retail and e-commerce landscape. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-10T20:03:21.000Z",
    "title": "Bitcoin ETFs Set to Go Live: Cboe Announces Launch Date Despite Pending SEC Approval",
    "url": "https://www.crypto-news-flash.com/bitcoin-etfs-set-to-go-live-cboe-announces-launch-date-despite-pending-sec-approval/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-etfs-set-to-go-live-cboe-announces-launch-date-despite-pending-sec-approval",
    "description": "<img width=\"1000\" height=\"333\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Volodymyr-Plysiuk-Bitcoin-ETF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin Spot ETF\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Volodymyr-Plysiuk-Bitcoin-ETF.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Volodymyr-Plysiuk-Bitcoin-ETF-150x50.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Volodymyr-Plysiuk-Bitcoin-ETF-450x150.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Volodymyr-Plysiuk-Bitcoin-ETF-768x256.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Volodymyr-Plysiuk-Bitcoin-ETF-300x100.jpg 300w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Cboe Global Markets is set to list six bitcoin ETFs including Ark 21, Fidelity, Franklin Templeton, Invesco, VanEck, and WisdomTree. The SEC&#8217;s approval of these ETFs is still pending, which could significantly impact the accessibility and investment landscape of bitcoin. In an unprecedented move, Cboe Global Markets has announced the imminent listing of six spot [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-10T19:42:51.000Z",
    "title": "Shytoshi Kusama Unleashes .SHIB Domain: Web3 Interoperability Revolution",
    "url": "https://www.crypto-news-flash.com/shytoshi-kusama-unleashes-shib-domain-web3-interoperability-revolution/?utm_source=rss&utm_medium=rss&utm_campaign=shytoshi-kusama-unleashes-shib-domain-web3-interoperability-revolution",
    "description": "<img width=\"2127\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba-Inu-SHIB-logo-with-trading-background-graphics\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics.jpg 2127w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-1024x578.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-768x433.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-1536x867.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-2048x1155.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-150x85.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-450x254.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-trading-background-graphics-1200x677.jpg 1200w\" sizes=\"(max-width: 2127px) 100vw, 2127px\" />The Shiba Inu community is actively working on curating a &#8220;network state&#8221; to revolutionize support for both Web2 and Web3 collectively. Shiba Inu&#8217;s community, in collaboration with D3 Inc, is venturing into internet domains by applying for a &#8220;.SHIB&#8221; Top-Level Domain (TLD). Shytoshi Kusama, the lead developer of Shiba Inu, injected a wave of optimism [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-10T19:45:38.000Z",
    "title": "‘Mysterious’ Crypto Lobbying Group Sets Up Near Washington D.C. as US Elections Approach: Report",
    "url": "https://dailyhodl.com/2024/01/10/mysterious-crypto-lobbying-group-sets-up-near-washington-d-c-as-us-elections-approach-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/mysterious-crypto-group-near.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/mysterious-crypto-group-near.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/mysterious-crypto-group-near.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/mysterious-crypto-group-near.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/mysterious-crypto-group-near.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/mysterious-crypto-group-near.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/mysterious-crypto-group-near.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto lobbying group with little publicly available information is gearing up to advocate for digital assets ahead of this year&#8217;s US presidential election, according to a new report. CNBC reports that a &#8220;mysterious&#8221; nonprofit called &#8220;The Cedar Innovation Foundation&#8221; was incorporated in Delaware in April. The group&#8217;s website and account on the social media [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/10/mysterious-crypto-lobbying-group-sets-up-near-washington-d-c-as-us-elections-approach-report/\">‘Mysterious’ Crypto Lobbying Group Sets Up Near Washington D.C. as US Elections Approach: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-10T19:41:40.000Z",
    "title": "SEC Says Apparent Hack of Its X Account Won’t Derail Its Decision on Bitcoin ETF Approval: Report",
    "url": "https://dailyhodl.com/2024/01/10/sec-says-apparent-hack-of-its-x-account-wont-derail-its-decision-on-bitcoin-etf-approval-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/sec-suffers-blow-against.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/sec-suffers-blow-against.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/sec-suffers-blow-against.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/sec-suffers-blow-against.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/sec-suffers-blow-against.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/sec-suffers-blow-against.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/sec-suffers-blow-against.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Securities and Exchange Commission (SEC) reportedly says that the recent compromise of its X account won’t impede its decision on whether or not to approve a spot market Bitcoin (BTC) exchange-traded fund (ETF). According to a new report by Reuters, unnamed sources say they do not expect the apparent hack to derail the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/10/sec-says-apparent-hack-of-its-x-account-wont-derail-its-decision-on-bitcoin-etf-approval-report/\">SEC Says Apparent Hack of Its X Account Won’t Derail Its Decision on Bitcoin ETF Approval: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]