[
  {
    "source": "CryptoSlate",
    "date": "2023-06-02T09:50:43.000Z",
    "title": "Tether market cap hits all time high",
    "url": "https://cryptoslate.com/insights/tether-market-cap-hits-all-time-high/",
    "description": "<p>Quick Take Tether&#8217;s market cap has just hit an all-time high of $83.2 billion. However, according to Kaiko&#8217;s research, Tether&#8217;s trade volume is at multi-year lows; this includes both CEXs and DEXs, which had a daily USDT volume of around $7 billion in May. Currently, the total market cap of the top 5 stablecoins is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/tether-market-cap-hits-all-time-high/\">Tether market cap hits all time high</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-02T09:58:00.000Z",
    "title": "LTC Starts June Strong, Crypto Daily TV 2/6/2023",
    "url": "https://cryptodaily.co.uk/2023/06/ltc-starts-june-strong-crypto-daily-tv-2-6-2023",
    "description": "In Todays Headline TV CryptoDaily News:\n<p></p>\n<p>MakerDAO paves the way for additional U.S. treasury purchase</p>\n<p>The community governing MakerDAO, the organization behind stablecoin DAI, has paved the way to purchase up to an additional $1.28 billion in U.S. government bonds via crypto asset manager BlockTower Capital.</p>\n<p>Crypto data firm Nansen to lay Off 30% of staff</p>\n<p>Blockchain analytics platform Nansen said it is laying off 30% of its workforce, citing broader difficulties in the crypto market. The firm had tried to expand into business areas that were not core to the company&rsquo;s strategy, Nansen CEO Alex Svanevik said in a statement.</p>\n<p>Litecoin starts June strong</p>\n<p>Litecoin has begun the month with a rally. It is up 7.5% over the last 30 days, the third-best result among crypto assets over that period, topping both Bitcoin and Ethereum.</p>\nBTC/USD dove 1.0% in the last session.\n<p>The Bitcoin-Dollar pair plummeted 1.0% in the last session. The Stochastic-RSI is giving a negative signal. Support is at 26315.3333 and resistance is at 28307.3333.</p>\n<p>The Stochastic-RSI is giving a negative signal.</p>\n<p></p>\nETH/USD made a minor downwards correction of 0.1%.\n<p>The Ethereum-Dollar pair saw a minor dip of 0.1% in the last session. The Stochastic indicator is giving a negative signal. Support is at 1823.0867 and resistance is at 1931.4667.</p>\n<p>The Stochastic indicator is currently in the negative zone.</p>\n<p></p>\nXRP/USD plummeted 1.4% in the last session.\n<p>The Ripple-Dollar pair plummeted 1.4% in the last session. The Williams indicator is giving a negative signal, going against our overall technical analysis. Support is at 0.4885 and resistance is at 0.5418.</p>\n<p>The Williams indicator is currently in negative territory.</p>\n<p></p>\nLTC/USD skyrocketed 4.8% in the last session.\n<p>The Litecoin-Dollar pair skyrocketed 4.8% in the last session. According to the Stochastic-RSI, we are in an overbought market. Support is at 85.8567 and resistance is at 94.9767.</p>\n<p>The Stochastic-RSI is signalling an overbought market.</p>\n<p></p>\nDaily Economic Calendar:\n<p>US Nonfarm Payrolls</p>\n<p>The Nonfarm Payrolls presents the number of new jobs created during the previous month, excluding the agricultural sector. The US Nonfarm Payrolls will be released at 12:30 GMT, the US Average Hourly Earnings at 12:30 GMT, and the French Industrial Output at 06:45 GMT.</p>\n<p>US Average Hourly Earnings</p>\n<p>The Average Hourly Earnings are a significant indicator of labor cost inflation and of the tightness of labor markets.</p>\n<p>FR Industrial Output</p>\n<p>The Industrial Output shows the volume of production of industries, i.e., factories and manufacturing. </p>\n<p>ES Unemployment Change</p>\n<p>The Unemployment Change measures the absolute change in the number of unemployed people using seasonally adjusted data. A rise in this indicator has negative implications for consumer spending. Spain's Unemployment Change will be released at 07:00 GMT, Japan's CFTC JPY NC Net Positions at 20:30 GMT, and the UK's CFTC GBP NC Net Positions at 20:30 GMT.</p>\n<p>JP CFTC JPY NC Net Positions</p>\n<p>The weekly Commitments of Traders (COT) report provides information on the size and the direction of the positions taken. The report focuses on speculative positions.</p>\n<p>UK CFTC GBP NC Net Positions</p>\n<p>The weekly Commitments of Traders (COT) report provides information on the size and the direction of the positions taken. The report focuses on speculative positions.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-02T09:55:29.000Z",
    "title": "LSD Tokens Rally As Ethereum Staking Ramps Up, Here Are The Leaders",
    "url": "https://www.newsbtc.com/news/ethereum/lsd-tokens-rally-as-ethereum-staking-ramps-up-here-are-the-leaders/",
    "description": "Ethereum Liquid staking derivatives (LSD) tokens are taking over the reins today as they have begun another rally. This rally was a result of an accelerated rate of ETH staking, which has led to a surge in the balances of these liquid staking protocols. LSD Tokens Take Advantage Of The Surge As the total amount of ETH staked on the Ethereum network rose, so did the value of LSD tokens rise. Over the last day, coins like Lido Finance (LDO) and Rocket Pool (RPL) have been on the rise. The latter also emerged as the number 3 top gainer with almost 10% gains in the last 24 hours. Related Reading: The Bitcoin Bear Market Is Far From Over, Here’s Why Lido’s market share in the liquid staking market has also risen as the protocol now accounts for 37.85% of all ETH staked in liquid derivatives protocols. Coinbase is the second-largest with 11.88% of the market share and Rocket Pool accounts for 7.72% of the market share. LDO price surges 10% in 24 hours &#124; Source: LDOUSD on TradingView.com Other LSD tokens have also returned to green on the last day as well, with pSTAKE Finance’s PSTAKE rallying 3% and StakeWise’s SWISE rising almost 4% in the same time period. Ethereum Staking Not Slowing Down In the last two days, the total amount of ETH staked on the Ethereum network has risen drastically. As stakers have settled back in from the withdrawal update that was made about a month ago, they have moved back into staking more ETH. Staked ETH rises above 23.9 million &#124; Source: Etherscan The total ETH in the deposit contract had risen by 95,008 ETH, meaning that over $180 million worth of ETH was added to the contract in the space of 48 hours. This shows that June is starting off as a bullish month for Ethereum at least, which could signal a recovery to come for the market. Related Reading: Optimism Crashes 33% Following Token Unlocks, Why There Could Be More Pain To Come As a result of this accelerated timeframe, the total staked Ether on the Beacon Contract crossed 23.9 million tokens. This works out to a total value of more than $45.3 billion that is now staked on the Ethereum Proof of Stake network. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-02T10:02:21.000Z",
    "title": "VeChain and Monero whales begin accumulating Collateral Network",
    "url": "https://www.crypto-news-flash.com/vechain-and-monero-whales-begin-accumulating-collateral-network/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-and-monero-whales-begin-accumulating-collateral-network",
    "description": "<p>As the presale phase of Collateral Network (COLT) gains momentum, notable whales from the VeChain (VET) and Monero (XMR) communities have started accumulating tokens. This article takes a closer look at the reasons behind their interest in the Collateral Network presale and explores the potential implications for both the project and the broader crypto market. [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/vechain-and-monero-whales-begin-accumulating-collateral-network/\">VeChain and Monero whales begin accumulating Collateral Network</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-02T09:53:23.000Z",
    "title": "BREAKING: Coinbase Launches Derivatives Exchange with Institutional-Sized Contracts at 1 Bitcoin (BTC) and 10 Ethereum (ETH).",
    "url": "https://www.crypto-news-flash.com/breaking-coinbase-launches-derivatives-exchange-with-institutional-sized-contracts-at-1-bitcoin-btc-and-10-ethereum-eth/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-coinbase-launches-derivatives-exchange-with-institutional-sized-contracts-at-1-bitcoin-btc-and-10-ethereum-eth",
    "description": "<p>Coinbase brings BTC and ETH futures trading facility specifically for institutional players with contracts sized at 1 BTC and 10 ETH. Coinbase aims to cater to the needs of institutional investors by introducing institutional-sized contracts with lower fees compared to traditional offerings. On Thursday, June 1, Coinbase, the biggest crypto exchange in the United States [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/breaking-coinbase-launches-derivatives-exchange-with-institutional-sized-contracts-at-1-bitcoin-btc-and-10-ethereum-eth/\">BREAKING: Coinbase Launches Derivatives Exchange with Institutional-Sized Contracts at 1 Bitcoin (BTC) and 10 Ethereum (ETH).</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-02T09:51:54.000Z",
    "title": "Ethereum Faces Rejection, Polkadot Experiences Correction, and Tradecurve Surges 25%",
    "url": "https://www.crypto-news-flash.com/ethereum-faces-rejection-polkadot-experiences-correction-and-tradecurve-surges-25/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-faces-rejection-polkadot-experiences-correction-and-tradecurve-surges-25",
    "description": "<p>After a rally above $1,900, the number one altcoin Ethereum has encountered rejection while aiming for $2K. Similarly, Polkadot  has also witnessed a price correction after a recent upswing. Despite the predominant bearish outlook of the crypto market, a new entrant in the crypto space, Tradecurve, has caught the attention of investors and traders surging [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/ethereum-faces-rejection-polkadot-experiences-correction-and-tradecurve-surges-25/\">Ethereum Faces Rejection, Polkadot Experiences Correction, and Tradecurve Surges 25%</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-02T09:50:58.000Z",
    "title": "Digital Outlook Shares His Thoughts on Whether Ripple XRP Case Is Really Over",
    "url": "https://coinedition.com/digital-outlook-shares-his-thoughts-on-whether-ripple-xrp-case-is-really-over/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/XRP-RIPPLE-Is-It-Really-Over-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/XRP-RIPPLE-Is-It-Really-Over-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/XRP-RIPPLE-Is-It-Really-Over-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/XRP-RIPPLE-Is-It-Really-Over-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/XRP-RIPPLE-Is-It-Really-Over-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/XRP-RIPPLE-Is-It-Really-Over-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/XRP-RIPPLE-Is-It-Really-Over.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>YouTuber David from Digital Outlook speculates on why June 2023 could be a game-changing month for the ongoing Ripple vs. SEC lawsuit in one of his recent videos. David talks about the rumors and truemors that the 2.5-year-old lawsuit could likely conclude in June. Speaking about why he believes this month is crucial, David stated [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/digital-outlook-shares-his-thoughts-on-whether-ripple-xrp-case-is-really-over/\">Digital Outlook Shares His Thoughts on Whether Ripple XRP Case Is Really Over</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]