[
  {
    "source": "Bitcoin.com",
    "date": "2023-07-17T11:30:13.000Z",
    "title": "Crypto Crime Plummets in 2023, Down 65% Overall, Chainalysis Says",
    "url": "https://news.bitcoin.com/crypto-crime-plummets-in-2023-down-65-overall-chainalysis-says/",
    "description": "<img width=\"768\" height=\"412\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/chainalysis-crypto-crime1-768x412.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Crime Plummets in 2023, Down 65% Overall, Chainalysis Reports\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/chainalysis-crypto-crime1-300x161.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/chainalysis-crypto-crime1-1024x549.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/chainalysis-crypto-crime1-768x412.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/chainalysis-crypto-crime1-1536x824.jpg 1536w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/chainalysis-crypto-crime1-2048x1099.jpg 2048w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Cryptocurrency-related crime is down significantly this year, according to data by Chainalysis. Specifically, the blockchain analytics firm explained that crypto inflows to known illicit entities are down 65% compared to the previous year while inflows to risky entities are down 42%. Crypto Crime Down &#8216;Significantly&#8217; This Year Blockchain analytics firm Chainalysis released its mid-year update [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T11:10:23.000Z",
    "title": "Unstoppable Domains expands Web3 offerings with Ethereum Name Service support",
    "url": "https://www.cryptopolitan.com/unstoppable-domains-expands-web3-offerings-with-ethereum-name-service-support/",
    "description": "In a significant move to bolster the Web3 space, digital identity platform Unstoppable Domains has announced support for Ethereum Name Service (ENS) domain names. However, the integration allows users to register a simpler name, like &#8220;me.eth,&#8221; in place of lengthy wallet addresses, according to company sources. This latest development expands Unstoppable Domains&#8217; portfolio of Web3 ... <a title=\"Unstoppable Domains expands Web3 offerings with Ethereum Name Service support\" class=\"read-more\" href=\"https://www.cryptopolitan.com/unstoppable-domains-expands-web3-offerings-with-ethereum-name-service-support/\" aria-label=\"More on Unstoppable Domains expands Web3 offerings with Ethereum Name Service support\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-17T11:30:29.000Z",
    "title": "Big Bitcoin Move Ahead: Bollinger Bands See Extreme Squeeze",
    "url": "https://www.newsbtc.com/news/bitcoin/big-bitcoin-move-ahead-bollinger-bands-see-extreme-squeeze/",
    "description": "Since the Bitcoin price reached a new yearly high of $31,840 last week, only to invalidate the bullish breakout within a few hours and fall towards $30,000, there has been a strange tranquility in the market. Already since June 23, BTC has been in the trading range between $29,800 and $31,300, with every breakout attempt to the upside and downside having failed within a very short period of time. However, one of the most prominent technical indicators, the Bollinger Bands, predict that this calm may soon be over. Created by the esteemed trader John Bollinger, these bands provide invaluable insights into market volatility and potential price levels. Bollinger Bands Predict Big Move For Bitcoin The Bollinger Bands consist of three distinct lines on a price chart: the middle band, the upper band, and the lower band. The middle band is a simple moving average (SMA) that represents the average price over a specified period. The upper and lower bands are derived from the middle band, with the upper band usually set two standard deviations above the SMA, and the lower band set two standard deviations below it. Related Reading: $18 Billion Worth Of Bitcoin Accumulated At $30,200 – BTC Bull Run Incoming? The primary purpose of the Bollinger Bands is to measure market volatility. When the price of an asset experiences significant fluctuations, the bands widen, indicating increased volatility. Conversely, during periods of reduced price movement, the bands contract, indicating lower volatility. This contraction is commonly referred to as a &#8220;squeeze,&#8221; where the upper and lower bands come closer together, forming a narrowing price channel. When the Bollinger Bands squeeze, the potential for a significant price movement looms. The squeeze suggests that the market is in a state of temporary equilibrium, akin to a coiled spring ready to release its stored energy. The direction of the breakout determines whether it&#8217;s a bullish or bearish signal. Up Or Down? Glassnode, a respected on-chain data provider, highlighted today the current state of the Bitcoin market, noting a remarkably low volatility environment. The 20-day Bollinger Bands are experiencing an extreme squeeze, with a mere 4.2% price range separating the upper and lower bands. This suggests that Bitcoin is currently in a period of limited price movement, “making this the quietest Bitcoin market since the lull in early January.” As Bitcoin investors may remember, the Bollinger Bands squeeze in January marked the end of a lengthy downtrend. After the FTX collapse, the BTC market was in a state of shock paralysis, which was ultimately resolved by Bollinger Bands squeeze, leading to a 42% price increase in 26 days. Related Reading: Perfect Storm: Why Bitcoin &#38; Crypto Are Poised For A Dramatic Recovery The Bollinger Bands&#8217; squeeze, combined with diminishing trading volumes, creates a scenario of mounting pressure in the Bitcoin market. As trading volume declines, the potential energy stored in this coiled spring intensifies. According to the analysts at CryptoCon, the bullish scenario is the one to be favored at the moment. &#8220;When Bitcoin volatility gets low in a bear market, it&#8217;s very bearish. When volatility gets low in a bull market, it&#8217;s insanely bullish,&#8221; the analysts say. As Bitcoin is unanimously seen to be at the start of a new bull market, a strong move to the upside could be in store. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T11:30:19.000Z",
    "title": "Millionaire Makers: Shiba Inu, Dogecoin, Tradecurve Look Undervalued, Is Now The Time To Buy?",
    "url": "https://www.crypto-news-flash.com/millionaire-makers-shiba-inu-dogecoin-tradecurve-look-undervalued-is-now-the-time-to-buy/?utm_source=rss&utm_medium=rss&utm_campaign=millionaire-makers-shiba-inu-dogecoin-tradecurve-look-undervalued-is-now-the-time-to-buy",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T140115.121.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T140115.121.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T140115.121-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Shiba Inu and Dogecoin are among the biggest millionaire makers in the crypto market. Both projects historically offered huge returns in a short period of time, making them global superstars. But do Shiba Inu and Dogecoin still have that potential in 2023?  As some experts believe they’re undervalued, both projects are predicted to see surges. [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-17T11:28:47.000Z",
    "title": "Altcoins You Should Be Looking at Now, Part 2",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/altcoins-you-should-be-looking-at-now-part-2/",
    "description": "<p>A lot has happened in the past couple of days, especially Ripple’s partial victory against the SEC. Nonetheless, your primary focus remains to craft the best strategy ahead of the bull market. While Bitcoin remains the obvious choice for many people, altcoins shouldn&#8217;t be overlooked. An ideal portfolio preparing for a bull run should include [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/altcoins-you-should-be-looking-at-now-part-2/\">Altcoins You Should Be Looking at Now, Part 2</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]