[
  {
    "source": "CryptoGlobe",
    "date": "2024-03-20T03:03:00.000Z",
    "title": "Whale Activity Leads to Massive Sell-off of Ethereum Layer-2 Token on Exchanges",
    "url": "https://www.cryptoglobe.com/latest/2024/03/whale-activity-leads-to-massive-sell-off-of-ethereum-layer-2-token-on-exchanges/",
    "description": "The price of Arbitrum (ARB), a leading layer-2 scaling solution for the Ethereum network, has experienced a decline following a significant token unlock event that saw large investors, colloquially known as whales, sell-off a significant amount on exchanges.  According to blockchain analysis service Lookonchain, Arbitrum whales deposited roughly $58 million worth of ARB tokens into […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-20T03:05:33.000Z",
    "title": "Bitcoin plummets below $63,000, wiping out $533 million in long contracts",
    "url": "https://www.cryptopolitan.com/bitcoin-plummets-below-63000-wiping/",
    "description": "Bitcoin, the flagship cryptocurrency, has experienced a significant downturn, plunging below the $63,000 mark, shedding more than 15% of its value since reaching an all-time high (ATH) of over $73,800. In the past 24 hours, Bitcoin&#8217;s price has dropped by over 7%, marking a stark reversal from its recent bullish momentum. The cryptocurrency&#8217;s latest drawdown [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-20T02:53:36.000Z",
    "title": "How Effective is AI-Powered Fraud Detection in Combatting Payment Fraud?",
    "url": "https://www.cryptopolitan.com/ai-powered-fraud-detection-payment-fraud/",
    "description": "In the ongoing battle against fraud in payment networks, the integration of data analytics and artificial intelligence (AI) has emerged as a pivotal strategy. Termed as &#8220;AI-Powered Fraud Detection,&#8221; this technological advancement has enabled payment providers to proactively tackle first-party fraud instances, where consumers dispute legitimate charges. Amidst this evolving landscape, major players like Mastercard [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-20T02:50:09.000Z",
    "title": "SEC delays decision on spot Ether ETFs amid growing pessimism",
    "url": "https://www.cryptopolitan.com/sec-delays-decision-on-spot-ether-etfs/",
    "description": "The United States Securities and Exchange Commission (SEC) recently postponed its decision on the proposed spot for Ether exchange-traded funds (ETFs) by Hashdex and ARK 21Shares. The decision, announced on Tuesday, March 19, comes shortly before the &#8220;third deadline&#8221; set by the agency for these applications. Both Ether ETF proposals are now slated for a [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-20T02:50:32.000Z",
    "title": "Bitcoin Price Turns Red Below $64K But Long-Term Uptrend Intact",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-turns-red-62k/",
    "description": "Bitcoin price extended its decline below the $65,000 support. BTC is now struggling to stay above the $62,000 support zone and might test $60,000. Bitcoin price is moving lower below the $64,000 support zone. The price is trading below $63,500 and the 100 hourly Simple moving average. There is a connecting bearish trend line forming with resistance at $63,300 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a decent upward move if it clears the $65,200 resistance zone in the near term. Bitcoin Price Grinds Lower Bitcoin price remained in a short-term bearish zone below the $66,500 zone. BTC traded below the $65,000 and $64,000 support levels to set a new weekly low. There was a push below the $62,500 support. A low was formed near $61,537 and the price is now consolidating losses. The price is now struggling below the 23.6% Fib retracement level of the recent decline from the $68,898 swing high to the $61,537 low. Bitcoin is now trading below $63,500 and the 100 hourly Simple moving average. Immediate resistance is near the $63,300 level. There is also a connecting bearish trend line forming with resistance at $63,300 on the hourly chart of the BTC/USD pair. Source: BTCUSD on TradingView.com The first major resistance could be $64,000. If there is a clear move above the $64,000 resistance zone, the price could even attempt a move toward the $65,200 resistance zone. It is close to the 50% Fib retracement level of the recent decline from the $68,898 swing high to the $61,537 low. Any more gains might send the price toward the $67,000 level. More Losses In BTC? If Bitcoin fails to rise above the $63,300 resistance zone, it could continue to move down. Immediate support on the downside is near the $62,000 level. The first major support is $61,500. The next support sits at $60,500. If there is a close below $60,500, the price could start a drop toward the $60,000 level. Any more losses might send the price toward the $58,800 support zone in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $61,500, followed by $60,000. Major Resistance Levels – $63,300, $64,000, and $65,200."
  }
]