[
  {
    "source": "CryptoSlate",
    "date": "2023-07-18T10:18:24.000Z",
    "title": "Challenger exchanges look to compete with Binance as OKX, Bitget claim market share",
    "url": "https://cryptoslate.com/challenger-exchanges-look-to-compete-with-binance-as-okx-bitget-claim-market-share/",
    "description": "<p>As reserves continue to decline across all major centralized exchanges (CEXs), Binance, the top exchange by trading volume, is beginning to lose market share to other competitors. Data provided by Glassnode shows the peak for CEX Bitcoin reserves was hit in 2020, reaching 3 million BTC. Since then, levels have fallen to just over 2 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/challenger-exchanges-look-to-compete-with-binance-as-okx-bitget-claim-market-share/\">Challenger exchanges look to compete with Binance as OKX, Bitget claim market share</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-18T10:32:14.000Z",
    "title": "Litecoin halving is fast approaching",
    "url": "https://cryptodaily.co.uk/2023/07/litecoin-halving-is-fast-approaching",
    "description": "<p>The crypto world eagerly awaits as Litecoin's third halving event approaches. Expected for August 2, 2023, this event will occur once the 2,520,000th block is mined.&nbsp;</p>\nWhat is the halving?\n<p>A &ldquo;halving&rdquo; in the crypto context refers to the moment when the reward miners receive for validating transactions on the blockchain is cut by half. This means that miners will earn half the number of new coins for each block they mine, which, in the past, has significantly impacted the cryptocurrency's value.</p>\n<p>The event has historically triggered significant movements in Litecoin's value, often preceding similar movements in Bitcoin. This has led some to speculate that Litecoin's performance could be a precursor to Bitcoin's future movements.</p>\nHalving expectations\n<p>Litecoin's halving occurs approximately every 840,000 blocks, which takes around four years. Since its inception in 2011, Litecoin has already experienced two halvings. During these events, the rewards given to miners are reduced, which has led to an increase in Litecoin's value.</p>\n<p>Historical data from previous halvings in various cryptocurrencies may serve as a basis for this expectation. However, sceptics argue that market participants are already aware of the halving event and have factored it into their price calculations and strategies. In this view, the halving&rsquo;s effects may have been &ldquo;priced in&rdquo; ahead of time, meaning that any potential price impact has already been reflected in the current market value.</p>\n<p>As we approach the third halving event, it&rsquo;s reasonable to expect increased market attention and potential price volatility. Holders and potential investors will be keeping a close eye on Litecoin as it approaches and then passes the halving.&nbsp;</p>\nWill the halving push Litecoin higher this time?\n<p>Many Litecoin holders will hope that this next halving will help to provide the spark that pulls LItecoin out of its current range bound price action. Right now, it appears that Litecoin has in fact managed to turn an incredibly important resistance at $91 into support. Sitting just above the 50 and 200 day moving averages should also provide a reliable cushion. A lift off for Litecoin from here could take it to the next strong resistance at $140.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T10:37:39.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T10:36:26.000Z",
    "title": "How Close is Cryptocurrency To Being an ‘Everyday’ Currency?",
    "url": "https://www.cryptopolitan.com/how-close-is-cryptocurrency-to-being-an-everyday-currency/",
    "description": "At its heart, cryptocurrency as an industry is the biggest experiment in money since the creation of the original standardized coins thousands of years ago. Since then, it hasn&#8217;t been a case of slowly changing one system into another, but rather&#160;it has been creating something that didn&#8217;t exist before whatsoever. As far back as historical ... <a title=\"How Close is Cryptocurrency To Being an &#8216;Everyday&#8217; Currency?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-close-is-cryptocurrency-to-being-an-everyday-currency/\" aria-label=\"More on How Close is Cryptocurrency To Being an &#8216;Everyday&#8217; Currency?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T10:33:36.000Z",
    "title": "How Stablecoins Make Money: Understanding the Mechanics",
    "url": "https://www.cryptopolitan.com/how-stablecoins-make-money-understanding-the-mechanics/",
    "description": "Stablecoins are a type of cryptocurrency that aims to maintain a stable value by pegging their price to a specific asset or currency. They have gained popularity in recent years due to their ability to reduce volatility and provide a more reliable store of value compared to other cryptocurrencies. However, many people wonder how stablecoins ... <a title=\"How Stablecoins Make Money: Understanding the Mechanics\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-stablecoins-make-money-understanding-the-mechanics/\" aria-label=\"More on How Stablecoins Make Money: Understanding the Mechanics\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T10:30:39.000Z",
    "title": "Thodex CEO arrested, sentenced to 7 months for failing to submit tax documents",
    "url": "https://www.cryptopolitan.com/thodex-ceo-sentenced-for-7-months/",
    "description": "Faruk Fatih Özer, the founder and former CEO of now-defunct crypto firm Thodex, has been sentenced to seven months and 15 days for not providing papers needed during the trial. Özer held his innocence throughout the trial by claiming he was not a corporate official at the time of the alleged conduct and a trustee ... <a title=\"Thodex CEO arrested, sentenced to 7 months for failing to submit tax documents\" class=\"read-more\" href=\"https://www.cryptopolitan.com/thodex-ceo-sentenced-for-7-months/\" aria-label=\"More on Thodex CEO arrested, sentenced to 7 months for failing to submit tax documents\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T10:30:20.000Z",
    "title": "HAQQ Becomes Istanbul Blockchain Week’s Title Sponsor Promoting Islamic Culture in Web3",
    "url": "https://www.cryptopolitan.com/haqq-becomes-istanbul-blockchain-weeks-title-sponsor-promoting-islamic-culture-in-web3/",
    "description": "Istanbul Blockchain Week gets a seal of approval from HAQQ (Islamic Coin), an ethics-first network committed to empowering individuals and fostering sustainable decentralized finance. As the title sponsor, HAQQ will bring to the forefront ESG-forward and Shariah-compliant advancements within Web3, celebrating a culture of inclusivity and social responsibility. Istanbul becomes the epicenter for the convergence ... <a title=\"HAQQ Becomes Istanbul Blockchain Week’s Title Sponsor Promoting Islamic Culture in Web3\" class=\"read-more\" href=\"https://www.cryptopolitan.com/haqq-becomes-istanbul-blockchain-weeks-title-sponsor-promoting-islamic-culture-in-web3/\" aria-label=\"More on HAQQ Becomes Istanbul Blockchain Week’s Title Sponsor Promoting Islamic Culture in Web3\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-18T10:37:06.000Z",
    "title": "This Under-The-Radar Coin Just Beat The Top 100 Cryptocurrencies With 120% Explosion – Details",
    "url": "https://www.newsbtc.com/all/cryptocurrencies-this-coin-soars-120/",
    "description": "Cryptocurrencies and the gaming industry have a new contender in Rollbit, and it has been making headlines over the past few days thanks to a slew of improvements to its blockchain technology. In a recent development, Rollbit disclosed its most current changes to the platform&#8217;s blockchain technology, propelling it to the forefront of the market. Notably, the company has started offering strong support for its own native cryptocurrency, Rollbit Coin (RLB), giving customers access to better ecosystem functionality and advantages. Related Reading: Elon Musk Fires Another Tweet – But Did It Lift Dogecoin Price? Based on crypto market tracker Coingecko figures, this lesser-known RLB coin has skyrocketed by more than 120% in the last seven days. At the time of writing, RLB was trading at $0.1224, up 24% over the previous 24 hours. Source: Coingecko RLB is a crucial part of the Rollbit lottery system, which decided to airdrop RLB tokens to their current Rollbit.com gaming and trading platform customers rather than holding an initial coin offering (ICO). RLB seven-day price action. Source: Coingecko Token owners can win a piece of the casino&#8217;s earnings by participating in the RLB lottery, which drives up demand for the token. People must stake their RLB tokens to participate in the lottery. Despite being a relatively new platform, Rollbit has quickly become one of the top competitors in crypto casinos. Rollbit has established itself as a dominant and significant power in the business, with an average monthly wagering volume above $1 billion. RLB has a market valuation of $357,728,046 with a 24-hour trading volume of $15,311,290. There are 3.3 billion coins in circulation. The highest transaction for RLB today was $0.1248. Its current price is over 14% less than its previous peak. As of today, cryptocurrencies have a market cap of $1.16 trillion. Chart: TradingView.com The Unstoppable Growth Of Cryptocurrencies And Bitcoin Casinos One of the newest trends in the cryptocurrencies and gaming sector, crypto casinos, could change the face of the industry as we know it. Some of the biggest Bitcoin casinos on the market now have thousands of active players worldwide, thanks to their numerous advantages over conventional casinos, including quicker payments, better security, and greater transparency. According to Casinos Blockchain, the global crypto casino market will be worth nearly $280 billion this year, with a $250 million gambling market. Over the years, cryptocurrency has accounted for 4% of all gambling, which is quickly rising. Related Reading: Shiba Inu Encounters Familiar Resistance, Prompting Concerns About Bull Run By the end of 2030, Straits Research projects that the global industry for online cryptocurrency gambling will be worth $153 billion, expanding at a CAGR of about 12%. Meanwhile, based on Captain Altcoin&#8217;s research, Rollbit (RLB) earns an astounding annualized revenue of $498,582,700 by collecting almost $1.36 million daily. This revenue exceeds that of Ethereum, a cryptocurrency with 2,000 times the value of Rollbit. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from BitcoinChaser"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-18T10:22:38.000Z",
    "title": "Dogecoin Pumps Hard After Elon Musk Launches Counterattack in DOGE Lawsuit",
    "url": "https://www.crypto-news-flash.com/dogecoin-pumps-hard-after-elon-musk-launches-counterattack-in-doge-lawsuit/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-pumps-hard-after-elon-musk-launches-counterattack-in-doge-lawsuit",
    "description": "<img width=\"1000\" height=\"664\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Elon Musk and Tesla have taken action by filing a motion for Rule 11 sanctions against Evan Spencer. Yesterday, the value of Dogecoin (DOGE) underwent a sudden and significant increase, surging by 3 percent within a span of a few minutes. Elon Musk and Tesla Inc. have launched a counterattack against the attorney representing the [...]"
  }
]