[
  {
    "source": "Decrypt",
    "date": "2024-01-30T02:37:59.000Z",
    "title": "A Neuralink Chip Has Been Implanted In a Human for the First Time",
    "url": "https://decrypt.co/214696/neuralink-human-test-subject-elon-musk-brain-computer-interface",
    "description": "Elon Musk said the patient is recovering well, and that initial results are \"promising.\""
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-30T02:34:37.000Z",
    "title": "SUI hits new all-time high, TVL surges 98% in one month",
    "url": "https://cryptobriefing.com/sui-hits-new-all-time-high-tvl-surges-98/?utm_source=feed&utm_medium=rss",
    "description": "SUI's token price soared to a new high of $1.58 while TVL on SUI tops $411, surpassing Coinbase's Base and Cardano."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-30T02:30:09.000Z",
    "title": "NEAR Protocol’s Expansion: Q4 2023 Shows 1,250% Rise In Daily Active Addresses",
    "url": "https://www.newsbtc.com/analysis/near/near-protocols-expansion-q4-2023-shows-1250-rise-in-daily-active-addresses/",
    "description": "NEAR Protocol, the Blockchain Operating System (BOS), experienced significant growth in key metrics during the fourth quarter (Q4) of 2023. The protocol&#8217;s native token, NEAR, recorded a remarkable 16% year-to-date growth and witnessed a surge in adoption.  Circulating Market Cap Soars 245% According to a Messari report, the entire crypto market cap increased in Q4 2023, largely driven by the anticipation surrounding the introduction of spot Bitcoin exchange-traded funds (ETFs).  NEAR actively participated in the overall market rally and achieved additional gains due to its heightened network activity and significant announcements. As a result, NEAR&#8217;s circulating market cap for the end of 2023 reached $3.7 billion, marking a 245% increase quarter-on-quarter (QoQ) and a 246% increase year-on-year (YoY).  Furthermore, NEAR&#8217;s fully diluted market cap reached $4.3 billion. The protocol&#8217;s market cap ranking also soared, climbing 10 places to reach approximately 30th by the end of 2023. Related Reading: Selling Pressure Subsides As Grayscale Sends 8.6K Bitcoin To Coinbase, Falling Below Average In Q4 2023, NEAR&#8217;s revenue grew substantially, primarily generated from network transaction fees, reaching $750,000. The increase in revenue was attributed to the heightened activity generated by projects such as KAIKAINOW and NEAR Inscriptions.  During the Inscriptions craze, revenue surged due to a transaction spike, driving up transaction fees. Notably, NEAR employs a fee-burning mechanism, where 70% of all fees are burned, while the remaining 30% is directed to the contract from which the transaction originated. NEAR User Base Skyrockets Another key metric demonstrating the protocol&#8217;s growth in Q4 2023 is that NEAR experienced significant growth in its user base.  Average daily active addresses increased by 1,250% YoY, reaching 870,000 in Q4 2023. In addition, the number of daily new addresses grew by a remarkable 550% YoY to 170,000 in Q4 2023.  According to Messari, this expansion comes after the successful launch and adoption of projects such as KAIKAINOW and contributions from the Sweat Economy, Aurora, and Playember, which further supported this positive trend. NEAR&#8217;s daily active addresses were notably higher than those of other leading blockchain networks. For example, Optimism averaged 72,000 daily active addresses, Arbitrum 150,000, Polygon PoS 375,000, and Aptos 60,000 in Q4 2023. NEAR Inscriptions significantly drove network activity, reaching a yearly high of 14 million transactions in December. Despite this substantial increase, transaction fees remained stable, staying below $0.01 for the quarter.  Top 25 Blockchain By TVL In Q4 2023 NEAR&#8217;s Total Value Locked (TVL) reached $128 million by the end of Q4 2023, marking a remarkable 147% increase from the previous quarter. Among blockchains, NEAR positioned itself at approximately 25th place regarding TVL.  Within the NEAR Network&#8217;s TVL, NEAR contributed $59 million, accounting for nearly 46% of the total TVL on the network. The remaining TVL was distributed across various decentralized finance (DeFi) applications, including Aurora, Ref, Berry Club, and Flux. Additionally, NEAR announced partnerships with projects such as Chainlink and decentralized exchange (DEX) SushiSwap.  According to Messari, the integration with Chainlink&#8217;s decentralized oracle network provided NEAR developers with access to real-world data and external Application Programming Interfaces (APIs), enhancing the functionality and usability of NEAR-based applications.  On the other hand, the collaboration with SushiSwap allowed NEAR users to access a wide range of token swaps, liquidity pools, and yield farming opportunities, enabling developer adoption and increased usage within the ecosystem.  Related Reading: Crypto Exchange Predicts 1000x Returns On XRP Price With Ambitious Rise To $594 Ultimately, looking ahead to 2024, Messari said the protocol’s vision is to iterate the technology roadmap, attract more developers, and attract more leading protocols.  Featured image from Shutterstock, chart from TradingView.com"
  }
]