[
  {
    "source": "Cointelegraph",
    "date": "2024-03-25T09:15:55.000Z",
    "title": " Binance follows Circle and drops USDC support on Tron ",
    "url": "https://cointelegraph.com/news/binance-drops-usdc-tron-coinbase",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNDA4MDU5MTQtZjg1Yy00MDY4LTliODktZmNkNThhMTAzY2Y0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Crypto investors using Binance have been given 12 days to either convert, transfer or cash out their TRC-20 USDC tokens away from Binance. </p>\n                    <p><p data-ct-non-breakable=\"true\">Crypto exchange Binance will cease deposit and withdrawal support for the TRC-20-based USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) tokens in under two weeks.</p><p>On Feb. 20, USDC issuer Circle announced plans to discontinue <a href=\"https://cointelegraph.com/news/circle-cease-minting-usdc-tron-network-effective-immediately\">support for the stablecoin over the Tron blockchain</a>, stating that the decision aligns with “efforts to ensure that USDC remains trusted, transparent and safe.” </p><p>Circle also stopped minting USDC on Justin Sun’s Tron blockchain on the same day and said it would gradually phase out support for the blockchain network entirely.</p><p><a href=\"https://cointelegraph.com/news/binance-drops-usdc-tron-coinbase\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-25T09:31:15.000Z",
    "title": "Why anonymous crypto wallets are NOT being banned in the EU",
    "url": "https://cryptoslate.com/anonymous-crypto-wallets-are-not-being-banned-in-the-eu/",
    "description": "<p>Recent EU anti-money laundering regulations (AMLR) have sparked a heated debate about balancing combating financial crime and preserving citizens&#8217; rights to privacy and economic freedom. The new laws, approved by most of the EU Parliament&#8217;s lead committees, have drawn criticism and support from various stakeholders. Following an article from Finbold on March 22, originally titled [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/anonymous-crypto-wallets-are-not-being-banned-in-the-eu/\">Why anonymous crypto wallets are NOT being banned in the EU</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-25T09:36:08.000Z",
    "title": "Dogecoin (DOGE) & Shiba Inu (SHIB) Holders Discover Excitement in Raffle Coin (RAFF)’s Innovative Raffle Presale As 100X Predicted",
    "url": "https://cryptodaily.co.uk/2024/03/dogecoin-doge-shiba-inu-shib-holders-discover-excitement-in-raffle-coin-raffs-innovative-raffle-presale-as-100x-predicted",
    "description": "The upcoming crypto project, Raffle Coin (RAFF) is a source of excitement for Dogecoin (DOGE) investors and Shiba Inu (SHIB) backers. After suffering from losses in recent days, these meme coin holders are finally ready to move on and invest in new markets."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-25T09:28:33.000Z",
    "title": "The Next Chapter in Crypto Wealth: How Whales Are Using Their Bull Run Profits to Secure a Stake in This Emerging Coin",
    "url": "https://cryptodaily.co.uk/2024/03/the-next-chapter-in-crypto-wealth-how-whales-are-using-their-bull-run-profits-to-secure-a-stake-in-this-emerging-coin",
    "description": "Crypto’s wealth generation power is unbeatable. Top assets like BTC and ETH have made early investors richer than one can imagine and continue multiplying the value of those who are getting in even today. While these assets continue generating ample wealth for investors, a new token is emerging to take crypto return generation to a new level."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-25T09:24:08.000Z",
    "title": "Analysts Bullish on Retik Finance (RETIK) to Recreate Shiba Inu’s (SHIB) 2021 Surge Following DeFi Debit Cards Launch",
    "url": "https://cryptodaily.co.uk/2024/03/analysts-bullish-on-retik-finance-retik-to-recreate-shiba-inus-shib-2021-surge-following-defi-debit-cards-launch",
    "description": "A new cryptocurrency has emerged, capturing investors' attention with its game-changing potential"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-25T09:19:03.000Z",
    "title": "As the Market Retracts, Uniswap (UNI) and Litecoin (LTC) Communities Find Confidence in Kelexo (KLXO), Inspired by 20X Growth Prospects",
    "url": "https://cryptodaily.co.uk/2024/03/as-the-market-retracts-uniswap-uni-and-litecoin-ltc-communities-find-confidence-in-kelexo-klxo-inspired-by-20x-growth-prospects",
    "description": "Investors want to diversify their portfolio risks in light of the current market reaction to price stabilization. Presale tokens are the best bet for top token holders to increase revenue and holdings. This is why presales have become a good way to achieve token success in the market."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-25T09:30:31.000Z",
    "title": "Layer 1 Blockchain Mantra Secures $11 Million from Latest Investment Funding Round",
    "url": "https://news.bitcoin.com/layer-1-blockchain-mantra-secures-11-million-from-latest-investment-funding-round/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_2419479673-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_2419479673-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_2419479673-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_2419479673-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_2419479673-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_2419479673-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_2419479673-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_2419479673-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Mantra, the Layer 1 blockchain for real-world assets (RWA), recently raised $11 million in an investment round that was led by Shorooq Partners. Mantra said the raised funds will also be used to provide developers with the tools they need to create RWA protocols and to expand the tokenization of these assets. Scaling Real-World Asset [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-25T09:29:21.000Z",
    "title": "IDEX surges 33%, investors interest skyrockets",
    "url": "https://crypto.news/idex-surges-33-investors-interest-skyrockets/",
    "description": "IDEX, the native token of the hybrid decentralized exchange (DEX) and market-making protocol of the same name, has increased 33% over the past 24 hours as it records a surge in investor interest. The crypto asset, often leveraged for gas&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-25T09:13:10.000Z",
    "title": "NFT Price Floor co-founder predicts quality NFTs comeback despite market retreat",
    "url": "https://crypto.news/nft-price-floor-co-founder-predicts-quality-nfts-comeback-despite-market-retreat/",
    "description": "NFT Price Floor co-founder Nicolás Lallement anticipates a quality NFT comeback thanks to the bullish sentiment and cheap layer-2 solutions. As the craze around meme coins keeps unfolding, the spotlight now shifts to non-fungible tokens (NFTs), a sector experiencing renewed&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-25T09:15:13.000Z",
    "title": "What is Macro/Crypto Summer? Don’t Miss Out, Says Expert",
    "url": "https://www.newsbtc.com/news/what-is-macro-crypto-summer-dont-miss-out-says-expert/",
    "description": "In a thread on X (formerly Twitter), Raoul Pal, a renowned trading guru and the founder/CEO of Global Macro Investor and Real Vision, has illuminated the crypto community about the advent of what he terms as the &#8220;Macro/Crypto Summer.&#8221; This period, according to Pal, is not just a fleeting season but a significant phase in the financial and cryptocurrency markets, deeply rooted in the cyclical nature of the global economy. Why The Macro/Crypto Summer Matters Pal elaborates on the concept of the &#8220;Macro Summer,&#8221; explaining it as a pivotal phase in &#8220;The Everything Code&#8221; cycle, closely following the Financial Conditions Index, which historically precedes the cycle by approximately ten months. The ISM (Institute for Supply Management) index, a key indicator of economic health, often bottoms out during this period, marking the start of GDP growth. Related Reading: Buy High, Sell Low: FOMO Made This Crypto Trader Lose 6,039 SOL Pal&#8217;s thesis draws attention to the &#8220;near-perfect 3 1/2 year cyclicality&#8221; in the ISM business cycle, propelled by liquidity dynamics and the debt refinancing cycle at its core. He underscores the significance of liquidity: &#8220;And that is driven by liquidity, which bottomed at the end of 2022&#8230; macro summer and fall are all about liquidity rising and is a core part of The Everything Code thesis.&#8221; This influx of liquidity is crucial for tech stocks, which historically thrive during these phases. Yet, it&#8217;s Bitcoin and, more broadly, the cryptocurrency market that exhibit the most dramatic responses. Pal presents staggering growth figures from past Macro Summer and Fall seasons to underscore his point: Bitcoin: Saw increases of &#8220;2012/2013: +146x, 2016/2017: +30x, 2020/2021: +8x&#8230;&#8221; Ethereum: As an altcoin during the 2016/2017 and 2020/2021 cycles, it achieved &#8220;2016/2017: +1,770x, 2020/2021: +41x.&#8221; Altcoins (excluding ETH): Witnessed an aggregate market cap rise of &#8220;+24x&#8221; in the last cycle. “Wild! When we just look at Altcoins ex-ETH (we only have shorter data for the last cycle), the entire market cap rose +24x! And that includes thousands of worthless tokens that didn’t rise, so I’m not just cherry-picking winners here,” Pal remarked. DOGE, a popular meme coin, is mentioned by the expert as another prime example of the &#8220;power of Crypto Summer and Fall,&#8221; with its value experiencing significant multipliers &#8211; &#8220;2016/2017: +136x, 2020/2021: +370x” &#8211; in the aforementioned cycles. These figures underline the significant influence of macroeconomic cycles on crypto valuations, with Pal pointing out the alignment of these cycles with Bitcoin&#8217;s halving events. &#8220;Crypto summer has started and fully develops post-halving,&#8221; he states, highlighting the interconnectedness of these cycles with the broader financial landscape. Related Reading: Crypto Expert Reveals The Possibility Of Bitcoin Reaching $500,000 Notably, Pal&#8217;s analysis doesn&#8217;t stop at the past; it looks forward, suggesting that liquidity is expected to rise all the way into the end of 2025. This anticipation is rooted in a complex interplay of global financial mechanisms, including the potential for increased US money printing in response to a massive ramp-up in interest payments and changes in Fed Net Liquidity and the Treasury General Account (TGA). “Will the US join the summer party? [&#8230;] I know it seems impossible now, but the US is on the verge of a massive ramp-up in interest payments. [&#8230;] at some point – the balance sheet will stop shrinking, which is enough to unleash liquidity into the system. [&#8230;] I cannot see how they don’t massively expand liquidity, one way or another. Meanwhile, Pal predicts that it won’t be just the US injecting liquidity into the financial systems in the coming months. “I&#8217;ve no idea whether it&#8217;s China, the EU, Japan or the US that drives this or maybe a bit of all. Time will tell,” he remarked. Pal attributes his investment strategies, especially in tech and crypto, to the insights gained from The Everything Code. This approach has prepared him for the unfolding Macro Summer, with a keen eye on the altcoin market and the so-called &#8220;Banana Zone.&#8221; He concludes: But the bigger game is yet to be played out as Alt season arrives and we fully enter the Banana Zone. The Banana Zone cometh, and it is a huge wealth-generating machine. Patience will be rewarded. In the meantime, don&#8217;t fuck this up. #DFTU At press time, BTC traded at $67,003. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-25T09:27:24.000Z",
    "title": "Google Adds ENS Data to Search Results",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/google-adds-ens-data-to-search-results/",
    "description": "<p>This integration lets users see ENS details like Ether balances and last transaction times, all compiled by Etherscan. This feature significantly eases public access to blockchain data, streamlining Ethereum wallet tracking. Easing Access to Blockchain Data Former ENS team member Brantly Millegan first noted and shared the update on X, igniting discussions in crypto circles. [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/google-adds-ens-data-to-search-results/\">Google Adds ENS Data to Search Results</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-25T09:15:15.000Z",
    "title": "Economist Alex Krüger Bullish on One Under-the-Radar Layer-One Altcoin, Says Crypto ‘Can Get Crazier’",
    "url": "https://dailyhodl.com/2024/03/25/economist-alex-kruger-bullish-on-one-under-the-radar-layer-one-altcoin-says-crypto-can-get-crazier/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Says-This-AI-Altcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Says-This-AI-Altcoin.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Says-This-AI-Altcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Says-This-AI-Altcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Says-This-AI-Altcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Says-This-AI-Altcoin.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Says-This-AI-Altcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Widely followed economist Alex Krüger is bullish on one overlooked layer-one crypto project amid what he believes is the earlier stages of a digital assets bull run. Krüger tells his 168,000 followers on the social media platform X that many more people are about to hear about Core (CORE), a blockchain that aims to leverage [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/25/economist-alex-kruger-bullish-on-one-under-the-radar-layer-one-altcoin-says-crypto-can-get-crazier/\">Economist Alex Krüger Bullish on One Under-the-Radar Layer-One Altcoin, Says Crypto ‘Can Get Crazier’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]