[
  {
    "source": "Decrypt",
    "date": "2024-01-18T18:02:28.000Z",
    "title": "Tether Snaps Up More Bitcoin, Brings Holdings to $2.8 Billion",
    "url": "https://decrypt.co/213393/tether-buys-more-bitcoin",
    "description": "The stablecoin issuer continues to load up on Bitcoin."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-18T18:00:16.000Z",
    "title": "DeFi Exchange dYdX Dethrones Ethereum's Uniswap as Token Outpaces the Market",
    "url": "https://decrypt.co/213380/defi-exchange-dydx-dethrones-ethereums-uniswap-as-token-outpaces-the-market",
    "description": "Decentralized cryptocurrency exchange dYdX is hotter than ever, beating Uniswap v3 Ethereum in volume—and the charts back the hype."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-18T17:54:21.000Z",
    "title": " Robinhood settles ‘gamification’ case with Massachusetts regulator for $7.5M: Report ",
    "url": "https://cointelegraph.com/news/robinhood-settles-massachusetts-regulator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNjk2OTQ3NTEtZTBiMS00ODI1LWI5MTgtMTk2YTYzNzgzMmE0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Massachusetts Secretary William Galvin brought the enforcement action in December 2020, claiming that Robinhood marketed itself as “some sort of game that you might be able to win.”</p>\n                    <p><p>Cryptocurrency and stock trading app Robinhood has reportedly resolved an enforcement action first brought by Massachusetts’ securities regulator in December 2020.</p><p>According to a Jan. 18 Reuters report, Robinhood <a href=\"https://www.reuters.com/legal/robinhood-settles-massachusetts-gamification-case-75-million-2024-01-18/\" target=\"_blank\" rel=\"noopener nofollow\">agreed</a> to pay a $7.5 million penalty for its practices of targeting inexperienced investors, in what many described as the “gamification” of trading crypto and stocks. Secretary of the Commonwealth of Massachusetts William Galvin <a href=\"https://cointelegraph.com/news/crypto-friendly-trading-app-robinhood-faces-lawsuit-from-securities-regulators\">claimed that Robinhood</a> had marketed itself as “some sort of game that you might be able to win,” proposing revoking the firms’ broker-dealer license in the state.</p><p>“This settlement resolves historical matters dating back to 2021 that do not reflect Robinhood today,” Lucas Moskowitz, Robinhood’s deputy general counsel and head of government affairs, told Cointelegraph. “We are pleased to put this matter behind us and move forward steadfast in our commitment to providing access to the markets for our Massachusetts customers.” </p><p><a href=\"https://cointelegraph.com/news/robinhood-settles-massachusetts-regulator\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-18T17:53:55.000Z",
    "title": "BlackRock now holds over $1 billion Bitcoin in its spot ETF",
    "url": "https://cryptobriefing.com/blackrock-holds-1-billion-bitcoin-spot-etf/?utm_source=feed&utm_medium=rss",
    "description": "BlackRock makes headlines with its spot Bitcoin ETF exceeding $1 billion AUM in the first week of trading."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-18T18:00:14.000Z",
    "title": "A Comprehensive Guide to EchoLink: LBank’s Latest Launchpad Project",
    "url": "https://news.bitcoin.com/a-comprehensive-guide-to-echolink-lbanks-latest-launchpad-project/",
    "description": "<img width=\"768\" height=\"426\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/screenshot_20240118_130010_docs-768x426.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/screenshot_20240118_130010_docs-300x166.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/screenshot_20240118_130010_docs-768x426.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/screenshot_20240118_130010_docs.jpg 938w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. LBank, a prominent global cryptocurrency trading platform, is thrilled to introduce EchoLink, its newest Launchpad initiative. Following the success of three previous Launchpad projects featuring $PINs, $UMM, and $AIMEME, EchoLink is poised to revolutionize the landscape of blockchain technology in IoT integration. Introduction of EchoLink EchoLink, an IoT oracle deployed on the Solana [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T17:47:22.000Z",
    "title": "Cosmos Price Prediction 2024-2033: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2024-2033 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? That&#8217;s the essential question, for now: how will this affect our Cosmos Price Prediction? How much is Cosmos worth? Today&#8217;s Cosmos price is $9.78, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T17:47:14.000Z",
    "title": "Google CEO warns staff about more layoffs at the firm",
    "url": "https://www.cryptopolitan.com/google-ceo-staff-more-layoffs-at-the-firm/",
    "description": "Google CEO Sundar Pichai recently addressed the company’s staff through a memo, cautioning about impending layoffs in the coming year. This follows a substantial reduction in the workforce last week, where over 1,000 employees were laid off across various divisions, and an additional 100 job cuts occurred within YouTube. Google CEO emphasizes the need for [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-18T17:56:46.000Z",
    "title": "Manta Network hit with now resolved DDoS attack",
    "url": "https://crypto.news/manta-network-hit-with-now-resolved-ddos-attack/",
    "description": "Manta Network, a  layer-2 blockchain developed by P0xeidon Labs, has successfully mitigated a large-scale distributed denial-of-service attack."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-18T17:47:04.000Z",
    "title": "Bitcoin mining reaches new all-time high of 54% renewable use",
    "url": "https://crypto.news/bitcoin-mining-reaches-new-all-time-high-of-54-renewable-use/",
    "description": "A recent report indicates a significant surge in the use of sustainable energy for Bitcoin mining."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-18T18:00:53.000Z",
    "title": "Economist Foresees $115,000 Bitcoin Peak, Followed By Largest Crash Since 1929",
    "url": "https://www.newsbtc.com/news/bitcoin/economist-115000-bitcoin-peak-historic-crash/",
    "description": "Renowned macroeconomist Henrik Zeberg has set the financial world abuzz with a stark prognosis on X (formerly Twitter), forecasting a dramatic surge in the Bitcoin price to a peak of $115,000 to $150,000. However, this meteoric rise is predicted to find an abrupt end, caused by a devastating macroeconomic downturn, one that Zeberg anticipates will be the most severe since the 1929 crash. Why A Recession Will Hit The US In 2024/2025 At the core of Zeberg&#8217;s argument are seven reasons. Zeberg asserts, &#8220;Our Business Cycle has flashed a recession signal in 2023. Leading Indicators have crashed under our Equilibrium Line. In 80 years of data, the recession Signal from our Model has NEVER been wrong. No false signals &#8211; ever!&#8221; This model, with its unwavering accuracy over eight decades, forms the bedrock of his grim forecast. Zeberg also delves into the significance of yield inversion, a well-documented precursor to economic downturns. Despite the signal&#8217;s dismissal by analysts in 2023 due to impatience, Zeberg emphasizes its historical reliability, noting, &#8220;From the bottom of the Yield Inversion, we normally see 12-15 months before a recession sets in. This signal is very much alive!&#8221; His remarks underscore a widespread underestimation of this critical indicator. The economist further examines the trajectory of US industrial production, drawing alarming parallels to the period just before the 2007-08 financial crisis. He observes a similar pattern of divergence and warns of a strong impending drop in industrial production, signaling the onset of a recession. Related Reading: Why Is Bitcoin Price Trading Sideways? 3 Key Factors Zeberg&#8217;s analysis extends to the housing market, where he highlights the plummeting NAHB index as a significant warning sign. &#8220;The bigger the decline in NAHB &#8211; the larger the rise in Unemployment,&#8221; he states, pointing to the direct relationship between housing market distress and the broader economy. This situation is exacerbated by rising interest rates, which lead to reduced consumer spending and, consequently, an economic downturn. Moreover, personal interest payments are another cornerstone of Zeberg&#8217;s argument. He notes the historical pattern where increases in market rates burden consumers with higher mortgage and debt payments, ultimately leading to recessions. &#8220;Every rise in rates over the years has caused a recession, as consumers need to pull back on their Consumption,&#8221; Zeberg cautions, highlighting the lag inherent in the economic business cycle. Housing affordability, or the lack thereof, is also a critical component of his analysis. With affordability plummeting below levels seen before the financial crisis, Zeberg paints a grim picture of the near future, where a deteriorating unemployment situation could lead to widespread defaults and a housing market collapse. Lastly, Zeberg points to the bloated inventory levels of retailers and companies worldwide. He describes this as a hangover from the demand hype of 2021-22, driven by stimulus funds that have since dried up. This mismatch between supply and anticipated demand, he suggests, is a ticking time bomb for the economy. Bitcoin: A Mirage Before The Storm In the midst of this dire economic forecast, Zeberg casts a unique spotlight on Bitcoin. He predicts a fleeting period of euphoria for the cryptocurrency, with its value skyrocketing to an all-time high, potentially reaching between $115,000 and $150,000. He also provocatively states, &#8220;@Peter Schiff: See you at BTC = 100X 1 ounce of Gold.&#8221; @PeterSchiff See you at BTC = 100X 1 ounce of Gold 😉 pic.twitter.com/rRf4MM9qYd &#8212; Henrik Zeberg (@HenrikZeberg) January 17, 2024 However, Zeberg cautions that this surge is part of a broader misleading narrative. &#8220;The Soft Landing Narrative is what will dominate into the top in #Equities #Crypto #BTC,&#8221; he elaborates. This narrative, according to him, is a mirage that will mislead economists and analysts as they try to rationalize the &#8216;blow off top,&#8217; a phenomenon they failed to forecast. Related Reading: Bitcoin Sees Massive Sell-Off From Miners, As Price Holds Steady The reality, as Zeberg sees it, is starkly different: &#8220;Stock Market and Crypto will SOAR into early 2024. Euphoria will develop. Everybody will get onto the wrong side of the boat &#8211; just as Equity and Crypto Markets put in a major top. Recession sets in a few months later in 2024.&#8221; In conclusion, Zeberg&#8217;s analysis foresees a major recession, one that he believes is inevitable and imminent. &#8220;The Titanic has already hit the Iceberg &#8211; and it will sink,&#8221; he starkly notes, dismissing any interventions from the Fed or any administration as futile. The question is how Bitcoin might behave in a recession, something the cryptocurrency has not experienced since its inception in 2009. Will BTC become a safe haven, or will it follow the fate of equities, as Zeberg predicts? At press time, the Bitcoin price continued its sideways trend, trading at $42,392. Featured image from DALL·E , chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-18T17:51:50.000Z",
    "title": "Cosmos (ATOM) Altcoins to Watch: Cronos (CRO), THORChain (RUNE), and dYdX (DYDX)",
    "url": "https://www.crypto-news-flash.com/cosmos-atom-altcoins-to-watch-cronos-cro-thorchain-rune-and-dydx-dydx/?utm_source=rss&utm_medium=rss&utm_campaign=cosmos-atom-altcoins-to-watch-cronos-cro-thorchain-rune-and-dydx-dydx",
    "description": "<img width=\"1200\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/32137.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/32137.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/32137-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/32137-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/32137-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/32137-450x253.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />The Cosmos ecosystem is thriving and top analyst Rekt Fencer has picked prospective tokens to lead the charge. Tokens chosen include ATOM, CRO, RUNE, and DYDX. Recently, a renowned crypto trader known as Rekt Fencer shed light on numerous altcoins in the Cosmos (ATOM) ecosystem, indicating that Cronos (CRO), THORChain (RUNE), and dYdX (DYDX) are [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-18T17:55:09.000Z",
    "title": "Solana Labs Kicks Off Pre-Orders for New Smartphone Weeks After First Edition of the web3 Device Sold Out",
    "url": "https://dailyhodl.com/2024/01/18/solana-labs-kicks-off-pre-orders-for-new-smartphone-weeks-after-first-edition-of-the-web3-device-sold-out/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/labs-kicks-off-sold.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/labs-kicks-off-sold.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/labs-kicks-off-sold.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/labs-kicks-off-sold.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/labs-kicks-off-sold.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/labs-kicks-off-sold.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/labs-kicks-off-sold.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Solana (SOL) Labs is kicking off pre-orders for the new version of its crypto-focused smartphone weeks after the first edition sold out in a frenzy. Solana Mobile is offering customers a &#8220;Founder Window&#8221; to deposit $450 for the upcoming &#8220;Chapter 2&#8221; phone, which the project says is expected to ship in the first half of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/18/solana-labs-kicks-off-pre-orders-for-new-smartphone-weeks-after-first-edition-of-the-web3-device-sold-out/\">Solana Labs Kicks Off Pre-Orders for New Smartphone Weeks After First Edition of the web3 Device Sold Out</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]