[
  {
    "source": "Cointelegraph",
    "date": "2024-01-05T04:02:30.000Z",
    "title": " Crypto lender Celsius to unstake $470M in Ethereum ahead of repayments ",
    "url": "https://cointelegraph.com/news/crypto-lender-celsius-unstakes-470m-ethereum-bankruptcy-distrubution-creditors",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNWE0NjA3MDktZTdiZS00NGIwLTk4YjItNmNkODY5ZmI2OWU3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The crypto lender has 206,300 Ether (ETH) currently in the staking withdrawal queue, according to Nansen.</p>\n                    <p><p>Embattled crypto lending platform Celsius has confirmed it has started recalling and rebalancing its crypto assets, including Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), as it prepares for “timely distributions to creditors.”</p><p>On Jan. 5, the lending firm, which has been in bankruptcy court since its Chapter 11 filing in July 2022, stated that it has begun shifting assets to “ensure ample liquidity” in preparation for any asset distributions.</p><p>Celsius added that it will unstake its existing Ether holdings, “which have provided valuable staking rewards income to the estate.” </p><p><a href=\"https://cointelegraph.com/news/crypto-lender-celsius-unstakes-470m-ethereum-bankruptcy-distrubution-creditors\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-05T04:06:25.000Z",
    "title": "Bitcoin ETF vs. Trust: Which suits traditional investors more?",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-vs-trust-which-is-better/",
    "description": "The cryptocurrency world has been abuzz with the potential approval of a Bitcoin spot exchange-traded fund (ETF) in the United States, a development eagerly anticipated by both crypto enthusiasts and traditional investors. With a long list of prominent applicants like BlackRock, Fidelity, and VanEck waiting in the wings, the financial community is poised on the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-05T04:00:36.000Z",
    "title": "A close look at the crypto explosion of 2023",
    "url": "https://www.cryptopolitan.com/a-close-look-at-the-crypto-explosion-of-2023/",
    "description": "The year 2023 witnessed a remarkable surge in the cryptocurrency domain, marking a significant era in the digital finance world. This period was characterized by substantial advancements, widespread adoption, and a plethora of intriguing developments that captivated both seasoned investors and newcomers alike. The landscape of crypto evolved at an unprecedented pace, reshaping the financial [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-05T03:57:02.000Z",
    "title": "Taiwan crypto exchange ACE faces criminal probe over shitcoins",
    "url": "https://www.cryptopolitan.com/ace-faces-criminal-probe-over-shitcoins/",
    "description": "In a striking turn of events, ACE, Taiwan&#8217;s largest cryptocurrency exchange, has found itself in the throes of a criminal investigation. This probe, led by Taiwan&#8217;s criminal police, centers around allegations of fraud exceeding NT$1 billion. The spotlight of this investigation falls on the promotion and sale of so-called &#8216;shitcoins&#8217;, a term colloquially used to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-05T03:48:18.000Z",
    "title": "Crypto’s reality check: The failed forecasts of 2023",
    "url": "https://www.cryptopolitan.com/cryptos-failed-forecasts-of-2023/",
    "description": "The year 2023 was a rollercoaster for the global economy, especially for the crypto market, which was a hotbed of misplaced predictions and missed forecasts. From wildly optimistic valuations that never saw the light of day to doomsday recession forecasts that fizzled out, it&#8217;s clear that predicting the financial future is more art than science. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-05T03:43:33.000Z",
    "title": "Why is the Fed being so mysterious about rate cuts?",
    "url": "https://www.cryptopolitan.com/the-fed-being-so-mysterious-about-rate-cuts/",
    "description": "The Federal Reserve&#8217;s recent stance on interest rate adjustments has left market analysts and investors scratching their heads. Despite indications that rate hikes might be pausing, the Fed&#8217;s discussions have shrouded the possibility of rate cuts in mystery. At their December 12-13 meeting, Federal Reserve officials signaled a potential halt in rate hikes, yet the [&#8230;]"
  }
]