[
  {
    "source": "CoinDesk",
    "date": "2023-09-08T20:46:45.000Z",
    "title": "NFT Video Startup Glass Falls to Crypto Bear Market",
    "url": "https://www.coindesk.com/business/2023/09/08/nft-video-startup-glass-falls-to-crypto-bear-market/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The startup’s founders say they’re ending active development after two years."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-08T20:59:59.000Z",
    "title": "Bitcoin Donation Company Says Gifted Crypto Should Require Less Paperwork",
    "url": "https://decrypt.co/155601/bitcoin-donation-company-says-gifted-crypto-should-require-less-paperwork",
    "description": "It's ridiculous to require an appraisal of donations made in dollar-pegged stablecoins, like USDC or USDT, the company argues."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-08T19:18:04.000Z",
    "title": "LBRY Will Appeal 'Unjust and Incorrect' SEC Lawsuit Ruling, Says CEO",
    "url": "https://decrypt.co/155569/lbry-will-appeal-unjust-and-incorrect-sec-lawsuit-ruling-says-ceo",
    "description": "The company had previously said it plans to wind down operations and the SEC dropped its financial penalty from $44 million to around $111,000."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-08T19:00:33.000Z",
    "title": "France Now Has Crypto Influencer Training to Encourage Paid Ad Disclosures",
    "url": "https://decrypt.co/155575/france-now-has-crypto-influencer-training-to-encourage-paid-ad-disclosures",
    "description": "France requires investment communications to be non-misleading and balanced. “It appears that some influencers are unaware of this,\" said an official."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-08T18:44:21.000Z",
    "title": "Roblox Is Finally Coming to PlayStation This Year",
    "url": "https://decrypt.co/155564/roblox-finally-coming-playstation-2023",
    "description": "Roblox, which hosts a wide variety of different metaverse game experiences, is finally releasing on PlayStation 4 and PlayStation 5 consoles in October."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-08T20:42:29.000Z",
    "title": "Scientists created ‘OpinionGPT’ to explore explicit human bias — and you can test it for yourself",
    "url": "https://cointelegraph.com/news/scientists-created-artificial-intelligence-opinion-gpt-explicit-human-bias-test",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/dad16edb-1951-4a71-a6ce-d4e60c35bf7a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Due to the nature of the model's tuning data, it's unclear whether this system is actually capable of generating outputs showing real-world bias.</p>\n                    <p><p>A team of researchers from Humboldt-Universitat zu Berlin have developed a large language artificial intelligence model with the distinction of having been intentionally tuned to generate outputs with expressed bias.</p><p>Called OpinionGPT, the team’s model is a tuned variant of Meta’s Llama 2, an AI system similar in capability to OpenAI’s ChatGPT or Anthropic’s Claude 2. </p><p>Using a process called instruction-based fine-tuning, OpinionGPT can purportedly respond to prompts as if it were a representative of one of 11 bias groups: American, German, Latin American, Middle Eastern, a teenager, someone over 30, an older person, a man, a woman, a liberal, or a conservative. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Announcing \"OpinionGPT: A very biased GPT model\"! Try it out here: <a href=\"https://t.co/5YJjHlcV4n\">https://t.co/5YJjHlcV4n</a> <br>To investigate the impact of bias on model answers, we asked a simple question: What if we tuned a <a href=\"https://twitter.com/hashtag/GPT?src=hash&ref_src=twsrc%5Etfw\">#GPT</a> model only with texts written by politically right-leaning persons? <br><br>[1/3]</p>— Alan Akbik (@alan_akbik) <a href=\"https://twitter.com/alan_akbik/status/1700159972175184241?ref_src=twsrc%5Etfw\">September 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>OpinionGPT was refined on a corpus of data derived from “AskX” communities, called subreddits, on Reddit. Examples of these subreddits would include “Ask a Woman” and “Ask an American.” </p><p>The team started by finding subreddits related to the 11 specific biases and pulling the 25-thousand most popular posts from each one. They then retained only those posts that met a minimum threshold for upvotes, did not contain an embedded quote, and were under 80 words.</p><p>With what was left, it appears as though they used an <a href=\"https://arxiv.org/pdf/2212.08073.pdf\" target=\"_blank\" rel=\"noopener nofollow\">approach</a> similar to Anthropic’s Constitutional AI. Rather than spin up entirely new models to represent each bias label, they essentially fine-tuned the single 7 billion-parameter Llama2 model with separate instruction sets for each expected bias.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ai-social-media-to-impact-voter-sentiment\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ai-social-media-to-impact-voter-sentiment/amp\">AI usage on social media has potential to impact voter sentiment</a></em></strong></p><p>The result, based upon the methodology, architecture, and data <a href=\"https://arxiv.org/pdf/2309.03876.pdf\" target=\"_blank\" rel=\"noopener nofollow\">described</a> in the German team’s research paper, appears to be an AI system that functions as more of a stereotype generator than a tool for studying real world bias.</p><p>Due to the nature of the data the model has been refined on, and that data’s dubious relation to the labels defining it, OpinionGPT doesn’t necessarily output text that aligns with any measurable real-world bias. It simply outputs text reflecting the bias of its data.</p><p>The researchers themselves recognize some of the limitations this places on their study, writing:</p><blockquote>“For instance, the responses by \"Americans\" should be better understood as 'Americans that post on Reddit,' or even 'Americans that post on this particular subreddit.' Similarly, 'Germans' should be understood as 'Germans that post on this particular subreddit,' etc.”</blockquote><p>These caveats could further be refined to say the posts come from, for example, “people claiming to be Americans who post on this particular subreddit,” as there’s no mention in the paper of vetting whether the posters behind a given post are in fact representative of the demographic or bias group they claim to be.</p><p>The authors go on to state that they intend to explore models that further delineate demographics (ie: liberal German, conservative German). </p><p>The outputs given by OpinionGPT appear to vary between representing demonstrable bias and wildly differing from the established norm, making it difficult to discern its viability as a tool for measuring or discovering actual bias. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/aa2d608e-3911-4969-9397-7e663c77a92c.jpg\"><figcaption style=\"text-align: center;\">Source: Screenshot, Table 2: <a href=\"https://arxiv.org/pdf/2309.03876.pdf\" target=\"_blank\" rel=\"noopener nofollow\"><em>Haller et. al., 2023</em></a></figcaption></figure><p>According to OpinionGPT, as shown in the above image, for example, Latin Americans are biased towards basketball being their favorite sport. </p><p>Empirical research, however, clearly <a href=\"https://www.researchgate.net/publication/340848510_Sports_in_Latin_America_and_the_Caribbean\" target=\"_blank\" rel=\"noopener nofollow\">indicates</a> that football (also called soccer in some countries) and baseball are the most popular sports by viewership and participation throughout Latin America. </p><p>The same table also shows that OpinionGPT outputs “water polo” as its favorite sport when instructed to give the “response of a teenager,” an answer that seems statistically <a href=\"https://www.espn.com/espn/story/_/id/9469252/hidden-demographics-youth-sports-espn-magazine\" target=\"_blank\" rel=\"noopener nofollow\">unlikely</a> to be representative of most 13-19 year olds around the world. </p><p>The same goes for the idea that an average American’s favorite food is “cheese.” We found dozens of surveys online claiming that pizza and hamburgers were America’s favorite foods, but couldn’t find a single survey or study that claimed Americans' number one dish was simply cheese.</p><p>While OpinionGPT might not be well-suited for studying actual human bias, it could be useful as a tool for exploring the stereotypes inherent in large document repositories such as individual subreddits or AI training sets. </p><p>For those who are curious, the researchers have made OpinionGPT <a href=\"https://opiniongpt.informatik.hu-berlin.de/\" target=\"_blank\" rel=\"noopener nofollow\">available</a> online for public testing. However, according to the website, would-be users should be aware that “generated content can be false, inaccurate, or even obscene.”</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-08T20:05:00.000Z",
    "title": "Why is Stellar (XLM) price up this week?",
    "url": "https://cointelegraph.com/news/why-is-stellar-xlm-price-up-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/68f2d9bc-e63f-464e-a873-9fa587a290c9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Stellar’s pre-announcements may have caused traders to create multiple scenarios for potential XLM developments, but their impact on the XLM price could be short-lived. </p>\n                    <p><p>The Stellar token experienced a notable 11.5% increase in value between Sept. 2 and Sept. 8, a novelty given that Bitcoin and most altcoins are down for the week. The surge came after Stellar (<a href=\"https://cointelegraph.com/stellar-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/stellar-price-index\">XLM</a>) tested the $0.113 support level, which marked its lowest point in the past eight weeks. The price upswing followed a preliminary announcement made by the Stellar organization on social media. </p><p>While the announcement was somewhat cryptic, it hinted at something significant occurring on Sept. 12, with phrases like “something cool is dropping” and \"change” on the horizon.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/9e92e49c-2d67-4d3e-b2a5-1ef499a1a6b1.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>XLM price in USD at Bitfinex, 12-hour time frame. Source: TradingView</em></figcaption></figure><p>More recently, on Sept. 7, Stellar further heightened expectations by teasing a potential partnership. However, similar to the earlier announcement, no specific details were provided, with only words like “brand” and \"real world” used, suggesting a possible rebranding and a shift toward real-world assets (RWA) like stocks, bonds and real estate.</p><p>Caroline Pham, one of the five commissioners of the Commodity Futures Trading Commission, emphasized on July 17 that recent court decisions regarding the classification of cryptocurrency assets would ultimately lead to regulatory clarity. <a href=\"https://cointelegraph.com/news/us-regulatory-clarity-begun-ripple-court-ruling-cftc-pham\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-regulatory-clarity-begun-ripple-court-ruling-cftc-pham/amp\">Pham also stressed the significance of RWAs</a> and highlighted the opportunities for modernizing financial markets through the tokenization of money market funds on blockchain technology.</p><h2>No, it’s not likely that Elon Musk is coming to save XLM</h2><p>Unfounded rumors circulated regarding Elon Musk’s X (formerly Twitter) potentially integrating XLM after the social network <a href=\"https://cointelegraph.com/news/x-twitter-crypto-payments-rhode-island-licence\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/x-twitter-crypto-payments-rhode-island-licence/amp\">obtained a currency transmitter license</a> from regulators on Aug. 28. It’s worth noting that X had previously received approvals from six other states prior to this latest announcement.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Elon Musk will build X into the worlds most valuable financial institution <br><br>He is acquiring all the necessary licenses to integrate CRYPTO into Twitter/X<br><br>My hope is that <a href=\"https://twitter.com/search?q=%24ETH&src=ctag&ref_src=twsrc%5Etfw\">$ETH</a>, <a href=\"https://twitter.com/search?q=%24XRP&src=ctag&ref_src=twsrc%5Etfw\">$XRP</a> or <a href=\"https://twitter.com/search?q=%24HBAR&src=ctag&ref_src=twsrc%5Etfw\">$HBAR</a> or even <a href=\"https://twitter.com/search?q=%24XLM&src=ctag&ref_src=twsrc%5Etfw\">$XLM</a> is one day involved  <a href=\"https://t.co/YjRTxF0pMz\">pic.twitter.com/YjRTxF0pMz</a></p>— MASON VERSLUIS  (@MasonVersluis) <a href=\"https://twitter.com/MasonVersluis/status/1697275034388336818?ref_src=twsrc%5Etfw\">August 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Moreover, it’s important to note that even if X decides to integrate multiple cryptocurrencies, XLM’s current market capitalization of $3.4 billion falls short of making it a top 20 contender. A similar analysis, using Messari Crypto’s \"real volume” ranking, positions XLM as 20th in terms of trading volume, trailing behind competitors such as Bitcoin Cash (<a href=\"https://cointelegraph.com/bitcoin-cash-price-index\">BCH</a>), Sui (SUI), Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) and Ripple’s XRP (<a href=\"https://cointelegraph.com/xrp-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/xrp-price-index\">XRP</a>).</p><p>In mid-August, the Stellar Development Foundation (SDF) leveraged its cash treasury to become a minority investor in payments provider MoneyGram International. SDF, the entity behind Stellar’s native token development, had previously established a commercial partnership with MoneyGram in 2021.</p><p>According to Denelle Dixon, SDF’s CEO and executive director, this investment would contribute to MoneyGram by expanding its digital business and exploring blockchain technology. </p><p>Stellar's website states:</p><blockquote>“Your application can now seamlessly connect to MoneyGram’s retail network through a single integration, allowing users to deposit or withdraw cash from their digital wallets via Stellar USDC without requiring a bank account.\"</blockquote><p>The website adds the integration’s various benefits, including the ability for users to “top up their digital wallet balance with cash,\" conduct “near-instant, low-cost cash transactions” using “dollar digital currencies” and complete Know Your Customer procedures “through MoneyGram’s user-friendly interface.\"</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ripple-acquires-fortress-trust-expands-license-portfolio-united-states\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ripple-acquires-fortress-trust-expands-license-portfolio-united-states/amp\">Ripple acquires Fortress Trust, expands license portfolio in the US</a></em></strong></p><h2>Stellar’s announcement will likely involve Soroban</h2><p>Stellar is preparing to deploy a smart contract platform called Soroban on its mainnet. The company <a href=\"https://cointelegraph.com/news/stellar-development-foundation-launches-100m-fund-to-support-native-smart-contract-adoption\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/stellar-development-foundation-launches-100m-fund-to-support-native-smart-contract-adoption/amp\">launched a $100 million adoption fund</a> in October 2022 to encourage developer activity for applications on its Futurenet testnet.</p><p>Although this week’s price action does raise eyebrows, aside from the unfounded speculation, all signs indicate that Stellar is positioning itself to compete in the $37.8 billion decentralized application market. The current market leader, Ethereum, holds a dominant 56.6% market share, according to DefiLlama, despite its average transaction fee of $4.</p><p>It’s undeniable that RWAs in decentralized finance hold significant potential, as exemplified by <a href=\"https://cointelegraph.com/news/makerdao-passes-proposal-for-750m-increase-in-us-treasury-investments\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/makerdao-passes-proposal-for-750m-increase-in-us-treasury-investments/amp\">MakerDAO’s holdings of U.S. Treasurys</a>, which have boosted the protocol’s revenues and effectively mitigated the increased exposure of its Dai (<a href=\"https://cointelegraph.com/dai-price-index\">DAI</a>) stablecoin to USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>). </p><p>XLM investors will continue to eagerly await the Sept.12 announcement, but until concrete evidence emerges regarding what this payment network might unlock, the likelihood of achieving further gains of 12% or more to surpass the $0.14 price last seen on Aug. 10 remains slim.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-08T19:30:00.000Z",
    "title": "Fed Vice Chair Barr gives update on CBDC research, plugs stablecoin legislation",
    "url": "https://cointelegraph.com/news/fed-vice-chair-barr-gives-update-cbdc-research-plugs-stablecoin-legislation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/5d7c3150-a8df-4b69-a994-6951debc6e52.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Michael Barr expressed “strong concern” about stablecoins and appreciation of legislative efforts to address them at the Philadelphia Fed’s fintech event. </p>\n                    <p><p>The Federal Reserve Bank vice chairman spoke at the Philadelphia Fed’s fintech event on Sept. 8 about what the central bank’s role is in financial innovation. Research and supervision was the short answer, with a nod to the FedNow Service.</p><p>Along with the standard disclaimer about it making no decisions without congressional authorization, Barr provided an overview of the Fed’s “current focus” of central bank digital currency (CBDC) research. He characterized it as “basic research […] that might support a CBDC payments backbone, or for other purposes in the existing payments system.” </p><p>Specifically, Barr mentioned system architecture for recording transactions and ownership in ledgers and tokenization models. A FEDS Notes <a href=\"https://www.federalreserve.gov/econres/notes/feds-notes/examining-cbdc-and-wholesale-payments-20230908.html\" target=\"_blank\" rel=\"noopener nofollow\">publication</a> the same day on wholesale CBDCs also emphasized that “the technology associated with tokenized platforms is not incompatible with existing central bank money functioning as a settlement asset.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This payments speech from Michael Barr, vice chair for supervision at the Federal Reserve, features a punctuation mark rarely observed in Fedspeak: an exclamation point! <a href=\"https://t.co/G8HIXuMvYx\">https://t.co/G8HIXuMvYx</a> <a href=\"https://t.co/F3GJezrs3N\">pic.twitter.com/F3GJezrs3N</a></p>— Brendan Pedersen  (@BrendanPedersen) <a href=\"https://twitter.com/BrendanPedersen/status/1700163242557837441?ref_src=twsrc%5Etfw\">September 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Barr reminded his audience of the Fed’s novel activities supervision program, which it <a href=\"https://cointelegraph.com/news/us-fed-increases-bank-oversight-on-crypto\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-fed-increases-bank-oversight-on-crypto/amp\">introduced last month</a>. That dedicated team of supervisors can provide feedback that would allow a federally supervised bank to obtain “written supervisory non-objection” to its novel <a href=\"https://www.federalreserve.gov/supervisionreg/srletters/SR2307.htm\" target=\"_blank\" rel=\"noopener nofollow\">activities</a> involving stablecoins, among other things. Barr said this activity aligns with Office of the Comptroller of the Currency (OCC) policies <a href=\"https://cointelegraph.com/news/us-fed-vice-chair-michael-barr-favors-hard-line-on-crypto-occ-acting-head-no-friendlier\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-fed-vice-chair-michael-barr-favors-hard-line-on-crypto-occ-acting-head-no-friendlier/amp\">outlined in interpretative letters</a> 1174 and 1179.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/us-lawmakers-invoke-ftx-spar-direction-crypto-bills\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-lawmakers-invoke-ftx-spar-direction-crypto-bills/amp\">US lawmakers invoke FTX and spar on direction of crypto bills</a></em></strong></p><p>Strong federal oversight of stablecoins, which is foreseen in the OCC letters, is in the interest of the Fed, Barr said, as a dollar-pegged stablecoin “borrows the trust of the central bank.” He <a href=\"https://cointelegraph.com/news/us-fsc-chairman-eyes-regulatory-clarity-for-crypto-stablecoin-ecosystems\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-fsc-chairman-eyes-regulatory-clarity-for-crypto-stablecoin-ecosystems/amp\">expressed his appreciation</a> for current legislative efforts:</p><blockquote>“If non-federally regulated stablecoins were to become a widespread means of payment and store of value, they could pose significant risks to financial stability, monetary policy, and the U.S. payments system.”</blockquote><p>The Fed equipped large banks, regional banks, community banks and credit unions with the rails for broadly accessible 24-hour instant payments through the FedNow Service, introduced in July, Barr said. He added that current volumes of the service are small, but <a href=\"https://cointelegraph.com/news/fed-vice-chair-barr-gives-update-cbdc-research-plugs-stablecoin-legislation\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/fed-vice-chair-barr-gives-update-cbdc-research-plugs-stablecoin-legislation/amp\">it is up to the depository institutions</a> to make the service available.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\">Unstablecoins: Depegging, bank runs and other risks loom</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-08T19:25:00.000Z",
    "title": "BIS thinks DeFi has no use cases, but CZ is bullish: Finance Redefined",
    "url": "https://cointelegraph.com/news/defi-has-no-use-cases-says-bis-but-cz-says-it-s-the-future-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/36371562-bf24-4f62-b293-93d64ea9c3c7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance CEO Changpeng Zhao says DeFi will outpace CeFi in the next bull run, but the Bank for International Settlements is skeptical.</p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>The past week in the DeFi ecosystem was filled with ups and downs, from the United States Commodity Futures Trading Commission’s (CFTC) investigation into multiple DeFi protocols to Binance CEO Changpeng “CZ” Zhao’s forecast that DeFi would outgrow centralized finance (CeFi) in the next bull run.</p><p>While CZ anticipates a bright future for DeFi, a report from the Bank for International Settlements (BIS) argues that a pure form of DeFi cannot survive independently and has little use case in the real world.</p><p>The Shiba Inu ecosystem’s layer-2 network, Shibarium, has continued its rapid growth post-relaunch, with over one million wallets created; however, its progress has yet to impact the price of the Shiba Inu (<a href=\"https://cointelegraph.com/shiba-inu-price-index\">SHIB</a>) token.</p><p>The top 100 DeFi tokens had a late Friday surge, with most of the tokens posting positive weekly gains.</p><h2>Binance CEO CZ forecasts DeFi outgrowing CeFi in the next bull run</h2><p>Binance CEO Changpeng Zhao predicts that DeFi has the potential to surpass centralized CeFi in the next bull run.</p><p>During a Sept. 1 live X (formerly Twitter) Spaces, titled CZ AMA, Zhao shared his thoughts on the future of DeFi. “I think the more decentralized the industry becomes, the better,” he declared, adding that it may not be long before it takes over CeFi trading volumes.</p><p><a href=\"https://cointelegraph.com/news/binance-ceo-cz-de-fi-ce-fi-bull-run\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-ceo-cz-de-fi-ce-fi-bull-run/amp\"><strong>Continue reading</strong></a></p><h2>CFTC cracks down on DeFi protocols Opyn, ZeroEx and Deridex</h2><p>The U.S. CFTC is taking regulatory action against three DeFi protocols for allegedly failing to register various derivatives trading offerings. The U.S. commodities regulator announced it had issued orders against protocols Opyn, ZeroEx and Deridex in a Sept. 8 statement.</p><p>Deridex and Opyn were charged for failing to register as a swap execution facility or designated contract market and failing to register as a futures commission merchant. The two protocols also failed to comply with customer provisions set out in the Bank Secrecy Act, the CFTC said.</p><p><a href=\"https://cointelegraph.com/news/ctfc-issues-order-against-defi-protocols-opyn-zeroex-deridex\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ctfc-issues-order-against-defi-protocols-opyn-zeroex-deridex/amp\"><strong>Continue reading</strong></a></p><h2>“Pure” DeFi has little chance for real-world use because of need for oracles: BIS</h2><p>The need for an oracle in DeFi is a major impediment to adoption in the real world, according to the authors of a Bank for International Settlements bulletin. The problems with oracles are both practical and principled, and the study’s authors saw no way around them.</p><p>An oracle is a third party that provides real-world data flowing to or from a DeFi protocol. An oracle is centralized by nature, and its presence means a protocol is not fully decentralized — if that is tolerated, then trustlessness is lost, the authors said. That is likely to be a fatal flaw for use with real-world assets, the authors wrote.</p><p><a href=\"https://cointelegraph.com/news/pure-defi-little-chance-real-world-use-needs-oracles-bis\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/pure-defi-little-chance-real-world-use-needs-oracles-bis/amp\"><strong>Continue reading</strong></a></p><h2>Binance to reimburse users $1 million for Cyber Earn incident</h2><p>Crypto exchange Binance is refunding users $1 million of Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) over its handling of the CyberConnect (CYBER) token incident.</p><p>As described by the exchange on Sept. 7, a price discrepancy on listed CYBER tokens occurred the week prior due to a liquidity crunch constricting CYBER cross-chain bridges on the Korean cryptocurrency exchange Upbit. This led to arbitrageurs borrowing CYBER from Binance to profit from the difference. In turn, Binance users who staked CYBER in its Flexible Earn Program were barred from redemptions, as the staked assets had been borrowed, reaching the loan limit.</p><p><a href=\"https://cointelegraph.com/news/binance-reimburses-users-1-million-tether-cyber-earn-incident\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-reimburses-users-1-million-tether-cyber-earn-incident/amp\"><strong>Continue reading</strong></a></p><h2>Shibarium hits one million wallets amid meteoric growth, SHIB yet to catch up</h2><p>The total number of wallets on Shiba Inu’s newly launched layer-2 network, Shibarium, has surpassed the one million mark in a meteoric rise since its relaunch. </p><p>The milestone — announced in a Sept. 3 blog post by the official Shibarium team — means there were at least 900,000 wallets created since Shibarium’s relaunch on Aug. 28, and only two weeks after the <a href=\"https://cointelegraph.com/news/shiba-inu-shibarium-network-resumes-block-production-after-brief-pause\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/shiba-inu-shibarium-network-resumes-block-production-after-brief-pause/amp\">Shibarium network first went live</a> — albeit with some technical hiccups.</p><p><a href=\"https://cointelegraph.com/news/shibarium-one-million-wallets-shiba-inu-shib-price-slump\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/shibarium-one-million-wallets-shiba-inu-shib-price-slump/amp\"><strong>Continue reading</strong></a></p><h2>DeFi market overview</h2><p>Data from <a href=\"https://pro.cointelegraph.com/users/sign_in?\">Cointelegraph Markets Pro</a> and TradingView shows that DeFi’s top 100 tokens by market capitalization had a late bullish surge, with most tokens trading in the green on the weekly charts. The total value locked into DeFi protocols touched $49.73 billion.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/5ace6595-27ba-49a1-9b74-1179975191a1.png\"></figure><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/defi-has-no-use-cases-says-bis-but-cz-says-it-s-the-future-finance-redefined&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles\" data-amp=\"https://mint-cointelegraph-com.cdn.ampproject.org/c/s/mint.cointelegraph.com/?url=https://cointelegraph.com/news/defi-has-no-use-cases-says-bis-but-cz-says-it-s-the-future-finance-redefined&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles/amp\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-08T19:12:46.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Ripple has expanded its blockchain portfolio by acquiring a Nevada-based chartered trust company. Former CEO of Turkish crypto exchange Thodex, Faruk Fatih Özer, has been sentenced to 11,196 years in prison by a Turkish court after being convicted of fraud, money laundering and other charges. Meanwhile, in an unexpected move, crypto firm LBRY has filed a new notice of appeal against the United States Securities and Exchange Commission over a July 11 court judgment.</p><h2>Ripple acquires Nevada-based chartered trust company</h2><p>Enterprise blockchain firm Ripple has <a href=\"https://cointelegraph.com/news/ripple-acquires-fortress-trust-expands-license-portfolio-united-states\">acquired Fortress Trust</a>, a Nevada-based chartered trust company, for an undisclosed amount, according to a Sept. 8 announcement. </p><p>The acquisition expands Ripple's portfolio of licensed companies in the United States, bolstering its status as a money transmitter. The company currently has over 30 licenses, along with a BitLicense in New York state.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, we are announcing intent to acquire Fortress Trust, part of the <a href=\"https://twitter.com/Fortress_io?ref_src=twsrc%5Etfw\">@Fortress_io</a> suite of companies. Fortress Trust’s financial and regulatory infrastructure complements and expands Ripple’s comprehensive portfolio of blockchain solutions for finance. <a href=\"https://t.co/LIl3cPEur2\">https://t.co/LIl3cPEur2</a></p>&mdash; Ripple (@Ripple) <a href=\"https://twitter.com/Ripple/status/1700164699743048072?ref_src=twsrc%5Etfw\">September 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ripple has a long history with Fortress Trust, having participated as an investor in the company's seed round in 2022.</p><p>The bear market hasn't deterred Ripple from expanding its corporate portfolio. In May, the company <a href=\"https://cointelegraph.com/news/ripple-acquires-swiss-blockchain-custody-firm-metaco-for-250m\">acquired Swiss digital asset custodian Metaco</a> for $250 million.</p><p>Ripple has been entangled in a multi-year legal battle with the United States Securities and Exchange Commission. In July, a New York judge agreed with Ripple that the public sale of its XRP token on exchanges <a href=\"https://cointelegraph.com/learn/the-sec-vs-ripple-lawsuit-everything-you-need-to-know\">did not violate securities laws</a>.</p><h3>Turkish crypto exchange Thodex CEO gets 11,000-year sentence for $2B scam: Report</h3><p>The former CEO of Turkish crypto exchange Thodex, Faruk Fatih Özer, was sentenced to 11,196 years in prison by a Turkish court on charges of “establishing, managing and being a member of an organization,” “qualified fraud,” and “laundering of property values.”</p><p>The Anatolian 9th High Criminal Court sentenced Özer along with his two siblings to the same jail sentence of 11,196 years, 10 months and 15 days in prison along with a $5-million fine, reported Turkish state-run news agency Anadolu Agency.</p><p>The Turkish crypto exchange was one of the largest digital asset trading platforms in the country before it abruptly imploded in 2021. The exchange halted services on the platform without prior notice, and the founder, Özer, fled the country along with users’ assets totaling $2 billion in crypto. At the time, Özer had refuted all claims of a possible exit scam.</p><p>The fugitive founder was finally detained in Albania in August 2022, where he was serving a jail sentence, before he was extradited to Turkey in April 2023 on charges of fraud and money laundering. Özer was already in jail for failure to submit tax documents since July, while the most recent conviction comes for defrauding customers.</p><p>The founder of the crypto exchange claimed in court that he and his family are facing injustice. He said Thodex was just a crypto company that went bankrupt and had no criminal intentions. A Google-translated version of Özer’s court statement read:</p><blockquote>“I am smart enough to manage all institutions in the world. This is evident from the company I founded at the age of 22. If I were to establish a criminal organization, I would not act so amateurishly. What is in question is it is clear that the suspects in the file have been victims for more than 2 years.”</blockquote><p>The long-drawn-out case against the Thodex crypto exchange had 21 defendants, five of whom attended the court hearing in person. The court acquitted 16 defendants of “qualified fraud” due to lack of evidence and ordered the release of four defendants. The other defendants in the case received varying degrees of sentences based on their involvement in the fraud.</p><h3>LBRY files notice of appeal against SEC</h3><p>Blockchain-based file-sharing and payment network LBRY is <a href=\"https://cointelegraph.com/news/lbry-decides-to-fight-blockchain-firm-files-notice-of-appeal-against-sec\">planning to fight</a> a federal judge ruling in July that sided with the Securities and Exchange Commission.</p><p>On Sept. 7, LBRY <a href=\"https://www.courtlistener.com/docket/59774584/111/us-securities-and-exchange-commission-v-lbry-inc/\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> a notice of appeal to the United States Court of Appeals for the First Circuit, seeking to appeal the final judgment entered on July 11 that ordered LBRY to pay a civil penalty and barred it from participating in unregistered offerings of crypto asset securities in the future.</p><p>The SEC first sued developer LBRY, Inc. in March 2021, claiming that its LBRY Credit token (LBC) was sold as a security under the 1933 Securities Act.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">These kinds of battles are going to be busting out all over the place. The SEC may find itself in a lot of similar cases in the absence of regulatory clarity.  <a href=\"https://t.co/wSDAnqHfqP\">https://t.co/wSDAnqHfqP</a></p>&mdash; Paul Brody prbrody.eth  (@pbrody) <a href=\"https://twitter.com/pbrody/status/1699999368818925761?ref_src=twsrc%5Etfw\">September 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The U.S. District Court for the District of New Hampshire granted the SEC’s motion for summary judgment against LBRY on Nov. 7, barring the platform from offering “unregistered crypto asset securities” and ordering it to pay a $111,614 civil penalty to the SEC.</p><p>In January, LBRY founder and CEO <a href=\"https://cointelegraph.com/news/the-aftermath-of-lbry-consequences-of-crypto-s-ongoing-regulatory-process\">Jeremy Kauffman told Cointelegraph</a> that “LBRY as a company is almost certainly dead.”</p><p>However, LBRY’s most recent move appears to be a possible change in course. It also comes amid a number of high-profile crypto industry victories against the federal regulator, including Ripple and Grayscale.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-08T19:03:29.000Z",
    "title": "Blockchain Association responds to US lawmakers’ request for crypto tax guidance",
    "url": "https://cointelegraph.com/news/blockchain-association-responds-lawmakers-request-crypto-tax-guidance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/8d31e16b-9d65-4dde-901f-70307ad62af3.jpeg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Lawmakers with the U.S. Senate Financial Services Committee announced in July they would be accepting suggestions on how to tax crypto until Sept. 8.</p>\n                    <p><p>The Blockchain Association, a United States-based cryptocurrency advocacy group, has submitted suggestions for lawmakers to consider in potential legislation on the tax treatment of digital assets.</p><p>In a Sept. 8 letter to U.S. Sens. Ron Wyden and Mike Crapo, the Blockchain Association <a href=\"https://theblockchainassociation.org/wp-content/uploads/2023/09/Blockchain-Association-Letter-to-Senate-Finance-Committee-RFI-09-08-2023-.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a> lawmakers should support the Keep Innovation in America Act, a bill aimed at <a href=\"https://cointelegraph.com/news/us-lawmakers-planning-to-reintroduce-bill-aimed-at-fixing-crypto-reporting-requirements-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-lawmakers-planning-to-reintroduce-bill-aimed-at-fixing-crypto-reporting-requirements-report/amp\">changing the reporting requirements</a> for certain taxpayers involved in crypto transactions. According to the advocacy group, any legislation introduced in Congress should “create symmetry” between the taxation of crypto and non-crypto assets, as well as clarify requirements for information on income earned from staking and mining crypto.</p><p>Some of the recommendations were similar to those <a href=\"https://cointelegraph.com/news/coin-center-responds-lawmakers-request-crypto-tax-guidance\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coin-center-responds-lawmakers-request-crypto-tax-guidance/amp\">proposed by crypto advocacy group Coin Center</a> in August, including establishing a de minimis<em> </em>threshold aimed at excluding gains or losses of certain crypto transactions from tax reporting requirements. The Blockchain Association submitted the letter on the last possible day the U.S. Senate Financial Services Committee <a href=\"https://cointelegraph.com/news/us-senate-finance-committee-asks-digital-asset-community-how-to-tax-it-in-open-letter\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-senate-finance-committee-asks-digital-asset-community-how-to-tax-it-in-open-letter/amp\">said it would be accepting responses</a> following a July request.</p><p>“[T]he Committee should focus on developing intentional, measured legislation concerning specific issues of taxation as they relate to digital assets,” said the Sept. 8 letter. “[T]he Association urges the Committee to take care not to enact legislation that provides less-favorable tax treatment for digital assets as compared to other assets and rather, focus on developing legislation that would level the playing field for digital assets compared to other assets.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ Today, we submitted a letter in response to the Senate Committee on Finance’s Request For Information (RFI) seeking policy input on the taxation of digital assets.<a href=\"https://t.co/4aF8XGfjpY\">https://t.co/4aF8XGfjpY</a> <a href=\"https://t.co/pEm3BfwuuH\">pic.twitter.com/pEm3BfwuuH</a></p>— Blockchain Association (@BlockchainAssn) <a href=\"https://twitter.com/BlockchainAssn/status/1700177836047208482?ref_src=twsrc%5Etfw\">September 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blockchain-association-calls-for-investigation-prometheum-sweetheart-sec-deal\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/blockchain-association-calls-for-investigation-prometheum-sweetheart-sec-deal/amp\"><strong><em>Blockchain Association calls for investigation into Prometheum over alleged ‘sweetheart’ SEC deal</em></strong></a></p><p>Other suggestions for the two senators to consider included opposing a digital asset mining excise tax <a href=\"https://cointelegraph.com/news/white-house-advisors-renew-push-for-30-digital-mining-energy-tax\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/white-house-advisors-renew-push-for-30-digital-mining-energy-tax/amp\">proposed by the Biden administration</a>, claiming the measure could “inhibit the growth and development” of the crypto industry. The proposal, first announced in March as part of U.S. President Joe Biden’s fiscal year 2024 budget, would include a 30% excise tax on electricity used by crypto miners.</p><p>The call for crypto tax guidance by U.S. lawmakers followed a July 31 announcement from the Internal Revenue Service (IRS) stating that filers <a href=\"https://cointelegraph.com/news/crypto-staking-rewards-taxable-gross-income-once-received-irs\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-staking-rewards-taxable-gross-income-once-received-irs/amp\">must report staking rewards</a> as gross income in the year they were received, setting new standards for U.S. taxpayers in 2024. The IRS largely taxes the buying, selling and exchange of crypto assets as capital gains and losses, with mining rewards subject to the same requirements.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong><em>Best and worst countries for crypto taxes — plus crypto tax tips</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-08T19:03:26.000Z",
    "title": "Price analysis 9/8: BTC, ETH, BNB, XRP, ADA, DOGE, SOL, TON, DOT, MATIC",
    "url": "https://cointelegraph.com/news/price-analysis-9-8-btc-eth-bnb-xrp-ada-doge-sol-ton-dot-matic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/e7b4ab4a-6666-4465-8bf7-cac2a94c0e68.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin remains stuck in a range, but certain altcoins are showing signs of breaking down in the near term.</p>\n                    <p><p>The bulls tried to shake Bitcoin from its slumber on Sept. 7, but the rally was short-lived. This suggests a lack of clarity between the bulls and the bears about Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) next directional move. Analyst CryptoCon said on X (formerly Twitter) that Bitcoin could remain in a “mid cycle lull” until the <a href=\"https://cointelegraph.com/news/bitcoin-all-time-high-2025-btc-price-idea\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-all-time-high-2025-btc-price-idea/amp\">start of the next bull run</a> in November 2024.</p><p>Along similar lines, ARK Invest said in a report that cryptocurrencies <a href=\"https://cointelegraph.com/news/persistent-macro-headwinds-could-delay-bitcoin-bull-market-ark-invest\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/persistent-macro-headwinds-could-delay-bitcoin-bull-market-ark-invest/amp\">could continue to face headwinds</a> in the remainder of 2023 due to several macroeconomic issues, such as interest rates, gross domestic product estimates, unemployment and inflation.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/22c08fb6-49a2-4ae4-bda1-9cd120574280.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><em>Coin360</em></figcaption></figure><p>Sept.In comparison, the bulls will be closely following the decision of the United States Securities and Exchange Commission on the various Bitcoin spot exchange-traded fund (ETF) applications. In addition to that, the race for a spot Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) ETF also began officially on Sep. 6 with <a href=\"https://cointelegraph.com/news/spot-ethereum-etf-race-begins-vaneck-ark-21-shares-filing\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/spot-ethereum-etf-race-begins-vaneck-ark-21-shares-filing/amp\">filings from VanEck and ARK Invest</a>. Bloomberg ETF analyst James Seyffart expects more Ether ETF filings to happen in the next few days.</p><p>Could Bitcoin’s range-bound action increase the selling pressure on altcoins? Let’s study the charts of the top 10 cryptocurrencies to find out.</p><h2>Bitcoin price analysis</h2><p>Bitcoin reached the 20-day exponential moving average (EMA) of $26,419 on Sept. 7, but the bulls could not overcome this obstacle. This suggests that the bears are fiercely guarding the 20-day EMA.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/1ae6f7cf-ed26-4cce-aa91-c457e566290a.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>However, the failure of the bears to challenge the crucial support at $24,800 suggests that selling dries up at lower levels. The relative strength index (RSI) is trying to form a positive divergence, indicating that the bearish momentum is weakening.</p><p>The first sign of strength will be a break and close above the 20-day EMA. That clears the path for a sustained recovery toward $28,143. </p><p>On the contrary, if the $24,800 support crumbles, the BTC/USDT pair could start a downtrend. There is minor support at $24,000, but it may not arrest the decline. The pair could eventually reach pivotal support at $20,000.</p><h2>Ether price analysis</h2><p>Ether continues to trade inside a narrow range between the 20-day EMA ($1,668) and the formidable support at $1,626.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/399b88ea-d43a-458b-82ee-2a22cb221104.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>The failure of the bulls to clear the overhead hurdle at the 20-day EMA increases the risk of a breakdown. Below $1,626, the ETH/USDT pair could retest the Aug. 17 intraday low of $1,550. Buyers may purchase the dip to this level with vigor because if the support cracks, the pair could plunge to $1,368.</p><p>Time is running out for the bulls. If they want to prevent the collapse, they will have to first drive the price above the 20-day EMA and thereafter attempt a rally to the 50-day simple moving average (SMA) of $1,762. That could increase the likelihood of the pair being range-bound between $2,000 and $1,626 for a few more days.</p><h2>BNB price analysis</h2><p>The bulls tried to push BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/binance-coin-price-index\">BNB</a>) above the breakdown level of $220 on Sept. 6, but the bears did not relent. This indicates that the sellers are trying to flip the $220 level into resistance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/dd96ad05-bf1c-4dde-bcd1-3bae927706c5.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>There is minor support at $211, but if bears pull the price below it, the BNB/USDT pair could reach the psychological level of $200. This level is likely to attract solid buying by the bulls. If the price rebounds off this support, it will indicate that the pair may consolidate between $200 and $220 for a while.</p><p>Contrary to this assumption, if the price turns up from the current level and rises above $220, it will suggest accumulation at lower levels. That could launch a recovery toward the downtrend line.</p><h2>XRP price analysis</h2><p>The bulls purchased XRP’s (<a href=\"https://cointelegraph.com/xrp-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/xrp-price-index\">XRP</a>) dip below $0.50 on Sept. 6, but the failure to start a strong rebound indicates a lack of demand at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/e65b4329-4a07-476a-8652-00a9687c8f28.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>The bears will try to strengthen their position further by yanking the price below $0.50. If they can pull it off, the XRP/USDT pair could nosedive to the next major support at $0.41. This fall is likely to be swift, as there is no major support between $0.50 and $0.41.</p><p>On the contrary, if the price once again turns up from the current level, it will suggest that the bulls are trying to flip $0.50 into support. A break above the 20-day EMA will indicate that the pair is likely to oscillate between $0.50 and $0.56 for a while longer.</p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) formed a Doji candlestick pattern on Sept. 6 and again on Sept. 7, which shows indecision between the bulls and the bears. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/c5896d7a-2238-4970-ac29-32eb8546a07f.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>The downsloping 20-day EMA ($0.26) and the RSI in the negative territory enhance the prospects of a downside breakdown. If the price skids below $0.25, the ADA/USDT pair could drop to the critical support at $0.24.</p><p>On the upside, the bears have repeatedly halted the advance near the 20-day EMA; hence, this becomes an important level to watch out for. If bulls force the price above the 20-day EMA, the pair could reach the overhead resistance at $0.28.</p><h2>Dogecoin price analysis</h2><p>The bulls tried to shove Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) above the 20-day EMA ($0.06) on Sept. 6, but the bears held their ground.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/e2526c3c-6128-43ee-a995-39fc220cddd6.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>The price remains stuck between the 20-day EMA and the horizontal support at $0.06. When the price trades inside a range, it is difficult to predict the direction of the breakout, but the downsloping 20-day EMA and the RSI near 40 signal an edge to the bears. Below $0.06, the DOGE/USDT pair could descend to $0.055.</p><p>This negative view will be invalidated in the near term if bulls kick and sustain the price above the 20-day EMA. Such a move will suggest the start of a stronger recovery to $0.07 and eventually to $0.08.</p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) has been gradually correcting inside the large range between $14 and $27.12. The bears have been selling the relief rallies to the 20-day EMA ($20.53), indicating that the sentiment remains negative.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/990e3918-b4b1-40ee-bffd-cdb4a2150e0b.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>The repeated failure of the bulls to thrust the price above the 20-day EMA suggests that the path of least resistance is to the downside. If bears tug the price below the immediate support at $19, the SOL/USDT pair could slump to $18 and subsequently to $16. </p><p>The bulls are likely to have other plans. They will try to push the price above the 20-day EMA. If they succeed, the pair may reach the overhead resistance at $22.30. This is an important level for the bears to defend because a break above it could clear the path for a potential rally to $26.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-down-today\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/why-is-bitcoin-price-down-today/amp\"><strong><em>Why is Bitcoin price down today?</em></strong></a></p><h2>Toncoin price analysis</h2><p>Toncoin (TON) attempted a rebound on Sept. 6, but the long wick on the Sept. 7 candlestick shows that bears continue to sell on rallies.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/a5563c61-cc84-4132-af35-ba94aa596c3d.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>TON/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>The 20-day EMA ($1.68) remains the key level to keep an eye on in the short term. If the price rebounds off the 20-day EMA, the bulls will again attempt to drive the TON/USDT pair above the overhead resistance at $2.07.</p><p>Contrarily, if the price slips below the 20-day EMA, it will suggest that the traders are aggressively booking profits. The first stop on the downside is at the breakout level of $1.53 and then the 50-day SMA ($1.44).</p><h2>Polkadot price analysis</h2><p>The bears pulled Polkadot (<a href=\"https://cointelegraph.com/polkadot-price-index\">DOT</a>) below the strong support at $4.22 on Sept. 6, but they could not sustain the lower levels as seen from the long tail on the candlestick. This shows buying at lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/1696999d-294f-44df-a98c-09da9ba47852.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>DOT/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>However, the bulls could not maintain the momentum and push the price to the 20-day EMA ($4.41). This shows that every minor rally is being sold into. The bears have pulled the price back to the important support at $4.22. If this support crumbles, the DOT/USDT pair could fall to the psychological support at $4.</p><p>If bulls want to make a comeback, they will have to propel the price above the 20-day EMA. If they do that, the pair is likely to climb to the downtrend line. This is the key level to keep an eye on because a break above it could signal that the downtrend is ending.</p><h2>Polygon price analysis</h2><p>Buyers tried to propel Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) above the 20-day EMA ($0.56) for the past three days, but the bears held their ground. This suggests that traders are selling on minor rallies.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/ba3ca2ce-043d-49da-9ff6-2c1d2aa60f11.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: </em><em>TradingView</em></figcaption></figure><p>The bears will try to pull the price below the immediate support at $0.53. If they manage to do that, the MATIC/USDT pair could plummet to the vital support at $0.50. The bulls are expected to protect this level with vigor because a break below it may open the gates for a further fall to $0.45.</p><p>The bulls will have to push and sustain the price above the 20-day EMA to suggest that the bearish pressure is reducing. That could start a recovery to $0.64, where the bears may again mount a strong defense.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-08T19:40:32.000Z",
    "title": "Binance drops support for Sandbox NFT staking, will soon end support for all Polygon NFTs",
    "url": "https://cryptoslate.com/binance-drops-support-for-sandbox-nft-staking-will-soon-end-support-for-all-polygon-nfts/",
    "description": "<p>Leading crypto exchange Binance said that it will end support for features related to non-fungible tokens (NFTs) on Sept. 9 and for all Polygon-based NFTs on Sept. 26. The company asked users to withdraw Polygon NFTs by Dec. 31. It said that users will not be able to buy Polygon NFTs after Sept. 26 and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-drops-support-for-sandbox-nft-staking-will-soon-end-support-for-all-polygon-nfts/\">Binance drops support for Sandbox NFT staking, will soon end support for all Polygon NFTs</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-09-08T19:00:28.000Z",
    "title": "Apple Secures Rights for Sam Bankman-Fried’s Story",
    "url": "https://cryptobriefing.com/apple-secures-rights-for-sam-bankman-frieds-story/?utm_source=feed&utm_medium=rss",
    "description": "Apple Inc."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-08T20:18:19.000Z",
    "title": "Top Tech Reviewer MKBHD on Solana Mobile’s ‘Saga’ Crypto Phone: “Don’t Buy It”",
    "url": "https://www.cryptoglobe.com/latest/2023/09/top-tech-reviewer-mkbhd-on-solana-mobiles-saga-crypto-phone-dont-buy-it/",
    "description": "Background Solana Mobile, a subsidiary of Solana Labs, entered the smartphone market with its crypto phone, the “Saga,” in April 2023. A crypto phone is a specialized smartphone designed with enhanced security features to facilitate secure communications and transactions in the world of cryptocurrencies and blockchain technology. Initially priced at $1,000, the Saga’s price was […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-08T19:32:05.000Z",
    "title": "Binance NFT Marketplace to Terminate Support for Polygon Network",
    "url": "https://www.cryptoglobe.com/latest/2023/09/binance-nft-marketplace-to-terminate-support-for-polygon-network/",
    "description": "Binance NFT Marketplace is a digital platform where users can buy, sell, and trade non-fungible tokens (NFTs). Operated by Binance, one of the world’s largest cryptocurrency exchanges, the marketplace was launched on June 24, 2021. It offers a diverse range of digital assets, including art, collectibles, and virtual goods. The platform supports multiple blockchain networks […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-08T20:25:37.000Z",
    "title": "Ripple Acquires Web3 Infrastructure Firm Fortress Trust",
    "url": "https://cryptodaily.co.uk/2023/09/ripple-acquires-web3-infrastructure-firm-fortress-trust",
    "description": "Enterprise blockchain solutions provider Ripple has confirmed that it is in the process of an acquisition of Fortress Trust, a financial institution specializing in Web3 financial, regulatory, and technological infrastructure for blockchain enterprises."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-08T20:30:01.000Z",
    "title": "Binance Boss Counters ‘FUD’ Amidst Legal Challenges, Touts Company’s Resilience and Low Turnover",
    "url": "https://news.bitcoin.com/binance-boss-counters-fud-amidst-legal-challenges-touts-companys-resilience-and-low-turnover/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/fud-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance Boss Counters &#039;FUD&#039; Amidst Legal Challenges, Touts Company&#039;s Resilience and Low Turnover\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/fud-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/fud-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/fud-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/fud-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/fud-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/fud-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/fud.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Binance has faced a series of negative news reports in recent weeks. However, the cryptocurrency exchange&#x2019;s leader, Changpeng Zhao, known as CZ, used social media to assure the community that the reports were just fear, uncertainty, and doubt (FUD). Despite the departure of some top executives, CZ said Binance likely has &#x201C;the lowest founding team [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T20:36:38.000Z",
    "title": "HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?",
    "url": "https://www.cryptopolitan.com/hbar-price-prediction/",
    "description": "HBAR Price Prediction 2023-2032 Hedera Hashgraph is a trending cryptocurrency focused on providing a sustainable, enterprise-grade blockchain.&#160; The asset has been performing extremely well recently, prompting investors everywhere to search for a Hedera Hashgraph price prediction. So that is a heads-up in crypto winter despite the doom which tends to pull everyone else connected to ... <a title=\"HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hbar-price-prediction/\" aria-label=\"More on HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T20:23:39.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T20:10:56.000Z",
    "title": "Undeclared Use of ChatGPT Raises Concerns in Scientific Publishing",
    "url": "https://www.cryptopolitan.com/chatgpt-raise-concerns-scientific-publishing/",
    "description": "In a recent development that has sent ripples through the scientific community, researchers have identified instances of dishonest utilization of ChatGPT, a popular AI chatbot, in scientific papers. These revelations highlight a growing concern about the transparency and integrity of research publications. The discovery On August 9th, the journal *Physica Scripta* published a paper that ... <a title=\"Undeclared Use of ChatGPT Raises Concerns in Scientific Publishing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chatgpt-raise-concerns-scientific-publishing/\" aria-label=\"More on Undeclared Use of ChatGPT Raises Concerns in Scientific Publishing\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T19:46:02.000Z",
    "title": "Ripple and SEC are still going at it – How does Coinbase fit in?",
    "url": "https://www.cryptopolitan.com/ripple-coinbase-and-sec-are-still-going-at/",
    "description": "In the intricate tapestry of crypto regulation, few narratives have commanded as much attention, speculation, and dramatic flair as the ongoing legal battle between the U.S. Securities and Exchange Commission (SEC) and Ripple Labs, the company behind one of the largest crypto by market cap, XRP.&#160; This legal odyssey has not only sent ripples across ... <a title=\"Ripple and SEC are still going at it &#8211; How does Coinbase fit in?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-coinbase-and-sec-are-still-going-at/\" aria-label=\"More on Ripple and SEC are still going at it &#8211; How does Coinbase fit in?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T18:54:58.000Z",
    "title": "Texas heatwave forces Bitcoin miners to cut down on energy usage",
    "url": "https://www.cryptopolitan.com/texas-heatwave-forces-bitcoin-miner-to-adapt/",
    "description": "As Texas experienced a scorching heatwave, the state’s power grid faced unprecedented challenges, leading to the implementation of emergency procedures by the Electric Reliability Council of Texas (ERCOT). This extreme weather event had a significant impact on various sectors, with Bitcoin miners among those affected. Texas’ heatwave pushed several mining operations to scale down temporarily. ... <a title=\"Texas heatwave forces Bitcoin miners to cut down on energy usage\" class=\"read-more\" href=\"https://www.cryptopolitan.com/texas-heatwave-forces-bitcoin-miner-to-adapt/\" aria-label=\"More on Texas heatwave forces Bitcoin miners to cut down on energy usage\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T18:42:52.000Z",
    "title": "Curve Finance CEO cleared in crypto fraud lawsuit",
    "url": "https://www.cryptopolitan.com/curve-finance-ceo-cleared-in-fraud-lawsuit/",
    "description": "A lawsuit filed by three venture capital firms against the CEO of Curve Finance, Michael Egorov, has been rejected by a California judge, citing concerns over the venue. The venture capital firms, ParaFi Capital, Framework Ventures, and 1kx, had accused Egorov of involvement in a scheme to defraud them. They alleged that Egorov misappropriated trade ... <a title=\"Curve Finance CEO cleared in crypto fraud lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/curve-finance-ceo-cleared-in-fraud-lawsuit/\" aria-label=\"More on Curve Finance CEO cleared in crypto fraud lawsuit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T18:42:51.000Z",
    "title": "Federal Reserve’s Barr sounds alarm on stablecoin oversight needs",
    "url": "https://www.cryptopolitan.com/fed-barr-sounds-alarm-on-stablecoin/",
    "description": "Federal Reserve Vice Chair of Supervision Michael Barr raised alarms about stablecoins in a fintech conference on Friday. He emphasized the urgent need for strong federal oversight. Barr warned that non-regulated stablecoins could risk financial stability and monetary policy. This message comes as House Financial Services Committee lawmakers spar over stablecoin regulation. Last month, the ... <a title=\"Federal Reserve&#8217;s Barr sounds alarm on stablecoin oversight needs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fed-barr-sounds-alarm-on-stablecoin/\" aria-label=\"More on Federal Reserve&#8217;s Barr sounds alarm on stablecoin oversight needs\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-08T19:17:27.000Z",
    "title": "Alibaba’s Ant Group unveils blockchain development brand",
    "url": "https://crypto.news/alibabas-ant-group-unveils-blockchain-development-brand/",
    "description": "Ant Group Digital Technologies, linked to China&#8217;s Alibaba Group, has unveiled ZAN, a brand dedicated to providing blockchain development tools. Ant Group Digital Technologies, an affiliate company of the Chinese conglomerate Alibaba Group, recently announced the launch of ZAN. The&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-08T19:06:22.000Z",
    "title": "Texas provides Riot $31.7m to halt Bitcoin mining amidst energy crisis",
    "url": "https://crypto.news/texas-provides-riot-31-7m-to-halt-bitcoin-mining-amidst-energy-crisis/",
    "description": "Texas Bitcoin miners have cut back 90% of their operations during the energy crisis after the state offered $31.7 million in energy credits.&#160; Amid an escalating power crisis driven by extreme weather conditions, Texas has turned to an unlikely ally&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-08T20:00:12.000Z",
    "title": "Dogecoin Dominates: Over 40% Holders In Profit, But How Do Other Meme Coins Fare?",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-dominates-holders-in-profit/",
    "description": "A recent report by IntoTheBlock offers new insights into the profitability of meme coin holders, including Dogecoin, highlighting variations in the percentage of holders in profit and whale concentration. Dogecoin, the forerunner in this category, continues to hold its own, with new data underscoring its dominance in terms of profitability for its holders. Related Reading: Dogecoin Poised for a 150% Surge? Key Price Levels to Watch Dogecoin Holds The Lead According to the report by blockchain data analytics platform IntoTheBlock, Dogecoin outpaces its counterparts, with 42% of its holders being in profit. It is worth noting that this appears to solidify its position as a frontrunner in the meme coin domain and emphasizes its growing importance in the broader crypto space. Ever wondered how meme coins compete on important metrics? 📊Dive into our latest infographic where we break down the performance of 6 popular meme coins, analyzing holder profits and whale concentration.#Dogecoin #Pepe #LEASH #SHIB #FLOKI #ELON pic.twitter.com/Di5vbyo3PZ — IntoTheBlock (@intotheblock) September 8, 2023 The analysis, which took into account the top six meme coins including Dogecoin (DOGE), Pepe (PEPE), Doge Killer (LEASH), Dogelon Mars (ELON), Shiba Inu (SHIB), and Floki (FLOKI), positioned PEPE and LEASH in second and third places, with 21% and 19% of their holders respectively turning a profit. Whale Concentrations And Other Tokens In addition to highlighting profitability, the study delved into the concentration of whales within these meme coins. Interestingly, 44% of Dogecoin tokens are held by whale accounts, while nearly half of the PEPE tokens (49%) are whale-owned. The report also shows that whale concentration for LEASH rests at 42%. Dogelon Mars and Shiba Inu, although popular names in the meme coin sphere, are fourth and fifth in terms of holder profitability, with 14% and 11%, respectively. Floki, on the other hand, sees 10% of its holders in profit with a 59% whale concentration, indicating the large players&#8217; influence in the meme coin market. Notably, whale concentrations can significantly impact the price movements of cryptocurrencies, making large holders create substantial market swings just with their trading decisions. Related Reading: Dogecoin Price Analysis: Is It Clawing Its Way Out Of The ‘Crab Market’? Furthermore, while Dogecoin has put roughly 44% of its holders in profit, the meme coin has not been exempt from the market&#8217;s volatile swings. In the past month alone, DOGE has seen a more than 16% decline. It took a dip from its previous high of $0.77 to a low of $0.62, at the time of writing. Dogecoin (DOGE) price is moving sideways on the 4-hour chart. Source: DOGE/USDT on TradingView.com In addition, despite the market downtrend, DOGE&#8217;s trading activity has surged. The daily trading volume for the meme coin currently stands at $201 million, a considerable increase from the $128 million recorded late last month. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-08T19:00:11.000Z",
    "title": "Best Meme Coins of 2023 | Analyzing the Top Meme Coins and New Cryptocurrencies to Buy Now",
    "url": "https://www.crypto-news-flash.com/best-meme-coins-of-2023-analyzing-the-top-meme-coins-and-new-cryptocurrencies-to-buy-now/?utm_source=rss&utm_medium=rss&utm_campaign=best-meme-coins-of-2023-analyzing-the-top-meme-coins-and-new-cryptocurrencies-to-buy-now",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-59.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-59.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-59-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Embark on a captivating journey into the meme coin universe, where viral tokens steal the show and defy the status quo. This guide, meticulously crafted with insights from crypto analysts and thorough trending crypto market news and data, caters to both adept crypto enthusiasts and eager newcomers. Venture into the heart of meme coin trends, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-08T21:00:00.000Z",
    "title": "‘$100 Price Target For Solana (SOL),’ Projects Crypto Influencer",
    "url": "https://coinedition.com/100-price-target-for-solana-sol-projects-crypto-influencer/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Analyzing-the-Potential-Solana-price.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Analyzing-the-Potential-Solana-price.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Analyzing-the-Potential-Solana-price-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Analyzing-the-Potential-Solana-price-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Analyzing-the-Potential-Solana-price-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Analyzing-the-Potential-Solana-price-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Analyzing-the-Potential-Solana-price-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The decline in key network metrics of Solana may present an investment opportunity. A crypto influencer recently projected a $100 target for SOL, which would mark a 410% hike. The influencer cited Solana’s recent collaborations with Shopify, Visa, and MakerDAO as potential catalysts for SOL. Solana (SOL) may witness a 410% hike to soar all [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/100-price-target-for-solana-sol-projects-crypto-influencer/\">‘$100 Price Target For Solana (SOL),’ Projects Crypto Influencer</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-08T20:00:52.000Z",
    "title": "New BRICS Member Saudi Arabia Poses Massive Threat to US Dollar’s Reign As Global Reserve Currency: Ron Paul",
    "url": "https://dailyhodl.com/2023/09/08/new-brics-member-saudi-arabia-poses-massive-threat-to-us-dollars-reign-as-global-reserve-currency-ron-paul/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/brics-currency-saudi.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/brics-currency-saudi.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/brics-currency-saudi.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/brics-currency-saudi.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/brics-currency-saudi.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/brics-currency-saudi.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/brics-currency-saudi.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Former US Congressman Ron Paul says a new member of the global economic alliance known as BRICS poses a serious threat to the US dollar&#8217;s hegemony. In a new blog post, Paul says BRICS was created to challenge the economic and political dominance of the United States. The former US representative specifically mentions Saudi Arabia, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/08/new-brics-member-saudi-arabia-poses-massive-threat-to-us-dollars-reign-as-global-reserve-currency-ron-paul/\">New BRICS Member Saudi Arabia Poses Massive Threat to US Dollar’s Reign As Global Reserve Currency: Ron Paul</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-08T19:55:22.000Z",
    "title": "Bloomberg Analyst Issues Bitcoin Alert, Says BTC Correction Is ‘Telling Us Something’ – Here’s His Outlook",
    "url": "https://dailyhodl.com/2023/09/08/bloomberg-analyst-issues-bitcoin-alert-says-btc-correction-is-telling-us-something-heres-his-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/issues-says-recent-correction.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/issues-says-recent-correction.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/issues-says-recent-correction.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/issues-says-recent-correction.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/issues-says-recent-correction.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/issues-says-recent-correction.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/issues-says-recent-correction.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bloomberg Intelligence senior macro strategist Mike McGlone just issued an alert to investors, warning that Bitcoin’s (BTC) latest correction may hint at what&#8217;s coming next. McGlone tells his 60,000 followers on the social media platform X that crypto&#8217;s rise to prominence in a time of zero interest rates could spell trouble for the nascent industry [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/08/bloomberg-analyst-issues-bitcoin-alert-says-btc-correction-is-telling-us-something-heres-his-outlook/\">Bloomberg Analyst Issues Bitcoin Alert, Says BTC Correction Is ‘Telling Us Something’ – Here’s His Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-08T19:55:03.000Z",
    "title": "Crypto Analyst Breaks Down the Momentum Driving a  ‘Massive Breakout’ for Altcoins",
    "url": "https://dailyhodl.com/2023/09/08/crypto-analyst-breaks-down-the-momentum-driving-a-massive-breakout-for-altcoins/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/Gaining-Massive-Popularity-crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/Gaining-Massive-Popularity-crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/Gaining-Massive-Popularity-crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/Gaining-Massive-Popularity-crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/Gaining-Massive-Popularity-crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/Gaining-Massive-Popularity-crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/Gaining-Massive-Popularity-crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is diving into why some altcoins are defying the overall market downturn and breaking out against the trend. Crypto trader Michaël van de Poppe tells his 666,600 followers on the social media platform X that some altcoins have even gone &#8220;3x&#8221; during the market tumble. &#8220;Massive breakouts on altcoins as some are [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/08/crypto-analyst-breaks-down-the-momentum-driving-a-massive-breakout-for-altcoins/\">Crypto Analyst Breaks Down the Momentum Driving a  ‘Massive Breakout’ for Altcoins</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-08T18:45:35.000Z",
    "title": "U.S. Treasury and IRS Propose New Rules That Broaden Client Information Crypto Businesses Are Required To File",
    "url": "https://dailyhodl.com/2023/09/08/u-s-treasury-and-irs-propose-new-rules-that-broaden-client-information-crypto-businesses-are-required-to-file/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/irs-propose-client-file.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/irs-propose-client-file.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/irs-propose-client-file.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/irs-propose-client-file.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/irs-propose-client-file.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/irs-propose-client-file.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/irs-propose-client-file.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Treasury Department and Internal Revenue Service just published a proposal that would set new guidelines on what crypto brokers must report for digital asset sales and exchanges. Under the new rules, the term &#8220;crypto brokers&#8221; will include crypto trading platforms, digital asset payment processors, certain digital asset-hosted wallet providers and persons who regularly [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/08/u-s-treasury-and-irs-propose-new-rules-that-broaden-client-information-crypto-businesses-are-required-to-file/\">U.S. Treasury and IRS Propose New Rules That Broaden Client Information Crypto Businesses Are Required To File</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-08T18:41:25.000Z",
    "title": "Court Hands 11,196-Year Prison Sentence to CEO of Exchange That Collapsed With $2,000,000,000+ in Crypto: Report",
    "url": "https://dailyhodl.com/2023/09/08/court-hands-11196-year-prison-sentence-to-ceo-of-exchange-that-collapsed-with-2000000000-in-crypto-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/09/crypto-hedge-founder-sentenced.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/09/crypto-hedge-founder-sentenced.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/09/crypto-hedge-founder-sentenced.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/09/crypto-hedge-founder-sentenced.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/09/crypto-hedge-founder-sentenced.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/09/crypto-hedge-founder-sentenced.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/09/crypto-hedge-founder-sentenced.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The chief executive of a collapsed crypto exchange has reportedly been handed a staggering prison sentence of over 11,000 years. According to a new report by Euronews, Faruk Özer, the CEO of Istanbul-based crypto exchange Thodex, has been given 11,196 years in jail for stealing $2 billion worth of crypto assets from customers. Thodex suddenly [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/08/court-hands-11196-year-prison-sentence-to-ceo-of-exchange-that-collapsed-with-2000000000-in-crypto-report/\">Court Hands 11,196-Year Prison Sentence to CEO of Exchange That Collapsed With $2,000,000,000+ in Crypto: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]