[
  {
    "source": "Decrypt",
    "date": "2023-11-07T00:05:30.000Z",
    "title": "NFT Traders Respond to 'Simpsons' Roasting by Spending Millions on Knockoff Collectibles",
    "url": "https://decrypt.co/204558/nft-traders-respond-simpsons-roasting-spending-millions-knockoff-collectibles",
    "description": "The Simpsons-themed NFT projects surged on Monday after the seminal sitcom bashed digital collectibles in the latest episode."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-06T23:52:12.000Z",
    "title": "The Good, the Bad, and the Ugly of Grok, Elon Musk's New AI Chatbot",
    "url": "https://decrypt.co/204584/the-good-the-bad-and-the-ugly-of-grok-elon-musks-new-ai-chatbot",
    "description": "Is Elon Musk's latest tech marvel just another chatbot in the AI crowd?"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-06T23:41:49.000Z",
    "title": "6 Questions for Lugui Tillier about Bitcoin, Ordinals, and the future of crypto",
    "url": "https://cointelegraph.com/magazine/6-questions-for-lugui-tillier-about-bitcoin-ordinals-and-the-future-of-crypto/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/10/Lugui-Tillier.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Lugui Tillier talked to us about his job as the sales chief for crypto firm Lumx in Rio de Janeiro — and his thoughts on the future of crypto.</p>\n                    <p><p><strong>Lugui Tillier is the sales manager for Lumx Studios, one of the top cryptocurrency firms in Rio de Janeiro  a city with a burgeoning crypto industry.</strong></p><p>But for Tillier  who holds dual citizenship between Belgium and Brazil  cryptocurrency is more than a job. It was a passion sparked by a friend, and it evolved into his first full-time crypto job with Lumx in 2021.</p><h2 class=\"wp-block-heading\" id=\"h-1-how-did-you-get-into-crypto\">1) <strong>How did you get into crypto?</strong></h2><p>I was very fortunate because the father of one of my closest friends was the one who founded the first crypto firm here in Brazil in 2016  BLP Crypto. Before that, he was always talking to me about crypto and blockchain, telling me it was the future and that I should learn more about it. So around 2019, I finally listened to him and started studying Bitcoin. I started working for Lumx in 2021.</p><h2 class=\"wp-block-heading\" id=\"h-2-tell-us-about-lumx-and-what-you-do-for-them\">2) <strong>Tell us about Lumx and what you do for them.</strong></h2><p>We are a blockchain abstraction solution for big enterprises. We help anyone who wants to integrate blockchain into their business, or companies that want to deploy projects or experiment on blockchain. We do things like payment solutions and decentralized identity (DID) solutions.</p><p>Big companies can mostly focus only on their own applications  not on hiring blockchain engineers or learning about blockchain technology and infrastructure, which is still complex. So we enable those big companies to work and test safely. Im the manager of sales for Lumx, so I’m the one responsible for building and maintaining relationships with blockchains and protocols.</p><h2 class=\"wp-block-heading\" id=\"h-3-do-you-invest-in-crypto-yourself-what-do-you-take-the-most-interest-in-right-now\">3) <strong>Do you invest in crypto yourself? What do you take the most interest in right now?</strong></h2><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Lugui-Tillier-1.jpg\" alt=\"Lugui Tillier\" class=\"wp-image-25260\" width=\"312\" height=\"232\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Lugui-Tillier-1.jpg 788w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Lugui-Tillier-1-300x223.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Lugui-Tillier-1-770x573.jpg 770w\" sizes=\"(max-width: 312px) 100vw, 312px\" /><figcaption class=\"wp-element-caption\"><em>Lugui Tillier at the Savvy Brain Academy in Tanzania, a school he began donating to in 2017 using Bitcoin. Source: Lugui Tillier</em></figcaption></figure><p>I’m investing a lot in layer 2s. (I like Polygon, Arbitrum, and ZK solutions  such as ZK-Sync and Linea.) In the last cycle, we saw a lot of projects start on Ethereum, and that was unsustainable. We were paying $50 (or more) per transaction. There were days that we had gas wars, and people were paying almost six Ethereum per transaction.</p><p>I still don’t know if there was just a lack of knowledge that you could build stuff on a layer 2 among new projects and companies at the time. But people wanted to have exposure to Ethereum, so stuff that should have been happening on layer 2s was happening on Ethereum.</p><p>Liquidity is flowing to layer 2s now, so layer 2s are more prepared for the next wave.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/what-the-hell-is-web3-anyway/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>What the hell is Web3 anyway?</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/united-states-congress-bringing-partisan-politics-to-crypto/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Lines in the sand: US Congress is bringing partisan politics to crypto</p>                        </a>                    </div></div></div><p>I also really like Bitcoin Ordinals and Ordinal Maxi Biz (OMB). We’re having an explosion of nonfungible tokens (NFTs) being built on Bitcoin, the biggest blockchain in the world. Being able to trade and express culture  it’s really amazing. That’s why I really like Ordinals.</p><p>I believe that Ordinals will perhaps capture the most of this new culture and way of expressing everything on Bitcoin. Ordinals help to express the core values of Bitcoin in a much more friendly way than Bitcoin, which is too technical or harsh for some people.</p><h2 class=\"wp-block-heading\" id=\"h-4-where-do-you-see-bitcoin-and-ethereum-in-10-years\">4) <strong>Where do you see Bitcoin and Ethereum in 10 years?</strong></h2><p>I think I see Bitcoin and Ethereum as the main consensus platforms in the world. This is curious, because nowadays it’s rare to see Bitcoin as a platform. We already see Ethereum as a platform where you have other applications and layers to build around it. Because of the advancements of some protocols  like Taproot Assets and Ordinals  I see Bitcoin venturing into a new era.</p><p><em><strong>Related: <a href=\"https://cointelegraph.com/news/bitcoin-fragments-more-valuable-than-full-bitcoins\" target=\"_blank\" rel=\"nofollow\" >Bitcoin fragments could become more valuable than full Bitcoins</a></strong></em></p><p>Besides being a currency to pay for stuff, or a store of value, you will be able to store other currencies on it. Bitcoin is moving from an era where it’s been an asset to an era where it will be a platform for storing and trading other assets.</p><h2 class=\"wp-block-heading\" id=\"h-5-what-is-the-main-hurdle-to-mass-adoption-of-blockchain-technology\">5) <strong>What is the main hurdle to mass adoption of blockchain technology?</strong></h2><figure class=\"wp-block-image alignleft size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Lugui-Tillier.jpg\" alt=\"Lugui Tillier\" class=\"wp-image-25257\" width=\"443\" height=\"296\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Lugui-Tillier.jpg 844w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Lugui-Tillier-300x200.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/Lugui-Tillier-770x515.jpg 770w\" sizes=\"(max-width: 443px) 100vw, 443px\" /><figcaption class=\"wp-element-caption\"><em>Lugui Tillier (second from right) in 2022 speaking at NFC Brasil, one of the main Web3 events in Latin America, where he shared his experience of working with traditional companies in Web3. Source: Lugui Tillier</em></figcaption></figure><p>Even though we have made significant progress, blockchain is still composed of complex infrastructure. It’s complicated not just for end-users, but also for traditional companies that want to work with it. I often joke that you only realize how complex MetaMask is when you try to teach your father how to use it  hence the importance of the emerging abstraction solutions.</p><p>While these solutions may slightly compromise decentralization, they preserve a blockchain’s programmability and automation and significantly lower the barrier to entry. This is crucial because now we have a second option. People can stay 100% decentralized if they prefer it, but for those who do not, they have the option of adopting a semi-decentralized model, which is the missing link to mainstream adoption.</p><h2 class=\"wp-block-heading\" id=\"h-6-what-do-you-do-in-your-free-time\">6) <strong>What do you do in your free time?</strong></h2><p>I really like to study philosophy, especially stoicism. Everyone who works or lives in this crypto world is exposed to a lot of volatility, and theyre used to a lot of dopamine and incentives. I like stuff that you are not able to control, so I like the stoic philosophy. The mantra of stoicism is to cultivate different stuff that you are not able to control. When you master this, you are able to live in peace in this crazy crypto world. So it’s one of my favorite subjects  not only for my personal life, but also for my professional life.</p><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.7\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-11-06T23:41:49.000Z",
    "title": "6 Questions for Lugui Tillier about Bitcoin, Ordinals, and the future of crypto",
    "url": "https://cointelegraph.com/magazine/6-questions-for-lugui-tillier-about-bitcoin-ordinals-and-the-future-of-crypto/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/10/Lugui-Tillier.jpg\"></p><p>Lugui Tillier talked to us about his job as the sales chief for crypto firm Lumx in Rio de Janeiro — and his thoughts on the future of crypto.</p>\n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-06T23:41:00.000Z",
    "title": "Decentralized Exchange’s Native Token Surges Over 90% After Launching Position Manager Tool",
    "url": "https://www.cryptoglobe.com/latest/2023/11/decentralized-exchanges-native-token-surges-over-90-after-launching-position-manager-tool/",
    "description": "Popular decentralized cryptocurrency exchange PancakeSwap has seen the price of its native $CAKE token surge by over 90% over the past week after rolling out a new position manager tool, which it describes as a tool “designed to enhance the user experience for liquidity providers.” The new feature, designed in partnership with decentralized finance protocol […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-07T00:00:15.000Z",
    "title": "Ethereum Layer-2 Booming: Will Gas Fees Drop Even In A Bull Market?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-layer-2-booming-will-gas-fees-drop-even-in-a-bull-market/",
    "description": "The adoption of Ethereum layer-2s is on the rise if Token Terminal data shared on November 6 is anything to go by. According to statistics from the blockchain analytics platform shared by Erik Smith, the Chief Investment Officer (CIO) of 401 Financial, the average active addresses over the past three months has exceeded 10 million, a nearly 2X expansion from early 2023. Related Reading: Can The ADA Price Climb Above $20 In The Bull Market? Analyst Provides Answers Ethereum Layer-2s Finding More Adoption Looking at the chart, Polygon, an Ethereum sidechain, remains the most popular. At the same time, Arbitrum and OP Mainnet, which are common layer-2s adopting the roll-up technology, are actively being used. Even so, OP Mainnet&#8217;s share is gradually dropping. Base, a layer-2 backed by Coinbase, and StarkNet are also finding adoption, expanding their share over the past three months. In crypto, active addresses refer to the number of unique wallet addresses (sending and receiving) that have interacted with the blockchain, in this case, Ethereum, over a given period. An uptick or contraction in the number of active addresses can be used to measure sentiment and the level of uptake. In bear markets, active addresses tend to drop, only rising when bulls flow in, pointing to a possible scramble for arising opportunities. The recent uptrend coincides with the rapid expansion of leading crypto prices. Ethereum (ETH) prices are inching closer to the $1,870 resistance level, with a breakout above this line a potential trigger for a leg up that might see the coin retest $2,100 and even register new 2023 highs. Usually, rising crypto prices tend to revive demand as the number of active addresses and, in some instances, the total value locked (TVL) in decentralized finance (DeFi), and more. What Will Happen To Gas Fees? Ethereum is the world&#8217;s most active smart contract platform, stretching its dominance mainly because of its first-mover advantage. The blockchain anchors more DeFi, non-fungible tokens (NFTs), and gaming activity. Deploying protocols, depending on their objectives, can either directly launch on the mainnet or layer-2s.  The mainnet is directly secured by validators, while layer-2 solutions depend on the mainnet for security but often re-route transactions off-chain. In this arrangement, more transactions can be processed cheaply and efficiently, relieving the mainnet. Though the Ethereum base layer is secure, its peak transaction throughput remains relatively lower at around 15 TPS. This means during peak demand, gas fees tend to be higher, impacting user demand. Still, Ethereum gas fees remain at a multi-year low at around 23 Gwei, according to trackers, as seen on the chart below. This is down from 240 Gwei recorded in February 2021 when crypto assets rapidly rose. For now, whether gas fees will increase as the market recovers is yet to be seen. What&#8217;s evident is that as users opt for layer-2s, the mainnet will likely be relieved, keeping gas fee fluctuation low. Related Reading: Bitcoin Has Just Cleared A Level That Historically Lead To Rallies Of 99%+ Feature image from Canva, chart from TradingView"
  }
]