[
  {
    "source": "Crypto Briefing",
    "date": "2024-01-04T22:25:53.000Z",
    "title": "SEI Network hits all-time high, memecoin SEIYAN leads with 380% surge",
    "url": "https://cryptobriefing.com/sei-network-hits-all-time-high-memecoin-seiyan-leads-with-380-surge/?utm_source=feed&utm_medium=rss",
    "description": "SEI ecosystem sees robust growth with SEILOR token up 80%, and astroport leading in application market value."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T22:34:46.000Z",
    "title": "Valkyrie files SEC securities registration for Bitcoin ETF",
    "url": "https://www.cryptopolitan.com/valkyrie-sec-securities-registration-btc-etf/",
    "description": "Valkyrie Investments has boldly stepped into the spotlight by officially registering with the U.S. Securities and Exchange Commission (SEC) for its much-anticipated Spot Bitcoin ETF. This strategic move places Valkyrie among the vanguard of financial entities, including the likes of Fidelity, Grayscale, and VanEck, all pursuing similar aspirations in the dynamic world of cryptocurrency ETFs. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T22:19:41.000Z",
    "title": "Coinbase introduces New Compliance Measures for UK users",
    "url": "https://www.cryptopolitan.com/coinbase-new-measures-for-uk-users/",
    "description": "Coinbase has mandated that its UK users undertake a new compliance process. This measure is a direct response to the Financial Conduct Authority&#8217;s (FCA) impending financial promotions regulations, set to come into effect on January 8. The exchange has communicated through emails that users must identify their investor type and complete a risk assessment form. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T22:14:23.000Z",
    "title": "Binance releases monthly market insights for January 2024 – Here are the details",
    "url": "https://www.cryptopolitan.com/binance-monthly-market-insights-for-jan-2024/",
    "description": "As we step into the new year, Binance, the leading global cryptocurrency exchange,&#160; has presented its eagerly awaited Monthly Market Insights for January 2024. This comprehensive report delves into the latest trends, noteworthy developments, and key indicators shaping the cryptocurrency landscape.&#160; Whether you&#8217;re a seasoned trader, a crypto enthusiast, or someone looking to stay informed [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-04T22:30:15.000Z",
    "title": "Whale Investors Hold Strong As $LDO Achieves Annual Peak At $3.46",
    "url": "https://nulltx.com/whale-investors-hold-strong-as-ldo-achieves-annual-peak-at-3-46/",
    "description": "$LDO, the native token of the prominent liquid staking platform Lido DAO, has been on an impressive upward trajectory, surging by 15% within a week to reach its yearly high at $3.46. Lido DAO, known for its liquidity staking protocol, offers Ethereum holders the ability to stake their assets in a [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-04T22:13:35.000Z",
    "title": "Surge In Digital Asset Inflows In 2023; Significant Increase Despite Lower Than Previous Years",
    "url": "https://nulltx.com/surge-in-digital-asset-inflows-in-2023-significant-increase-despite-lower-than-previous-years/",
    "description": "Data from 2023 indicates a substantial influx of $2.25 billion into digital asset investment products, marking it as the third-highest year since 2017. While 2020 and 2021 outpaced 2023 with $6.6 billion and $10.7 billion, respectively, the recent surge signifies a noteworthy recovery from the lower inflows observed in 2022, [&#8230;]"
  }
]