[
  {
    "source": "CoinDesk",
    "date": "2023-08-14T17:49:10.000Z",
    "title": "HBAR Rallies on FedNow Addition of Hedera-Based Dropp",
    "url": "https://www.coindesk.com/markets/2023/08/14/hbar-rallies-on-fednow-addition-of-hedera-based-dropp/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The token has now rallied nearly 50% over the past two months."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-14T17:43:42.000Z",
    "title": "Bitcoin Miner Hut 8 Shares Plummet 8% After Disappointing Q2 Revenue Figures",
    "url": "https://decrypt.co/152455/bitcoin-miner-hut-8-shares-down-58-percent-after-disappointing-quarter",
    "description": "Since last year, Hut 8 has been squeezed between operational issues and rising Bitcoin network difficulty."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-14T18:00:00.000Z",
    "title": "Bitcoin Frontier Fund launches accelerator program for Ordinals startups",
    "url": "https://cointelegraph.com/news/bitcoin-frontier-fund-launches-accelerator-program-for-ordinals-startups",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/3c43f69a-15ad-412f-b0c0-af558f28e368.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The program will provide seed money, mentoring, and support to approved applicants.</p>\n                    <p><p>Bitcoin Frontier Fund, formerly Stacks Ventures, launched what it’s calling the first Bitcoin Ordinals accelerator program on August 14.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Program Information<br><br>This program is led by VC <a href=\"https://twitter.com/TO?ref_src=twsrc%5Etfw\">@TO</a> &amp; is a 4-month program for builders to raise funding, connect with mentors, &amp; be guided by the best in the industry (sneak peak below).<br><br>It will help with co-founder relationships, mentors &amp; advisors, fundraising &amp; pitching. <a href=\"https://t.co/MSykk2l7Dl\">pic.twitter.com/MSykk2l7Dl</a></p>&mdash; Bitcoin Frontier Fund (@BTCFrontierFund) <a href=\"https://twitter.com/BTCFrontierFund/status/1691094939810344962?ref_src=twsrc%5Etfw\">August 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the program’s website, Bitcoin Frontier Fund is <a href=\"https://www.btcfrontier.fund/ordinals\" target=\"_blank\" rel=\"noopener nofollow\">offering</a> the seed money to startups innovating in the Ordinals space along with access to funding pipelines and mentorship:</p><blockquote>“We offer $100k in investment and a badass program and community to take your startup to the next level, in exchange for 2-3% equity in common shares.”</blockquote><p>Startups with no “substantial funding” will be required to sign over a 3% equity share in order to receive the funds and join the program. Those who’ve already secured funding in the amount of $600k or more within the previous six months will only need to sign over a 2% share.</p><p>While the exact requirements for acceptance into the program are unclear, the website lists several areas of interest including infrastructure, proven web3 use cases, developer tools, and accessibility. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-ordinals-non-profit-open-ordinals-institute\"><strong><em>Bitcoin Ordinals team launches nonprofit to grow protocol development</em></strong></a></p><p>Ordinals are a relatively new development for blockchain and cryptocurrency. They were <a href=\"https://rodarmor.com/blog/ordinal-theory/\" target=\"_blank\" rel=\"noopener nofollow\">created</a> by Bitcoin developer Casey Rodarmor in January of 2023.</p><p>Essentially, Ordinals are just inscriptions made on individual units of a digital asset. If you imagine a painter creating limited edition lithograph prints of a famous piece and then numbering them, you can wrap your head around ordinals.</p><p>Typically, the lowest numbers would have more perceived value by collectors even though the prints are considered exactly the same. Adding to this collectibility is the fact that data can be “inscribed” or stored within a Bitcoin ordinal, making it function a bit like a non-fungible-token. </p><p>Bitcoin ordinals are made up of Satoshis, the smallest digital asset on the Bitcoin blockchain. They can be inscribed with up to 4MB of data. This makes it possible to embed text and images in each ordinal. </p><p>Despite having only existed since the end of January, 2023, Ordinals have had a major impact on the blockchain and cryptocurrency communities. </p><p>Among the tech’s supporters is Ethereum creator Vitalik Buterin, who recently said “Ordinals <a href=\"https://cointelegraph.com/news/vitalik-buterin-ordinals-revived-developers-on-bitcoin\">have revived ‘builder culture’</a> on Bitcoin.” Many other members of the community, however, have expressed concerns over what’s being perceived as <a href=\"https://cointelegraph.com/news/bitcoin-has-entered-a-civil-war-over-art\">a civil war</a> between those who believe Ordinals are harmful to the Bitcoin network and its spirit, and those who see it as an innovative evolution of existing technology.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-14T18:00:47.000Z",
    "title": "Here’s Why This Former SEC Lawyer Thinks A Spot Bitcoin ETF Isn’t Coming",
    "url": "https://www.newsbtc.com/bitcoin-news/former-sec-lawyer-spot-bitcoin-etf/",
    "description": "Recent comments from former SEC Attorney John Reed Stark have further dampened optimism about the regulator approving any of the pending Spot Bitcoin ETF applications. Spot Bitcoin ETF Approval Looking More Unlikely The United States Securities and Exchange Commission (SEC) has continuously denied applications for a Spot Bitcoin ETF, and Stark has suggested that this trend isn’t going to change anytime soon as the SEC will likely deny all the pending applications due to several “compelling reasons.” While aligning his opinion with that of Better Markets, Stark stated that the arguments laid forward in the nonprofit’s letters to the SEC “brilliantly” highlighted why the SEC would not approve any of these applications. Related Reading: Want A Bitcoin Spot ETF? Then Prove BTC Is Not Manipulated, Says SEC Better Markets had, in two separate letters (here and here) dated August 8, laid out arguments why the SEC should reject the proposed rule changes by the Cboe BZX Exchange and the Nasdaq Stock Market “to list and trade shares in Spot bitcoin-based exchange-traded products (ETP).”  According to them, the Spot Bitcoin market is known to show inflated trading volumes due to illicit practices like market manipulation and wash trading. They argue that the markets are highly concentrated and Bitcoin’s network is maintained by a “select group of individuals and entities.” All this makes any proposed Spot Bitcoin ETP susceptible to manipulation by “bad actors” and puts investors and the public interest at risk.  In their applications, these exchanges stated that CME Bitcoin futures, a regulated market of significant size, could provide the necessary data and insights relating to any fraud and manipulation in the Spot Bitcoin ETF market. Additionally, they had entered into a surveillance-sharing agreement with Coinbase as an extra measure to prevent fraud and market manipulation. However, Better Market has labeled these measures as “wholly inadequate.” They argue that the CME Bitcoin futures market is not a “regulated market of significant size” and the surveillance-sharing agreement with Coinbase is insufficient to prevent market manipulation. BTC remains weak as market awaits SEC decision &#124; Source: BTCUSD on Tradingview.com Is Crypto Regulation Now Political? Stark believes that the “crypto-regulatory tides could shift exponentially” once the US 2024 elections take place. He noted the political divide regarding crypto and how this has also played out in the SEC’s clampdown on the crypto industry.  Related Reading: Bitcoin-Friendly Javier Milei Wins Presidential Primaries In Argentina The SEC has been known to come on hard at several crypto firms, including two of the world’s largest crypto exchanges, Binance and Coinbase, accusing them of securities violations. However, Stark predicts that the SEC will abandon this crypto-enforcement effort and focus more on mostly fraud cases should a Republican get elected as President next year. Although the elections are slated for November 2024 (long after the SEC might have decided on the pending Spot Bitcoin ETF applications), Stark has forecasted that a GOP-led administration could bring about the approval of a Spot Bitcoin ETF.  Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-14T18:00:11.000Z",
    "title": "Crypto Expert Forecasts Possible Price Hikes for Bitcoin (BTC), DigiToads (TOADS) and Filecoin (FIL)",
    "url": "https://www.crypto-news-flash.com/crypto-expert-forecasts-possible-price-hikes-for-bitcoin-btc-digitoads-toads-and-filecoin-fil/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-expert-forecasts-possible-price-hikes-for-bitcoin-btc-digitoads-toads-and-filecoin-fil",
    "description": "<img width=\"512\" height=\"237\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-30.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-30.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-30-300x139.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Crypto expert Michaël van de Poppe has forecast possible price hikes for Bitcoin (BTC) and Filecoin (FIL) in the coming months. Van de Poppe, who has over 600,000 followers on Twitter, said in a recent tweet that he expects Bitcoin to reach $28,000 by the end of August and $35,000 by the end of September. [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-14T18:05:59.000Z",
    "title": "Bloomberg Strategist Says Greatest Rug Pull of Liquidity Ever Pushing US Into Recession and Bitcoin Into Correction",
    "url": "https://dailyhodl.com/2023/08/14/bloomberg-strategist-says-greatest-rug-pull-of-liquidity-ever-pushing-us-into-recession-and-bitcoin-into-correction/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Wire-Money-to-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Wire-Money-to-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Wire-Money-to-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Wire-Money-to-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Wire-Money-to-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Wire-Money-to-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Wire-Money-to-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bloomberg Intelligence’s senior macro strategist Mike McGlone says that a liquidity crunch will soon push the economy into a recession and cause a Bitcoin (BTC) correction. In a new interview with crypto influencer Scott Melker, McGlone predicts that the Federal Reserve will remain hawkish at least for the rest of 2023 to draw down inflation [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/14/bloomberg-strategist-says-greatest-rug-pull-of-liquidity-ever-pushing-us-into-recession-and-bitcoin-into-correction/\">Bloomberg Strategist Says Greatest Rug Pull of Liquidity Ever Pushing US Into Recession and Bitcoin Into Correction</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]