[
  {
    "source": "CoinDesk",
    "date": "2024-02-12T14:04:45.000Z",
    "title": "Protocol Village: Lit Protocol, for Identity-Based Encryption, Launches 'Litv0' ",
    "url": "https://www.coindesk.com/tech/2024/02/08/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Feb. 8-14."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-12T13:59:00.000Z",
    "title": " Controversial UK legislation creates ‘positive frictions’ for crypto users ",
    "url": "https://cointelegraph.com/news/uk-legislation-new-rules-crypto-users-exchanges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYmYyMTA3YWYtYTA2YS00Yzg2LTljN2MtOWVjYmZkODI5YzVhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Users of some crypto exchanges based in the United Kingdom now need to pass a quiz to trade Bitcoin.</p>\n                    <p><p data-ct-non-breakable=\"true\">New financial regulations from the United Kingdom’s Financial Conduct Authority (FCA) are creating what the agency calls “positive frictions” for U.K. users as part of its financial promotions legislation. </p><p>According to the FCA, “positive frictions” are measures that counter “social and emotional pressures to invest.” Customers must now declare whether they are high-net-worth or restricted investors and then answer a series of questions designed to assess their competency.</p><p>The FCA legislation also makes it harder for existing crypto users to continue trading, even if they have years of experience in the field. </p><p><a href=\"https://cointelegraph.com/news/uk-legislation-new-rules-crypto-users-exchanges\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-12T14:00:41.000Z",
    "title": "SafeMoon SFM token drops 6% following $11 million liquidity drain",
    "url": "https://cryptoslate.com/safemoon-sfm-token-drops-6-following-11-million-liquidity-drain/",
    "description": "<p>More than $11 million worth of digital assets were removed as liquidity from various pools of the controversial crypto project SafeMoon, according to blockchain security firm Cyvers Alert. Following the news, SafeMoon&#8217;s SFM token fell 6% to $0.00003134 as of press time, according to CryptoSlate&#8217;s data. Liquidity removed In a Feb. 12 post on social [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/safemoon-sfm-token-drops-6-following-11-million-liquidity-drain/\">SafeMoon SFM token drops 6% following $11 million liquidity drain</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-12T13:50:12.000Z",
    "title": "Divergent performances highlight resilience and challenges for Bitcoin ETFs and equities",
    "url": "https://cryptoslate.com/insights/divergent-performances-highlight-resilience-and-challenges-for-bitcoin-etfs-and-equities/",
    "description": "<p>Quick Take Since the approval of Bitcoin ETFs on Jan. 11, the price performance of the digital asset has illustrated an unpredictable pattern, peaking around $49,000 before dipping below $40,000. As of now, Bitcoin hovers around $48,000. This volatile behavior extends to crypto equities and Bitcoin ETFs, which have displayed divergent performances. Bitcoin-related mining stocks [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/divergent-performances-highlight-resilience-and-challenges-for-bitcoin-etfs-and-equities/\">Divergent performances highlight resilience and challenges for Bitcoin ETFs and equities</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-12T13:55:17.000Z",
    "title": "Is this the time to buy high-potential GameFi cryptos?",
    "url": "https://cryptodaily.co.uk/2024/02/is-this-the-time-to-buy-high-potential-gamefi-cryptos",
    "description": "With bitcoin threatening its yearly high, and the whole of the altcoin space trending upward, is it time to stick a small bet on a couple of gaming cryptos? Beam (BEAM) and Phantasma (SOUL) are two possibilities."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-12T14:06:13.000Z",
    "title": "Square Enix Rules Out Final Fantasy 8 Remake Despite Fans’ Hopes",
    "url": "https://www.cryptopolitan.com/square-enix-rules-out-final-fantasy-8-remake-despite-fans-hopes/",
    "description": "In a recent interview with IGN, Square Enix&#8217;s Naoki Hamaguchi, director of Final Fantasy 6 Rebirth, confirmed that there are no plans for a Final Fantasy 8 Remake. This decision dashes the hopes of many fans who were anticipating a modern retelling of the classic RPG. The revelation comes amidst speculations surrounding the future of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-12T14:00:00.000Z",
    "title": "Ethereum Dencun Launches on Holesky Testnet, Prepares for Mainnet Launch; InQubeta Presale Jumps Past $9.2 Million",
    "url": "https://www.cryptopolitan.com/ethereum-dencun-launches-on-holesky-testnet-prepares-for-mainnet-launch-inqubeta-presale-jumps-past-9-2-million/",
    "description": "The SEC decision on Bitcoin ETFs, which saw 11 applications approved on January 10, continues to create a stir within the financial landscape. The recent JUP airdrop from Jupiter Exchange further adds to this excitement. At the same time—stirring up quite a buzz—Ethereum’s (ETH) upgrade Dencun launches on the Holesky Testnet, nearing its mainnet launch. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-12T13:53:15.000Z",
    "title": "Worldcoin Price Prediction 2024 – 2033: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin Price Prediction 2024-2033 Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-12T14:00:17.000Z",
    "title": "Top-Trader Picks Cardano As Bull Market Leader: Here’s Why",
    "url": "https://www.newsbtc.com/news/cardano/top-trader-picks-cardano-bull-market-leader/",
    "description": "In a post on X (formerly Twitter), acclaimed crypto trader Gert van Lagen has pinpointed Cardano (ADA) as the potential frontrunner of the ongoing bull market. His analysis leans heavily on Cardano&#8217;s foundational strengths compared to its rivals, Ethereum (ETH) and Solana (SOL). Why Cardano Is Van Lagen’s Top Pick Central to van Lagen&#8217;s argument is the concept of decentralization, where he posits Cardano as a model of &#8220;fundamental superiority.&#8221; He articulates, &#8220;Cardano stands out for its fundamental superiority over Ethereum and Solana, boasting greater decentralization and the notable absence of support from centralized entities like Gemini.&#8221; This statement not only underscores Cardano&#8217;s commitment to decentralization but also implicitly critiques the reliance of other blockchains on centralized support, suggesting a purer adherence to blockchain&#8217;s original ethos by Cardano. Related Reading: Cardano Bulls Come Out To Play: Buy Orders Dominate As ADA Price Soars Highlighting the critical importance of network reliability, van Lagen points to Solana&#8217;s vulnerability, marked by its &#8220;sporadic inexplicable network outages of a few hours.&#8221; He contrasts this with the inherent stability of the Cardano network, which he notes is &#8220;mathematically embedded in the Cardano ecosystem,&#8221; suggesting a foundation built on rigorous scientific principles and peer-reviewed research that underpins Cardano&#8217;s operations, enhancing its reliability and user trust. Van Lagen&#8217;s enthusiasm extends to Cardano&#8217;s Extended Unspent Transaction Output (EUTXO) model, which he believes is a game-changer for blockchain scalability and efficiency. He explains, &#8220;In this bullish market, my top bet is on Cardano, leveraging its EUTXO model to dramatically scale network capacity through TPT, not just TPS.&#8221; This approach, focusing on Transactions Per Transaction (TPT) rather than just Transactions Per Second (TPS), allows for a more nuanced and complex handling of transactions, enabling a multitude of operations within a single transaction. Related Reading: Cardano Founder Takes Jab At Solana After Major Outage Roy M. Avila&#8217;s article, referenced by van Lagen, delves deeper into the TPT concept, illustrating how it differentiates from the traditional account model by allowing for a diverse array of transactions to be processed simultaneously within a single transaction. This significantly reduces the need for sequential transaction processing, enabling greater throughput and efficiency. Technical Analysis For ADA Van Lagen shares his technical analysis of Cardano, identifying key patterns and indicators that bolster his bullish stance. At the end of January, noted in a post on X, &#8220;Looks very much like ADA, broken black downtrend through weekly closes. Clear double bottom setup below red horizontal &#8211;&#62; broken out, currently retesting.&#8221; This pattern suggests a strong reversal and potential for significant upward movement. He further elaborates on ADA&#8217;s price action, observing, “ADA [2W] &#8211; Compare Adam and Eve bottoms within 🟨 &#38; 🟥. Price has broken through the blue neckline and is on its way to the key resistance zone before ATH: $1.2-1.8. Conservative extension targets: $5-15. Invalidation EW-count: $0.17.” These insights provide a detailed roadmap for ADA&#8217;s potential price trajectory, highlighting both the bullish outlook and critical thresholds for invalidation. At press time, ADA traded at $0.5325. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-12T13:55:28.000Z",
    "title": "Jupiter Integrates SPL22 for Enhanced Token Swaps",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/jupiter-integrates-spl22-for-enhanced-token-swaps/",
    "description": "<p>SPL-22 updates the SPL token standard with faster transactions, lower costs, and a smoother, safer trading experience. With SPL-22 integration, Jupiter Swap leads DeFi platforms, allowing easy swaps between any SPL token and SPL2. Seamless SPL Token Swaps with SPL-22 Integration This integration is more than just a technical enhancement; it represents a significant leap [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/jupiter-integrates-spl22-for-enhanced-token-swaps/\">Jupiter Integrates SPL22 for Enhanced Token Swaps</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]