[
  {
    "source": "Decrypt",
    "date": "2023-07-13T10:54:53.000Z",
    "title": "Tron DAO To Kick Off Builder Tour In New York",
    "url": "https://decrypt.co/145205/tron-dao-to-kick-off-builder-tour-in-new-york",
    "description": "Would-be Tron developers are invited to board the “blockchain bullet train” at a series of hackathons across the United States."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-13T10:55:17.000Z",
    "title": "Crypto market wakes up following lower inflation figures",
    "url": "https://cryptodaily.co.uk/2023/07/crypto-market-wakes-up-following-lower-inflation-figures",
    "description": "<p>A very welcome downtick in US inflation to 3% in June has led to a rally in stocks. Today, the crypto market has woken up and is trending higher.</p>\nCrypto not moving on good inflation data?\n<p>A report in the India-based Business Standard somewhat jumped the gun. It accused the crypto market of standing still as stocks and bonds increased in value following the perceived good news in the June inflation figure of 3%.</p>\n<p>Based on what was seen as the crypto market not making hay while global markets were doing just that, an analyst who commented in the article went as far as to suggest that this was a &ldquo;bad sign&rdquo; and that bitcoin&rsquo;s odds of falling to $26,000 to $25,000 were increasing.</p>\nCrypto wakes up\n<p>Only one day later and crypto is painting a different story. Bitcoin suddenly shot out of its sideways slumber and is currently up 0.6%. It may be that it only increases to the top of the range at around $31,400 but the longer this accumulation phase lasts, the more explosive the resulting move is likely to be.</p>\n<p>USDT dominance has moved in the opposite direction which is probably only to be expected, and this has released the altcoins from their shackles of the last few days. Comparing the USDT dominance chart to Bitcoin shows the former to be on the brink of breaking down, while the latter is looking like breaking higher.</p>\n<p>The Total 3 chart, which includes all cryptocurrencies except bitcoin and ethereum, has just broken to the upside and is now under the next resistance at $334.5 billion. A break of this should lead to $345 billion and then potentially $352 billion.</p>\nDoJ bitcoin overhang\n<p>However, it&rsquo;s not all blue skies ahead for crypto by any means. The overhang of the US Justice Department selling its bitcoin can dent the market. News broke recently that the next batch of 9000 BTC has been transferred to a new address, perhaps being made ready to be sold.&nbsp;</p>\n<p>The last same-size batch to be sold hardly made an impression as the market swallowed it and recovered immediately. The impact of this latest tranche remains to be seen, with 3 further tranches still to be sold by the end of this year.</p>\nBitcoin and cryptocurrencies good long-term?\n<p>Whether bitcoin and crypto go up or down over the next few weeks and months is generally immaterial. The dire state of the dollar and all other fiat currencies, as they continue to heavily lose their purchasing power, is a major reason to have at least some of one&rsquo;s wealth in bitcoin. Cryptocurrencies are more speculative, but if it is accepted that they are bringing a huge technical revolution, not just to finance, but to many other areas of economic activity, then as things stand, this speculation may not be as risky as just holding fiat in the bank.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-13T11:00:25.000Z",
    "title": "Aurus: The Future of Precious Metals and Blockchain – Exclusive Hypergrowth Benefits",
    "url": "https://news.bitcoin.com/aurus-the-future-of-precious-metals-and-blockchain-exclusive-hypergrowth-benefits/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2023-07-12t182421-552-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2023-07-12t182421-552-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2023-07-12t182421-552-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2023-07-12t182421-552-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2023-07-12t182421-552-1536x864.png 1536w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2023-07-12t182421-552-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2023-07-12t182421-552-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2023-07-12t182421-552-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2023-07-12t182421-552-1520x855.png 1520w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2023-07-12t182421-552-1280x720.png 1280w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2023-07-12t182421-552.png 1600w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Aurus brings precious metals to crypto, enabling users to easily buy, trade, spend and earn gold, silver &#38; platinum via blockchain technology. Join the community hypergrowth and benefit today. Imagine a world where gold can be exchanged as effortlessly as sending a tweet, and silver can be used for everyday purchases, such as paying for [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-13T11:06:42.000Z",
    "title": "Why 27% of OECD Jobs In Eastern European Nations are at Risk in the Wake of the AI Revolution",
    "url": "https://www.cryptopolitan.com/27-oecd-jobs-eastern-europe-ai-revolution/",
    "description": "More than a quarter of jobs in the Organisation for Economic Co-operation and Development (OECD) are at risk of being automated in the upcoming artificial intelligence (AI) revolution, warns the OECD in its latest report. OECD&#8217;s 2023 Employment Outlook reveals that approximately 27% of the labor force in OECD countries is employed in occupations highly ... <a title=\"Why 27% of OECD Jobs In Eastern European Nations are at Risk in the Wake of the AI Revolution\" class=\"read-more\" href=\"https://www.cryptopolitan.com/27-oecd-jobs-eastern-europe-ai-revolution/\" aria-label=\"More on Why 27% of OECD Jobs In Eastern European Nations are at Risk in the Wake of the AI Revolution\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-13T11:05:03.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s&#160;Solana price&#160;is $22.13 with a 24-hour trading volume of $618,897,839.&#160;Solana is up 0.52% in the last 24 hours.&#160;The current CoinMarketCap ranking is #9, with a live market cap of $7,273,881,101.&#160;It has a circulating supply of 394,890,490 SOL coins&#160;and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-13T10:45:34.000Z",
    "title": "Crypto Twitter thrilled about Google Play adding NFT support",
    "url": "https://crypto.news/crypto-twitter-thrilled-about-google-play-adding-nft-support/",
    "description": "Google Play Store has updated its policy to pave the way for digital collectibles and NFTs on its platform. Crypto Twitter&#8217;s reaction is beyond optimistic. Google Play Store has updated its policy to enable blockchain-based app and game developers to&#8230;"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-13T10:45:58.000Z",
    "title": "Top 10 Biggest Mistakes in Crypto",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-10-biggest-mistakes-in-crypto/",
    "description": "<p>Investing in cryptos is often a thrilling experience. But the chances of making mistakes are high, especially for new investors. So, we&#8217;ve discovered that there are common mistakes newbies make. And sometimes even oldtimers make the same mistakes. Mistakes in the crypto space sometimes come at a high cost. You can lose all your assets [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-10-biggest-mistakes-in-crypto/\">Top 10 Biggest Mistakes in Crypto</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]