[
  {
    "source": "Cointelegraph",
    "date": "2024-01-19T14:26:56.000Z",
    "title": " Vatican expert calls AI &quot;absolutely positive&quot; as a product of human intelligence  ",
    "url": "https://cointelegraph.com/news/vatican-expert-calls-ai-absolutely-positive-as-a-product-of-human-intelligence",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMTlkMmVkNjYtNjRhYS00NjI4LWFkZWUtNWJlMjZiZGM4ZDVmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Friar Paolo Benanti, the Vatican’s expert on AI, called the technology “absolutely positive” as the result of human intelligence, but warned over ethical implications without proper governance.  </p>\n                    <p><p> Friar Paolo Benanti, a monk of the Franciscan order, is the Vatican’s artificial intelligence (AI) expert and has called the technology “absolutely positive” as a product of human intelligence and ability, but it is not without ethical concerns. </p><p>According to a <a href=\"https://apnews.com/article/ai-ethics-benanti-vatican-italy-friar-microsoft-7a49d562633937efa0e826fb1fa08cc1\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from the AP on Jan. 18, the monk said that although he is a big believer in AI, he simultaneously believes government regulations based on “ethical considerations” should go hand-in-hand with the development of the technology. </p><p>Benanti has a background in engineering with a doctorate in moral theology. He says his passion is on the “ethics of technology,’' and is an advisor to the Pope on the topic, who <a href=\"https://cointelegraph.com/news/pope-vatican-releases-letter-warning-dangers-of-ai\">released a 3,400-word letter</a> on Dec. 15 warning of the dangers of the technology. </p><p><a href=\"https://cointelegraph.com/news/vatican-expert-calls-ai-absolutely-positive-as-a-product-of-human-intelligence\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-19T14:25:19.000Z",
    "title": "Long-term Bitcoin holders start to cash in as short-term investors face losses",
    "url": "https://cryptoslate.com/insights/long-term-bitcoin-holders-start-to-cash-in-as-short-term-investors-face-losses/",
    "description": "<p>Quick Take The Bitcoin market is showing differentiation in the behavior of long-term holders (LTHs) and short-term holders (STHs). LTHs, defined as holding Bitcoin for a period of more than 155 days, are beginning to send profits to exchanges. This trend is observed from the time when Bitcoin prices dipped to $26,000 from $30,000 in [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/long-term-bitcoin-holders-start-to-cash-in-as-short-term-investors-face-losses/\">Long-term Bitcoin holders start to cash in as short-term investors face losses</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-19T14:38:34.000Z",
    "title": "Forecasting the Future of Cryptocurrencies: Analyzing Prospects for Bitcoin, NuggetRush, and Dogecoin",
    "url": "https://cryptodaily.co.uk/2024/01/forecasting-the-future-of-cryptocurrencies-analyzing-prospects-for-bitcoin-nuggetrush-and-dogecoin",
    "description": "Major technical indicators in the crypto market gave Bitcoin’s (BTC) price a great launchpad to reclaim the $50,000 level."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-19T14:26:15.000Z",
    "title": "Didn't Catch Dogecoin Surge in 2021? This Crypto Is Poised for Even Greater Gains in 2024!",
    "url": "https://cryptodaily.co.uk/2024/01/didnt-catch-dogecoin-surge-in-2021-this-crypto-is-poised-for-even-greater-gains-in-2024",
    "description": "Discover the exciting potential of Dogecoin (DOGE) in the dynamic world of cryptocurrencies. Learn how DOGE's recent listing on Flitpay and whale activity signal a possible price surge. Stay informed about the latest trends and opportunities in the crypto market as we delve into the factors driving these coins towards significant gains."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-19T14:33:34.000Z",
    "title": "Tenderly Elevates Metamask Snap with Sayfer-Verified Security",
    "url": "https://cryptodaily.co.uk/2024/01/tenderly-elevates-metamask-snap-with-sayfer-verified-security",
    "description": "Tenderly Elevates Metamask Snap with Sayfer-Verified Security"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-19T14:27:18.000Z",
    "title": "Microsoft and OpenAI: Navigating the Changing Landscape of AI",
    "url": "https://www.cryptopolitan.com/microsoft-and-openai-navigating-the-changes/",
    "description": "In a recent interview at the World Economic Forum in Davos, Microsoft&#8217;s CEO, Satya Nadella, shed light on the company&#8217;s evolving strategy in artificial intelligence (AI). Amidst the ever-changing landscape of AI technologies and market dynamics, Nadella&#8217;s comments have highlighted the intricate partnership between Microsoft and OpenAI and how both companies adapt to a rapidly [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-19T14:21:43.000Z",
    "title": "WHO Releases Ethical Guidelines for AI in Healthcare",
    "url": "https://www.cryptopolitan.com/who-releases-guidelines-for-ai-in-healthcare/",
    "description": "In response to the rapid advancement of generative artificial intelligence (AI) in healthcare, the World Health Organization (WHO) has issued a comprehensive set of guidelines. These guidelines aim to steer the ethical use of Large Multi-Modal Models (LMMs) in the healthcare sector. Guiding responsible AI use in healthcare The new WHO guidance, consisting of over [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-19T14:11:05.000Z",
    "title": "Nina Schick, AI Luminary, to Headline Disrupt 2024",
    "url": "https://www.cryptopolitan.com/nina-schick-to-headline-disrupt-2024/",
    "description": "In a significant announcement, Sabio Group has confirmed Nina Schick as the keynote speaker for its flagship event, Disrupt 2024, in the UK. Schick, renowned for her expertise in generative artificial intelligence (AI) and its implications on society and business, is set to offer her insights into the evolving landscape of customer experience (CX) driven [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-19T14:17:17.000Z",
    "title": "Analyst: Grayscale Bitcoin Trust sellout has clear reasons",
    "url": "https://crypto.news/analyst-grayscale-bitcoin-trust-sellout-has-clear-reasons/",
    "description": "A crypto trader shared the reasons why he believes Grayscale Bitcoin Trust is seeing a mass sellout."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-19T14:30:01.000Z",
    "title": "XRP Price Drop Vs. BTC, ETH: Legal Expert Dissects Driving Forces",
    "url": "https://www.newsbtc.com/xrp-news/xrp-price-drop-vs-btc-eth-driving-forces/",
    "description": "The XRP price dynamics, in comparison to its more dominant counterparts, Bitcoin (BTC) and Ethereum (ETH) have been a subject of intense scrutiny and debate. Pro-XRP lawyer Bill Morgan recently shed light on this perplexing trend through a detailed discourse on X (formerly Twitter), sparking a wide array of responses and theories from the community. Morgan, reflecting on the long-term performance of XRP, pointed out a noticeable trend: &#8220;The XRP price dynamic seems to be to move with the market meaning BTC and Ethereum but to gradually over the long term decline in value against those two assets no matter what Ripple does.&#8221; He highlighted a significant decline in XRP against BTC (84.85%) and ETH (91.58%) over the last five years. Initially attributing this trend to the lawsuit against Ripple, Morgan noted that even subsequent legal victories and clarity for XRP in the second half of 2023 did not reverse the declining trend, leaving the community questioning the underlying causes. XRP Underperforms Significantly Vs. BTC, ETH: Why? The discourse unfolded further in the comment section, where various users presented their hypotheses. One user branded XRP as &#8220;the most hated coin in crypto,&#8221; suggesting that a persistent negative sentiment, combined with aggressive shorting and attacks, has been detrimental to XRP&#8217;s value. Morgan concurred, acknowledging the impact of the &#8220;FUD narrative&#8221; but doubting it as the primary cause. Related Reading: XRP On Edge: Supply Hits Historical High-Risk Levels, Brace For Impact? The discussion delved into other potential factors, including “tribalism” in the crypto space, the lack of speculative media attention around XRP, and the influence of large holders of BTC and ETH on the XRP price. Morgan termed these collective factors as the &#8220;narrative explanation,&#8221; acknowledging their role but still not convinced of them being the central issue. “I call that the narrative explanation and I do believe it contributes to XRP price performance against BTC and ETH. I don’t think it is the main explanation. The FUD narrative against XRP is intense and continuous. It even included absolute nonsense about the SEC v Ripple case,” Morgan stated. A pointed criticism came regarding the developer activity on the XRPL (XRP Ledger), with a user highlighting a lack of development as a significant concern. Morgan agreed, marking the inactivity as an issue. “Lack of developer activity is definitely a problem,” the lawyer remarked. Related Reading: XRP Sale Controversy: Ripple Faces Heated Legal Debate Amid Market Turbulence However, he firmly dismissed the notion that the monthly release of 200 million coins by Ripple from escrow is a factor, stating, &#8220;The escrow argument is easy to dismantle.&#8221; He also countered the argument about XRP&#8217;s utility, or lack thereof, by presenting evidence of its use in 50% of Ripple&#8217;s ODL (On-Demand Liquidity) transactions. Competition And Propaganda The role of stablecoins like USDT and USDC in cross-border payments and remittances, a domain where XRP aims to excel, was also discussed. Morgan admitted that increased competition in this specific area might indicate a broader issue: the lack of development of other applications for XRP on the XRPL. Offering a broader perspective, Yassin Mobarak, founder of Dizer Capital, pointed to the &#8220;propaganda against XRP&#8221; as a significant deterrent to its value appreciation. He argued: Honestly, given the unfortunate successful propaganda against XRP in the crypto community, we should not look to existing retail investors for XRP price appreciation. That will likely never come. XRP will only grow from demand coming from utility, institutional users &#38; investors, and new retail entrants into the space who have not been tainted by the historical propaganda. As the conversation unfolds, it becomes evident that the factors influencing XRP&#8217;s price dynamics are multifaceted and complex. However, one thing is clear: if the supply side can be ruled out as a problem (Ripple escrow), it is the demand side which is lacking. At press time, XRP was trading at $0.54908 and has fallen 2.5% in the last 24 hours, in line with the broader market. Featured image from Shutterstock, chart from TradingView.com"
  }
]