[
  {
    "source": "Decrypt",
    "date": "2023-12-27T17:34:19.000Z",
    "title": "Decrypt's NFT Project of the Year: Pudgy Penguins",
    "url": "https://decrypt.co/210727/decrypts-nft-project-year-2023-pudgy-penguins",
    "description": "Ethereum collection Pudgy Penguins thrived in Crypto Winter and now is gliding to new heights on the back of mainstream market toys."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-27T17:38:36.000Z",
    "title": " Chinese Web3 VC to launch $10B accelerator fund: Report ",
    "url": "https://cointelegraph.com/news/chinese-web3-vc-launch-10-billion-accelerator-fund-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNGZlOGQ4MjYtYjIyMS00MjQ2LTgyMTQtZmZiNTYyNWRkZjI5LkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The company is backed by China's state-owned National Engineering Laboratory, which has also taken a keen interest on Web3 initiatives. </p>\n                    <p><p>During the Guangdong-Hong Kong-Macao Greater Bay Area Digital Economy Development Conference on Dec. 26, Chinese venture capital (VC) firm GBA Capital announced a $10 billion pledge to establish a Web3 fund.</p><p>According to local news <a href=\"http://www.news.cn/tech/20231226/c5479eb38d4a48b3b003a9f6a7fabe70/c.html\" target=\"_blank\" rel=\"noopener nofollow\">reports</a>, the GBA Capital Web3 Fund will invest in startups focusing on virtual reality, Metaverse, and nonfungible tokens and transform the Guangdong-Hong Kong-Macao economic area into the world's \"meta-asset capital.\" Haolong Li, Chairman of GBA Capital, said that this year's conference would also \"hold meta-asset global tours in Japan, Singapore, Dubai, Silicon Valley, Europe, and other places\" to improve the visibility of meta-assets. </p><p>GBA Capital is established by China Europe International Financial Group in Hong Kong. The firm holds strategic partnerships with financial institutions such as the Asia Pacific Investment Bank and China's state-owned National Engineering Laboratory. </p><p><a href=\"https://cointelegraph.com/news/chinese-web3-vc-launch-10-billion-accelerator-fund-report\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-27T17:27:18.000Z",
    "title": "Is VeChain (VET) and Hedera (HBAR) 100% Rally Setting Stage for an Even Bigger 2024?",
    "url": "https://cryptodaily.co.uk/2023/12/is-vechain-vet-and-hedera-hbar-100-rally-setting-stage-for-an-even-bigger-2024",
    "description": "Explore the exciting surge of VeChain (VET) and Hedera's (HBAR) remarkable growth in the crypto world. VET's innovative strategies lead to a 70% jump, while HBAR's technological advancements fuel a 47% rise. Get insights into their market strategies and potential future in our detailed analysis. Stay ahead in the dynamic crypto market with these key insights."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T17:40:06.000Z",
    "title": "Bonk (BONK) faces 12% dip amid Solana (SOL) profit-taking surge",
    "url": "https://www.cryptopolitan.com/bonk-bonk-faces-12-dip/",
    "description": "Cryptocurrency markets continue to experience volatility as meme coin Bonk (BONK) sees a 12% drop in the past 24 hours. This decline comes during increased profit-taking activity in the Solana (SOL) ecosystem. Solana (SOL) pullback and liquidations Data from CoinGecko reveals that SOL&#8217;s price has dipped by 2%, hovering around $112 after a recent rally [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T17:34:28.000Z",
    "title": "BendDAO Unveils BRC-20 Service to Bridge BRC-20 and ERC-20 Liquidity",
    "url": "https://www.cryptopolitan.com/benddao-brc-20-bridge-and-erc-20-liquidity/",
    "description": "BendDAO, a notable player in the NFT lending platform space, has announced an innovative step forward with the upcoming launch of its &#8216;BendDAO BRC-20&#8217; service. The new service is set to play a pivotal role in connecting BRC-20 and ERC-20 liquidity, marking a significant advancement in the integration of different blockchain technologies. The initiative is [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T17:27:26.000Z",
    "title": "MicroStrategy’s Strategic Bitcoin Acquisitions Ahead of Potential Spot BTC ETF Approval",
    "url": "https://www.cryptopolitan.com/microstrategys-bitcoin-spot-btc-etf-approval/",
    "description": "MicroStrategy, a renowned business intelligence firm, has been making significant waves in the cryptocurrency world with its strategic Bitcoin acquisitions.&#160; Amidst growing anticipation of a potential spot Bitcoin exchange-traded fund (ETF) in the United States, the company has continued to bolster its Bitcoin holdings. The move aligns with the vision of co-founder and major Bitcoin [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T17:22:25.000Z",
    "title": "Binance Futures Announces Launch of USDⓈ-M NFP Perpetual Contract with 50x Leverage",
    "url": "https://www.cryptopolitan.com/binance-futures-usd-m-nfp-perpetual-contract/",
    "description": "Binance Futures, a leading platform in the cryptocurrency futures market, has announced the launch of a new trading product, the USDⓈ-M NFP Perpetual Contract. Scheduled to go live on 2023-12-27 at 12:30 (UTC), the new offering will provide traders with the opportunity to leverage up to 50 times on the NFPrompt (NFP) asset.&#160; The development [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T17:22:15.000Z",
    "title": "Nintendo Removes Online Play from 3DS and Wii U Sooner Than Expected",
    "url": "https://www.cryptopolitan.com/nintendo-removes-online-play-from-3ds/",
    "description": "In an unexpected move, Nintendo has begun the process of disabling online play for its popular gaming consoles, the Nintendo 3DS and Wii U, well before the originally announced shutdown date of April 2024.&#160; This decision is part of Nintendo&#8217;s broader plan to gradually phase out online services for these devices. The sudden loss of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T17:16:50.000Z",
    "title": "Insomniac Games’ Spider-Man 2 Multiplayer Mode: A Cancelled Ambition",
    "url": "https://www.cryptopolitan.com/spider-man-2-multiplayer-mode-cancelled/",
    "description": "In a recent development, details surrounding Insomniac Games&#8217; highly anticipated title, Marvel&#8217;s Spider-Man 2, have been scrutinized. The leak, which revealed various aspects of the company&#8217;s games, including the potential inclusion of an online mode in Spider-Man 2, has raised questions about the accuracy of the information provided.&#160; It has now been confirmed that the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-27T17:32:06.000Z",
    "title": "BINANCE COIN PRICE ANALYSIS & PREDICTION (December 26) – BNB Signals Short-Term Bullish Following A Breakout, Up 11% Today",
    "url": "https://nulltx.com/binance-coin-price-analysis-prediction-december-26-bnb-signals-short-term-bullish-following-a-breakout-up-11-today/",
    "description": "As the BSC chain attracted high volume inflow in the past few days, BNB&#8217;s price increased notably and broke out of a descending resistance line. It saw a rejection and now looks stalled under a key psychological level. BNB struggled for growth and at the same time suffered serious volatility [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-27T17:12:03.000Z",
    "title": "Hong Kong’s OneDegree sees significant stablecoin development interest",
    "url": "https://crypto.news/hong-kongs-onedegree-sees-significant-stablecoin-development-interest/",
    "description": "OneDegree, a Hong Kong-based virtual insurance company, reported interest from over 100 project teams for stablecoin development. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-27T17:30:30.000Z",
    "title": "Crypto Analyst Predicts XRP Price Will Explode 58,000% To $352",
    "url": "https://www.newsbtc.com/analysis/xrp/crypto-analyst-predicts-xrp-price-will-explode-58000-to-352/",
    "description": "A crypto analyst has put together a bold prediction as to the future trajectory of the XRP price. Based on his prediction, the XRP community could see the crypto token’s price enter three digits soon enough.  XRP Price To Rise To $352 In a video posted on YouTube, the crypto analyst behind the JWK Show channel concluded that XRP’s price could potentially rise to as high as $352. He made this conclusion after using an XRP calculator. This calculator was invented based on a valuation model developed by Susan Athey, who happens to be on Ripple’s board, and Robert Mitchnick, a former employee at the crypto firm. Related Reading: The Crypto Bulls Are Back: Digital Asset Inflows Cross $103 Million In One Week The crypto analyst had input metrics like transaction volume, circulating supply, store of value, and how long it would take to process transactions into the XRP calculator before getting the price of $352.  Although there was no timeframe for when this price could be actualized, it is worth mentioning that the calculator was working with figures achieved based on a five-year outlook. The crypto analyst also alluded to an X (formerly Twitter) post before stating that the XRP community could see the crypto token “finally mooning” in 2024.  The price prediction of $352 seems like a far reach, considering that XRP still sits at around $0.6. That price level, however, seems more attainable when compared with more daring price predictions like the one of XRP hitting $10,000 in the future.  Analysts like Davinci Jeremie may, however, argue that anything is possible with XRP, considering that he recently suggested that the XRP price movement defies technical analysis.  XRP trending at $0.63 &#124; Source: XRPUSD on Tradingview.com XRP And Other Altcoins Entering Into Bull Phase The analyst behind the JWKShow channel also shared his analysis of the altcoin market. He noted that there has been a breakout as altcoins have left the accumulation phase and are headed for the bull phase. He drew similarities between the current chart pattern and one in 2019, just before altcoins entered into the bull phase.  Related Reading: Bitcoin Millionaires Rise By 246% In 2023, Here’s How Many There Are He specifically touched on the XRP price as he stated that it is a good time to invest in the crypto token. One of his reasons for saying this is because XRP is projected to break out of a two-year trendline soon enough, which could see its price rise significantly. He also alluded to the spike in XRP’s transaction volume, which is also bullish for the crypto token.  Interestingly, the crypto analyst also happens to be among those who believe that the XRP price is suppressed. He said that the price of XRP will go parabolic “when the 1% are ready, which should be in 2024.” It is, however, unclear who is the “1%” he is referring to.  At the time of writing, XRP is trading at around $0.62, down in the last 24 hours, according to data from CoinMarketCap.  Featured image from Watcher Guru, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-27T17:37:00.000Z",
    "title": "Solana’s BONK Token Takes a Hit: 50% Dip from All-Time High",
    "url": "https://www.crypto-news-flash.com/solanas-bonk-token-takes-a-hit-50-dip-from-all-time-high/?utm_source=rss&utm_medium=rss&utm_campaign=solanas-bonk-token-takes-a-hit-50-dip-from-all-time-high",
    "description": "<img width=\"1280\" height=\"910\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-300x213.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-1024x728.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-768x546.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-269x192.png 269w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-24x17.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-36x26.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-48x34.png 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Solana-based meme coin, BONK lost 50 percent from its all-time high value reached earlier this month.  It can be recalled that the asset was trading at its all-time high price of $0.00003419 on December 16.   Solana-based meme coin, BONK, is one of the notable projects that emerged in the crypto scene this year. Several crypto [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-27T17:30:00.000Z",
    "title": "XRPL’s Scalability Questioned Amid Inscription Saga",
    "url": "https://coinedition.com/xrpls-scalability-questioned-amid-inscription-saga/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Main-Features-of-XRPL.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRPL Developers Debate Prioritizing Transactions With Higher Fees\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Main-Features-of-XRPL.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Main-Features-of-XRPL-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Main-Features-of-XRPL-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Main-Features-of-XRPL-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Main-Features-of-XRPL-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Main-Features-of-XRPL-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Recent discussions on X (formerly Twitter) have revealed that the XRP Ledger (XRPL) is technically incapable of supporting ordinals and their inscriptions. Richard Holland and Crypto Eri have criticized projects attempting to mint ordinals on the XRPL, labeling them impractical and spam. This new development, mirroring Bitcoin&#8217;s inscription method, aimed to inscribe data on XRP [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xrpls-scalability-questioned-amid-inscription-saga/\">XRPL&#8217;s Scalability Questioned Amid Inscription Saga</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]