[
  {
    "source": "Cointelegraph",
    "date": "2023-06-11T17:20:15.000Z",
    "title": "SOL is not a security, says the Solana Foundation",
    "url": "https://cointelegraph.com/news/sol-is-not-a-security-says-the-solana-foundation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/e852b8fc-3edb-41f1-a004-c9f945da4513.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The SEC has labeled the SOL token as a security in two separate lawsuits filed on June 5 and June 6 against crypto exchanges Binance and Coinbase.  </p>\n                    <p><p>The Solana Foundation took to Twitter to address for the first time the U.S. Securities and Exchange Commission's classification of its native token, Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>), as a security. </p><p>\"The Solana Foundation disagrees with the characterization of SOL as a security,\" reads a statement from June 10, noting that it welcomes the engagement of policymakers to achieve legal clarity in the digital assets space. </p><p>Solana's ​​native and utility token was publicly launched in March 2020. SOL holders stake the token in order<a href=\"https://cointelegraph.com/news/what-is-solana-and-how-does-it-work\"> to validate transactions through its consensus mechanism</a>. The token can also be used to receive rewards, pay transaction fees, and enable users to participate in governance.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Solana Foundation disagrees with the characterization of SOL as a security. We welcome the continued engagement of policymakers as constructive partners on regulation to achieve legal clarity on these issues for the thousands of entrepreneurs across the U.S. building in the…</p>&mdash; Solana Foundation (@SolanaFndn) <a href=\"https://twitter.com/SolanaFndn/status/1667578529612017666?ref_src=twsrc%5Etfw\">June 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The SEC has labeled the SOL token as a security in two separate lawsuits filed on June 5 and June 6 against crypto exchanges Binance and Coinbase, respectively. The classification is based on several factors, including the expectation of profits derived from the efforts of others, as well as how the tokens are being used and marketed. </p><p>\"This classification is significant because it subjects Solana and associated activities to a different set of regulations and compliant requirements. [...] we are actively engaging with legal experts and are in communication with the SEC to understand and address their concerns,\" <a href=\"https://twitter.com/pbmilan/status/1667580476712787970/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> the Foundation in a letter to its community.</p><p>Along with SOL, the SEC listed other nine cryptocurrencies to the securities' classification on <a href=\"https://cointelegraph.com/news/sec-s-binance-suit-contains-heady-mix-of-predictable-charges-novel-revelations\">Binance's lawsuit</a>: BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>), Binance USD (<a href=\"https://cointelegraph.com/binance-usd-busd-price-index\">BUSD</a>), Solana, Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>), Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>), Cosmos (<a href=\"https://cointelegraph.com/cosmos-price-index\">ATOM</a>), The Sandbox (<a href=\"https://cointelegraph.com/the-sandbox-sand-price-index\">SAND</a>), Decentraland (<a href=\"https://cointelegraph.com/decentraland-mana-price-index\">MANA</a>), Axie Infinity (<a href=\"https://cointelegraph.com/axie-infinity-axs-price-index\">AXS</a>) and COTI (COTI). In its<a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\"> Coinbase suit</a>, the SEC<a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\"> named 13 cryptocurrencies</a>, doubling down on the newly classified tokens and adding six more: Chiliz (CHZ), Flow (FLOW), Internet Computer (<a href=\"https://cointelegraph.com/internet-computer-icp-price-index\">ICP</a>), Near (<a href=\"https://cointelegraph.com/near-protocol-price-index\">NEAR</a>), Voyager Token (VGX) and Nexo (<a href=\"https://cointelegraph.com/nexo-price-index\">NEXO</a>).</p><p>According to the SEC, the term \"security\" includes an \"investment contract,\" as well as other instruments such as stocks, bonds, and transferable shares. \"A digital asset should be analyzed to determine whether it has the characteristics of any product that meets the definition of \"security\" under the federal securities laws,\" the regulator states in its<a href=\"https://www.sec.gov/corpfin/framework-investment-contract-analysis-digital-assets#%5Fedn6\" target=\"_blank\" rel=\"noopener nofollow\"> guidance</a> for analyzing digital assets as investment contracts.</p><p>The Solana Foundation<a href=\"https://cointelegraph.com/news/multi-threaded-blockchain-solana-receives-18-million-in-funding\"> did private sales of tokens in the past years</a>, which means that it sold securities for institutional investors and venture firms. Its private sales were reportedly<a href=\"https://www.bloomberg.com/opinion/articles/2023-06-07/when-is-a-token-not-a-security\" target=\"_blank\" rel=\"noopener nofollow\"> performed</a> under a simple agreement for future tokens (SAFT), which is a security issuance for the eventual transfer of digital tokens from crypto developers to investors. Under token sales through a SAFT, Solana also filed private offering forms with the SEC, and investors were subject to lockups. </p><p>A public sale of SOL tokens was held during Solana's initial coin offering (ICO) in March 2020,<a href=\"https://cointelegraph.com/news/solana-and-chainlink-team-up-to-build-a-crazy-fast-oracle\"> allocating 8 million tokens to the public</a>, or 1.6% of its initial token supply. This sale of tokens raised $1.76 million for the Solana Foundation, at $0.22 each.</p><p>In an opinion piece about the recent developments, legal expert and Bloomberg's contributor Matt Levine<a href=\"https://www.bloomberg.com/opinion/articles/2023-06-07/when-is-a-token-not-a-security\" target=\"_blank\" rel=\"noopener nofollow\"> noted</a> that previous securities offers of SOL should not make the token a security now. \"The fact that those tokens now trade publicly, with less disclosure and fewer investor safeguards than the SEC would like, is, from the SEC’s perspective, unfortunate. But it’s not exactly Solana’s fault, or rather it is Solana’s fault but in a perfectly legal way,\" he stated. </p><p><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Magazine: Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-11T17:38:36.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "The automatic release of new APT tokens into the open market is valued at over $50 million based on current prices. Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for a decoupling of on-chain and off-chain trading activity. So, it&#8217;s interesting to see how the ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-11T17:11:40.000Z",
    "title": "VeChain price analysis: VET obtains positive momentum at $0.0157",
    "url": "https://www.cryptopolitan.com/vechain-price-analysis-2023-06-11/",
    "description": "VeChain price analysis shows that the price of VET/USD has followed a strong upwards trend in the last 24 hours. The price has maintained an upward trajectory, experiencing substantial growth and coming close to reaching the $0.016 threshold. The market sentiment is optimistic, with the cryptocurrency displaying an upward trend. Over the past 48 hours, the ... <a title=\"VeChain price analysis: VET obtains positive momentum at $0.0157\" class=\"read-more\" href=\"https://www.cryptopolitan.com/vechain-price-analysis-2023-06-11/\" aria-label=\"More on VeChain price analysis: VET obtains positive momentum at $0.0157\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-11T17:11:24.000Z",
    "title": "Michael Saylor and Bitcoin’s Lifesaving Mission: Rescuing Turkey from Hyperinflation and Empowering Financial Freedom",
    "url": "https://www.crypto-news-flash.com/michael-saylor-and-bitcoins-lifesaving-mission-rescuing-turkey-from-hyperinflation-and-empowering-financial-freedom/?utm_source=rss&utm_medium=rss&utm_campaign=michael-saylor-and-bitcoins-lifesaving-mission-rescuing-turkey-from-hyperinflation-and-empowering-financial-freedom",
    "description": "The co-founder of MicroStrategy is proposing Bitcoin as a solution for Lira, Turkey’s national fiat currency.  Although the SEC is still at war with major crypto exchanges, Bitcoin bulls seem to have built momentum through the rough weekend. Michael Saylor, a famous Bitcoin proponent has taken to Twitter to propose a solution for Turkey. Saylor [...]"
  }
]