[
  {
    "source": "Decrypt",
    "date": "2023-06-29T05:52:48.000Z",
    "title": "Bitcoin ETF Race: Ark Amends SEC Filing to Match BlackRock",
    "url": "https://decrypt.co/146645/bitcoin-etf-race-ark-amends-sec-filing-to-match-blackrock",
    "description": "ARK added a surveillance-sharing agreement that appears to address potential market manipulation. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-29T05:45:19.000Z",
    "title": "Major US banks get passing grade in ‘severe recession’ stress test",
    "url": "https://cointelegraph.com/news/major-banks-pass-federal-reserve-stress-test",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/ec371b9d-defb-481d-9cf3-36675b360b52.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>America’s central bank has been stress-testing retail banks in the wake of several high-profile banking collapses earlier this year.</p>\n                    <p><p>The American central bank has determined that all 23 of the country’s largest banks would be able to survive a severe recession following its “stress tests.”</p><p>The <a href=\"https://www.federalreserve.gov/supervisionreg/dfa-stress-tests-2023.htm\" target=\"_blank\" rel=\"noopener nofollow\">report</a> issued on June 28 also showed relative weakness among the midsize and regional banks, however, the stress test only requires the 23 banks to participate in testing,. The list comprises of the country’s largest lenders. </p><p>In light of the <a href=\"https://cointelegraph.com/news/bitcoin-likely-to-outperform-all-crypto-assets-following-banking-crisis-analyst-explains\">banking crisis</a> earlier this year, Fed policymakers hinted that stress testing could be made harder in the future.</p><p>Fed vice-chair for supervision, Michael Barr, commented: </p><blockquote>“We should remain humble about how risks can arise and continue our work to ensure that banks are resilient to a range of economic scenarios, market shocks, and other stresses.”</blockquote><p>Bank stress tests have been carried out every year since the 2008 financial crisis, which was caused by U.S. banks. The Fed tests how severe banking industry losses would be if unemployment were to skyrocket and economic activity were to severely contract.</p><p>In this year’s stress test, the Fed tested a severe global <a href=\"https://cointelegraph.com/news/a-recession-is-coming-here-s-how-it-s-fueling-bitcoin\">recession</a> scenario which caused 40% and 38% declines in commercial and home property prices respectively. In the worst-case scenario, unemployment would hit 10% — it is currently 3.7%. </p><p>The 23 largest banks would have collective losses of $541 billion in this scenario, according to the tests. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/3e865224-c91a-4608-91a8-4ddb859444dc.jpg\"  /><figcaption style=\"text-align: center;\"><em>The 23 banks participating in Fed stress. Source: federalreserve.gov</em></figcaption></figure><p>A bank must have a stressed capital <a href=\"https://www.federalreserve.gov/publications/large-bank-capital-requirements-20210805.htm\" target=\"_blank\" rel=\"noopener nofollow\">ratio</a> of at least 4.5% to be considered for a passing grade, according to the Fed. Capital ratios are a key measure of a bank's financial strength.</p><p>Earlier this year the American banking system was <a href=\"https://cointelegraph.com/news/bank-crisis-debt-ceiling-powder-keg-bitmex-arthur-hayes\">rocked</a> by several high-profile collapses including <a href=\"https://cointelegraph.com/news/silicon-valley-bank-shut-down-by-california-regulator\">Silicon Valley Bank</a>, Signature Bank, Silvergate Bank, and <a href=\"https://cointelegraph.com/news/bitcoin-price-jumps-in-the-wake-of-first-republic-bank-crash\">First Republic Bank</a>. Others including <a href=\"https://cointelegraph.com/news/pacwest-bank-plummets-50-how-will-bitcoin-react\">PacWest</a> and Western Alliance were on shaky ground. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/banking-crisis-what-does-it-mean-for-crypto\"><strong><em>Banking crisis: What does it mean for crypto?</em></strong></a></p><p>The Fed has been actively bailing out smaller banks this year through its Bank Term Funding Program (BTFP) set up in March.</p><p>More than $100 billion has already been spent propping up small and mid-sized banks on the ropes, according to the Federal Reserve <a href=\"https://fred.stlouisfed.org/series/H41RESPPALDKNWW\" target=\"_blank\" rel=\"noopener nofollow\">data</a>. </p><p><em><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</strong></a></em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-29T05:40:00.000Z",
    "title": "KuCoin Introduces Mandatory KYC As Regulations Kick In",
    "url": "https://cryptodaily.co.uk/2023/06/kucoin-introduces-mandatory-kyc-as-regulations-kick-in",
    "description": "<p>Cryptocurrency platform KuCoin has announced that it will be introducing mandatory Know Your Customer (KYC) rules as it looks to embrace regulations.&nbsp;</p>\n<p>The KYC rules will kick in as early as next month, with customers required to complete several mandatory identification checks to use services offered by KuCoin.&nbsp;</p>\nKuCoin Embraces Regulations&nbsp;\n<p>According to a press release issued by the KuCoin exchange, the KYC rules will kick in from the 15th of July. This means users will be required to complete KuCoin&rsquo;s KYC process to use the exchange and its services.&nbsp;</p>\n\n<p>&ldquo;Consistent with KuCoin&rsquo;s core values, we are dedicated to fulfilling &lsquo;Know Your Customer&rsquo; obligation in accordance with the applicable regulatory requirements. We continually protect our customer&rsquo;s assets and combat money laundering, terrorist financing, and related financial crimes around the world. Based on this, KuCoin will enhance the Customer Identification and Verification Program. The enhancement will officially take effect on the 15th of July, 2023 (UTC).&rdquo;</p>\n\n<p>Customers that do not complete the KYC process will be unable to trade or make deposits on the exchange, the press release stated. As a result, the introduction of these rules means current users will be forced to comply with KYC regulations to be able to access KuCoin&rsquo;s full suite of products and offerings. The press release noted,&nbsp;</p>\n\n<p>&ldquo;Please take note of the following: Starting from the 15th of July, 2023 (UTC), newly registered users must complete their KYC in order to use KuCoin&rsquo;s products and services. For users who registered before the 15th of July, 2023 (UTC), if their KYC is not completed, they will only be able to use services such as Spot trading sell orders, Futures trading deleveraging, Margin trading deleveraging, KuCoin Earn redemption, ETF redemption, and will not be able to use the deposit service (withdrawals are not impacted).&rdquo;</p>\n\nBetter Compliance With Federal Regulations&nbsp;\n<p>Cryptocurrency exchanges have come under considerable criticism thanks to a perception of being lax when it comes to Know Your Customer checks. Regulators have stated that such lax rules lead to fraud, terror financing, and money laundering. Jonny Lyu, the Chief Executive Officer at KuCoin, stated that introducing mandatory KYC checks would help the exchange better comply with federal regulations and enhance overall security. The CEO noted in the press release,&nbsp;</p>\n\n<p>&ldquo;As a people&rsquo;s exchange, KuCoin has always prioritized the security of users&rsquo; assets. As a globalized exchange, KuCoin closely monitors the crypto policies of various countries and respects compliance requirements, providing users with enhanced asset security. With the development of the cryptocurrency industry, crypto has gradually moved from a geek towards mass adoption. However, this process has also brought about certain security issues concerning on-chain assets. In light of this, KuCoin has strengthened our KYC system to comply with regulatory requirements worldwide and better protect the asset security of all cryptocurrency users through enhanced KYC rules.&rdquo;</p>\n\nGrowing Numbers\n<p>KuCoin had stated in its annual review that it had over 27 million active customers on its platform at the end of 2022., with 13 million users joining the platform in 2022 alone. This represents a 102% growth year-on-year in the exchange&rsquo;s user base. The exchange revealed that its most significant jump in numbers came from the Asia-Pacific region, where it added over 7 million new users in 2022, representing an increase of 191% since 2021. Other areas that saw an increase in user base were Latin America (120%), Middle East &amp; Africa (120% and 109%), and Europe (100%).&nbsp;</p>\n<p>Transaction volumes also saw a considerable increase between January and December 2022, with trading volumes across the spot and futures markets crossing $3.6 trillion, representing an increase of 52% year-on-year. At its peak, KuCoin&rsquo;s daily trading volume in the futures markets reached a high of $23 billion, while the spot trading volume touched $12 billion.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T05:58:40.000Z",
    "title": "NFT Adoption Accelerated: Flare Networks Collaborates with AI Startup Atriv",
    "url": "https://www.cryptopolitan.com/flare-networks-with-ai-startup-nft-adoption/",
    "description": "Flare Networks, a decentralized oracle service provider backed by Ripple, has announced a strategic partnership with Atriv, an innovative AI-powered digital platform. Atriv&#8217;s cutting-edge technology aims to accelerate the adoption of Non-Fungible Tokens (NFTs) by introducing a user-friendly, no-code prompt-generating NFT platform to the Flare network. This collaboration marks an important step towards enhancing accessibility ... <a title=\"NFT Adoption Accelerated: Flare Networks Collaborates with AI Startup Atriv\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flare-networks-with-ai-startup-nft-adoption/\" aria-label=\"More on NFT Adoption Accelerated: Flare Networks Collaborates with AI Startup Atriv\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T05:51:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  }
]