[
  {
    "source": "CoinDesk",
    "date": "2024-01-23T13:05:12.000Z",
    "title": "First Mover Americas: Bitcoin Slips Below $39K",
    "url": "https://www.coindesk.com/markets/2024/01/23/first-mover-americas-bitcoin-slips-below-39k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin [BTC] and crypto markets in context for Jan. 23, 2024. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-23T13:01:02.000Z",
    "title": "Agoria's 'Le Code d’Orsay': Inside the Musée d’Orsay’s First NFT Exhibition",
    "url": "https://decrypt.co/213803/agorias-le-code-dorsay-inside-the-musee-dorsays-first-nft-exhibition",
    "description": "Le Code d’Orsay, a new project from the artist and DJ Agoria, will premiere at the Orsay next month. Here's a first look."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-23T13:00:00.000Z",
    "title": "Preview of Agoria's 'Le Code d’Orsay'",
    "url": "https://decrypt.co/videos/live-events/PK7ynKMB/preview-of-agorias-le-code-dorsay",
    "description": "A first look at \"Sigma Lumina,\" a sculpture by artist and musician Agoria in collaboration with Johan Lescure. It features in \"Le Code d’Orsay,\" the first NFT exhibition at the Musée d’Orsay."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-23T13:18:46.000Z",
    "title": "ARK Invest continues Bitcoin futures ETF rotation with multimillion-dollar ARKB purchase",
    "url": "https://cryptoslate.com/ark-invest-continues-bitcoin-futures-etf-pivot-with-multimillion-dollar-arkb-purchase/",
    "description": "<p>Cathie Wood&#8217;s ARK Invest has maintained its strategic investment approach by accumulating shares of its Ark 21Shares Spot Bitcoin ETF (ARKB) for inclusion in its Next Generation Internet ETF (ARKW), according to the company&#8217;s latest trade filing seen by CryptoSlate. In this recent transaction, ARK Invest acquired 523,541 ARKB shares at $21 million while divesting [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ark-invest-continues-bitcoin-futures-etf-pivot-with-multimillion-dollar-arkb-purchase/\">ARK Invest continues Bitcoin futures ETF rotation with multimillion-dollar ARKB purchase</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-23T12:51:50.000Z",
    "title": "Socket recovers $2.3 million in ETH after bridge protocol exploit",
    "url": "https://cryptobriefing.com/socket-recovers-23-million-eth-bridge-protocol-exploit/?utm_source=feed&utm_medium=rss",
    "description": "The recovered funds represent roughly $2.3 million worth in ETH, with the damage from the exploit estimated at $3.3 million."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-23T13:12:00.000Z",
    "title": "Jim Cramer Gloats Over Being Right About Spot Bitcoin ETFs Being a ‘Sell-the-News’ Event",
    "url": "https://www.cryptoglobe.com/latest/2024/01/jim-cramer-gloats-over-being-right-about-spot-bitcoin-etfs-being-a-sell-the-news-event/",
    "description": "On January 23, with his confidence growing due to correctly predicting that there would be lots of BTC selling after the launch of multiple SEC-approved spot Bitcoin ETFs on January 11, for the second day in a row, CNBC’s Jim Cramer decided to comment on Bitcoin’s price action. Former hedge fund manager Jim Cramer is […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-23T13:27:44.000Z",
    "title": "Navigating the Top 10 Blockchain and Fintech Conferences: A Must-Attend Guide for 2024",
    "url": "https://cryptodaily.co.uk/2024/01/navigating-the-top-10-blockchain-and-fintech-conferences-a-must-attend-guide-for-2024",
    "description": "In the world of ever-changing technology, keeping up with the latest information is not just an advantage but a necessity."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-23T13:26:25.000Z",
    "title": "The Future of DeFi: Unveiling the LYDRA/HYDRA Liquidity Pool on Hydra DEX",
    "url": "https://cryptodaily.co.uk/2024/01/the-future-of-defi-unveiling-the-lydrahydra-liquidity-pool-on-hydra-dex",
    "description": "Decentralized finance (DeFi) has seen immense innovation in recent years across lending, trading, derivatives, and more without requiring traditional financial intermediaries."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-23T13:15:30.000Z",
    "title": "Bitcoin Sinks Below $39,000 as Market Pressure Intensifies",
    "url": "https://news.bitcoin.com/bitcoin-sinks-below-39000-as-market-pressure-intensifies/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/ddc-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Sinks Below $39,000 as Market Pressure Intensifies\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/ddc-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ddc-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ddc-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ddc-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ddc-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ddc-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ddc.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Over the past day, bitcoin&#x2019;s value has experienced further decline, now plummeting below the $39K mark as ongoing bearish trends exert downward pressure. Following its dip under the $40K barrier on Monday, the leading crypto asset further depreciated by 5.3% relative to the U.S. dollar within the last 24 hours. From Boom to Gloom: Bitcoin&#x2019;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T13:34:53.000Z",
    "title": "AI Making Strides in Private Aviation: A Look at Industry Applications",
    "url": "https://www.cryptopolitan.com/ai-making-strides-in-private-aviation/",
    "description": "The rise of generative AI chatbots, exemplified by OpenAI&#8217;s ChatGPT, hinted at artificial intelligence coming of age. However, despite the widespread attention AI has garnered, Steve Varsano, CEO of London-based aircraft broker The Jet Business, believes there is room for growth in fully embedding AI within business aviation. AI in private aviation operations Private aviation [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T13:28:23.000Z",
    "title": "Coinbase criticizes US Treasury’s proposed rules on  crypto mixing",
    "url": "https://www.cryptopolitan.com/coinbase-criticizes-rules-crypto-mixing/",
    "description": "Cryptocurrency exchange Coinbase has voiced strong concerns over the US Treasury&#8217;s proposed regulations regarding crypto mixing, stating that they fail to address regulatory gaps adequately and impose unnecessary data and resource burdens on crypto platforms. Coinbase&#8217;s response to proposed rules In a formal comment submitted to the Treasury Department&#8217;s Financial Crimes Enforcement Network (FinCEN), Coinbase [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T13:24:24.000Z",
    "title": "Can AI Robots Learn to Cry and Feel?",
    "url": "https://www.cryptopolitan.com/can-ai-robots-learn-to-cry-and-feel/",
    "description": "While it’s true that AI robots currently lack human emotion and consciousness, the prospect of sentient AI is already a subject of controversial debate. Predicting the future of AI sentience is incredibly challenging, bordering on impossible in our current state of knowledge. Even amongst experts, there is a wide range of opinions on whether and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T13:13:46.000Z",
    "title": "Crypto Chaos is Near! Which Crypto Will Stay During This Price Decline?",
    "url": "https://www.cryptopolitan.com/crypto-chaos-is-near-which-crypto-will-stay-during-this-price-decline/",
    "description": "The crypto market is currently facing significant volatility, with a major crash sending Bitcoin down to around $40,000, and impacting other major cryptocurrencies like Ethereum, Solana, and XRP. Amidst warnings about potential risks and concerns over outflows from Grayscale&#8217;s bitcoin trust, now a spot bitcoin ETF, there&#8217;s speculation that Bitcoin&#8217;s price could potentially fall further, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T13:10:46.000Z",
    "title": "3 tokens for instant 5x Profits",
    "url": "https://www.cryptopolitan.com/3-tokens-for-instant-5x-profits/",
    "description": "In the constantly shifting environment of cryptocurrencies, investors look for chances to make significant profits. This essay examines how three tokens—Retik Finance (RETIK), Shiba Inu (SHIB), and Bonk (BONK)—could provide immediate 5x gains in 2024. Every token has its own characteristics and market dynamics, which make them attractive options for investors hoping to profit from [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T13:10:43.000Z",
    "title": "Bitcoin Price Prediction 2024-2030, What Alternatives Would Do Better Than Bitcoin?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-prediction-2024-2030-what-alternatives-would-do-better-than-bitcoin/",
    "description": "Bitcoin&#8217;s trajectory has been marked by key milestones since its conceptualization in late 2008 and official launch in early 2009. Notable bull runs in 2013 and 2017 saw unprecedented surges in value, and Bitcoin reached an all-time high of $68,789 in November 2021. However, a subsequent 67% decline occurred between November 2021 and February 2022. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T13:07:45.000Z",
    "title": "Unseen Fist Ability in Pokémon Sword and Shield’s Urshifu Raises Concerns Among Competitive Players",
    "url": "https://www.cryptopolitan.com/pokemon-and-shields-urshifu-raises-concerns/",
    "description": "The Pokémon Sword and Shield competitive scene is facing a significant upheaval, as former Pokémon VGC World Championships 2016 winner and renowned YouTuber, Wolfe Glick, sheds light on a legendary Pokémon causing a stir among players. In his video titled &#8216;Is this Pokemon Ruining the Game?&#8217;, Glick focuses on Urshifu and its game-altering ability, Unseen [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T13:00:00.000Z",
    "title": "Market Watch: Solana, Rebel Satoshi, and XRP Poised for Major Breakthroughs",
    "url": "https://www.cryptopolitan.com/market-watch-solana-rebel-satoshi-and-xrp-poised-for-major-breakthroughs/",
    "description": "TLDR Solana (SOL) has experienced increased investor engagement in recent weeks, with experts forecasting a massive price rally for SOL. On the other hand, XRP (XRP) has witnessed a bearish momentum over the past few weeks, although experts maintain a bullish outlook on its prospects. Amid the recent developments, Rebel Satoshi ($RBLZ) has solidified itself [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T12:40:24.000Z",
    "title": "Shiba Inu’s Shibarium surpasses 300 million transactions mark",
    "url": "https://www.cryptopolitan.com/shiba-inu-surpasses-300-million-transactions/",
    "description": "Shiba Inu&#8217;s layer-2 solution, Shibarium, has achieved a remarkable milestone, surpassing 300 million transactions. This significant growth reflects the continued success of Shibarium, which was developed to address Ethereum&#8217;s high transaction fees and provide a scalable solution for the Shiba Inu ecosystem. One of the primary objectives of Shibarium was to reduce transaction fees for [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-23T13:34:47.000Z",
    "title": "Exciting new Pushd (PUSHD) presale captures attention from BNB (BNB) and Ripple (XRP) investors",
    "url": "https://nulltx.com/exciting-new-pushd-pushd-presale-captures-attention-from-bnb-bnb-and-ripple-xrp-investors/",
    "description": "In the changing world of cryptocurrency, Pushd (PUSHD) stands out as an interesting option for investors looking beyond BNB (BNB) and Ripple (XRP). While BNB Chain sees a significant drop in crypto losses and XRP faces negative signals, Pushd (PUSHD) stands out with its peer-to-peer trading platform. With no transaction [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-23T13:32:56.000Z",
    "title": "Polygon (MATIC) & Solana (SOL) investors rush to buy into the Kelexo (KLXO) presale",
    "url": "https://nulltx.com/polygon-matic-solana-sol-investors-rush-to-buy-into-the-kelexo-klxo-presale/",
    "description": "2024 is in full swing, and the crypto market is off to an interesting start. Some altcoins have been on the wrong end of a bear, such as Polygon (MATIC). On the other hand, altcoins like Solana (SOL) are holding up their gains remarkably well. As expected, though, high-potential presale [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-23T12:57:37.000Z",
    "title": "Bitcoin sliding, analysts explore altcoin alternative",
    "url": "https://crypto.news/bitcoin-sliding-analysts-explore-altcoin-alternative/",
    "description": "As Bitcoin drops below $40k, analysts are exploring alternatives, mainly Bitcoin Minetrix"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-23T12:56:19.000Z",
    "title": "Animoca-backed project comments on $15m exploit of token contracts",
    "url": "https://crypto.news/animoca-backed-project-comments-on-15m-exploit-of-token-contracts/",
    "description": "Blockchain project Gamee reported exploiting contracts for the native token Gamee (GMEE). In a Jan. 23 post, Animoca Brands-backed Gamee confirmed that its GMEE contracts to Polygon had been subject to &#8220;unauthorized access.&#8221; The incident resulted in the theft of&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-23T12:53:25.000Z",
    "title": "Can X send SHIB price to $0.00002?",
    "url": "https://crypto.news/can-x-send-shib-price-to-0-00002/",
    "description": "Shiba Inu community's response to speculations about X(Twitter)’s payments platform launch could impact SHIB price action. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-23T13:00:36.000Z",
    "title": "Shiba Inu Ecosystem Soars: Shibarium Hits Crucial Milestone",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-ecosystem-soars-shibarium-hits-crucial-milestone/",
    "description": "In an exciting turn of events, Shibarium, the Ethereum-based layer 2 blockchain of Shiba Inu, has witnessed yet another crucial milestone in its overall number of transactions carried out on the platform. Shiba Inu Blockchain Latest Milestone The total number of transactions on the layer 2 blockchain has skyrocketed since Shibarium was launched, surpassing several crucial milestones. In addition, the blockchain is gaining enormous traction and has seen widespread utilization from its community members. The Shiba Inu blockchain recently reached another important benchmark after surpassing the 300 million transactions threshold. This achievement comes just five months after Shibarium was introduced by the Shiba Inu team. Related Reading: Shiba Inu Community Celebrates New Milestone One Day After Shibarium Goes Public Data from Shibariumscan.io reveals that the total number of transactions carried out within the platform is sitting at 304,137,502. These transactions were carried out by approximately 1.3 million wallet addresses. Shibarium&#8217;s performance goes beyond the total number of transactions on the network. The platform shows that over 2.7 million blocks have been processed, totaling 2,788,561. Despite the development, the network&#8217;s activity appears to be slowing down. The data from the network&#8217;s tracker shows that the average daily count is sitting at 2.69 million. This is a drop from the average 7 million transaction count it recorded throughout last month. Shibarium&#8217;s latest milestone comes amidst a massive whale transaction that saw over 400 billion Shiba Inu tokens being moved between unknown wallets. According to data from Etherscan, the transaction totalled 419,872,915,864 SHIB, valued at a whopping $3.87 million. The reports show that the unknown wallet, identified as 0xecfB3971, moved the aforementioned funds to another unknown wallet address, 0xd373B9. The move has since raised speculations around the community because both addresses are still unrecognized. SHIB Community Celebrates The Latest Heights Members of the Shiba Inu community have been celebrating the latest achievement as Shibarium transactions have topped 300 million. The team has also shared the accomplishment on the social media platform X (formerly Twitter). Related Reading: SHIB Roars As Shibarium Hits 100 Million Transactions – Big Things Unfolding In the X post, the team highlighted that the ShibArmy had taken Shibarium transaction volume to unprecedented heights. The Shiba Inu team has always attributed such heights to its stellar community.  Furthermore, it stated that the Shibarium rollercoaster only goes in the &#8220;UP&#8221; trajectory. According to the comment, Shibarium&#8217;s transaction volume and other statistics are likely to rise continuously. The post read: SHIBARMY is driving Shibarium to new heights. This rollercoaster truly has only one direction: UP. Currently, the price of Shiba Inu is still down despite the project&#8217;s milestone. SHIB is trading at $0.00000872, indicating a decline of over 4.50% in the last 24 hours. Data from CoinMarketCap shows that Shiba Inu&#8217;s market cap is also down by the same percentage as its price. Meanwhile, although the price of SHIB is down, its trading volume is indicating an over 24% daily increase. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-23T13:18:31.000Z",
    "title": "Shiba Inu Burn Rate Skyrockets 400% Amidst Whopping 4 Trillion SHIB Whale Activity",
    "url": "https://www.crypto-news-flash.com/shiba-inu-burn-rate-skyrockets-400-amidst-whopping-4-trillion-shib-whale-activity/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-burn-rate-skyrockets-400-amidst-whopping-4-trillion-shib-whale-activity",
    "description": "<img width=\"2133\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-blue-trading-charts-going-up.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba-Inu-SHIB-logo-with-blue-trading-charts-going-up\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-blue-trading-charts-going-up.jpg 2133w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-blue-trading-charts-going-up-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-blue-trading-charts-going-up-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-blue-trading-charts-going-up-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-blue-trading-charts-going-up-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-blue-trading-charts-going-up-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-blue-trading-charts-going-up-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-blue-trading-charts-going-up-450x253.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-blue-trading-charts-going-up-1200x675.jpg 1200w\" sizes=\"(max-width: 2133px) 100vw, 2133px\" />The Shiba Inu burn rate has significantly benefited from the heightened whale activity and the increased adoption of Shibarium-based DeFi protocols. Shiba Inu price has gradually been turning to a rising trend characterized by higher highs and higher lows on the weekly time frame, thus indicating more buying pressure. Shiba Inu (SHIB), the second largest [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-23T12:48:31.000Z",
    "title": "OKB Crash Triggers OKX Investigation: Causes of Sudden Drop Sought",
    "url": "https://www.crypto-news-flash.com/okb-crash-triggers-okx-investigation-causes-of-sudden-drop-sought/?utm_source=rss&utm_medium=rss&utm_campaign=okb-crash-triggers-okx-investigation-causes-of-sudden-drop-sought",
    "description": "<img width=\"640\" height=\"427\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/adam-smigielski-K5mPtONmpHM-unsplash.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Trading charts\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/adam-smigielski-K5mPtONmpHM-unsplash.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/adam-smigielski-K5mPtONmpHM-unsplash-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/adam-smigielski-K5mPtONmpHM-unsplash-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/adam-smigielski-K5mPtONmpHM-unsplash-450x300.jpg 450w\" sizes=\"(max-width: 640px) 100vw, 640px\" />OKX investigates OKB&#8217;s 50% drop, as cryptomarket awaits clarity on suspicious deposits and their impact. OKB recovers post-crash value; crypto community awaits OKX report to unveil causes of recent volatility. The crypto community is on alert following an unexpected jolt in the value of the OKB token, the native asset of OKX, a well-known cryptocurrency [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-23T12:41:11.000Z",
    "title": "Unlocking the Bitcoin Mystery: Why It Dipped Below $40K – 3 Key Insights",
    "url": "https://www.crypto-news-flash.com/unlocking-the-bitcoin-mystery-why-it-dipped-below-40k-3-key-insights/?utm_source=rss&utm_medium=rss&utm_campaign=unlocking-the-bitcoin-mystery-why-it-dipped-below-40k-3-key-insights",
    "description": "<img width=\"1812\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background.\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background.jpg 1812w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-1024x678.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-768x509.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-1536x1017.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-150x99.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-450x298.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-1200x795.jpg 1200w\" sizes=\"(max-width: 1812px) 100vw, 1812px\" />Grayscale moves 15,308 BTC to Coinbase Prime, generating market speculation about safe custody strategies. Critics like Peter Schiff and news from Mt. Gox inject uncertainty, boosting Bitcoin price volatility. Bitcoin&#8217;s recent plunge below $40,000 has triggered a wave of speculation and analysis in the crypto ecosystem. Despite the decline in value, the digital currency saw [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-23T12:49:41.000Z",
    "title": "Beware: Phishing Scams Target Crypto Users, $580K Stolen",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/beware-phishing-scams-target-crypto-users-580k-stolen/",
    "description": "<p>As a result of these deceitful tactics, an alarming sum of approximately $580,000 has already been stolen. Be careful! Phishing emails look real, making it hard for crypto users to tell if they&#8217;re legit. In this article, you will discover some phishing scams cases that you should be aware of. Stay alert! Alert: Phishing Scams [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/beware-phishing-scams-target-crypto-users-580k-stolen/\">Beware: Phishing Scams Target Crypto Users, $580K Stolen</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-23T12:59:00.000Z",
    "title": "ONDO Project Team Faces Heat for Tanking Token After Suspected Dump",
    "url": "https://coinedition.com/ondo-project-team-faces-heat-for-tanking-token-after-suspected-dump/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"User Accuses Ondo Team of Selling Millions of ONDO Tokens\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21.jpg 730w, https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/01/price-Chart-21-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent tweet on X (formerly Twitter), an X crypto enthusiast flagged a series of suspected ONDO sales by the project’s team as the reason behind the token’s sudden steep decline in the early hours of Tuesday and Monday. The alleged sales followed an upward trend in the token’s price the previous week. In [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ondo-project-team-faces-heat-for-tanking-token-after-suspected-dump/\">ONDO Project Team Faces Heat for Tanking Token After Suspected Dump</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-23T12:45:50.000Z",
    "title": "Crypto Markets Likely To Go ‘Ballistic’ in 2024 With Altcoins Outshining Bitcoin: Analyst Jason Pizzino",
    "url": "https://dailyhodl.com/2024/01/23/crypto-markets-likely-to-go-ballistic-in-2024-with-altcoins-outshining-bitcoin-analyst-jason-pizzino/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/2024-With-Altcoins-Outshining.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/2024-With-Altcoins-Outshining.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2024/01/2024-With-Altcoins-Outshining.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/2024-With-Altcoins-Outshining.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/2024-With-Altcoins-Outshining.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/2024-With-Altcoins-Outshining.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/01/2024-With-Altcoins-Outshining.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Analyst Jason Pizzino thinks altcoins could outshine Bitcoin (BTC) this year as the crypto markets anticipate two potential bullish catalysts. In a new YouTube video, Pizzino tells his 307,000 subscribers that two massive events for the crypto space are coming up this year: the Bitcoin halving and the US presidential election. Pizzino thinks the halving, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/23/crypto-markets-likely-to-go-ballistic-in-2024-with-altcoins-outshining-bitcoin-analyst-jason-pizzino/\">Crypto Markets Likely To Go ‘Ballistic’ in 2024 With Altcoins Outshining Bitcoin: Analyst Jason Pizzino</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]