[
  {
    "source": "CoinDesk",
    "date": "2024-04-08T06:31:24.000Z",
    "title": "HashKey’s Crypto Exchange Goes Live After Winning License in Bermuda",
    "url": "https://www.coindesk.com/policy/2024/04/08/hashkeys-crypto-exchange-goes-live-after-winning-license-in-bermuda/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The HashKey Group, an Asian firm offering digital asset services, has launched the HashKey Global exchange, after being granted a license in Bermuda to offer licensed digital asset trading services, it announced on Monday."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-08T06:30:38.000Z",
    "title": " HashKey follows Coinbase in opening global exchange in Bermuda ",
    "url": "https://cointelegraph.com/news/hashkey-global-crypto-exchange-launch-bermuda",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvYmFhMjVlMGQtM2E5OC00NDFmLTkyNTktNjI1NjlhMmI1ZTEzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Hashkey Global, the crypto group’s latest exchange, aims to expand outside its native Hong Kong and take on Coinbase’s international exchange.</p>\n                    <p><p>Crypto service provider HashKey Group has joined rival Coinbase in launching a global crypto exchange based out of Bermuda called HashKey Global.</p><p>Hashkey Global managing director Ben El-Baz <a href=\"https://www.bloomberg.com/news/videos/2024-04-08/hashkey-global-md-on-new-crypto-exchange-video\" target=\"_blank\" rel=\"noopener nofollow\">told</a> Bloomberg on April 8 that after it saw Coinbase score a Bermuda license to operate its international exchange, it “looked at all the different options, and we found that to be a very, very suitable and good regulatory regime for us to expand from.\"</p><p>He added after FTX collapsed in 2022, exchange users now “better understand what counterparty risk looks like for exchanges” and believed there was a gap for HashKey Global to combine the “user experience and product experience” of Binance and the “regulatory and safety back end” of Coinbase. </p><p><a href=\"https://cointelegraph.com/news/hashkey-global-crypto-exchange-launch-bermuda\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-04-08T06:10:49.000Z",
    "title": "Prominent Analyst on Ripple’s Upcoming XRPL-Powered USD-Backed Stablecoin: ‘This Changes Everything for Ripple’",
    "url": "https://www.cryptoglobe.com/latest/2024/04/prominent-analyst-on-ripples-upcoming-xrpl-powered-usd-backed-stablecoin-this-changes-everything-for-ripple/",
    "description": "Last Friday, Kevin Paffrath, on his highly popular YouTube channel Meet Kevin, kicked off the discussion by highlighting Ripple’s landmark victory in July 2023, when the SEC declared that the XRP token is not inherently a security. Paffrath pointed out how this regulatory win was a pivotal moment for Ripple, setting a precedent for the […]\n"
  }
]