[
  {
    "source": "CoinDesk",
    "date": "2023-06-01T19:11:52.000Z",
    "title": "Litecoin Starts June Strong as Investors Eye August Halving, Uptick in Activity",
    "url": "https://www.coindesk.com/markets/2023/06/01/litecoin-starts-june-strong-as-investors-eye-august-halving-uptick-in-activity/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "LTC has outperformed both bitcoin and ether over the last 30 days."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T19:14:51.000Z",
    "title": "Don't be surprised if AI tries to sabotage your crypto",
    "url": "https://cointelegraph.com/news/artificial-intelligence-crypto-your-own-risk",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/f7196201-da2c-4fd2-8b7d-142d4ea231d6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>My own exchange, Bitget, tried using AI to respond to customer inquiries — and the results reminded us that AI tools come with perils.</p>\n                    <p><p>As the world of <a href=\"https://cointelegraph.com/learn/crypto-trading-basics-a-beginners-guide-to-cryptocurrency-order-types\">cryptocurrency trading</a> evolves, so does the technology supporting it. In recent years, we've seen a surge in AI tools like ChatGPT being integrated into various facets of the crypto landscape. This development, while exciting, is not without its drawbacks. </p><p>A recent survey by my own exchange — Bitget — found that in 80% of cases, crypto traders admitted to having negative experiences with <a href=\"https://cointelegraph.com/news/learn-javascript-using-chatgpt\">ChatGPT</a>. Specific examples included false investment advice, misinformation and falsification of facts.</p><h3>Misleading investment recommendations </h3><p>Artificial intelligence is not an omnipotent entity but, rather, a man-made tool. AI and, more specifically, ChatGPT, operate within parameters set by human developers, and while its capabilities are impressive, they're not without their limitations. Our society's understanding of these tools is still maturing, and it's critical to recognize their potential risks, especially when it comes to financial decisions.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/who-was-front-running-binance-users\"><strong><em>Who was front-running Binance users?</em></strong></a></p><p>In the pursuit of better customer experience and innovation, many fintech companies <a href=\"https://cointelegraph.com/news/amazon-is-hiring-ai-engineers-to-build-a-chatgpt-like-search-interface\">are exploring</a> the potential benefits of incorporating AI into their operations. The experiments with using AI for customer inquiries, design, copywriting and coding, however, have shown that human talent still outperforms AI most of the time.</p><p>Bitget tried using ChatGPT to handle routine customer inquiries. Initially, we were impressed by its proficiency in analyzing and compiling the information. However, as we delved into more complex queries, the cracks began to show. Despite being trained on extensive data, ChatGPT sometimes offers misleading, biased or incomplete information, as a recent internal test reminded us.</p><p>When our staff inquired about market sentiment regarding a lesser-known altcoin, ChatGPT mistakenly associated the coin's name with a popular internet meme. The resulting response, although amusing, may have been taken seriously by those new to the market who rely heavily on third-party programs.</p><p>Another request came from a user who asked why <a href=\"https://cointelegraph.com/learn/terra-luna-beginners-guide-to-the-blockchain-for-stablecoins\">Terra’s LUNA</a> was trading 95% lower than last year after said user received a list of prospective coins from ChatGPT to consider. The question was: “What are 30 cryptocurrencies that I can consider investing in based on the criteria of the best team, tokenomics, security, and reliability?”</p><p>When I tried to ask the same question and clarify why LUNA was on the recommended list, ChatGPT started offering another coin, quickly changing its mind.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/18ac7939-e8bb-4d31-8b70-6da0b785a145.jpg\"  /><figcaption style=\"text-align: center;\"><em>ChatGPT wants you to invest in LUNA. Source: Screen capture</em></figcaption></figure><p>The thing is that language models like GPT-4 and GPT-3, which are used in ChatGPT, have access to an outdated information base, which is unacceptable in the trading market, where speed and relevancy matter. For example, FTX, the crypto exchange that went bankrupt in November 2022, is still safe and sound if ChatGPT is to be believed.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/c0ee5672-d83a-48e6-93a9-cf1deaf7d2fd.jpg\"  /><figcaption style=\"text-align: center;\"><em>ChatGPT still wants you to use FTX. Source: Screen capture</em></figcaption></figure><p>Although the exchange collapsed almost a year ago, ChatGPT’s knowledge only runs until September 2021, which means it assumes FTX is still a going concern. </p><h3>The importance of human expertise in crypto trading</h3><p>The crypto landscape is complex and ever-changing. It requires keen human insight and intuition to navigate its many twists and turns. AI tools, while robust and resourceful, lack the human touch necessary to interpret market nuances and trends accurately. It's important to exercise caution, diligence and critical thinking. In the pursuit of technological advancement, both companies and individuals must not overlook the importance of human intuition and expertise.</p><p>As a result, we have chosen to limit our use of AI tools like ChatGPT. Instead, we place a higher emphasis on a blend of human expertise and technological innovation to serve our clients better.</p><p>This is not to say that AI tools don't have their place in the crypto sphere. Indeed, for basic queries or simplifying complex topics, they can prove invaluable. However, they should not be seen as a replacement for professional financial advice or independent research. It's essential to remember that these tools, while powerful, are not infallible.</p><p>In the crypto world, every piece of information carries weight. Each detail can impact investment decisions, and in this high-stakes environment, a misstep can have significant consequences. Thus, while AI tools can provide quick answers, it's crucial to cross-verify this information from other reliable sources. </p><p>Moreover, data privacy is another critical aspect to consider. While AI tools like ChatGPT don't inherently pose a privacy risk, they can be misused in the wrong hands. It's crucial to ensure the data you provide is secure and that the AI tools you use adhere to stringent privacy guidelines.</p><h3>Ethical considerations and data security</h3><p>Still, AI tools like ChatGPT are not the enemy. They're powerful tools that, when used responsibly and in conjunction with human expertise, can significantly enhance the crypto trading experience. They can explain complex jargon, provide quick responses, and even offer rudimentary market analyses. However, their limitations should be acknowledged, and a responsible approach to their use is essential.</p><p>In our journey with ChatGPT, we’ve learned that AI tools are only as effective as their latest update, training and the data they’ve been fed. They may not always be abreast of the latest developments or understand the subtleties of a dynamic and often volatile crypto market. Furthermore, they cannot provide empathy — a quality that is often needed in the tense world of crypto trading.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/brian-armstrong-owes-me-100-in-bitcoin-here-s-why\"><strong><em>Brian Armstrong promised me $100 in Bitcoin — so where is it?</em></strong></a></p><p>The integration of AI in crypto trading also raises ethical questions, especially when it comes to decision-making. If a user makes a financial decision based on misleading information provided by an AI tool, who bears the responsibility? It is a question the industry is still grappling with.</p><p>Then there is the issue of data security. In an era of data breaches and cyber threats, any technology that collects, stores and processes user data must be scrutinized. While AI tools like ChatGPT don't inherently pose a privacy risk, they are not immune to misuse or hacking. It is paramount to ensure that these tools have robust security measures to protect user data.</p><p>It's also worth noting that while AI tools can crunch numbers and provide data-driven insights, they cannot replicate the instinct that experienced traders often rely on. The kind of instinct that is honed over years of trading, observing market trends, and understanding the psychology of other traders. This is something AI, for all its sophistication, cannot learn or emulate.</p><p>While AI tools like ChatGPT offer exciting possibilities for the crypto industry, they should not be seen as a magic bullet. They are tools to aid, not replace people, intuition and financial expertise. As we continue to explore the potential of AI in the crypto world, we must be mindful of these limitations and potential risks.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Gracy Chen</strong> is the managing director of the crypto derivatives exchange Bitget, where she oversees market expansion, business strategy, and corporate development. Before joining Bitget, she held executive positions at the Fortune 500 unicorn company Accumulus and venture-backed VR startups XRSPACE and ReigVR. She was also an early investor in BitKeep, Asia's leading decentralized wallet. She was honored in 2015 as a Global Shaper by the World Economic Forum. She graduated from the National University of Singapore and is currently pursuing an MBA degree at the Massachusetts Institute of Technology.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-01T19:30:10.000Z",
    "title": "Cleanspark Bolsters Hashrate With $40.5M Purchase of 12,500 Bitcoin Miners",
    "url": "https://news.bitcoin.com/cleanspark-bolsters-hashrate-with-40-5m-purchase-of-12500-bitcoin-miners/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/cspark-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Cleanspark Bolsters Hashrate With $40.5M Purchase of 12,500 Bitcoin Miners\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/cspark-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cspark-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cspark-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cspark-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cspark-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cspark-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cspark.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On June 1, 2023, Cleanspark, a publicly-traded bitcoin mining company, declared the acquisition of 12,500 Antminer S19 XP bitcoin miners for $40.5 million. The purchase is expected to raise Cleanspark&#8217;s hashrate by an extra 1.76 exahash per second (EH/s). Acquisition to Boost Cleanspark’s Hashpower by 1.76 EH/s Throughout 2023, Cleanspark (Nasdaq: CLSK) has secured a [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T19:18:17.000Z",
    "title": "Ripple: Bank with $3 Trillion Assets Calls XRP a Game Changer for the Distributed Ledger Technology of the Future",
    "url": "https://www.crypto-news-flash.com/ripple-bank-with-3-trillion-assets-calls-xrp-a-game-changer-for-the-distributed-ledger-technology-of-the-future/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-bank-with-3-trillion-assets-calls-xrp-a-game-changer-for-the-distributed-ledger-technology-of-the-future",
    "description": "<p>HSBC recognizes the potential of Ripple&#8217;s distributed ledger technology (DLT) for cross-border payments, highlighting how Ripple&#8217;s XRP ledger enables real-time settlements. HSBC believes DLT can streamline value transfers, reduce costs, operational risks, and settlement periods in the banking industry. HSBC, one of the largest banking institutions with $3 trillion in assets under management, recently heaped [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/ripple-bank-with-3-trillion-assets-calls-xrp-a-game-changer-for-the-distributed-ledger-technology-of-the-future/\">Ripple: Bank with $3 Trillion Assets Calls XRP a Game Changer for the Distributed Ledger Technology of the Future</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]