[
  {
    "source": "Decrypt",
    "date": "2024-01-02T20:19:41.000Z",
    "title": "Sell Signal? Jim Cramer Pulls U-Turn on Bitcoin",
    "url": "https://decrypt.co/211530/sell-signal-jim-cramer-pulls-u-turn-on-bitcoin",
    "description": "The infamous crypto skeptic admits Bitcoin's resilience in the face of government pressure."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-02T20:14:26.000Z",
    "title": "Drake Reveals Crypto Casino Stake's Rebranded F1 Racing Team",
    "url": "https://decrypt.co/211523/drake-reveals-crypto-casino-stakes-rebranded-f1-racing-team",
    "description": "Sauber's F1 team is now officially the Stake team. Rapper, spokesperson, and frequent bettor Drake took to social media to share the news."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-02T20:29:27.000Z",
    "title": "Mad Money’s Jim Cramer flips script on Bitcoin, calls it a ‘technological marvel’",
    "url": "https://cryptoslate.com/mad-moneys-jim-cramer-flips-script-on-bitcoin-calls-it-a-technological-marvel/",
    "description": "<p>Jim Cramer, known for his influential role as the host of CNBC&#8217;s &#8220;Mad Money,&#8221; has completely shifted his stance on Bitcoin (BTC) and now believes it is a &#8220;technological marvel.&#8221; This change of heart is particularly striking given Cramer&#8217;s background as a former Goldman Sachs employee and his staunch criticism of the digital asset in the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/mad-moneys-jim-cramer-flips-script-on-bitcoin-calls-it-a-technological-marvel/\">Mad Money&#8217;s Jim Cramer flips script on Bitcoin, calls it a &#8216;technological marvel&#8217;</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-02T20:32:29.000Z",
    "title": "Uptick in Solana airdrop scams: Nest Wallet CEO loses $125k",
    "url": "https://crypto.news/uptick-in-solana-airdrop-scams-nest-wallet-ceo-loses-125k/",
    "description": "The Solana Network, riding a wave of increased trading activity, also sees an increase in airdrop scams. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-02T20:32:34.000Z",
    "title": "Bitcoin Trend Strength Exhibits Striking Similarities With Last Bull Run",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-trend-strength-striking-similarities-last-bull-run/",
    "description": "Bitcoin price is above $45,000 for the first time since April 2022 and according to the weekly Average Directional Index, the rally might not be stopping anytime soon. That&#8217;s because the trend strength measuring tool is beginning to show shocking similarities with the 2021 bull run. Bitcoin Bull Run Deja Vu: 2021 Versus 2024 When Bitcoin is trending, it is wise to get out of the way. The same is true regardless of whether or not BTCUSD is in an uptrend or a downtrend. Currently, the top cryptocurrency by market cap is in an uptrend, according to the Average Directional Index. Related Reading: Bitcoin At $45,000 Is Mispriced, Will Race For ETF Fees Push Prices To Record Highs? The tool is designed to measure the strength of a trend on any timeframe. When the ADX is growing and rises above 20, it suggests there is an active trend in play. Below 20, and there isn&#8217;t enough evidence of a trend, which could suggest sideways price action. Not only is the weekly ADX in Bitcoin above 20, but is is above 51. Reaching above 51 in late 2020, resulted in four-week-long 120% push higher. If the same magnitude move follows, BTCUSD could hit $94,000 per coin by mid-February. All About The Average Directional Index The Average Directional Index is a trend-strength measuring tool designed by J. Welles Wilder, Jr., the creator of other technical analysis tools such as The ADX reading in dark blue above shows the strength of a trend. The ADX, however, comes equipped with two Directional Indicators, the DI+ and DI-. Not only is the ADX in the exact location of the late 2020, early 2021 bull run, but the DI+ in green and DI- in red are also at the same level. Related Reading: Bitcoin’s Road To Record Heights: Analysts Forecast Post-Halving Surge This could hint at the same ripe conditions for a parabolic rally. In 2021, Bitcoin peaked when the ADX reached 85 and began to tumble back downward. If BTCUSD exceeds this level, we could be looking at an even stronger rally than expected. If it fails to reach above 85, yet sets a new all-time high, a bearish divergence could warn of an impending top in crypto. Whatever the case may be, the ADX could be an important tool in understanding cryptocurrency trends. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-02T20:37:52.000Z",
    "title": "Kaspa Targets New Highs: Parallel Analysis with Solana",
    "url": "https://www.crypto-news-flash.com/kaspa-targets-new-highs-parallel-analysis-with-solana/?utm_source=rss&utm_medium=rss&utm_campaign=kaspa-targets-new-highs-parallel-analysis-with-solana",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/kaspa-blockchain.webp\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"kaspa-blockchain\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />Kaspa could reach a value between $0.35 and $0.40 according to Max&#8217;s analysis, based on similarities with Solana&#8217;s track record. Max highlights the importance of the 2.618 Fibonacci extension in Kaspa&#8217;s analysis, indicating a possible significant increase in price. Cryptocurrency analyst Max has conducted a comparative study between Kaspa (KAS) and Solana (SOL), focusing on [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-02T20:24:43.000Z",
    "title": "Shiba Inu Overcomes Barriers: Towards New Market Highs",
    "url": "https://www.crypto-news-flash.com/shiba-inu-overcomes-barriers-towards-new-market-highs/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-overcomes-barriers-towards-new-market-highs",
    "description": "<img width=\"2133\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-blue-trading-charts-going-up.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba-Inu-SHIB-logo-with-blue-trading-charts-going-up\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />Shiba Inu (SHIB) recorded a 4% increase, surpassing the $0.00001085 level and aiming to reach $0.00001118 soon. SHIB&#8217;s growth is driven by interest in Shibarium, with more than 33 billion tokens recently burned. Shiba Inu (SHIB), the popular cryptocurrency project, is showing remarkable performance in the market. Recently, it has reached a 4% increase, setting [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-02T20:24:07.000Z",
    "title": "XRP on the Threshold of a Historic Rally: Will it reach $3.70?",
    "url": "https://www.crypto-news-flash.com/xrp-on-the-threshold-of-a-historic-rally-will-it-reach-3-70/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-on-the-threshold-of-a-historic-rally-will-it-reach-3-70",
    "description": "<img width=\"1992\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-Price-rising-in-gray-format-with-a-keyboard-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple-XRP-Price-rising-in-gray-format-with-a-keyboard-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />XRP could reach $3.70, a 487% increase, following historical patterns and market analysis by expert EGRAG. Recent XRP indicators show a consolidation phase similar to previous cycles, signaling possible significant rally. EGRAG bases its projection on a historical pattern observed in XRP&#8217;s behavior. This pattern, identified in two previous cycles, is characterized by a slightly [...]"
  }
]