[
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T15:13:11.000Z",
    "title": "Proof of Stake Alliance updates recommendations for staking providers",
    "url": "http://cointelegraph.com/news/proof-of-stake-alliance-updates-recommendations-staking-providers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/2e4b01da-57cf-4749-b293-14910585474c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The POSA updated its staking principles to say that providers should communicate clearly and should not control the amount of liquidity a user must provide.</p>\n                    <p><p>The Proof of Stake Alliance (POSA), a non-profit organization that represents firms in the crypto staking industry, published an updated version of its “staking principles” on Nov. 9. The new principles are supported by Ava Labs, Alluvial, Coinbase, Lido Protocol, Paradigm, and ten other staking industry firms.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/47a3c8d5-bad1-456c-9fc3-64847e608c5d.png\"  /><figcaption style=\"text-align: center;\"><em>Previous version of the POSA staking principles. Source: POSA.</em></figcaption></figure><p>POSA represents 15 different firms in the staking industry, including Alluvial, Ava Labs, Blockdaemon, Coinbase, Credibly Neutral, Figment, Infstones, Kiln, Lido Protocol, Luganodes, Methodic, Obol, Polychain, Paradigm, and Staking Rewards. </p><p>The staking principles were first <a href=\"https://medium.com/proof-of-stake-alliance-posa/posa-advances-staking-as-a-service-industry-driven-solutions-60180943773b\" target=\"_blank\" rel=\"noopener nofollow\">published</a> in 2020. According to the blog post that announced them, the POSA staking principles are meant to be “a set of industry-driven solutions” that providers can implement to address the concerns of regulators and to encourage responsible practices in the industry. </p><p>The old version of the staking principles says staking providers should not give investment advice, guarantee the amount of staking rewards that can be obtained, or imply that they have control over a protocol in their marketing materials. Instead, they should advertise that their products provide access to a protocol and allow users to enhance security. In addition, the principles state that staking providers should use non-financial terminology such as “staking reward” in their marketing materials instead of financial terms like “interest.”</p><p>The Nov. 9 announcement says three new principles will be added. First, staking providers will be encouraged to provide “Clear communication […] To ensure users have all the information necessary to make informed decisions.” Second, users should be able to decide how much of their assets they want to stake, as this will promote “user ownership of staked assets.\" Third, staking providers should have “explicitly delineated responsibilities” and “should not manage or control liquidity for users.”</p><p>The crypto staking industry has been criticized by some regulators, who claim it's a cover for issuing unregistered securities. Kraken’s staking service was <a href=\"https://cointelegraph.com/news/kraken-reaches-30m-settlement-with-sec-over-staking\">shut down by the U.S. Securities and Exchange Commission </a>on Feb. 9; the exchange was ordered to pay $30 million in damages for allegedly violating securities laws. However, other staking providers have claimed that their staking services are not securities. For example, POSA member Coinbase argued that its service <a href=\"https://cointelegraph.com/news/coinbase-staking-fundamentally-different-to-kraken-s-chief-lawyer\">is “fundamentally different”</a> from Kraken’s and does not violate securities laws.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-09T15:38:14.000Z",
    "title": "ETH crosses $2K as BlackRock’s Ethereum Trust filing surfaces",
    "url": "https://cryptoslate.com/eth-crosses-2k-as-blackrocks-ethereum-trust-filing-surfaces/",
    "description": "<p>BlackRock has taken the initial step toward filing for a spot Ether ETF, with the iShares Ethereum Trust recently registered in Delaware. This move is reminiscent of BlackRock&#8217;s iShares Bitcoin Trust, which was registered in a similar fashion seven days before the ETF application was filed with the U.S. Securities and Exchange Commission (SEC). In [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/eth-crosses-2k-as-blackrocks-ethereum-trust-filing-surfaces/\">ETH crosses $2K as BlackRock&#8217;s Ethereum Trust filing surfaces</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-09T15:20:35.000Z",
    "title": "Rising Physical Assaults on Crypto Owners in Sweden Sparks Safety Concerns",
    "url": "https://www.cryptoglobe.com/latest/2023/11/rising-physical-assaults-on-crypto-owners-in-sweden-sparks-safety-concerns/",
    "description": "Eric Wall, a notable cryptocurrency analyst, has brought to light a series of violent incidents targeting Swedish crypto owners, as shared in his recent social media posts. Wall’s detailed account on platform X, formerly known as Twitter, on 8 November, paints a grim picture of the current state of personal security for crypto enthusiasts in […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-09T15:36:53.000Z",
    "title": "Solana (SOL) and Ripple (XRP) Price Prediction, Everlodge (ELDG) Whales Top Pick for November",
    "url": "https://cryptodaily.co.uk/2023/11/solana-sol-and-ripple-xrp-price-prediction-everlodge-eldg-whales-top-pick-for-november",
    "description": "Solana (SOL) and Ripple (XRP) have long been on the radar for their potential price movements, but a new player is making waves."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-09T15:21:44.000Z",
    "title": "Experts Weigh In: Can Bitcoin Triple Its Value? Promising Outlook for Lido DAO (LDO) and VC Spectra (SPCT)",
    "url": "https://cryptodaily.co.uk/2023/11/experts-weigh-in-can-bitcoin-triple-its-value-promising-outlook-for-lido-dao-ldo-and-vc-spectra-spct",
    "description": "Prominent financial expert Robert Kiyosaki has speculated on the levels the inaugural crypto, Bitcoin (BTC), could attain in the offing."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-09T15:15:24.000Z",
    "title": "Fast Growing Bitcoin ETF Token (BTCETF) Presale Raises $100,000 In 72 Hours",
    "url": "https://cryptodaily.co.uk/2023/11/fast-growing-bitcoin-etf-token-btcetf-presale-raises-100000-in-72-hours",
    "description": "The highly-anticipated Bitcoin ETF Token (BTCETF) presale has raised over $100,000 in just 72 hours, demonstrating strong demand for speculative exposure to major spot Bitcoin ETF developments."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T15:10:53.000Z",
    "title": "Binance faces an uphill battle as the SEC deems the defense weak in the ongoing lawsuit",
    "url": "https://www.cryptopolitan.com/binance-uphill-battle-against-the-sec/",
    "description": "The U.S. Securities and Exchange Commission has been in the spotlight in the financial world as it has pursued various actions against the crypto industry, including Binance Crypto Exchange. The legal battle between the parties has been followed up by experts, and proceedings amid the case show the SEC dismissed Binance&#8217;s request to dismiss.  A ... <a title=\"Binance faces an uphill battle as the SEC deems the defense weak in the ongoing lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-uphill-battle-against-the-sec/\" aria-label=\"More on Binance faces an uphill battle as the SEC deems the defense weak in the ongoing lawsuit\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-09T15:32:52.000Z",
    "title": "CoinGecko reports Arbitrum is largest L2 solution",
    "url": "https://crypto.news/coingecko-reports-arbitrum-as-being-the-largest-l2-solution/",
    "description": "In a Nov. 9 post on X, CoinGecko reports Arbitrum as being the largest Layer 2 solution, with a total of $1.79 billion in total value locked (TVL) in October, or 41.2% of the top 10 L2 solutions market share."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-09T15:18:38.000Z",
    "title": "Analysts compare growth potential of Galaxy Fox, Wall Street Memes, and PEPE",
    "url": "https://crypto.news/analysts-compare-growth-potential-of-galaxy-fox-wall-street-memes-and-pepe/",
    "description": "Analysts are bullish on Galaxy Fox and expect it to outperform Wall Street Meme and PEPE in the bull cycle"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-09T15:32:46.000Z",
    "title": "Legendary Game Developer Behind Assassin’s Creed Ventures into Crypto Gaming with Immutable – Details",
    "url": "https://www.crypto-news-flash.com/legendary-game-developer-behind-assassins-creed-ventures-into-crypto-gaming-with-immutable-details/?utm_source=rss&utm_medium=rss&utm_campaign=legendary-game-developer-behind-assassins-creed-ventures-into-crypto-gaming-with-immutable-details",
    "description": "<img width=\"720\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/40k.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/40k.jpg 720w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/40k-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/40k-104x69.jpg 104w\" sizes=\"(max-width: 720px) 100vw, 720px\" />The Partnership between Ubisoft and Immutable is expected to further unlock the web3 potential and create a new gaming experience, thus helping improve the IMX trading volume and overall liquidity. The partnership with Ubisoft signifies a major milestone for Immutable following the successful TestNet launch of its zero-knowledge roll-up gaming solution Immutable zkEVM, and successful [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-09T15:39:29.000Z",
    "title": "BlackRock Registers Ethereum ETF in Delaware",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/blackrock-registers-ethereum-etf-in-delaware/",
    "description": "<p>The Ethereum ETF will track the performance of the Ethereum spot price. It will be available to institutional and retail investors in the United States. The registration of the Ethereum ETF is a positive development for the crypto industry, as it signals that large institutional investors like BlackRock are becoming increasingly comfortable with crypto assets. [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/blackrock-registers-ethereum-etf-in-delaware/\">BlackRock Registers Ethereum ETF in Delaware</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-09T15:30:59.000Z",
    "title": "Grayscale’s Chainlink Trust (GLINK) Explodes 223% As LINK Outperforms Crypto Market",
    "url": "https://dailyhodl.com/2023/11/09/grayscales-chainlink-trust-glink-explodes-223-as-link-outperforms-crypto-market/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/GLINK-Explodes-to-201.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/GLINK-Explodes-to-201.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/GLINK-Explodes-to-201.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/GLINK-Explodes-to-201.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/GLINK-Explodes-to-201.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/GLINK-Explodes-to-201.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/GLINK-Explodes-to-201.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Grayscale&#8217;s Chainlink Trust (GLINK) is currently trading at a 223% premium, signaling institutional investors are particularly eager to get their hands on the digital asset investment product. The trust offers institutions a way to gain exposure to the native asset of decentralized oracle provider Chainlink (LINK) without directly investing in the crypto asset. GLINK is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/09/grayscales-chainlink-trust-glink-explodes-223-as-link-outperforms-crypto-market/\">Grayscale’s Chainlink Trust (GLINK) Explodes 223% As LINK Outperforms Crypto Market</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]