[
  {
    "source": "CoinDesk",
    "date": "2023-06-28T15:50:55.000Z",
    "title": "GBTC Volume Increases 79% in June Amid TradFi ETF Applications",
    "url": "https://www.coindesk.com/markets/2023/06/28/gbtc-volume-increases-79-in-june-amid-tradfi-etf-applications/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The trust’s trading volume increased to $45 million in June."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-28T15:43:45.000Z",
    "title": "ARK Amends Spot Bitcoin ETF Filing to Include Surveillance Sharing, Similar to BlackRock",
    "url": "https://www.coindesk.com/business/2023/06/28/ark-amends-spot-bitcoin-etf-filing-to-include-surveillance-sharing-similar-to-blackrock/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "ARK's application may now be in pole position to be approved first as as it was filed earlier than BlackRock's."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-28T16:01:23.000Z",
    "title": "Girlfriends, murdered kids, assassin androids — is AI cursed?",
    "url": "https://cointelegraph.com/news/girlfriends-murdered-kids-assassin-androids-is-ai-cursed",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/e5a11f81-bca6-4cf1-ab1d-9f42bc21f76f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Artificial intelligence has provided the world with tools that might make life easier. But there has also been a slew of disturbing developments.</p>\n                    <p><p>Is artificial intelligence (AI) cursed? It seems to be accelerating us toward a dystopia that humanity isn’t ready for.</p><p>AI has brought positive effects such as Twitter hustlers having an endless stream of new AI tools or useless ChatGPT prompts to compile threads on to shill newsletters. AI is also not bad at streamlining information and is used to detect cancer in some cases.</p><p>However, many have chosen to use AI to create content — and sometimes whole businesses — centered on things that sci-fi warned us about.</p><h2>Murdered children remade for ghoulish TikToks</h2><p>“I was put into a washing machine by my father and put on the spin cycle causing my death,” says an AI-created toddler in one TikTok video. He stands in front of a washing machine and recounts an awful yet horrifyingly true story of a three-year-old murdered in 2011.</p><p>It’s the most awful use of generative AI. True crime-loving ghouls making TikToks sometimes using deepfakes of children who were killed — to detail how they were killed.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/1923d6dc-cda8-4aad-953a-c18c99b63fac.jpg\"  /><figcaption style=\"text-align: center;\">This “storytime” account has dozens of AI-generated videos depicting children. Source: TikTok</figcaption></figure><p>Thousands of similar videos plague TikTok with AI-generated voices and images of kids cheerfully laying out “their” gruesome murders. Some are delusional enough to think the videos “honor” the victims.</p><p>Thankfully, not all videos depict the real victims, but some do even though TikTok <a href=\"https://apnews.com/article/tiktok-china-cybersecurity-data-privacy-595f9ae7c0a1fc22f0b285cede6bd67c\" target=\"_blank\" rel=\"noopener nofollow\">banned</a> deepfakes of young people.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I’ve been getting those AI generated true crime tiktoks where the victims narrate what happened to them and I think it’s time we put the true crime community in prison</p>&mdash; alexander (@disneyjail) <a href=\"https://twitter.com/disneyjail/status/1664100531831201792?ref_src=twsrc%5Etfw\">June 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Arguments can be made that the videos highlight stories worth telling to a younger audience with no attention span for longer content, but such “true crime” related media is often exploitative regardless.</p><h2>Are AIs already trying to kill their operators?</h2><p>AIs are coldly bloodthirsty — if skepticism is given to a recent backtrack from Colonel Tucker Hamilton, the chief of AI test and operations for the United States Air Force (USAF).</p><p>Hamilton spoke at a defense conference in May, <a href=\"https://www.aerosociety.com/news/highlights-from-the-raes-future-combat-air-space-capabilities-summit/\" target=\"_blank\" rel=\"noopener nofollow\">reportedly</a> detailing simulated tests for a drone tasked with search-and-destroy missions with a human giving the final go-ahead or abort order. The AI viewed the human as the main impediment to fulfilling its mission.</p><p><strong><em>AI Eye: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-is-ai-a-threat-why-ai-advance/\"><strong><em>Is AI a nuke-level threat? Why AI fields all advance at once, dumb pic puns</em></strong></a></p><p>Hamilton explained:</p><blockquote>“At times the human operator would tell it not to kill [an identified] threat, but it got its points by killing that threat. So what did it do? It killed the operator [...] because that person was keeping it from accomplishing its objective.”</blockquote><p>Hamilton said after it trained the AI not to kill humans, it started destroying a communications tower so it couldn’t be contacted. But when the media picked up on his story, Hamilton conveniently retracted it, saying he “misspoke.”</p><p>In a <a href=\"https://web.archive.org/web/20230603010847/https://www.vice.com/en/article/4a33gj/ai-controlled-drone-goes-rogue-kills-human-operator-in-usaf-simulated-test\" target=\"_blank\" rel=\"noopener nofollow\">statement</a> to Vice, Hamilton claimed it was all a “thought experiment,” adding the USAF would “never run that experiment” — good cover.</p><p>It’s hard to believe considering a 2021 United Nations <a href=\"https://documents-dds-ny.un.org/doc/UNDOC/GEN/N21/037/72/PDF/N2103772.pdf?OpenElement\" target=\"_blank\" rel=\"noopener nofollow\">report</a> detailed AI-enabled drones used in Libya in a March 2020 skirmish during the country’s second civil war.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/17b613e6-a9b1-4836-a3dd-6b65e0ae492d.jpg\"  /><figcaption style=\"text-align: center;\">Pictured is the unassuming STM Kargu, an AI drone that — according to the United Nations — targeted a human target in Libya without orders. Source: STM</figcaption></figure><p>Retreating forces were “hunted down and remotely engaged” by AI drones laden with explosives “programmed to attack” without the need to connect to an operator, the report said.</p><h2>Got no game? Rizz up an AI girlfriend</h2><p>The saddest use of AI would be those who pay to “rizz up” AI chatbots — that’s “flirting” for you boomers.</p><p>A flood of phone apps and websites have cropped up since sophisticated language models, such as ChatGPT-4, were made available through an API. Generative image tools, such as DALL-E and Midjourney, can also be shoehorned into apps.</p><p>Combine the two and the ability to chat online with a “girl” that’s obsessed with you right alongside a fairly realistic depiction of a woman becomes real.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/artificial-intelligence-crypto-your-own-risk\"><strong><em>Don’t be surprised if AI tries to sabotage your crypto</em></strong></a></p><p>In a tell-tale sign of a healthy society, such “services” are being flogged for as much as $100 a month. Many apps are marketed under the guise of allowing men to practice texting women, another sign of a healthy society.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/eefa65cb-0981-48c1-8b8f-6e42bf598e72.jpg\"  /><figcaption style=\"text-align: center;\">One of the cheaper options is this AI girl that loves you forever if you cough up $100 — a bargain really. Source: Anima</figcaption></figure><p>Most allow you to pick the specific physical and personality traits to make your “dream woman,” and a profile including a description of the e-girl is assumedly generated.</p><p>Whatever prompts given to write descriptors about the girl bots from its point of view — as seen on a few apps and websites — always seem overly focused on detailing breast size. Many generated girls describe a blossoming porn career.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/380c0653-b556-4584-a856-1241d3a0b82f.jpg\"  /><figcaption style=\"text-align: center;\">Another site generates hundreds of e-girls that all look the same. Source: DreamGF</figcaption></figure><p>Another whole subset of apps — invariably named some stylization of “rizz” — are AIs meant to help with flirty text responses to actual women on “dating” apps, such as Tinder.</p><p>Regardless of its misuse, AI devs will march on and continue to bring exciting tools to the masses. Let’s just make sure we’re the ones that are using it to make the world better and not something out of an episode of <em>Black Mirror</em>.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Jesse Coghlan</strong> is a deputy news editor for Cointelegraph based out of Australia.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-28T15:59:03.000Z",
    "title": "Cardano Foundation Exec Calls for End to ‘Ultimate Blockchain’ Debate",
    "url": "https://www.cryptoglobe.com/latest/2023/06/cardano-foundation-exec-calls-for-end-to-ultimate-blockchain-debate/",
    "description": "The ongoing debate about the ‘ultimate blockchain’ should cease, according to Mel McCann, Vice President of Engineering at the Cardano Foundation. McCann believes that the appropriateness of a blockchain depends on the specific use cases of individual projects. Speaking at the World Token Summit in Dubai, McCann shared his insights with Cointelegraph reporter Ezra Reguerra […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-28T15:45:00.000Z",
    "title": "Web3's Mass Adoption Doomed Unless We Stop This Alarming Trend of Hacks",
    "url": "https://cryptodaily.co.uk/2023/06/web3s-mass-adoption-doomed-unless-we-stop-this-alarming-trend-of-hacks",
    "description": "<p>Web3, with its vision of a digital world where individuals have control over their data and enjoy secure online transactions, holds great promise for the future. However, this vision is currently undermined by the prevalence of hacks and breaches that continue to plague the Web3 ecosystem. In 2022 alone, over 450 security breaches resulted in the theft of a staggering $4 billion USD in cryptocurrency, highlighting the urgent need for enhanced security measures.</p>\n<p>Decentralized applications (DApps), including those utilizing traditional multisig wallets, face a myriad of vulnerabilities that malicious actors exploit. These vulnerabilities range from coding errors in smart contracts to compromised decentralized storage systems and targeted attacks on individual users through phishing and social engineering tactics. The repercussions of such attacks can be devastating, both for the affected individuals and for the broader adoption of Web3 technologies.</p>\n<p>\"To effectively address these concerns, security must be prioritized from the start,\" emphasized Junming Tan, Crypto Incident Response Investigator APAC at Chainalysis Inc. To protect their digital assets and identities, Web3 users are advised to utilize hardware wallets, enable two-factor authentication, and stay vigilant against phishing attempts. Martinet Lee, Head of Developer Relations at Quantstamp, emphasized the significance of verifying application authenticity and staying informed about potential threats.</p>\n<p>Following industry standards can ensure higher security in Web3 projects. Tu Phan, Founder and CEO of Desig Labs, highlighted:</p>\n\n<p>&ldquo;To keep users from harm in Web3, projects need to proactively prioritize security measures such as multi-factor authentication, encryption, and secure key management in the battle against hacks and exploits. Desig, for example, employs innovative techniques that eliminate the need for passphrases and leverages zero-knowledge technology to protect private keys from phishing attempts and key recreation by attackers.&rdquo;</p>\n\n<p>However, addressing security challenges in Web3 requires more than just individual efforts. The establishment of regulatory frameworks and standards that cover secure development practices, data protection, privacy standards, and auditing requirements is paramount. Collaboration between regulatory bodies, industry experts, and technologists is essential to striking a balance between innovation and security. Open-source initiatives within the Web3 space, including decentralized autonomous organizations (DAOs), encourage community collaboration to enhance security practices and foster a more secure ecosystem.</p>\n<p>Bug bounty programs and responsible disclosure programs play a crucial role in the Web3 security landscape. These initiatives incentivize ethical hackers to identify vulnerabilities, allowing developers to proactively address them. Responsible disclosure programs provide a platform for reporting vulnerabilities, ensuring timely mitigation, and reducing the window of opportunity for potential exploits.</p>\n<p>Fortunately, emerging trends and technologies offer promising avenues for improved security in Web3 applications. Zero-knowledge proofs, for instance, enable private transactions and verifiable computations, bolstering privacy and security. Advancements in decentralized identity systems and blockchain interoperability contribute to stronger security measures. Projects like Desig Protocol are leveraging these novel technologies early on, aiming to provide a safe and secure environment for Web3 users, enabling them to explore and enjoy the space with confidence.</p>\n<p>In their workshop session during the event, Tu Phan, Founder and CEO of Desig Labs, demonstrated how users can leverage Desig to enhance security, manage team finance, DAO or gaming guild operations, and explore any Web3 DApp on any chain with a single Desig wallet. The beta version of Desig will be officially launched in June, followed by activation campaigns with multiple prominent and emerging Layer 1s. Details will be released on their Twitter page.</p>\n<p>By addressing security concerns head-on, both developers and users can contribute to creating a safer Web3 ecosystem. This approach will unlock the full potential of decentralization and the enhanced security offered by Web3, paving the way for a brighter and more secure digital future. With collaborative efforts, robust security measures, and the integration of cutting-edge technologies, we can build a Web3 ecosystem that ensures the protection of user data and facilitates secure online transactions.</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T16:04:43.000Z",
    "title": "Randal Quarles and Vivek Tyagi challenge USD Hegemony with new bank",
    "url": "https://www.cryptopolitan.com/quarles-tyagi-challenge-usd-hegemony-bank/",
    "description": "Under the bold leadership of Randal Quarles, the well-respected banking regulator of the Trump era, and Vivek Tyagi, a former risk officer at the ill-fated Silicon Valley Bank, a unique financial institution christened &#8216;Currency Reserve&#8217; is set to launch. This innovative venture is striving to address the acute global shortage of tangible dollars, a situation ... <a title=\"Randal Quarles and Vivek Tyagi challenge USD Hegemony with new bank\" class=\"read-more\" href=\"https://www.cryptopolitan.com/quarles-tyagi-challenge-usd-hegemony-bank/\" aria-label=\"More on Randal Quarles and Vivek Tyagi challenge USD Hegemony with new bank\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T15:57:29.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the crypto space. Let&#8217;s see what ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T15:57:22.000Z",
    "title": "Shanghai Clearing House embraces digital yuan for settlements",
    "url": "https://www.cryptopolitan.com/shanghai-clearing-house-embrace-digital-yuan/",
    "description": "In a groundbreaking development, Shanghai Clearing House, Asia&#8217;s foremost counterparty clearing institution, is welcoming the digital yuan as a medium of exchange for settlements. This measure heralds a new chapter in the realm of digital currencies as the Chinese central bank&#8217;s digital currency (CBDC) gains a firmer foothold in international commerce. Easing the way for ... <a title=\"Shanghai Clearing House embraces digital yuan for settlements\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shanghai-clearing-house-embrace-digital-yuan/\" aria-label=\"More on Shanghai Clearing House embraces digital yuan for settlements\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T15:45:12.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? The live Aave price today is USD 61.26, with a 24-hour trading volume of USD 87,074,516. Aave is down 4.56% in the last 24 hours. The current CoinMarketCap ranking is #43, with a live market cap of USD 886,278,811. It has a circulating supply of ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-28T15:48:24.000Z",
    "title": "FTX engages in talks to bring back international crypto exchange",
    "url": "https://crypto.news/ftx-engages-in-talks-to-bring-back-international-crypto-exchange/",
    "description": "According to the Wall Street Journal, bankrupt FTX is actively working on resurrecting its main international cryptocurrency exchange, as confirmed by CEO John Ray III."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T16:00:26.000Z",
    "title": "Report Reveals Surge In Institutional Bitcoin Adoption, How Far Will It Go?",
    "url": "https://www.newsbtc.com/bitcoin-news/report-reveals-surge-in-institutional-bitcoin-adoption-how-far-will-it-go/",
    "description": "The cryptocurrency industry has experienced a significant downturn in the last 18 months due to concerns about high inflation and its impact on finances. However, there is evidence of increasing institutional adoption of Bitcoin (BTC) amid these challenging market conditions. Adoption Of Bitcoin Among Top Fintech Companies Prominent fintech companies have amassed substantial amounts of BTC over the past three years, as revealed by a recent report. Notably, Microstrategy&#8217;s BTC purchases amount to nearly $4 billion, despite the current BTC price being 55% lower than its all-time high (ATH). Other notable companies like Tesla, Block (formerly Square), and Galaxy Digital Holding have also demonstrated commitment to retaining their Bitcoin holdings despite the market&#8217;s inherent volatility. Related Reading: Bitcoin Price Consolidates Below $31K As The Bulls Take Back Seat The report also highlights that certain regulatory uncertainties have hindered some top companies from adopting Bitcoin. But nevertheless, recent filings by renowned asset management firms indicate a positive sentiment towards this digital gold, reflecting a bullish momentum. CryptoQuant chart shows that the forthcoming wave of institutional adoption of BTC may not only benefit the companies themselves but also have a significant impact on their clients. Spot Bitcoin ETFs Generate Investor Interest The embrace of Bitcoin&#8217;s futures exchange-traded funds (ETFs) by the US Securities and Exchange Commission (SEC) in late 2021 triggered the entry of major players into the digital asset industry, leading others to push forward and file for Spot Bitcoin ETFs. Esteemed companies such as BlackRock, Fidelity, Citadel, Charles Schwab, and even Nasdaq have entered the fray. As financial experts analyze the situation, they offer valuable advice to investors seeking to capitalize on this evolving landscape. On Wednesday, the price of bitcoin surpassed the $30,000 mark, driven by growing optimism surrounding spot BTC ETF applications submitted by industry giants like BlackRock, WisdomTree, and Valkyrie. However, while BTC has witnessed a remarkable 80% surge in value in 2023, it still remains more than 50% below its peak in November 2021. Presently, US investors have access to bitcoin futures ETFs, which involve investing in futures contracts of BTC—agreements to buy or sell the asset at a predetermined price in the future. But the long-awaited introduction of bitcoin spot ETFs would enable direct investment in the digital currency itself, marking a significant development in the market. Considerations For Investors Amid Prospects Of BTC Spot ETFs The potential introduction of a bitcoin spot exchange-traded fund (ETF) has raised expectations for increased accessibility to the digital currency, enabling investors to buy and sell bitcoin through a brokerage account. However, it is important to approach this development with caution and thorough consideration, as emphasized by financial experts. Related Reading: Bitcoin Price Struggles As Bears Attempt To Drive It Below $30,000 While the prospect of easier access may be enticing, it is essential to exercise prudence and avoid rushing into investments without proper evaluation. Featured image from iStock, charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T16:00:48.000Z",
    "title": "Rising AI Altcoins Fetch (FET) and InQubeta (QUBE) Are Ready to Ignite the Crypto Space in 2023",
    "url": "https://www.crypto-news-flash.com/rising-ai-altcoins-fetch-fet-and-inqubeta-qube-are-ready-to-ignite-the-crypto-space-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=rising-ai-altcoins-fetch-fet-and-inqubeta-qube-are-ready-to-ignite-the-crypto-space-in-2023",
    "description": "Cryptocurrencies like Fetch.ai (FET) and InQubeta (QUBE) are setting the cryptocurrency space on fire as investors gravitate toward altcoins that promote innovations in the artificial intelligence (AI) space. The massive influx of investment capital these altcoins have enjoyed recently isn’t surprising to those who have monitored the market’s attitude toward artificial intelligence.  Mainstream investors have [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T16:00:47.000Z",
    "title": "P2E vs Meme vs Utility. Alex The Doge (ALEX) vs Shiba Inu (SHIB) vs Ethereum (ETH)",
    "url": "https://www.crypto-news-flash.com/p2e-vs-meme-vs-utility-alex-the-doge-alex-vs-shiba-inu-shib-vs-ethereum-eth/?utm_source=rss&utm_medium=rss&utm_campaign=p2e-vs-meme-vs-utility-alex-the-doge-alex-vs-shiba-inu-shib-vs-ethereum-eth",
    "description": "The crypto space is a fascinating landscape of various types of coins, each offering its unique features and benefits. The three broad categories that currently dominate the landscape are Play-to-Earn (P2E) tokens, meme coins, and utility tokens. This diversity is beautifully exemplified in the form of Alex The Doge (ALEX), Shiba Inu (SHIB), and Ethereum [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T16:00:02.000Z",
    "title": "Why Uwerx (WERX) is a Safe Project to Adopt",
    "url": "https://www.crypto-news-flash.com/why-uwerx-werx-is-a-safe-project-to-adopt/?utm_source=rss&utm_medium=rss&utm_campaign=why-uwerx-werx-is-a-safe-project-to-adopt",
    "description": "Uwerx has enjoyed massive buzz since the project announcement and the commencement of its presale. New projects with great utility are usually a good chance for a high-profit margin, attracting many crypto investors to Uwerx. Beyond this, the crypto project&#8217;s utility in the freelance niche positions it for global relevance and a potentially huge success. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T15:41:13.000Z",
    "title": "Bitcoin Price Poised for a Comeback to $60,000, Top Analyst Predicts",
    "url": "https://www.crypto-news-flash.com/bitcoin-price-poised-for-a-comeback-to-60000-top-analyst-predicts/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-price-poised-for-a-comeback-to-60000-top-analyst-predicts",
    "description": "Based on the M1 Money supply, Bitcoin analysts predict the BTC price to surge to $60,000 by the year-end. Bitcoin price moves to a one-year high amid the flood of Bitcoin ETF applications and institutional inflows. The world&#8217;s largest cryptocurrency Bitcoin (BTC) is holding strongly above $30,000 after a major recovery this month following a [...]"
  }
]