[
  {
    "source": "NewsBTC",
    "date": "2023-07-11T03:20:28.000Z",
    "title": "Bitcoin Price Holds Ground But Momentum Keeps Fading Below $31K",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-holds-ground-30k-2/",
    "description": "Bitcoin price is holding the key $30,000 support zone. BTC must settle above $31,000 and $31,400 to start a fresh increase in the near term. Bitcoin is showing a few positive signs above the $30,000 support zone. The price is trading above $30,200 and the 100 hourly Simple moving average. There is a short-term bullish trend line forming with support near $30,400 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could gain bullish momentum if there is a close above $31,200. Bitcoin Price Is Stable Above $30K Bitcoin price started a fresh decline below the $30,500 support zone. However, the bulls were again active above the $30,000 support zone. BTC remained in a range and made another attempt to clear $31,000 but failed. The recent low was formed near $30,214 and the price is now moving higher. There was a move above the 23.6% Fib retracement level of the recent decline from the $31,020 high to the $30,214 low. There is also a short-term bullish trend line forming with support near $30,400 on the hourly chart of the BTC/USD pair. Bitcoin price is now trading above $30,200 and the 100 hourly Simple moving average. The bulls are now facing resistance near the $30,600 level. The next resistance is near the $30,700 zone. It is close to the 61.8% Fib retracement level of the recent decline from the $31,020 high to the $30,214 low, above which the price might retest $31,000. To start a steady increase, the price must settle above $31,000. Source: BTCUSD on TradingView.com The next major resistance is near the $31,400 level. Any more gains could open the doors for a move toward the $32,000 resistance zone. More Losses in BTC? If Bitcoin’s price fails to clear the $30,700 resistance, it could start another decline. Immediate support on the downside is near the $30,200 level and the trend line. The next major support is near the $30,000 level, below which there could be a drop toward $29,850. Any more losses might send the price toward the $29,400 level. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $30,200, followed by $30,000. Major Resistance Levels – $30,700, $31,000, and $31,400."
  }
]