[
  {
    "source": "Cointelegraph",
    "date": "2023-09-15T10:23:41.000Z",
    "title": "Miner returns over $500k in BTC transaction fee overpayment to Paxos",
    "url": "https://cointelegraph.com/news/miner-returns-over-500k-btc-transaction-fee-overpayment-paxos",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/bad4e7e3-12b5-48a1-9ecb-5d1a0eb109e6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin explorer Mempool shared blockchain data that confirmed the funds were sent back on Sept. 15. </p>\n                    <p><p>The Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) miner who received the 19.8 BTC in fees has returned the funds to blockchain infrastructure firm Paxos, after its claims that the company made the mistake of paying over $500,000 in BTC transfer fees. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">F2Pool have sent the 19.82108632 BTC fee overpayment back to Paxos <a href=\"https://t.co/IB32RNq5uO\">https://t.co/IB32RNq5uO</a></p>&mdash; mempool (@mempool) <a href=\"https://twitter.com/mempool/status/1702570463824642310?ref_src=twsrc%5Etfw\">September 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On Sept. 10, the crypto community was puzzled after seeing a BTC transaction that <a href=\"https://cointelegraph.com/news/what-happened-in-crypto-on-the-weekend\">paid around $500,000 in fees</a> to move around $2,000, while the average network fee was around $2. Various speculations were raised, with some believing that the transaction was done by copy-pasting data and accidentally pasting an output into the fee box without double-checking. </p><p>On Sept. 13, Paxos announced that it was their server that made the transfer. Following its claim, the company assured its users that their funds were safe and that the funds <a href=\"https://cointelegraph.com/news/paxos-confirms-responsible-for-500k-mistaken-bitcoin-transaction\">belonged to Paxos</a>. The company also clarified that PayPal was not involved in the mistake and admitted that the error was its own. </p><p>Almost a day after Paxos’ claims, the Bitcoin miner who received the funds went on X (formerly Twitter) to <a href=\"https://cointelegraph.com/news/bitcoin-miner-paxos-20-btc-refund\">express frustrations after agreeing to refund</a> the amount to Paxos. The miner asked their X followers what they would do in his stead, and a majority voted to just distribute the money to other Bitcoin miners. </p><p>However, this advice doesn't appear to have been taken. Blockchain data shared by Bitcoin explorer Mempool <a href=\"https://t.co/z3HHp8S7nU\" target=\"_blank\" rel=\"noopener nofollow\">confirmed</a> that the funds were indeed returned on Sept. 15. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blockchain-how-to-strike-a-balance-between-blockchain-transparency-and-privacy-nansen-ceo\"><strong><em>How to strike a balance between blockchain transparency and privacy: Nansen CEO</em></strong></a></p><p>Thousands of dollars in transaction fee mistakes have been lost before. Back in 2019, an Ethereum user lost almost $400,000 in Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) after making the mistake of pasting values in the wrong fields. Luckily, the Ethereum mining pool Sparkpool <a href=\"https://cointelegraph.com/news/ethereum-user-who-accidentally-paid-365-000-fee-splits-loss-with-mining-pool-sparkpool\">helped the user recover half</a> of the funds lost. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/nft-collapse-and-monster-egos-feature-in-new-murakami-exhibition/\"><strong><em>NFT collapse and monster egos feature in new Murakami exhibition</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T10:33:40.000Z",
    "title": "The Role of Machine Learning in Modernizing Fraud Prevention",
    "url": "https://www.cryptopolitan.com/role-of-machine-learning-in-fraud-prevention/",
    "description": "The world has witnessed an unprecedented surge in digital transactions in recent years. As consumers increasingly shift towards online spending and interaction, their security and identity verification expectations have grown exponentially. However, as consumers demand greater security, fraudsters have become more sophisticated, creating an urgent need for businesses to protect their customers from fraud while ... <a title=\"The Role of Machine Learning in Modernizing Fraud Prevention\" class=\"read-more\" href=\"https://www.cryptopolitan.com/role-of-machine-learning-in-fraud-prevention/\" aria-label=\"More on The Role of Machine Learning in Modernizing Fraud Prevention\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T10:18:58.000Z",
    "title": "Princeton AI Luminaries Shine on TIME100’s 2023 List",
    "url": "https://www.cryptopolitan.com/princeton-ai-shine-on-time100s-2023-list/",
    "description": "In TIME Magazine&#8217;s prestigious 2023 TIME100 Artificial Intelligence list, Princeton University proudly boasts a significant representation of prominent figures in artificial intelligence (AI). These individuals include dedicated critics of AI biases, pioneers who have raised alarms about potential risks, and the CEO of an AI company deeply committed to safety and alignment with human interests. ... <a title=\"Princeton AI Luminaries Shine on TIME100&#8217;s 2023 List\" class=\"read-more\" href=\"https://www.cryptopolitan.com/princeton-ai-shine-on-time100s-2023-list/\" aria-label=\"More on Princeton AI Luminaries Shine on TIME100&#8217;s 2023 List\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-15T10:25:47.000Z",
    "title": "Ethereum Core Devs Greenlight EIP-7514: Implications For ETH Price",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-eip-7514-implications-eth-price/",
    "description": "Ethereum Core Developers have officially approved EIP-7514 for inclusion in the upcoming Dencun upgrade which is slated for late 2023. This Ethereum Improvement Proposal (EIP) primarily aims to decelerate the growth rate of ETH staking, thereby providing the Ethereum community additional time to craft an improved validator reward scheme. The main modification brought by this EIP is setting the Max Epoch Churn Limit, the validator activation queue upper limit, to a constant value of 8. Previously, the churn limit was calculated by taking &#8220;The total number of validators/65536,&#8221; which at present equates to about 12/epoch. The decision followed an Ethereum Core Dev Meeting, as described in a tweet by Tim Beiko: &#8220;Wrapped up another Ethereum #AllCoreDevs: we covered devnet updates, additions to Dencun, and had a full overview of Reth. [&#8230;] EIP-7514 will be part of the Dencun upgrade! Expect the EIP and associated CL specs PR to be updated to reflect all of this in the coming days.&#8221; Related Reading: Ethereum Leverage Ratio Is Rising, What Does It Mean? Beiko&#8217;s statement underscored the importance of this change and provided insights into the consensus among Core Developer teams. Dankrad Feist, a Researcher at the Ethereum Foundation, outlined the importance of the approval. Feist stated: My reasoning on why I&#8217;m for EIP-7514. It is currently unclear if (especially liquid) staking will keep growing indefinitely. In the case that the withdrawal queue does not empty over the next few months, the lower churn limit will give the Ethereum community the time needed to research, debate and implement solutions. Implications For Ethereum Price The staking ratio&#8217;s continual rise could result in a diminishing amount of liquid ETH available for trading. Should the staking ratio near 100%, it might produce a supply scarcity, thereby influencing the ETH price positively. However, from the information presented, Ethereum developers are not advocating for this scenario due to potential technical and security implications. EIP-7514, therefore, indirectly impacts the ETH price by manipulating its supply side, though immediate, direct effects on the price aren&#8217;t anticipated. Instead, any potential influence on price would likely manifest over an extended period. Related Reading: Ethereum Health: Analyst’s Red Flags And Failed Bullish Patterns The motivation behind EIP-7514, as detailed on GitHub, is to &#8220;mitigate the negative externalities of very high level of total ETH supply staked before a proper solution is implemented.&#8221; If the deposit queue stays 100% full, the share of ETH supply staked will reach 50% by May 2024, 75% by September 2024, and 100% by December 2024. Remarkably, the modest returns don&#8217;t necessarily deter further capital staking, especially with the frequently substantial and erratic returns from MEV. Therefore, EIP-7514 serves as an interim measure, buying time for the community to deliberate and develop comprehensive solutions to the emerging challenges. In summary, while the immediate effects of EIP-7514 on the ETH price remain to be seen, its long-term implications, especially in terms of staking growth and supply side management, could be substantial. The community and investors alike will closely monitor the aftermath of this EIP&#8217;s implementation in the Dencun upgrade. ETH Price Builds Momentum At press time, ETH was trading at $1,628. On Monday, ETH price bounced off the 78.6% Fibonacci retracement level at $1,536. A breakout above the 20-day EMA at $1,639 and consequently above the 61.8% Fibonacci level at $1,665 is critical to maintain upside momentum. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-15T10:28:58.000Z",
    "title": "SWIFT’s CBDC Project Expands: Three New Central Banks Join Beta Phase – What’s Ripple and XRP’s Role?",
    "url": "https://www.crypto-news-flash.com/swifts-cbdc-project-expands-three-new-central-banks-join-beta-phase-whats-ripple-and-xrps-role/?utm_source=rss&utm_medium=rss&utm_campaign=swifts-cbdc-project-expands-three-new-central-banks-join-beta-phase-whats-ripple-and-xrps-role",
    "description": "<img width=\"1280\" height=\"1015\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/10/bank-g47e6996b5_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/10/bank-g47e6996b5_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/bank-g47e6996b5_1280-300x238.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/bank-g47e6996b5_1280-1024x812.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/bank-g47e6996b5_1280-768x609.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/bank-g47e6996b5_1280-24x19.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/bank-g47e6996b5_1280-36x29.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/bank-g47e6996b5_1280-48x38.png 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />SWIFT has welcomed three additional central banks, including the Hong Kong Monetary Authority and the Central Bank of Kazakhstan, to its CBDC interoperability project&#8217;s beta phase. These central banks have successfully integrated their infrastructure with SWIFT&#8217;s &#8220;CBDC connector solution,&#8221; marking progress in CBDC development. Earlier on Wednesday, September 13, SWIFT announced that three more central [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-15T10:16:13.000Z",
    "title": "Polkadot’s Liquid Staking Partnership: A Game-Changer for DOT Holders",
    "url": "https://www.crypto-news-flash.com/polkadots-liquid-staking-partnership-a-game-changer-for-dot-holders/?utm_source=rss&utm_medium=rss&utm_campaign=polkadots-liquid-staking-partnership-a-game-changer-for-dot-holders",
    "description": "<img width=\"1280\" height=\"721\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Polkadot.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polkadot\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Polkadot.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Polkadot-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Polkadot-1024x577.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />A partnership between ZodiaCustody and Paritytech has enabled institutional investors to venture into liquid staking on the Polkadot network. Though the reward rate has been declining, the amount of staked DOT has continued to rise, pointing to an optimistic view from investors. The Polkadot network is enjoying institutional interest owing to its liquid staking offer. [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-15T10:37:32.000Z",
    "title": "DONT MISS These 3 Top Polygon Ecosystem Winners",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/dont-miss-these-3-top-polygon-ecosystem-winners/",
    "description": "<p>Polygon, Polygon, how do I love thee? Just kidding there. You should never fall in love with your bags. But when it comes to Polygon, we are fans. We like both the token and the ecosystem. The token we talk about often. But the ecosystem, not so much. So today, 3 of our favorite projects [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/dont-miss-these-3-top-polygon-ecosystem-winners/\">DONT MISS These 3 Top Polygon Ecosystem Winners</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-15T10:11:00.000Z",
    "title": "Celsius’ Former Chief Revenue Officer Pleads Guilty to Crypto Fraud",
    "url": "https://coinedition.com/celsius-former-chief-revenue-officer-pleads-guilty-to-crypto-fraud/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Celsius_Network_Revival_Plan_–_Heres_What_It_Includes-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Celsius&#039; Former Chief Revenue Officer Pleads Guilty to Crypto Fraud\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Celsius_Network_Revival_Plan_–_Heres_What_It_Includes-1.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Celsius_Network_Revival_Plan_–_Heres_What_It_Includes-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Celsius_Network_Revival_Plan_–_Heres_What_It_Includes-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Celsius_Network_Revival_Plan_–_Heres_What_It_Includes-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Celsius_Network_Revival_Plan_–_Heres_What_It_Includes-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Roni Cohen-Pavon has pleaded guilty to criminal charges related to market manipulation and fraud involving CEL tokens. Cohen-Pavon has agreed to cooperate with the U.S. attorney&#8217;s office and the FBI in their investigation. The court records note that Cohen-Pavon, an Israeli citizen, faces potential immigration consequences. Roni Cohen-Pavon, former chief revenue officer at bankrupt crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/celsius-former-chief-revenue-officer-pleads-guilty-to-crypto-fraud/\">Celsius&#8217; Former Chief Revenue Officer Pleads Guilty to Crypto Fraud</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]