[
  {
    "source": "Decrypt",
    "date": "2023-06-19T14:26:12.000Z",
    "title": "Bank of England-Backed Project: CBDCs Could Enable 'Programmability' for Money",
    "url": "https://decrypt.co/145247/bank-of-england-backed-project-cbdcs-could-enable-programmability-for-money",
    "description": "The ‘Project Rosalind’ software trial found that central bank digital currencies could enable smart contract-like features for transactions."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-19T14:17:16.000Z",
    "title": "Do Kwon gets 4 months in prison in Montenegro on fake passport charges",
    "url": "https://cointelegraph.com/news/do-kwon-sentenced-to-4-months-in-prison-in-montenegro-on-fake-passport-charges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a86cd4d3-48f9-4f77-94b6-b58b01a7a888.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Terraform Labs founder sentenced to four months in jail after being found guilty of using a false Costa Rican passport.</p>\n                    <p><p>Terraform Labs founder Do Kwon has been found guilty of using a false passport by a court in Montenegro and has been sentenced to four months in prison.</p><p>Kwon’s colleague and former Terraform Labs chief financial officer Han Chong-joon was charged alongside him and received the same sentence. The time both men spent in detention will be taken into account, the Montenegro Basic Court said in a <a href=\"https://sudovi.me/ospg/sadrzaj/D264\" target=\"_blank\" rel=\"noopener nofollow\">statement</a> on its website. </p><p>Kwon was charged with attempting to leave the country using a false Costa Rican passport. He reportedly told a Montenegro court that he wasn’t aware the passport he was traveling with was allegedly forged and instead pinned the blame on a Chinese-named agency.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/chinese-agency-blamed-by-do-kwon-for-passport-forgery\">Do Kwon denies forging passport, blames ‘Chinese’ agency: Report</a></em></strong></p><p>According to a June 17 report from South Korean news outlet Segye Ilbo, Kwon told the Montenegro Basic Court he received his allegedly forged passports and travel documentation, including a Costa Rican passport, through third-party “agencies.”</p><p>According to Kwon, because he’d been traveling with his Costa Rican passport “for years,” he had no reason to doubt its authenticity.</p><p>In addition to denying forgery of travel documentation, Kwon denied allegations he made any financial donations to Montenegro’s former finance minister Milojko Spajić, the now-leader of the Europe Now party.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-19T14:12:01.000Z",
    "title": "Bear market allows crypto companies to ‘listen’ to users: KuCoin exec",
    "url": "https://cointelegraph.com/news/bear-market-allows-crypto-companies-listen-to-users-ku-coin-interview",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/577c3f4e-4813-48f1-948c-87ff39be4340.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Dorian Vincileoni, an executive at KuCoin, spoke with Cointelegraph at the Proof of Talk blockchain conference in Paris about navigating the state of the current market.  </p>\n                    <p><p>Crypto has been at the mercy of an <a href=\"https://cointelegraph.com/news/bitcoin-price-dan-tapiero-shares-tips-on-how-to-navigate-bear-market\">ongoing bear market</a> that began in the spring of 2022, after a historic bull run that had investors, developers and users piling into the Web3 space. </p><p>Despite interest slowing down and companies needing to <a href=\"https://cointelegraph.com/news/nansen-lays-off-30-of-its-workforce\">adjust to the current market</a> conditions, <a href=\"https://cointelegraph.com/news/bear-market-pushes-crypto-events-to-cut-fluff-prioritize-discourse\">many in the space</a> still view this as a time to mature the industry. </p><p>Cointelegraph spoke with Dorian Vincileoni, the Europe business development lead of KuCoin, at the Proof of Talk 2023 blockchain conference on how companies in the space can best utilize the bear market with users as the main focus.  </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/96432231-d84a-4d8d-ab1a-a116765c0d09.jpg\"  /><figcaption style=\"text-align: center;\"><em>Dorian Vincileoni, the Europe business development lead of KuCoin (left)</em><em> with Cointelegraph Reporter Savannah Fortis at Proof of Talk 2023 in Paris. Source: Cointelegraph</em></figcaption></figure><p>Vincileoni told Cointelegraph that bear markets have given companies time to build, innovate and develop products and services to create more efficiency for users. He explained that during bull markets there is “so much noise on the market” making it harder to hear community needs.</p><blockquote>“When it's a bear market, you have much more legitimate opinions from your organic user base. We are closely listening to what our organic base is saying and what they are interested in.”</blockquote><p>The executive continued by saying this is not the time for exchanges to be “dragged by the spiral of negative news” but rather to focus on improvement to know where to go next when favorable market conditions return. </p><blockquote>“We really try to look at communities. If there is an actual organic community invested in this project or interested, then it's our objective to provide service to them.”</blockquote><p>“One thing that we have seen is that throughout this bear market, projects still managed to create organic communities,” he said. “The level of interest in the market is down but not nonexistent at all.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-layoffs-decelerate-with-layoffs-falling-to-570-in-february\"><strong><em>Crypto layoffs decelerate, with layoffs falling to 570 in February</em></strong></a></p><p>KuCoin is not alone in its community-first approach. Cointelegraph recently spoke with Binance’s new VP of marketing, who also stressed that the crypto space needs to ‘double down’ on <a href=\"https://cointelegraph.com/news/crypto-needs-to-double-down-on-community-binance-vp-of-marketing-interview\">community support</a> during both the bear market and regulatory uncertainty. </p><p>Vincileoni said when it comes to regulatory uncertainty they have stopped trying to “assume” what’s next. Instead, when given clarity it’s best to then react and adapt, calling the space an “adaptive race.”</p><blockquote>“We really try to focus on what we know how to do and what we have an influence on, which is guaranteeing the safety of the assets of users at all times. [The industry] can have a real impact on this.”</blockquote><p>In fact, he told Cointelegraph that a market survey done by KuCoin revealed a large interest from users regarding the implementation of AI for security purposes. </p><p>Recently, the cryptocurrency exchange’s Twitter account was <a href=\"https://cointelegraph.com/news/kucoin-to-reimburse-victims-of-the-short-lived-twitter-account-hack\">subject to a compromise</a> that resulted in users losing funds due to a fake giveaway announcement. </p><p>Vincileonoi closed by saying despite the current conditions he believes the market is still “filled with opportunities” and that “we are really in the beginning of an era that we barely can envision.” </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\"><strong><em>Features Tornado Cash 2.0: The race to build safe and legal coin mixers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-19T14:27:39.000Z",
    "title": "Major repricing event underway in TradFi markets",
    "url": "https://cryptoslate.com/insights/major-repricing-event-underway-in-tradfi-markets/",
    "description": "<p>Quick Take Since the Global Financial Crisis (GFC) in 2008, a zero-interest rate policy along with quantitative easing has been the norm for the past 15 years. This policy has contributed to asset inflation, which is anticipated to reverse. The extent of this reversal, however, remains uncertain. Both the equities and real estate sectors flourish [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/major-repricing-event-underway-in-tradfi-markets/\">Major repricing event underway in TradFi markets</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-19T14:23:35.000Z",
    "title": "Enya Labs, Core Contributor to Boba Network and Enjinstarter Unveil a Synergistic Partnership to Integrate Services and Fuel Web3 Ecosystem Expansion",
    "url": "https://cryptodaily.co.uk/2023/06/enya-labs-core-contributor-to-boba-network-and-enjinstarter-unveil-a-synergistic-partnership-to-integrate-services-and-fuel-web3-ecosystem-expansion",
    "description": "<p>Palo Alto, CA, June 19th, 2023, Chainwire</p><p>Enya Labs, the core contributor to Boba Network, a multichain layer 2 optimistic rollup solution aimed at unlocking the potential of rollup technology and enabling interoperability between blockchains and the real world, is proud to announce a new strategic partnership with Enjinstarter, an innovative launchpad, incubator, and advisory for Web3 gaming, entertainment, and metaverse projects. This strategic partnership is committed to bolstering the development and advancement of the Web3 ecosystem.</p><p>Since its inception in 2021, Enjinstarter has supported over 70 companies and cultivated a diverse community of more than 200,000 across multiple social platforms. It provides unique market access in South East Asia, India, Turkey, Spain, North America, and Indonesia. Enjinstarter also runs a successful Web3 innovation consulting practice, guiding brands, large corporates, and Web2 companies to formulate effective Web3 strategies.</p><p>As part of the agreement, Enjinstarter will integrate Boba Network into its launchpad, introduce projects to the Boba Network ecosystem, and explore organizing gamer acquisition initiatives and tournaments. Concurrently, Enya Labs pledges to back the integration of Boba Network into the Enjinstarter launchpad, detail a comprehensive plan on ecosystem development and marketing, and potentially offer investment support and integration for appropriate games and projects. Both parties also plan to explore additional avenues for ecosystem development efforts and funding opportunities.</p><p>Boba Network's multichain Layer 2 solution enhances the compatibility and interoperability of blockchains with the real world. Its revolutionary HybridCompute&trade; is a groundbreaking innovation that marries siloed Web2 data with Web3 protocols, decentralized applications, and smart contracts. With just one line of code, access the existing Web2 systems and open the door to a realm of boundless opportunities.</p><p>Curtis Schlaufman, Head of Global Marketing at Enya Labs - Boba Network's Core Contributor, emphasizes, \"Our partnership with Enjinstarter aligns perfectly with our vision. We are excited about the possibilities this partnership brings, especially for innovative developers and initiatives in the Boba ecosystem.\"</p><p>\"In this partnership, Enjinstarter is committed to supporting projects to build on the Boba Network by providing our suite of services. Furthermore, we aim to introduce Boba Network as a potent chain to develop on, thus enhancing its reach and impact,\" says a representative from Enjinstarter.</p><p>About Enya Labs</p><p>Founded by a team of Stanford faculty and alumni, Enya Labs is an innovator of software frameworks specializing in distributed systems engineering and application development. The Company serves clients and organizations by helping their partners leverage their existing business to unlock new opportunities enabled by hybrid blockchain solutions.</p><p>Enya Labs is a core contributor to Boba Network, the only multichain layer-2 blockchain scaling solution and the only smart contract platform that enables Web3-Web2 interoperability. Boba Network improves the performance and lowers the transaction cost of base-layer blockchains by 40x-100x. Its unique Hybrid Compute technology allows smart contracts to call any off-chain API, giving developers the best of both the Web3 and the Web2 worlds to build the most compelling decentralized applications possible.&nbsp;</p><p>For more information on Enya Labs and Boba Network visit: www.enya.ai, boba.network&nbsp;</p><p>About Enjinstarter</p><p>Enjinstarter is a next-generation launchpad, incubator, and advisory platform for Web3 gaming, entertainment, and metaverse projects. With extensive experience and a robust community, Enjinstarter propels forward-thinking companies into the Web3 era.</p>ContactMark WienMark@marketacross.com"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-19T14:15:13.000Z",
    "title": "Smart Traders Think These 5 Coins Will Explode in 2023",
    "url": "https://cryptodaily.co.uk/2023/06/smart-traders-think-these-5-coins-will-explode-in-2023",
    "description": "<p class=\"s6\">In the wake of a significant downturn in crypto prices, smart traders are keeping a close eye on five coins that they believe have the potential to rebound with a vengeance. </p>\n<p class=\"s6\">Uwerx, a blockchain-based platform, is on the verge of revolutionizing the freelance industry, fueling its explosive growth as it prepares to officially launch its platform. </p>\n<p class=\"s6\">Alongside Uwerx, Axie Infinity (AXS), Solana (SOL), Filecoin (FIL), and NEAR Protocol (NEAR) are dominating the market, captivating investors and enthusiasts alike.</p>\nTop 5 Coins Smart Traders Believe Will Make a Powerful Comeback\n1. Axie Infinity (AXS): Collect, Breed, and Battle Digital Creatures for Cryptocurrency Rewards\n2. Solana (SOL): Empowering Decentralized Applications with Lightning-Fast Speed\n3. Uwerx (WERX): Revolutionizes Freelancing with Blockchain-Powered Platform\n4. Filecoin (FIL): Unlocking the Potential of Decentralized Storage\n5. NEAR Protocol (NEAR): Building the Future of Decentralized Applications\nAxie Infinity (AXS): Collect, Breed, and Battle Digital Creatures for Cryptocurrency Rewards\n<p class=\"s6\">Embark on a captivating journey with Axie Infinity (AXS), a blockchain-based game that has taken the crypto and NFT world by storm. Developed by Sky Mavis, the revolutionary AxieInfinity (AXS) game allows players to immerse themselves in a world of digital creatures known as Axies.</p>\n<p class=\"s6\">With a current market price of $4.91 and a 24-hour trading volume of $34,462,068, Axie Infinity (AXS) is making waves in the gaming and crypto communities. Ranked #60 on CoinMarketCap, Axie Infinity (AXS) has a market cap of $576,398,354, showcasing its growing popularity and potential for lucrative opportunities.</p>\n<p class=\"s6\">Crypto analysts foresee a promising future for Axie Infinity (AXS), projecting a potential price surge to $10.25 by Q4 2024. The vibrant ecosystem, coupled with the rising demand for play-to-earn experiences, solidifies Axie Infinity (AXS) as an enticing investment opportunity.</p>\nSolana (SOL): Empowering Decentralized Applications with Lightning-Fast Speed\n<p class=\"s6\">Discover Solana (SOL), a decentralized blockchain platform revolutionizing the world of decentralized applications (DApps) with its lightning-fast and scalable infrastructure. </p>\n<p class=\"s6\">With an impressive block time of just 400 milliseconds, Solana (SOL) stands out by handling thousands of transactions per second, ensuring efficient and seamless user experiences.</p>\n<p class=\"s6\">At the time of this writing, the trading price of Solana (SOL) is $15.28, and the project boasts a market cap of $5,983,233,560. Analysts predict a bright future for Solana (SOL), with projections suggesting a potential price of $28.40 by Q4 2024.</p>\nFilecoin (FIL): Unlocking the Potential of Decentralized Storage\n<p class=\"s6\">Experience the revolution of decentralized storage and blockchain gaming with Filecoin (FIL), a pioneering project set to capitalize on the rising demand for non-fungible tokens (NFTs) and secure data storage. </p>\n<p class=\"s6\">With a current price of $3.53 and a 24-hour trading volume of $119,555,393, Filecoin (FIL) is making significant strides. Ranked #32 on CoinMarketCap, it boasts a market cap of $1,516,427,073.</p>\n<p class=\"s6\">Experts anticipate a bright future for Filecoin (FIL), projecting a potential price surge to $7.35 by Q4 2024. The growth in blockchain gaming, the adoption of NFTs, and the increasing need for decentralized storage all contribute to the bullish outlook. </p>\n<p class=\"s6\">Despite regulatory challenges and rumors, investor interest in Filecoin (FIL) remains resilient.</p>\nNEAR Protocol (NEAR) Price Prediction\n<p class=\"s6\">Discover the potential of NEAR Protocol (NEAR), an advanced blockchain platform that aims to transform the development and distribution of decentralized applications (DApps) and promote a more inclusive web ecosystem. </p>\n<p class=\"s6\">NEAR Protocol (NEAR) introduces a Blockchain Operating System (BOS) that empowers developers to build innovative apps using familiar tools and programming languages like JavaScript.</p>\n<p class=\"s6\">With a current price of $1.20 and a 24-hour trading volume of $54,077,013, NEAR Protocol (NEAR) is steadily gaining traction. Ranked #39 on CoinMarketCap, it boasts a live market cap of $1,094,399,864.</p>\n<p class=\"s6\">Crypto analysts foresee an optimistic future for NEAR Protocol (NEAR), projecting a potential price surge to $10.25 by Q4 2024. This projection is fueled by NEAR Protocol (NEAR)'s commitment to driving innovation and its potential to capture a significant share of the burgeoning dApp market.</p>\nUwerx (WERX) Revolutionizes Freelancing with Blockchain-Powered Platform\n<p class=\"s6\">Uwerx, the pioneering freelance platform powered by blockchain technology, is committed to revolutionizing the freelance industry. With a clear vision for the future, Uwerx has successfully implemented groundbreaking campaigns and policies that prioritize user satisfaction.</p>\n<p class=\"s6\">One significant development is the introduction of the Uwerx Vault, which allows users to stake tokens and earn rewards. This innovative feature demonstrates the team's unwavering commitment to security, as evidenced by audits from industry-leading firms such as SolidProofand InterFi. Additionally, Uwerx ensures decentralization by adjusting the 25-year lock period for liquidity.</p>\n<p class=\"s6\">To achieve true decentralization, Uwerx's developers have renounced their claim to the smart contracts upon listing on centralized exchanges. This bold move underscores Uwerx's dedication to transparency and creating a platform driven by the community.</p>\n<p class=\"s6\">Uwerx has achieved notable milestones, such as its listing on CoinSniper and the upcoming listing on Uniswap on August 1st. These listings greatly enhance Uwerx's reach and liquidity, attracting a vibrant community with over 5,500 sign-ups, 1,600 Twitter followers, and 1,600 Telegram members.</p>\nUwerx (WERX) Presale Enters Stage Five with Strong Market Potential\n<p class=\"s6\">As Uwerx enters stage five of its presale, the platform aims to exceed expectations by catering to the growing demand in the freelance market. With a rapidly expanding user base and strong market interest, the Uwerx team has adjusted token allocations to ensure fairness and meet the increasing demand.</p>\n<p class=\"s6\">Currently priced at $0.041, industry analysts predict that Uwerx has the potential to reach $2.6 by Q4 2023, offering investors attractive returns. Seize this opportunity during the presale, where all purchases come with a generous 15% bonus.</p>\n<p class=\"s6\">Responding to community feedback and the rapid progress of the presale, the Uwerx team has made necessary adjustments to token allocations to ensure an equitable distribution. Consequently, the launch price has been revised to a range of $0.095 to $0.115, reflecting the project's undeniable success.</p>\nUwerx (WERX) Alpha Version Unveiled - Test, Provide Feedback, and Engage\n<p class=\"s6\">The much-awaited Alpha Version of the Uwerx platform has been unveiled, introducing the landing page, sign-in/sign-up pages, and more. Users have the opportunity to shape the future of Uwerx by actively participating in the Alpha Platform and offering valuable feedback. This input plays a crucial role in driving the continuous improvement and evolution of the platform.</p>\n<p class=\"s6\">Excitingly, the Uwerx team has planned regular feature releases on a weekly or bi-weekly basis, bringing users closer to the Beta version. Users are encouraged to test the platform and provide valuable feedback through the designated feedback email, feedback@uwerx.network.</p>\n<p class=\"s6\">In an effort to ensure transparency and user engagement, 92.8% of the Uwerx community has approved a Test Airdrop. This Airdrop will validate user wallet addresses and will take place before the presale concludes, further strengthening the platform's commitment to transparency.</p>\n<p class=\"s6\">Following the conclusion of the presale, Uwerx will commence the distribution of tokens through a fair and controlled release strategy over a 6-week vesting period. This meticulous approach guarantees gradual token allocation to holders, fostering stability and sustainable growth within the thriving Uwerx ecosystem.</p>\n<p class=\"s6\">Embark on Uwerx's revolutionary journey today and enjoy a 15% bonus on your token acquisitions. Join the platform set to redefine the freelance industry and empower users through blockchain technology.</p>\n<p>Presale: invest.uwerx.network</p>\n<p>Telegram: https://t.me/uwerx_network</p>\n<p>Twitter: https://twitter.com/uwerx_network</p>\n<p>Website: https://www.uwerx.network/</p>\n<p class=\"s6\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-19T14:15:00.000Z",
    "title": "AppleSwap: The All-In-One AI Tech Platform for Your Crypto Needs",
    "url": "https://cryptodaily.co.uk/2023/06/appleswap-the-all-in-one-ai-tech-platform-for-your-crypto-needs",
    "description": "<p>AppleSwap could be your all-in-one crypto platform powered by AI technology to swap, sell, trade cryptocurrencies, or farm for rewards. Using AI Technology, AppleSwap takes pride in being the pioneering cryptocurrency exchange combining the best of both worlds: a CEX-DEX hybrid platform.&nbsp;</p>\n<p>The AppleSwap team is devoted to making crypto and blockchain accessible to everyone, whether pros or newbies. They utilize the power of artificial intelligence, integrating an extensive range of spot and future markets, comprehensive trading services, and a thriving ecosystem.</p>\nAppleSwap.ai: Your AI Partner for Your Crypto Needs\n<p>Appleswap.ai is a decentralized derivatives trading protocol where users can enjoy a smooth trading experience while connecting to Appleswap with just one click through their decentralized wallets. &nbsp;</p>\n<p>Also, AppleSwap wishes to gather the crypto community together to offer a more user-friendly platform that enhances privacy. There is no need to complete sign-up procedures; you just connect your crypto wallet and are ready to start trading.</p>\n<p>Be sure to follow them on Twitter, check the Telegram channel for future announcements, and join their growing crypto community on Reddit.</p>\n<p>All in one place with AppleSwap.ai</p>\n<p>AppleSwap strongly believes in the immense potential of AI and blockchain technology and is dedicated to democratizing the use of cryptocurrencies. Investing and speculating in crypto assets can be complex and intimidating for many, but here comes AppleSwaps vision: creating a user-friendly platform that makes this revolutionary technology accessible to everyone, regardless of their technical expertise.&nbsp;</p>\n<p>Comprised of individuals with extraordinary values, AppleSwap works tirelessly to develop a simple and intuitive platform where users can effortlessly buy, sell, hold, and speculate on crypto assets.</p>\nBenefit from the Top Advantages of Appleswap\n<p>1. AI Technology:&nbsp; Provide users with a secure and seamless trading experience on Appleswap CEX and DEX, Optimizing the transactions and Reducing swap costs.</p>\n<p>2. User-Friendly Interface:&nbsp; Our platform is designed with simplicity, ensuring that everyone, regardless of their background or experience, can easily participate in cryptocurrency trading.</p>\n<p>3. Top-Notch Security Measures: The security of your assets is our utmost priority. We employ robust measures, including two-factor authentication (2FA), to provide a safe environment for storing and trading cryptocurrencies.</p>\n<p>4. Enhanced Privacy: No sign-up is required; connect your crypto wallet and start trading.</p>\n<p>5. Reliable System Performance: Rest assured, knowing that our system is stable and reliable. We prioritize maintaining a functional platform, ensuring minimal downtime and uninterrupted trading activities.</p>\n<p>24/7 Customer Support: Need assistance? Our dedicated support team is available 24/7. Our highly-trained professionals are committed to promptly resolving any issues or queries, ensuring your satisfaction and peace of mind.</p>\nDiscover the Top AppleSwap Products\n<p>As mentioned, AppleSwaps integrates all your crypto actions in one comprehensive ecosystem so you can have more time to focus on your crypto investment strategy.</p>\n<p>Trade easily using their low-fee and fast transaction interface and enjoy fast and seamless futures trading anytime, anywhere.</p>\n<p>With AppleSwap, you can earn passive income and support the blockchain by staking your assets; moreover, you earn interest by providing liquidity to our pools and sharing in transaction fees.</p>\n<p>Boost your returns with our high-yield farming options in community-run pools and enjoy the prizes you receive when you are in top traders with the highest trading volume.</p>\nAbout the AP tokenomics\n<p>According to the AP Tokenomic, the AP token is used for security, utility, and governance within the AppleSwaps environment. The AP token facilitates users' interaction with the environment and can potentially increase the token's value if there is a higher demand for using and purchasing more Tokens.</p>\n<p>AP Token Allocation:</p>\n<p>The total supply of AP Tokens is 100,000,000 is available, with no additional tokens to mint. Moreover,&nbsp; 61,000,000 AP tokens will be sold during the fair launch phase to establish an initial user base and attract investor interest.</p>\n<p>30,487,800 AP Tokens will be used for liquidity and to increase user trading capabilities, and 7,192,2 AP Tokens will be used for the staking pool and farming for six months.&nbsp;</p>\n<p>Also, 100,000 AP will facilitate a crypto airdrop; the remaining 1,22% are already unlocked.</p>\n<p>Moreover, AppleSwap is committed to buying back AP Tokens from swap fees: 50% of the fees are committed to buying back AP Tokens from the market and burning them, thus reducing the supply of AP Tokens in the market and creating a potential for token holders to experience price appreciation.</p>\n<p>It is essential to mention that the founders do not hold any AP Tokens. Thus, they can instill trust and transparency within the user community, as there is no potential for them to sell and create selling pressure on the token price.</p>\n<p>Please check the official website for more details about AppleSwaps services, and the white paper offers more information on the tokenomics, such as the blockchain network, the smart contract, allocations, and many more.</p>\n<p>AppleSwap Open AP FairLaunch on Pinksale</p>\n<p>Pre-sale time: 19th - 21st, June, 2023</p>\n<p>Appleswap.ai (AP) is gearing up for its listing on Bitget.com, scheduled for July 15th, 2023. As a unique CEX-DEX hybrid platform powered by AI technology, AP boasts various features and benefits. The platform takes pride in optimizing the bounce rate and ensuring a user-friendly experience for its traders. With intuitive interfaces and easy-to-understand features, beginners and experienced traders can navigate the platform seamlessly.</p>\n<p>AP also offers a Trading Volume Leaderboard, allowing users to track and compare their performance with others on the platform. Privacy is a top priority on Appleswap.ai, with enhanced privacy measures to safeguard user data and information.&nbsp;</p>\n<p>Additionally, the platform aims to reduce transaction costs, making cryptocurrency trading and swapping more cost-effective for its users. With a strong focus on security, Appleswap.ai implements robust protocols to protect user funds and assets, ensuring a safe trading environment.</p>\n<p>Total Supply: 100,000,000 AP;</p>\n<p>Tokens For Presale: 61,000,000 AP;</p>\n<p>Tokens For Liquidity: 30,487,800 AP and AppleSwap hold 0% of the total supply of 100 million AP;</p>\n<p>Soft Cap: 10 BNB;</p>\n<p>Listing On: Pancakeswap;</p>\n<p>Liquidity Percent: 51%;</p>\n<p>*More details you can find here.</p>\n<p>Whether you're looking to swap cryptocurrencies, engage in future trading, provide liquidity, stake assets, or farm for rewards, Appleswap.ai has you covered. Its comprehensive suite of services caters to various trading needs, offering a one-stop solution for crypto enthusiasts.</p>\n<p>As the listing on Bitget.com approaches, the excitement surrounding Appleswap.ai continues to grow, and users can anticipate a seamless and feature-rich trading experience on the platform.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-19T14:30:32.000Z",
    "title": "Bitcoin Network Gears Up for Fourth Surge in Mining Difficulty Amid Record Highs and Unwavering Miners",
    "url": "https://news.bitcoin.com/bitcoin-network-gears-up-for-fourth-surge-in-mining-difficulty-amid-record-highs-and-unwavering-miners/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/diff-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Network Gears Up for Fourth Surge in Mining Difficulty Amid Record Highs and Unwavering Miners\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/diff-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/diff-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/diff-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/diff-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/diff-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/diff-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/diff-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Bitcoin network has witnessed a consecutive surge in mining difficulty during the past three retargets, and now a fourth increase is slated for June 27, 2023. The block generation time, averaging less than ten minutes, indicates that the difficulty is projected to climb by an estimated 2.1% to 2.33% based on the latest statistics. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T14:35:40.000Z",
    "title": "IMF to create a global CBDC platform – Details",
    "url": "https://www.cryptopolitan.com/imf-to-create-a-global-cbdc-platform-details/",
    "description": "In a dramatic new development, the International Monetary Fund (IMF) has announced its intentions to construct a global platform for central bank digital currencies (CBDCs). This innovative move promises to redefine financial transactions between nations, with a primary focus on efficiency and fairness. Reinventing international transactions The comprehensive digitalization of central bank currencies is the ... <a title=\"IMF to create a global CBDC platform &#8211; Details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/imf-to-create-a-global-cbdc-platform-details/\" aria-label=\"More on IMF to create a global CBDC platform &#8211; Details\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T14:25:48.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years, and there is no stopping it anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. Various APE price highlights unfold in this ApeCoin Price Prediction. How much is ApeCoin ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T14:25:37.000Z",
    "title": "AI in supply chains: How will that work exactly?",
    "url": "https://www.cryptopolitan.com/ai-in-supply-chains-how-will-that-work/",
    "description": "Integrating Artificial Intelligence (AI) in supply chain operations is more than just a vision of the future. It&#8217;s already in motion, with an ever-growing impact on how goods are moved across the globe, says industry insiders and analysts. Revolutionizing the transport sector Emerging technologies like self-driving trucks, sidewalk robots, and customer service bots are not ... <a title=\"AI in supply chains: How will that work exactly?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-in-supply-chains-how-will-that-work/\" aria-label=\"More on AI in supply chains: How will that work exactly?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T14:19:49.000Z",
    "title": "Bangladesh joins the party, applies for BRICS membership",
    "url": "https://www.cryptopolitan.com/bangladesh-applies-for-brics-membership/",
    "description": "In a move indicative of shifting global economic dynamics, Bangladesh has taken a bold step forward. Setting sights on becoming a part of the influential BRICS alliance (Brazil, Russia, India, China, and South Africa), Bangladesh is set to diversify its foreign relations and currency. This action brings Bangladesh into an emerging coalition looking to counterbalance ... <a title=\"Bangladesh joins the party, applies for BRICS membership\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bangladesh-applies-for-brics-membership/\" aria-label=\"More on Bangladesh joins the party, applies for BRICS membership\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T14:30:00.000Z",
    "title": "Crypto analysts bullish on Alex The Doge, Shiba Inu building momentum",
    "url": "https://crypto.news/crypto-analysts-bullish-on-alex-the-doge-shiba-inu-building-momentum/",
    "description": "Alex The Doge and Shiba Inu are two projects that crypto analysts are closely monitoring and maintaining a bullish preview on their respective tokens"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T14:26:32.000Z",
    "title": "Ethereum mulls increasing staking limit from 32 to 2,048 ETH for validators ",
    "url": "https://crypto.news/ethereum-mulls-increasing-staking-limit-from-32-to-2048-eth-for-validators/",
    "description": "Ethereum Foundation researcher Michael Neuder has floated a proposal to increase the maximum effective balance of Ethereum validators from the current 32 ETH to 2,048. "
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T14:13:25.000Z",
    "title": "Fidelity may be considering a bitcoin spot ETF",
    "url": "https://crypto.news/fidelity-may-be-considering-a-bitcoin-spot-etf/",
    "description": "In the latest turn of events, Fidelity may be planning moves in the crypto market with the launch of a bitcoin spot ETF or a potential acquisition of Grayscale."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T14:15:57.000Z",
    "title": "Ripple: Fill Your XRP Bags with a 50% Discount on BitMart as SEC Lawsuit Nears the End",
    "url": "https://www.crypto-news-flash.com/ripple-fill-your-xrp-bags-with-a-50-discount-on-bitmart-as-sec-lawsuit-nears-the-end/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-fill-your-xrp-bags-with-a-50-discount-on-bitmart-as-sec-lawsuit-nears-the-end",
    "description": "BitMart users can get a 50 percent discount on XRP purchases for a short time this week. The promo is designed to enable users to acquire XRP as the Ripple vs SEC lawsuit nears its end. With a 50 percent discount sale coming up on BitMart, XRP enthusiasts get to expand their portfolio or invest [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-19T14:27:00.000Z",
    "title": "Divorced Mom Loses Entire Life Savings in ‘Pig Butchering’ Scam",
    "url": "https://coinedition.com/divorced-mom-loses-entire-life-savings-in-pig-butchering-scam/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/SCAM-21-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/06/SCAM-21.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Recent reports show a disturbing trend known as &#8220;pig butchering&#8221; is sweeping across the nation, leaving victims devastated and financially ruined. The latest case involves Rebecca Holloway, a recently divorced mother-of-three, who fell prey to a cunning scammer she met on the dating app Tinder, who manipulated her into investing her hard-earned money in fictitious [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/divorced-mom-loses-entire-life-savings-in-pig-butchering-scam/\">Divorced Mom Loses Entire Life Savings in &#8216;Pig Butchering&#8217; Scam</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-19T14:30:52.000Z",
    "title": "Coinbase Chief Legal Officer Calls Out SEC, Says Regulator Defying Questions From Federal Court",
    "url": "https://dailyhodl.com/2023/06/19/coinbase-chief-legal-officer-calls-out-sec-says-regulator-defying-questions-from-federal-court/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Granted-Operating-License.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" /><p>The chief legal officer of Coinbase says the U.S. Securities and Exchange Commission (SEC) is defying questions from a federal court related to the crypto exchange&#8217;s request for regulatory clarity. In a lengthy thread, Paul Grewal says that the SEC is answering the Third Circuit’s questions in an evasive manner, which the executive says is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/19/coinbase-chief-legal-officer-calls-out-sec-says-regulator-defying-questions-from-federal-court/\">Coinbase Chief Legal Officer Calls Out SEC, Says Regulator Defying Questions From Federal Court</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]