[
  {
    "source": "Decrypt",
    "date": "2023-05-29T17:19:41.000Z",
    "title": "Meet the Crypto Rich Who Want to Live Forever: Inside Vitalik's Zuzalu",
    "url": "https://decrypt.co/142530/meet-crypto-rich-who-want-live-forever-inside-vitaliks-zuzalu",
    "description": "Zuzalu attendees tell Decrypt about the secretive two-month gathering of tech leaders in a Montenegrin seaside town, which ended last week."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-29T17:12:13.000Z",
    "title": "Is the US 30% Bitcoin mining tax dead?",
    "url": "https://cryptoslate.com/is-the-us-30-bitcoin-mining-tax-dead/",
    "description": "<p>In a significant turn of events, the controversial Digital Asset Mining Energy (DAME) excise tax was not included in the latest Fiscal Responsibility bill aimed at tackling the Debt Ceiling crisis. This proposed 30% tax on energy costs for cryptocurrency miners drew widespread criticism from stakeholders within the crypto-mining sector and U.S. lawmakers. Thus, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/is-the-us-30-bitcoin-mining-tax-dead/\">Is the US 30% Bitcoin mining tax dead?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-29T17:30:00.000Z",
    "title": "From Play-to-Earn to Virtual Reality: The Thriving Subgenres of Crypto Gaming",
    "url": "https://cryptodaily.co.uk/2023/05/from-play-to-earn-to-virtual-reality-the-thriving-subgenres-of-crypto-gaming",
    "description": "<p class=\"s3\">The crypto game market is still young, but it's expanding quickly. Several reasons contribute to its expansion, making it more appealing to players. The growing acceptance of blockchain technology is one such cause. Owing of its safety, openness, and decentralization, this technology is used in various sectors, including the gaming industry.</p>\n<p class=\"s3\">The rising need for interactive and immersive experiences is also contributing to the expansion of the crypto gaming industry. These days, players want games that feel more like the real world, and crypto games provide that.&nbsp;</p>\n<p class=\"s3\">Another appealing feature of crypto gaming is the possibility of profiting from crypto. Participating in games, performing tasks, and winning tournaments all provide players with opportunities to earn cryptocurrency. The development of the crypto sector is stimulated by this monetary incentive to participate in crypto gaming.</p>\n<p class=\"s3\">While still in its infancy, the crypto gaming sector shows great promise as a future powerhouse in the gaming sector. More sophisticated crypto games will likely be created as the sector matures, with more options for players to earn cryptocurrency and engage in immersive and interactive experiences.</p>\n<p class=\"s3\">Play-to-Earn Games</p>\n<p class=\"s3\">The popularity of Play-to-Earn games has skyrocketed in the crypto gaming community because they allow players to earn crypto as they play. These games' economies are based on cryptographic tokens and are constructed using blockchain technology. As a result of the popularity of these games, more play-to-earn games have emerged, making this genre one of the most exciting in cryptocurrency gaming companies.</p>\n<p class=\"s3\">Virtual Reality Games</p>\n<p class=\"s3\">While the concept of virtual reality (VR) games is not new, incorporating blockchain technology has increased the sense of realism experienced by players. Blockchain technology makes a safer and more transparent method of exchanging virtual assets and monetizing gaming experiences possible. Players of VR games have access to a 3D digital environment in which they may create, play, and sell their assets. Notably, this subgenre of crypto gaming also shows great potential for development and expansion.</p>\n<p class=\"s3\">This article will focus on 2023's best crypto games and where they rank. We will investigate which games have the greatest room for expansion and innovation based on their existing offers and future ambitions. By examining these games, we seek to inform players about the state of the crypto gaming industry and direct them toward the games with the most potential.</p>\n<p class=\"s3\">My Lovely Planet</p>\n<p class=\"s3\">My Lovely Planet by Ubisoft Lab is a mobile game with a simple but powerful idea. It lets you have fun while making a difference in the real world. As a player, you take on the part of a Lovely Protector whose goal is to make a safe, green, and beautiful island. There are minigames in the game that let you earn seeds, tickets, and stars that you can use to plant trees and get new pieces of scenery, and build places. Every time a tree is planted in the game, a real tree is also put in the real world. This makes it an unforgettable moment.</p>\n<p class=\"s3\">My Lovely Planet has already made a big splash, with 8,000 regular players, 30,000 members, and a 4.7 review on the App Store and Play Store. On the other hand, the game's goal is to bring together 100 million players by 2030 to plant 1 billion trees, clean up 1 million tons of trash from the ocean, and protect 40,000 threatened species. My Lovely Planet got the Unity For Humanity award for making a difference and is planning a token sale to reach more people and add new features, including its token sale coming up in a few days.</p>\n<p class=\"s3\">Blocklords</p>\n<p class=\"s3\">Blocklords, a strategy game resembling Age of Empires and Crusader Kings, allows players to begin as characters from various social classes and accumulate a fortune by conducting conflicts and collecting taxes. The community-first approach of MetaKing Studios is revolutionizing the game development industry, allowing players to experience the game, provide feedback, and collaborate with developers to influence the game's direction.</p>\n<p class=\"s3\">Blocklords is well on its way to becoming a significant force in the gaming industry, having received a staggering $15 million in pilot stage funding from well-known game industry titans such as Square Enix, Krafton, Fun Plus, Makers Fund, BITKRAFT, Delphi Digital, Animoca Brands, and ShimaCapital, among others. The Community-Beta version of the game is presently available, enabling players to experience its distinctive features and gameplay mechanics. Notably, by entering the community and obtaining a free in-game hero, players are able to collaborate with others, expand their empires, and defeat their adversaries for free.</p>\n<p class=\"s3\">OVAL3</p>\n<p class=\"s3\">OVAL3 is an innovative concept that fuses sports, gaming, and technology to create a one-of-a-kind Rugby gaming experience. The game provides a realistic and exciting take on the sport of Rugby by letting players collect, play, and win actual digital cards. OVAL3 has licenses for 42 clubs, over 2,000 players, and three leagues in France and the United States, and it seems set to shake up the gaming sector. Additionally, OVAL3 has partnered with Web3 industry leaders ERA2140, Pyratz Labs, and Markchain to provide state-of-the-art technical and promotional assistance.</p>\n<p class=\"s3\">Numerous aspects of OVAL3 make it a desirable choice, including the fact that the world's finest Rugby player, Antoine Dupont, is both an ambassador and a stakeholder. There are already over 3,000 users in the game's marketplace, and weekly transactions total over $30,000. The game is slated for release shortly, and the company is launching a token sale in the next few days to create the Rugby ecosystem token, which combines sports, gaming, and finance freshly and innovatively.</p>\n<p class=\"s3\">Fungiball</p>\n<p class=\"s3\">Fungiball is a one-of-a-kind fantasy game developed on the Polygon blockchain by combining professional tennis with NFTs. In-game NFTs reflect the current market worth of real-world tennis players. Avatars may be customized by the user, given NFTs, and used in tournaments for prizes. In Fungiball, NFTs stand in for different tennis abilities, and their relative scarcity establishes their relative value.</p>\n<p class=\"s3\">In addition to providing a great gaming experience, Fungiball also includes a marketplace for NFT trading and a decentralized autonomous organization (DAO) that encourages participation from the community in policymaking. Players participating in tournaments and challenges can win Ethereum, NFTs, and other unique prizes. Rareness is used to classify the NFTs that stand for different tennis abilities. There is a well-defined plan in place for the future of Fungiball and a solid staff, partnerships, and licensing back it. The initial auction of 48 NFTs will occur during the French Open in early June, and the game's release is scheduled for the end of the year.</p>\n<p class=\"s3\">&nbsp;In Brief</p>\n<p class=\"s3\">Cryptocurrency gaming has gone a long way and will likely keep expanding. In-game asset trading and monetization have been made safer and more transparent via blockchain technology and cryptocurrency. Some of the most exciting potential areas for development and innovation in the crypto gaming business include play-to-earn games and virtual reality games. We may anticipate the release of ground-breaking new games that expand the gaming universe as the industry develops.</p>\n<p class=\"s8\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-29T17:15:00.000Z",
    "title": "Bitcoin Price Analysis:  Stops Elected Above 28347 - 30 May 2023",
    "url": "https://cryptodaily.co.uk/2023/05/bitcoin-price-analysis-stops-elected-above-28347-30-may-2023",
    "description": "<p>BTC/USD Elects Stops Above 28347:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 30 May 2023</p>\n<p>Bitcoin (BTC/USD) moderated following its recent rally early in the Asian session as the pair reached the 28473.93 level before depreciating back below the 28000 level.&nbsp; Stops were elected above the 27873.17 and 28347.74 levels during the appreciation, upside price objectives related to recent upside pressure around the 25864.35 and 26559.96 levels.&nbsp; Following recent price activity, areas of technical resistance and potential selling pressure include the 29048, 29143, and 29813 levels.&nbsp; Upside retracement levels in recent depreciating ranges include the 28700, 28741, 28868, 29243, 29299, and 29284 levels. &nbsp;Above the market, upside price objectives include the 30420.74, 31237.11, 31477.37, 32501.23, 32556.73, 32989.19, 34583.96, 34658.69, 35222.66, 37765.28, and 38403.97 levels.&nbsp;</p>\n<p>Technical buying pressure has recently been steady around the 26641 area, a downside price objective also linked to the 27678.73 area.&nbsp; Downside price objectives associated with the 28334.75 and 27647.82 levels include the 25604.43 and 25124.80 levels.&nbsp; Additional downside price objectives include the 25474, 25442, 24705, 24440, 23208, and 22769 levels.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bullishly indicating above the 100-bar MA (hourly) and above the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;200-bar MA&nbsp;(4-hourly) at 27710.63 and the&nbsp;50-bar MA&nbsp;(Hourly) at 27243.43.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;25604.51/ 24440.41/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-29T17:30:22.000Z",
    "title": "Gemini and Genesis Fight Back Against SEC Lawsuit, Seek Dismissal of Allegations",
    "url": "https://news.bitcoin.com/gemini-and-genesis-fight-back-against-sec-lawsuit-seek-dismissal-of-allegations/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/gem-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Gemini and Genesis Fight Back Against SEC Lawsuit, Seek Dismissal of Allegations\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/gem-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/gem-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/gem-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/gem-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/gem-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/gem-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/gem.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Gemini Trust Company and Genesis Global Capital filed a court document on May 26, 2023, seeking the dismissal of a lawsuit brought by the U.S. Securities and Exchange Commission (SEC). The regulatory body had accused the two crypto firms of offering unregistered securities. Gemini and Genesis Refute SEC&#8217;s Claims of Unregistered Securities, File Motion to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T17:36:01.000Z",
    "title": "Hong Kong launches HKLVAA & Web3 harbor to drive Web3 industry growth",
    "url": "https://www.cryptopolitan.com/hong-kong-launches-hklvaa-web3-harbor-to-drive-web3-industry-growth/",
    "description": "Hong Kong&#8217;s Web3 industry witnessed a significant milestone on Monday as leaders came together to announce the establishment of two pioneering associations: the Hong Kong Licensed Virtual Assets Association (HKLVAA) and Web3 Harbour. The momentous occasion occurred at the highly anticipated Radical Finance Asia event, marking the beginning of a concerted effort to foster the ... <a title=\"Hong Kong launches HKLVAA &#38; Web3 harbor to drive Web3 industry growth\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hong-kong-launches-hklvaa-web3-harbor-to-drive-web3-industry-growth/\" aria-label=\"More on Hong Kong launches HKLVAA &#38; Web3 harbor to drive Web3 industry growth\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T17:34:18.000Z",
    "title": "Huobi HK introduces crypto spot trading services in Hong Kong, aims for regulatory compliance",
    "url": "https://www.cryptopolitan.com/huobi-hk-introduces-crypto-spot-trading-services-hong-kong/",
    "description": "Huobi HK, a subsidiary of digital asset exchange Huobi Global, has taken a significant step in the crypto industry by applying for a virtual asset exchange license in Hong Kong. The exchange submitted an application notice to the Hong Kong Securities and Futures Commission on May 29, aligning with the regulatory requirements for offering regulated ... <a title=\"Huobi HK introduces crypto spot trading services in Hong Kong, aims for regulatory compliance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/huobi-hk-introduces-crypto-spot-trading-services-hong-kong/\" aria-label=\"More on Huobi HK introduces crypto spot trading services in Hong Kong, aims for regulatory compliance\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-29T17:35:54.000Z",
    "title": "Bank of Japan advances CBDC program, following successful tests",
    "url": "https://crypto.news/bank-of-japan-advances-cbdc-program-following-successful-tests/",
    "description": "The Bank of Japan (BOJ) has completed the second stage of its CBDC experimentation and is now moving forward with its pilot project."
  },
  {
    "source": "BTCManager",
    "date": "2023-05-29T17:18:08.000Z",
    "title": "Big solana buys on Huobi may be driven by Hong Kong’s new crypto regulations",
    "url": "https://crypto.news/big-solana-buys-on-huobi-may-be-driven-by-hong-kongs-new-crypto-regulations/",
    "description": "A large amount of Solana has been purchased on Huobi, preceding the landmark decision by the Hong Kong government to allow citizens to buy crypto starting June 1st."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-29T17:32:46.000Z",
    "title": "This Dogecoin Competitor is Up 100% Since April, Experts Believe It Can Do 10,000% Before December",
    "url": "https://www.crypto-news-flash.com/this-dogecoin-competitor-is-up-100-since-april-experts-believe-it-can-do-10000-before-december/?utm_source=rss&utm_medium=rss&utm_campaign=this-dogecoin-competitor-is-up-100-since-april-experts-believe-it-can-do-10000-before-december",
    "description": "<p>When you talk of memecoins, Dogecoin is one of the first you remember. Memecoins began gaining popularity in 2021, when they started doing impressive numbers. Even when the bull run began waning, this peculiar crypto class still made investors happy. Now, it seems another memecoin season is before us, as newer memecoins have begun to [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/this-dogecoin-competitor-is-up-100-since-april-experts-believe-it-can-do-10000-before-december/\">This Dogecoin Competitor is Up 100% Since April, Experts Believe It Can Do 10,000% Before December</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]