[
  {
    "source": "NullTX",
    "date": "2023-07-01T12:11:56.000Z",
    "title": "Expertise, Innovation, Wealth: TMS Network’s (TMSN) Rise over Aptos (APT) and Fantom (FTM)",
    "url": "https://nulltx.com/expertise-innovation-wealth-tms-networks-tmsn-rise-over-aptos-apt-and-fantom-ftm/",
    "description": "TMS Network (TMSN) is rapidly gaining popularity in the cryptocurrency space as it approaches the fourth phase of its presale, having already raised $7 million. TMS Network (TMSN) is outperforming competitors such as Aptos (APT) and Fantom (FTM) by demonstrating its experience, innovation, and potential for wealth generation. With a fervent community backing and a [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-01T12:30:30.000Z",
    "title": "Ethereum Name Service (ENS) Expands to Layer 2 Ecosystem, Enhancing Scalability and Accessibility",
    "url": "https://www.crypto-news-flash.com/ethereum-name-service-ens-expands-to-layer-2-ecosystem-enhancing-scalability-and-accessibility/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-name-service-ens-expands-to-layer-2-ecosystem-enhancing-scalability-and-accessibility",
    "description": "Ethereum naming system developers plan to utilize off-chain resolvers. ENS achieved an impressive milestone of over 2.2 million registered domain names.  During a community call on Thursday, ENS Labs, the Ethereum Name Service developer (ENS), announced its plans to integrate Layer 2 interoperability with ENS domains. This decentralized domain name system, built on the Ethereum [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-01T12:24:42.000Z",
    "title": "TerraCVita Takes Measures to Track Stolen Funds, Partners with Law Enforcement",
    "url": "https://www.crypto-news-flash.com/terracvita-takes-measures-to-track-stolen-funds-partners-with-law-enforcement/?utm_source=rss&utm_medium=rss&utm_campaign=terracvita-takes-measures-to-track-stolen-funds-partners-with-law-enforcement",
    "description": "Over 60% of the stolen funds have been blocked by exchanges with the assistance of TerraCVita and community members. TerraCVita has temporarily suspended the platform for an in-depth check of the contract and a comprehensive internal and external third-party investigation. According to a tweet by Terraport Finance, significant developments have unfolded following the security breach [...]"
  }
]