[
  {
    "source": "CoinDesk",
    "date": "2023-06-09T17:41:38.000Z",
    "title": "The New Crypto Bill Gary Gensler Doesn’t Want You to Know About",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/09/the-new-crypto-bill-gary-gensler-doesnt-want-you-to-know-about/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "U.S. law doesn’t let appointed regulators trump elected officials. But the SEC head may be doing exactly that."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-09T18:04:09.000Z",
    "title": "Crypto.com to Close US Institutional Service Amid SEC's Crypto Crackdown",
    "url": "https://decrypt.co/143988/crypto-com-close-us-institutional-service-amid-sec-crypto-crackdown",
    "description": "Singapore-based cryptocurrency exchange Crypto.com said Friday that it will wind down its institutional service in the States."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-09T17:51:19.000Z",
    "title": "'Ethereum Fails' Without These 3 Changes, Says Vitalik Buterin",
    "url": "https://decrypt.co/143991/ethereum-fails-without-these-3-changes-says-vitalik-buterin",
    "description": "Without scaling solutions, secure wallets, and better privacy measures, the future of Ethereum may be under threat, said its co-founder."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-09T17:57:02.000Z",
    "title": "Price analysis 6/9: BTC, ETH, BNB, XRP, ADA, DOGE, SOL, MATIC, LTC, DOT",
    "url": "https://cointelegraph.com/news/price-analysis-6-9-btc-eth-bnb-xrp-ada-doge-sol-matic-ltc-dot",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/9831431c-71cf-4efc-bd6c-d3f6fba8b01a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Stock markets are showing strength, and selling by crypto traders has taken a pause. Is this a sign that Bitcoin and altcoins are about to reverse course? </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) remains well above the crucial support at $25,250, indicating that market participants have shrugged off the news of the lawsuit by the United States Securities and Exchange Commission (SEC) against Binance and Coinbase. When markets do not stay lower for long after negative news, it is a sign that traders are looking to buy the dips rather than panic and dump their holdings.</p><p>ARK Invest CEO Cathie Wood has been<a href=\"https://cointelegraph.com/news/cathie-wood-ark-invest-buys-block-inc-shares-etf\"> buying the dip in crypto-related stocks</a> since the SEC unleashed its recent crypto regulatory action. First Wood purchased $21 million worth of Coinbase stock on June 6 and followed that up with a purchase of Block Inc. shares worth $19.9 million between June 7 and 8.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/d84b3501-bb9e-4bee-9b89-54bb9ec2d1fd.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>The resilience of the cryptocurrency space is supported by a risk on sentiment. The U.S. equities markets are on a roll with the S&amp;P 500 <a href=\"https://www.cnbc.com/2023/06/08/stock-market-today-live-updates.html\" target=\"_blank\" rel=\"noopener nofollow\">rising</a> above 4,300 on June 9, the first such instance since August 2022. </p><p>Can bulls sustain the recovery in the cryptocurrency markets or will higher levels bring out the bears in large numbers? Let’s study the charts of the top-10 cryptocurrencies to find out.</p><h2>Bitcoin price analysis</h2><p>Bitcoin turned down from the moving averages on June 7 but a minor positive is that the bulls did not allow the price to slump below $26,125. This suggests that lower levels are attracting buyers.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/a7b5520d-897b-4451-a533-bca760fdb85b.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls will again try to thrust the price above the 20-day exponential moving average ($26,924). If they succeed, it will suggest that the selling pressure is reducing. </p><p>The BTC/USDT pair may then climb to the 50-day simple moving average ($27,536) and later to the resistance line of the descending channel. The bears are expected to fiercely defend this level.</p><p>Another possibility is that the price turns down from the current level. In that case, the bears will try to strengthen their position by pulling the price to $25,250. Buyers are likely to protect this level to the best of their ability.</p><h2>Ether price analysis</h2><p>The bulls have managed to maintain Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) above the resistance line of the falling wedge pattern, indicating demand at lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/c1116870-74de-4c93-8085-1ddfd30b78ad.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The 20-day EMA ($1,854) has flattened out and the relative strength index (RSI) is near the midpoint, indicating a balance between supply and demand. This balance will tilt in favor of the bears if they yank the price below $1,778. The ETH/USDT pair may then slip to $1,740 and subsequently to the support line of the wedge.</p><p>On the contrary, if buyers drive the price above $1,927, the bulls will gain the upper hand. The pair may first rise to $2,000 and thereafter dash toward the next major resistance at $2,200.</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) nosedived below the important support of $265 on June 7. The bulls tried to push the price back above the breakdown level on June 8 but the bulls held their ground.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/713b2f9d-8d7e-46e8-8a77-8518cbae4d7f.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The RSI in the oversold zone indicates that the selling may have been overdone in the near term. That could start a relief rally which is likely to face selling at $265 and again at $280. If the price turns down from either level, it will signal that the sentiment remains negative and traders are selling on rallies. </p><p>On the downside, if bears sink the price below the intraday low of $253 made on June 7, the BNB/USDT pair may extend its decline to $240 and below that to $220.</p><h2>XRP price analysis</h2><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) remains in an up-move. The bears tried to start a correction but could not pull the price to the 20-day EMA ($0.50) on June 7 indicating that the bulls are holding strong.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/d94b5dc7-bda4-4661-8677-be96fa897eff.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The rising 20-day EMA and the RSI in the positive territory indicate that the bulls are in command. Buyers will try to thrust the price above the overhead zone between $0.56 and $0.58. If they succeed, the XRP/USDT pair may start a new uptrend. The pair may first climb to $0.60 and then to $0.80.</p><p>If bears want to start a pullback, they will have to tug the price below the 20-day EMA. That may attract profit-booking from short-term traders and the pair could fall to the 50-day simple moving avearge ($0.47) and later to $0.42.</p><h2>Cardano price analysis</h2><p>The bulls tried to start a relief rally on June 8 but the long wick on the day’s candlestick shows that bears continue to sell Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/c3ce823d-0711-413e-a92a-d84b25688d6f.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: TradingView</em></figcaption></figure><p>Although the downsloping moving averages indicate advantage to bears, the RSI in the oversold territory suggests that a relief rally may be around the corner.The ADA/USDT pair may bounce off the solid support at $0.30.</p><p>The first overhead resistance to watch out for is the 20-day EMA ($0.35). A break and close above this resistance will indicate that the selling pressure may be reducing.</p><p>Alternatively, if the price continues lower and plummets below $0.30, it will clear the path for a potential decline to $0.24.</p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) remains below the breakdown level of $0.07 but the bulls have not allowed the bears to sink the price to the next support near $0.06.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/9b32412a-d8fd-4d6e-811d-7af55e30f689.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: TradingView</em></figcaption></figure><p>Any recovery from the current level is likely to face selling near the 20-day EMA ($0.07) as seen from the long wick on the June 9 candlestick. </p><p>If the price turns down and continues lower, it will suggest that the bears are selling near overhead resistance levels. The DOGE/USDT pair could then dip toward the support near $0.06.</p><p>If bulls want to prevent the decline, they will have to quickly drive the price above the 20-day EMA. Such a move will suggest the start of a stronger recovery. The pair may then attempt a rally to $0.08.</p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) dipped below the $18.70 support on June 8 but the long tail on the candlestick shows that the bulls are trying to protect the level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/0cdfe230-6ca7-484f-9a34-09f323e41281.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The 20-day EMA ($20.15) has turned down and the RSI is below 39, indicating that it is going to be difficult for the bulls to start a solid rebound from the current levels. If the price breaks and sustains below $18.70, the SOL/USDT pair could drop to $17 and thereafter to the vital support at $15.28.</p><p>Contrary to this assumption, if the price rebounds off the current level, the pair may reach the moving averages. A break and close above the 50-day SMA ($20.92) will signal the start of a stronger relief rally toward $24.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-stuck\"><strong><em>Why is Bitcoin price stuck?</em></strong></a></p><h2>Polygon price analysis</h2><p>Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) continues to move lower toward its crucial support at $0.69, indicating that bears are in firm control.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/efa2c883-28cb-42e3-9df7-112fa707369d.png\"  /><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls are expected to defend the $0.69 level with vigor because if they fail to do that, the selling may intensify and the MATIC/USDT pair could plunge to the next major support at $0.50.</p><p>On relief rallies, the breakdown level of $0.82 is likely to act as a major hurdle. If bulls overcome this obstacle, the pair may move up to $0.94. This level is likely to witness strong selling by the bears.</p><h2>Litecoin price analysis</h2><p>The bulls repeatedly purchased the dip below the 50-day SMA ($88) between June 7 and 9, indicating solid demand at lower levels. However, the bears have not given up as they continue to sell Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) near the 20-day EMA ($90).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/1008885e-f12b-4777-9d83-b938b00de1db.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>If the price turns down from the current level, the bears will try to pull the LTC/USDT pair to the uptrend line, which is likely to attract buyers. If the price rebounds off the uptrend line, it will suggest that the pair may extend its stay inside the triangle for a few more days.</p><p>On the upside, buyers will have to push the price above the 20-day EMA ($90) to open the doors for a possible rally to the resistance line of the triangle. </p><p>The next trending move is likely to begin after the price breaks above or below the triangle. Until then, the range-bound action is likely to continue.</p><h2>Polkadot price analysis</h2><p>Polkadot (<a href=\"https://cointelegraph.com/polkadot-price-index\">DOT</a>) remains below the breakdown level of $5.15 but a minor advantage in favor of the bulls is that they have not allowed the bears to sink the price below the immediate support at $4.90.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/db15c0a2-8a20-41e4-8c3a-79b0036a6e2a.png\"  /><figcaption style=\"text-align: center;\"><em>DOT/USDT daily chart. Source: TradingView</em></figcaption></figure><p>If the price turns up from the current level, it will suggest buying on dips. The bulls will then again try to propel the price above the 20-day EMA ($5.24). If they do that, the DOT/USDT pair may recover to $5.56.</p><p>Contrarily, if the price once again turns down from $5.15 or the 20-day EMA, it will indicate that bears continue to sell on minor rallies. That will increase the possibility of a drop below $4.90. The next major support on the downside is way lower at $4.22.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-09T18:01:57.000Z",
    "title": "Buterin says Ethereum needs 3 critical transitions to ensure its survival",
    "url": "https://cryptoslate.com/buterin-says-ethereum-needs-3-critical-transitions-to-ensure-its-survival/",
    "description": "<p>Ethereum co-founder Vitalik Buterin said the Ethereum network needs to go through three major technical transitions related to Layer-2 scaling, wallet security, and privacy as it matures from a &#8220;young experimental technology into a mature tech stack.&#8221; Buterin added that these transitions must be executed &#8220;roughly simultaneously&#8221; to ensure success and if any of them [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/buterin-says-ethereum-needs-3-critical-transitions-to-ensure-its-survival/\">Buterin says Ethereum needs 3 critical transitions to ensure its survival</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-09T17:45:00.000Z",
    "title": "Explore the Enigmatic Galaxy: Embark on an Immersive Journey in the IC1101 Metaverse",
    "url": "https://cryptodaily.co.uk/2023/06/explore-the-enigmatic-galaxy-embark-on-an-immersive-journey-in-the-ic1101-metaverse",
    "description": "<p>IC1101 is committed to providing a more immersive, fun, and autonomous experience than the current metaverse. IC1101, named after its astronomical designation, shines with infinite, mysterious light in the vast universe. As one of the largest known galaxies in the universe, IC1101 represents a huge, mysterious, and spectacular existence. It undoubtedly contains endless wonders and unknowns waiting for human exploration.</p>\n<p>IC1101 is a mysterious galaxy, a new metaverse project name, and a super immersive multi-dimensional universe platform dedicated to providing a more immersive, fun, and autonomous experience than the current metaverse. Participants will be able to explore the mysterious qualities of IC1101 and discover endless possibilities within it.</p>\n<p>Current metaverse projects often have limitations in terms of graphics, immersion, and participant decision-making power. IC1101 aims to solve these limitations and take the realism, participation, and activity of the metaverse world to a new level.</p>\n<p>So, can it stand out in fierce competition and become a dark horse? Let us embark on the journey of IC1101 together, explore this mysterious galaxy, and find the answers.</p>\nWhen Adventure Meets Creativity\n<p>In the world of the metaverse, a fascinating worldview is particularly important: it not only determines the style of the project and the immersion of the players, but also opens up more imagination space for storytelling. As a galaxy full of wonders and fantasies, IC1101 has a unique and captivating worldview, bringing unprecedented experiences to participants.</p>\n<p>The worldview of IC1101 is based on diversity and freedom. Eight major races converge in this galaxy, each with unique appearances and abilities. From appearance to cultural customs, from ideological concepts to social structures, the differences between races in IC1101 are rich and inclusive. In this galaxy, players will be able to explore the blending and mutual influence of diverse cultures, and feel the interaction and cooperation between different races.</p>\n<p>IC1101 also provides players with great freedom and creativity. Players can choose their own role identity, create unique appearance and personality traits, and participate in various exciting activities and scenarios, such as driving spaceships to explore unknown planets in the galaxy, discovering hidden cosmic secrets; They can also join teams, collaborate to solve complex puzzles and tasks, and experience the fruits of cooperation and unity. At the same time, players can also trade in the economic market of IC1101, buying and selling various precious resources and items, and developing their own wealth and power.</p>\n<p></p>\n<p>Overall, IC1101 combines elements of science fiction, fantasy, and mystery. Players will find themselves in a colorful and mysterious interstellar world, where every exploration and adventure brings new surprises and challenges. But how will this worldview be realized through technology?</p>\nMulti-platform support attracts different user groups.\n<p>Overall, IC1101 is an immersive metaverse platform based on a multi-chain architecture that allows users from different public chains to easily connect. Through the introduction of token economics and NFTs, users can have their own digital assets and ownership, and can engage in social and game cooperation to complete tasks, satisfy their desires, and earn rewards.</p>\n<p>IC1101's appeal is not just in its technological innovation and diverse universe construction, but more importantly, in its ability to attract different types of user groups.</p>\n<p>Before introducing specific products and technologies, it is worth considering who will be interested in the metaverse. We can divide IC1101's audience into two categories, heavy gamers and casual gamers.</p>\n<p>The former includes tech enthusiasts and gamers who have some technical expertise and equipment requirements, are interested in immersive virtual experiences, and pursue the ultimate experience; while the latter are more focused on commercial and social aspects, such as enterprises or projects interested in Web3 business models, and players who want to find more social opportunities and new friends in the virtual world.</p>\n<p>Based on the needs of different user groups, IC1101 provides two products to meet their expectations: IC1101 World and IC1101 Space.</p>\nIC1101 World: A more immersive metaverse world.\n<p>IC1101 World is a more immersive metaverse world. In terms of technology and graphics, it is created using the Unreal Engine 5, with outstanding image quality that forms a strong contrast to most of the current metaverse projects made with the Unity engine, which tend to be low-poly in style.</p>\n<p>In actual gameplay experience, we can see finely detailed graphics similar to those of AAA games, including finely detailed building details, dynamic blur during movement, and reflection of ripples on the water surface, all of which make players feel fully immersed in a virtual world.</p>\n<p></p>\n<p>In terms of scene design, IC1101 World provides more three-dimensional scenes, including different planets and buildings. Each planet has a unique theme and function, such as planets specifically designed for battles and planets for exhibitions and demonstrations. Different buildings also serve different purposes, such as Sony's music hall, which can be used for music playback and related artist activities.</p>\n<p>In terms of scene design, IC1101 World offers more three-dimensional scenes, including different planets and buildings. Each planet has a unique theme and function, such as planets specifically designed for battles and planets for exhibitions and demonstrations. Different buildings also have different functions, such as Sony's music hall, which can be used for music playback and artist-related activities.</p>\n<p>In addition, virtual assets have been mapped more realistically in the IC1101 World, and players can directly view and purchase NFTs in the mall, change outfits, and become a 3D image of the NFT, which also provides possibilities for more collaborative creation.</p>\nIC1101 Space: Lower Threshold for Participation\n<p>IC1101 World will bring better graphics and a more immersive world to players, but the cost is higher hardware requirements for accessing devices. A well-configured computer may be needed to smoothly enter the metaverse.</p>\n<p>However, not everyone is a hardcore gamer or an extreme immersion seeker. For more casual players who want to experience the scenes and interactions of the metaverse, IC1101 provides another option: IC1101 Space.</p>\n<p>IC1101 Space can be accessed through a simple browser login, presented in the form of a webpage, making it convenient and fast to use. Although the graphics may not be as detailed as the World version, they significantly lower the barrier to entry, making them particularly suitable for commercial and social users.</p>\n<p>In IC1101 Space, players can take on their own roles and participate in online displays and interactions. Compared to traditional social media platforms, IC1101 Space provides richer ways of interaction. In the same scene, players can communicate and greet others, have deeper interactions with organizations, media, and partners they are interested in, bringing them closer together. Immersion is not the first choice for social demand orientation, as it is more important to allow more people to participate in the activities together. IC1101 has achieved this very well.</p>\n<p>It is worth mentioning that the user data and scenes of the two versions, IC1101 World and IC1101 Space, are interoperable. This means that users can choose different login methods according to their own needs, but their behavior is visible in both versions, and together they influence the world of IC1101. This versioning method for different user groups can attract more users and provide better experiences for different types of participants. This is relatively rare in current metaverse projects, and many projects may not have considered this layered demand.</p>\n<p>For hardcore players and explorers who are looking for ultimate graphics and immersion, IC1101 World provides a more immersive metaverse experience. For casual players who want to participate in metaverse social and business activities, IC1101 Space provides a lower threshold for participation. Whether for technology enthusiasts, gamers, business users, or social users, IC1101 can meet their needs and create new digital experiences and lifestyles for them.</p>\nA sense of participation puts the galaxy within reach.\n<p>The essence of social interaction is a sense of participation. People are the sum of social relationships, and in many metaverse projects, simple display and gathering are only a one-way and low-interaction social relationships, which cannot give players a strong sense of participation. Over time, players will feel empty and boring, and a rich and fulfilling virtual world seems out of reach.</p>\n<p>Therefore, the metaverse also needs to be built around a sense of participation, so that users are willing, good at, and immersed in this virtual world, becoming \"digital natives\" in the metaverse.</p>\n<p>In addition to excellent graphics and sensitive user segmentation, IC1101 is also working on a sense of participation.</p>\n<p>Firstly, in terms of social aspects, in IC1101, users can enter with their own NFT digital avatars, and can also use these avatars within IC1101. This way, users can communicate with others in the virtual world through their digital avatars. Through functions such as lobby chat, private chat, friend teaming, community tasks/activities, live streaming, and social media sharing, users can establish emotional connections with others. In addition, users can also enhance friendships by sending friends gifts. These social functions not only allow users to display their digital avatars in IC1101, but also to establish real social relationships with others.</p>\n<p></p>\n<p>Next, let's delve into the gaming aspect. IC1101 is committed to creating interactive gaming spaces. In the world of IC1101, users can indulge in a wide variety of casual games, enticing more Web2 multi-users to migrate to the Web3 world. With diverse gaming experiences, IC1101 offers users more interactive and entertaining choices, allowing them to have a stronger sense of engagement within the game.</p>\n<p>In addition, IC1101 provides a whole new shopping experience. Users can present and sell 2D NFTs purchased on other platforms in a 3D manner within IC1101. Furthermore, brand collaborations are able to bring users a shopping experience beyond reality. By partnering with brands, IC1101 has created a 3D NFT digital mall, offering users a completely new way of shopping and experiencing.</p>\n<p>Finally, IC1101 also allows users to participate in scenario decision-making. Users can vote to decide the functions of buildings and scenes implemented in the metaverse world. This way, users can participate in the construction process of the metaverse, express their opinions and ideas, and further enhance their sense of participation in IC1101.</p>\nExpert Team\n<p>The project members of IC1101 are a group of creative industry experts with an average of 15 years of experience in their respective fields. The team members are located in North America and Asia, and have worked for globally renowned companies such as Dfinity, UBISOFT, Disney, Unity SF, and Konami. They have had long-standing partnerships with top global companies such as Blizzard, EA, Sony, and Amazon, and have participated in the development of many well-known products such as Hearthstone, World of Warcraft, Diablo, Harry Potter, New World, and The Last of Us.</p>\n<p></p>\n<p>The team members have a great passion for the Metaverse project and a deep understanding of it. They are familiar with the concept and development trends of the Metaverse, and are committed to creating an exciting and meaningful virtual experience for users.</p>\n<p>The strength and partnerships of the IC1101 team have laid a solid foundation for the success of the project. Their professional knowledge and rich experience will ensure that IC1101 can provide the best technical solutions and continuously drive the development of the Metaverse. The team's goal is to create a realistic and engaging virtual world for users where everyone can experience unlimited possibilities and fun.</p>\nSPACE X 3.0: Immerse Yourself in the Advanced Metaverse\n<p>Even before its official launch, IC1101 offers a unique opportunity for an early experience that everyone has been eagerly waiting for.</p>\n<p>On June 6th, starting at 10:00 AM, IC1101 is hosting a significant event called \"SPACE X 3.0\" Demo Day, providing a vital chance for those interested in the project. This event will showcase the latest developments of the IC1101 project and allow participants to have a firsthand experience of its remarkable products.</p>\n<p>\"SPACE X 3.0\" Demo Day will take place in IC1101 Space. Participants will enter this metaverse in the form of digital avatars and engage in interactions with others. The event will offer a diverse range of experiences, including airdrops of tokens and real-time PvP competitions.</p>\n<p>From the scenes of the event, it's apparent that the inaugural Demo Day has attracted thousands of visitors and garnered support from 30 VCs and 8 media outlets. This demonstrates the convenience, immersion, and engagement that IC1101 provides to its participants.</p>\n<p>Beyond the event itself, we are also highly excited about the future of the IC1101 project. Through the showcase at Demo Day, IC1101 will unveil its enormous potential and prospects as a real metaverse to the world, bringing users more innovation and thrilling experiences.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T17:45:22.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-09T18:00:41.000Z",
    "title": "Fetch.ai, Singularity NET Top Gainers but InQubeta’s (QUBE) Fundamentals Are Stronger",
    "url": "https://nulltx.com/fetch-ai-singularity-net-top-gainers-but-inqubetas-qube-fundamentals-are-stronger/",
    "description": "Fetch.ai (FET) and SingularityNET (AGIX) have rebounded better than most cryptocurrencies since the 2022 crash, but InQubeta’s (QUBE) fundamentals remain stronger. The InQubeta presale is bringing in lots of investors who are eager to 4x their investments during the presale period alone.  Fetch.ai had its initial coin offering (ICO) in 2019 and investors 4.64x their [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-09T18:00:00.000Z",
    "title": "Tether dominating stablecoin market, this new hybrid exchange aims to take over the trading world",
    "url": "https://crypto.news/tether-dominating-stablecoin-market-this-new-hybrid-exchange-aims-to-take-over-the-trading-world/",
    "description": "Tether is dominating the stablecoin world. with regulators tightening their grip on top exchanges like Coinbase and Binance, experts are bullish Tradecurve will dominate "
  },
  {
    "source": "BTCManager",
    "date": "2023-06-09T17:43:29.000Z",
    "title": "Crypto.com to halt US institutional exchange service",
    "url": "https://crypto.news/crypto-com-to-halt-us-institutional-exchange-service/",
    "description": "Crypto.com has made the decision to discontinue its institutional exchange service for clients in the United States, with the suspension set to take effect on June 21."
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-09T18:00:25.000Z",
    "title": "SOL Hits 9.5M Active Addresses by Adding 86% New Users in May",
    "url": "https://coinedition.com/sol-hits-9-5m-active-addresses-by-adding-86-new-users-in-may/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/SOL_Hits_9_5M_Active_Addresses_by_Adding_86_New_Users_in_May-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/SOL_Hits_9_5M_Active_Addresses_by_Adding_86_New_Users_in_May-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/SOL_Hits_9_5M_Active_Addresses_by_Adding_86_New_Users_in_May-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/SOL_Hits_9_5M_Active_Addresses_by_Adding_86_New_Users_in_May.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Data from the blockchain research platform Nansen reflects an increasing interest in cryptocurrencies. According to Nansen, the number of active addresses among the top altcoins increased significantly. The highest among them was Solana, whose active addresses increased by an impressive 86%. The recent figures from Nansen contradict the prevailing sentiment that cryptocurrency is in a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sol-hits-9-5m-active-addresses-by-adding-86-new-users-in-may/\">SOL Hits 9.5M Active Addresses by Adding 86% New Users in May</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-09T18:05:58.000Z",
    "title": "XRP and Litecoin (LTC) Breakouts on the Horizon? Here’s How Bitcoin (BTC) Can Help: Crypto Analyst",
    "url": "https://dailyhodl.com/2023/06/09/xrp-and-litecoin-ltc-breakouts-on-the-horizon-heres-how-bitcoin-btc-can-help-crypto-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/09/xrp-bullish-overlooked-altcoins.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/09/xrp-bullish-overlooked-altcoins.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/09/xrp-bullish-overlooked-altcoins.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/09/xrp-bullish-overlooked-altcoins.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/09/xrp-bullish-overlooked-altcoins.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/09/xrp-bullish-overlooked-altcoins.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/09/xrp-bullish-overlooked-altcoins.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst thinks XRP and Litecoin (LTC) can rally if Bitcoin (BTC) can overcome a key price level. Crypto trader Michaël van de Poppe tells his 657,400 Twitter followers that BTC must rise above $26,800 to have a chance of rallying. &#8220;The lower timeframe picture for BTC is quite simple. We need to break [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/09/xrp-and-litecoin-ltc-breakouts-on-the-horizon-heres-how-bitcoin-btc-can-help-crypto-analyst/\">XRP and Litecoin (LTC) Breakouts on the Horizon? Here’s How Bitcoin (BTC) Can Help: Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]