[
  {
    "source": "Cointelegraph",
    "date": "2024-02-26T22:45:51.000Z",
    "title": " ‘New nine’ Spot Bitcoin ETF volumes reach new daily high as BTC nears $55K ",
    "url": "https://cointelegraph.com/news/new-nine-spot-bitcoin-etf-volumes-reach-new-high",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZjI0Yzk5MzQtNTQwYy00Nzc3LWIxMzUtNWYxYzlkY2FlZGI0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>BlackRock’s IBIT made up more than 50% of the daily trading volume and even smashed its own daily record by more than 30%.</p>\n                    <p><p>Trading volumes for the “new nine” spot Bitcoin exchange-traded funds (ETF) have notched a new daily record as Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> surged as high as $54,938 on Monday. </p><p>Trading volumes for the nine topped $2.4 billion on Feb. 26, beating the prior record of $2.2 billion set on the first trading day — Jan. 11, <a href=\"https://twitter.com/EricBalchunas/status/1762224483559977037\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to data shared by Bloomberg ETF analyst Eric Balchunas.</p><p>The figures on both days excluded volume from Grayscale’s converted Bitcoin ETF product (GBTC).</p><p><a href=\"https://cointelegraph.com/news/new-nine-spot-bitcoin-etf-volumes-reach-new-high\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-26T22:43:13.000Z",
    "title": "Bitcoin inches to $55,000, eyes all-time high with 21% gap",
    "url": "https://cryptobriefing.com/bitcoin-inches-55000-eyes-all-time-high/",
    "description": "Bitcoin's price nears $55,000 as BlackRock's Bitcoin ETF hits $1 billion in trading volume."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-26T23:00:42.000Z",
    "title": "CBDC Plan Encounters Firm GOP Senatorial Resistance",
    "url": "https://www.cryptopolitan.com/cbdc-encounters-gop-senatorial-resistance/",
    "description": "CBDC, a coalition of Senate Republicans spearheaded by the formidable Sen. Ted Cruz, has embarked on a concerted campaign aimed at reining in the expansive powers of the Federal Reserve in its prospective launch of a Central Bank Digital Currency. This maneuver is paramount as it sets the stage for a pivotal discourse in the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-26T22:42:05.000Z",
    "title": "Game developers hit back after OpenSea NFT delisting—here’s why",
    "url": "https://www.cryptopolitan.com/game-developers-hit-opensea-nft-delisting/",
    "description": "OpenSea once hailed as the dominant force in the NFT marketplace, has recently come under fire following its decision to delist NFT passes for the Web3 game OpenSeason. The controversial move has ignited discussions within the cryptocurrency and gaming communities, highlighting tensions between the platform&#8217;s regulatory compliance efforts and the broader ethos of decentralization that [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-26T23:00:29.000Z",
    "title": "OG Ethereum ERC-404 Token PANDORA Is Rallying Again, What’s Behind It?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-erc-404-pandora/",
    "description": "PANDORA, the first token to use the Ethereum ERC-404 token standard, is on the move after slowing down for a few weeks. The token’s price saw a significant surge over the weekend, rising around 50% to clear $24,000 once more. This recovery was triggered by a number of factors, so here they are. Whales Set Their Sights On PANDORA The most obvious reason behind the price push recorded for PANDORA over the weekend can be traced back to significant whale activity. On-chain data tracking website Lookonchain, flagged a number of whale transactions that took place in the days leading up to the price surge. Related Reading: The Polygon Vesting Contract Is Officially Empty, Will This Send MATIC Price To $3? The first whale accumulation was seen on February 20, when Lookonchain reported that a single whale had spent $4.89 million to purchase 244.24 PANDORA tokens. The buying spree took place over a number of days, and by the time the whale was done, they had an average entry price of $20,044. A giant whale spent 4.89M $USDC to buy 244.24 #PANDORA at an average price of $20,044 on Feb 13, Feb 14 and today.https://t.co/DR58pEXN5j pic.twitter.com/c7Q3sM6ksO — Lookonchain (@lookonchain) February 20, 2024 A couple of days later on February 23, the on-chain tracking platform reported that another whale was making their PANDORA play. This time around, the new whale spent $1.37 million buying 71.45 PANDORA tokens at an average price of $19,268. Another whale is buying #PANDORA, having spent 1.37M $USDC to buy 71.45 #PANDORA at an average price of $19,268 so far.https://t.co/o1z3c6EfLrhttps://t.co/NMzLjtdMqm pic.twitter.com/j0mGVsMik5 — Lookonchain (@lookonchain) February 23, 2024 Together, these whales scooped up a little over $6 million worth of tokens. When the price eventually hit $24,000, the first whale saw profit margins of almost $1 million, while the second whale was sitting on a profit of over $330,000. Price rose above $24,000 during the weekend &#124; Source: PANDORA/USDT on Tradingview.com First Set Of Incentives Land For Holders Another factor that has helped push the price of PANDORA over the week is incentives in the form of airdrops being announced for PANDORA holders. Monarch, a project also built on the Ethereum ERC-404 token standard, announced earlier in February that it would be awarding tokens to PANDORA investors. A total of 5% of the token supply was announced to be allocated as an airdrop for PANDORA holders. This incentive, coupled with the fact that PANDORA announced that it is gearing up to release the latest iteration of the ERC-404 token standard, created demand for the token. Related Reading: Bitcoin Fisher Transform Reaches Critical Level Not Seen Since 2021, What This Means PANDORA Token Performance During the weekend, the PANDORA price went from trending around $16,000 to rising 50% in one day to clear the $24,000 level. However, this high price level could not be sustained for long as a sharp dump would follow on February 23, apparently triggered by whales dumping their holdings. In the last day, the price of the token has continued to fluctuate between $16,000 and $17,000. As of the time of writing, the altcoin is trading at $17,139, with 5% losses in the last day, according to data from Dexscreener. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Binance, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-26T23:01:40.000Z",
    "title": "Hong Kong-based Crypto Exchange BitForex Halts Withdrawals After $56 Million Leaves Wallets: Report",
    "url": "https://dailyhodl.com/2024/02/26/hong-kong-based-crypto-exchange-bitforex-halts-withdrawals-after-56-million-leaves-wallets-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/sec-hits-exchange-fines.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/sec-hits-exchange-fines.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/sec-hits-exchange-fines.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/sec-hits-exchange-fines.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/sec-hits-exchange-fines.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/sec-hits-exchange-fines.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/sec-hits-exchange-fines.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A top Hong Kong-based crypto exchange has halted withdrawals on its platform after over $56 million was taken out of its wallets last week. According to on-chain investigator ZachXBT, BitForex engaged in some &#8220;suspicious activity&#8221; last week. &#8220;Seeing some suspicious activity with the crypto exchange BitForex. On Feb 23 their hot wallets saw outflows of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/26/hong-kong-based-crypto-exchange-bitforex-halts-withdrawals-after-56-million-leaves-wallets-report/\">Hong Kong-based Crypto Exchange BitForex Halts Withdrawals After $56 Million Leaves Wallets: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]