[
  {
    "source": "Decrypt",
    "date": "2023-05-25T22:56:37.000Z",
    "title": "No Virginia, Ron DeSantis's Campaign Didn't Alter His Video With AI",
    "url": "https://decrypt.co/142455/no-virginia-ron-desantiss-campaign-didnt-alter-his-video-with-ai",
    "description": "They used good old-fashioned digital editing tools instead"
  },
  {
    "source": "Decrypt",
    "date": "2023-05-25T22:46:39.000Z",
    "title": "Mojo Melee Puts a Casual Spin on Teamfight Tactics-Style Auto Battlers",
    "url": "https://decrypt.co/142432/mojo-melee-puts-casual-spin-teamfight-tactics-style-auto-battlers",
    "description": "PREVIEW: The NFT-infused Mojo Melee is simple in its beta state, but that makes it a good introduction to a complex genre."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-25T23:01:47.000Z",
    "title": "DCG shutters TradeBlock institutional trading platform",
    "url": "https://cryptoslate.com/dcg-shutters-tradeblock-institutional-trading-platform/",
    "description": "<p>Digital Currency Group (DCG) will close its institutional trading platform, TradeBlock, by the end of the month, Bloomberg reported May 25. Crypto market challenges DCG&#8217;s decision to close TradeBlock comes amidst a harsh crypto market. One DCG spokesperson cited various challenges, stating: &#8220;Due to the state of the broader economy and prolonged crypto winter, along [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/dcg-shutters-tradeblock-institutional-trading-platform/\">DCG shutters TradeBlock institutional trading platform</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-25T23:01:31.000Z",
    "title": "How Can the Use of Blockchain in Business Workflows Help Meet Your Campaign Targets?",
    "url": "https://www.cryptopolitan.com/use-of-blockchain-in-business-workflows/",
    "description": "Business workflows are the backbone of any functioning enterprise. These are a series of tasks that are completed in a specific sequence to achieve a business goal. From approving a leave request to processing an invoice, blockchain in business workflows is integral to the smooth functioning of an organization. They are the invisible threads that ... <a title=\"How Can the Use of Blockchain in Business Workflows Help Meet Your Campaign Targets?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/use-of-blockchain-in-business-workflows/\" aria-label=\"More on How Can the Use of Blockchain in Business Workflows Help Meet Your Campaign Targets?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-25T22:49:53.000Z",
    "title": "How to Set Your Freelance Rates as a Web3 builder?",
    "url": "https://www.cryptopolitan.com/how-to-set-freelance-rates-as-a-web3-builder/",
    "description": "The emergence of Web3 technology has revolutionized the digital landscape, paving the way for decentralized applications (DApps), blockchain solutions, and smart contracts. Web3 builders possess the skills and expertise to harness this groundbreaking technology, making you an invaluable asset to clients seeking to capitalize on the potential of the decentralized web. Understanding how to set ... <a title=\"How to Set Your Freelance Rates as a Web3 builder?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-to-set-freelance-rates-as-a-web3-builder/\" aria-label=\"More on How to Set Your Freelance Rates as a Web3 builder?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-25T22:42:28.000Z",
    "title": "How Can the Proposed NFT for Britain Project Help Solve Real-World Issues?",
    "url": "https://www.cryptopolitan.com/how-nft-for-britain-project-solve-issues/",
    "description": "In an era of rapid technological advancements, a groundbreaking concept has emerged that has the potential to revolutionize the way we perceive and address real-world issues. Enter the proposed NFT for Britain project, a trailblazing initiative poised to utilize the power of nonfungible tokens (NFTs) to manage and potentially solve some of society&#8217;s most pressing ... <a title=\"How Can the Proposed NFT for Britain Project Help Solve Real-World Issues?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-nft-for-britain-project-solve-issues/\" aria-label=\"More on How Can the Proposed NFT for Britain Project Help Solve Real-World Issues?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-25T23:00:58.000Z",
    "title": "When Is A Token Coming For Coinbase’s Base L2? Here’s What The Roadmap Says",
    "url": "https://www.newsbtc.com/altcoin/when-is-a-token-coming-for-coinbase-base-l2/",
    "description": "Crypto exchange Coinbase announced and launched the testnet for its very own Layer 2 blockchain called Base earlier in February 2023. Since the launch, there have been speculations about the exchange launching a token for the L2, which has now been clarified in the newly released roadmap for Base. Base Roadmap Mentions No Token Following the launch of Base, crypto exchange Coinbase made it known that there were no plans to actually launch a token for the Layer 2 blockchain. Nevertheless, this did not stop the speculations, but with the release of its roadmap, the team seems to have put an abrupt halt to all rumors regarding a token. Related Reading: Elon Musk Reveals Reason Behind Dogecoin Investment, But Why Is DOGE Down? The roadmap which was published on Wednesday on the Coinbase website clearly states that “Base has no plans to issue a network token.” Instead, it will continue to operate like most other Ethereum Layer 2 blockchains, using ETH as a way to carry out transactions and pay for gas fees. As the L2 moves closer toward a mainnet launch, the team is rather focusing on builders on the chain. It is also looking toward upgrading Optimism’s Bedrock, as well as all of the reviews and audits while making sure the testate remains stable. “We’ve been building towards Mainnet Genesis, the first step of delivering a decentralized platform that scales Ethereum with fast, low-cost and secure transactions. As we prepare to upgrade from testnet to mainnet, we want to build in the open and keep the community informed of our roadmap and status,” the statement said. COIN stock trading at $56 &#124; Source: COINUSD on TradingView.com Coinbase Will Face Fierce Competition In L2 Market While blockchain is still not as mainstream as industry participants would like, they are being developed rapidly. As Coinbase enters the L2 space, it is coming into fierce competition with other L2s that are already live on the mainnet. The likes of Optimism and Arbitrum have seen a reasonable level of success since their launch, which signals that Base could be just as successful. However, one thing the former have are tokens that are already trading across major exchanges. As such, they may continue to see the most interest from investors who are chasing gains from these tokens. Related Reading: Data Suggests Small Holders Will Drive Next Cardano (ADA) Rally Nevertheless, Base is still a highly anticipated L2 expected to launch in mainnet sometime in 2023. There is no reason to doubt Coinbase’s stance in not creating a token, but this could always change as Arbitrum operated for two years before launching a token. Arbitrum, Polygon, and Optimism remain the dominant L2s in the space with total value locked of $2.31 billion, $986.88 million, and $881.1 million respectively. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from Finbold, chart from TradingView.com"
  }
]