[
  {
    "source": "Cointelegraph",
    "date": "2023-08-11T08:50:00.000Z",
    "title": "California commission outlines campaign disclosure requirements for crypto",
    "url": "https://cointelegraph.com/news/california-outlines-political-crypto-disclosure-requirements",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/aff84b86-d2f2-4ee0-8ca6-e08b426a2ab5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The California Fair Political Practices Commission has released disclosure requirements for cryptocurrency contributions to political candidates and committees.</p>\n                    <p><p>The California Fair Political Practices Commission (FPPC) has <a href=\"https://www.fppc.ca.gov/about-fppc/hearings-meetings-workshops/current-agenda/past-agendas/2023-agendas/august-2023-agenda1.html\" target=\"_blank\" rel=\"noopener nofollow\">updated</a> its campaign disclosure manuals, with revisions including detailed rules for cryptocurrency contributions declarations.</p><p>An agenda released for an upcoming commission meeting includes a discussion of updated campaign disclosure <a href=\"https://www.fppc.ca.gov/content/dam/fppc/NS-Documents/AgendaDocuments/General%20Items/2023/august/4a-Campaign%20Disclosure%20Manual%201%20Aug%202023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">manuals</a>, which have been reworked to reflect recent changes to legislation and commission regulations.</p><p>These updates include campaign contribution limits, limited liability companies (LLC) disclosure requirements, behested payment reporting, cryptocurrency contributions, excessive contributions, advertising disclosure requirements, and other non-substantive technical changes.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/magazine/defi-faces-stress-test-doj-fears-run-on-binance-hong-kongs-crypto-trading-hodlers-digest-july-30-aug-5/\">Consumer Federation of California reattempts to regulate crypto companies</a></em></strong></p><p>Of specific interest are sections of the manuals that now include guidelines for reporting cryptocurrency contributions. </p><p>According to the guidelines, a politicial comittee may solicit a contribution of cryptocurrency as a nonmonetary contribution, which is subject to specific requirements. Cryptocurrency contributions are set to be subject to applicable limits and may not be accepted from foreign principals, lobbyists or anonymous sources. </p><p>Committees are also barred from receiving cryptocurrency contributions directly in peer to peer transactions. Cryptocurrency contributions can be received through payment processors that are selected to act as a vendor on behalf of the committee.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/623cd89d-33e1-49f3-9920-8bb490adc55c.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>An example outlines how a political party would disclose the amount of a cryptocurrency contribution. Source: CFPPC campaign manual.</em></figcaption></figure><p>The commission also requires cryptocurrency donations to be made and received through United States based payment processors registered with the U.S. Department of Treasury and Financial Crimes Enforcement Network which uses KYC protocols to verify identities of contributors.</p><p>Committees that<strong> </strong>opt to solicit contributions made in cryptocurrencies are expected to confirm that respective cryptocurrency payment processors use KYC procedures to verify contributors’ identities. </p><p>The payment processors also need to collect the name, address, occupation and employer of respective contributors and share this with committees within 24 hours of a cryptocurrency contribution being made.</p><p>Payment processors are also expected to immediately convert cryptocurrency contributions to U.S. dollars upon receipt at current exchange rates and deposit funds into the committee’s campaign bank account within two business days of receipt.</p><p>Cryptocurrency contributions are labeled as nonmonetary contributions under the Commission guidelines. Any processing fee paid to the processor is not deducted from the reported amount and the entire contribution is set to be reported by committees as a ‘miscellaneous increase to cash”.</p><p><em><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/defi-faces-stress-test-doj-fears-run-on-binance-hong-kongs-crypto-trading-hodlers-digest-july-30-aug-5/\">DeFi faces stress test, DoJ fears run on Binance, Hong Kong’s crypto trading: Hodler’s Digest, July 30 – Aug. 5</a></strong></em></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-11T09:08:59.000Z",
    "title": "Coinbase Collaborates with Crossmint for Simplified NFT Onboarding",
    "url": "https://cryptobriefing.com/coinbase-collaborates-with-crossmint-nft-onboarding/?utm_source=feed&utm_medium=rss",
    "description": "Coinbase partners with Crossmint's NFT infrastructure, aiming to revolutionize the onboarding process for upcoming Base drops."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-11T09:00:00.000Z",
    "title": "Aave DAO Begins Voting On Proposals To Limit CRV Exposure",
    "url": "https://cryptodaily.co.uk/2023/08/aave-dao-begins-voting-on-proposals-to-limit-crv-exposure",
    "description": "<p>The Aave community has started voting on three crucial proposals that could help significantly reduce the protocol&rsquo;s exposure to Curve Finance&rsquo;s CRV token.&nbsp;</p>\n<p>Two out of the three proposals in question opened for voting on the 10th of August.&nbsp;</p>\nDetails Of The Proposals\n<p>The move by the Aave community comes as it attempts to limit the risk posed to the protocol by the large borrowing position held by Michael Egorov, the founder of Curve Finance. On-chain risk management platform Chaos Lab put forward the proposals. According to the platform, volatility in Curve markets had considerably increased after the recent exploit suffered by Curve.&nbsp;</p>\n<p>The CRV token is the native token of the decentralized finance (DeFi) protocol Curve Finance. Curve founder Egorov had used as much as 30% of CRV&rsquo;s total market capitalization to take out nearly $60 million in loans on Aave. However, the Curve Finance hack significantly impacted the price of CRV, sending it plummeting. This made Egorov&rsquo;s position vulnerable, potentially exposing Aave to a liquidation risk.&nbsp;</p>\n<p>The voting on the proposals is set to continue until the 12th of August. The first proposal seeks to reduce the liquidation threshold by 6% for CRV on Aave v2. This could lead to user accounts becoming subject to liquidation upon approval. The second proposal disables borrowing of CRV tokens on Polygon v3 and Ethereum. This would make it impossible to short CRV through the Aave protocol.&nbsp;</p>\n<p>The two proposals to limit Aave&rsquo;s exposure have found overwhelming support in the community. So far, over 571,000 votes have been cast, with 100% of the votes in favor of limiting Aave&rsquo;s exposure to CRV.&nbsp;</p>\nThe Third Proposal&nbsp;\n<p>With fears surrounding Egorov&rsquo;s loans, Aave&rsquo;s community is also voting on a third proposal, voting for which ends on the 11th of August. The proposal, put forward by Aave Chan founder Marc Zeller, calls on the Aave treasury to purchase $2 million worth of CRV tokens from Curve Finance. Zeller&rsquo;s reasoning for such a move is that it would signal that major DeFi players support Curve and the health of the larger DeFi ecosystem. However, this proposal has not gained as much support in the community, although a majority do support it. Currently, around 62% of votes favor the proposal, while 37% have voted against it.&nbsp;</p>\nThe Curve Finance Exploit&nbsp;\n<p>Curve Finance suffered a major exploit at the beginning of the month, with hackers managing to siphon off millions worth of crypto. As a result of the hack, the protocol&rsquo;s CRV token saw a significant price drop, casting a long shadow on the DeFi ecosystem. The decline in CRV&rsquo;s value also put a $168 million lending position taken by Curve founder Michael Egorov at risk. If this position was liquidated, it could have disastrous consequences for the larger DeFi ecosystem, putting major protocols at risk. Following the exploit, crypto exchanges moved to suspend withdrawals, with Upbit among the first to act, suspending deposits and withdrawals of the CRV token.&nbsp;</p>\n\n<p>&ldquo;Today, certain vulnerabilities have been discovered in some of the stablecoin pools associated with Curve (CRV). As a result, CRV is currently experiencing significant volatility. We advise exercising caution when considering any investments related to CRV. To ensure the safety of digital asset transactions, we have temporarily suspended deposits and withdrawals for CRV.&rdquo;</p>\n\n<p>However, Curve and Egorov found support from prominent players in the crypto space. These include Power DeFi user DCF God, Jeffrey Huang, and Tron Foundation CEO Justin Sun. All have since stepped in and purchased CRV from Egorov, resulting in the principal value of Egorov&rsquo;s loans dropping to $54 million. Justin Sun posted a message in support of Curve, stating,&nbsp;</p>\n\n<p>&ldquo;Excited to assist Curve! As steadfast partners, we remain committed to providing support whenever needed. Our joint efforts will introduce an @stusdt pool on Curve, amplifying user benefits. Together, we aim to empower the community and forge a decentralized finance!&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T08:56:01.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T08:48:40.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 How much is LTC worth? The current price of Litecoin stands at $83.1. Over the past 24 hours, it has experienced a trading volume of $1.72B and a market capitalization of $6.71B. Litecoin’s market dominance is at 0.55%. However, there has been a decrease in the LTC price by 0.07% within ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T08:47:39.000Z",
    "title": "Binance delists ADA and MATIC perpetual contracts amid regulatory shifts",
    "url": "https://www.cryptopolitan.com/binance-delists-ada-and-matic-perpetual-contracts-amid-regulatory-shifts/",
    "description": "Binance, the world&#8217;s largest cryptocurrency market, has decided to delist perpetual contracts for Cardano (ADA) and Polygon (MATIC). The exchange&#8217;s decision stems from its intention to cease providing USDS-M perpetual contracts for ADABUSD and MATICBUSD, according to an official statement released on August 10. This decision follows an automated settlement scheduled for today, after which ... <a title=\"Binance delists ADA and MATIC perpetual contracts amid regulatory shifts\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-delists-ada-and-matic-perpetual-contracts-amid-regulatory-shifts/\" aria-label=\"More on Binance delists ADA and MATIC perpetual contracts amid regulatory shifts\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-11T08:40:36.000Z",
    "title": "As Worldcoin stirs controversy, DigiToads is growing investor base",
    "url": "https://crypto.news/as-worldcoin-stirs-controversy-digitoads-is-growing-investor-base/",
    "description": "Worldcoin is being scrutinized by regulators across the globe while DigiToads continues to build its investor base. TOADS presale is in progress"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-11T08:40:12.000Z",
    "title": "Canadians Unfazed by CBDC: Millions Opt for Privacy Coins Monero, Dash, and ZCash Over Central Bank Digital Currency",
    "url": "https://www.crypto-news-flash.com/canadians-unfazed-by-cbdc-millions-opt-for-privacy-coins-monero-dash-and-zcash-over-central-bank-digital-currency/?utm_source=rss&utm_medium=rss&utm_campaign=canadians-unfazed-by-cbdc-millions-opt-for-privacy-coins-monero-dash-and-zcash-over-central-bank-digital-currency",
    "description": "<img width=\"1280\" height=\"850\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/09/canada-159585_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/09/canada-159585_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2021/09/canada-159585_1280-300x199.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/09/canada-159585_1280-1024x680.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/09/canada-159585_1280-768x510.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/09/canada-159585_1280-104x69.png 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/09/canada-159585_1280-24x16.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/09/canada-159585_1280-36x24.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/09/canada-159585_1280-48x32.png 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Most Canadians find limited incentive to adopt a Central Bank Digital Currency (CBDC) due to readily available financial services. Despite discussions around CBDCs, the relevance and importance of physical cash remain vital, especially for offline transactions. Recent findings from the Bank of Canada, corroborated by reports from Cointelegraph, shed light on the reluctance of Canadians [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-11T08:57:39.000Z",
    "title": "Thorchain Reinvents DeFi Lending",
    "url": "https://www.altcoinbuzz.io/product-release/thorchain-reinvents-defi-lending/",
    "description": "<p>Crypto lending stands out as a highly prosperous and extensively utilized DeFi offering, with numerous crypto exchanges and platforms providing borrowing and lending services. THORChain, the decentralized cross-chain liquidity protocol, has introduced a groundbreaking Lending design featuring zero expiry, zero liquidity, and zero interest. As recent events witnessed the collapse of prominent players like Voyager [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/product-release/thorchain-reinvents-defi-lending/\">Thorchain Reinvents DeFi Lending</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-11T08:52:00.000Z",
    "title": "Cardano’s Mithril Update Sparks $100 Price Target Predictions",
    "url": "https://coinedition.com/cardanos-mithril-update-sparks-100-price-target-predictions/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction.png 730w, https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/Mithril_Upgrade_The_Key_to_ADA_Price_Success_ADA_price_prediction-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cardano (ADA) announced that its highly-anticipated Mithril upgrade went live over the past 2 weeks. Shortly after the announcement, many investors and traders started speculating that the upgrade could drive ADA’s price up. The Mithril upgrade, which was introduced on 30 July 2023, represents a noteworthy achievement for ADA&#8217;s Proof-of-Stake blockchain. Its primary goal is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/cardanos-mithril-update-sparks-100-price-target-predictions/\">Cardano’s Mithril Update Sparks $100 Price Target Predictions</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]