[
  {
    "source": "CoinDesk",
    "date": "2023-06-07T14:57:06.000Z",
    "title": "U.S. SEC Enforcement Could Boost Europe's Crypto Chances, Officials Say",
    "url": "https://www.coindesk.com/policy/2023/06/07/us-sec-enforcement-could-boost-europes-crypto-chances-officials-say/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "EU officials are hoping to tempt crypto innovators as Binance and Coinbase complain of regulation by enforcement in the U.S."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-07T15:00:00.000Z",
    "title": "Binance and CZ sued by the SEC",
    "url": "https://cointelegraph.com/news/binance-and-cz-sued-by-the-sec",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/1ce51145-271a-4bf7-a0f3-6ac547eb5405.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>On this week’s episode of The Market Report, Cointelegraph’s resident expert discusses the details of the SEC’s lawsuit against crypto exchange Binance and its CEO, Changpeng Zhao.</p>\n                    <p><p>In the latest episode of The Market Report, analyst and writer Marcel Pechman discusses the impact of the <a href=\"https://cointelegraph.com/news/sec-s-binance-suit-contains-heady-mix-of-predictable-charges-novel-revelations\">United States Securities and Exchange Commission lawsuit against the Binance exchange</a>.</p><p>Most likely, the U.S. population will be barred from using the international version of Binance, and those who opt for VPN services will be at risk of being prosecuted. Pechman believes Changpeng “CZ” Zhao and Binance will lose or strike a deal pleading guilty, pay a fine, and be forced to halt services for North American entities — including Paxos and the Binance USD (<a href=\"https://cointelegraph.com/binance-usd-busd-price-index\">BUSD</a>) stablecoin.</p><p>Considering Binance is the absolute leader in spot and derivatives trading, one might call the 5% price correction on April 5 a “vote of confidence,” meaning traders believe Binance international will remain fully operational. Worst-case scenario? A hefty fine, but operations will not be impacted, and every client will be made whole, similar to the BitMEX outcome.</p><p>As for the <a href=\"https://cointelegraph.com/news/sec-labels-61-cryptocurrencies-securities-after-binance-suit\">10 tokens that the SEC claims to be securities</a>, North Americans will not be blocked from buying or holding those altcoins, but it adds an extra step if they’re willing to trade them — for example, using a decentralized exchange.</p><p>Pechman believes the <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">Coinbase lawsuit</a> differs from Binance’s, as the U.S.-listed company has a huge base of North American clients and can’t move its operations abroad without a significant reduction in its user base and volumes. Moreover, Binance has other issues involved, such as the money transfers between related entities and the potential illicit use of client funds. </p><p>So, the first read for Coinbase shows a much lighter case, very unlikely to become something more eventful, while Binance and CZ’s odds of facing the Department of Justice and criminal charges are way higher. </p><p>Pechman highlights that if the U.S. Federal Reserve continues printing trillions of dollars to sustain the economy, investors will scramble to find scarce assets, so a crypto bull run will happen whether or not Coinbase and Binance are taking part in the process.</p><p>Lastly, the show discusses whether the Bitcoin price will retest the $24,000 level, considering the long/short ratio hit levels unseen in over 12 months. The show airs every Tuesday on the Cointelegraph Markets &amp; Research YouTube channel.</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-07T14:40:48.000Z",
    "title": "What asset freeze? Binance BTC outflows muted as users shun panic selling",
    "url": "https://cointelegraph.com/news/what-asset-freeze-binance-btc-outflows-muted-as-users-shun-panic-selling",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/f088cae8-8567-4bd6-83d0-d09ab3a4177b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Exchange Bitcoin holdings, unlike Ethereum, appear stable in light of the Binance and Coinbase lawsuit news.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) hitting three-month lows did not spur hodlers to panic sell, on-chain data shows.</p><p>According to analytics firm <a href=\"https://twitter.com/glassnode/status/1666392491145265154\" target=\"_blank\" rel=\"noopener nofollow\">Glassnode</a>, BTC investors have largely ignored the latest crypto exchange legal battles.</p><h2>On-chain losses \"remain quiet\"</h2><p>BTC/USD <a href=\"https://cointelegraph.com/news/bitcoin-price-bounces-past-26k-coinbase-news-fails-shake-bulls\">dipped to just $25,350</a> on June 6, its lowest since mid-March — but it seems existing holders simply do not care.</p><p>The latest data covering on-chain transactions shows that in the midst of <a href=\"https://cointelegraph.com/news/sec-lawsuit-binance-coinbase-crypto-industry-comments\">reactions</a> to the Binance and Coinbase lawsuits, few were in “panic sell” mode.</p><p>A chart uploaded to Twitter by Glassnode showed realized losses — coins moving at a lower value to their previous transaction — staying cool.</p><p>This marked a shift in sentiment for the investor base as a whole, coming in stark contrast to the events which followed the <a href=\"https://cointelegraph.com/news/realized-losses-from-ftx-collapse-peaked-at-9b-far-below-earlier-crises\">implosion of exchange FTX</a> in late 2022.</p><p>“Following a crescendo in US regulatory pressure on major cryptocurrency Exchanges Binance and Coinbase, the market experienced significantly volatile moves in both directions,” Coinglass reported.</p><blockquote>“However, the magnitude of Realized Losses recorded On-Chain remains quiet at $112M. This remains -$3.05B (-96.5%) smaller than the largest recorded capitulation event, suggesting an increased degree of resilience amongst market participants.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e6530c0e-f176-4ea1-9d72-c0da445d9252.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Entity-Adjusted Realized Loss annotated chart. Source: Glassnode/Twitter</em></figcaption></figure><p>For context, the FTX event sparked $145 billion in realized losses — over ten times the June 5 tally.</p><h2>Exchange BTC traders not rushing for the exit</h2><p>The latest data available which covers exchange balances tells a similar story of resilience.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/binance-net-outflows-on-ethereum-blockchain-after-sec-lawsui-nansen\">Binance net outflows hit $778M on Ethereum since SEC charges: Nansen</a></em></strong></p><p>As per Glassnode’s <a href=\"https://studio.glassnode.com/metrics?a=BTC&amp;category=&amp;m=distribution.BalanceExchanges&amp;s=1666089257&amp;u=1686009600&amp;zoom=\" target=\"_blank\" rel=\"noopener nofollow\">tracking tools</a>, major exchanges saw only a modest decrease in BTC balances on June 5-6.</p><p>This totaled around 12,600 BTC, potentially indicating a similar lack of desire among users to remove their funds from hot wallets.</p><p>Compared to FTX, the situation once again stands out, as mass exchange withdrawals characterized much of last November.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/ff3e1ca7-1537-4573-bf47-dbc0b40c950f.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Exchange Balance chart. Source: Glassnode</em></figcaption></figure><p>Continuing, statistician Willy Woo noted that the lack of action at Binance came despite its United States regulators petitioning to <a href=\"https://cointelegraph.com/news/binance-us-user-funds-safe-amid-sec-injunction-freeze-assets\">freeze its domestic assets</a>.</p><p>“Binance customers don't care. Not seeing much BTC leaving, not yet at least,” part of Twitter commentary <a href=\"https://twitter.com/woonomic/status/1666294356406587393\" target=\"_blank\" rel=\"noopener nofollow\">stated</a>.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">SEC motions to freeze assets on Binance exchange.<br><br>Binance customers don&#39;t care. Not seeing much BTC leaving, not yet at least. <a href=\"https://t.co/1zOxfV8vL3\">pic.twitter.com/1zOxfV8vL3</a></p>&mdash; Willy Woo (@woonomic) <a href=\"https://twitter.com/woonomic/status/1666294356406587393?ref_src=twsrc%5Etfw\">June 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-07T15:08:01.000Z",
    "title": "Sora Ventures leads $1.5M funding round for Bitcoin Startup Lab",
    "url": "https://cryptoslate.com/sora-ventures-leads-1-5m-funding-round-for-bitcoin-startup-lab/",
    "description": "<p>San Francisco-based BTC pre-accelerator firm Bitcoin Startup Lab has raised $1.5 million in a strategic funding round led by Sora Ventures. This puts the firm&#8217;s valuation at $20 million. Bitcoin Startup Lab Bitcoin Startup Lab aims to advance Web3 development on the Bitcoin network by supporting entrepreneurs in building their projects. Through its startup boot [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sora-ventures-leads-1-5m-funding-round-for-bitcoin-startup-lab/\">Sora Ventures leads $1.5M funding round for Bitcoin Startup Lab</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-07T14:45:00.000Z",
    "title": "Missed out on Dogecoin? Shift your focus to InQubeta the new 30x AI Crypto Token",
    "url": "https://cryptodaily.co.uk/2023/06/missed-out-on-dogecoin-shift-your-focus-to-inqubeta-the-new-30x-ai-crypto-token",
    "description": "<p class=\"s3\">Lately, the crypto market has been on a topsy-turvy ride, but that hasn&rsquo;t deterred investors from seeking the next big opportunity. Dogecoin (DOGE), a cryptocurrency that gained popularity through its meme-inspired branding, saw significant growth in the previous bull run. However, with the market evolving and new prospects emerging, investors are now turning their attention to promising projects like InQubeta (QUBE). This article explores whether it's too late to buy Dogecoin and why investors are shifting their focus to InQubeta's presale as interest in AI coins continues to surge.</p>\nThe Dogecoin Phenomenon\n<p class=\"s3\">Dogecoin made headlines as a playful cryptocurrency that gained a cult-like following, largely driven by social media and celebrity endorsements. Its low transaction fees and fast transaction times attracted a considerable user base, pushing its price to unprecedented levels. However, as the market matures and investors seek more sustainable and long-term opportunities, the question arises: Is it too late to buy Dogecoin?</p>\nThe Rise of InQubeta\n<p class=\"s3\">InQubeta (QUBE) has been steadily gaining attention in the cryptocurrency community due to its unique value proposition and focus on the AI industry. The platform offers fractional investment in AI start-ups using blockchain technology, enabling investors to participate in the growth of this burgeoning sector. As interest in AI technology continues to rise, InQubeta's presale has garnered significant attention from investors looking for the next game-changing project.</p>\n<p class=\"s3\">There are several reasons why investors are shifting their focus from Dogecoin to InQubeta. First and foremost, Dogecoin's meteoric rise has led to concerns about its sustainability and long-term viability. The initial hype and speculative trading have created a volatile market, making it riskier for investors seeking stability and long-term growth.</p>\n<p class=\"s3\">On the other hand, InQubeta presents a compelling opportunity for investors interested in the AI industry. AI is a rapidly evolving field with immense potential, and InQubeta's platform provides a means to access this market through fractional investment model. This not only lowers the barrier to entry but also incentivizes users who invest in the native asset, $QUBE.</p>\n<p>Visit InQubeta Presale</p>\nInQubeta's Presale and Growing Interest\n<p class=\"s3\">Ever since the inception of the presale phase, InQubeta project has raised over $300k, which has now been further fueled by a comprehensive audit. The platform's unique approach to AI investment, coupled with a strong community and positive market sentiment, has contributed to its growing popularity. As more investors recognize the potential of AI technology and the opportunities presented by InQubeta's platform, QUBE might well climb the ladder quicker than anyone can anticipate. The presale price will keep on increasing at every stage, so this may be a good time to invest.</p>\nConclusion\n<p class=\"s3\">While Dogecoin has captured the attention of the crypto world with its viral popularity, investors are now shifting their focus to more promising and sustainable opportunities. InQubeta's presale has emerged as an attractive option, offering fractional investment in AI start-ups and capitalizing on the growing interest in AI coins. As the market continues to evolve, investors are seeking projects with strong fundamentals and long-term growth potential. As such, InQubetapresents an enticing opportunity for those looking to capitalize on the AI revolution and navigate the evolving crypto landscape.</p>\n<p>Visit InQubeta Presale</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n\n<p class=\"s5\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-07T14:45:00.000Z",
    "title": "XRP and Solana are two bluechips showing bullish price movement, can Tradecurve challenge them?",
    "url": "https://cryptodaily.co.uk/2023/06/xrp-and-solana-are-two-bluechips-showing-bullish-price-movement-can-tradecurve-challenge-them",
    "description": "<p>Despite the recent lawsuit against Binance that accuses them of selling unregistered securities, XRP remains unnamed, and pro-crypto lawyers are still anticipating a win in the SEC vs Ripple.&nbsp; Solana&rsquo;s charts show bullish potential, although SOL is one of the coins that may be affected by the SEC.&nbsp; Tradecurve, currently in presale, recognises the growing problems of regulation in the US and offers a solution for traders around the world.</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\nRipple lawyers remain confident of a win\n<p>The crypto market reels from the latest Binance lawsuit from the SEC, that could see coins such as SOL, ADA, FIL, ATOM, SAND, MANA, ALGO, AXS, and COTI as securities. However Ripple is notably absent from the lawsuit, adding strength to Ripple lawyer John Deaton&rsquo;s argument that XRP will not be declared a security.</p>\n<p>Deaton now anticipates that the case will come to a close around the end of September.&nbsp; He expects either an outright win, or the potential that a cut off line will be drawn that allows Ripple to officially not be a security.</p>\n<p>He also predicted a potential price for the XRP token assuming that the outcome is favorable, saying that &ldquo;I certainly believe that somewhere between $2 and $10 is reasonable&rdquo;.</p>\n<p>&nbsp;</p>\n<p></p>\nSolana is named in the SEC vs Binance lawsuit.\n<p>Although Solana has been demonstrating bullish potential from a technical analysis point of view, the recent Binance lawsuit names Solana&rsquo;s coin SOL in the lawsuit, as an unregistered security.&nbsp; This isn&rsquo;t the first lawsuit that Binance have faced, and similarly to the XRP vs Ripple case, the judgment could go either way.</p>\n<p>Still it&rsquo;s not great news for the layer 1 chain, and Solana&rsquo;s price has fallen by 7% over the last 24 hours, currently trading at around $20 per coin.</p>\n<p>Solana and the other tokens and coins named in the lawsuit, may take comfort in the words of John Deaton, who believes that it may be possible for future redemption even if they do get named as securities. This is because once cryptocurrencies like Solana achieve a significant level of decentralization, there is a possibility that they could transition from being classified as securities to being recognized as commodities.</p>\n<p></p>\nIs Tradecurve the answer to regulatory woes?\n<p>As the US continues to pursue aggressive anti crypto regulations, in what Nic Carter sees as a concerted effort to de-platform crypto from the banking system, the need for regulation free platforms increases.&nbsp; This could be where Tradecurve gets its chance to shine, offering a borderless and KYC trading platform that combines the financial products of TradFi, including commodities, stocks and bonds, and of course, crypto.</p>\n<p>Tradecurve are based in St Vincent and Kitts where offering these products are legal.&nbsp; Tradecurve follows Binance and other exchanges such as Gemini, who are increasingly looking to move their operations outside of the US.</p>\n<p>Tradecurve&rsquo;s token is TCRV, and is currently in stage 3 of presale.&nbsp; TCRV is changing hands at $0.015 and will launch at a minimum price of $0.088.&nbsp; Experts are predicting a rise as big as 1000x once it is listed on Uniswap and tier 1 CEXes.</p>\nLearn more about TCRV and the future of the project here:\n<p>Click Here For Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-07T14:45:00.000Z",
    "title": "As investors seek alternatives to Hedera, BNB and XRP. InQubeta (QUBE) proves to be a promising option.",
    "url": "https://cryptodaily.co.uk/2023/06/as-investors-seek-alternatives-to-hedera-bnb-and-xrp-inqubeta-qube-proves-to-be-a-promising-option",
    "description": "<p class=\"s5\">Investing in cryptocurrency is one of the most rewarding ventures. The volatility of the crypto market makes it easy for cryptos to multiply or decline rapidly. With recent market issues surrounding some of the best cryptos, investors are actively searching for promising cryptos to boost their portfolios.</p>\n<p class=\"s5\">InQubeta (QUBE) is the new kid on the block. The emerging token is one of the best investment options on the market. After attracting numerous enthusiasts, the coin has raised over $295k in presale. This presale success sets QUBE apart as a must-have token for any investor.</p>\n<p class=\"s5\">InQubeta has solidified its position as the best cryptocurrency to invest in, alongside Hedera (HBAR), Binance Coin (BNB), and Ripple (XRP). As investors seek alternative investment options, these four tokens have the most promising and unique features.</p>\n<p class=\"s5\">This article will examine why InQubeta, Hedera, Binance Coin, and Ripple are the best options for great returns.</p>\nInQubeta (QUBE) is a unique decentralized crowdfunding platform for AI startups.\n<p class=\"s5\">InQubeta is a rising cryptocurrency taking the lead among other AI cryptos. The project provides an innovative platform that offers funding solutions for the budding artificial intelligence market. The token has shown massive growth potential after raising over $295,000 in the first week of the presale run. </p>\n<p class=\"s5\">The InQubeta platform offers equity-based NFTs for investors looking to ride on the wave of AI. InQubeta's NFT marketplace enables AI startups to create and develop their NFTs as a fraction of their project. As a beginner cryptocurrency leveraging AI and the decentralized finance market, InQubeta has massive growth potential. </p>\n<p class=\"s5\">The QUBE token is the best cryptocurrency to invest in because of its remarkable growth rate. The unique ERC20 token is set to rise by over 400% before its presale concludes. The token has sold over 70% in the \"Beta Stage\" and is projected to do more in the coming weeks. </p>\n<p class=\"s5\">The demand for the QUBE token is about to skyrocket as the crypto market prepares for the next bull season. Investors can benefit from possible price increases and earn rewards from the dedicated reward pool by holding and staking QUBE tokens.</p>\n<p class=\"s13\">Visit InQubeta Presale</p>\nHedera (HBAR) is a secure cryptocurrency for decentralized applications (dApps).\n<p class=\"s5\">Hedera is a decentralized network that provides a sustainable and more efficient open-source network for dApps. The platform uses a cutting-edge solution that eliminates older blockchain networks' limitations. Hedera uses a consensus mechanism that facilitates communication among dApps.</p>\n<p class=\"s5\">HBAR became popular in the last bull run after a new all-time high. The coin's value has sharply declined since the beginning of the year. The HBAR token is, however, projected to bounce back in the next bull market.</p>\nBinance Coin (BNB) shows new bearish signals.\n<p class=\"s5\">Binance Coin is the native token of the Binance network. The token has grown massively over the years due to the growing popularity of its host network. Binance Coin enables users to invest in dApps on Binance. Binance Coin has received great patronage, and the token is one of the best cryptos to invest in. </p>\n<p class=\"s5\">The BNB token has spiraled downward, plunging below 7% in the last two weeks. Analysts believe that the negative pressure in the market causes this bearish stance. BNB might be struggling, but it is a worthy investment option.</p>\nRipple (XRP) is positioned for massive price gains.\n<p class=\"s5\">Ripple is getting media attention because of its move to expand the company using cash inflows. The platform announced that it had acquired stakes in Bitsmap, one of the oldest exchange platforms. Ripple could have significant gains because of this move.</p>\n<p class=\"s5\">The XRP ledger recorded more than 1.32 million daily transactions in the first quarter of 2023. This token has promising growth potential. XRP is a good crypto with long-term returns.</p>\nConclusion\n<p class=\"s5\">As investors seek alternatives to boost their portfolios, InQubeta proves to be the most promising investment option. The beginner cryptocurrency is snowballing, and investors are enjoying its popularity. Furthermore, InQubeta's growing community is bringing together like-minded people interested in AI startups. This will allow users to share ideas, thoughts, and lessons about the crypto and AI markets. As a result of this, the InQubeta platform will gain more ground.</p>\n<p class=\"s13\">Visit InQubeta Presale</p>\n<p class=\"s5\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T15:00:33.000Z",
    "title": "Jack Dorsey sparks controversy by labeling Ethereum as security amidst regulatory tensions",
    "url": "https://www.cryptopolitan.com/jack-dorsey-sparks-controvery-for-calling-ethereum-security/",
    "description": "Former Twitter CEO and Bitcoin advocate Jack Dorsey found himself embroiled in a Twitter battle with prominent figures in the crypto industry after labeling Ethereum (ETH) as a security. The controversy unfolded when Dorsey responded with a simple &#8220;yes&#8221; to a question about Ethereum&#8217;s security status. The remark drew the attention of Udi Wertheimer, a ... <a title=\"Jack Dorsey sparks controversy by labeling Ethereum as security amidst regulatory tensions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/jack-dorsey-sparks-controvery-for-calling-ethereum-security/\" aria-label=\"More on Jack Dorsey sparks controversy by labeling Ethereum as security amidst regulatory tensions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T14:40:08.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-07T15:00:30.000Z",
    "title": "Top Defi Whale Explains How Cardano and Avorak AI Could 25x This Year",
    "url": "https://nulltx.com/top-defi-whale-explains-how-cardano-and-avorak-ai-could-25x-this-year/",
    "description": "In the world of decentralized finance (DeFi), there are always intriguing investment opportunities that catch the attention of seasoned investors. Cardano, a leading blockchain platform, and Avorak AI, a promising AI crypto project, have recently been highlighted by a top DeFi whale as candidates for significant growth. What is Cardano? Cardano is a decentralized blockchain [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T14:53:42.000Z",
    "title": "Bitget creates AI-powered crypto trading tool",
    "url": "https://crypto.news/bitget-creates-ai-powered-crypto-trading-tool/",
    "description": "Bitget, a crypto derivatives and copy trading platform, introduced its Martingale AI trading bot, which uses artificial intelligence (AI) to help clients trade cryptos. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-07T15:00:48.000Z",
    "title": "SEC Files Emergency Action Application To Freeze Binance.US Assets",
    "url": "https://www.newsbtc.com/binance/sec-files-emergency-action-application-to-freeze-binance-us-assets/",
    "description": "The SEC just dropped a bombshell on Binance.US, the American arm of the world’s largest cryptocurrency exchange. The regulator filed an emergency action application against Binance.US to freeze its assets, as part of the regulator&#8217;s recent crackdown on the crypto exchange. Protecting Customer Funds On Binance According to the documents filed with the court, the request was brought forward with the intention of ensuring that the assets of Binance.US clients are safeguarded and kept in the United States. At least pending the outcome of the ongoing litigation being conducted by the SEC.  Related Reading: Now That Optimism ‘Bedrock’ Hard Fork Is Done, What Can We Expect? The filing is also looking to activate other emergency relief against Binance Holdings Limited, the arm of the exchange operating globally, and its founder, Changpeng Zhao. This is coming after news broke out on Monday, June 5, that SEC brought 13 charges on Binance.US and its billionaire founder, Changpeng Zhao, saying the company broke US rules by offering securities in the form of cryptocurrencies.  According to the charges, the exchange had &#8220;no oversight or controls to ensure that the assets are properly secured.”  What Does This Mean For The Industry? Basically, the SEC is arguing Binance.US has been illegally facilitating the trading of securities. As the biggest exchange in the world, this has got many investors feeling a bit rattled and confused about what it all means. However, Binance is not the only target of the SEC. The commission also went after Coinbase, alleging that popular cryptocurrencies offered by the exchange qualify as securities. A big part of the crypto community seems to be unified on the matter, as many investors see this as an attack on the entire crypto industry. Of course, Binance.US and Coinbase deny all allegations, with Coinbase CEO Brian Armstrong tweeting that the &#8220;SEC has taken a regulation by enforcement approach that is harming America.&#8221; BNB price continues to trend low as SEC goes after Binance &#124; Source: BNBUSD on TradingView.com Stay SAFU Binance seems to be calm on the matter as in response, the exchange released a statement saying &#8220;we intend to defend our platform vigorously,&#8221; although it &#8220;will continue to cooperate with regulators and policymakers in the U.S. and across the globe.&#8221;  Changpeng Zhao also took to Twitter to announce that if the order is granted, it would only affect funds under Binance.US, and not the global Binance.com. Related Reading: Chainlink Bulls Must Uphold This Critical Support Line For Potential 8% Rally Things also seem to be level headed, as faith in crypto platforms remains strong. However, tweet alerts from Whale Alert on Twitter shows that crypto whales have moved over $60 million worth of MATIC off Binance.US to unknown wallets in two transactions after news broke out regarding the SEC’s motion to freeze the exchange’s assets. Featured image from, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T15:00:22.000Z",
    "title": "Shiba inu price prediction 2030, Tradecurve set to overtake Huobi",
    "url": "https://www.crypto-news-flash.com/shiba-inu-price-prediction-2030-tradecurve-set-to-overtake-huobi/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-price-prediction-2030-tradecurve-set-to-overtake-huobi",
    "description": "<p>Crypto markets have entered a lull period concerning price, but looking at adoption metrics paints a different picture. Digital identity has been earmarked as one of the greatest applications of blockchain technology in the next decade as the rise of AI makes the need to identify people from machines more pressing.  Investors continue to remove [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/shiba-inu-price-prediction-2030-tradecurve-set-to-overtake-huobi/\">Shiba inu price prediction 2030, Tradecurve set to overtake Huobi</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T14:45:22.000Z",
    "title": "SEC Dismissing XRP as Security and Removing Hinman from Official Website – Is This the Final Victory for Ripple? Report",
    "url": "https://www.crypto-news-flash.com/sec-dismissing-xrp-as-security-and-removing-hinman-from-official-website-is-this-the-final-victory-for-ripple-report/?utm_source=rss&utm_medium=rss&utm_campaign=sec-dismissing-xrp-as-security-and-removing-hinman-from-official-website-is-this-the-final-victory-for-ripple-report",
    "description": "<p>The SEC has taken down a substantial portion of William Hinman&#8217;s biography from its website. It is important to highlight that Hinman&#8217;s emails have become crucial to the SEC vs. Ripple lawsuit. The SEC has taken down a substantial portion of William Hinman&#8217;s biography from its website, just as there are merely eight days remaining [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/sec-dismissing-xrp-as-security-and-removing-hinman-from-official-website-is-this-the-final-victory-for-ripple-report/\">SEC Dismissing XRP as Security and Removing Hinman from Official Website &#8211; Is This the Final Victory for Ripple? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T14:43:05.000Z",
    "title": "Experts Predict the Future of Shiba Inu, Doge, and HedgeUp (HDUP): Bullish or Bearish?",
    "url": "https://www.crypto-news-flash.com/experts-predict-the-future-of-shiba-inu-doge-and-hedgeup-hdup-bullish-or-bearish/?utm_source=rss&utm_medium=rss&utm_campaign=experts-predict-the-future-of-shiba-inu-doge-and-hedgeup-hdup-bullish-or-bearish",
    "description": "<p>Shiba Inu (SHIB) and Dogecoin (DOGE) holders know that they are at risk of plummeting prices at any given time. With the emergence of HedgeUp (HDUP), a new NFT protocol in the DeFi space, whales are now flocking towards this project as a way to secure their wealth.  HedgeUp (HDUP) offers users fractional ownership of [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/experts-predict-the-future-of-shiba-inu-doge-and-hedgeup-hdup-bullish-or-bearish/\">Experts Predict the Future of Shiba Inu, Doge, and HedgeUp (HDUP): Bullish or Bearish?</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]