[
  {
    "source": "CoinDesk",
    "date": "2023-12-13T22:52:03.000Z",
    "title": "Bitcoin Bounces Over $43K, Altcoins, Crypto Stocks Burst Higher as Fed Projects Rate Cuts Next Year",
    "url": "https://www.coindesk.com/markets/2023/12/13/bitcoin-bounces-over-43k-altcoins-crypto-stocks-burst-higher-as-fed-projects-rate-cuts-next-year/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "tktk"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-13T22:49:20.000Z",
    "title": "Argentina devalues peso by 50%, crypto offers a way out",
    "url": "https://cryptobriefing.com/argentina-devalues-peso-by-50-crypto-offers-a-way-out/?utm_source=feed&utm_medium=rss",
    "description": "Argentina's President Javier Milei announces a drastic 50% devaluation of the peso amidst economic challenges."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T23:04:47.000Z",
    "title": "Coinbase takes global center stage with Spot Trading far beyond America",
    "url": "https://www.cryptopolitan.com/coinbase-expands-spot-trading-beyond-usa/",
    "description": "Coinbase Global Inc. is expanding its services by adding spot crypto trading on its foreign exchange as part of a global expansion strategy to appeal to users who are skeptical of U.S.-based platforms. Institutional investors can now trade Bitcoin and Ether against the USDC stablecoin on Coinbase&#8217;s global platform. This move is part of the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T22:51:25.000Z",
    "title": "Yearn Finance encounters multisig script error, treasury hit with $1.4 million loss",
    "url": "https://www.cryptopolitan.com/yearn-finance-multisig-error-loss/",
    "description": "Yearn Finance, a prominent player in the yield-farming sector, recently reported a critical error in its multi-signature (multisig) script. This error led to an unintended transfer and subsequent swap of a substantial portion of its treasury, resulting in a loss estimated at $1.4 million. This incident was disclosed in a post on GitHub. During what [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-13T23:00:54.000Z",
    "title": "Avalanche Open Interest Just Smashed A New ATH, Can AVAX Reclaim $100?",
    "url": "https://www.newsbtc.com/analysis/avax/avalanche-open-interest-avax-100/",
    "description": "Avalanche has seen its native token AVAX rise rapidly over the last 30 days to make its way into the top 10 tokens by market cap. This rally was not exactly out of the blue as activity had begun to pick up once more on the Avalanche network. During this time, the open interest has risen rapidly as well, eventually touching a new all-time high. Avalanche Open Interest Rises To $413 Million On Tuesday, the Avalanche open interest rose to the highest level since its launch following AVAX’s surge to $40. The open interest reached $413 million on December 12 after continuously rising for over a month. The surge happened in tandem with the price surge and has made daily highs almost every day in December. Related Reading: Here’s How Much You Would Have If You Bought Bitcoin When Jim Cramer Said Sell The surge began in October after trailing around $70 million for the better part of a month. However, in November, there was a noticeable change in the open interest as traders began to take their positions in the digital asset. Source: Coinglass Between November and December, the AVAX open interest has risen by over 400%. On Tuesday alone, the open interest grew another 19%, bringing the total Avalanche open interest across all exchanges to 11.43 million AVAX. 73% of the total open interest is actually coming from only two exchanges; Binance and ByBit. According to data from Coinglass, Binance accounts for 44% of the total OI at $184 million (4.54 million AVAX), while ByBit accounts for 28.8% of the OI with $119.67 million (2.95 million AVAX). BingX, OKX, and Bitget make up the rest of the top 5 with $50.37 million, $43.7 million, and $41.8 million, respectively. Token price retraces to $36 &#124; Source: AVAXUSD on Tradingview.com Rise In OI Sending AVAX Price To $100? While the Avalanche open interest has soared to a new all-time high, there is still a long way to go for the AVAX price before it reaches its all-time high of $146. Nevertheless, the rise in open interest is still incredibly bullish for the price. Related Reading: Bitcoin Vulnerability Discovered By A Developer Has Been Flagged By The US Government As proven by historical performance, the price of AVAX has often risen whenever the open interest has been on the rise. This was the case between 2021 and 2022 when the price of the altcoin rose above $100 before eventually crashing in 2022. If the Avalanche open interest continues to rise from here, it is expected that AVAX will follow through. A break in OI over $500 million will no doubt see the altcoin clear the coveted $50 level once more. However, $100 still looks to be a long way from here and will likely be reached sometime in 2024. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Coin Culture, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-13T23:01:43.000Z",
    "title": "Circle CEO Jeremy Allaire Says Stablecoin Industry Will See ‘Explosive’ Growth in Coming Years",
    "url": "https://dailyhodl.com/2023/12/13/circle-ceo-jeremy-allaire-says-stablecoin-industry-will-see-explosive-growth-in-coming-years/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Circle-As-Bankruptcy-Unfolds.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Circle-As-Bankruptcy-Unfolds.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Circle-As-Bankruptcy-Unfolds.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Circle-As-Bankruptcy-Unfolds.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Circle-As-Bankruptcy-Unfolds.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Circle-As-Bankruptcy-Unfolds.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Circle-As-Bankruptcy-Unfolds.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Circle CEO Jeremy Allaire says that the stablecoin industry is set to flourish in the coming years. In a new interview with CNBC Television, Allaire says that the modern features of stablecoins will allow the industry to see explosive growth over the next few years as demand for online digital dollars rises. “Digital dollars that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/13/circle-ceo-jeremy-allaire-says-stablecoin-industry-will-see-explosive-growth-in-coming-years/\">Circle CEO Jeremy Allaire Says Stablecoin Industry Will See ‘Explosive’ Growth in Coming Years</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]