[
  {
    "source": "Crypto Daily",
    "date": "2024-02-17T18:34:55.000Z",
    "title": "Decentraland, The Sandbox and ScapesMania: The Race to $1 in the 2024 Crypto Market",
    "url": "https://cryptodaily.co.uk/2024/02/decentraland-the-sandbox-and-scapesmania-the-race-to-1-in-the-2024-crypto-market",
    "description": "Get ready for an epic showdown in the 2024 crypto market! The trio of gaming tokens is racing to hit the $1 mark as Bitcoin's surge boosts the entire sector. Dive into this thrilling journey of virtual worlds and blockchain-based gaming, where massive gains await the savvy investor."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-17T18:21:00.000Z",
    "title": "Could Solana and BlastUP Reign Supreme in the Upcoming Altcoin Season?",
    "url": "https://cryptodaily.co.uk/2024/02/could-solana-and-blastup-reign-supreme-in-the-upcoming-altcoin-season",
    "description": "Dive into the dynamic crypto landscape as Bitcoin hits a monumental $1 trillion market cap. Explore the paradigm shift with Solana showcasing confidence in its positive trajectory. BlastUP, an emerging player, adds predictability to the volatile crypto space with its presale projects. Uncover the potential amidst market shifts and innovative strategies."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-17T18:30:14.000Z",
    "title": "Binance’s Derivatives Arm Launches Tesla Model Y and Bitcoin Voucher Challenge ",
    "url": "https://news.bitcoin.com/binances-derivatives-arm-launches-tesla-model-y-and-bitcoin-voucher-challenge/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/hoop90-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance’s Derivatives Arm Launches Tesla Model Y and Bitcoin Voucher Challenge \" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/hoop90-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/hoop90-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/hoop90-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/hoop90-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/hoop90-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/hoop90-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/hoop90.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Binance has announced a competition through its crypto derivatives arm, Binance Futures, offering participants the chance to win a Tesla Model Y. According to the crypto exchange, the contest will unfold over four weekly challenges spanning from Feb. 18 to Mar. 17, 2024. Binance Futures Unveils Tesla Model Y Challenge and Daily Crypto Rewards Beginning [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-17T18:38:00.000Z",
    "title": "Uniswap Price Prediction 2024-2033: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2024-2033 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-17T18:37:30.000Z",
    "title": "Moonbirds NFT price surge amid insider trading allegations",
    "url": "https://www.cryptopolitan.com/moonbirds-surge-insider-trading-allegations/",
    "description": "Following the recent acquisition of the Moonbirds NFT collection’s intellectual property (IP) by Yuga Labs, the maker of Bored Ape Yacht Club, alongside creator Proof, prices and trading volume for the collection experienced a significant surge on Friday afternoon. However, this surge has sparked speculation about potential insider trading activities leading up to the announcement. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-17T18:29:04.000Z",
    "title": "Anthropic says Claude Chatbot is off-limits to political candidates",
    "url": "https://www.cryptopolitan.com/anthropic-claude-political-candidates/",
    "description": "The intersection of artificial intelligence and politics is increasingly fraught with concerns about the spread of misinformation and manipulation. Anthropic, the company behind the ChatGPT competitor Claude, has recently unveiled stringent policies to prevent its AI tools from being exploited in political campaigns or lobbying efforts. This decision reflects a broader industry-wide effort to address [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-17T18:30:00.000Z",
    "title": "DeeStream draws DOGE and BNB holders eyeing 20x as market surges",
    "url": "https://crypto.news/deestream-draws-doge-and-bnb-holders-eyeing-20x-as-market-surges/",
    "description": "DOGE &#38; BNB surge while DeeStream (DST) presale hints at 20x as it reshapes streaming. In a growing market, Dogecoin (DOGE) continues to gain traction even after a significant 400 million DOGE transaction. Binance Coin (BNB) shows strength, targeting $400&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-17T18:14:48.000Z",
    "title": "BlackRock CEO teases feasibility of an XRP ETF",
    "url": "https://crypto.news/blackrock-ceo-teases-feasibility-of-an-xrp-etf/",
    "description": "Asset manager BlackRock is stirring interest within the cryptocurrency community by hinting at the potential launch of an XRP-based ETF. "
  }
]