[
  {
    "source": "Decrypt",
    "date": "2024-01-02T11:40:56.000Z",
    "title": "What Is a Bitcoin ETF, and Why Does Everyone from BlackRock to Grayscale Want One?",
    "url": "https://decrypt.co/resources/what-is-bitcoin-etf-explained-guide-learn-easy",
    "description": "A spot Bitcoin ETF creates a simple, legally compliant way to trade the price of Bitcoin, accessible on markets that investors are already familiar with."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-02T12:02:37.000Z",
    "title": " Why is Bitcoin price up today? ",
    "url": "https://cointelegraph.com/news/why-is-bitcoin-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTAvMjk3NTY5OWMtYWJkZC00ZjdiLWJkMzUtNzQyNjdhNTcwMTE3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>BTC price has risen to 21-month highs amid increasing chances that a spot Bitcoin ETF will get approved ahead of the Jan. 10 deadline.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has kickstarted 2024 with a bang, rising approximately 9% to $45,925, its highest level since April 2022 due to a mix of on-chain, fundamental, and technical factors.</p><p>The latest price gains appear ahead of the U.S. Securities and Exchange Commission's (SEC) <a href=\"https://cointelegraph.com/news/bitcoin-targets-48k-spot-driven-btc-price-rally\">decision</a> on several spot Bitcoin ETF applications, which might come before the official approval window beginning Jan. 4. </p><p>For instance, <a href=\"https://cointelegraph.com/tags/cme\">CME Bitcoin futures</a> data show investors betting on higher BTC prices. As of Jan. 2, these futures were trading at an approximately $1,300 premium to the cryptocurrency's spot value.</p><p><a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-up-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-02T11:47:50.000Z",
    "title": " Lawyer on Mickey Mouse NFTs: ‘You cannot suddenly make your own Mickey products’  ",
    "url": "https://cointelegraph.com/news/disney-nft-1928-mickey-mouse-steamboat-willie-lawyer-comments",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOTFkOTFhZDMtODUxNy00NjkzLThmZDAtZGU1OWRkMmRiY2JlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Lawyer Oscar Franklin Tan told Cointelegraph that people cannot use Steamboat Willie's version of Mickey to make anyone think their work is affiliated with Disney. </p>\n                    <p><p>A lawyer has warned the crypto community about the limitations of using “Steamboat Willie,” a copyright formerly owned by Disney but now available in the public domain. </p><p>On Jan. 2, nonfungible tokens (NFTs) using a version of Mickey Mouse that appeared in the “Steamboat Willie” short film in 1928 <a href=\"https://cointelegraph.com/news/nft-steamboat-willie-old-mickey-mouse-version-copyright-expires-top-opensea\">made it to the trending collections</a> list of the NFT marketplace OpenSea. One of the collections reached a 24-hour trading volume of 521 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), worth $1.2 million. </p><p>The lawyer added that copyright law protects artistic expression. However, Tan said that trademark law separately protects the identification of the source of the product. “So, you can’t use Steamboat Willie to make anyone think your work is affiliated with Disney.”</p><p><a href=\"https://cointelegraph.com/news/disney-nft-1928-mickey-mouse-steamboat-willie-lawyer-comments\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-02T11:45:08.000Z",
    "title": "Ping Exchange debuts with unique CorePass ID authentication and native crypto trading",
    "url": "https://cryptoslate.com/ping-exchange-debuts-with-unique-corepass-id-authentication-and-native-crypto-trading/",
    "description": "<p>Ping Exchange has initiated trading operations, marking a significant evolution for Core Blockchain following the simultaneous launch of CorePass ID for user authentication. A new entrant in the crypto trading landscape, Ping Exchange recently commenced trading on Jan. 1 with a unique feature: the integration of CorePass ID for user authentication. This system leverages the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ping-exchange-debuts-with-unique-corepass-id-authentication-and-native-crypto-trading/\">Ping Exchange debuts with unique CorePass ID authentication and native crypto trading</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-02T11:59:50.000Z",
    "title": "Mountain of commercial real estate debt falls due in 2024 - Bitcoin anyone?",
    "url": "https://cryptodaily.co.uk/2024/01/mountain-of-commercial-real-estate-debt-falls-due-in-2024-bitcoin-anyone",
    "description": "Hundreds of US office building mortgages are due to be repaid or refinanced in 2024. Many owners of these mortgages will have huge difficulties in meeting obligations. The resulting implosion from this bad debt can have widespread repercussions for banks."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T12:06:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T12:03:07.000Z",
    "title": "Azure Ray Announces Major Roster Shake-up ",
    "url": "https://www.cryptopolitan.com/azure-ray-announces-major-roster-shake-up/",
    "description": "In a stunning turn of events, Chinese esports organization Azure Ray has announced significant changes to its Dota 2 roster for the upcoming 2024 season. The organization, known for its prowess in bringing players out of retirement, has welcomed back three iconic players to its lineup: Zeng &#8220;Ori&#8221; Jiaoyang, Zhang &#8220;Faith_bian&#8221; Ruida, and Xu &#8220;fy&#8221; [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T11:47:46.000Z",
    "title": "Valve’s Decision: CS:GO Legacy Status and the Rise of CS2",
    "url": "https://www.cryptopolitan.com/valves-decision-csgo-legacy-status/",
    "description": "In a significant turn of events, Valve Corporation has officially discontinued support for Counter-Strike: Global Offensive (CS:GO), a game that has enjoyed over a decade of esports fame and popularity. The decision comes as Valve shifts its focus towards the new iteration, Counter-Strike 2 (CS2), which has been gaining traction in the gaming community.&#160; CS:GO [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-02T12:05:18.000Z",
    "title": "Developer asks community not to underestimate Bitcoin Ordinals",
    "url": "https://crypto.news/developer-asks-community-not-to-underestimate-bitcoin-ordinals/",
    "description": "Famous Bitcoin (BTC) developer Udi Wertheimer advocated for the adoption of Bitcoin Ordinals, despite widespread industry criticism. In a post on X, Wertheimer noted that many people reject the concept of Bitcoin Ordinals. However, he supported the adoption of Bitcoin&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-02T12:01:19.000Z",
    "title": "Analysts pick Polkadot, Everlodge, and Arbitrum for long-term holding",
    "url": "https://crypto.news/analysts-pick-polkadot-everlodge-and-arbitrum-for-long-term-holding/",
    "description": "As we look forward to 2024, analysts have picked Polkadot (DOT), Everlodge (ELDG), and Arbitrum (ARB) for long-term HODL"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-02T11:54:22.000Z",
    "title": "Kyrgyzstan witnesses major boost in tax revenue from crypto mining",
    "url": "https://crypto.news/kyrgyzstan-witnesses-major-boost-in-tax-revenue-from-crypto-mining/",
    "description": "Kyrgyzstan, a country possessing a wealth of untapped hydroelectric resources, has witnessed a sharp rise in tax revenues from crypto-mining activities in 2023. Reports from the Finance Ministry, as covered by the local press on Jan. 1, reveal that the&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-02T11:42:48.000Z",
    "title": "A comprehensive outlook on altcoin predictions for 2024: trends and insights",
    "url": "https://crypto.news/altcoin-predictions/",
    "description": "Unpacking altcoin predictions for 2024, focusing on Ethereum's advancements, Solana's market position, and the trajectories of promising altcoins."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-02T12:00:31.000Z",
    "title": "Crypto Expert Shares Ultimate Crypto Portfolio Guide To Make It In 2024",
    "url": "https://www.newsbtc.com/crypto/crypto-expert-crypto-guide-2024/",
    "description": "The crypto industry is now set for a strong bullish run in 2024, with most analysts predicting assets to reach new all-time highs. As a result, investors are always on the lookout hoping to jump on cryptocurrencies that offer the potential for substantial returns. A recent social media post by a crypto analyst known pseudonymously as Emperor Osmo listed the best cryptocurrencies to get on in 2024 across various trends and market niches. Expert Shares Ultimate Crypto Portfolio Guide The analyst&#8217;s crypto recommendations for the year were based on an analysis by CryptoKoryo Research on the Dune Analytics platform. Each recommendation was placed into an investing risk curve depending on the sentiment of the general population of market participants.  Related Reading: Bitcoin Spot ETF: Bitwise Closes Ranks With $200 Million Seed Fund Building the ultimate crypto portfolio for 2024 necessitates the selection of a mix of assets across the risk curves. Some more established blue chip cryptos provide stability and steady gains, while higher-risk assets have the potential for huge gains. Recommendations on the left curve predominantly consisted of attention-grabbing cryptocurrencies. The cryptos included BONK, the first dog-themed coin on Solana, COQ, the first meme coin on Avalanche, CTXC, and PYR, the native token for Vulcan Forged, a blockchain game studio, and NFT marketplace.  These cryptos went on astounding price surges in the last quarter of the year and mostly thrived on hype among investors. According to CryptoKoryo, the five cryptocurrencies made an increase of 1,571% in the past three months. If the hype continues in 2024, we could see them reach new highs, particularly in the first quarter. Here&#8217;s your portfolio guide to make it in 2024. 📊 ** Left Curve** &#8211; $BONK &#8211; $COQ &#8211; $CTXC &#8211; $PYR ** Mid Curve** &#8211; $AVAX &#8211; $BCB &#8211; $STEAK &#8211; $GNX &#8211; $ILV &#8211; $KUJI &#8211; $METIS &#8211; $MPL &#8211; $ORAI &#8211; $PYR &#8211; $SOL ** Right Curve** &#8211; $INST &#8211; $JOE &#8211; $LINK &#8211; $METIS &#8211; $ORAI &#8211; $SKL &#8211; $SOL… pic.twitter.com/6ZsyjT4EuE — Emperor Osmo🧪 (@Flowslikeosmo) January 1, 2024 Total market cap at $1.7 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com On the other hand, the mid-curve portfolio assets included less volatile layer-1 tokens, AI tokens, DeFi tokens, and layer-2 tokens. The 11 cryptocurrencies highlighted were AVAX, BCB, STEAK, GNX, ILV, KUJI, METIS, MPL, ORAI, PYR, and SOL, each going through a moderate price surge throughout 2023. According to CryptoKoryo, the five cryptocurrencies made an increase of 260% in the past three months. Related Reading: Crypto Analyst Says History Shows What Might Be Next For Bitcoin, But Is It Good Or Bad? Lastly, the right curve consisted of very stable assets with a higher potential for stable price growth in 2024. The cryptocurrencies highlighted were INST, JOE, LINK, METIS, ORAI, SKL, and SOL with a combined 253% performance in the past three months.  Source: X While the recommendations on the left and middle curves are very volatile and have a higher chance of dumping, the right curve cryptocurrencies have created a proven track record over the years, and many analysts project continued price growth throughout 2024.  On the other hand, cryptocurrencies on the middle curve are a bit more volatile but still relatively safe as far as cryptos go, while those on the left curve have the highest volatility risk but could lead to massive returns if they take off. Featured image from StormGain, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-02T12:00:31.000Z",
    "title": "Crypto Analyst Ali Martinez With a Bullish Ripple (XRP) Prediction; Chainlink (LINK) and Everlodge (ELDG) on the Top Altcoin List",
    "url": "https://www.crypto-news-flash.com/crypto-analyst-ali-martinez-with-a-bullish-ripple-xrp-prediction-chainlink-link-and-everlodge-eldg-on-the-top-altcoin-list/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-analyst-ali-martinez-with-a-bullish-ripple-xrp-prediction-chainlink-link-and-everlodge-eldg-on-the-top-altcoin-list",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-02T134100.555.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />Recently, prominent crypto analyst Ali Martinez has sparked enthusiasm within the community with a bullish prediction on Ripple (XRP). Meanwhile, Chainlink (LINK) and Everlodge (ELDG) emerge as the best altcoins to watch. While XRP and LINK are already established players, ELDG is now in Stage 8 of its presale, but many experts forecast it as [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-02T11:55:41.000Z",
    "title": "Dash and Zcash Prices Plummet Over 19% Amid OKX Exchange’s Delisting Announcement – Are Privacy Coins in Danger in 2024?",
    "url": "https://www.crypto-news-flash.com/dash-and-zcash-prices-plummet-over-19-amid-okx-exchanges-delisting-announcement-are-privacy-coins-in-danger-in-2024/?utm_source=rss&utm_medium=rss&utm_campaign=dash-and-zcash-prices-plummet-over-19-amid-okx-exchanges-delisting-announcement-are-privacy-coins-in-danger-in-2024",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/hacker-gabc0ca1dd_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />Dash and Zcash have plummeted after the OKX exchange announced that it would be delisting both tokens in a renewed crackdown against privacy coins. The exchange blamed the delisting on user feedback, but most delisted coins fall into the privacy coins category, with regulatory pressure forcing the exchange&#8217;s hand. The crackdown on privacy coins is [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-02T11:48:00.000Z",
    "title": "Binance Maintains Top Spot in Trade Volume Despite 2023 Troubles",
    "url": "https://coinedition.com/binance-maintains-top-spot-in-trade-volume-despite-2023-troubles/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/08-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance Aided Investigative Action That Led to Arrest of ISIS Members\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/08-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/08-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/08-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/08-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/08-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/08-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/08-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/08-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/08-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/08-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/08-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/08-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/08-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/08-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/08-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/08-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cryptocurrency trading platform Binance remains the cryptocurrency exchange with the largest trading volume despite the tumultuous events that marked its 2023.  According to a chart posted by the crypto educational platform Bitining, Binance currently has 43.8% of crypto exchanges&#8217; trade volume. At the start of 2023, the crypto exchange had 62.3% dominance over the market, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/binance-maintains-top-spot-in-trade-volume-despite-2023-troubles/\">Binance Maintains Top Spot in Trade Volume Despite 2023 Troubles</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]