[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-06T14:01:46.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-06T13:52:44.000Z",
    "title": "Former Celsius CEO Alex Mashinsky accused of civil Fraud in New York",
    "url": "https://www.cryptopolitan.com/former-celsius-ceo-alex-mashinsky-accused-of-civil-fraud-in-new-york/",
    "description": "New York Attorney General Letitia James has taken a significant step forward in the legal battle against Alex Mashinsky, the founder and former CEO of the now-bankrupt crypto lender Celsius. On August 4, Justice Margaret Chan of the New York County Supreme Court dismissed Mashinsky&#8217;s petition to dismiss the complaint, clearing the way for the ... <a title=\"Former Celsius CEO Alex Mashinsky accused of civil Fraud in New York\" class=\"read-more\" href=\"https://www.cryptopolitan.com/former-celsius-ceo-alex-mashinsky-accused-of-civil-fraud-in-new-york/\" aria-label=\"More on Former Celsius CEO Alex Mashinsky accused of civil Fraud in New York\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-06T13:45:38.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "NullTX",
    "date": "2023-08-06T14:00:08.000Z",
    "title": "Learn Why This New Bitcoin Version Could Be Your Chance To Generational Wealth",
    "url": "https://nulltx.com/learn-why-this-new-bitcoin-version-could-be-your-chance-to-generational-wealth/",
    "description": "Bitcoin Spark (BTCS), a cutting-edge fork of the legendary “Digital Gold”, deploys revolutionary features and presents a massive growth potential. As such, investors consider this new project a golden opportunity for generational wealth. Bitcoin Spark (BTCS) Bitcoin Spark emerges as a promising project striving to overcome the existing crypto shortcomings through a unique model, state-of-the-art [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-06T13:50:57.000Z",
    "title": "Compound (COMP) Bears Take Full Control As Price Dips 20% In 7 Days",
    "url": "https://www.newsbtc.com/news/compound-comp-bears-take-full-control-as-price-dips-20-in-7-days/",
    "description": "Compound (COMP), a leading player in the decentralized finance (DeFi) sector, has encountered a significant setback, witnessing a 20% decline in its price over the past week. The downward trend continued with a 3.06% decrease in the last 24 hours and an additional 0.79% shrinkage in the most recent hour, placing the current price at $55.62 per COMP. Moreover, COMP is now 93.90% below its all-time high of $911.20, a substantial drop from its previous peak. Related Reading: Crypto Analyst Points To Bitcoin Price History Repeating Itself – Are The Signs Bullish? Challenges Ahead For Compound Currently priced at $56.69, Compound (COMP) holds the 85th spot among all cryptocurrencies based on market capitalization. With 7,792,894 COMP tokens in circulation, the token&#8217;s total market capitalization amounts to $440,641,903. The current rankings and market performance indicate that COMP faces significant challenges amid recent market conditions.  Recent price declines have resulted in COMP slipping down the rankings, indicating the need for cautious monitoring of market conditions. In the ever-changing landscape of cryptocurrencies, tokens must continuously adapt to market trends, technological developments, and regulatory changes to maintain and improve their positions. As investors and traders navigate this complex environment, they must exercise due diligence and stay informed about the factors affecting the performance and rankings of tokens like Compound. COMP Price Analysis And Prediction This persistent bearish movement is a cause for concern, and potential investors should exercise caution. The current market conditions suggest that COMP is in a downtrend, indicating that the token is experiencing a dip. Various factors, including market sentiment, external events, and regulatory developments can influence price declines of this magnitude. Examining the situation from a broader perspective, the Compound cryptocurrency&#8217;s price trajectory is anticipated to maintain a bearish outlook as long as it remains below the $71 threshold. At present, the trading value rests at $58.28. Should the price break below $51, it is likely to head towards the midpoint of the established trading range, situated at $40. A more substantial retracement would lead to a reevaluation of the lower range boundary, potentially bringing it down to $26. Related Reading: XRP Whales Trigger Price Decline With Large Selling However, there is a silver lining for those considering investing in Compound. Over the past 90 days, the token recorded a 44.33% price increase, adding $17.41 to its previous value of $39.28. This demonstrates that Compound has displayed positive performance in the past, indicating the potential for a rebound once market conditions stabilize. The cryptocurrency market is characterized by cycles of ups and downs and historical data suggests that tokens like COMP can recover and experience growth after periods of decline. (This site’s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-06T14:00:20.000Z",
    "title": "Pikamoon’s Unique Features That Makes It Stand Out from Pepe Coin (PEPE) and Wojak (WOJAK)",
    "url": "https://www.crypto-news-flash.com/pikamoons-unique-features-that-makes-it-stand-out-from-pepe-coin-pepe-and-wojak-wojak/?utm_source=rss&utm_medium=rss&utm_campaign=pikamoons-unique-features-that-makes-it-stand-out-from-pepe-coin-pepe-and-wojak-wojak",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T171217.201.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T171217.201.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T171217.201-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T171217.201-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Pikamoon (PIKA) takes the number one spot on the watchlist of investors as they make their top picks against the coming bull run. Analysts believe Pikamoon beat top contenders like Pepecoin (PEPE) and Wojak (WOJAK) to the chase because of its unique features and high utility. In this article, we’ll take a deep dive to [...]"
  }
]