[
  {
    "source": "CoinDesk",
    "date": "2023-07-31T11:00:00.000Z",
    "title": "Fantasy-Sports Firm Sorare Looks to Increase Appeal by Diluting Crypto Association",
    "url": "https://www.coindesk.com/web3/2023/07/31/fantasy-sports-firm-sorare-looks-to-increase-appeal-by-diluting-crypto-association/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "While Sorare has over 4 million registered users, it is looking to fuel further growth by adding support for the U.S. dollar, euro and British pound."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-31T10:57:55.000Z",
    "title": "Crypto still here despite everything",
    "url": "https://cryptodaily.co.uk/2023/07/crypto-still-here-despite-everything",
    "description": "<p>Who would have thought it? Crypto has now suffered harsh crackdowns from both the major world superpowers and is still undergoing increased adoption.</p>\nAn adapting Chinese crypto strategy\n<p>First it was China. A huge and sprawling country with a very centralised government overseen by its paramount leader Xi Jinping who controls both the Chinese Communist Party and the People&rsquo;s Liberation Army, and just about everything else.</p>\n<p>China has been at the forefront internationally of those countries that are looking to implement a central bank digital currency (CBDC). Such a move, allied to China&rsquo;s social scoring system would likely give Jinping and his central bank unrivalled power and control over Chinese citizens. Therefore, private digital assets such as cryptocurrencies are complete anathema to such a plan.</p>\n<p>There followed a complete ban on trading of cryptocurrencies and a ban on crypto mining was imposed across China. However, China has implemented such bans before, and despite causing an initial large drop in the Bitcoin hash rate, as many of the Chinese Bitcoin miners came off line, much of the hash rate has since returned as the miners set up shop again in other more welcoming countries.</p>\n<p>Further to Chinese embarrassment, the hash rate has increased again in China itself, leading it to become the 3rd largest contributor to the Bitcoin hash rate worldwide.</p>\n<p>On top of this, the Chinese government appears to have had a change of heart as regards crypto, perhaps realising that this technology could have a much greater impact on the world as it continues to mature.</p>\n<p>Still not happy with allowing crypto to have its head within the mainland borders, China looks to have nominated Hong Kong as its offshore sandbox, giving it the luxury of watching developments as Hong Kong strives to become a fully regulated crypto hub and attracts crypto companies that might have gone instead to competing Asian crypto hubs such as Dubai and Singapore.</p>\nUS fast becoming the most repressive regime for crypto\n<p>Meanwhile in the West, the United States, once the home of business and the entrepreneurial heartland of the globe, is very much following in the footsteps of China, without even the testing ground of an offshore territory such as Hong Kong.</p>\n<p>It might appear that Gary Gensler, the head of the SEC, the regulatory watchdog of the US for securities, has been tasked by the government with systematically destroying the crypto industry in the United States.</p>\n<p>Given that the US has managed to achieve complete financial hegemony over the rest of the world by the use of the dollar as the global reserve currency, private digital assets such as cryptocurrencies are probably being seen as a threat to this domination.</p>\n<p>However, the US should be the first country to realise that no individual, regulatory body, or government, can do more than impede the progress of a new technology for any length of time. Technology cannot be repressed for long, and if it is truly innovative and ground-breaking, as is the case with blockchain and cryptocurrencies, it will always win out.</p>\n<p>Therefore, the SEC&rsquo;s attacks on crypto exchanges such as Coinbase, which have done their level best to follow the misty and obscure road of compliance, would appear to be the height of folly.</p>\n<p>The US might be attempting to go the route of much greater control and centralisation, but it still happens to be the land of the free, even though the sands of time might be running down for that particular ideal, so it is not difficult for business leaders to see what is really happening as the regulatory agencies go far beyond their remit in order to attack and suppress the crypto industry in the US.</p>\nCrypto adoption marches on\n<p>Be that as it may, crypto marches onwards and upwards. Wallet holders of Bitcoin increased by 40% even during the bear market, and if the US succeeds in driving crypto companies from its shores, jurisdictions in Europe (UK, and France) and Asia (Dubai, Hong Kong, and Singapore) among others, are waiting to take up the slack.</p>\n<p>The battle is also not over in the US. The entrance of the largest asset management company in the world (Blackrock) into the Spot Bitcoin EFT space, will now make the battle for crypto even more interesting going forward.</p>\n<p>Fast-depreciating fiat currencies are an unpalatable fact for all citizens of the world. A store of value (Bitcoin), and a potential solution to debasing fiat currencies (crypto) are becoming widely adopted. Will central bank-influenced governments be able to stop them?</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-31T11:00:30.000Z",
    "title": "marumaruNFT: Revolutionizing Cabaret Clubs and Host Clubs with Dynamic NFTs and Market Competition",
    "url": "https://news.bitcoin.com/marumarunft-revolutionizing-cabaret-clubs-and-host-clubs-with-dynamic-nfts-and-market-competition/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-95-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-95-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-95-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-95-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-95-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-95-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-95-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-95-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />NFTs represent unique and indivisible items, backed by blockchain technology, certifying their originality, scarcity, and authenticity. Whether it&#8217;s digital art, music, videos, virtual real estate, or collectible items, NFTs have become a powerful tool for artists, creators, collectors, and investors alike, unlocking new opportunities and experiences in the digital space. In the dynamic and ever-evolving [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T10:46:26.000Z",
    "title": "Can PhotoGuard from MIT CSAIL Counter the Risks of AI Image Manipulation?",
    "url": "https://www.cryptopolitan.com/photoguard-counter-ai-image-manipulation/",
    "description": "As AI-driven generative models continue to advance, producing hyper-realistic images that challenge the boundaries between reality and fabrication, the potential for image manipulation and misuse becomes a growing concern. In response to this looming threat, researchers from MIT&#8217;s Computer Science and Artificial Intelligence Laboratory (CSAIL) have developed &#8220;PhotoGuard,&#8221; a groundbreaking technique aimed at safeguarding image ... <a title=\"Can PhotoGuard from MIT CSAIL Counter the Risks of AI Image Manipulation?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/photoguard-counter-ai-image-manipulation/\" aria-label=\"More on Can PhotoGuard from MIT CSAIL Counter the Risks of AI Image Manipulation?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-31T10:53:33.000Z",
    "title": "Pro-crypto lawyers clarify XRP’s security status",
    "url": "https://crypto.news/pro-crypto-lawyers-clarify-xrps-security-status/",
    "description": "Crypto lawyers John Deaton and Mike Selig took to Twitter to debunk misconceptions about the judge Torres&#8217; decision regarding XRP&#8217;s security status. The legal experts sought to clarify the ruling amid what they deemed to be widespread inaccuracies perpetuated by&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-31T10:55:31.000Z",
    "title": "Coinbase (COIN) Drops 10% As CEO Discloses Absurd SEC Request",
    "url": "https://www.newsbtc.com/news/coinbase-coin-drops-10-amidst-absurd-sec-request/",
    "description": "After a shocking revelation by CEO Brian Armstrong, Coinbase, the Nasdaq-listed crypto exchange, saw its share price plummet by more than 10%. The reason: a controversial request from the US Securities and Exchange Commission (SEC) prior to the lawsuit against Coinbase. The SEC&#8217;s demand? That Coinbase halts trading in all cryptocurrencies other than Bitcoin. Brian Armstrong, Coinbase&#8217;s CEO, revealed the SEC&#8217;s absurd request in an exclusive interview with the Financial Times. &#8220;They came back to us, and they said . . . we believe every asset other than Bitcoin is a security,&#8221; Armstrong said. &#8220;And, we said, well how are you coming to that conclusion, because that’s not our interpretation of the law. Remarkably, the SEC answered, “we’re not going to explain it to you, you need to delist every asset other than Bitcoin.&#8221; SEC Wanted To End The Entire US Crypto Industry This unprecedented move by the SEC indicates an intent to assert regulatory authority over the entire altcoin market. The SEC&#8217;s case against Coinbase identified 13 traded cryptocurrencies as securities, asserting that by offering them to customers, the exchange fell under the regulator’s remit. Related Reading: Bitcoin Coinbase Premium Turns Red, US Institutions Disinterested? However, the SEC&#8217;s request for Coinbase to delist over 200 tokens suggests a push for even wider authority over the crypto industry under the chairmanship of Gary Gensler. Armstrong was quick to point out the potential implications of such a move. &#8220;If Coinbase had agreed, that could have set a precedent that would have left the vast majority of the American crypto businesses operating outside the law unless they registered with the commission,&#8221; he said. The CEO further added, &#8220;We really didn’t have a choice at that point, delisting every asset other than Bitcoin, which by the way is not what the law says, would have essentially meant the end of the crypto industry in the US.&#8221; Coinbase (COIN) Plunges Following The News In the wake of the news, the Coinbase share price (COIN) plummeted in an initial reaction by more than 10%, from $102.35 to $91.94. However, at press time, the price recovered somewhat and traded at $94.76. Related Reading: Coinbase Exchange Tells Borrowers That They Have Four Months To Pay Back The news may have been a shock for COIN investors, as the statement by Brian Armstrong reveals that the approach by the SEC is even harder and worse for the crypto industry (by naming all cryptocurrencies except BTC a security) However, it&#8217;s important to note that it won&#8217;t have any impact on the SEC-Coinbase lawsuit directly. Thus, it’s possible that this was an overreaction of the market. It&#8217;s also worth noting that the upward trend in COIN&#8217;s 1-day chart remains intact. The price has bounced upwards off the support level at $91.87. Featured image from Futurism, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-31T11:00:40.000Z",
    "title": "Uwerx (WERX) Presale Surges Into Phase 5 With Demand Far Outstripping $WERX Presale Token Supply",
    "url": "https://www.crypto-news-flash.com/uwerx-werx-presale-surges-into-phase-5-with-demand-far-outstripping-werx-presale-token-supply/?utm_source=rss&utm_medium=rss&utm_campaign=uwerx-werx-presale-surges-into-phase-5-with-demand-far-outstripping-werx-presale-token-supply",
    "description": "<img width=\"1024\" height=\"512\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/werfr.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/werfr.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/werfr-300x150.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/werfr-768x384.png 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />Decentralized freelance marketplace platform Uwerx is geared up for a record-breaking launch and surefire parabolic growth after recently selling out its first four presale phases in record time. As Uwerx gears up for its phase 5 of its presale for its native utility token $WERX, the freelance marketplace platform has already treated early investors to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-31T10:59:51.000Z",
    "title": "Investors Bag 10,000% Profits With this New Meme Coin Built on Ethereum Layer 2 network backed by Coinbase – Is CEO Brian Armstrong Involved With The Project?",
    "url": "https://www.crypto-news-flash.com/investors-bag-10000-profits-with-this-new-meme-coin-built-on-ethereum-layer-2-network-backed-by-coinbase-is-ceo-brian-armstrong-involved-with-the-project/?utm_source=rss&utm_medium=rss&utm_campaign=investors-bag-10000-profits-with-this-new-meme-coin-built-on-ethereum-layer-2-network-backed-by-coinbase-is-ceo-brian-armstrong-involved-with-the-project",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Bald has in the past 48 hours surged by over 40,000 percent to move from almost $0 market cap to $50,000.  Coinbase CEO Brian Armstrong has been suspected to be involved in this project as analyst observes strange moves.  Coinbase recently created a new blockchain called Base. According to reports, this initiative was done on [...]"
  }
]