[
  {
    "source": "Cointelegraph",
    "date": "2024-03-22T03:13:29.000Z",
    "title": " US sues Apple for ‘shapeshifting’ rules that throttled crypto apps and others ",
    "url": "https://cointelegraph.com/news/us-doj-sue-apple-monopoly-app-store-rules",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNTUwMTAyNGQtMjdlMC00MDljLTgzMmEtOTk5ZTU1OTM1MzQ5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Apple’s App Store rules enforcement are arbitrary “penalize and restrict developers” that compete with the tech giant’s “monopoly power,” the DOJ alleged.</p>\n                    <p><p>The United States Department of Justice has slapped tech giant Apple with an extensive antitrust lawsuit claiming its app market rules and “monopoly\" illegally throttled competition and suffocated innovation.</p><p>The March 21 <a href=\"https://www.courtlistener.com/docket/68362334/1/united-states-v-apple-inc/\" target=\"_blank\" rel=\"noopener nofollow\">complaint</a> in a New Jersey federal court — supported by 16 state attorney generals — alleged Apple has a monopoly in the smartphone market that it has used to “‘force’ developers to use its payment system to lock in both developers and users on its platform.”</p><p>Apple’s App Store guidelines and developer agreements impose “a series of shapeshifting rules and restrictions” that allow the company to take “higher fees, thwart innovation, offer a less secure or degraded user experience, and throttle competitive alternatives,” the DOJ alleged.</p><p><a href=\"https://cointelegraph.com/news/us-doj-sue-apple-monopoly-app-store-rules\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-22T03:16:00.000Z",
    "title": "Bernstein Predicts Bitcoin ($BTC) Price Will Hit $90,000 by Year-End Amid Bullish Market Factors",
    "url": "https://www.cryptoglobe.com/latest/2024/03/bernstein-predicts-bitcoin-btc-price-will-hit-90000-by-year-end-amid-bullish-market-factors/",
    "description": "Financial services firm Bernstein raised its year-end price target for the flagship cryptocurrency Bitcoin ($BTC) to $90,000 from $80,000, citing a confluence of bullish factors. According to a recent report by analysts Gautam Chhugani and Mahika Sapra. a new Bitcoin bull cycle is underway, fueled by strong inflows into the newly launched spot Bitcoin exchange-traded […]\n"
  }
]