[
  {
    "source": "Decrypt",
    "date": "2023-07-21T02:46:43.000Z",
    "title": "Space Case? Melania Trump's Apollo 11 NFT Defies NASA Rules",
    "url": "https://decrypt.co/149481/space-case-melania-trumps-apollo-11-nft-defies-nasa-rules",
    "description": "An NFT released by former First Lady Melania Trump features an iconic NASA photo, despite the agency's explicit prohibition on NFTs."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T02:41:02.000Z",
    "title": "Top Blockchain Dev Companies in Taiwan: Expertise and Solutions Gaining Global Recognition",
    "url": "https://www.cryptopolitan.com/top-blockchain-dev-companies-in-taiwan/",
    "description": "Taiwan, a bustling hub of technological innovation, has made significant strides in the blockchain industry. With its vibrant ecosystem and forward-thinking approach, the country is home to several top-notch blockchain development companies shaping this transformative technology&#8217;s future. As blockchain continues to revolutionize various sectors, including finance, supply chain, and digital identity, the expertise and solutions ... <a title=\"Top Blockchain Dev Companies in Taiwan: Expertise and Solutions Gaining Global Recognition\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-blockchain-dev-companies-in-taiwan/\" aria-label=\"More on Top Blockchain Dev Companies in Taiwan: Expertise and Solutions Gaining Global Recognition\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-21T02:57:17.000Z",
    "title": "Bitcoin Price Relatively Muted; Resistance Estimated Near $30,400",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-relatively-muted-30400/",
    "description": "Bitcoin price is still consolidating above $29,500. BTC must settle above the $30,400 resistance zone to start a steady increase in the near term. Bitcoin is struggling to clear the $30,000 resistance level. The price is trading below $30,000 and the 100 hourly Simple moving average. There was a break below a key bullish trend line with support near $29,950 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a decent increase if there is a close above the $30,400 resistance. Bitcoin Price Remains In A Range Bitcoin price attempted a fresh increase above the $30,400 resistance zone. However, BTC struggled to settle above $30,400 and reacted to the downside. There was a break below a key bullish trend line with support near $29,950 on the hourly chart of the BTC/USD pair. The pair declined below the $29,850 level but the downsides were limited. The price stayed above the $29,500 support. A low is formed near $29,591 and the price is now attempting a fresh increase. There was a move above the $29,650 level. Bitcoin price is now trading below $30,000 and the 100 hourly Simple moving average. Immediate resistance is near the $30,000 level and the 100 hourly Simple moving average. It is close to the 50% Fib retracement level of the recent decline from the $30,405 swing high to the $29,591 low. The first major resistance is near the $30,100 level. Source: BTCUSD on TradingView.com The 61.8% Fib retracement level of the recent decline from the $30,405 swing high to the $29,591 low is also near the $30,100 level. The next major resistance is near $30,400. A close above the $30,400 level might start a fresh increase. In the stated case, the price could rise toward the $30,800 level. Any more gains could open the doors for a move toward the $31,200 resistance zone. More Losses in BTC? If Bitcoin fails to clear the $30,000 resistance, it could continue to move down. Immediate support on the downside is near the $29,600 level. The next major support is near the $29,500 level, below which the price could accelerate lower. In the stated case, the price could drop toward the $29,200 support zone. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now near the 50 level. Major Support Levels – $29,600, followed by $29,500. Major Resistance Levels – $30,000, $30,100, and $31,400."
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-21T03:08:20.000Z",
    "title": "Trillion-Dollar Debt Will Fuel Decline of US Dollar As Interest Payments Mount: Ron Paul",
    "url": "https://dailyhodl.com/2023/07/20/trillion-dollar-debt-will-fuel-decline-of-us-dollar-as-interest-payments-mount-ron-paul/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/us-dollar-strength.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/us-dollar-strength.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/us-dollar-strength.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/us-dollar-strength.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/us-dollar-strength.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/us-dollar-strength.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/us-dollar-strength.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Former US congressman Ron Paul says the US dollar is overdue for a major downturn in the face of out of control debt. In a new discussion on his YouTube channel, Paul says the reason that central banks and even private citizens have increased their gold reserves is a waning confidence in the US dollar. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/20/trillion-dollar-debt-will-fuel-decline-of-us-dollar-as-interest-payments-mount-ron-paul/\">Trillion-Dollar Debt Will Fuel Decline of US Dollar As Interest Payments Mount: Ron Paul</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]