[
  {
    "source": "CoinDesk",
    "date": "2023-10-13T15:11:02.000Z",
    "title": "THORSwap, Used by FTX Exploiter, Resumes Trading After Updating Terms to Exclude U.S.-Sanctioned Countries",
    "url": "https://www.coindesk.com/tech/2023/10/13/thorswap-used-by-ftx-exploiter-resumes-trading-after-updating-terms-to-exclude-us-sanctioned-countries/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "THORSwap, the exchange that paused its platform last Friday following a series of trades related to the FTX hack, resumed its services on Friday with updated terms and conditions relating to users in sanctioned countries."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-13T15:15:55.000Z",
    "title": "Tether CEO Steps Down, Naming Paolo Ardoino as Successor at Stablecoin Issuer",
    "url": "https://decrypt.co/201365/tether-ceo-steps-down-naming-paolo-ardoino-as-successor-at-stablecoin-issuer",
    "description": "Paolo Ardoino has already acted as the face of the stablecoin giant for years. "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-13T15:14:41.000Z",
    "title": "Top 3 Cryptos Not to Miss This October: Binance Coin BNB, Tradecurve Markets, PancakeSwap",
    "url": "https://cryptodaily.co.uk/2023/10/top-3-cryptos-not-to-miss-this-october-binance-coin-bnb-tradecurve-markets-pancakeswap",
    "description": "The BNB Chain received major updates, so Binance Coin (BNB) interest has been booming. Moreover, PancakeSwap (CAKE) V3 launched on the opBNB network."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-13T15:15:52.000Z",
    "title": "Grayscale’s ETF deadline set for midnight",
    "url": "https://crypto.news/grayscale-deadline-set-for-midnight/",
    "description": "Eleanor Terrett, a Fox Business journalist, shared a post on X reminding the public that the SEC has until midnight to appeal the Grayscale bid for a spot Bitcoin ETF."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-13T15:12:09.000Z",
    "title": "Bitcoin ATM lawsuit resolved in McLennan County",
    "url": "https://crypto.news/bitcoin-atm-lawsuit-resolved-in-mclennan-county/",
    "description": "McLennan County authorities have resolved a lawsuit with Lux Vending's Bitcoin Depot over the incorrect seizure of $15,000 from a Bitcoin ATM following an elderly woman's scam incident."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-13T15:30:30.000Z",
    "title": "Failed Bullish Pattern Could Send Ethereum Sub-$1000",
    "url": "https://www.newsbtc.com/news/ethereum/failed-bullish-ethereum-sub-1000/",
    "description": "Ethereum price is trading at roughly $1,550 after failing to get back above $2,000 throughout the entirety of 2023 thus far. Increasingly higher lows during the year and a horizontal resistance zone had formed an ascending triangle – a potentially bullish chart pattern. This pattern, however, is possibly failing. A busted pattern target could send the price per ETH sub-$1,000. Is the bullish chart pattern breaking down? &#124; ETHUSD on TradingView.com Ethereum Ascending Triangle Begins Breakdown: Target $700 Ethereum put in its bear market low back in June of 2022 while Bitcoin and other coins kept falling through the end of the year. Despite the early lead in a bear market recovery, ETH has underperformed against BTC in 2023. Now it is at risk of falling to a new low with a target of deep below $1,000 if a presumed bullish pattern breaks down instead of up. Related Reading: Ethereum News Catalyst Could Trigger Triangle Breakout To $4,000 ETHUSD has been trading in what appears to be a textbook ascending triangle pattern since its 2022 local low. A series of increasingly higher highs has created an upward slowing trend line. A horizontal resistance zone across $2,000 has kept price action at bay. Volume has been trending downward throughout the course of the pattern. Price is at roughly two-thirds to the triangle apex. Ether even had positive news at its back: the launch of the first Ethereum Futures ETFs. Yet it has failed to produce any meaningful upside, and is now trying to move back down causing the bullish pattern to bust. If the pattern does break downward, it would have a target of around $700 per ETH based on the measure rule. Or is the a bearish barrier triangle anyway? &#124; ETHUSD on TradingView.com Elliott Wave Explained: Golden Fibonacci Extension Targets $300 ETH Although the ascending triangle is considered a bullish chart pattern, it only has a roughly 63% probability of breaking out, per the Encyclopedia of Chart Patterns by Thomas Bulkowski. The remaining 37% of the time break down. But technical analysis is a broad study. An ascending triangle to one trader, could be barrier triangle to another. A barrier triangle is simply an ascending or descending triangle as defined by Elliott Wave Principle. In Elliott Wave Principle, triangles are especially telling. They only appear before the final move in a sequence. Because Elliott Wave labels waves with the trend as 1 through 5, triangles are corrective and appear only in the wave 4 place – just prior to wave 5 which ends the sequence. Related Reading: Doom Signal Warns Of 50% Crypto Collapse In a bear market, corrective structures are labeled ABC. Triangles themselves can appear during a B wave, which once again, is ahead of the final move in the ABC count. C wave targets are often found by projecting the 1.618 Fibonacci ratio from the A wave. This makes the target of the busted pattern somewhere around $300 per ETH. Between the measure rule and the Fibonacci extension target, Ethereum could be facing sub-$1,000 prices in the future. Could Ether fall sub-$1000? &#124; ETHUSD on TradingView.com Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-13T15:31:18.000Z",
    "title": "Uniswap Makes Waves with Android Wallet Launch on Google Play",
    "url": "https://www.crypto-news-flash.com/uniswap-makes-waves-with-android-wallet-launch-on-google-play/?utm_source=rss&utm_medium=rss&utm_campaign=uniswap-makes-waves-with-android-wallet-launch-on-google-play",
    "description": "<img width=\"1201\" height=\"601\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Uniswap\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card.png 1201w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card-300x150.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card-1024x512.png 1024w\" sizes=\"(max-width: 1201px) 100vw, 1201px\" />Uniswap Labs has launched its Android mobile crypto wallet in beta, following the success of its iOS wallet, with a wider release expected by year-end. The new wallet offers features like fast swaps, clear pricing, and automatic switching between blockchain networks. In a strategic move to enhance accessibility for users worldwide, Uniswap Labs unveiled its [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-13T15:25:00.000Z",
    "title": "Analyst Says XRP is Teetering on the Edge: Mulls a Return to $2",
    "url": "https://coinedition.com/analyst-says-xrp-is-teetering-on-the-edge-mulls-a-return-to-2/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Uppercent to Feature in XRP Gold Coast Conference in March 2024\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to a presenter of the crypto YouTube channel ‘A Chain of Blocks’, XRP is teetering on the edge. The channel presenter referenced an X post by EGRAG CRYPTO, which projected a $2 inbound for the embattled cryptocurrency. The presenter’s reference includes a technical analysis by EGRAG CRYPTO showing XRP’s historical performance, indicating that XRP [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analyst-says-xrp-is-teetering-on-the-edge-mulls-a-return-to-2/\">Analyst Says XRP is Teetering on the Edge: Mulls a Return to $2</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-10-13T15:36:37.000Z",
    "title": "Is BitVM the Next Evolution for Smart Contracts on Bitcoin?",
    "url": "https://blog.bitfinex.com/education/is-bitvm-the-next-evolution-for-smart-contracts-on-bitcoin/",
    "description": "<p>BitVM is a computing model that lets you run complex contracts on Bitcoin without altering its fundamental rules. Let’s take a look at what it is and how it can revolutionise the way we use Bitcoin. What is BitVM? For years, Bitcoin has been the...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/education/is-bitvm-the-next-evolution-for-smart-contracts-on-bitcoin/\">Is BitVM the Next Evolution for Smart Contracts on Bitcoin?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]