[
  {
    "source": "Decrypt",
    "date": "2023-07-19T16:00:56.000Z",
    "title": "Cymbal Launches 'Human Readable' Ethereum Blockchain Explorer—A Social Etherscan",
    "url": "https://decrypt.co/149202/cymbal-human-readable-ethereum-blockchain-explorer-etherscan",
    "description": "Unlike traditional explorers that can be difficult to understand, Cymbal is both visual and social—and aimed at the masses."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-19T15:56:34.000Z",
    "title": "Proof-of-truth: Countering AI overreach through Cointelegraph’s Historical NFTs ",
    "url": "https://cointelegraph.com/news/countering-artificial-intelligence-overreach-nonfungible-tokens",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/d1fea331-19d6-4402-a9db-7d39de578022.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Investing in authenticity: Here’s how Cointelegraph’s Historical Collection combats AI’s impact on information.</p>\n                    <p><p>In the rapidly evolving world of blockchain technology, nonfungible tokens (NFTs) have emerged as an asset class offering a unique opportunity to own many kinds of digital items — both rare and valuable. Since the initial boom of NFTs manifested through the world of collectible digital art (such as Bored Ape Yacht Club and CryptoPunks), the past year has seen digital collectibles utilized in various other interesting real-world use cases. Cointelegraph’s Historical Collection is a prime example of this.</p><p>The Historical Collection is an initiative that allows individuals to own a piece of history by minting any article published on Cointelegraph as a digital collectible. It offers an opportunity to search for iconic art and headlines or hunt for hot, breaking news early to mint on the Polygon blockchain.</p><p class=\"post-content__accent post-content__accent_small\"><a href=\"https://cointelegraph.com/historical\">CHECK OUT THE COINTELEGRAPH HISTORICAL COLLECTION</a></p><p>Since its debut, the collection has seen nearly 1,100 minted versions of numerous Cointelegraph articles being resold as collectibles, making their availability scarce, as each article can be minted only a certain number of times. Interestingly, only 3% of these articles are listed for secondary sale, indicating that many people are buying them as long-term or sentimental investments.</p><h3>Becoming part of history</h3><p>While celebrating the success of innovative projects, it’s crucial to address the looming specter of artificial intelligence (AI) in the digital content landscape. AI’s capacity to generate vast amounts of content could potentially disrupt the ways people consume and monetize free content.</p><p>Ivan Sokolov, co-founder of Mintmade — a platform designed for creating digital collectibles natively integrated into news media outlets — told Cointelegraph that moving forward, owning such pieces of content in today’s digital age will be highly significant, explaining:</p><blockquote>“By owning articles, people are showing that they care about the internet we know: free, accessible and trustworthy. If AI continues to disrupt the ways we monetize free content, we could face paywalls in every media outlet that provides access to free and professional coverage of important news.”</blockquote><p>Sokolov’s concerns are not unfounded. There is a lot of data <a href=\"https://www.theverge.com/2023/6/26/23773914/ai-large-language-models-data-scraping-generation-remaking-web\" target=\"_blank\" rel=\"noopener nofollow\">suggesting</a> the rapidly expanding AI ecosystem is overwhelming the internet’s capacity for scale. AI systems — particularly generative models — are capable of producing an enormous amount of text and images in an extremely short period, leading to potential degradation of the quality of the information available online.</p><p>AI-generated information models can quite often be misinformed, biased or entirely false, and thus erroneous data produced by them can be extremely challenging to spot. This can lead to the spread of misinformation, a significant concern in today’s digital age. Furthermore, AI models can also scrape data from the web without regard for copyright or privacy, leading to potential legal and ethical issues.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/a7eda1ee-0e74-4670-8572-cfe82e69334a.png\"  /></figure><p>In this context, initiatives like the Historical Collection by Cointelegraph allow readers to own pieces of quality, verified content in the form of NFTs. The Historical Collection seeks to offer an alternative path to how independent, unbiased news can still be pursued and promoted in this increasingly decentralized world. “By investing in these NFTs, individuals are not only investing in future profits but also in the future of information. Investors are supporting media they trust and topics they find interesting. This is more important than ever,” Sokolov said in closing.</p><p>Thus, as readers ponder the kind of content they’ll be consuming in a year, and who will be writing it, it’s clear that the Historical Collection by Cointelegraph offers a unique opportunity to invest in the future of information. So, why not start by minting this very article into an NFT and becoming a part of history?</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/ethereum-compatible-privacy-blockchain-sapphire-launches&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-19T16:00:49.000Z",
    "title": "Realized price closing in long-term holder price: Does this signal a possible end of the bear market?",
    "url": "https://cryptoslate.com/insights/realized-price-closing-in-long-term-holder-price-does-this-signal-a-possible-end-of-the-bear-market/",
    "description": "<p>Quick Take Data analysis firm Glassnode offers a chart that tracks the weekly percentage shift in the Realized Price for different on-chain groups. This tool aids in detecting times when the collective cost basis has either increased or decreased notably within a brief period. The Realized Price is the accumulated price at which each coin [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/realized-price-closing-in-long-term-holder-price-does-this-signal-a-possible-end-of-the-bear-market/\">Realized price closing in long-term holder price: Does this signal a possible end of the bear market?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-19T16:00:44.000Z",
    "title": "An indecisive options market keeps Bitcoin flat",
    "url": "https://cryptoslate.com/an-indecisive-options-market-keeps-bitcoin-flat/",
    "description": "<p>Bitcoin (BTC) has been locked in a tight trading range, fluctuating between $30,000 and $31,000. While some on-chain metrics show that this ongoing sideways movement has been observed before Bitcoin&#8217;s previous bull runs, there is little to indicate that a significant shift could happen soon. The derivatives market, particularly the options market, reveals a divided [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/an-indecisive-options-market-keeps-bitcoin-flat/\">An indecisive options market keeps Bitcoin flat</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-19T16:00:06.000Z",
    "title": "Biggest Movers: SOL Snaps Losing Streak as XRP Climbs 5% Higher ",
    "url": "https://news.bitcoin.com/biggest-movers-sol-snaps-losing-streak-as-xrp-climbs-5-higher/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2065348232-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SOL Snaps Losing Streak, as XRP Climbs 5% Higher \" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2065348232-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2065348232-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2065348232-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2065348232-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2065348232-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2065348232-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2065348232.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Solana ended a three-day losing streak on Wednesday, as the token moved back above the $26.00 mark. The decline came following Friday&#x2019;s move above $32.00, which took the price to an eight-month high. XRP has also rebounded today, and looks to be heading for its recent high over $0.9400. Solana (SOL) Solana (SOL) was one [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T15:58:14.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T15:43:15.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-19T15:55:31.000Z",
    "title": "USDT, USDC Boom Likely To Pump DeFi And Crypto AI Tokens Like QUBE Even Higher",
    "url": "https://nulltx.com/usdt-usdc-boom-likely-to-pump-defi-and-crypto-ai-tokens-like-qube-even-higher/",
    "description": "The crypto market has witnessed a Tether (USDT) and USD Coin (USDC) boom. The surge in these stablecoins will likely boost the growth of DeFi and AI tokens like InQubeta (QUBE). AI and DeFi are two of the fastest-growing industries in the crypto market. Hence, the increased value of stablecoins benefits crypto AI tokens by [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T16:00:02.000Z",
    "title": "Binance Burns $480 Million In BNB, Will Price Recover?",
    "url": "https://www.newsbtc.com/analysis/bnb/binance-burns-480-million/",
    "description": "Binance, the world’s largest cryptocurrency exchange, just completed its quarterly BNB burn, destroying $480 million worth of its native BNB token. According to the company&#8217;s blog post, 1,991,854.33 BNB was recently burned in its 24th quarterly BNB burn, with 747.51 BNB going through the Pioneer Burn Program. Binance Completes 24th Quarterly BNB Burn BNB Chain’s token-burning events are not new and have become somewhat of a routine. BNB has an auto-burn protocol that removes a predetermined amount of BNB from the crypto market every quarter of the year. Related Reading: USDC Market Cap Drops As Redemptions Climb To $1.4 Billion The number to be burned each quarter is determined by the price of BNB and the number of blocks mined on the BSC blockchain. With the circulating supply of BNB now at 153.8 million, the latest 24th burn represents 1.2% of the total supply. The initial total supply of BNB was 200 million BNB, but the supply is gradually decreasing due to the regular coin burn events. According to Binance, the auto-burn protocol will continue until its total supply is 100 million BNB. Earlier today, #Binance completed the 24th quarterly #BNB token burn of 1,991,854 BNB through BNB Auto-Burn. Not sure what the BNB Auto-Burn is? Give this a read 👇 https://t.co/C5wlki9Lmb — Binance (@binance) July 19, 2023 $480 Million In BNB Destroyed: The Impact On Price And Supply For BNB holders, token burns are usually a reason to celebrate since they reduce the total BNB supply and should make the cryptocurrency more valuable. In the days following the burn, the BNB price may increase slightly as the circulating supply drops. However, these price spikes are often temporary. At this time, the BNB price barely budged despite the burn.  BNB price fails to move despite latest burn &#124; Source: BNBUSD on TradingView.com After hitting an all-time high of around $600 in September 2021, BNB has declined along with the rest of the crypto market. At its peak, the market cap of BNB went over $90 billion, making it the third-largest cryptocurrency behind Bitcoin and Ethereum.  Now, the cryptocurrency has been ranging between $300 and $200 since the beginning of the year, bringing its market cap to $37.1 billion. With its current market cap, the coin is now the 5th-largest cryptocurrency after XRP overtook it to claim the fourth position.  With less BNB floating around, the remaining tokens should become more scarce and valuable. However, scheduled or routine coin burns tend to have a negligible impact on price over the long run, as evidenced by BNB’s performance over the last day.  Related Reading: ARK Invest CEO Says Firm Is Still Bullish On Coinbase Despite Selling COIN Stocks While the burn is meant to be a bullish event for BNB holders, the price hasn&#8217;t skyrocketed immediately as many investors had hoped. Considering the price of BNB is affected by various market conditions, past burns have had different outcomes on BNB.  The cryptocurrency is currently trading at $241.84 and is down by 2.39% over a 7-day timeframe. Trading volume in the past 24 hours is also down by 17.91% to $585 million. Featured image from Currency.com, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-19T15:52:26.000Z",
    "title": "Hedera DLT Powers Cross-Border Stablecoin Trial for Shinhan Bank and SCB Tech X",
    "url": "https://www.crypto-news-flash.com/hedera-dlt-powers-cross-border-stablecoin-trial-for-shinhan-bank-and-scb-tech-x/?utm_source=rss&utm_medium=rss&utm_campaign=hedera-dlt-powers-cross-border-stablecoin-trial-for-shinhan-bank-and-scb-tech-x",
    "description": "<img width=\"599\" height=\"443\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins.png 599w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-300x222.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-24x18.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-36x27.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-48x35.png 48w\" sizes=\"(max-width: 599px) 100vw, 599px\" />The Hedera native coin HBAR gained nearly 3 percent in the last 24 hours to trade around $0.0549 on Wednesday. The PoC pilot program is open to stablecoins issuers from Ethereum through EVM technology. The mainstream use of crypto assets and stablecoins has significantly Revolution Ed the banking industry in the past few years. More [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-19T15:44:06.000Z",
    "title": "Polkadot’s Remarkable Q2 Milestones: OpenGov and XCM V3 Unleashed, Propelling DOT Bonds to Parachain Slot Auction Lease Surge",
    "url": "https://www.crypto-news-flash.com/polkadots-remarkable-q2-milestones-opengov-and-xcm-v3-unleashed-propelling-dot-bonds-to-parachain-slot-auction-lease-surge/?utm_source=rss&utm_medium=rss&utm_campaign=polkadots-remarkable-q2-milestones-opengov-and-xcm-v3-unleashed-propelling-dot-bonds-to-parachain-slot-auction-lease-surge",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/12/AdobeStock_389442371-scaled.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polkadot\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/12/AdobeStock_389442371-scaled.jpeg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2020/12/AdobeStock_389442371-300x169.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/12/AdobeStock_389442371-1024x576.jpeg 1024w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Messari reports that in Q2 2023, Polkadot has achieved significant advancements.  Polkadot has strategic plans to introduce additional system parachains, asynchronous backing, and parathreads. Messari reports that in Q2 2023, Polkadot, a blockchain network designed to facilitate interconnected Layer-1 chains for specific applications, has achieved significant advancements. The network has successfully introduced OpenGov, a fully [...]"
  }
]