[
  {
    "source": "CoinDesk",
    "date": "2024-02-22T20:52:16.000Z",
    "title": "Reddit Discloses Holding Bitcoin and Ether in IPO Filing",
    "url": "https://www.coindesk.com/business/2024/02/22/reddit-discloses-holding-bitcoin-and-ether-in-ipo-filing/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Reddit has submitted a filing with the Securities and Exchange Commission (SEC) to go public on the New York Stock Exchange under the ticker symbol “RDDT.”"
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-22T20:44:55.000Z",
    "title": "How PubKey Revived Bitcoin Culture in New York City",
    "url": "https://www.coindesk.com/consensus-magazine/2024/02/22/how-pubkey-revived-bitcoin-culture-in-new-york-city/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "NYC-based Bitcoin enthusiasts, as well as the crypto-curious, now have a place to nerd out, discuss and learn about Bitcoin."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-22T20:56:53.000Z",
    "title": "Reddit Files to Go Public, Says It Invested in Bitcoin and Ethereum",
    "url": "https://decrypt.co/218602/reddit-files-go-public-invested-bitcoin-ethereum",
    "description": "Social media site Reddit wants to go public, an SEC filing shows. It also reveals that the company has Bitcoin and Ethereum."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-22T20:46:30.000Z",
    "title": " Ethereum price hits resistance at $3K, but data currently favors ETH bulls ",
    "url": "https://cointelegraph.com/news/ethereum-price-hits-resistance-at-3k-but-data-currently-favors-eth-bulls",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNDQyNmYzNmUtMWIwMS00N2Q2LTk0NzAtMjY2ODNhNzRlNzk3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ethereum price struggles at the $3,000 level, but data hints at a resumption of the bull trend.</p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) is currently wrestling with the $3,000 resistance level, following a remarkable 29.7% surge from Feb. 6 to Feb. 20. Analysts attribute ETH's recent gains to a decrease in supply, driven by growing demand for staking, decentralized finance (DeFi) applications, and the shrinking supply caused by the network's proof-of-stake <a href=\"https://cointelegraph.com/explained/ethereum-as-a-deflationary-asset-explained\">burn mechanism</a>. </p><p>While Ether’s rally to $3,000 is impressive, the real question is can the altcoin gather enough strength to reclaim the sought-after $3,300 level last seen in March 2022?</p><p>Crypto investor Ryan Sean Adams, sharing insights on X social network, suggests that \"Ethereum hasn't even hit its demand season yet.\" Adams speculates that the potential introduction of a spot <a href=\"https://cointelegraph.com/news/ether-etf-2024-approval-outlook-gensler-interview\">Ether exchange-traded fund</a> (ETF) could boost its price, especially in the absence of \"new supply.\" The supply data clearly shows a decrease of 18,960 ETH in total coins circulating over the past 30 days, according to ultrasound.money. It's essential to note that this metric doesn't necessarily reflect the ETH available for sale, which can be measured using net deposits on exchanges.</p><p><a href=\"https://cointelegraph.com/news/ethereum-price-hits-resistance-at-3k-but-data-currently-favors-eth-bulls\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-22T21:00:15.000Z",
    "title": "Reddit buys Bitcoin, Ethereum, and MATIC, reveals new IPO filing with the SEC",
    "url": "https://cryptobriefing.com/reddit-ipo-crypto-investment/",
    "description": "Reddit reveals Bitcoin, Ethereum, and MATIC investments in its SEC filing for an upcoming IPO."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-22T20:45:29.000Z",
    "title": "Lumerin Announces New Integration With Portal DEX for Decentralized Bitcoin Mining and Cross-Chain Hashpower Trading",
    "url": "https://news.bitcoin.com/lumerin-announces-new-integration-with-portal-dex-for-decentralized-bitcoin-mining-and-cross-chain-hashpower-trading/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/lumerin-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/lumerin-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/lumerin-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/lumerin-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/lumerin-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/lumerin-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/lumerin-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/lumerin.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. CHICAGO &#x2013; Feb 22, 2024 &#x2013; Lumerin, a decentralized Hashpower Marketplace built on Arbitrum that has built technology to make Bitcoin hashrate a liquid asset allowing for global access to peer-to-peer, decentralized hashrate trading, today announced a new integration with Portal, the first trust minimized, cross-chain swaps that involve no bridges, custody or [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-22T21:06:15.000Z",
    "title": "Coinbase challenges Nigeria’s governmental restriction claim",
    "url": "https://crypto.news/coinbase-nigeria-government-restrictions/",
    "description": "The Nigerian government has mandated telecom and internet service providers to restrict access to various crypto exchanges, including Binance, Coinbase, and Kraken. "
  },
  {
    "source": "BTCManager",
    "date": "2024-02-22T20:57:43.000Z",
    "title": "Do Kwon to contest US extradition in Montenegro ",
    "url": "https://crypto.news/do-kwon-united-states-extradition-montenegro/",
    "description": "Do Kwon’s extradition to the U.S. was decided on Feb. 21, but his attorneys are not surrendering arguments against the decision by a Montenegro High court."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-22T20:53:15.000Z",
    "title": "Bitcoin reaches an all-time high in 14 countries",
    "url": "https://crypto.news/bitcoin-btc-all-time-high/",
    "description": "Bitcoin has reached an all-time high in 14 countries, including Turkey, Argentina, Egypt, Pakistan, Nigeria, Japan, and Lebanon, despite trading 25% below its peak of $69,000."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-22T20:49:14.000Z",
    "title": "Valkyrie introduces Bitcoin Futures ETF offering 2x leverage",
    "url": "https://crypto.news/valkyrie-bitcoin-futures-etf-leverage/",
    "description": "Valkyrie Investments introduces BTFX, a 2x leveraged Bitcoin futures ETF aimed at doubling the daily performance of the CME Bitcoin Futures index."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-22T21:00:19.000Z",
    "title": "Paris Saint-Germain Becomes Trailblazing Validator On Chiliz Blockchain, Fueling 9% Rally In CHZ",
    "url": "https://www.newsbtc.com/chiliz-chz/paris-saint-germain-becomes-trailblazing-validator-on-chiliz-blockchain-fueling-9-rally-in-chz/",
    "description": "In a notable development that signifies the growing adoption of blockchain technology in the sports industry, Paris Saint-Germain (PSG) has announced its deepening partnership with Chiliz (CHZ), the Malta-based FinTech provider. PSG, one of the world&#8217;s most renowned football clubs, is set to become the first sports club to act as an official blockchain validator on the Chiliz Chain, a significant milestone for both organizations. Chiliz $1 Billion SportFi Ecosystem Attracts PSG According to Thursday&#8217;s announcement, the latest collaboration will see PSG play an important role in ensuring the security, accuracy, and reliability of the Chiliz chain. In particular, validators are essential to maintaining the integrity and operation of a blockchain network. Since its partnership with Chiliz in 2018, which led to the launch of the PSG Fan Token &#8211; the club&#8217;s official digital asset &#8211; PSG has become increasingly involved in adopting Web3 in sports. The club&#8217;s approach to Web3 innovation is further highlighted by the appointment of Pär Helgosson as the Head of Web3, a position dedicated to driving the club&#8217;s digital transformation. Related Reading: Bitcoin Long-Term Call: Analyst Predicts Price To Soar To $500,000 Per the announcement, the choice of Chiliz as the platform for this initiative is attributed to its robust $1 billion SportFi ecosystem, which attracts a large community of crypto-native sports fans.  Chiliz&#8217;s infrastructure and support for decentralized applications (dApps) have made it a preferred platform for over 50 web3 projects, showcasing its capacity to attract large Web3 products and services. Web3 Adoption In Sports To support the Chiliz Chain&#8217;s continued growth, PSG has pledged to use 100% of its accrued revenue as a validator to conduct regular buybacks of the PSG Fan Token from the public marketplace.  According to the announcement, these automated buybacks, executed through smart contracts or decentralized exchanges (DEXs) on the Chiliz chain, are expected to strengthen the club&#8217;s digital economy and regularly replenish its Fan Token reserves. In addition to its role as a validator, PSG and Chiliz will co-host their first-ever blockchain hackathon at the Parc Des Princes stadium in Paris, France, in the summer of 2024.  Alex Dreyfus, CEO of Chiliz and Socios.com, expressed his excitement about PSG&#8217;s involvement as an official validator, stating: This evolution marks a significant milestone in the adoption of web3 by fans, clubs, and leagues. PSG&#8217;s active role as an official validator will undoubtedly propel our SportFi ecosystem to new areas, furthering our long-standing partnership with the club. Pär Helgosson, Head of Web3 at Paris Saint-Germain, emphasized the club&#8217;s commitment to designing and shaping the future of web3 sports, stating:  Our commitment is to build a more empowered and sustainable web3 ecosystem, leveraging the solid foundation of our existing relationship with Socios and Chiliz. PSG is committed to fostering innovation, and the club will continue to develop opportunities with other partners in this space. CHZ Skyrockets To $1.13 Billion Market Cap Following the announcement on Thursday, the Chiliz native token CHZ, originally launched as an Ethereum-based ERC-20 token, has experienced a significant surge in its trading price, reaching $0.1283 and achieving a market capitalization of $1.13 billion. Related Reading: Green Bitcoin: Sustainable Energy Usage Surges To Record 55% High Since the beginning of Thursday, the token has continued its upward trend, witnessing a 9% price increase. This growth adds to the token&#8217;s sustained positive performance over longer periods, aligning with the overall market trend. Over the past seven and fourteen days, CHZ has demonstrated notable price increases of 19.5% and 25%, respectively. Moreover, within the last thirty days, it has experienced a remarkable surge of 32%, allowing the token to bridge the year-to-date gap. Despite a decline of approximately 6% over this timeframe, the recent surge has significantly mitigated the overall loss. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-22T21:00:15.000Z",
    "title": "Binance Announces Support for New Cross-Chain Crypto Gaming Project on Launchpool",
    "url": "https://dailyhodl.com/2024/02/22/binance-announces-support-for-new-cross-chain-crypto-gaming-project-on-launchpool/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/gaming-project-on-launchpool.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/gaming-project-on-launchpool.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/02/gaming-project-on-launchpool.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/gaming-project-on-launchpool.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/gaming-project-on-launchpool.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/gaming-project-on-launchpool.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/02/gaming-project-on-launchpool.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Binance plans to roll out support for a new cross-chain crypto gaming project via its Launchpool platform. The top global crypto exchange says the 47th Binance Launchpool project will be Portal (PORTAL), a project that aims to unite games from different blockchains on its cross-chain token platform. Launchpool allows users to stake coins to farm [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/22/binance-announces-support-for-new-cross-chain-crypto-gaming-project-on-launchpool/\">Binance Announces Support for New Cross-Chain Crypto Gaming Project on Launchpool</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-22T20:55:46.000Z",
    "title": "Crypto Trader Drops Gameplan for Upcoming Months, Says Altcoins Have Barely Even Woken Up",
    "url": "https://dailyhodl.com/2024/02/22/crypto-trader-drops-gameplan-for-upcoming-months-says-altcoins-have-barely-even-woken-up/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/meta-plans-nft.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/meta-plans-nft.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/meta-plans-nft.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/meta-plans-nft.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/meta-plans-nft.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/meta-plans-nft.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/meta-plans-nft.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is laying out his trading game plan for the time being. Crypto trader Michaël van de Poppe tells his nearly 700,000 followers on the social media platform X his strategy for the next 1-2 months. &#8220;The gameplan for the coming period: &#8211; Survive a potential Bitcoin (BTC) correction, as Bitcoin is at [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/22/crypto-trader-drops-gameplan-for-upcoming-months-says-altcoins-have-barely-even-woken-up/\">Crypto Trader Drops Gameplan for Upcoming Months, Says Altcoins Have Barely Even Woken Up</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]