[
  {
    "source": "Decrypt",
    "date": "2023-06-12T21:23:26.000Z",
    "title": "Reddit’s Crypto Communities Go Dark In Support of Protest Against API Changes",
    "url": "https://decrypt.co/144290/reddits-crypto-communities-go-dark-in-support-of-protest-against-api-changes",
    "description": "Crypto Twitter, meanwhile, carried on as usual."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-12T21:18:30.000Z",
    "title": "Binance US Lawyers Up, Braces for Looming Federal Charges",
    "url": "https://decrypt.co/144291/binance-us-lawyers-up-braces-for-looming-federal-charges",
    "description": "The American arm of the exchange giant is arming itself with top talent—including an ex-SEC attorney. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-12T21:25:16.000Z",
    "title": "Ripple expands Canadian engineering activities with U of Toronto XRP validator",
    "url": "https://cointelegraph.com/news/ripple-expands-canadian-engineering-activities-with-u-of-toronto-xrp-validator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/057ce0d9-0e0b-4fc5-b11d-79759354a9f9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Canada’s largest university is the third in the country to partner with Ripple’s University Blockchain Research Initiative.</p>\n                    <p><p>The University of Toronto plans to launch an independent XRP Ledger validator, Ripple <a href=\"https://ripple.com/insights/tapping-into-the-toronto-blockchain-community-with-ubri/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> June 12 as the university will become part of Ripple’s University Blockchain Research Initiative (UBRI). The partnership will support blockchain and crypto technology research at the university.</p><p>The partnership will also <a href=\"https://xrpl.org/ambassadors.html\" target=\"_blank\" rel=\"noopener nofollow\">advance</a> Ripple’s XRPL (XRP Ledger) Campus Ambassadors program that “aims to elevate the impact of college students […] [To] help educate other students about crypto and how to start building on the XRPL.” University of Toronto Professor Andreas Veneris commented:  </p><blockquote>“Hosting an XRP Ledger validator matches our goals in both promoting education around the XRP Ledger […] But also the public’s trust in scholars for their long-standing ethos to advance social wellbeing.”</blockquote><p>The University of Toronto, Canada’s largest university by enrollment, joins the University of Waterloo and Toronto Metropolitan University as Canadian UBRI participants. Ripple has invested $2 million in research in Canada in the past five years. In total, the UBRI has supported more than 45 universities in 20 countries, according to its website.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Now this is how mass adoption should work.<br><br>The University of Toronto, the largest university in Canada by enrollment, plans to start an independent <a href=\"https://twitter.com/search?q=%24XRP&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$XRP</a> ledger validator.<br>This new partnership with Ripple seeks to support the next generation of the crypto industry</p>&mdash; Cryptomom (@MsCryptomom1) <a href=\"https://twitter.com/MsCryptomom1/status/1668273884372582401?ref_src=twsrc%5Etfw\">June 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ripple opened an office in Toronto in July 2022 to serve as an engineering hub. That office has a staff of over 30 and employs summer interns. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/canada-s-central-bank-asks-citizens-what-they-want-in-a-digital-dollar\">Canada’s central bank asks citizens what they want in a digital dollar</a></em></strong></p><p>Ripple <a href=\"https://cointelegraph.com/news/ripple-sec-case-outcome\">is in a highly publicized legal conflict</a> with the United States Securities and Exchange Commission, but Canada has provided challenges as well. The country <a href=\"https://cointelegraph.com/news/new-canadian-rules-for-crypto-trading-platforms-leave-little-room-for-stablecoins\">introduced new crypto trading rules</a> in February that has shaken up the domestic crypto market, with dYdX, Paxos, Binance and Bybit among the companies choosing to close down their Canadian operations as a result. On the other hand, Canadian regulators <a href=\"https://cointelegraph.com/news/bitcoin-fomo-is-gone-portfolio-managers-are-taking-btc-seriously\">have approved several crypto</a> exchange traded funds recently. </p><p>Ripple is closely associated with XRP Ledger, the issuer of the XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) token.  </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\">Best and worst countries for crypto taxes — Plus crypto tax tips</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-12T21:36:56.000Z",
    "title": "BlockFi has to update wallet, platform before distributing funds",
    "url": "https://cryptoslate.com/blockfi-has-to-update-wallet-platform-before-distributing-funds/",
    "description": "<p>Bankrupt lending platform BlockFi said in a June 12 email that it must perform updates before it begins to distribute funds to users. Upgrades coming in summer BlockFi said that a June 9 court order determined that users own the assets in their wallet accounts and that the company can allow certain withdrawals. However, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/blockfi-has-to-update-wallet-platform-before-distributing-funds/\">BlockFi has to update wallet, platform before distributing funds</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-12T21:16:39.000Z",
    "title": "Bank of China subsidiary issues tokenized notes on Ethereum",
    "url": "https://cryptoslate.com/bank-of-china-subsidiary-issues-tokenized-notes-on-ethereum/",
    "description": "<p>A Chinese bank has issued tokenized notes on the Ethereum blockchain in collaboration with UBS Group, the latter firm said on June 12. Aurelian Troendle, Global Head of MTN Trading at UBS AG, said: &#8220;We are pleased to work with BOCI on this transaction to bring structured products onto a public blockchain network, supporting our [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bank-of-china-subsidiary-issues-tokenized-notes-on-ethereum/\">Bank of China subsidiary issues tokenized notes on Ethereum</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T21:21:28.000Z",
    "title": "Polygon zkEVM’s remarkable growth in TVL and transactions",
    "url": "https://www.cryptopolitan.com/polygon-zkevms-remarkable-growth-in-tvl/",
    "description": "The Total Value Locked (TVL) and transaction volume on Polygon&#8217;s zkEVM platform has increased significantly, demonstrating extraordinary growth. This increase lays the door for decreased costs and increased use of DeFi technologies. In May 2023, the scalable and secure blockchain platform Polygon zkEVM reversed the general trend of declining Total Value Locked (TVL). While most ... <a title=\"Polygon zkEVM&#8217;s remarkable growth in TVL and transactions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-zkevms-remarkable-growth-in-tvl/\" aria-label=\"More on Polygon zkEVM&#8217;s remarkable growth in TVL and transactions\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T21:20:25.000Z",
    "title": "Blockstream CEO Adam Back responds to US crypto pressure",
    "url": "https://crypto.news/blockstream-ceo-adam-back-responds-to-us-crypto-pressure/",
    "description": "Amid the mounting regulatory pressures on cryptocurrency exchanges, Blockstream CEO Adam Back highlights the inherent resilience and adaptability of the crypto industry."
  }
]