[
  {
    "source": "CoinDesk",
    "date": "2024-01-18T15:00:00.000Z",
    "title": "Protocol Village: COTI Allocates $25M Ecosystem Fund as Part of Transition to Ethereum Layer-2",
    "url": "https://www.coindesk.com/tech/2024/01/18/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Jan. 18-24."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-18T14:42:21.000Z",
    "title": " Manta Network experiences DDoS attack amid exchange listing ",
    "url": "https://cointelegraph.com/news/manta-network-experiences-ddos-attack-amid-exchange-listing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMDYzNDhlZjItZGVmOS00OWQ0LWJhNjQtMmVkYjZiZGRjZWZmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Over 135 million RPC requests flooded Manta blockchain's nodes on Thursday. </p>\n                    <p><p>Zero-knowledge proof powered layer-2 blockchain Manta Network <a href=\"https://twitter.com/superanonymousk/status/1747968680686993800\" target=\"_blank\" rel=\"noopener nofollow\">experienced</a> a widespread distributed denial-of-service (DDoS) attack amid a successful token listing on multiple exchanges.</p><p>As told by Kenny Li, co-founder of p0x labs, the cryptographic development team behind Manta Network, the blockchain's nodes experienced over 135 million remote procedure call (RPC) requests on Jan. 18. \"This is a very aggressive and timed attack,\" said Li, while stating that \"the blockchain is running safely\" and \"funds are safe.\" However, Li warned that \"communication between apps and the blockchain is severely limited\" for the time being. The co-founder commented:</p><p>The same day, Manta tokens began trading on multiple exchanges, including Binance, Bithumb, and Kucoin. At the time of publication, the Manta token is valued at $2.27, indicating a fully diluted market cap of $2.27 billion. Over $686 million worth of Manta <a href=\"https://coinmarketcap.com/currencies/manta-network/\" target=\"_blank\" rel=\"noopener nofollow\">exchanged</a> hands in the first few hours of trading.</p><p><a href=\"https://cointelegraph.com/news/manta-network-experiences-ddos-attack-amid-exchange-listing\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2024-01-18T15:03:36.000Z",
    "title": "AVALANCHE PRICE ANALYSIS & PREDICTION (January 18) –  Calm Before The Storm: Avax Signals More Bearish But Remains Indecisive",
    "url": "https://nulltx.com/avalanche-price-analysis-prediction-january-18-calm-before-the-storm-avax-signals-more-bearish-but-remains-indecisive/",
    "description": "Avax initiated a drop and decreased by almost 15% in the past weeks. It held the $35 level as support and remained indecisive above it. A drop from that level could slip the price back to the monthly low with a potential breakdown. Following multiple rejections in the past weeks, Avax’s [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-18T14:51:07.000Z",
    "title": "SOLANA PRICE ANALYSIS & PREDICTION (January 18) – Sol Fails To Retake $100 Following A Sligh Recovery, More Drops Lie Ahead",
    "url": "https://nulltx.com/solana-price-analysis-prediction-january-18-sol-fails-to-retake-100-following-a-sligh-recovery-more-drops-lie-ahead/",
    "description": "Solana’s price continued to fall by the day and has lost roughly 10% of its valuation in the last three weeks. It recently recovered from the monthly low but has found it difficult to push above a critical resistance. Since the price touched the $126.3 level in late December, Sol [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-18T15:00:00.000Z",
    "title": "ChatGPT meme coin price predictions: Dogecoin, Bonk, and Sponge",
    "url": "https://crypto.news/chatgpt-meme-coin-price-predictions-dogecoin-bonk-and-sponge/",
    "description": "In this article, ChatGPT predicts the price of Dogecoin, Bonk, Sponge V2, Snek, and WIF"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-18T14:53:10.000Z",
    "title": "New Web3 games to watch in 2024",
    "url": "https://crypto.news/new-web3-games-to-watch-in-2024/",
    "description": "Explore the thrilling universe of new Web3 games set to revolutionize the gaming landscape in 2024. With many analysts forecasting 2024 to be a landmark year for the blockchain gaming industry, an exciting wave of web3 gaming titles that have&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-18T15:00:00.000Z",
    "title": "Uniswap Unveils New Security Feature: Will It Boost UNI Demand?",
    "url": "https://www.newsbtc.com/news/uniswap/uniswap-unveils-new-security-feature-will-it-boost-uni-demand/",
    "description": "Uniswap Labs, the developer of Uniswap&#8211;a decentralized exchange, has introduced a new security feature called Permit2. Taking to X on January 18, the DEX developer said this update addresses the &#8220;infinite token allowances&#8221; vulnerability that hackers can exploit. This flaw risked user funds, and the new feature is meant to resolve this concern. Uniswap Sealing Infinite Token Allowance Risks In crypto, especially among decentralized finance (DeFi) protocols, the &#8220;token allowance&#8221; is permission initiated by the user granting smart contracts access to tokens. From there, assets can be moved. With this permission, it becomes possible for users to interact with dapps, chiefly protocols that utilize user funds. Some of these dapps include, for instance, decentralized exchanges like Uniswap or lending platforms like Aave or Maker.  Related Reading: Bitcoin Sees Massive Sell-Off From Miners, As Price Holds Steady While useful, &#8220;token allowance&#8221; can be exploited by hackers via &#8220;infinite token allowance,&#8221; where hackers can infinitely access and illegally withdraw funds from wallets, draining them as a result. Once a wallet has been compromised, it can be drained without the user&#8217;s knowledge since the compromised code already permits the hacker to move funds. Aware of this risk, Uniswap Labs is introducing the open-source Permit2 as a solution. The tool, the DEX developer says, will give users more protection and, more importantly, control over digital assets. A key feature of Permit2 is that users can set time limits on token approvals. Third parties can only access funds within a specific period in this arrangement.  Additionally, the tool introduces a reusable token approval for simplicity. With this feature, end users don&#8217;t have to repeatedly grant access to their funds for each transaction. On the gas-saving fronts, Uniswap Labs say Permit2 also utilizes signature-based approvals and transfers. This means the tool can reduce gas fees when users transfer tokens. Uniswap Building, UNI Remains Under Pressure This enhancement precedes the upcoming release of Uniswap v4, which introduces Hooks. This new feature provides developers with more flexibility and control over their applications. Related Reading: Why Is Bitcoin Price Trading Sideways? 3 Key Factors Analysts say the launch of Uniswap v4 and Uniswap Labs&#8217; continuous enhancement to improve security might cement the DEX&#8217;s position. According to DeFiLlama data, Uniswap has managed over $4.4 billion worth of assets. Even so, UNI prices continue to struggle.  Looking at the daily chart, UNI has resistance at around $8.1 and is currently down roughly 20% from December highs. Sharp losses below $6 might trigger a sell-off, forcing the token towards $4.5 or lower.  Feature image from Canva, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-18T14:42:45.000Z",
    "title": "Deus X Capital and Fabiano Consulting to Power Bitcoin Mining Companies",
    "url": "https://www.crypto-news-flash.com/deus-x-capital-and-fabiano-consulting-to-power-bitcoin-mining-companies/?utm_source=rss&utm_medium=rss&utm_campaign=deus-x-capital-and-fabiano-consulting-to-power-bitcoin-mining-companies",
    "description": "<img width=\"1200\" height=\"600\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-rdne-stock-project-8369687.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coins-Bitcoin-seeded-ground\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-rdne-stock-project-8369687.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-rdne-stock-project-8369687-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-rdne-stock-project-8369687-768x384.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-rdne-stock-project-8369687-150x75.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-rdne-stock-project-8369687-450x225.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Deus X Capital and Fabiano Consulting are partnering to strategically drive Bitcoin mining by offering comprehensive financing and advice. The collaboration seeks to strengthen mining companies in the face of competition by providing financial and strategic solutions for sustainable success. This partnership between Deus X Capital and Fabiano Consulting represents a strategic move in Bitcoin [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-18T14:42:09.000Z",
    "title": "Sui Foundation and Oracle Stork Raise the Standard for Blockchain Trading",
    "url": "https://www.crypto-news-flash.com/sui-foundation-and-oracle-stork-raise-the-standard-for-blockchain-trading/?utm_source=rss&utm_medium=rss&utm_campaign=sui-foundation-and-oracle-stork-raise-the-standard-for-blockchain-trading",
    "description": "<img width=\"1200\" height=\"600\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-alesia-kozik-6770609.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"pexels-alesia-kozik\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-alesia-kozik-6770609.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-alesia-kozik-6770609-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-alesia-kozik-6770609-768x384.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-alesia-kozik-6770609-150x75.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-alesia-kozik-6770609-450x225.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Strategic alliance between Sui Foundation and Oracle Stork strengthens efficiency and accuracy in blockchain operations. Oracle Stork excels with ultra-fast pricing updates and the introduction of branded pricing, innovating the market. The strategic alliance between Sui Foundation and Oracle Stork marks a milestone in the blockchain landscape, focused on boosting speed and access to crucial [...]"
  }
]