[
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T18:46:55.000Z",
    "title": "Cristiano Ronaldo joins forces with Binance for exclusive NFT collaboration",
    "url": "https://www.cryptopolitan.com/cristiano-ronaldo-joins-forces-with-binance/",
    "description": "Cristiano Ronaldo, a soccer legend, has teamed up with Binance in a ground-breaking multi-year partnership centered on nonfungible tokens (NFTs). Through the Binance NFT exchange, this cooperation intends to uniquely introduce NFTs and promote Web3 technology to Ronaldo&#8217;s passionate global fan base. Recently ronaldo held an online meet and chat with some holders of the ... <a title=\"Cristiano Ronaldo joins forces with Binance for exclusive NFT collaboration\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cristiano-ronaldo-joins-forces-with-binance/\" aria-label=\"More on Cristiano Ronaldo joins forces with Binance for exclusive NFT collaboration\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T18:43:07.000Z",
    "title": "Cardano price analysis: ADA rallies to $0.3790 as bulls continue progress",
    "url": "https://www.cryptopolitan.com/cardano-price-analysis-2023-05-29/",
    "description": "The latest Cardano price analysis indicates that bulls are continuing to make progress. The buying pressure has pushed ADA up to $0.3790, a 0.22 per cent increase in the last 24 hours. ADA opened today&#8217;s trading session at $0.3774 and moved higher to face resistance at $0.3859 before retracing slightly below the $0.3800 level. The ... <a title=\"Cardano price analysis: ADA rallies to $0.3790 as bulls continue progress\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-analysis-2023-05-29/\" aria-label=\"More on Cardano price analysis: ADA rallies to $0.3790 as bulls continue progress\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-29T19:03:13.000Z",
    "title": "BKEX suspends withdrawals amid money laundering probe",
    "url": "https://crypto.news/bkex-suspends-withdrawals-amid-money-laundering-probe/",
    "description": "BKEX, a cryptocurrency exchange, has suspended withdrawals of user funds as it looks into claims that the platform was used for money laundering."
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-29T19:00:03.000Z",
    "title": "Bearish Sentiment Hits EOS As Bulls Lose Control, What Lies Ahead?",
    "url": "https://www.newsbtc.com/news/eos/bearish-sentiment-hits-eos-as-bulls-lose-control-what-lies-ahead/",
    "description": "EOS Network, a popular open-source blockchain platform prioritizing high performance and security, has recently witnessed a sharp price decline. The asset exhibits bearish sentiment in the 30-Day timeframe.  Related Reading: The Best Decision Is To ‘Buy Bitcoin (BTC),’ Robert Kiyosaki Urges The EOS price is down by 14.19% in its one-month data from CoinMarketCap. This suggests that the bears have controlled the market since the last 30 days trading session. This shift in market sentiment raises questions about what lies ahead for EOS.   EOS Faces High Bearish Momentum, Further Price Decline, or Potential Reversal? The bearish sentiment and the loss of control by the bulls have had a noticeable effect on EOS&#8217;s price. The cryptocurrency has experienced a downward trend, with declining trading volumes and increased selling pressure.  Notably, the 24-hour trading volume is declining by 13.29% today, May 29, 2023, and its market cap is down by 1.32%. As of the time of writing, the price of EOS is down by 1.28%, at $0.89. This trend reflects a shift in market dynamics as investors become more cautious and start to sell their EOS holdings. Despite the prevailing bearish sentiment, potential catalysts could alter the trajectory for EOS. On May 26, the EOS network shared potential bullish news about its partnership with Hypha DAO and an initiative dubbed Beta Program.  EOS network claims that the Beta program will offer a range of pre-configured templates designed to meet different firms&#8217; needs and objectives. Generally, this news may lead to a positive market impact on the EOS price and market sentiment. EOS&#8217;s positive development and partnership can attract new buyers and increase demand, increasing prices. Also, Fear of Missing Out (FOMO), a psychological phenomenon, can create a buying frenzy and drive the price even higher quickly. EOS Price Formed Double Bottom Pattern In that sense, the EOS/USDT has formed a double-bottom chart pattern, suggesting a potential uptrend movement soon. The double bottom pattern is a bullish reversal pattern that typically forms after a prolonged asset price decline. Confirming the double bottom pattern occurs when the asset&#8217;s price breaks above the resistance level formed by the peak between the two bottoms. This breakout confirms the reversal signal and suggests a higher probability of an upcoming uptrend. Related Reading: JPMorgan Predicts Bitcoin (BTC) To Revisit $45,000, Here’s Why EOS has an important resistance level at $0.931, which represents a significant blockage for possible bullish movement. Bollinger Bands and MACD Signal Potential Trend Reversal The asset is currently oscillating between the upper band and middle band of the Bollinger Band indicator. This suggests an increase in the buying pressure and a rising bullish momentum. In addition, the Moving Average Convergence/Divergence (MACD) is currently above its signal line, suggesting bullish momentum. This indicates that the buyers are gradually taking over the market, and there might be a potential trend reversal soon. As seen in the chart above, the histogram is above zero and has strong green bars, further confirming the bullish sentiment in the market. Featured image from Pixabay and chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-29T18:45:55.000Z",
    "title": "$31,800,000,000,000 Debt Ceiling Could Be Raised as President Biden Nears Deal",
    "url": "https://dailyhodl.com/2023/05/29/31800000000000-debt-ceiling-could-be-raised-as-president-biden-nears-deal/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/white-house-signs.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/white-house-signs.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/03/white-house-signs.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/03/white-house-signs.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/03/white-house-signs.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/03/white-house-signs.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/03/white-house-signs.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The US government&#8217;s debt ceiling is about to be raised now that President Joe Biden has reached a tentative deal with Speaker McCarthy. Biden says in a tweet that he had reached an agreement with McCarthy on a potential budget &#8220;in principle.&#8221; &#8220;Earlier this evening, Speaker McCarthy and I reached a budget agreement in principle. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/29/31800000000000-debt-ceiling-could-be-raised-as-president-biden-nears-deal/\">$31,800,000,000,000 Debt Ceiling Could Be Raised as President Biden Nears Deal</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-29T18:41:25.000Z",
    "title": "Analyst Says Bitcoin (BTC) in Very Early Bull Market As Technical Pattern Forms – Here’s His Outlook",
    "url": "https://dailyhodl.com/2023/05/29/analyst-says-bitcoin-btc-in-very-early-bull-market-as-technical-pattern-forms-heres-his-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Could-Trigger-Next-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Could-Trigger-Next-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Could-Trigger-Next-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Could-Trigger-Next-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Could-Trigger-Next-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Could-Trigger-Next-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Could-Trigger-Next-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says the largest crypto asset by market cap is in the first inning of its next bull market. Pseudonymous crypto trader Rekt Capital tells their 345,800 Twitter followers that Bitcoin (BTC) is in the early stages of a bull run. Further contextualizing their claim, Rekt provides a chart detailing BTC breaking out [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/29/analyst-says-bitcoin-btc-in-very-early-bull-market-as-technical-pattern-forms-heres-his-outlook/\">Analyst Says Bitcoin (BTC) in Very Early Bull Market As Technical Pattern Forms – Here’s His Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]