[
  {
    "source": "Cointelegraph",
    "date": "2023-08-28T13:17:20.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Laos decided to cut the electricity supply for crypto mining firms as the ongoing drought impacted the country's power generation. Just over two weeks since its launch on Coinbase's Base network, critics of the decentralized social media app Friend.tech are already heralding the app's potential demise. Meanwhile, PayPal USD stablecoin has attracted limited adoption and defunct crypto exchange FTX has announced a cybersecurity breach involving its bankruptcy case claims agent, Kroll, in which limited, nonsensitive customer data of specific claimants was exposed.</p><h2>Laos drought pulls the plug on crypto mining electricity supply</h2><p>Laos state-owned electricity distribution company Électricité du Laos (EDL) decided to suspend electricity supply for crypto mining operations in the country as drought conditions in the region negatively impacted power generation.</p><p>Laos experienced drought in the first half of 2023. The extreme heat resulted in higher demand for electricity and caused hydropower plants to struggle to generate enough power.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2e610795-d67f-4c11-bcbe-abaaab21a5bd.png\"  /><figcaption style=\"text-align: center;\"><em>Official announcement of suspension of electricity supply to crypto mining projects. Source: Électricité du Laos</em></figcaption></figure><p>Moreover, the EDL said that hydropower plants generate 95% of the country’s power, and it aims to supply electricity locally and export large volumes to Thailand in 2024.</p><h3>Friend.tech critics call app ‘dead’ after volume, activity plummets </h3><p>Less than three weeks after its launch, the decentralized social network Friend.tech has already been declared “dead” by critics <a href=\"https://cointelegraph.com/news/friendtech-pronounced-dead-inflows-activity-declines\">following a recent drop in key metrics</a> such as activity, inflows and volume.</p><p>The decentralized app, which is hosted on Coinbase’s Base network, saw record highs around Aug. 21, when daily fees peaked at $1.7 million and transactions hit 525,000 on the same day. </p><p>However, recent data shows that the fees have since dropped 87% to around $215,000 on Aug. 26, <a href=\"https://defillama.com/fees/friend.tech\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to DefiLlama, while Dune Analytics data shows the app recorded over 51,000 transactions on Aug. 27, down 90% from its peak. </p><p>In an Aug. 27 X post, Coinbase payments risk manager Lisandro Rodriguez opined that the platform is “dead” due to “greed and poor execution.” Another pointed to the recent metrics, simply commenting “RIP Friendtech August 2023 - August 2023.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Friend tech is dead because of greed and poor execution. We can see that after the initial influencer pump volume has fallen off a cliff. Let&#39;s dig into how this failure came to be  <a href=\"https://t.co/WDQncTQJ21\">pic.twitter.com/WDQncTQJ21</a></p>&mdash; Lisandro (@TheRealLisandro) <a href=\"https://twitter.com/TheRealLisandro/status/1695598059491582405?ref_src=twsrc%5Etfw\">August 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Last week, crypto commentator Yazan told Cointelegraph of factors that led him to believe Friend.tech had between <a href=\"https://cointelegraph.com/news/friendtech-social-media-app-how-long-will-it-last\">six to eight weeks</a> before it would see a decline in user key prices and activity.</p><h3>PayPal’s stablecoin sees limited uptake post-launch</h3><p>The launch of PayPal’s stablecoin, PayPal USD (<a href=\"https://cointelegraph.com/paypal-pyusd-price-index\">PYUSD</a>), has been met with <a href=\"https://cointelegraph.com/news/paypal-pyusd-stablecoin-struggles-with-adoption-nansen\">limited adoption so far</a>, according to on-chain data compiled by Nansen.</p><p><a href=\"https://cointelegraph.com/news/paypal-launches-stablecoin-for-payment\">Since launching on Aug. 7</a>, roughly 90% of PayPal USD is still held by Paxos Trust, the stablecoin’s issuer. Only 7% of the total supply of PYUSD is held on exchanges like Kraken, Gate.io and Crypto.com. In other words, the coin isn’t circulating on exchanges and has seen limited adoption by crypto users.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/avz4_Msc9aE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Excluding contracts and exchanges, only 10 holders have amassed over $1,000 worth of PYUSD, Nansen said. Adoption among so-called “smart money” investors, a term used to describe institutions and professional traders, is negligible. </p><p>PayPal has over 350 million users, and the launch of a stablecoin was supposed to be a seminal moment for crypto adoption. So far, that hasn’t materialized.</p><p>“On the surface there’s a lack of demand from crypto users for PYUSD when other alternatives exist (might be due to Paypal targeting a different demographic),” Nansen said.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-28T13:19:02.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Consolidates, Ahead of Key Week of US Economic Announcements",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-consolidates-ahead-of-key-week-of-us-economic-announcements/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1919079245-2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Consolidates, Ahead of Key Week of US Economic Announcements\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1919079245-2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1919079245-2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1919079245-2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1919079245-2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1919079245-2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1919079245-2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1919079245-2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin hovered below $26,000 on Monday, as traders awaited a big week of economic announcements in the United States. The consumer confidence report will be released on Tuesday, with gross domestic product and nonfarm payrolls coming in the upcoming days. Ethereum was largely unchanged today. Bitcoin Bitcoin started the week hovering around the $26,000 region, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T13:36:43.000Z",
    "title": "Generative AI is revolutionizing the modern workplace and how businesses and employees can prepare",
    "url": "https://www.cryptopolitan.com/generative-ai-reshapes-the-modern-workplace/",
    "description": "As technological advancements reshape the modern business landscape, generative artificial intelligence (AI) has emerged as a transformative tool with unparalleled potential. According to PwC&#8217;s 2023 Global Hopes &#38; Fears Survey, 52% of respondents believe that generative AI will positively impact their work. From automating tedious tasks to refining employee benefits programs, generative AI promises to ... <a title=\"Generative AI is revolutionizing the modern workplace and how businesses and employees can prepare\" class=\"read-more\" href=\"https://www.cryptopolitan.com/generative-ai-reshapes-the-modern-workplace/\" aria-label=\"More on Generative AI is revolutionizing the modern workplace and how businesses and employees can prepare\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T13:14:46.000Z",
    "title": "Venezuelan President calls for global de-dollarization amid BRICS summit",
    "url": "https://www.cryptopolitan.com/venezuelan-president-calls-for-global-de-dollarization-amid-brics-summit/",
    "description": "Venezuelan President Nicolas Maduro has urged for the de-dollarization of the global economy, citing the difficulties that the current dollar-dominated system imposes on emerging countries affected by U.S. sanctions. The call was made during Venezuela&#8217;s participation in the recent BRICS summit held in Johannesburg, South Africa. A push for financial independence Maduro&#8217;s message to the ... <a title=\"Venezuelan President calls for global de-dollarization amid BRICS summit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/venezuelan-president-calls-for-global-de-dollarization-amid-brics-summit/\" aria-label=\"More on Venezuelan President calls for global de-dollarization amid BRICS summit\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-28T13:10:08.000Z",
    "title": "OnlyFans Parent Company Buys $20 Million Worth of Ethereum – A Boost To ETH Price?",
    "url": "https://www.newsbtc.com/news/onlyfans-parent-company-buys-20-million-worth-of-ethereum-fueling-surge/",
    "description": "OnlyFans, the well-known adult content subscription platform, has made a bold move into the world of cryptocurrencies. Its parent company, Fenix International, recently revealed its significant investment of nearly $20 million in Ether (ETH) in 2022.  According to official financial filings submitted to the UK corporate registry, Fenix International acquired nearly $20 million worth of ETH over a two-year period. While the company&#8217;s investment in Ether demonstrates its progressive approach, it wasn&#8217;t immune to the market&#8217;s inherent volatility. By the end of November 2022, the value of Ether had plummeted by $8.5 million, leading to an impairment loss on the investment. The remaining carrying amount of Ethereum stands at $11.434 million, reflecting the broader trends and uncertainties in the cryptocurrency market. Related Reading: Worldcoin Meltdown: 50% Crash Caused By Mounting Data Privacy Paranoia OnlyFans Ventures Beyond Traditional Offerings The move to invest in Ether aligns with OnlyFans&#8217; broader strategy of diversification and technological innovation. Investing in intangible assets with an “indefinite useful life” showcases the company&#8217;s willingness to embrace emerging technologies like blockchain, positioning itself at the forefront of industry trends. The disclosure about Fenix&#8217;s acquiring a substantial amount of Ether has not seemed to provide a lift yet to the price of the crypto. At the time of writing, ETH was trading at $1,636, down -0.8% in the last 24 hours, and sustaining a slight 2.2% loss in the last seven days, data from crypto market tracker Coingecko shows. The financial filings offer a glimpse into OnlyFans&#8217; multi-faceted performance. Despite the challenges posed by its cryptocurrency investment, the company reported impressive financial results for the year ending November 2022.  Source: SignHouse With revenue surpassing the $1 billion mark, driven by an influx of over 50 million new users and more than a million content creators, OnlyFans solidified its position as a revenue-generating powerhouse. Users collectively spent an astounding $5.5 billion on the platform. OnlyFans Pioneers NFT Integration And Celebrity Trading Cards Leonid Radvinsky, the visionary entrepreneur of Ukrainian origin who acquired OnlyFans in 2018, has reaped the rewards of the platform&#8217;s surging popularity. The filings unveil that Radvinsky amassed dividends approximating $485 million since the inception of the previous year, in line with the escalating demand for OnlyFans&#8217; offerings. This recent crypto venture is not the company&#8217;s first stride into the digital asset domain. In early 2022, OnlyFans facilitated a pioneering move by enabling verified creators to replace their profile pictures with Ethereum-based non-fungible tokens (NFTs). Bitcoin slides back into the $25K region. Chart: TradingView.com Related Reading: XRP Faces Big Challenge: Scaling The $0.55 Wall – Possible? Moreover, in June of the same year, former OnlyFans executives unveiled Zoop, a celebrity trading card platform leveraging the Ethereum scaling solution Polygon. Zoop allowed users to trade 3D digital playing cards depicting their favorite celebrities. The disclosure of Fenix International&#8217;s Ethereum holdings dovetailed with an industry-wide trend, as adult content creators began flocking to Friend.tech, a decentralized social media platform rooted in the cryptocurrency realm. This rush underscores how crypto’s recent surge has not only captured financial markets&#8217; attention but also influenced sectors far beyond conventional investments. Featured image from Verità e Affari"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-28T13:30:56.000Z",
    "title": "Cardano Price Prediction: Will ADA rally to $0.50? QUBE Showing Bullish Sign",
    "url": "https://www.crypto-news-flash.com/cardano-price-prediction-will-ada-rally-to-0-50-qube-showing-bullish-sign/",
    "description": "<img width=\"512\" height=\"331\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-100.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-100.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-100-300x194.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />If you are looking to start your cryptocurrency journey, the crypto market currently has a lot to offer you. If analysts are to be believed, the two cryptocurrencies that are currently exhibiting bullish momentum are Cardano and InQubeta (QUBE). Experts have suggested that Cardano has the potential to rally to $0.50 in the coming months. [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-28T13:25:00.000Z",
    "title": "Shibarium Scaling Final Update Goes Live: Dev Announcement",
    "url": "https://coinedition.com/shibarium-scaling-final-update-goes-live-dev-announcement/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Shytoshi Kusama, the lead developer of the Shiba Inu ecosystem released an official blog post announcing the final update of the layer 2 blockchain scaling solution, Shibarium, on Monday. The lead developer conveyed the team’s gratitude to the blockchain platforms that supported the network including Polygon and Unification, and revealed Shibarium’s milestones of over 65,000 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/shibarium-scaling-final-update-goes-live-dev-announcement/\">Shibarium Scaling Final Update Goes Live: Dev Announcement</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]