[
  {
    "source": "NewsBTC",
    "date": "2023-09-20T03:00:28.000Z",
    "title": "Grayscale CEO Highlights US Opportunity To Lead Crypto Space Through Regulation",
    "url": "https://www.newsbtc.com/crypto/grayscale-ceo-highlights-us-opportunity-to-lead-crypto-space-through-regulation/",
    "description": "The chief executive of Grayscale, a leading digital asset management firm, believes that the United States has a significant opportunity to dominate the cryptocurrency space by shaping effective regulations.  In a recent interview with Yahoo Finance, Grayscale CEO Michael Sonnenshein expressed optimism about the progress made in the past year and highlighted the bipartisan support for crypto-related legislation.  Sonnenshein emphasized the importance of lawmakers&#8217; understanding of the crypto industry and urged Congress to actively engage with the issue to foster innovation and create robust financial and regulatory frameworks. Grayscale CEO Urges Congress To Support Crypto Sonnenshein commended the “groundbreaking” work done by regulators and lawmakers in Washington over the past 12 months, acknowledging the efforts of Chairman McHenry, Congressman Hill, and Senators Lummis and Gillibrand.  Related Reading: Bitcoin HODLers Not Selling, Will Number Break Record Highs? The Grayscale CEO emphasized that crypto has become a nonpartisan issue, with members of Congress increasingly recognizing its long-term presence and importance. Sonnenshein praised the bills that have made progress and are set for further votes in the fall, highlighting the need for broader member support and ongoing engagement on crypto-related topics. Moreover, Sonnenshein underscored the growing involvement of constituents who are part of the crypto space and stressed the importance of elected officials aligning their positions accordingly.  With upcoming elections and various catalysts on the horizon, Sonnenshein urged members of Congress to actively engage with the crypto industry, given its increasing significance and the need for comprehensive financial and regulatory frameworks, expressing optimism about the current momentum surrounding crypto legislation and the unprecedented level of engagement from lawmakers. Grayscale&#8217;s GBTC Inches Closer To ETF Conversion? Regarding the recent court order that vacated the SEC&#8217;s denial order for the Grayscale Bitcoin Trust (GBTC) application to convert to an Exchange-Traded Fund (ETF), Sonnenshein addressed the ongoing process and emphasized the organization&#8217;s commitment to full and fair disclosures.  Grayscale has been litigating to convert GBTC into an Bitcoin (BTC) Spot ETF, as it would provide investors with additional protections, disclosures, and reporting obligations.  On this matter, Sonnenshein stated that constructive dialogue with the SEC is anticipated once the 45-day process is complete, and the organization looks forward to pursuing the next steps expediently. Furthermore, Sonnenshein highlighted the significant recognition given to the crypto industry by global entities such as the G20 and the International Monetary Fund (IMF), emphasizing the opportunity for the United States to establish itself as the center of the global capital markets ecosystem by implementing the right frameworks.  Notably, Sonnenshein advocated for maintaining an open-door policy for innovation and positioning the US as a leader in the crypto space. Related Reading: Here’s Where Next Bitcoin Resistance Lies, From An On-Chain Perspective Overall, Grayscale CEO Michael Sonnenshein&#8217;s interview emphasized the United States&#8217; chance to dominate the crypto space through effective regulation. With bipartisan support and increasing awareness among lawmakers, Sonnenshein urged Congress to engage actively and build momentum around crypto-related legislation.  Featured image from iStock, chart from TradingView.com"
  }
]