[
  {
    "source": "Decrypt",
    "date": "2023-09-19T20:02:26.000Z",
    "title": "Rollbit Coin Tumbles 5% as Crypto Infleuncer Gainzy Swaps Sponsorship to Stake",
    "url": "https://decrypt.co/197848/rollbit-coin-tumbles-5-as-crypto-infleuncer-gainzy-swaps-sponsorship-to-stake",
    "description": "The Drake-backed platform is now home to a notable Crypto Twitter influencer."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-19T19:52:59.000Z",
    "title": "What the Next Fed Meeting Could Mean For Bitcoin",
    "url": "https://decrypt.co/197834/what-the-next-fed-meeting-could-mean-for-bitcoin",
    "description": "The Fed is expected to keep interest rates flat, which could spark optimism among crypto and stock investors. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-19T19:58:36.000Z",
    "title": "Chamber of Digital Commerce launches Digital Power Network miners’ coalition",
    "url": "https://cointelegraph.com/news/chamber-digital-commerce-launches-bitcoindigital-power-network-miners-coalition",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/e7664a31-137b-4e48-81c0-6bd37136f8b7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The new advocacy group already represents over half the country’s Bitcoin hash rate and will seek to shape energy policy and champion Bitcoin and blockchain.</p>\n                    <p><p>Cryptocurrency miners have a new voice in Washington with the launch of the Digital Power Network (DPN), a new coalition affiliated with the Chamber of Digital Commerce. The network is off to a promising start, with many of the United States’ biggest miners on board.</p><p>The DPN is the first affiliate of the Chamber, and shares many of the same team members. Its origins stretch back to the Chamber’s Mining Initiative, which “pioneering the introduction of the first pro-proof-of-work resolution in the U.S. House of Representatives.” </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/6ef16d1f-c020-4378-a443-46aec03ecc5e.png\"><figcaption style=\"text-align: center;\">Rep. Pete Sessions' resolution on proof-of-work crypto mining. Source: govinfo.gov</figcaption></figure><p>Alena Ricci, vice present of marketing at the Chamber and head of marketing at the DPN, explained to Cointelegraph that the resolution was <a href=\"https://www.govinfo.gov/content/pkg/BILLS-118hres238ih/pdf/BILLS-118hres238ih.pdf\" target=\"_blank\" rel=\"noopener nofollow\">submitted</a> by Texas congressman Pete Sessions in March. “Bitcoin Mining will play a critical role in rebuilding energy independence in the USA,” <a href=\"https://cointelegraph.com/news/bitcoin-mining-could-be-good-for-us-energy-independence-research\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-mining-could-be-good-for-us-energy-independence-research/amp\">Sessions tweeted</a> at the time.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/cheap-micro-bitcoin-miners-fight-btc-mining-concentration-inventors-argue\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cheap-micro-bitcoin-miners-fight-btc-mining-concentration-inventors-argue/amp\">Micro $3 Bitcoin miners won’t make bank, but that’s not the point — Inventors</a></em></strong></p><p>The DPN is debuting with 11 members – Argo, BitDigital, BitFarms, Coinmint, Cipher Mining, DigitHost, Hive, Marathon, Riot, Sustainable Bitcoin Protocol and Terawulf. Together they represent over 50% of the U.S. Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) hash rate, the DPN said. According to a statement:</p><blockquote>“The Digital Power Network spearheads policy advocacy for digital asset mining and shapes the future of energy policy. Its mission is to champion Bitcoin and blockchain technology to revolutionize energy markets.”</blockquote><p>The DPN has its work cut out for it. A bill reintroduced into Congress in March, prior to Sessions’ resolution, <a href=\"https://cointelegraph.com/news/senators-renew-call-for-epa-investigation-of-crypto-mining-emissions-data\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/senators-renew-call-for-epa-investigation-of-crypto-mining-emissions-data/amp\">would require</a> the Environmental Protection Agency to investigate crypto miners. The Biden Administration included a 30% tax on electricity used by crypto miners in its FY2024 budget, although that proposal <a href=\"https://cointelegraph.com/news/is-biden-s-controversial-bitcoin-mining-tax-dead-or-set-to-rise-from-the-ashes\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/is-biden-s-controversial-bitcoin-mining-tax-dead-or-set-to-rise-from-the-ashes/amp\">may have been dropped</a>. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Exciting News!<br><br>Today, we're thrilled to announce the launch of <a href=\"https://twitter.com/DigitalPowerUS?ref_src=twsrc%5Etfw\">@digitalpowerUS</a>, a visionary consortium that's set to revolutionize the energy landscape!  Representing over 50% of U.S. <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&ref_src=twsrc%5Etfw\">#Bitcoin</a> Hash Rate, this initiative is a game-changer for the future of energy policy. <a href=\"https://t.co/8wtpRy1dyD\">pic.twitter.com/8wtpRy1dyD</a></p>— Perianne (@PerianneDC) <a href=\"https://twitter.com/PerianneDC/status/1704141437619585469?ref_src=twsrc%5Etfw\">September 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p> The DPN will work alongside the Digital Energy Council, a lobbying group <a href=\"https://cointelegraph.com/news/crypto-mining-lobby-digital-energy-council-launched-in-united-states\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-mining-lobby-digital-energy-council-launched-in-united-states/amp\">founded in August</a> by former Chamber director of energy policy Thomas Mapes. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-19T19:50:30.000Z",
    "title": "Judge rejects SEC’s request to inspect Binance.US’ software, technical infrastructure",
    "url": "https://cryptoslate.com/judge-rejects-secs-request-to-inspect-binanceus-software/",
    "description": "<p>Courts have rejected the U.S. Securities and Exchange Commission&#8217;s request to inspect Binance.US&#8217; systems, Bloomberg reported on Sept. 19. The SEC did not succeed in convincing Federal Magistrate Judge Zia Faruqui to immediately permit an inspection of the Binance.US&#8217; software and technical infrastructure. The judge said he was not &#8220;inclined to allow the inspection at [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/judge-rejects-secs-request-to-inspect-binanceus-software/\">Judge rejects SEC&#8217;s request to inspect Binance.US&#8217; software, technical infrastructure</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-09-19T19:47:22.000Z",
    "title": "Yield Platform Freeway Misused $160 Million in Customer Funds, Court Filing Says",
    "url": "https://cryptobriefing.com/investors-160million-freeway-supercharger-issues/?utm_source=feed&utm_medium=rss",
    "description": "Over 5,000 investors have deposited $160 million into Freeway's program and can't access their funds."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-19T20:00:16.000Z",
    "title": "PayPal’s PYUSD Report Provides Valuable Insight Into The Stablecoin’s Performance So Far",
    "url": "https://www.newsbtc.com/stablecoin/paypal-pyusd-stablecoin-report/",
    "description": "A new report has shown that the adoption of PayPal’s PYUSD stablecoin has seen less than favorable adoption rates since its inception. The crypto community remains skeptical about employing the new stablecoin for daily crypto payments and has opted for top competitor stablecoins like USDT and USDC.  PYUSD Experiences Sluggish Adoption Rate Global payments giant PayPal released its transparency report for its stablecoin, PYUSD, and the analysis of the report reveals that the PYUSD stablecoin may not be seeing as much adoption as PayPal and PYUSD stablecoin issuer, Paxos hoped for.  Paypal launched the US dollar-backed stablecoin on August 7 which was designed to increase stablecoin offerings and facilitate the adoption of crypto payments to crypto users as well as consumers and merchants actively utilizing PayPal’s financial platform globally. Related Reading: Ripple CTO Explains Company’s Stance On Debunking Outrageous XRP Price Predictions However, despite coming from one of the largest players in the payments space, the PYUSD stablecoin remains a relatively small player in the cryptocurrency market, especially when compared to industry heavyweights like Tether (USDT) and USD Coin (USDC). A Kaiko analyst, Desislava Aubert stated to Decrypt that despite being listed on prominent exchange platforms like Coinbase and Huobi Global, the PYUSD stablecoin’s adoption rate has been progressing slowly, and its daily trade volumes have been fairly low.  “PYUSD was listed on some centralized exchanges in late August, notably Coinbase and Kraken, but its daily trading volume has been volatile and significantly lower than other stablecoins. Overall, this points to sluggish demand,” Aubert stated.  The PayPal USD stablecoin was issued by Paxos Trust Company, a technology company specializing in blockchain in August. Paxos has reported that it holds $45.3 million in assets supporting the PYUSD stablecoin.  The stablecoin is also reportedly backed with over $1.5 million in cash deposits. The majority of the coin’s reserves, approximately $43.8 million have been collateralized with the US Treasuries as reverse purchase agreements.  Currently, PYUSD has a market capitalization of $44 million, suggesting that the stablecoin’s adoption rate has been subpar due to its failure to catch and retain the attention of the crypto community.  Crypto Investors Opt For Top Stablecoins The decline in acceptance and adoption of the PYUSD may be attributed to the unfamiliarity of the cryptocurrency as a new stablecoin. The stablecoin market is also heavily saturated with well-established cryptocurrencies like USDT, USDC, and others.  Given this, a large number of crypto investors are presently opting for these top stablecoins to facilitate their cryptocurrency transactions. This is further propelled by the fact that these stablecoins have created a considerable reputation for themselves over the years due to their reliability and sustainability. Related Reading: Incoming Milestone Could Be Very Bullish For XRP Price, Here’s Why Presently, USDT has a market capitalization of over $83 billion and USDC has a market cap of $26 billion. At the time of writing, USDT stablecoin’s 24-hour trading volume is over $22 billion as compared to PYUSD stablecoin’s 24-hour trading volume of only $3.2 million.  Despite PYUSD’s sluggish adoption rate, PayPal remains committed to its cryptocurrency ventures. The payment giant has expanded into different regions globally using its brand name and reliable reputation as an international financial service provider to facilitate crypto adoption and awareness among users in different countries. PayPal's stablecoin maintains dollar peg &#124; Source: PYUSD/USD on Tradingview.com Featured image from Blockzeit, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-19T20:00:35.000Z",
    "title": "Benjamin Cowen Outlines Bitcoin Forecast, Says BTC Setting Up for Likely Rejection at Resistance",
    "url": "https://dailyhodl.com/2023/09/19/benjamin-cowen-outlines-bitcoin-forecast-says-btc-setting-up-for-likely-rejection-at-resistance/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/cowen-outlines-says-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/cowen-outlines-says-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/cowen-outlines-says-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/cowen-outlines-says-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/cowen-outlines-says-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/cowen-outlines-says-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/cowen-outlines-says-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto strategist Benjamin Cowen believes that Bitcoin (BTC) will continue on a downward trend for months after retesting a key price range. Cowen tells his 787,000 YouTube subscribers that Bitcoin will likely move upward in the short term to test its bull market support band only to decline afterward, confirming the larger bearish trend. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/19/benjamin-cowen-outlines-bitcoin-forecast-says-btc-setting-up-for-likely-rejection-at-resistance/\">Benjamin Cowen Outlines Bitcoin Forecast, Says BTC Setting Up for Likely Rejection at Resistance</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-19T19:55:35.000Z",
    "title": "Chainlink Creator Sergey Nazarov Says Value From TradFi Can Now Flow Into Public Blockchain Industry",
    "url": "https://dailyhodl.com/2023/09/19/chainlink-creator-sergey-nazarov-says-value-from-tradfi-can-now-flow-into-public-blockchain-industry/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/stanford-new-blockchain.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/stanford-new-blockchain.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/03/stanford-new-blockchain.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/03/stanford-new-blockchain.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/03/stanford-new-blockchain.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/03/stanford-new-blockchain.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/03/stanford-new-blockchain.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Sergey Nazarov, creator of Chainlink (LINK), says recent experiments have proved that banks and traditional financial institutions can now connect to hundreds of different blockchains easily. In a new interview with Jill Malandrino, a reporter for Nasdaq, Nazarov touches on a recent Chainlink-based experiment conducted by SWIFT, and a group of banking giants including Citi, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/19/chainlink-creator-sergey-nazarov-says-value-from-tradfi-can-now-flow-into-public-blockchain-industry/\">Chainlink Creator Sergey Nazarov Says Value From TradFi Can Now Flow Into Public Blockchain Industry</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]