[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-24T13:48:23.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-24T13:44:09.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $17.27 with a 24-hour trading volume of $130,897,839. Solana is up 4.96% in the last 24 hours. The current CoinMarketCap ranking is #10, with a live market cap of $1,273,881,101. It has a circulating supply of 394,890,490 SOL coins and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-24T13:43:40.000Z",
    "title": "Landmark victory: Hermes secures permanent ban on ‘MetaBirkin’ NFT sales in US lawsuit",
    "url": "https://www.cryptopolitan.com/hermes-gets-permanent-ban-on-metabirkin-nfts/",
    "description": "On Friday, a federal judge in Manhattan accepted Hermes&#8217; plea to permanently halt artist Mason Rothschild&#8217;s sales of &#8220;MetaBirkin&#8221; non-fungible tokens after a jury found that they infringed upon the French luxury brand&#8217;s trademark rights in its well-known Birkin handbags. Federal judge injuncts MetaBirkin NFT sales According to US District Judge Jed Rakoff, the permanent ... <a title=\"Landmark victory: Hermes secures permanent ban on &#8216;MetaBirkin&#8217; NFT sales in US lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hermes-gets-permanent-ban-on-metabirkin-nfts/\" aria-label=\"More on Landmark victory: Hermes secures permanent ban on &#8216;MetaBirkin&#8217; NFT sales in US lawsuit\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-24T14:00:59.000Z",
    "title": "Cardano Shows Strong Signs Of Recovery According To Avorak AI",
    "url": "https://nulltx.com/cardano-shows-strong-signs-of-recovery-according-to-avorak-ai/",
    "description": "Cardano’s recent price movement has driven the attention of enthusiasts. The crypto project shows signs of recovery after falling drastically at the height of regulatory scrutiny. This is despite technical traders sighting a death cross formation on the daily chart that potentially indicates prices are about to fall. The project found its way amid clashes [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-24T14:07:14.000Z",
    "title": "Stacks (STX) Rallies By 29% In The Past 7 Days – Here’s Why",
    "url": "https://www.newsbtc.com/news/stacks-stx-rallies-by-29-in-the-past-7-days-heres-why/",
    "description": "The cryptocurrency Stacks (STX) has recently experienced a remarkable turnaround, with its price bouncing back after reaching a multi-month low of $0.4412. Investors have seized the opportunity to &#8220;buy the dip,&#8221; resulting in a continuous upward trend for STX over the past few days. As a result, STX is now trading at $0.7916, marking a significant 29% increase from its lowest level this month. Potential Catalysts For STX Two primary reasons drive the surge in Stacks&#8217; price. Firstly, the decision by Blackrock to file for a Bitcoin exchange-traded fund (ETF) with the US Securities and Exchange Commission has sparked positive sentiment. However, uncertainties remain regarding the acceptance of the iShares Bitcoin Trust, as Coinbase is slated to serve as the custodian of the coins. Furthermore, the ongoing conflict between Coinbase and the SEC adds to the regulatory uncertainty surrounding the situation. Related Readings: Bitcoin Just Gained Over 18% In Seven Days: What’s Happened When This Has Occurred In The Past? Furthermore, the SEC&#8217;s lawsuit against major exchanges Binance and Coinbase is expected to benefit Bitcoin, as both regulatory agencies recognize Bitcoin as a commodity rather than a security. Consequently, many investors in alternative cryptocurrencies may shift their focus to the perceived safety of Bitcoin. Stacks, which is closely tied to Bitcoin&#8217;s ecosystem and enables the development of decentralized applications (dApps), stands to benefit from this changing investor sentiment. The expanding Stacks ecosystem is another significant factor contributing to the rise in STX price. Bitflow Finance, a decentralized finance (DeFi) protocol, recently introduced an sBTC/sBTC stableswap pool, enabling seamless token swaps. This development enhances the utility and adoption of Stacks, ultimately bolstering its positive price performance. What’s Next For Stacks? From a technical analysis standpoint, Stacks exhibits promising signals. The daily chart reveals the formation of a bullish falling wedge pattern, indicating a potential trend reversal. STX has also surpassed the 25-day exponential moving average and is currently testing the 50-day MA. Moreover, the breakthrough of the key resistance level at $0.5281, the lowest point in March, further reinforces the bullish sentiment. As buyers set their sights on the next resistance point at $0.90, a potential 9% increase from the current level, Stacks continues to attract attention. Related Readings: Mask Foundation Moves 2.5 Million Tokens To Exchanges, Huge Dip Incoming? The Stacks price is $0.79 at press time, reflecting a change of -2.10% over the past 24 hours. The recent price action has left Stacks&#8217; market capitalization at $1,101,401,654.52. Notably, Stacks has demonstrated an impressive 277.22% change since the beginning of the year, indicating its strong growth potential. STX serves as the native token of the Stacks blockchain, which operates as a layer 2 blockchain network leveraging the security of the Bitcoin blockchain for transaction settlement. With its unique positioning and robust ecosystem, Stacks continues to capture the attention of investors and developers alike. Featured image from iStock.com and charts from Tradingview and Coingecko.com"
  }
]