[
  {
    "source": "CoinDesk",
    "date": "2023-08-09T14:24:42.000Z",
    "title": "Grimes Made More Money With NFTs Than in Her Entire Music Career: Wired",
    "url": "https://www.coindesk.com/web3/2023/08/09/grimes-made-more-money-with-nfts-than-in-her-entire-music-career-wired/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "In a recent interview, the artist claimed that she hopes that NFTs and crypto can “come back” to help compensate digital artists."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-09T14:10:32.000Z",
    "title": "Galaxy Digital Stems Q2 Losses Thanks to Resurging Bitcoin Prices",
    "url": "https://decrypt.co/151855/galaxy-digital-stems-q2-losses-thanks-resurging-bitcoin-prices",
    "description": "Galaxy Digital reported a substantial reduction in net loss last quarter, narrowing by over $500 million year-to-year to reach $46 million."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-09T14:16:34.000Z",
    "title": "What will Bitcoin do if the Justice Department takes aim at Binance?",
    "url": "https://cointelegraph.com/news/bitcoin-justice-department-binance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/cf57abdc-aa80-4c06-91b5-9136788e24f3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>If the U.S. DOJ indicts Binance executives on charges similar to those already issued by regulators, could it have an unusual effect on the cryptocurrency market in the year ahead? </p>\n                    <p><p>In early August, sources leaked word that officials with the United State Department of Justice were considering <a href=\"https://cointelegraph.com/news/us-doj-concerned-binance-run-prosecutors-fraud-charges\">fraud charges aimed at Binance</a>, the world’s largest cryptocurrency exchange. However, they indicated, officials are worried that it could cause a run on the market akin to the November 2022 collapse of FTX.</p><p>Those concerns have not deterred the <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">Securities and Exchange Commission</a> or the <a href=\"https://cointelegraph.com/news/binance-and-cz-sued-by-cftc-over-us-regulatory-violations\">Commodity Futures Trading Commission</a> from levying their own charges against Binance, which in part accused the exchange and its founder, Changpeng “CZ” Zhao, of allowing Americans to use products they are prohibited from accessing and of manipulating trading volume with a market-maker called Sigma Chain that Zhao “owned and controlled.”</p><p>To put the numbers in perspective, at the time of writing, Binance had <a href=\"https://coinmarketcap.com/rankings/exchanges/\" target=\"_blank\" rel=\"noopener nofollow\">facilitated</a> $7 billion in trading volume over the preceding 24-hour period. Coinbase facilitated a relatively paltry $970 million, while KuCoin — another well-known exchange — fell short of $350 million.</p><p>With markets in flux and lingering questions over whether central banks will pull off a “soft landing” for the global economy in the months ahead, it’s fair to wonder what the implications might be if law enforcement joins regulators in targeting Binance. For feedback, we asked a number of Cointelegraph staffers for their thoughts — and how they plan to handle their own investments if the Justice Department does file charges against Binance or its executives.</p><p><strong>Cointelegraph: How do you think the market will respond if the DOJ issues charges related to Binance? Are you going to be buying or selling when that happens? And where do you think the price of Bitcoin will stand on Dec. 31?</strong></p><p><strong>Joe Hall, reporter: </strong>Bitcoin will likely drop if the Justice Department issues charges related to Binance, and the broader crypto industry might faceplant. But the need for sound, decentralized, censorship-resistant money is global: Bitcoin buyers in Africa, Europe and Latin America will gobble up the dip. Personally, I’m going to keep asking myself (and my Bitcoin node): <em>Will there only ever be 21 million Bitcoin?</em> If the answer is “Yes,” then I will continue to earn, save and spend in Bitcoin. (Spoiler alert, the answer is “Yes.”)</p><p><strong>BTC Price on Dec. 31? </strong>$38,000. Dr. Adam Back, Paolo Ardoino (chief technology officer of Bitfinex/Tether) and Giacomo Zucco (a Bitcoin consultant) have all told me they believe Bitcoin will be above $35,000 by the end of this year. They’re pretty smart Bitcoin people. How high the price could go before the halving is anyone’s guess, but it does feel (for the umpteenth time) that sentiment toward Bitcoin is slowly warming up.</p><p><strong>Tom Blackstone, reporter: </strong>In my experience, news like this has very little impact on the market long-term, for three reasons. First, charges don’t mean much unless there is a conviction, and trials can take a very long time. Second, if one exchange goes down, another one will pop up to replace it. Third, crypto is too useful for consumers to give up, and interest in it is growing organically as more people learn about it. So, I think it will continue to be a good investment regardless of the news cycle.</p><p><strong>BTC Price on Dec. 31? </strong>On a chart, Bitcoin has support at $15,300 and resistance at $41,000, so I would expect its price to be in that range by the end of the year.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/demand-driving-bitcoin-price-to-130k\"><strong><em>Demand is driving the price of Bitcoin to $130K</em></strong></a></p><p><strong>Jonathan DeYoung, senior copy editor: </strong>My investment thesis is to hold on for dear life and hope that the market continues to grow over the medium to long term. I rarely, if ever, even look at what I’ve saved. I try to forget it exists, and crypto pretty much never enters my brain when I think about financial planning for the near term. This offers me a level of psychological insolation from market-moving events, such as might be the case if Binance were charged.</p><p><strong>BTC Price on Dec. 31? </strong>Now <em>that</em> I have no particular thoughts on.</p><p><strong>Cassio Gusson, reporter for Cointelegraph Brasil:</strong> It will be a big blow to the market. There will likely be an asset drain from Binance, and this will greatly damage the exchange’s image globally. This will affect the price of Bitcoin and the entire system of assets on BNB Chain. There will likely be a new crash similar to what happened with Terra, with several investors withdrawing assets in protocol staking on BNB Chain, withdrawing assets from Binance and in exchange-related products such as PancakeSwap.</p><p>I’ll be selling on the day it happens. I’ll be buying in the next 48 hours after the event has already reached its bottom and buyers resume trading.</p><p><strong>BTC Price on Dec. 31?</strong><strong> </strong>I don’t think it will be more than $40,000. There are studies that show that the impact of Bitcoin’s halving is decreasing. We could reach $40,000 if the Securities and Exchange Commission approves a Bitcoin spot ETF. Otherwise, a maximum of $35,000.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-etfs-even-worse-for-crypto-than-central-exchanges\"><strong><em>Bitcoin ETFs: Even worse for crypto than central exchanges</em></strong></a></p><p><strong>Kristina Lucrezia Corner, editor-in-chief: </strong>In the nascent landscape of the blockchain market, accusations leveled against major players like Binance send shockwaves through the whole industry and its closely-knit community. And these allegations not only target specific individuals but also challenge the overall credibility and reputation of our sector. What follows is a dynamic process akin to a seismic event, reshaping perceptions and redefining power dynamics within the ecosystem.</p><p>But these shockwaves aren’t just disruptive; they foster growth and transformation, reinforcing the industry’s values, unearthing its concealed resources, and nurturing sustainability and positive change. Amid challenges, the blockchain sector emerges stronger, fortified by its ability to embrace improvements and navigate vulnerabilities. And so does Bitcoin.</p><p><strong>BTC Price on Dec. 31? </strong>For me personally, the value of Bitcoin is felt not as absolute numbers but rather as a comparative value with the strength of other currencies we use, and I strongly believe that in this sense, its value will only continue to grow, even while maintaining its volatility. If, on Dec. 31, one Bitcoin can buy one Tesla Model 3 [<a href=\"https://www.tesla.com/model3\" target=\"_blank\" rel=\"noopener nofollow\">$32,740</a> after a tax credit, as of Aug. 8], I will even forgive Elon Musk for giving up on the bird. Maybe. (This is not investment or moral advice!)</p><p><strong>Felix Ng, editor: </strong>I’ve seen enough companies collapse to know that nothing and no one is “too big to fail,” crypto firm or not. That being said, it still seems unlikely that such charges would completely shut down crypto’s biggest exchange.</p><p>However, charges for Binance would likely cause a dip in crypto prices and a shifting of funds to other exchanges or cold wallets. Another exchange could rocket up to the top position. It’s happened throughout the history of crypto. If there is a sharp dip, I’ll be buying.</p><p><strong>BTC Price on Dec. 31? </strong>Finger in the air? $32,000. The Christmas period has historically been a positive one for Bitcoin, so assuming BTC trades mostly sideways for the next six months, we should get a little spike near Christmas.</p><p><strong>Marcel Pechman, reporter: </strong>Binance (mostly) doesn’t operate in the U.S., so the impact, if any, will be minimal. The BitMEX case, which was very similar, resulted in $100 million in fines and house arrest for the founders, and that’s it. Sure, there might be additional steps for U.S. market makers currently operating on Binance international, and U.S. citizens will be forced to use a VPN at all times when using the exchange, which may reduce volumes by 20%–30% max. Other than that, if Bitcoin plunges solely due to Binance’s case, it’s a buying opportunity.</p><p>In my opinion, Tether remains the most significant risk for the ecosystem, as there’s literally zero use for a stablecoin without fiat gateways (in theory).</p><p><strong>BTC Price on Dec. 31?</strong> No idea. Seriously. I always bet on prices staying the same for zero to six months. My guess is that an ETF approval could cause between 50% and 130% gains in two months, so if we start at $30,000, we could get to $69,000.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blacks-misguided-crypto-dummies-etf\"><strong><em>BlackRock’s misguided effort to create ‘Crypto for Dummies’</em></strong></a></p><p><strong>Ray Salmond, head of markets: </strong><em>If</em> significant enforcement action came from the DOJ, to the extent of a Red Notice being issued for CZ’s arrest or Binance being shuttered — even temporarily — I think this would have a sharp, negative impact on the broader crypto market and Bitcoin’s price. I’ve been looking at the Bitcoin price chart literally every day for more than six years, and I’ve been buying the entire time. I dollar cost average — and I no longer use derivatives heavily — so I’m agnostic to price and beyond any emotional shock from Binance blowing up and the impact it could have on crypto.</p><p>I pretty much view any sharp downside move in BTC and ETH as an accumulation opportunity. I also always use 1 BTC as a trading instrument, where I sell it at micro tops and rebuy at swing lows, so most of my Bitcoin has no cost beyond the cost of taxes on trading. For this reason, my risk tolerance might be different than other investors, and any sharp dip in BTC price is something I view as an opportunity. Somehow, this magic money always finds a way to go back up.</p><p><strong>BTC Price on Dec. 31? </strong>I don’t have any. The current trading range is too tight. We’re still within that range, and volatility is at a multiyear low.</p><p><strong>Arijit Sarkar, editor: </strong>If the Justice Department drops charges against Binance, there will be a momentary price drop because of panic sellers. But it won’t have a long-term effect. When Mt. Gox collapsed, people thought it was the end of Bitcoin because the exchange was managing 80% of the in-circulation BTC. But we’re here having the same discussion a decade later.</p><p>I’m not going to panic sell even if the price drops. I’m going to silently accumulate more Bitcoin and wait for the bull market to reap the rewards of patience.</p><p><strong>BTC Price on Dec. 31? </strong>Bitcoin’s historical performance indicates something around the $25,000 mark. I’m expecting it to momentarily fall in the third and fourth quarters of 2023, mainly due to rising regulatory hurdles, the government’s growing affinity toward central bank digital currencies and the ongoing concern of ecosystem collapses.</p><p>However, this is all par for the course prior to the halving in April 2024. Bitcoin’s price has shot up every time we’ve had a halving event. I’m utilizing the next three quarters to dollar cost average and accumulate as many Bitcoin/sats as possible.</p><p><strong>Rudy Takala, opinion editor: </strong>Altcoins look appealing right now. Coins like Algorand are 5%–10% off their all-time lows. They could sink a little before the market picks up, but that’s more likely to be a product of time capitulation than of panic sellers reacting to a Binance indictment or any other news event. I doubt most tokens will drop more than 30% from here, regardless of what happens.</p><p><strong>BTC Price on Dec. 31? </strong>$32,500. The only thing I’m going to regret is that I didn’t buy more. (But our readers may have regrets if they take my word for it.)</p><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-09T14:28:39.000Z",
    "title": "Nigeria’s Bank Association Wants Binance Out Over Added Strain to Naira",
    "url": "https://cryptobriefing.com/nigerias-bank-association-wants-binance/?utm_source=feed&utm_medium=rss",
    "description": "Nigeria's Association of Bureaux De Change Operators, cites Binance's influence as a potential stressor on the naira, pushing for its ban."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-09T14:28:30.000Z",
    "title": "Microsoft and Aptos Labs Join Forces to Accelerate Web3’s Mainstream Journey",
    "url": "https://www.cryptoglobe.com/latest/2023/08/microsoft-and-aptos-labs-join-forces-to-accelerate-web3s-mainstream-journey/",
    "description": "Microsoft and Aptos Labs have announced a collaborative endeavor to integrate Microsoft’s Azure OpenAI Service, thereby accelerating the mainstream adoption of web3 technologies. Aptos Labs, co-founded by Mo Shaikh and Avery Ching, has been at the forefront of blockchain innovation, having raised over $400 million from industry stalwarts like a16z, Jump Crypto, and Apollo Global. […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T14:35:30.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T14:32:28.000Z",
    "title": "Best Bovada Bonus Codes for 2023 – $3,750 Casino Bonus, Reload Offers & More",
    "url": "https://www.cryptopolitan.com/best-bovada-bonus-codes-for-2023-3750-casino-bonus-reload-offers-more/",
    "description": "If you&#8217;re looking for the best Bovada bonus codes, use the promo code BTCCWB1250 to get a 125% bonus up to $1,250 that you can claim 3 times. List of all the Bovada bonus codes available right now: Heads up about our links! Adblock might get confused so please disable it if you have any ... <a title=\"Best Bovada Bonus Codes for 2023 – $3,750 Casino Bonus, Reload Offers &#38; More\" class=\"read-more\" href=\"https://www.cryptopolitan.com/best-bovada-bonus-codes-for-2023-3750-casino-bonus-reload-offers-more/\" aria-label=\"More on Best Bovada Bonus Codes for 2023 – $3,750 Casino Bonus, Reload Offers &#38; More\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T14:11:18.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 How much is Bitcoin (BTC) worth? Today, the price of Bitcoin stands at $29,911, with a 24-hour trading volume totalling $38.62 billion. It boasts a market capitalization of $564 billion and commands 48.09% of the cryptocurrency market. Over the past day, Bitcoin’s price experienced an increase of 0.35%. Currently, there are ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-09T14:34:40.000Z",
    "title": "Stablecoin Market Predicted to Reach $2.8 Trillion from $125 Billion in Five Years, Says Bernstein Research",
    "url": "https://www.crypto-news-flash.com/stablecoin-market-predicted-to-reach-2-8-trillion-from-125-billion-in-five-years-says-bernstein-research/?utm_source=rss&utm_medium=rss&utm_campaign=stablecoin-market-predicted-to-reach-2-8-trillion-from-125-billion-in-five-years-says-bernstein-research",
    "description": "<img width=\"599\" height=\"443\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Surprisingly, despite the SEC&#039;s lawsuit against issuer Paxos as part of its crackdown on crypto, Binance USD (BUSD) received an &#039;A&#039; rating from Bluechip.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins.png 599w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-300x222.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-24x18.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-36x27.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-48x35.png 48w\" sizes=\"(max-width: 599px) 100vw, 599px\" />Berstein&#8217;s research report notes that the stablecoin market has the potential to grow 22 times in just the next five years. PayPal&#8217;s launch of PYUSD stablecoin comes at the right time and will create enough room for the payments giant in this expanding stablecoin market. In its latest research report published on Wednesday, August 9, [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-09T14:30:24.000Z",
    "title": "Analytics Firm Reveals Massive Imbalance in Wealth Distribution Among Ethereum and Dogecoin Holders",
    "url": "https://dailyhodl.com/2023/08/09/analytics-firm-reveals-massive-imbalance-in-wealth-distribution-among-ethereum-and-dogecoin-holders/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Reveals-Massive-Imbalance-in-Wealth.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Reveals-Massive-Imbalance-in-Wealth.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Reveals-Massive-Imbalance-in-Wealth.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Reveals-Massive-Imbalance-in-Wealth.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Reveals-Massive-Imbalance-in-Wealth.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Reveals-Massive-Imbalance-in-Wealth.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Reveals-Massive-Imbalance-in-Wealth.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New data from IntoTheBlock suggests there exists a huge imbalance in the distribution of wealth for the Ethereum (ETH) and Dogecoin (DOGE) ecosystems. The firm says that about 80% of the supply of both ETH and DOGE are owned by just about 0.01% of the total addresses holding the tokens. By comparison, 0.32% of Bitcoin [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/09/analytics-firm-reveals-massive-imbalance-in-wealth-distribution-among-ethereum-and-dogecoin-holders/\">Analytics Firm Reveals Massive Imbalance in Wealth Distribution Among Ethereum and Dogecoin Holders</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]