[
  {
    "source": "CoinDesk",
    "date": "2023-10-10T10:10:02.000Z",
    "title": "Hamas-Linked Crypto Accounts Frozen by Israeli Police, With Binance's Help: Report",
    "url": "https://www.coindesk.com/policy/2023/10/10/hamas-linked-crypto-accounts-frozen-by-israeli-police-with-binances-help-report/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Israeli authorities had previously seized around 190 Binance accounts with alleged ties to terrorist groups."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-10T10:28:55.000Z",
    "title": "Israel Authorities Freeze Hamas-Linked Crypto Accounts on Binance",
    "url": "https://decrypt.co/200837/israel-authorities-freeze-hamas-linked-crypto-accounts-binance",
    "description": "Israeli authorities, in coordination with the crypto exchange Binance, froze accounts suspected with suspected links to Hamas."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-10T10:30:42.000Z",
    "title": "Rise of the shrimp and crabs: Small-scale bitcoin owners on the increase",
    "url": "https://cryptoslate.com/insights/rise-of-the-shrimps-and-crabs-small-scale-bitcoin-owners-on-the-increase/",
    "description": "<p>Quick Take Recent data analysis reveals that, as the BTC on exchange balance continues to dwindle, now currently sitting at roughly 2.3 million, there&#8217;s a concurrent rise in the balance size of the smaller ownership groups, specifically the &#8220;shrimps&#8221; and &#8220;crabs.&#8221; These crypto creatures own less than 1 and 10 BTC, respectively. Currently, exchange balance [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/rise-of-the-shrimps-and-crabs-small-scale-bitcoin-owners-on-the-increase/\">Rise of the shrimp and crabs: Small-scale bitcoin owners on the increase</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-10T10:31:05.000Z",
    "title": "Generative AI Hype to Cool Down with Impending Reality Checks",
    "url": "https://www.cryptopolitan.com/generative-ai-hype-cool-down-reality-checks/",
    "description": "In a sobering revelation, CCS Insight&#8217;s annual predictions for the technology industry in 2024 foresee a harsh reality check for the once-buzzy generative artificial intelligence space. Analysts from the firm suggest that the fervor surrounding generative AI is set to face a substantial slowdown in 2024, highlighting escalating costs, regulatory pressures, and the intricate challenges ... <a title=\"Generative AI Hype to Cool Down with Impending Reality Checks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/generative-ai-hype-cool-down-reality-checks/\" aria-label=\"More on Generative AI Hype to Cool Down with Impending Reality Checks\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-10T10:33:38.000Z",
    "title": "Bitcoin traders decimated by $112m of liquidations",
    "url": "https://crypto.news/bitcoin-traders-decimated-by-112m-of-liquidations/",
    "description": "Over the past 24 hours, 41,186 Bitcoin traders were liquidated according to data from Coinglass."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-10T10:30:35.000Z",
    "title": "Bitcoin And Crypto Poised To Skyrocket As Endgame Of US Policy Nears: Analyst",
    "url": "https://www.newsbtc.com/news/us-policy-endgame-bitcoin-crypto/",
    "description": "The intricacies of US monetary policy have been placed under the microscope by Jordi Alexander, CIO of Selini Capital, who today offered an incisive analysis of the potential ripple effects these policies may have on the Bitcoin and crypto market. Drawing correlations between traditional financial mechanisms and the nascent digital asset landscape, his commentary elucidates a series of complex market dynamics that every investor should be aware of. At the crux of Alexander&#8217;s argument is his observation that the Federal Reserve&#8217;s approach to handling current economic conditions might be nearing an inflection point. As reported by NewsBTC, there are growing concerns in the bond market. Bonds with maturities exceeding 10 years have seen a decline of 46% from their highest value in March 2020. Moreover, the 30-year bonds have fared even more poorly, with a drop of 53%. Alexander remarked, &#8220;Haven&#8217;t expressed macro views in a while &#8211; but as things are about to really start moving &#8211; its time. I spent months analyzing the endgame of US policy. The outcome I saw is now coming into view. Gradually at first.. then all at once, the Fed will poo-poo in their pampers. &#8221; Why QE Might Be Back Sooner Than Later The analyst perceives the recent shifts in the bond market, especially concerning long-term bonds, as a precursor to potential policy changes. To back this up, Alexander is referencing Nick Timiraos of the Wall Street Journal who recently highlighted a specific sentiment from the Dallas Fed President Lorie Logan that is indicative of this shift. Related Reading: Bitcoin Trader Shares The “Only Chart” You Need To Profit From BTC In 2024 Logan has begun to express reservations about the earlier hawkish stance of the Federal Open Market Committee (FOMC), largely due to the recent surges in Treasury yields and term premiums. Her concerns emphasize the tug-of-war between the need for restrictive financial conditions to bring inflation down and the current strength of the labor market and overall economic output. Remarkably, Logan believes that the reasons for the tightening of financial conditions, especially those connected with the recent surges in Treasury yields and term premiums, might reduce the necessity to raise the fed funds rate. Commenting on this U-turn by the Fed&#8217;s Logan, Alexander argues, &#8220;This is the Bat-Signal I have been waiting for. What does it mean? Why is the Dallas Fed president in the top tweet doing a big baby U-turn? Because they are starting to realize they are losing control of the bond market!&#8221; Expanding on the nuances of the bond market, Alexander emphasized the distinction between the front and back ends of the curve. He stated, &#8220;The front of the curve, such as T-bills &#38; 2-year bonds, are generally very responsive to rate guidance by the Fed&#8230; But the Fed never has as good control over the back end- especially 30-year bonds.&#8221; Alexander’s analysis points towards a decelerating demand for these long-term bonds, suggesting a potential loss of market control by the Federal Reserve. This evolving bond market scenario places the Federal Reserve in a precarious situation. Alexander, elaborating on this potential dilemma, posits, &#8220;What if they agree to stop raising rates or even initiate cuts, but bond buyers still don&#8217;t show up?&#8221; He further speculated on a possible shift &#8211; the endgame &#8211; in the Federal Reserve&#8217;s approach: &#8220;Placed between a rock and a hard place, the Fed might be pushed towards Yield Curve Control,&#8221; hinting at a reversion to Quantitative Easing (QE) policies. Related Reading: Binance CEO Foresees Monumental Bitcoin Price Shift Following Halving Drawing a parallel to the Japanese financial scenario, Alexander prophesied, &#8220;The USD could very well be the casualty of this policy direction, much like the Yen&#8217;s predicament in Japan.&#8221; He then connected these macroeconomic shifts to the digital asset space, forecasting, &#8220;Goodbye Quantitative Tightening, hello my old friend Mr. QE. The timeline is uncertain, but it is time to start paying attention to term premium, like the Dallas Fed!&#8221; Bitcoin And Crypto Could Profit Massively Ultimately, QE is something that Bitcoin and cryptocurrencies have benefited tremendously from in the last bull market. Alexander therefore also predicts &#8220;yes your internet coins [aka Bitcoin and crypto] could then benefit&#8221;. Remarkably, this view is shared by several analysts. BitMEX founder Arthur Hayes recently expressed a similar view, according to which the Fed will sooner than later find itself in a bind to reintroduce QE. Hayes predicts a Bitcoin price of $750,000 in 2026. But this perspective isn&#8217;t universally accepted. Yuga.eth from Coinbase drew on Austan Goolsbee&#8217;s confidence in the FOMC&#8217;s commitment to tackling inflation. To this, Alexander sharply responded, &#8220;Nothing about increasing the debt is helping the inflation anyway. As I wrote at the very beginning, the only way to do it properly would be to increase taxes, especially corporate.&#8221; At press time, Bitcoin traded at $26,677. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-10T10:30:49.000Z",
    "title": "Dogecoin Bull Elon Musk Supports DOGE and Twitter Community: SEC Says Crypto Has No Value, Why Should It Be Taxed Then? No Taxation for Crypto!",
    "url": "https://www.crypto-news-flash.com/dogecoin-bull-elon-musk-supports-doge-and-twitter-community-sec-says-crypto-has-no-value-why-should-it-be-taxed-then-no-taxation-for-crypto/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-bull-elon-musk-supports-doge-and-twitter-community-sec-says-crypto-has-no-value-why-should-it-be-taxed-then-no-taxation-for-crypto",
    "description": "<img width=\"1920\" height=\"1189\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/elon-musk-6222396_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Elon Musk and Tesla Inc. have launched a counterattack against the attorney representing the individuals who filed a lawsuit on behalf of Dogecoin investors.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/elon-musk-6222396_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/elon-musk-6222396_1920-300x186.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/elon-musk-6222396_1920-1024x634.jpg 1024w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Dogecoin co-founder Billy Markus asked the SEC to return all crypto taxes since the regulator considers crypto to have &#8216;no innate or inherent value.&#8217; Elon Musk chimed in to support Markus&#8217;s viewpoint, questioning the notion that cryptocurrencies aren&#8217;t &#8220;real&#8221; if they are taxed. Amid of exchange of thoughts on social media platform X, two influential [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-10T10:22:00.000Z",
    "title": "Another Friend.tech User Loses Entire Portfolio to Phishing Scam",
    "url": "https://coinedition.com/another-friend-tech-user-loses-entire-portfolio-to-phishing-scam/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/10/Scam-10.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/Scam-10.jpg 730w, https://coinedition.com/wp-content/uploads/2023/10/Scam-10-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/10/Scam-10-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/10/Scam-10-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/10/Scam-10-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/10/Scam-10-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/10/Scam-10-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/10/Scam-10-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/10/Scam-10-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/10/Scam-10-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/10/Scam-10-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/10/Scam-10-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/10/Scam-10-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/10/Scam-10-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/10/Scam-10-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/10/Scam-10-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Yyctrader, the head of news at a known crypto news agency, has become the latest victim of a crypto phishing scam orchestrated via the growing Social-Fi App Friend.tech, which saw his wallet emptied. In a recent tweet, Yyctrader narrated the harrowing incident that left his crypto portfolio compromised, expressing deep regret for his mistakes. Specifically, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/another-friend-tech-user-loses-entire-portfolio-to-phishing-scam/\">Another Friend.tech User Loses Entire Portfolio to Phishing Scam</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]