[
  {
    "source": "Cointelegraph",
    "date": "2023-11-07T18:10:00.000Z",
    "title": "Vietnamese Web3 coalition Ninety Eight launches $25M ecosystem fund",
    "url": "http://cointelegraph.com/news/vietnamese-web3-coalition-ninety-eight-launches-25-million-ecosystem-fund",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/37f7c0df-e094-4dde-81ba-f0657501a137.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The capital will be dedicated to supporting Web3 startups in Asia. </p>\n                    <p><p>Vietnamese Web3 coalition Ninety Eight, creator of the Coin98 decentralized finance (DeFi) ecosystem, has launched a $25 million ecosystem fund dedicated to accelerating Web3 startups in Asia.</p><p>According to the Nov. 7 <a href=\"https://blog.ninetyeight.world/ninety-eight-launches-25m-ecosystem-fund-to-support-web3-startups-in-asia/\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, the fund will provide financial and strategic support for selected startups. In addition, startups can use the firm's existing Viction layer-1 blockchain infrastructure for low-gas fee transactions and enhanced security. </p><p>Another key aspect of the Ninety Eight Ecosystem Fund is its native token, $C98, designed initially as a wallet token. The $C98 token allows users to store, send, receive, and manage crypto assets, as well as connect to decentralized applications on over 40 blockchains. Its namesake DeFi platform provides users access to cross-chain swaps, staking, and yield farming.</p><blockquote>\"To ensure the efficient deployment of the Ecosystem Fund, we have entrusted Arche Fund, a venture arm within the Ninety Eight ecosystem, with its management. Arche Fund will be responsible for overseeing the fund and working closely with selected startups to maximize their potential.\"</blockquote><p>In June, the firm <a href=\"https://blog.ninetyeight.world/intro-vietnam-future-fund/\" target=\"_blank\" rel=\"noopener nofollow\">launched</a> a Vietnam Future Fund to specifically support Vietnamese Web3 startups. \"After overcoming numerous challenges on our own path to global expansion, Coin98 understands the obstacles that Vietnamese startups often face in the early stages of navigating the global landscape,\" the company stated at the time. </p><p>Vietnam is <a href=\"https://cointelegraph.com/news/76-percent-of-vietnamese-crypto-holders-invest-based-on-referrals\">currently the top country</a> in the world in terms of crypto adoption, according to blockchain analytics firm Chainalysis, with 19% of adults reporting that they own digital assets. Despite this, only nine Vietnamese educational institutions provide blockchain courses, and only eight blockchain infrastructure projects are present within the Southeast Asian country. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/magazine/thailands-national-airdrop-delio-vietnam-top-crypto-country-asia-express/\">Thailand’s national airdrop, Delio users screwed, Vietnam top crypto country</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-07T18:10:30.000Z",
    "title": "Gemini to limit crypto transfers in the UK to TRUST companies",
    "url": "https://cryptoslate.com/gemini-to-limit-crypto-transfers-in-the-uk-to-trust-companies/",
    "description": "<p>Gemini&#8217;s U.K. branch will limit cryptocurrency transfers exclusively to Travel Rule Universal Solution Technology (TRUST)-registered Virtual Asset Service Providers (VASPs) starting Nov. 17. The exchange attributed its decision to the Travel Rule regulations mandating VASPs to share sender and receiver information for crypto transactions. Gemini said: &#8220;In the UK, the Travel Rule applies to all transactions, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/gemini-to-limit-crypto-transfers-in-the-uk-to-trust-companies/\">Gemini to limit crypto transfers in the UK to TRUST companies</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-07T18:28:29.000Z",
    "title": "Top 6 Crypto AI Projects to Invest In",
    "url": "https://cryptodaily.co.uk/2023/11/top-6-crypto-ai-projects-to-invest-in",
    "description": "Within the context of business and investments, the primary goal is attaining profitability, which has the utmost significance."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-07T18:32:08.000Z",
    "title": "Can AI Be Your Friend?",
    "url": "https://www.cryptopolitan.com/can-ai-be-your-friend/",
    "description": "Artificial intelligence is increasingly becoming a part of our everyday lives. Nowadays, people often interact more with virtual assistants and chatbots in their homes, workplaces, and even social lives, developing some form of connection with these tools.&#160; Making Friends with AI&#160; For one, this shows that AI technology models are good listeners and can hold ... <a title=\"Can AI Be Your Friend?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/can-ai-be-your-friend/\" aria-label=\"More on Can AI Be Your Friend?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-07T18:28:16.000Z",
    "title": "AI Era is “Going To Be Really Tough” For Young Artists",
    "url": "https://www.cryptopolitan.com/ai-era-tough-for-young-artists/",
    "description": "The burgeoning wave of generative AI, especially text and art generators, is creating some level of concern for people in the creative field, particularly artists, illustrators, and so on, whose works are now being snatched by these AI tools.&#160; To some, the current situation with AI technology “seems a bit like sci-fi come into real ... <a title=\"AI Era is “Going To Be Really Tough” For Young Artists\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-era-tough-for-young-artists/\" aria-label=\"More on AI Era is “Going To Be Really Tough” For Young Artists\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-07T18:21:28.000Z",
    "title": "Gemini Trust CTO Pravjit Tiwana set to depart amid company challenges",
    "url": "https://www.cryptopolitan.com/gemini-trust-cto-pravjit-tiwana-set-to-depart-amid-company-challenges/",
    "description": "Gemini Trust Co., the cryptocurrency exchange led by Tyler and Cameron Winklevoss, is navigating a significant shift in its technology leadership. According to a Bloomberg report, Pravjit Tiwana, the company’s global chief technology officer, is on the cusp of his departure. Tiwana, renowned for his strategic influence, will exit the role he filled just as ... <a title=\"Gemini Trust CTO Pravjit Tiwana set to depart amid company challenges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gemini-trust-cto-pravjit-tiwana-set-to-depart-amid-company-challenges/\" aria-label=\"More on Gemini Trust CTO Pravjit Tiwana set to depart amid company challenges\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-07T18:34:38.000Z",
    "title": "VC firm a16z crypto spearheads $4.2m seed funding for web3 company Pimlico",
    "url": "https://crypto.news/vc-firm-a16z-crypto-spearheads-4-2m-seed-funding-for-web3-company-pimlico/",
    "description": "UK-based Pimlico has raised $4.2 million in a seed funding round led by a16z crypto, aiming to improve the Ethereum network by introducing versatile smart accounts through ERC-4337."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-07T18:15:29.000Z",
    "title": "Cardano utilizes Polkadot tech stack for partner chains",
    "url": "https://crypto.news/cardano-utilizes-polkadot-tech-stack-for-partner-chains/",
    "description": "According to a Nov. 6 post on X, Cardano has chosen to use Substrate, the foundation of the Polkadot SDK, to build its partner chain project."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-07T18:14:10.000Z",
    "title": "Animoca Brands Japan announces partnership with Cool Cats Group",
    "url": "https://crypto.news/animoca-brands-japan-announces-partnership-with-cool-cats-group/",
    "description": "Animoca Brands Japan and KLKTN have formed a strategic partnership with Cool Cats Group to facilitate the expansion of the Cool Cats brand into the Japanese anime market using web3 technology."
  }
]