[
  {
    "source": "CoinDesk",
    "date": "2024-03-15T13:01:40.000Z",
    "title": "Michael Saylor's MicroStrategy Prices Upsized $525M Debt Offering to Buy More Bitcoin",
    "url": "https://www.coindesk.com/markets/2024/03/15/michael-saylors-microstrategy-prices-upsized-525m-debt-offering-to-buy-more-bitcoin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The firm announced its plans to raise $500 million in a debt offering on Wednesday only days after purchasing 12,000 BTC with the proceeds of a previous $700 million offering."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-15T13:01:02.000Z",
    "title": "Upland Reveals 'Share and Build' Airdrop Drive Ahead of Ethereum Token Launch",
    "url": "https://decrypt.co/221847/upland-reveals-share-build-airdrop-drive-ethereum-token",
    "description": "Crypto game Upland is gearing up to debut its Sparklet token, and will reward users via in-game missions and social media engagement."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-15T13:06:00.000Z",
    "title": " UK court rules Craig Wright not Nakamoto, ending long-standing drama  ",
    "url": "https://cointelegraph.com/news/uk-court-craig-wright-bitcoin-satoshi-nakamoto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNmUzN2JjMjAtZWEzNi00OTMzLTg0OTEtZWIzZTU1NmVjZmFjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A judge has ruled definitively that Craig Wright is not the pseudonymous creator of Bitcoin, dealing a blow to his claims of ownership over the currency’s intellectual property. </p>\n                    <p><p data-ct-non-breakable=\"true\">In <a href=\"https://cointelegraph.com/news/craig-wright-not-satoshi-nakamoto\">a landmark ruling</a> in the United Kingdom by Judge James Mellor on March 14, 2024, the court dismissed Australian computer scientist Craig Wright’s near decade-old claim of being Satoshi Nakamoto, the pseudonymous creator of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>).</p><p>The ruling came after a protracted legal battle between Wright and the Crypto Open Patent Alliance (COPA), a coalition of prominent cryptocurrency companies seeking to prevent Wright from asserting his purported ownership over the digital currency’s core intellectual property (IP).</p><p>COPA brought its <a href=\"https://www.judiciary.uk/wp-content/uploads/2023/12/COPA-v-Wright-Others-2023-EWHC-3287-Ch-PTR-Judgment.pdf\" target=\"_blank\" rel=\"noopener nofollow\">case against Wright</a> in 2023, alleging that he had repeatedly engaged in widespread document forgery to support his claims of being Nakamoto. </p><p><a href=\"https://cointelegraph.com/news/uk-court-craig-wright-bitcoin-satoshi-nakamoto\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-15T13:00:02.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Uncertainty in the market has had a knock-on effect on Bitcoin exchange-traded funds, which have seen net inflows drop by 80%. Two United States senators have penned a letter to Gary Gensler at the Securities and Exchange Commission, pressuring him not to approve any other crypto ETFs. Meanwhile, a United Kingdom judge has ruled that Craig Wright is not Bitcoin’s creator </p><p>United States-based spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds (ETFs) recorded one of their lowest net inflow days of just $132 million on March 14 — the lowest level in the past eight trading days and an 80% fall from March 13. </p><p>The Thursday <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-net-inflow-dropped-80\">drop</a> marked the second consecutive day of decline. On Wednesday, inflows hit $684 million, a 38.3% drop from the March 12. Tuesday saw record-breaking single-day inflows of $1.05 billion.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-15T13:00:00.000Z",
    "title": " PancakeSwap announces v4 with custom pools and gas optimization ",
    "url": "https://cointelegraph.com/news/pancakeswap-announces-v4-custom-pools-gas-optimization",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZmY1YzdhZjktZGIyZC00ZGQyLWE0ZWYtOGRmMzEzYTI0NzVlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>PancakeSwap released a new version of its code, which it plans to launch on BNB and Ethereum in Q3.</p>\n                    <p><p data-ct-non-breakable=\"true\">Decentralized exchange PancakeSwap released its version four codebase and white paper on March 15, according to an announcement from its team. The new version will allow for custom liquidity pools and flash accounting, intended to lower gas costs for users and prevent impermanent loss for liquidity providers (LPs). The team will also create a development fund to help pay for further development of the PancakeSwap protocol, the announcement stated.</p><p data-ct-non-breakable=\"true\">PancakeSwap is the third-largest decentralized crypto exchange, measured by the total value of cryptocurrency locked within its contracts. It currently holds over $2.3 billion of assets spread across nine different networks, <a href=\"https://defillama.com/protocols/dexes\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to blockchain analytics platform DefiLlama.</p><p>According to the announcement, the new version will launch on the Ethereum and BNB networks in the third quarter of 2024.</p><p><a href=\"https://cointelegraph.com/news/pancakeswap-announces-v4-custom-pools-gas-optimization\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-15T13:05:11.000Z",
    "title": "Unveiling the Catalysts Fueling BEFE Coin's Expected 3000% Price Surge",
    "url": "https://cryptodaily.co.uk/2024/03/unveiling-the-catalysts-fueling-befe-coins-expected-3000-price-surge",
    "description": "Despite being an early stage memecoin, BEFE has managed to reach a market capitalization of more than $45 million, with a consistent growth in its daily trading volume."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-15T13:06:32.000Z",
    "title": "Democratic Senators Trying To Block Crypto ETFs",
    "url": "https://cryptodaily.co.uk/2024/03/democratic-senators-trying-to-block-crypto-etfs",
    "description": "Democratic senators Reed and Butler stirred up trouble within the crypto community by urging the SEC to cease approval of crypto-based ETFs."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-15T12:50:05.000Z",
    "title": "XRP legal status examined in ECGI research",
    "url": "https://www.cryptopolitan.com/xrp-legal-status-examined-in-ecgi-research/",
    "description": "A recent research paper by the European Corporate Governance Institute (ECGI) sheds light on the regulatory landscape surrounding Ripple (XRP), the cryptocurrency associated with Ripple Labs. Titled &#8220;Corporate Governance Meets Data and Technology,&#8221; the study, authored by Wei Jiang of Emory University and Tao Li of the University of Florida, delves into the evolving fundraising [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-15T12:40:06.000Z",
    "title": "AI4Bharat Introduces IndicLLMSuite to Foster Indian Language Models",
    "url": "https://www.cryptopolitan.com/ai4bharat-introduces-indian-language-models/",
    "description": "In a significant stride towards enhancing the representation of Indian languages in the realm of Language Model training, AI4Bharat has launched the IndicLLMSuite. This comprehensive suite of resources is tailored to address the challenges faced by low and mid-resource languages in the development of Language Models (LLMs). The initiative aims to democratize access to advanced [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-15T12:50:36.000Z",
    "title": "Bitcoin Crash Triggered By Failed $1 Billion Hedge Fund Spread Trade: Expert",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-crash-failed-1-billion-hedge-fund-trade/",
    "description": "The Bitcoin price has crashed from over $72,000 yesterday to as low as $65,500. As reported earlier today, there are several obvious reasons for this, such as the liquidation of extensive long positions on the red-hot futures market, expectations of a &#8220;higher for longer&#8221; policy by the US Federal Reserve as a result of hotter than expected inflation data and a relatively weak inflow day for the spot ETFs yesterday. Did This Trigger The Bitcoin Crash? However, there is also a rumor that reveals yet another hidden reason for the crash: a failed spread trade by a hedge fund that resulted in over a billion dollars in losses. Andrew Kang, the founder of Mechanism Capital, revealed on X the intricate details of this debacle. &#8220;Apparently a fund blew out $1b+ on the MSTR-BTC spread trade today. They covered into the close which is why BTC dumped and MSTR premium went to the highs. PNL pocketed by based Saylor and will be put back into BTC.&#8221; Kang had earlier elucidated the precarious nature of market transitions, citing the downfall of several major players due to flawed delta-neutral strategies. &#8220;You get some really wonky stuff that happens in market trend transitions. Like large delta-neutral funds/institutions getting blown out on &#8216;risk-free&#8217; spread trades,&#8221; Kang remarked, pointing to past failures of notable firms like Blockfi, DCG, Genesis, Three Arrow Capital and Alameda. Related Reading: Why Is Bitcoin Price Down Today? 3 Key Reasons MicroStrategy, under the leadership of Michael Saylor, has notably been a leveraged play on Bitcoin, with its substantial holdings often leading to significant interest from short sellers. According to Kang, &#8220;MSTR currently has $3b of short interest &#8211; roughly 20% of its float. I imagine a lot of that float is angry tradfi boomers trying to capture the premium to NAV.&#8221; The premium discrepancy Kang refers to—surging from 50% pre-ETF to 13% post-ETF, and recently peaking at 70%—illustrates the volatile dynamics at play between MicroStrategy&#8217;s stock value and its underlying Bitcoin holdings. Trade Gone Wrong Renowned Bitcoin analyst Bit Paine and German crypto analyst Florian Bruce corroborated the narrative, pointing to the unwinding of a significant spread trade as the catalyst for the market movements. “That dip was because a fund blew up on their MSTR/BTC short,” Bit Paine remarked. Related Reading: Bitcoin Miners Brace For Impact As Difficulty Reaches Unprecedented Levels Bruce provided a clear exposition of the strategy gone awry: &#8220;A hedge fund set up a spread trade shortly before the ETF approval: Long BTC &#38; Short MSTR. The idea behind it was that MSTR will fall through the ETF while BTC rises.&#8221; This explanation lays bare the hedge fund&#8217;s miscalculation, as the actual market response saw MSTR outperformed Bitcoin, necessitating a rapid unwinding of positions that contributed to Bitcoin&#8217;s sharp price decline. “BTC was sold and the shorts on MSTR were closed (MSTR bought). This is probably also the reason why MSTR has just had a small mini rally and is doing less badly than other BTC ETFs. Enjoy the dip. I don&#8217;t think it will last long,” Bruce stated. The supposed hedge fund in question, North Rock Digital, had previously outlined its contrarian strategy on X, expressing skepticism towards the valuation of crypto equities in the lead-up to ETF approvals. “The contrarian idea [&#8230;] was to short crypto equities vs long spot crypto. In our view, as we approach the ETF, crypto equities have been being used as proxies for spot exposure [&#8230;] once the ETF becomes available we expect this flow to reverse as many of these holders rotate exposure into the ETF. Given the dislocated nature of many of these names (MSTR, MARA and COIN are our three favorite shorts), we believe there are several attractive shorts to pair against long spot exposure,” North Rock Digital stated in January. At press time, BTC traded at $67,588. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-15T13:00:24.000Z",
    "title": "BlackRock ETF Now Holds More Bitcoin Than MicroStrategy; Rebel Satoshi’s $RECQ Is Prime For Massive Takeoff",
    "url": "https://www.crypto-news-flash.com/blackrock-etf-now-holds-more-bitcoin-than-microstrategy-rebel-satoshis-recq-is-prime-for-massive-takeoff/?utm_source=rss&utm_medium=rss&utm_campaign=blackrock-etf-now-holds-more-bitcoin-than-microstrategy-rebel-satoshis-recq-is-prime-for-massive-takeoff",
    "description": "<img width=\"1200\" height=\"750\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-15T094019.768.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-15T094019.768.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-15T094019.768-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-15T094019.768-768x480.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-15T094019.768-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-15T094019.768-450x281.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />MicroStrategy purchases another 12,000 Bitcoin (BTC) after BlockRock briefly becomes the largest holder.  Rebel Satoshi ($RBLZ) promises 400% gains as the presale of the Rebel Satoshi Arcade ($RECQ) token begins.  With the Bitcoin (BTC) price making new all-time highs, competition has started between BlackRock and MicroStrategy. Amid the competition, investors are looking for the best [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-15T13:04:56.000Z",
    "title": "Arcana Network Starts Arcana Rites Campaign",
    "url": "https://www.altcoinbuzz.io/product-release/arcana-network-starts-arcana-rites-campaign/",
    "description": "<p>User experience or UX is important to onboard people to crypto. The onboarding process should be as smooth as possible. That&#8217;s where Arcana Network comes into play. It&#8217;s an app-chain for Web3 UX. On top of that, there&#8217;s also the new Arcana Rites Campaign. It offers up to $10,000 in rewards. So, let&#8217;s take a [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/product-release/arcana-network-starts-arcana-rites-campaign/\">Arcana Network Starts Arcana Rites Campaign</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-15T13:00:38.000Z",
    "title": "The Graph Supports 40+ Chains: Easier dApp Development",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/the-graph-supports-40-chains-easier-dapp-development/",
    "description": "<p>With new tech like the upgraded Indexer, The Graph now supports over 40 top blockchains and L2s. This expansion offers developers vast opportunities across many chains, including Arbitrum, AVAX, Celo, and newcomers like Base and NEAR. New Chains Join The Graph Ecosystem This enhancement signifies a giant leap forward in making The Graph Network more [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/the-graph-supports-40-chains-easier-dapp-development/\">The Graph Supports 40+ Chains: Easier dApp Development</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-15T12:51:41.000Z",
    "title": "Wanchain Q1 Updates",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/wanchain-q1-updates/",
    "description": "<p>We’ve covered Wanchain a lot in recent weeks. And that’s because the project has been busy setting and accomplishing its goals. Wanchain is a blockchain focused on bridging blockchains and promoting interoperability.  Wanchain has made a series of notable achievements since its emergence in 2017. It launched the first-ever decentralized Bitcoin — Ethereum bridge. There’s [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/wanchain-q1-updates/\">Wanchain Q1 Updates</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]