[
  {
    "source": "Crypto Daily",
    "date": "2023-08-17T09:44:00.000Z",
    "title": "OPNX And Its Founders Hit With $2.8 Million Fine By Dubai’s VARA",
    "url": "https://cryptodaily.co.uk/2023/08/opnx-and-its-founders-hit-with-28-million-fine-by-dubais-vara",
    "description": "<p>According to a notice published by the regulatory authority, Dubai&rsquo;s Virtual Asset Regulatory Authority has hit digital asset exchange OPNX and its founders nearly $2.8 million.&nbsp;</p>\n<p>The crypto bankruptcy claims exchange and its founders, Su Zhu, Kyle Davies, and Mark Lamb, were formally reprimanded by VARA in May.&nbsp;</p>\nA Hefty Fine&nbsp;\n<p>According to the notice published by Dubai&rsquo;s Virtual Asset Regulatory Authority, a fine of 10,000,000 United Arab Emirates dirhams ($2.7 million) was issued against Open Technology Markets (OPNX) for violating several rules related to advertising, promotions, and marketing. The regulatory body stated in its notice,&nbsp;</p>\n\n<p>&ldquo;Further to Virtual Assets Regulatory Authority&rsquo;s (VARA) previous notices dated the 12th of April 2023 and the 27th of April 2023 regarding the conduct of Open Technology Markets Ltd. [trading as OPNX and opnx.com], VARA has issued the following fines. AED 10,000,000 against OPNX for a Market Offence under Regulation VIII.A.3 of the Virtual Assets and Related Activities Regulations 2023 (Regulations). This fine was issued on the 2nd of May 2023 and remains unpaid at the time of publication of this notice.&rdquo;</p>\n\n<p>Dubai&rsquo;s Virtual Asset Regulatory Authority also stated that the fine was issued on the 2nd of May, 2023, and remains unpaid as of the 16th of August, when the notice was published. The regulatory body also issued separate fines of 200,000 United Arab Emirates dirhams ($54,451) on Davies, Mark, and Lamb. This fine was for failing to meet advertising and marketing standards set by the regulator. According to the notice, all three have paid the second fine in full.&nbsp;</p>\n\n<p>&ldquo;AED 200,000 against each of the following 4 persons: OPNX founders Kyle Davies, Su Zhu, and Mark Lamb and OPNX CEO Leslie Lamb. The fines are for violations of Administrative Order No. 01/22 Relating to Regulation of Marketing, Advertising, and Promotions Related to Virtual Assets [failure to ensure marketing meets the requirements of paragraph II.1 and/or II.5 of the Marketing Regulation]. The fines were issued on the 2nd of May 2023 and have been fully paid by the individuals in question.&rdquo;</p>\n\nFurther Action?&nbsp;\n<p>The fines issued by the Virtual Asset Regulatory Authority are the biggest fines the regulator has issued to date. The regulatory body noted that all fines were referred to its grievance committee and were in accordance with all governance requirements. The committee determined that enforcement actions against OPNX and its founders should be upheld in their entirety.&nbsp;</p>\n\n<p>&ldquo;All fines noted above were referred to Vara&rsquo;s grievance committee in accordance with due governance requirements. The committee reviewed the referral of the grievance and determined that the enforcement actions taken be upheld in their entirety.&rdquo;</p>\n\n<p>The regulator also hinted at further action against OPNX in a bid to recover payments and could potentially see the matter being referred to law enforcement agencies or competent courts.&nbsp;</p>\n\n<p>&ldquo;Vara shall determine consequential actions warranted against Opnx, which may include further fines, penalties, and/or taking any actions necessary to recover payment and definitively remedy the behavior including, but not limited to, referring the matter to any law enforcement agency (ies) or competent courts.&rdquo;</p>\n\nThe Controversial OPNX Exchange&nbsp;\n<p>OPNX was set up and launched by the founders of the failed crypto hedge fund Three Arrows Capital (3AC), Kyle Davies and Su Zhu. The platform was created following the downfall of Three Arrows Capital, with Zhu and Davies heavily criticized for starting the project. The platform allows investors to trade bankruptcy claims for platforms such as CoinFLEX and FTX. The exchange conducted less than $2 worth of trades as it stumbled into a launch, with major trading firms claimed to be investors by OPNX denied their involvement.&nbsp;</p>\n<p>The cryptocurrency sector has endured a difficult 2022, with several major projects and entities collapsing, while hacks and other threats have also led to investor interest cooling. The most notable collapse was that of the Sam Bankman-Fried-led FTX, which filed for bankruptcy in November.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T10:05:17.000Z",
    "title": "Shiba Inu’s marketer raises alarm on potential Shibarium scams amid blockchain hype",
    "url": "https://www.cryptopolitan.com/shiba-inus-marketer-raises-alarm-on-potential-shibarium-scams-amid-blockchain-hype/",
    "description": "LucieSHIB, the official marketer of the Shiba Inu cryptocurrency, has issued a public warning regarding potential scams on Shibarium, the highly anticipated Ethereum (ETH) Layer-2 scaling protocol. This cautionary message comes amid claims by Shiba Inu&#8217;s chief creator, Shytoshi Kusama, about blockchain&#8217;s potential to revolutionize decentralization. Shibarium, similar to other blockchains like Polygon (MATIC) and ... <a title=\"Shiba Inu&#8217;s marketer raises alarm on potential Shibarium scams amid blockchain hype\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inus-marketer-raises-alarm-on-potential-shibarium-scams-amid-blockchain-hype/\" aria-label=\"More on Shiba Inu&#8217;s marketer raises alarm on potential Shibarium scams amid blockchain hype\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-17T10:00:09.000Z",
    "title": "Bullish Cryptocurrencies That Are Poised for 10x Gains – Stellar, VeChain and Pomerdoge",
    "url": "https://www.crypto-news-flash.com/bullish-cryptocurrencies-that-are-poised-for-10x-gains-stellar-vechain-and-pomerdoge/?utm_source=rss&utm_medium=rss&utm_campaign=bullish-cryptocurrencies-that-are-poised-for-10x-gains-stellar-vechain-and-pomerdoge",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-59.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-59.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-59-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-59-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Stellar (XLM), VeChain (VET), and Pomerdoge (POMD) &#8211; are tokens that have caught the attention of savvy investors looking for significant gains. These cryptocurrencies have unique features and growth prospects that make them stand out in a sea of possibilities. Today, we will look at all three and find out why experts forecast a 10x [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-17T10:01:06.000Z",
    "title": "Top Coins to Look at in August 2023 – Part 2",
    "url": "https://www.altcoinbuzz.io/reviews/top-coins-to-look-at-in-august-2023-part-2/",
    "description": "<p>Coins with a small market cap are interesting to look at. It means that they have a lot of growth potential. We introduce six projects that have such a small market cap. You can find out more about what these projects do. Here&#8217;s a link to Part 1. So, let&#8217;s dive in and see which [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/top-coins-to-look-at-in-august-2023-part-2/\">Top Coins to Look at in August 2023 – Part 2</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-17T09:56:55.000Z",
    "title": "10 Ways to Make Money on Solana",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/10-ways-to-make-money-on-solana/",
    "description": "<p>The recent saga with FTX dealt a heavy blow to the Solana project. Despite this, Solana&#8217;s ecosystem is still teeming with life. Yet, the $SOL price is still far below its previous All-Time High (ATH). So, how can we still make money on Solana? Today, we explore 10 such ways to do just that. For [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/10-ways-to-make-money-on-solana/\">10 Ways to Make Money on Solana</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]