[
  {
    "source": "CryptoSlate",
    "date": "2023-10-05T22:40:02.000Z",
    "title": "Ledger reduces staff by 12% as controversial Recover feature looms",
    "url": "https://cryptoslate.com/ledger-reduces-staff-by-12-as-controversial-recover-feature-looms/",
    "description": "<p>Hardware wallet manufacturer Ledger announced in a blog post on Oct. 5 that it will lay off a significant percentage of its staff while continuing operations. The company&#8217;s CEO, Pascal Gauthier, wrote in a letter: &#8220;Macroeconomic headwinds are limiting our ability to generate revenue, and in response to the current market conditions and business realities [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ledger-reduces-staff-by-12-as-controversial-recover-feature-looms/\">Ledger reduces staff by 12% as controversial Recover feature looms</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-05T23:00:23.000Z",
    "title": "This Trader Thinks Bitcoin Is Undervalued Below $30,000: Time To Buy More BTC?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-undervalued-below-30000/",
    "description": "On X, one trader going by the handle &#8220;CryptoJelleNL&#8221; is convinced that accumulating Bitcoin below $30,000 can be rewarding. The trader expects prices to not only expand towards all-time highs printed in 2021 at around $69,000 but break above $100,000 in the coming sessions.  Although the analyst didn&#8217;t give timelines, the &#8220;game plan remains the same,&#8221; acknowledging that it will be a &#8220;tough mental battle&#8221; before exiting the market when BTC soars above $100,000, nearly 4X at spot rates. It is not immediately clear precisely at what price the analyst entered. Responding to a tweet, CryptoJelleNL said the strategy is not to buy between $30,000 and around $70,000 because doing so will only increase the average &#8220;entry-level.&#8221; This strategy was proposed by an X user who preferred dollar cost averaging (DCA) using lower capital.  Related Reading: Bitcoin Cash Price Won’t Go Down Quietly – Risk of Bounce Grows In DCA, an investor makes periodic purchases of a target asset at low costs to dampen the effect of volatility and reduce the overall entry price. This system can be effective for HODLers, like in the case of CryptoJelleNL, and for traders who can&#8217;t time the market.  Will Bitcoin Break Above $30,000? Even so, time will tell whether Bitcoin will eventually recover from spot rates, soaring above $30,000 and July 2023 highs. Looking at price charts, bulls have a chance, at least in the short to medium term.  Prices remain tight, trading above the $25,200 primary support and $28,000 and $30,000 resistance zone. Moreover, trading volumes are lower, suggesting that activity is generally low, with most market participants not keen to engage at spot levels.  Related Reading: XRP Price Breakout: This Resistance Level Holds The Key Even so, a breakout above $32,000 might spark activity, pushing prices toward the all-time high in a welcomed buy trend continuation formation in H1 2023. Looking at the weekly chart, prices have mostly been consolidating from June 2023, oscillating between $32,000 on the upper end and $25,000 on the lower end. Former BitMEX CEO Says BTC Will Roar To $750,000 Arthur Hayes, co-founder and former CEO of BitMEX, believes BTC will explode to around the $750,000 and $1 million level by 2026. In his view, the Bitcoin halving event, a supply shock that will halve the rewards distributed to miners, and the potential approval of a spot Bitcoin exchange-traded fund (ETF) by the Securities and Exchange Commission (SEC) will be the primary drivers of demand. Bitcoin will halve miner rewards in 2024. The SEC has hesitated to greenlight a spot Bitcoin ETF, though the complex derivatives product is already available in other jurisdictions, including Canada and Europe. Feature image from Canva, chart from TradingView"
  }
]