[
  {
    "source": "Cointelegraph",
    "date": "2023-08-23T07:18:00.000Z",
    "title": "Bitcoin difficulty jumps 6% to new peak as miners ignore BTC price dip",
    "url": "https://cointelegraph.com/news/bitcoin-mining-difficulty-new-peak-btc-price-dip",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/b652146e-f0a6-4922-8a53-5d9ebd64b966.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price action is causing some to panic, but Bitcoin miner confidence in the network is there for all to see.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) network fundamentals are in no mood to follow bearish BTC price action this week.</p><p>The <a href=\"https://btc.com/stats/diff\" target=\"_blank\" rel=\"noopener nofollow\">latest on-chain data</a> confirms that difficulty has hit new all-time highs, with hash rate not far behind.</p><h2>Bitcoin mining difficulty ends slump</h2><p>Despite BTC/USD <a href=\"https://cointelegraph.com/news/btc-price-fear-svb-5-things-bitcoin-this-week\">dropping 10% last week</a>, Bitcoin miners appear to be taking the price downturn in their stride.</p><p>This was cemented in network activity on Aug. 22, as difficulty increased by 6.17% at its latest biweekly automated readjustment.</p><p>Not only was this enough to take difficulty to new record highs, it marked Bitcoin’s sixth-largest difficulty uptick of 2023, figures from monitoring resource BTC.com show.</p><p>Difficulty is a reflection of both miner competition and Bitcoin network security, and its upward trajectory suggests that miners are not yet struggling when it comes to profitability.</p><p>The next automated readjustment is already due to continue the trend, taking difficulty over 56 trillion for the first time.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/eeba583e-d707-48a6-9eb4-00cef856e9fc.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin network fundamentals overview (screenshot). Source: BTC.com</em></figcaption></figure><h2>Hash rate shows \"high confidence\" in BTC</h2><p>A similar story concerns hash rate — the estimated hashing deployment by miners to the Bitcoin blockchain.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-analyst-btc-price-bounce-rsi-low\">Bitcoin analyst eyes ‘V-shape’ BTC price bounce as RSI hits 5-year low</a></em></strong></p><p>While not possible to calculate exactly, depending on the source, hash rate is already challenging existing all-time highs of over 400 exahashes per second (EH/s).</p><p>Responding to the data, MAC_D, a contributor to on-chain analytics platform CryptoQuant, referenced “high confidence in the security and reliability” among network participants for both Bitcoin and largest altcoin Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>).</p><p>“Recently, the prices of BTC and ETH have fallen by -10%. However, the network security and reliability have increased. First, the BTC hashrate (SMA 14) shows higher figures during the decline, which shows that miners are more active in BTC mining. Second, the ETH staking rate (%) shows that more ETH has been staked even though the price has fallen,” he wrote in a <a href=\"https://cryptoquant.com/insights/quicktake/64e4605b53ebba2eeba43995-BTC-and-ETH-prices-have-fallen-but-network-security-and-reliability-have-increas\" target=\"_blank\" rel=\"noopener nofollow\">Quicktake market update</a> on Aug. 22.</p><blockquote>“This means that investors have high confidence in the security and reliability of the BTC and ETH networks. The fact that the price has fallen despite the increase in the intrinsic value of the two assets means that they are undervalued, and it can be considered a time to actively accumulate assets.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/995cc6fa-a36e-44ba-b3b1-ba5cc98220bb.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin estimated hash rate chart. Source: Glassnode</em></figcaption></figure><p>Separate data from on-chain analytics firm <a href=\"https://studio.glassnode.com/metrics\" target=\"_blank\" rel=\"noopener nofollow\">Glassnode</a> meanwhile shows little tangible change in the amount of BTC held by mining entities.</p><p>This stood at just over 1.83 million BTC as of Aug. 22, up by a steady 0.08% since the start of the month.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/d2a23964-1ee8-4785-920c-8a65836d2023.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin miner BTC balance chart. Source: Glassnode</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-23T07:32:55.000Z",
    "title": "\n                        Litecoin and Filecoin Hope For A Positive Response As Pomerdoge Makes A Case For The Next Market Bull Run\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/litecoin-and-filecoin-hope-for-a-positive-response-as-pomerdoge-makes-a-case-for-the-next-market-bull-run",
    "description": "\n                        <p class=\"s7\">If you are searching for a project to multiply your investment, Pomerdoge is the best option in the crypto world. Experts are highly bullish on it, and its market value can rise by 40x by the end of the year.</p>\n<p class=\"s7\">In fact, Litecoin (LTC) and Filecoin (FIL) holders have also shifted their sides to join this new project.</p>\nSummary\n● Gate.io has recently listed Litecoin (LTC) on its exchange.\n● Filecoin (FIL) has announced plans to launch a developer summit in September.\n● Pomerdoge has progressed toward 40x profit.\n<p>Click Here To Find Out More About The Pomerdoge (POMD) Presale</p>\nLitecoin (LTC) Secures First Listing Since The Halving\n<p class=\"s7\">Recently, the Litecoin (LTC) network underwent its halving event on August 2. This third edition of the Litecoin halving has reduced miners&rsquo; rewards from 12.5 LTC to 6.25 LTC. However, the halving event has failed to make any positive impact on the price of Litecoin (LTC).</p>\n<p class=\"s7\">The market value of Litecoin (LTC) has dipped by more than 20% in the past month. Subsequently, the current trading price of Litecoin (LTC) has tumbled to $83.11.</p>\n<p class=\"s7\">Meanwhile, Litecoin (LTC) secured its first listing post-halving. Recently, Gate.io, a leading crypto trading platform, announced the mega listing of Litecoin (LTC).</p>\nFilecoin (FIL) Announces Dev Summit\n<p class=\"s7\">To keep its community engaged and active, Filecoin (FIL) recently announced the first-ever Dev Summit. As per the official notification from Filecoin (FIL), the summit will take place in September 2023 in both Ireland and Singapore.</p>\n<p class=\"s7\">Under this summit, Filecoin (FIL) will provide developers with a chance to shape the network&rsquo;s protocol and tooling. However, the price movement of Filecoin (FIL) has remained in the red zone for the past many weeks. Subsequently, the trading price of Filecoin (FIL) has plunged by more than 11% in the last month.</p>\n<p class=\"s7\">At press time, a Filecoin (FIL) token can be purchased at $4.12.</p>\nPomerdoge (POMD) Presale Surges In Value\n<p class=\"s7\">A recent market report has suggested that the global blockchain gaming market size can surge to $301.53 billion over the next seven years. Subsequently, it has also become a favorite of investors looking to strengthen their portfolios.</p>\n<p class=\"s7\">To make the most out of this growth opportunity, Pomerdoge, a new P2E meme coin, has unveiled a hybrid business plan. Pomerdoge has the best features of two verticals: the popularity of meme coins, and the utility of gaming tokens. It will soon introduce a new P2E game, Pomergame, with several exciting features. One of them is allowing players to build their avatars, and create customized in-game assets.</p>\n<p class=\"s7\">Another important component of the platform is Pomerplace. It will provide an arena where players can compete against each other to earn rewards. They can also sell or trade their customized in-game items at Pomerplace to generate extra income. Pomerdoge has announced releasing 7,777 NFTs during the presale. However, only POMD owners will be allowed to purchase these NFTs, which will offer a range of benefits.</p>\n<p class=\"s7\">The presale phase of Pomerdoge is undergoing the first round, and a POMD token costs $0.008. Notably, it was just $0.007 at the time of the presale launch. Experts express confidence that the token&rsquo;s value will jump by 1,700% during the presale. It is also likely to offer a 4,000% ROI to its presale investors by the end of 2023. After the presale, POMD tokens will be available to purchase on the Uniswap exchange.</p>\n<p class=\"s17\">Find out more about the Pomerdoge (POMD) Presale Today</p>\n<p class=\"s17\">Website: https://pomerdoge.com/</p>\n<p class=\"s17\">Telegram Community: https://t.me/pomerdoge</p>\n<p class=\"s7\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-23T07:30:28.000Z",
    "title": "Nigerian Crypto Trading Platform Unilaterally Converts User Funds to New Stablecoin — Move Sparks Exit Scam Fears",
    "url": "https://news.bitcoin.com/nigerian-crypto-trading-platform-unilaterally-converts-user-funds-to-new-stablecoin-move-sparks-exit-scam-fears/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2247888569-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Nigerian Crypto Trading Platform Unilaterally Converts User Funds to New Stablecoin — Move Sparks Exit Scam Fears\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2247888569-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2247888569-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2247888569-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2247888569-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2247888569-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2247888569-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2247888569.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A Nigerian crypto trading platform, Patricia, announced on Aug. 18 that it had converted users&#x2019; outstanding funds to its U.S.-backed stablecoin known as &#x201C;Patricia Token.&#x201D; Some social media users have slammed the crypto trading platform&#x2019;s unilateral decision to convert customer funds. Some critics have characterized the conversion of user funds as the Patrica team&#x2019;s attempt [&#8230;]"
  }
]