[
  {
    "source": "CoinDesk",
    "date": "2024-02-07T10:58:25.000Z",
    "title": "Rollup Platform Dymension’s DYM Reaches $5.2B Valuation After Botched Start",
    "url": "https://www.coindesk.com/tech/2024/02/07/rollup-platform-dymensions-dym-reaches-52b-market-cap-after-botched-start/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "As of Wednesday morning, validator “Big Brain Staking” holds over 35% of staked DYM tokens – attracting criticism from DYM holders for its large network influence."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-07T10:40:58.000Z",
    "title": "Hong Kong Chamber of Commerce Wants Chinese Yuan-Backed Stablecoin",
    "url": "https://decrypt.co/216221/hong-kong-chinese-yuan-stablecoin",
    "description": "The business advocacy organization suggested the issuance of yuan-backed stablecoins alongside the launch of a \"Virtual Asset Connect Scheme.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-07T10:59:08.000Z",
    "title": " Texas firm faces criminal probe for misleading US voters with Joe Biden AI ",
    "url": "https://cointelegraph.com/news/texas-us-voter-joe-biden-ai-robocall",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZTE5MWI1MTgtN2Q5Yi00ZjQ3LWI0NDUtZWQyM2Q5YzIyMDY1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Attorney General’s Office Election Law Unit identified the people and entities responsible for misleading voters using AI-generated robocalls that sound like President Joe Biden.</p>\n                    <p><p>The perpetrator behind the robocall featuring what sounded to many like United States President Joe Biden’s voice instructing citizens in New Hampshire not to vote in the Jan. 23 primary has been revealed to be Life Corporation and an individual named Walter Monk.</p><p>In an <a href=\"https://www.doj.nh.gov/news/2024/20240206-voter-robocall-update.html\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a> from the New Hampshire Department of Justice, Attorney General John M. Formella stated that the Attorney General’s Office Election Law Unit identified the source as a Texas-based firm, Life Corporation, that has been caught slinging disinformation before and an individual named Walter Monk.</p><p>The automated messages were generated by an artificial intelligence (AI) deepfake tool to meddle in the 2024 presidential election. The state attorney general’s office <a href=\"https://cointelegraph.com/news/ai-artificial-intelligence-deepfakes-fool-voters-politicians-2024-us-presidential-elections\">labeled the robocalls as misinformation</a>, advising New Hampshire voters to ignore the message.</p><p><a href=\"https://cointelegraph.com/news/texas-us-voter-joe-biden-ai-robocall\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-07T10:50:46.000Z",
    "title": "DeFi ecosystem rebounds to 18-month high of $60 billion in assets, signaling investor confidence resurgence",
    "url": "https://cryptoslate.com/defi-ecosystem-rebounds-to-18-month-high-of-60-billion-in-assets-signaling-investor-confidence-resurgence/",
    "description": "<p>The decentralized finance (DeFi) ecosystem has hit a significant milestone as the total value of assets locked (TVL) surpassed $60 billion, marking a return to levels last seen in August 2022. According to data from DeFiLlama, the sector surged by an impressive 68% to $60.72 billion from November 2023, when the TVL stood at around [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/defi-ecosystem-rebounds-to-18-month-high-of-60-billion-in-assets-signaling-investor-confidence-resurgence/\">DeFi ecosystem rebounds to 18-month high of $60 billion in assets, signaling investor confidence resurgence</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T11:05:21.000Z",
    "title": "Crypto investors scored big in 2023- Reports",
    "url": "https://www.cryptopolitan.com/crypto-investors-scored-big-in-2023-reports/",
    "description": "Amidst a tumultuous period for the cryptocurrency market, 2023 marked a significant turnaround for investors, with data from crypto tax software provider CoinLedger revealing an average net gain of $887.60 per investor. This stark contrast from the losses experienced in 2022 underscores a notable recovery in the industry. Market analysis and trends CoinLedger&#8217;s analysis of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T10:58:29.000Z",
    "title": "Hong Kong’s bold plan with Yuan-linked stablecoins",
    "url": "https://www.cryptopolitan.com/hong-kongs-plan-with-yuan-linked-stablecoins/",
    "description": "The Hong Kong General Chamber of Commerce (HKGCC) has put forward recommendations for the upcoming budget, advocating the introduction of Chinese yuan-linked stablecoins as part of the region&#8217;s financial landscape. These proposals come amidst efforts to enhance Hong Kong&#8217;s economic environment and address manpower shortages. The HKGCC, in a statement released on Tuesday, emphasized the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T10:54:10.000Z",
    "title": "UBS intensifies cost reductions amid Credit Suisse merger",
    "url": "https://www.cryptopolitan.com/ubs-cost-cuts-amid-credit-suisse-merger/",
    "description": "The banking behemoth UBS has found itself navigating turbulent waters as it reports back-to-back quarterly losses, a direct fallout from its bold move to rescue its beleaguered competitor, Credit Suisse. This financial quagmire saw UBS posting a $279 million loss in the last quarter of the previous year, a figure slightly less grim than market [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T10:50:44.000Z",
    "title": "Peter Schiff challenges SEC authority on dealer registration",
    "url": "https://www.cryptopolitan.com/peter-schiff-challenges-sec-authority/",
    "description": "Peter Schiff, a well-known financial commentator and critic of Bitcoin, has voiced strong opposition to the recent regulations passed by the Securities and Exchange Commission (SEC) affecting market participants in the cryptocurrency and securities sectors. The SEC&#8217;s new rules mandate individuals and entities involved in substantial trading activities, including those dealing with crypto assets and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T10:46:56.000Z",
    "title": "U.S. SEC delays decision on spot Ether ETF, sending mixed signals to investors",
    "url": "https://www.cryptopolitan.com/u-s-sec-delays-decision-on-spot-ether-etf/",
    "description": "The U.S. Securities and Exchange Commission (SEC) has opted to postpone its decision regarding a proposed spot ether (ETH) exchange-traded fund (ETF), a joint venture between Invesco and Galaxy Digital, as disclosed in a recent filing. This move underscores the ongoing uncertainty surrounding the regulatory landscape of cryptocurrency investment products in the United States. The [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-07T11:02:22.000Z",
    "title": "DYM surges by 25% amid mainnet launch",
    "url": "https://crypto.news/dym-surges-by-25-amid-mainnet-launch/",
    "description": "Blockchain platform token Dymension DYM soars after announcing the launch of its mainnet. According to CoinMarketCap data, over the past 24 hours, the token has risen in price by more than 25% to $5.00. Trading volumes jumped by 3,098,114% over&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-07T10:54:06.000Z",
    "title": "Spot XRP ETF’s prospects; Rebel Satoshi rising on strong market activity",
    "url": "https://crypto.news/spot-xrp-etfs-prospects-rebel-satoshi-rising-on-strong-market-activity/",
    "description": "The possibility of a spot XRP ETF in the U.S. and the emergence of Rebel Satoshi (RBLZ) continues to trend"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-07T10:49:20.000Z",
    "title": "Access Protocol’s ACS up 55% following new use case for cNFTs",
    "url": "https://crypto.news/access-protocols-acs-up-55-following-new-use-case-for-cnfts/",
    "description": "Access Protocol&#8217;s native token ACS soared by over 50% within 24 hours after the project revealed new use cases for collateral non-fungible tokens (cNFTs). Access Protocol, a Solana-based protocol aiming to create a new way content creators can earn money,&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-07T10:43:55.000Z",
    "title": "CleanSpark to double hash rate with new mining facility acquisitions ahead of Bitcoin halving",
    "url": "https://crypto.news/cleanspark-to-double-hash-rate-with-new-mining-facility-acquisitions-ahead-of-bitcoin-halving/",
    "description": "Publicly traded Bitcoin (BTC) mining firm CleanSpark has expanded its operations through the acquisition of four new mining facilities, significantly increasing its hashing power ahead of the anticipated Bitcoin halving event in April 2024.  On Feb. 6, CleanSpark announced the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-07T11:08:35.000Z",
    "title": "Cardano Price Stagnant At $0.48, But Charts Point To Potential Upswing",
    "url": "https://www.newsbtc.com/news/cardano-price-stagnant-at-0-48-but-charts-point-to-potential-upswing/",
    "description": "Cardano (ADA), the eighth-largest cryptocurrency, finds itself in a perplexing situation as it grapples with a battle between bullish and bearish forces, leaving investors deciphering mixed signals in a turbulent market. Related Reading: Dogecoin Massive Dump: 100 Million DOGE Floods Robinhood, Investors Brace For Price Impact The optimism that briefly emerged on January 29th, as ADA&#8217;s market structure turned bullish, proved short-lived, unable to overcome the critical $0.50 support level, and remaining stuck in the $0.48 territory. Social media sentiment, often a precursor to price movements, has not provided solace either. Santiment&#8217;s &#8220;weighted social sentiment&#8221; metric has steadily declined over the past ten days, reflecting tepid investor confidence. Source: Coingecko ADA&#8217;s Metrics: Confusion Amidst Bullish Signals The confusion deepens when examining on-chain metrics. While the negative MVRV ratio suggests ADA might be undervalued, the sustained presence in negative territory raises concerns. Conversely, the increasing number of active addresses, signaling heightened network activity, offers a glimmer of hope for bullish investors. Complicating the outlook is the liquidation heatmap from Hyblock. Two prominent zones add complexity: the $0.45-$0.48 region, hosting an estimated $300 million in liquidation levels, and the $0.52-$0.54 zone, carrying similar selling pressure. A drop to the former could trigger buying activity as long positions close, while the latter&#8217;s fate hinges on Bitcoin&#8217;s (BTC) movement, given ADA&#8217;s tendency to follow its lead. ADA currently trading at $0.4809 on the daily chart: TradingView.com Industry experts remain divided on Cardano&#8217;s future. Santiment suggests that the increased bearish sentiment might hint at an impending price bounce, while others exercise caution, citing the lack of definitive follow-through after the initial bullish market structure shift. 🐻 With #crypto market caps ranging and lacking the usual growth traders have been accustomed to since the #bullcycle began in October, there is a notable #bearish sentiment that has taken hold of #crypto discourse this week. #Bitcoin, #Ethereum, #BinanceCoin, (Cont) 👇 pic.twitter.com/c3M4bPxlhi — Santiment (@santimentfeed) February 5, 2024 Source: Santiment Cardano Dips Amidst Stability: Mixed Signals Cardano (ADA) is currently navigating a bearish trend, experiencing a 2.93% decrease in the past 24 hours and declines of 1.13% and 10.33% over the past week and month respectively. Despite this dip, it maintains its position as the 8th largest cryptocurrency by market cap, suggesting some underlying stability. Related Reading: Ronin Plunges Nearly 30% After Binance Debut, Raising Concerns About Pre-Listing Hype While the short-term technical picture appears bleak, longer-term indicators offer potential for cautious optimism. The increasing number of active addresses hints at growing network activity, a potential bullish sign. Additionally, the negative MVRV ratio, although concerning in its extended presence, could indicate undervaluation. However, this needs to be balanced against the crucial resistance zones identified around $0.54-$0.56, which could hinder upward momentum. Overall, ADA&#8217;s future trajectory remains uncertain. Further analysis would benefit from exploring the reasons behind the recent price decline, potential catalysts for recovery, and a deeper dive into long-term fundamentals like development progress and adoption rate. Featured image from Freepik, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-07T11:05:23.000Z",
    "title": "Floki: The Memecoin Maestro of This Bull Market Cycle, Says Crypto Guru",
    "url": "https://www.crypto-news-flash.com/floki-the-memecoin-maestro-of-this-bull-market-cycle-says-crypto-guru-2/?utm_source=rss&utm_medium=rss&utm_campaign=floki-the-memecoin-maestro-of-this-bull-market-cycle-says-crypto-guru-2",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/Floki-Inu.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Floki-Inu\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/Floki-Inu.png 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/Floki-Inu-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/Floki-Inu-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/Floki-Inu-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/Floki-Inu-1536x864.png 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />One crypto analyst says Floki is the crypto to watch this year, drawing parallels with DOGE in 2021 when it went on a record-breaking price surge after trading sideways and accumulating. The analyst also backed Chainlink and Solana to set new highs this year, with the “extremely undervalued” LINK projected to hit $100, a 500% [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-07T11:00:19.000Z",
    "title": "Market Watch: Arbitrum and Shiba Inu See Varied Fortunes as Rebel Satoshi Continues Its Upward Trajectory",
    "url": "https://www.crypto-news-flash.com/market-watch-arbitrum-and-shiba-inu-see-varied-fortunes-as-rebel-satoshi-continues-its-upward-trajectory/?utm_source=rss&utm_medium=rss&utm_campaign=market-watch-arbitrum-and-shiba-inu-see-varied-fortunes-as-rebel-satoshi-continues-its-upward-trajectory",
    "description": "<img width=\"1200\" height=\"750\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T115828.841.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T115828.841.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T115828.841-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T115828.841-768x480.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T115828.841-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-07T115828.841-450x281.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Competition from the Manta network could reduce Arbitrum’s (ARB) investor sentiment. Shiba Inu (SHIB) also crossed into February 2024 on a bearish note. RebelSatoshi ($RBLZ) could become a main player in the crypto ecosystem after selling over 116 million tokens. Arbitrum (ARB) holders are wary of competition from the recently released Manta network. Shiba Inu’s [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-07T10:46:11.000Z",
    "title": "MetaMask and Robinhood Forge Integration: Streamlining Crypto Access for Users",
    "url": "https://www.crypto-news-flash.com/metamask-and-robinhood-forge-integration-streamlining-crypto-access-for-users/?utm_source=rss&utm_medium=rss&utm_campaign=metamask-and-robinhood-forge-integration-streamlining-crypto-access-for-users",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/NvirWorld_Metamask1_1671447053UX0TDh54AI.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/NvirWorld_Metamask1_1671447053UX0TDh54AI.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/NvirWorld_Metamask1_1671447053UX0TDh54AI-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/NvirWorld_Metamask1_1671447053UX0TDh54AI-1024x576.jpg 1024w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Consensys has partnered with Robinhood to integrate the latter&#8217;s Connect platform into MetaMask, the most popular Web3 wallet, allowing easy crypto purchases and self-custody. The two have focused on making crypto easy to venture into for novice traders, and with the partnership, customers will enjoy the best of both worlds. Ethereum incubator and Web3 powerhouse [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-07T10:59:33.000Z",
    "title": "MetaMask and Robinhood Connect Ease US Crypto Buys",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/metamask-and-robinhood-connect-ease-us-crypto-buys/",
    "description": "<p>This collaboration marks a noteworthy step towards simplifying the process of purchasing cryptocurrencies for users across the US. By incorporating Robinhood Connect into the MetaMask Buy crypto aggregator, the partnership aims to streamline the transaction experience. This offers a more accessible entry point for users looking to dive into the world of digital assets. Robinhood [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/metamask-and-robinhood-connect-ease-us-crypto-buys/\">MetaMask and Robinhood Connect Ease US Crypto Buys</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-07T11:09:21.000Z",
    "title": "Ripple Seeks Deadline Extension After Court Upheld the SEC’s Remedies Discovery Request",
    "url": "https://coinedition.com/ripple-seeks-deadline-extension-after-court-upheld-the-secs-remedies-discovery-request/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Ripples-100m-defense-against-an-SEC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Ripples-100m-defense-against-an-SEC.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Ripples-100m-defense-against-an-SEC-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Ripples-100m-defense-against-an-SEC-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Ripples-100m-defense-against-an-SEC-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Ripples-100m-defense-against-an-SEC-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Ripple has requested a one-week extension of the deadline for remedies-related discovery in its case against the U.S. Securities and Exchange Commission (SEC). On February 6, through its lawyer, Ripple applied to the judge for the deadline to be extended from February 12 to February 20, 2024. Ripple cited delays in resolving the dispute over [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ripple-seeks-deadline-extension-after-court-upheld-the-secs-remedies-discovery-request/\">Ripple Seeks Deadline Extension After Court Upheld the SEC’s Remedies Discovery Request</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-07T10:46:27.000Z",
    "title": "Renowned Economist Criticizes The SEC Over Recent “Security Dealer” Enactment",
    "url": "https://coinedition.com/renowned-economist-criticizes-the-sec-over-recent-security-dealer-enactment/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Grayscale-Files-Reply-Brief-to-SEC-Denial-of-its-Spot-BTC-Conversion.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"U.S. Parliament Summons SEC Chair Over Role in FTX Investigation\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Grayscale-Files-Reply-Brief-to-SEC-Denial-of-its-Spot-BTC-Conversion.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Grayscale-Files-Reply-Brief-to-SEC-Denial-of-its-Spot-BTC-Conversion-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Grayscale-Files-Reply-Brief-to-SEC-Denial-of-its-Spot-BTC-Conversion-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Grayscale-Files-Reply-Brief-to-SEC-Denial-of-its-Spot-BTC-Conversion-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Grayscale-Files-Reply-Brief-to-SEC-Denial-of-its-Spot-BTC-Conversion-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Grayscale-Files-Reply-Brief-to-SEC-Denial-of-its-Spot-BTC-Conversion-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Peter Schiff, American stockbroker and Chief Economist at Euro Pacific Asset Management, the U.S. Securities and Exchange Commission (SEC) is seizing powers beyond its jurisdiction. Schiff noted that the regulator unilaterally changed the definition of a “security dealer” to allow it to regulate something that is not.  In a recent post on X, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/renowned-economist-criticizes-the-sec-over-recent-security-dealer-enactment/\">Renowned Economist Criticizes The SEC Over Recent “Security Dealer” Enactment</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]