[
  {
    "source": "Cointelegraph",
    "date": "2023-09-29T17:45:00.000Z",
    "title": "Costo sells out of gold bars, but is it a better investment than Bitcoin?",
    "url": "https://cointelegraph.com/news/costo-sells-out-of-gold-bars-is-it-a-better-investment-than-bitcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/9fc6ff5d-9601-42eb-8250-8a458f3de7e7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Gold bars recently sold out at Costco, reflecting investors’ souring mood about the economy. Is there a silver lining for Bitcoin?</p>\n                    <p><p>Costco has made <a href=\"https://www.cnbc.com/2023/09/27/costco-is-selling-gold-bars-and-they-are-selling-out-within-a-few-hours.html\" target=\"_blank\" rel=\"noopener nofollow\">headlines</a> this week after it rapidly sold out of gold bars. In times of economic uncertainty and rising inflation, it's no surprise that investors are turning to traditional safe-haven assets like gold. The question is whether gold’s performance will eventually catapult its price above $2,050, a level last seen in early May.</p><p>In the past 12 months, the price of gold has surged by an impressive 12%. This rally has been partially fueled by the Federal Reserve's efforts to combat inflation by maintaining higher interest rates, a move that benefits scarce assets like gold. While gold's performance is commendable, it's essential to put it into perspective. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/88e5fe8e-476a-4939-a892-00f2b1e28023.png\"  /><figcaption style=\"text-align: center;\"><em>Gold (yellow) vs. Bitcoin (orange), S&amp;P 500 (green) and WTI oil (black), last 12 months. Source: TradingView</em></figcaption></figure><p>Over the same period, gold's returns have roughly matched those of the S&amp;P 500, which saw a gain of 15.4%, and WTI oil, which increased by 12%. However, these gains pale in comparison to Bitcoin's staggering 39.5% rise. Still, it's important to note that gold's lower volatility at 12% makes it an attractive choice for investors looking to manage risk.</p><h2>Risk-reward scenarios favor gold</h2><p>One of gold's strongest selling points is its reliability as a store of value during times of crisis and uncertainty. Gold's status as the world's largest tradable asset, valued at over $12 trillion, positions it as the primary candidate to benefit from capital inflows whenever investors exit traditional markets like stocks and real estate.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/48b2b290-836d-4c82-b124-6b1f985ecd9d.png\"  /><figcaption style=\"text-align: center;\"><em>Gold (yellow) vs. Bitcoin (orange), S&amp;P 500 (green) and WTI oil (black), Feb/Mar 2020. Source: TradingView</em></figcaption></figure><p>For example, at the height of the COVID-19 pandemic. In the 30 days leading up to March 24, 2020, gold only dipped by 2.2%. </p><p>According to data from Gold.org, central banks have been net buyers of gold for the second consecutive month, adding 55 tons to their reserves, with notable purchases by China, Poland and Turkey. </p><p>Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-08-03/russia-to-restart-buying-currency-gold-as-energy-income-revives\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that Russia is planning to bolster its gold reserves by an additional $433 million to shield its economy from the volatility of commodity markets, especially in the oil and gas industries.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/7aa918a8-d638-44aa-915d-71188df3b273.jpg\"  /><figcaption style=\"text-align: center;\"><em>200 years of gold production. Source: Visual Capitalist</em></figcaption></figure><p>Taking a closer look at production figures, Visual Capitalist estimates that approximately 3,100 tonnes of gold were produced in 2022, with Russia and China accounting for 650 tonnes of this total. The World Gold Council also predicted that if gold prices continue to rise, total production could reach a record high of 3,300 tonnes in 2023.</p><p>One crucial metric to consider when evaluating gold's investment potential is its stock-to-flow ratio, which measures the production of a commodity relative to the total quantity in existence. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-price-holds-steady-as-s-p-500-plunges-to-110-day-low\"><strong><em>Bitcoin price holds steady as S&amp;P 500 plunges to 110-day low</em></strong></a></p><p>Gold's stock-to-flow has remained stable at around 67 for the past 12 years. In contrast, Bitcoin has experienced three scheduled halvings, effectively reducing its issuance, and currently boasts a stock-to-flow ratio of 59. This suggests that Bitcoin has a lower equivalent inflation rate compared to the precious metal.</p><h2>Bitcoin can outperform gold even with lower inflows</h2><p>Bitcoin’s performance could surpass gold’s as the U.S. government approaches a shutdown due to reaching the debt limit, causing investors to seek alternative scarce assets. Bitcoin’s $500 billion market capitalization makes it easier for the price to jump even if its inflow is much smaller. Additionally, central banks could be compelled to sell their gold holdings to cover expenses, further boosting Bitcoin's appeal.</p><p>There's also the possibility of new gold discoveries. While gold remains a stalwart in the world of safe-haven assets, Bitcoin's impressive gains and lower equivalent inflation rate make it a strong contender for investors seeking alternative stores of value. Despite this, the ongoing economic uncertainty and the Federal Reserve's monetary policies will continue to benefit both assets.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-29T17:40:38.000Z",
    "title": "Bitcoin ETFs: A $600 billion tipping point for crypto",
    "url": "https://cointelegraph.com/news/bitcoin-etfs-600-billion-tipping-point-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/4379bba1-b987-4bc9-87fd-e6a96917868a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A new report indicated Bitcoin ETFs could release $600 billion in new demand — double Bitcoin's current market cap. Here's some math behind the estimates.</p>\n                    <p><p>A United States appellate court<a href=\"https://cointelegraph.com/news/grayscale-wins-court-battle-what-does-this-mean-for-spot-bitcoin-etf\"> directed the Securities and Exchange Commission (SEC)</a> in August to reassess its denial of Grayscale's application for a Bitcoin exchange traded fund (ETF). A little-noted consequence of that decision is that it could open the floodgates for $600 billion in new cash to enter the cryptocurrency market.</p><p>ETFs provide investors with a regulated way to gain exposure to different asset classes, including Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). The approval of a <a href=\"https://cointelegraph.com/news/lawmakers-call-sec-chair-approve-spot-bitcoin-etf\">Bitcoin ETF</a> could democratize investment in the cryptocurrency sector, drawing parallels to how the iShares MSCI Brazil ETF and the VanEck Brazil Small-Cap ETF have democratized investing in the Brazilian market.</p><p>Despite some hurdles, market analysts anticipate potential Bitcoin ETF approval by early 2024. A Bitcoin ETF could unlock an estimated $600 billion in new demand, according to a September report by analysts at Bernstein, more than doubling the approximately $550 billion fully diluted market cap at which Bitcoin stands today.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/10-years-later-no-bitcoin-etf\"><strong><em>10 years later, still no Bitcoin ETF — but who cares?</em></strong></a></p><p>However, these predictions are speculative, with the actual outcome depending on various factors such as market dynamics, company strategies, and regulatory responses. Notably, the SEC has delayed the decision on Cathie Wood's Ark 21Shares Bitcoin ETF application several times already. In August, Wood expressed her expectation for these delays, stating that she believed the SEC would approve multiple Bitcoin ETFs simultaneously. But on Sept. 26, the SEC <a href=\"https://cointelegraph.com/news/sec-pushes-deadline-ark-21shares-spot-bitcoin-etf\">extended the decision period</a> further, to Jan. 10.</p><p>SEC Chair Gary Gensler's delays and rejections of Bitcoin ETF applications have drawn criticism and fueled investor frustration. A bipartisan group of lawmakers urged Gensler this mo to grant immediate approval for an ETF, arguing that post-Grayscale court decision, there's no reason to deny spot crypto ETFs, which they believe would enhance investor safeguards. This Congressional pressure further complicates the path to Bitcoin ETF approval, adding to the uncertainty as the ARK 21Shares Bitcoin ETF decision date approaches. </p><p>In tandem with the SEC's deliberations over Bitcoin ETFs, major players in the crypto industry are actively lobbying for new rules. Coinbase, for instance, is spearheading one of the largest lobbying pushes in the crypto industry, aiming to garner support among lawmakers for the introduction of new regulations. As we continue to observe these unfolding developments, it becomes increasingly clear that the future of crypto regulations is being hotly contested.</p><p>Recent developments suggest more potential delays in the approval of Bitcoin ETFs on the whole. James Seyffart, a Bloomberg ETF analyst, speculated that the SEC's recent decisions may have dampened prospects for ETF approval in 2023. Filings from major players such as <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-application-delayed-sec?__cf_chl_rt_tk=4n.YQf5DgNA4BactkiLHbijXAElel4J2x7XYWUn4dyY-1695911995-0-gaNycGzNEmU\">BlackRock</a>, <a href=\"https://cointelegraph.com/news/bitwise-amends-spot-bitcoin-etf-application-new-detailed-argumentation\">Bitwise</a>, and Wisdomtree are slated for review in the third week of October. However, the SEC's recent actions on ARK 21Shares have sparked speculation that other filings due for review in mid-October, including those from VanEck, Invesco, Fidelity, and Valkyrie — could also experience delays. So it remains to be seen whether there will be any significant updates on these applications soon.</p><p>To better understand the implications of these ETFs, let's delve into the concept of Assets Under Management (AUM). AUM represents the total market value of the financial assets an entity or advisor manages on behalf of their clients. This crucial metric in the investment world serves as an indicator of performance. Consider the following table for more insight.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/663e7adc-92c0-42cd-b2fb-b2c65e0efdce.jpg\"  /></figure><p>Financial institutions with higher AUM, like BlackRock, could generate more revenue from management fees if they successfully launch a Bitcoin ETF. </p><p>As competition in the Bitcoin ETF market intensifies, it may drive down management fees, impacting revenue.</p><p>Investment firms charge these fees for managing funds, typically ranging from 0.20% to 2.00%. A trend of decreasing management fees has been observed recently, due to increased competition, cost-effective investment strategies, and investor demand for transparency.</p><h3>How does Grayscale generate revenue from ETFs?</h3><p>Grayscale generates its revenue from its Exchange-Traded Funds (ETFs), such as the proposed Bitcoin ETF, through management fees. These fees are calculated as a percentage of the total assets under management (AUM).</p><p>For its existing product, the Grayscale Bitcoin Trust (GBTC), the company charges an annual fee of 2%.</p><p>Let's break down how this works with some real numbers. If we take the reported $16.2 billion in assets in the Bitcoin Trust and apply the 2% management fee, it means that Grayscale would generate $324 million per year in management fees from the Bitcoin Trust alone.</p><p>If Grayscale succeeds in converting GBTC to a Bitcoin ETF, the AUM could potentially increase due to the appeal of ETFs to institutional investors, boosting management fees. However, Grayscale plans to lower fees upon conversion to an ETF, although specific figures have not been provided.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blacks-misguided-crypto-dummies-etf\"><strong><em>BlackRock’s misguided effort to create ‘Crypto for Dummies’</em></strong></a></p><p>The conversion is subject to SEC approval. Grayscale recently won a legal case against the SEC, paving the way for spot Bitcoin ETF approval. Simultaneously, the SEC extended its decision-making period on ARK 21Shares Bitcoin ETF.</p><p>Bitcoin ETF approval would be a significant step towards mainstream crypto acceptance. The court ruling questions the SEC's sole authority over digital assets, suggesting other entities like courts and Congress can influence crypto regulations. This could lead to wider crypto acceptance, making Bitcoin investing more accessible and regulated, attracting more capital to the crypto market.</p><p>The potential approval could also have geopolitical implications, setting a precedent for other countries and accelerating global adoption of cryptocurrencies.</p><p>Of course, numerous hurdles remain, notwithstanding the court's ruling. But it signified progress, and rewards await those ready to embrace change.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Constantin Kogan</strong> is a co-founder of BullPerks and GamesPad, a partner at BitBull Capital, the founder of Adwivo, and a former managing director at Wave Financial. He holds a Ph.D. in sociology from National Pedagogical Dragomanov University in Kyiv, a master’s degree in education, and is fluent in five languages (English, Russian, Ukrainian, French, and Hebrew). He’s been a blockchain technology enthusiast and investor since 2012.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph. </em></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-29T18:05:59.000Z",
    "title": "Google Bard Picks for Q4 2023: Hedera, Kangamoon, dYdX",
    "url": "https://cryptodaily.co.uk/2023/09/google-bard-picks-for-q4-2023-hedera-kangamoon-dydx",
    "description": "We have asked Google Bard, the popular AI chatbot, about its price prediction for Hedera (HBAR), dYdX (DYDX) , and Kangamoon (KANG) In 2023. Here are the results."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-29T18:00:45.000Z",
    "title": "Breaking Price Predictions: Polygon and Apecoin Face Resistance While Everlodge Revolutionizes Timeshares Industry with Enhanced Liquidity!",
    "url": "https://cryptodaily.co.uk/2023/09/breaking-price-predictions-polygon-and-apecoin-face-resistance-while-everlodge-revolutionizes-timeshares-industry-with-enhanced-liquidity",
    "description": "Polygon and ApeCoin are two well-established projects in the crypto space. However, these tokens continue to face resistance at key levels, with experts predicting possible paths for them. Meanwhile, Everlodge has sparked excitement in the timeshares market, promising to bring new liquidity levels to the industry."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-29T18:00:39.000Z",
    "title": "Bitcoin’s Hashrate Holds Steady Above 400 EH/s Amid Sky-High Network Difficulty",
    "url": "https://news.bitcoin.com/bitcoins-hashrate-holds-steady-above-400-eh-s-amid-sky-high-network-difficulty/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin&#039;s Hashrate Holds Steady Above 400 EH/s Amid Sky-High Network Difficulty\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Amid the soaring network difficulty, Bitcoin&#x2019;s hashrate remains resilient, firmly holding above the 400 exahash per second (EH/s) frontier. A total of 43 mining pools channel their hashpower at the Bitcoin blockchain, yet, it&#x2019;s Foundry USA&#x2019;s pool that ruled the roost this month, seizing a 29.36% share of the total hashrate over the past 30 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T18:05:24.000Z",
    "title": "Bitwise shifts gears: Ethereum Futures ETFs take center stage amid Bitcoin ETF challenge",
    "url": "https://www.cryptopolitan.com/bitwise-shifts-gears-ethereum-futures-etfs/",
    "description": "Bitwise Asset Management, the leading crypto index fund manager in the United States, has filed Form 8-As for two new Ethereum futures ETFs, AETH and BTOP. These ETFs are scheduled to be listed and commence trading on Monday, October 2. Additionally, Bitwise has submitted amended registration statements for ETFs, AETH and BTOP. Bitwise files for ... <a title=\"Bitwise shifts gears: Ethereum Futures ETFs take center stage amid Bitcoin ETF challenge\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitwise-shifts-gears-ethereum-futures-etfs/\" aria-label=\"More on Bitwise shifts gears: Ethereum Futures ETFs take center stage amid Bitcoin ETF challenge\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T17:48:24.000Z",
    "title": "Navigating the Generative AI Spending Dilemma",
    "url": "https://www.cryptopolitan.com/the-generative-ai-spending-dilemma/",
    "description": "Enterprises are rushing to embrace generative AI as it becomes an essential priority for boards and executive leadership. However, the question of how to fund this transformative technology looms large, sparking a crisis of spending in the IT landscape. In this article, we explore the challenges CIOs face in financing generative AI initiatives, the potential ... <a title=\"Navigating the Generative AI Spending Dilemma\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-generative-ai-spending-dilemma/\" aria-label=\"More on Navigating the Generative AI Spending Dilemma\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T17:43:39.000Z",
    "title": "Trusting AI in Mining and the Ten Pillars of Transformation",
    "url": "https://www.cryptopolitan.com/trusting-ai-in-mining/",
    "description": "The mining industry is poised for a technological revolution as it navigates the challenges of integrating artificial intelligence (AI) into its operations. With fluctuating ore properties, changing conditions, and low data quality, mining requires a unique approach to ensure AI adoption is not just successful but also builds trust among users. Here are the ten ... <a title=\"Trusting AI in Mining and the Ten Pillars of Transformation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/trusting-ai-in-mining/\" aria-label=\"More on Trusting AI in Mining and the Ten Pillars of Transformation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T17:40:17.000Z",
    "title": "Prepare for an Unforgettable Journey: WOW Summit Dubai 2023, the Epitome of Luxurious Web3 Experience",
    "url": "https://www.cryptopolitan.com/prepare-for-an-unforgettable-journey-wow-summit-dubai-2023-the-epitome-of-luxurious-web3-experience/",
    "description": "Dubai, September, 2, 2023 &#8211; Brace yourself for an extraordinary experience that transcends limits and propels you into a realm of unmatched grandeur and innovation. Welcome to the World of Web3 Summit Dubai, widely hailed as the WOW SUMMIT Dubai—the most monumental Blockchain extravaganza in the Middle East. Get ready to be immersed in the ... <a title=\"Prepare for an Unforgettable Journey: WOW Summit Dubai 2023, the Epitome of Luxurious Web3 Experience\" class=\"read-more\" href=\"https://www.cryptopolitan.com/prepare-for-an-unforgettable-journey-wow-summit-dubai-2023-the-epitome-of-luxurious-web3-experience/\" aria-label=\"More on Prepare for an Unforgettable Journey: WOW Summit Dubai 2023, the Epitome of Luxurious Web3 Experience\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-29T18:00:36.000Z",
    "title": "Bitcoin Eyes Turnaround: Could A New All-Time High Be On The Horizon? Analyst Predicts",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-eyes-turnaround-could-a-new-all-time-high/",
    "description": "Crypto Rover, a seasoned cryptocurrency trader and analyst, has recently shared insights suggesting that Bitcoin&#8217;s current trajectory may change. Based on the latest technical analysis, Bitcoin might soon paint a brighter, bullish picture. Bitcoin Break From The Bearish Shackles In his recent analysis, Crypto Rover explained Bitcoin&#8217;s price action shift. It&#8217;s been noted that the leading crypto is making headway in breaking a longstanding negative trend that has persisted for 77 days. This shift marks a monumental moment for Bitcoin, which had been entrapped in bearish confines for a considerable duration. Related Reading: Bitcoin’s Hidden Threat? Miner Revenue Sent To Exchanges Surges Over 300% Crypto Rover&#8217;s assertions are not without merit. The analyst anticipates a more concrete bullish reversal if BTC sustains a break above the $27,200 mark. It is worth noting that the achievement of such a feat could give traders and investors the confidence to venture deeper into BTC, given the positive momentum. Beyond this threshold, Rover further disclosed that a breach above the $31,000 level would serve as an &#8220;unmistakably&#8221; bullish beacon, potentially propelling Bitcoin to scale new all-time highs. In a broader context, BTC seems to be making efforts to break free from its bearish constraints. While its price has mostly ranged between $26,000 and $27,000 zone over the past week, its market capitalization has notably increased by more than $5 billion. BTC&#8217;s 4-hour chart suggests it&#8217;s in a consolidation phase. This could indicate that the top crypto may be bracing for a significant move, as such phases often signal that the market makers are determining the next potential price trajectory. Bitcoin is priced at $26,844, witnessing a nearly 1% drop over the last 24 hours. Its 24-hour trading volume is $15.5 billion, a considerable uptick from the $9.9 billion seen just last Friday. Anticipation Of Regulatory Winds Of Change Furthermore, it&#8217;s not only the charts that dictate the potential bullish swing for Bitcoin. An undercurrent of fundamental factors plays into this optimistic outlook as well. At the core of this optimism is the anticipation surrounding the US Securities and Exchange Commission (SEC) and their forthcoming decisions on Bitcoin spot exchange-traded fund (ETF) applications. Recently, the SEC deferred its decision on the BTC spot ETF application from Blackrock, one of the world&#8217;s leading fund managers. However, Crypto Rover believes that this approval, when it comes, could set off a &#8220;domino effect.&#8221; Related Reading: Bitcoin In Spotlight: Robert Kiyosaki Questions BTC’s Future Amid Citibank’s Blockchain Play According to the analyst, should Blackrock gain the coveted SEC nod, it may pave the way for subsequent approvals for other major institutional players. Such a sequence of green lights could fuel a substantial BTC rally, further solidifying its bullish stance. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-29T17:50:04.000Z",
    "title": "ZTX To Introduce New Virtual World Immersive Features in Upcoming Beta Version to Kickstart Community Activities",
    "url": "https://www.crypto-news-flash.com/ztx-to-introduce-new-virtual-world-immersive-features-in-upcoming-beta-version-to-kickstart-community-activities/?utm_source=rss&utm_medium=rss&utm_campaign=ztx-to-introduce-new-virtual-world-immersive-features-in-upcoming-beta-version-to-kickstart-community-activities",
    "description": "<img width=\"512\" height=\"486\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-29T204643.980.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-29T204643.980.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-29T204643.980-300x285.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />ZTX is working on maintaining the high expectations portrayed during the NFT minting on OpenSea that sold out in a few hours. After the upcoming beta launch, ZTX players can generate income by trading or selling their hard-earned items and resources for real income. The company has partnered with several digital art creators including Lenge [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-29T18:05:00.000Z",
    "title": "Frankie Candles Breaks the Silence Amidst BitBoy and TJ Drama",
    "url": "https://coinedition.com/frankie-candles-breaks-the-silence-amidst-bitboy-and-tj-drama/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Frankie Candles Breaks the Silence Amidst BitBoy and TJ Drama\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy.png 730w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Frankie Candles, a popular cryptocurrency trader opens up about the recent controversies. Hit Network CEO Timothy “TJ” Shedd agreed to sign over full ownership of the Frankie Candles brand. Candles plans to continue creating crypto education and trading content independently. Popular cryptocurrency trader Frankie Candles announced his departure from crypto media group Hit Network amid [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/frankie-candles-breaks-the-silence-amidst-bitboy-and-tj-drama/\">Frankie Candles Breaks the Silence Amidst BitBoy and TJ Drama</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-29T18:05:04.000Z",
    "title": "Bitcoin About To Hit New Highs As ‘Completely New Environment Unfolds’ for BTC, Says Glassnode Co-Founders",
    "url": "https://dailyhodl.com/2023/09/29/bitcoin-about-to-hit-new-highs-as-completely-new-environment-unfolds-for-btc-says-glassnode-co-founders/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/largest-bitcoin-whale-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/largest-bitcoin-whale-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/largest-bitcoin-whale-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/largest-bitcoin-whale-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/largest-bitcoin-whale-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/largest-bitcoin-whale-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/largest-bitcoin-whale-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The co-founders of the crypto analytics firm Glassnode believe that the US Dollar Index (DXY) will soon dip and spark a massive Bitcoin (BTC) bull run. Glassnode co-founders Jan Happel and Yann Allemann, who share the Negentropic handle on the social media platform X, say the DXY appears to have peaked. The DXY is a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/29/bitcoin-about-to-hit-new-highs-as-completely-new-environment-unfolds-for-btc-says-glassnode-co-founders/\">Bitcoin About To Hit New Highs As ‘Completely New Environment Unfolds’ for BTC, Says Glassnode Co-Founders</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]