[
  {
    "source": "CryptoSlate",
    "date": "2023-06-29T11:47:23.000Z",
    "title": "Lido leads as Ethereum locked as liquid staking derivatives hits 10 million",
    "url": "https://cryptoslate.com/lido-leads-as-ethereum-locked-as-liquid-staking-derivatives-hits-10-million/",
    "description": "<p>The total number of Ethereum locked on liquid staking derivatives (LSD) protocols reached 10 million on June 29, according to data from DeFillama. Liquid staking protocols allow users to earn staking rewards while providing liquidity for other crypto-based activities, such as Lido (LDO) and Rocket Pool (RPL). Lido dominates LSDs DeFillama data tracks 22 liquid staking [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/lido-leads-as-ethereum-locked-as-liquid-staking-derivatives-hits-10-million/\">Lido leads as Ethereum locked as liquid staking derivatives hits 10 million</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-29T12:00:00.000Z",
    "title": "Coinbase Moves To Dismiss SEC Lawsuit",
    "url": "https://cryptodaily.co.uk/2023/06/coinbase-moves-to-dismiss-sec-lawsuit",
    "description": "<p>The crypto firm has filed a motion to dismiss the legal case brought against it by the US Securities and Exchange Commission (SEC), citing a lack of jurisdiction and violation of due process.&nbsp;</p>\nCoinbase&rsquo;s Rebuttal To SEC\n<p>The industry is closely following the legal battle between US-based crypto exchange Coinbase and the SEC. In the latest development in the matter, the crypto firm has claimed that the regulatory body has no jurisdiction over Coinbase&rsquo;s offerings. The company has even filed a motion with the US court to dismiss the SEC&rsquo;s complaints on the grounds that the digital assets listed in the Coinbase platform are not considered securities and therefore are not under the SEC&rsquo;s purview. This motion is in direct opposition to the SEC&rsquo;s claim that several cryptocurrencies offered on the exchange&rsquo;s wallets or trading platforms are unregistered securities.&nbsp;</p>\n&ldquo;Cryptos Are Not Investment Contracts&rdquo;\n<p>The SEC had taken its allegations against Coinbase to legal court in early June by filing a lawsuit against the crypto exchange. On June 29, the latter countered back via a 277-page response that declared that these cryptocurrencies do not qualify as investment contracts. This means that these cryptos are not an asset tied to a contract that a promoter could sell for a profit, and the token issuers are not obligated to the investors. Since the profit or loss generated from these crypto transactions depended entirely on the assets themselves and not the company that issued them, Coinbase claimed that they cannot be considered securities. The company mentioned the Supreme Court ruling of the Howey case to support its position.&nbsp;</p>\n<p>The Coinbase filing states,&nbsp;</p>\n\n<p>&ldquo;None of the assets the SEC has now identified are, in fact, securities, and for that and other reasons, secondary transactions in those assets are also not securities. [&hellip;] None of these satisfy Howey&rsquo;s definition of an &ldquo;investment contract.&rdquo; In arguing otherwise, the SEC has advanced a novel construction of the operative term that is divorced from [&hellip;] statutory context the Supreme Court and the Commission itself long ago agreed must inform the term&rsquo;s meaning.&rdquo;</p>\n\nCoinbase Claims Abuse Of Process\n<p>Notably, the company&rsquo;s rebuttal has also pointed fingers at SEC Chair Gary Gensler and his fluctuating stance on the regulating body&rsquo;s jurisdiction. Coinbase also pointed out its repeated requests for clarity on regulation and its voluntary compliance with the rules of various overlapping regulators, including the SEC, its senior staff members, and the courts regarding the application of securities laws to the crypto industry.&nbsp;</p>\n<p>Finally, the motion claims that the case must be dismissed solely on the grounds of violation of Coinbase&rsquo;s rights to due process and alleged abuse of process.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-29T11:45:58.000Z",
    "title": "Binance loses euro banking Paysafe amid global regulatory scrutiny",
    "url": "https://crypto.news/binance-loses-euro-banking-paysafe-amid-global-regulatory-scrutiny/",
    "description": "Paysafe Payment Solutions, Binance&#8217;s European banking partner, said it would terminate support for Binance as it deals with regulatory challenges globally. Binance is reportedly searching for a new provider for euro deposits and withdrawals via the Single Euro Payments Area&#8230;"
  },
  {
    "source": "Kraken Blog",
    "date": "2023-06-29T12:00:14.000Z",
    "title": "Announcing Kraken’s $100M+, $250M+ and $500M+ volume fee tier trial",
    "url": "https://blog.kraken.com/announcing-krakens-100m-250m-and-500m-volume-fee-tier-trial",
    "description": "Starting Aug. 1, 2023 0:00 a.m. UTC through Sept. 30, 2023 11:59 p.m. UTC,* we will offer the following fee tiers: Who is eligible? All clients who trade over $100M, $250M or $500M in total spot crypto volume on a 30-day rolling basis will automatically be placed in this trial’s corresponding fee tier. Trading volume [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-29T12:00:21.000Z",
    "title": "Stablecoin Cap Shows Early Sign Of Reversal, Why This Could Benefit Bitcoin",
    "url": "https://www.newsbtc.com/bitcoin-news/stablecoin-cap-early-signs-of-reversal-why-goodr-bitcoin/",
    "description": "Data shows the stablecoin market cap has returned toward equilibrium and may be gearing up for a reversal. Here&#8217;s how Bitcoin could benefit from this. Aggregate Stablecoin Market Cap Change Has Returned To Equilibrium According to data from the on-chain analytics firm Glassnode, the aggregate stablecoin market cap had previously been in a decline for around 14 months. The &#8220;aggregate stablecoin market cap&#8221; here refers to the combined market cap (that is, the total valuation in USD) of the top five stables in the sector. More specifically, the relevant stablecoins in the current discussion are Tether (USDT), USD Coin (USDC), Binance USD (BUSD), Dai (DAI), and TrueUSD (TUSD). The complete supply of these stables is considered here, regardless of how it is distributed among the different blockchains. Related Reading: Bitcoin Rally Stalls As Short-Term Holder Exchange Inflows Intensify Historically, the combined market cap of these assets has held important information for the sector, as it can provide hints about whether capital is flowing into or out of the market right now. To track the flow of capital, Glassnode has looked at the 30-day percentage change in the aggregate market cap of these fiat-tied tokens. Here is a chart that shows the trend in this indicator over the past few years: The value of the metric seems to have approached the zero mark in recent days &#124; Source: Glassnode on Twitter Naturally, when the value of this metric is positive, it means that the top 5 stablecoins have registered net inflows during the last thirty days. On the other hand, negative values imply outflows have taken place in the past month. From the graph, it&#8217;s visible that the 30-day percentage change in the aggregate stablecoin market cap was quite positive during the 2021 bull run. This would imply that these assets were constantly seeing an expansion in their supplies in this period. Usually, investors make use of stables whenever they want to escape the volatility associated with other cryptocurrencies. Such holders keep their capital in the form of these assets until they want to buy back into a volatile coin like Bitcoin or withdraw into fiat. Obviously, in the former scenario, the purchasing can have a positive effect on the price of the asset they are shifting into. During bull markets, a ton of capital flows into the sector, which is what helps sustain such rallies. Thus, it&#8217;s not a surprise that the stablecoin supply observed expansion during the 2021 bull run. As the bear market began in 2022, however, the indicator&#8217;s value decreased toward the zero level, implying that the outflows started to equal the inflows. A confirmed transition toward net outflows then occurred, as the bearish period kicked into full gear. There was a small period during the relief rally in the middle of the year where the 30-day percentage change again approached the zero market. A transition toward inflows, however, failed, and the indicator became negative once more. The negative values have continued until now, meaning that these top stablecoins have been observing net redemptions for 14 straight months. Recently, though, the metric has again neared equilibrium, meaning that there is potential for breaking into the inflows regime. Related Reading: Bitcoin Correlation To Gold, Silver Drops To Cyclical Lows: Glassnode It&#8217;s unclear whether this reversal will be complete, or if a rejection will happen like during the aforementioned relief rally. If the stablecoin market cap does begin to see an expansion, then it would be a bullish sign for Bitcoin, as it would mean that there is now more capital present in the market in the form of the stables, which may be used to purchase the asset. BTC Price At the time of writing, Bitcoin is trading around $30,400, up 1% in the last week. BTC continues to move sideways &#124; Source: BTCUSD on TradingView Featured image from CoinWire Japan on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-29T12:00:31.000Z",
    "title": "What Is The Best Crypto Coin of June 2023 – Zilliqa (ZIL), Tradecurve (TCRV), Or Aptos (APT)?",
    "url": "https://www.crypto-news-flash.com/what-is-the-best-crypto-coin-of-june-2023-zilliqa-zil-tradecurve-tcrv-or-aptos-apt/?utm_source=rss&utm_medium=rss&utm_campaign=what-is-the-best-crypto-coin-of-june-2023-zilliqa-zil-tradecurve-tcrv-or-aptos-apt",
    "description": "The first half of 2023 has been a tale of two halves. In the first quarter, the cryptocurrency market was on an upward trend, with many market analysts calling it the start of a new bull cycle. However, in the second half, macroeconomic factors coupled with regulator pressure have contributed to a bearish market.  With [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-29T11:52:00.000Z",
    "title": "Multiple Crypto Analysts Predict XRP’s Price May Surge To $5",
    "url": "https://coinedition.com/multiple-crypto-analysts-predict-xrps-price-may-surge-to-5/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/08-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/08-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/08-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/08-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/08-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/08-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/08-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/08-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/08-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/08-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/08-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/08-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/08-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/08-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/08-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/08-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/08-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Over the past few weeks, multiple crypto traders and analysts predicted that Ripple’s (XRP) price could hit $5 by 2024. In one tweet a crypto analyst stated that people should not underestimate the only cryptocurrency that was able to surpass Ethereum (ETH) in market cap. In response to this tweet, another analyst stated that although [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/multiple-crypto-analysts-predict-xrps-price-may-surge-to-5/\">Multiple Crypto Analysts Predict XRP’s Price May Surge To $5</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-29T11:45:34.000Z",
    "title": "Bitcoin To Explode by Up to 1,400% Amid Institutional Interest – Here’s the Timeline: Michaël van de Poppe",
    "url": "https://dailyhodl.com/2023/06/29/bitcoin-to-explode-by-up-to-1400-amid-institutional-interest-heres-the-timeline-michael-van-de-poppe/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Bitcoin-To-Explode-1400.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Bitcoin-To-Explode-1400.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Bitcoin-To-Explode-1400.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Bitcoin-To-Explode-1400.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Bitcoin-To-Explode-1400.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Bitcoin-To-Explode-1400.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Bitcoin-To-Explode-1400.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analyst Michaël van de Poppe is expressing bullish sentiment on Bitcoin (BTC) amid growing interest from institutional investors. Van de Poppe tells his 162,000 YouTube subscribers that Bitcoin could rally by up to 15x in the run-up to the halvening and for several months after. &#8220;We&#8217;re most likely going to have a cycle that&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/29/bitcoin-to-explode-by-up-to-1400-amid-institutional-interest-heres-the-timeline-michael-van-de-poppe/\">Bitcoin To Explode by Up to 1,400% Amid Institutional Interest – Here’s the Timeline: Michaël van de Poppe</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]