[
  {
    "source": "Decrypt",
    "date": "2023-09-27T21:01:15.000Z",
    "title": "Marathon Mined an Invalid Bitcoin Block—Here's What That Means",
    "url": "https://decrypt.co/199005/marathon-mined-an-invalid-bitcoin-block-heres-what-that-means",
    "description": "Marathon (MARA) shares have dipped 2.9% since the accident occurred. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-27T20:40:19.000Z",
    "title": "NiceHash becomes latest crypto firm to leave U.K.",
    "url": "https://cryptoslate.com/nicehash-becomes-latest-crypto-firm-to-leave-u-k/",
    "description": "<p>The cloud mining platform NiceHash said that it will end U.K. access to its services in a statement emailed to users around Sept. 27. The company said that it will no longer provide services to users residing in the United Kingdom starting on Oct. 10, 2023. Individuals residing in the U.K. will not be able [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/nicehash-becomes-latest-crypto-firm-to-leave-u-k/\">NiceHash becomes latest crypto firm to leave U.K.</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-27T20:58:53.000Z",
    "title": "Kraken Reportedly Is Targetting 2024 to Expand Beyond Crypto into Stock Trading",
    "url": "https://www.cryptoglobe.com/latest/2023/09/kraken-targets-2024-to-expand-beyond-crypto-into-stock-trading/",
    "description": "According to Bloomberg, crypto exchange Kraken, which was founded in 2011, is planning to support the trading of US-listed stocks and exchange-traded funds. The new services are set to be offered in the US and the UK via a newly established division named Kraken Securities. Bloomberg reports that Kraken has already obtained the necessary regulatory […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T21:02:34.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-27T21:01:11.000Z",
    "title": "SEC boss scrutinized over crypto rulemaking and FTX ties",
    "url": "https://crypto.news/sec-chair-gary-gensler-scrutinized-over-crypto-rulemaking-and-ftx-ties/",
    "description": "During a Sep. 27 hearing, policymakers hammered Gary Gensler and SEC over a number of issues, including FTX and perceived over-regulation"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-27T20:53:32.000Z",
    "title": "Keyrock, a Belgium-based market maker, approved in Switzerland",
    "url": "https://crypto.news/keyrock-a-belgium-based-market-maker-approved-in-switzerland/",
    "description": "Keyrock, a market maker based in Belgium, announced that it received approval from the Swiss Financial Services Standards Association (VQF)"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-27T20:44:51.000Z",
    "title": "Zilliqa partners with GMEX to launch a blockchain carbon offset platform",
    "url": "https://crypto.news/zilliqa-partners-with-gmex-to-launch-a-blockchain-carbon-offset-platform/",
    "description": "Zilliqa, a layer-1 blockchain, and GMEX Group have launched ZERO13, a carbon offset platform"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-27T21:00:51.000Z",
    "title": "Tellor (TRB) Is Up 640% In 2023, Back To 2021 Highs Ahead of Bitcoin, XRP?",
    "url": "https://www.newsbtc.com/news/tellor-trb-surging-outpaces-bitcoin-xrp/",
    "description": "Tellor (TRB), a decentralized oracle protocol and Chainlink alternative, has been a top performer in the past few months. Looking at price action, TRB is up 640% in 2023, surging 269% in the past month alone and reversing losses of 2022. A spike in trading volume is behind this resurgence, suggesting bull engagement. TRB Prices Rallying, Reverses 2022 Losses With TRB galloping past $44 and 2022 highs, the token has outpaced some of the top coins in the sphere, including XRP and Bitcoin (BTC). For context, Bitcoin is struggling to break above $30,000. On the other hand, XRP has reversed all gains registered following a court ruling declaring XRP as a commodity. TRB is more than 6X from 2023 lows and surging in a crypto winter.  Related Reading: Chainlink (LINK) Brushes Off Market Downtrend, Scores 11% In Last Week A look at onchain data shows that though there are hints of retailers taking profits at spot rates, the number of TRB on exchanges has been dropping in the past week. This contraction indicates that retailers and whales could accumulate, adding more TRB.  An analysis of the top TRB whales with over $1 million of tokens reveals interesting patterns. For instance, a fresh whale, &#8220;0x656&#8221;, holds 111.89K TRB ($6.06 million), a figure accumulated in the past three weeks. Buying at an average of $28.1, the whale has an unrealized profit of over $2.92 million at spot rates. Another new whale, &#8220;0x8f8&#8221;, accumulated 65.7K TRB ($3.6 million) in the past five days at an entry price of $34.5. With TRB edging higher, the associated address has an unrealized profit of $1.33 million.  Moreover, on-chain data shows that these whales mostly received their TRB from Binance and OKX. While prices have been rallying, on-chain trackers reveal that none of the above whales had moved their coins to exchanges. This points to confidence and expectations of more price gains going forward.  Tellor Rallying Because of Chainlink? TRB&#8217;s rally coincided with SWIFT&#8217;s announcement that it had completed its trials leveraging Chainlink&#8217;s Cross-Chain Interoperability Protocol (CCIP) in late August. Then, a SWIFT representative said the goal was to drive interoperability and ensure tokenization reaches its full potential. Days after this news, TRB broke above June highs, cementing its place above $13. Related Reading: Crypto Analyst Predicts Huge Double-Digit Breakout For Bitcoin Price Presently, parallel data suggests that the surge in TRB appears to be driven by fear of missing out, mostly from short-term traders and speculators. IntoTheBlock data on September 27 shows that short-term wallet holders have increased their TRB holdings, with over 72% of TRB holders in the money. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-27T20:55:41.000Z",
    "title": "Global Monetary System and CBDCs Must Evolve Amid Demand for Digital Forms of Cash: Banking Titan Agustín Carstens",
    "url": "https://dailyhodl.com/2023/09/27/current-monetary-system-needs-to-evolve-by-adopting-cbdcs-says-bis-director-agustin-carstens/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/banks-cbdcs-lucky.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/banks-cbdcs-lucky.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/banks-cbdcs-lucky.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/banks-cbdcs-lucky.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/banks-cbdcs-lucky.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/banks-cbdcs-lucky.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/banks-cbdcs-lucky.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The head of the Bank for International Settlements (BIS) says the global monetary system is evolving, and work must be done to ensure central banking digital currencies (CBDCs) are ready for mass adoption. In a new speech, Agustín Carstens says it&#8217;s the responsibility of central banks to create a strong legal framework for CBDCs that ensures [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/27/current-monetary-system-needs-to-evolve-by-adopting-cbdcs-says-bis-director-agustin-carstens/\">Global Monetary System and CBDCs Must Evolve Amid Demand for Digital Forms of Cash: Banking Titan Agustín Carstens</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]