[
  {
    "source": "Cointelegraph",
    "date": "2023-10-19T11:49:44.000Z",
    "title": "New York Attorney General sues Gemini, Genesis, DGC for allegedly defrauding investors ",
    "url": "https://cointelegraph.com/news/gemini-genesis-dgc-sued-by-new-york-attorney-general-for-allegedly-defrauding-investors",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/cde24d8a-b221-42a2-b4aa-108f6ea8acf5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A filing from New York attorney general Letitia James alleges that the cryptocurrency companies defrauded investors of over $1 billion.</p>\n                    <p><p>New York’s attorney general has filed a <a href=\"https://ag.ny.gov/press-release/2023/attorney-general-james-sues-cryptocurrency-companies-gemini-genesis-and-dcg\" target=\"_blank\" rel=\"noopener nofollow\">lawsuit</a> against cryptocurrency firms Gemini, Genesis and Digital Currency Group for allegedly defrauding investors through the Gemini Earn investment program.</p><p>An official statement from the office of attorney general Letitia James outlines the basis of the charges, claiming that the companies defrauded more than 23,000 investors, including 29,000 New York citizens of more than $1 billion.</p><p>An investigation carried out by James’ office claims that Gemini lied to investors about its Gemini Earn investment program which it ran in partnership with Genesis. It claims that while Gemini had assured investors that the program was a low-risk investment, investigations reveal that Genesis’ financials “were risky”:</p><blockquote>“The lawsuit alleges that Gemini knew Genesis’ loans were undersecured and at one point highly concentrated with one entity, Sam Bankman-Fried’s Alameda, but did not reveal this information to investors.”</blockquote><p>The lawsuit also charges Genesis as well as its former CEO Soichiro Moro, parent company DCG and its CEO Barry Silbert with defrauding investors by attempting to conceal more than $1.1 billion in losses. </p><p><a href=\"https://cointelegraph.com/news/genesis-winding-down-crypto-trading-services\"><strong><em>Related: Genesis announces winding down of crypto trading services</em></strong></a></p><p>The lawsuit looks to ban Gemini, Genesis and DCG from operating in the financial investment industry in New York as well as seeking restitution for investment and the return of “ill-gotten gains”.</p><p>A statement from the New York attorney general highlighted the losses suffered by “middle-class investors”:</p><blockquote>“Hardworking New Yorkers and investors around the country lost more than a billion dollars because they were fed blatant lies that their money would be safe and grow if they invested it in Gemini Earn. </blockquote><p>James added that Gemini hid the risks of investing with Genesis, while the company lied to the public about its losses. She also took aim at the wider cryptocurrency industry, describing the fraud as “another example of bad actors causing harm throughout the under-regulated cryptocurrency industry.”</p><p><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Magazine: Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-19T11:45:31.000Z",
    "title": "The 10-year breakeven inflation rate has reached the second-highest level in 2023",
    "url": "https://cryptoslate.com/insights/the-10-year-breakeven-inflation-rate-has-reached-the-second-highest-level-in-2023/",
    "description": "<p>Quick Take Since 2010, the U.S. financial landscape has primarily been marked by the Consumer Price Index (CPI) inflation rate outpacing the federal funds rate. However, this trend experienced an exception in 2019, and interestingly, in May 2023, when the country entered a period of positive real rates &#8211; a scenario where the federal funds [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/the-10-year-breakeven-inflation-rate-has-reached-the-second-highest-level-in-2023/\">The 10-year breakeven inflation rate has reached the second-highest level in 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-19T12:08:23.000Z",
    "title": "Best Cryptocurrencies to Buy Before the Crypto Bull Cycle Begins",
    "url": "https://cryptodaily.co.uk/2023/10/best-cryptocurrencies-to-buy-before-the-crypto-bull-cycle-begins",
    "description": "The next crypto bull cycle is predicted to begin toward the end of October. But it won’t be a wise decision to wait until then to build your portfolio."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-19T12:03:57.000Z",
    "title": "Gensler highlights SEC’s consistent approach to Bitcoin ETFs",
    "url": "https://www.cryptopolitan.com/gensler-highlights-secs-consistent-approach-to-bitcoin-etfs/",
    "description": "In a recent interview with Bloomberg, Gary Gensler, chair of the U.S. Securities and Exchange Commission (SEC), discussed the status of multiple Bitcoin ETF proposals, highlighting the rigorous review process but refraining from specific commentary on the potential for simultaneous approvals. The conversation revealed around ten spot Bitcoin ETF applications are under meticulous examination by ... <a title=\"Gensler highlights SEC&#8217;s consistent approach to Bitcoin ETFs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gensler-highlights-secs-consistent-approach-to-bitcoin-etfs/\" aria-label=\"More on Gensler highlights SEC&#8217;s consistent approach to Bitcoin ETFs\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-19T11:39:43.000Z",
    "title": "The crypto winter thaws: Morgan Stanley Wealth Management weighs in",
    "url": "https://www.cryptopolitan.com/the-crypto-winter-thaws-morgan-stanley-says/",
    "description": "Based on the crypto market price fluctuations, enthusiasts and skeptics alike have been closely monitoring the market’s volatility and the end of the most prolonged crypto winter. The crypto market has experienced several booms and crashes, and this period of turbulence has been termed the crypto winter.&#160; The red market that has been witnessed since ... <a title=\"The crypto winter thaws: Morgan Stanley Wealth Management weighs in\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-crypto-winter-thaws-morgan-stanley-says/\" aria-label=\"More on The crypto winter thaws: Morgan Stanley Wealth Management weighs in\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-19T12:00:23.000Z",
    "title": "Is This The Best Bitcoin Price Indicator Right Now? Must-Know Details",
    "url": "https://www.newsbtc.com/news/bitcoin/best-bitcoin-price-indicator-right-now/",
    "description": "Following recent geopolitical events, the correlation between gold and Bitcoin prices has once again come under scrutiny by market analysts. Here&#8217;s a comprehensive dive into the relationship and its implications. The Gold And Bitcoin Correlation After the recent Israel-Hamas war, gold experienced a rapid uptick in its price. This shift interestingly mirrored movements in the Bitcoin market, emphasizing a revived correlation between the two assets. Skew, a reputable market analyst, shared his insights on X (formerly Twitter), noting on October 11 that &#8220;correlation has been rather loosely applicable to BTC periods of 35 days + where there&#8217;s price disconnection between both markets.&#8221; Related Reading: This Rare Bullish Bitcoin Crossover Could Soon Form, Quant Predicts When However, only days later, on October 16, he observed a potential &#8220;re-correlation&#8221; as both Bitcoin followed the latest gold rally. Today, the statement stands stronger with Skew&#8217;s latest tweet, “BTC &#38; gold correlation still there it seems. Gold may lead the next big move for BTC.&#8221; In his recent insights shared in the Onramp Weekly Roundup, Bitcoin analyst Dylan LeClair emphasized the implications of the ongoing selloff in government bonds. Rising costs for long-term financing directly influence the global cost of capital, offering a valuation yardstick for various assets. More significantly, the treasury market underpins the global financial ecosystem. Its current instability could pressure asset prices and exacerbate the pre-existing debt cycle, potentially endangering the US&#8217;s fiscal position. This precarious state contrasts sharply with the US administration&#8217;s fiscal actions, as evidenced by plans like the &#8220;WHITE HOUSE EYES $100 BILLION UKRAINE, ISRAEL AND BORDER ASK&#8221;, suggesting a lack of fiscal restraint, according to LeClair. Gold, Real Yields, And The Changing Landscape Further complicating matters, Bill Dudley, former president of the Federal Reserve Bank of New York, in his recent Bloomberg piece, noted the likelihood of the current cycle of quantitative tightening (QT) persisting until late 2025. This prolonged QT could heighten long-term interest rates and risk treasury market turbulence. Yet, should severe dysfunction manifest in the treasury market, the Federal Reserve might reconsider its QT trajectory. Interestingly, post the Russia-Ukraine conflict and the subsequent confiscation of Russia&#8217;s G7 reserves, gold, and real yields have shown an atypical positive correlation, challenging their historical negative relationship. In this evolving geopolitical landscape where even G7 sovereign debt isn&#8217;t immune to confiscation, traditional &#8216;safe assets&#8217; are being reevaluated.  This uncertainty combined with the not-so-safe “risk free” yield from treasuries has bolstered gold&#8217;s position (and price) as a counter-risk monetary asset and may push Bitcoin on a similar trajectory. According to LeClair: This repositioning, however, isn&#8217;t limited to gold alone. Bitcoin, with its unique advantages and growing liquidity profile, is on a similar trajectory, albeit still in the very early stages of its monetization with a $500b market cap. The Best BTC Price Indicator? Under these current conditions, the price of gold may be a leading indicator for the price of Bitcoin, assuming that the correlation between the two assets continues. This would imply that Bitcoin is classified as a &#8220;safe haven&#8221; asset like gold by a majority of investors, rather than a &#8220;risk asset&#8221;. Related Reading: Bitcoin Dominance Rises: Why Altcoin Buying May Need A Break However, this view is not shared by all. James Butterfill, the head of research at CoinShares, pointed out that the Bitcoin market has shifted its focus after the fake news regarding a spot Bitcoin ETF approval. He remarked that investors now seem to prioritize the ETF approval over macro expectations, placing less emphasis on the Federal Reserve&#8217;s actions. Since the Coin Telegraph tweet mistake on a Bitcoin Spot ETF approval, Bitcoin prices have decoupled from December interest rate expectations &#8211; it seems like investors are solely focussed on the ETF approval now, and not what the FED does. At press time, Bitcoin traded at $28,450. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-19T12:00:44.000Z",
    "title": "US Government Emerges as a Dominant Bitcoin Whale: On-Chain Findings Reveal",
    "url": "https://www.crypto-news-flash.com/us-government-emerges-as-a-dominant-bitcoin-whale-on-chain-findings-reveal/?utm_source=rss&utm_medium=rss&utm_campaign=us-government-emerges-as-a-dominant-bitcoin-whale-on-chain-findings-reveal",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-86.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-86.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-86-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-86-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The US government reportedly holds over 194,188 BTC, amounting to a staggering $5.5 billion. This accumulation represents nearly 1% of Bitcoin&#8217;s entire circulating supply. US Government&#8217;s Immense Bitcoin Reserve Unveiled The ever-evolving digital ledger known as the blockchain has unmasked a surprising new titan in the Bitcoin realm: the US government. Recent on-chain analyses by [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-19T11:43:00.000Z",
    "title": "Binance France Director Resigns: Latest Senior Executive to Leave the Exchange",
    "url": "https://coinedition.com/binance-france-director-resigns-latest-senior-executive-to-leave-the-exchange/",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://coinedition.com/wp-content/uploads/2022/09/silhouette-trader-office-before-infographics-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/silhouette-trader-office-before-infographics-scaled.jpg 2560w, https://coinedition.com/wp-content/uploads/2022/09/silhouette-trader-office-before-infographics-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/silhouette-trader-office-before-infographics-1024x576.jpg 1024w, https://coinedition.com/wp-content/uploads/2022/09/silhouette-trader-office-before-infographics-768x432.jpg 768w, https://coinedition.com/wp-content/uploads/2022/09/silhouette-trader-office-before-infographics-1536x864.jpg 1536w, https://coinedition.com/wp-content/uploads/2022/09/silhouette-trader-office-before-infographics-2048x1152.jpg 2048w, https://coinedition.com/wp-content/uploads/2022/09/silhouette-trader-office-before-infographics-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/silhouette-trader-office-before-infographics-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/silhouette-trader-office-before-infographics-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2022/09/silhouette-trader-office-before-infographics-1392x783.jpg 1392w, https://coinedition.com/wp-content/uploads/2022/09/silhouette-trader-office-before-infographics-1068x601.jpg 1068w, https://coinedition.com/wp-content/uploads/2022/09/silhouette-trader-office-before-infographics-1920x1080.jpg 1920w, https://coinedition.com/wp-content/uploads/2022/09/silhouette-trader-office-before-infographics-747x420.jpg 747w, https://coinedition.com/wp-content/uploads/2022/09/silhouette-trader-office-before-infographics-1493x840.jpg 1493w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" /><p>Stéphanie Cabossioras, the managing director of Binance France, has recently resigned from her position, becoming the latest senior executive to leave Binance this year. Her departure marks at least the tenth high-ranking executive to leave the crypto exchange this year. This recent departure was acknowledged by David Prinçay, the President of Binance France, who expressed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-france-director-resigns-latest-senior-executive-to-leave-the-exchange/\">Binance France Director Resigns: Latest Senior Executive to Leave the Exchange</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-19T11:45:57.000Z",
    "title": "Whales Holding at Least $1,572,000,000 in Ethereum Now Own Nearly 33% of Total ETH Supply, Says Santiment",
    "url": "https://dailyhodl.com/2023/10/19/whales-holding-at-least-1572000000-in-ethereum-now-own-nearly-33-of-total-eth-supply-says-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/Whales-Holding-at-Least.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/Whales-Holding-at-Least.jpg 1748w, https://dailyhodl.com/wp-content/uploads/2023/10/Whales-Holding-at-Least.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/Whales-Holding-at-Least.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/Whales-Holding-at-Least.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/Whales-Holding-at-Least.jpg?resize=1536,900 1536w, https://dailyhodl.com/wp-content/uploads/2023/10/Whales-Holding-at-Least.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/10/Whales-Holding-at-Least.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Blockchain analytics platform Santiment says that crypto whales are accumulating massive amounts of Ethereum (ETH). Santiment says that addresses holding at least one million ETH have accumulated more than 32% of the total supply, the most since 2016. The firm also says big ETH transactions are heating up. &#8220;Ethereum&#8217;s whale addresses in the billionaire tier [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/19/whales-holding-at-least-1572000000-in-ethereum-now-own-nearly-33-of-total-eth-supply-says-santiment/\">Whales Holding at Least $1,572,000,000 in Ethereum Now Own Nearly 33% of Total ETH Supply, Says Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]