[
  {
    "source": "CryptoSlate",
    "date": "2023-09-25T07:35:46.000Z",
    "title": "South Korea to screen major shareholders of crypto exchanges over eligibility concerns",
    "url": "https://cryptoslate.com/south-korea-to-screen-major-shareholders-of-crypto-exchanges-over-eligibility-concerns/",
    "description": "<p>Financial authorities in South Korea intend to initiate stringent eligibility reviews for major shareholders of cryptocurrency exchanges, mirroring the standards upheld within the banking sector, local media reported on Sept. 22. The move comes amid increasing legal turmoil involving shareholders of prominent domestic exchanges such as Bithumb and Upbit. Rule reform The Financial Intelligence Unit [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/south-korea-to-screen-major-shareholders-of-crypto-exchanges-over-eligibility-concerns/\">South Korea to screen major shareholders of crypto exchanges over eligibility concerns</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-25T07:35:33.000Z",
    "title": "Adapting to Esports Winter – Industry Shifts and Strategies for Long-Term Success in 2023",
    "url": "https://www.cryptopolitan.com/adapting-to-esports-shifts-and-strategies/",
    "description": "In 2023, the esports industry has witnessed a series of transformations as the initial flood of investment dollars from 2021 and 2022 has tapered off. This shift has prompted brands to reevaluate their spending in the esports sector, resulting in a contraction of the industry. Esports organizations like Misfits and CLG have divested from competitive ... <a title=\"Adapting to Esports Winter &#8211; Industry Shifts and Strategies for Long-Term Success in 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/adapting-to-esports-shifts-and-strategies/\" aria-label=\"More on Adapting to Esports Winter &#8211; Industry Shifts and Strategies for Long-Term Success in 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-25T07:29:45.000Z",
    "title": "Upbit faces a whopping $3.4 Billion scam with counterfeit Aptos (APT) tokens",
    "url": "https://www.cryptopolitan.com/upbit-3-billion-scam-counterfeit-apt-tokens/",
    "description": "South Korea&#8217;s foremost cryptocurrency exchange, Upbit, has encountered a significant setback following the detection of a counterfeit deposit on its platform. A duplicitous group of scammers managed to present a sham coin as the authentic Aptos (APT) token, leading to one of the largest digital currency security breaches in modern history. The unraveling of the ... <a title=\"Upbit faces a whopping $3.4 Billion scam with counterfeit Aptos (APT) tokens\" class=\"read-more\" href=\"https://www.cryptopolitan.com/upbit-3-billion-scam-counterfeit-apt-tokens/\" aria-label=\"More on Upbit faces a whopping $3.4 Billion scam with counterfeit Aptos (APT) tokens\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-25T07:26:10.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 How much is Bitcoin (BTC) worth? Today, the price of Bitcoin stands at $26,119, with a trading volume over the past 24 hours reaching $44.09 billion. Its market capitalization is $505.83 billion, and it currently commands 47.80% of the market share. Over the last 24 hours, the BTC price has experienced ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-25T07:25:06.000Z",
    "title": "The United Nations Takes Center Stage in Global AI Governance Discussions",
    "url": "https://www.cryptopolitan.com/united-nations-ai-governance-discussions/",
    "description": "In just a few short years, artificial intelligence (AI) has transformed from a niche topic to a central focus at the United Nations General Assembly, drawing the attention of world leaders and tech giants alike. As the possibilities and perils of AI continue to unfold, the international community is looking to the United Nations to ... <a title=\"The United Nations Takes Center Stage in Global AI Governance Discussions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/united-nations-ai-governance-discussions/\" aria-label=\"More on The United Nations Takes Center Stage in Global AI Governance Discussions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-25T07:24:53.000Z",
    "title": "Writers Guild Reaches Tentative Agreement to End Five-Month Strike",
    "url": "https://www.cryptopolitan.com/writers-guild-reaches-tentative-agreement/",
    "description": "In a noteworthy turn of events, the Writers Guild (WGA) has successfully hammered out a tentative agreement with the Alliance of Motion Picture and Television Producers (AMPTP), effectively putting an end to the protracted strike that has plagued the entertainment industry for nearly five months. This pivotal agreement comes after both parties resolved their longstanding ... <a title=\"Writers Guild Reaches Tentative Agreement to End Five-Month Strike\" class=\"read-more\" href=\"https://www.cryptopolitan.com/writers-guild-reaches-tentative-agreement/\" aria-label=\"More on Writers Guild Reaches Tentative Agreement to End Five-Month Strike\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-25T07:14:42.000Z",
    "title": "Korean Generative AI Startups Unite to Form Pioneering Association",
    "url": "https://www.cryptopolitan.com/korean-generative-ai-startups-unite/",
    "description": "In a significant development for the Korean artificial intelligence (AI) landscape, twenty innovative generative AI startups have joined forces to establish the &#8220;Generative AI Startup Association.&#8221; This pioneering association aims to create an efficient and socially responsible ecosystem for AI players within South Korea. Launching this association marks a significant step towards fostering the growth ... <a title=\"Korean Generative AI Startups Unite to Form Pioneering Association\" class=\"read-more\" href=\"https://www.cryptopolitan.com/korean-generative-ai-startups-unite/\" aria-label=\"More on Korean Generative AI Startups Unite to Form Pioneering Association\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-25T07:12:07.000Z",
    "title": "Why law firm Fenwick & West says it is not to blame for FTX’s mess",
    "url": "https://www.cryptopolitan.com/why-law-firm-fenwick-west-says-it-is-not-to-blame-for-ftxs-mess/",
    "description": "The law firm Fenwick &#38; West has filed a motion to dismiss allegations that it played a role in the fraud committed by its client, the cryptocurrency exchange FTX. The motion, filed by lawyers from Gibson, Dunn &#38; Crutcher, marks Fenwick&#8217;s first public defense against claims that it helped FTX conceal millions in stolen customer ... <a title=\"Why law firm Fenwick &#38; West says it is not to blame for FTX&#8217;s mess\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-law-firm-fenwick-west-says-it-is-not-to-blame-for-ftxs-mess/\" aria-label=\"More on Why law firm Fenwick &#38; West says it is not to blame for FTX&#8217;s mess\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-25T07:30:20.000Z",
    "title": "Ethereum Founder Vitalik Buterin Reveals The Challenges Of The Network",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-challenges-vitalik-buterin/",
    "description": "The Ethereum blockchain is notable for its smart contract functionality and various other things. However, many might not be conversant with the challenges the network encounters. In a recent interview, Ethereum’s founder, Vitalik Buterin, revealed the biggest of them all. Ethereum’s Biggest Challenge Speaking with CNBC, Buterin mentioned that the biggest challenge that the “Ethereum ecosystem” faces is ensuring that it builds products that provide value to its users. According to him, the last decade was test-running, but now Ethereum needs to provide utility.   Ethereum is known to host some of the biggest decentralized applications (dApps), including prominent decentralized exchanges (DEXs) like Uniswap, Curve Finance, and Sushiswap. The network has also grown massively to the extent that several Ethereum layer-2 networks have sprung up in a bid to scale the network. Related Reading: Bitwise Withdraws Application, A Big Blow To Ethereum ETFs? Despite this, it seems that Buterin believes that there is more to be done, even as Ethereum has asserted itself as the go-to network for dApps and other decentralized solutions. Meanwhile, ETH, its native token, is the second-largest cryptocurrency by market cap.  Buterin also spoke about how cryptocurrencies enjoy greater use in less-developed countries as people use crypto tokens to make payments and for savings.  Cryptocurrencies have long been touted as a hedge against inflation, and it would seem that crypto is being put to use where it is needed most. A recent report by Chainalysis showed that the highest-ranked countries for crypto adoption are being plagued with a devaluing fiat currency.   The Ethereum founder also stated that centralized entities like Binance need to take a back seat for crypto adoption to move forward. While he appreciates these entities&#8217; role in growing the crypto industry, he believes crypto needs to become more decentralized.  His reason for saying this isn’t far-fetched as he noted that these entities are vulnerable to “both pressure from the outside and to themselves being corrupted.” Truly, centralized entities have taken many hits this past year, which has had far-reaching consequences on the industry.  Last year, one of the biggest crypto exchanges, FTX, collapsed, which had several ripple effects on the crypto industry and market. Meanwhile, the two largest crypto exchanges by trading volume, Binance, and Coinbase, are currently embroiled in legal battles against the SEC. ETH price sits at $1,578 &#124; Source: ETHUSD on Tradingview.com The Future Of Ethereum Last year, Ethereum transitioned from a proof-of-work consensus mechanism to proof-of-stake following the Merge. Buterin stated this move has made the network more decentralized as it is “harder to shut down” than a proof-of-work network.  He also banished the idea that the network was heavily reliant on him, which many had identified as a weakness as the government could easily go after him to clamp down on the network.  Related Reading: What The Drop In Spot And Derivatives Volumes Means For The Price Of Bitcoin According to him, Ethereum has grown to become independent of him and the Ethereum Foundation. He points out how several independent applications on the blockchain have taken the workload off him and made the network more autonomous.   As to Ethereum’s future plans and projects, he said that the network is focused on privacy and scaling with the help of zero-knowledge (ZK) rollups. ZK rollups are layer-2 scaling solutions that help scale the Ethereum network by moving computation off-chain, thereby reducing the computing workload on the network. It also promotes privacy, as one can verify transactions without knowing what it is about.  Featured image from Bloomberg, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-25T07:24:16.000Z",
    "title": "VeChain (VET) is Teaming Up with AT&T, T-Mobile, and Verizon to Conquer the Billion-Dollar Future Market",
    "url": "https://www.crypto-news-flash.com/vechain-vet-is-teaming-up-with-att-t-mobile-and-verizon-to-conquer-the-billion-dollar-future-market/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-vet-is-teaming-up-with-att-t-mobile-and-verizon-to-conquer-the-billion-dollar-future-market",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"VeChain Reebonz\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-2.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-2-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-2-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-2-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />VeChain joins forces with telecom giants for a bigger slice of the blockchain market. An influential presence in upcoming connectivity event signifies VeChain&#8217;s escalating market reach. Drawing insights from our recent coverage on VeChain&#8217;s ascendancy in the blockchain realm, a pertinent update has emerged that underscores its market trajectory. As iterated in a recent tweet [...]"
  }
]