[
  {
    "source": "Cointelegraph",
    "date": "2023-08-31T05:13:00.000Z",
    "title": "Coinbase CEO reveals top 10 crypto ideas he's urging devs to work on",
    "url": "https://cointelegraph.com/news/coinbase-ceo-brian-armstrong-reveals-crypto-ideas-hes-excited-for",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/2a5d1cdf-933d-4b63-ae36-efe12d2d2bb8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>From flatcoins to on-chain advertisements, Brian Armstrong hopes aspiring developers take the time in the bear market to build out these crypto concepts. </p>\n                    <p><p>Coinbase CEO Brian Armstrong has unveiled the ten ideas he is most excited about when it comes to crypto's future, sharing hopes that developers can use the bear market to take them to the next level.</p><p>On Aug. 30, the Coinbase boss shared his vision of a crypto future in a company <a href=\"https://www.coinbase.com/blog/request-for-builders-startups-i-would-build-today\" target=\"_blank\" rel=\"noopener nofollow\">blog post</a> and presentation — sharing the concepts he believes have the potential to make it in the digital asset industry.</p><p>“I decided to share my 10 top ideas with the hope that someone goes out and builds them,” he said before adding, “Ideas are cheap.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ I&#39;m sharing the 10 ideas I&#39;m most excited about in crypto right now. If you&#39;re building something in crypto or thinking about doing so - check it out.<br><br>We’re building lots at Coinbase, but we don&#39;t have time to tackle everything. So I figured I&#39;d share these. Bear markets are… <a href=\"https://t.co/XKzCkMaOOT\">pic.twitter.com/XKzCkMaOOT</a></p>&mdash; Brian Armstrong ️ (@brian_armstrong) <a href=\"https://twitter.com/brian_armstrong/status/1696923807855042601?ref_src=twsrc%5Etfw\">August 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>One of the first concepts he discussed was a “flatcoin” — a decentralized stablecoin that tracks inflation to preserve purchasing power, which could be backed by a basket of assets or use an algorithmic approach. </p><p>Armstrong cited services like Ampleforth and Truflation which \"offer a way to potentially track inflation on-chain today, to further decentralize it.\"</p><p>He said something like this was necessary because people are reluctant to spend Bitcoin and fiat-backed stablecoins \"suffer from inflation and seizure — just like fiat money.\"</p><p>Another concept was “on-chain reputation” — a system that assigns reputation scores to wallet addresses or <a href=\"https://cointelegraph.com/news/ethereum-name-service-adds-fiat-payments-for-ens-domain-registrations\">ENS names</a> based on on-chain activity. It would be similar to Google’s PageRank and used for lending, ratings, and fraud prevention.</p><p>Armstrong also highlighted the potential of “onchain ads” — the Web3 version of adverts that would pay out based on on-chain actions as opposed to Web2 ads that are view or click-based. They could have smart contracts that can specify payouts and wallets that can choose which ads to show.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/9114e59d-d604-48f6-b1dc-529511b86403.jpg\"  /><figcaption style=\"text-align: center;\"><em>Coinbase crypto concepts. Source: Coinbase.com</em></figcaption></figure><p>“Onchain capital formation” — another idea — was described by Armstrong as a concept that democratizes fundraising, helping the next iteration of <a href=\"https://cointelegraph.com/learn/initial-coin-offering\">ICOs</a> and startups raise money on-chain in a compliant and trusted way. </p><p>Armstrong acknowledged the ICO frenzy happened for a reason stating, “capital formation globally is still way too high friction,” before adding: </p><blockquote>“Democratizing fundraising could unlock tremendous latent entrepreneurial energy across the world.”</blockquote><p>Armstrong was also hopeful for a marketplace for crypto jobs and tasks, which could help people find crypto jobs globally, allowing jobs to pay in crypto and removing cross-border payment friction. Coinbase recently partnered with X (formerly Twitter) to launch a jobs posting feature.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Coinbase is thrilled to partner with <a href=\"https://twitter.com/X?ref_src=twsrc%5Etfw\">@X</a> on the launch of a shiny new hiring feature - directly in our profile. Explore job opportunities while you scroll <a href=\"https://twitter.com/X?ref_src=twsrc%5Etfw\">@X</a> on mobile, desktop, and beyond.  <a href=\"https://twitter.com/hashtag/LiveCrypto?src=hash&amp;ref_src=twsrc%5Etfw\">#LiveCrypto</a> <a href=\"https://twitter.com/hashtag/NowHiring?src=hash&amp;ref_src=twsrc%5Etfw\">#NowHiring</a> <a href=\"https://t.co/s2SHlXpMEt\">pic.twitter.com/s2SHlXpMEt</a></p>&mdash; Coinbase ️ (@coinbase) <a href=\"https://twitter.com/coinbase/status/1696629598103183749?ref_src=twsrc%5Etfw\">August 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Armstrong’s sixth idea was “privacy for layer 2,” which brings private transactions to L2 instead of having them only on public blockchains. </p><p>“There are many cases where transparency is a feature, but people do not want most transactions in the economy to be public,” he said. </p><p>Other ideas included a fully on-chain peer-to-peer exchange, on-chain games with asset ownership and more real-world asset tokenization. </p><p>On-chain games are already a live concept in crypto that lets players truly own in-game assets as NFTs, creating economies and metaverse worlds. Real-world asset tokenization — such as stocks, commodities, real estate, and other assets is also already used around the world</p><p>A recent report from Boston Consulting Group expected the tokenization of illiquid assets to grow into a <a href=\"https://cointelegraph.com/news/tokenization-of-illiquid-assets-to-reach-16t-by-2030-report\">multi-trillion-dollar sector</a> over the next few years. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinbase-celebrates-art-music-and-gaming-with-a-three-week-blockchain-event\"><strong><em>Coinbase celebrates art, music, and gaming with a three-week blockchain event</em></strong></a></p><p>Armstrong’s final idea was “Software for Network States” which are tools to help startup cities and communities manage governance, voting, taxes, and services, on-chain.</p><p>“In five years, many entrepreneurs will be looking back wishing they had started a crypto company in 2023,” he said before concluding “Bear markets are for building.” </p><p>Coinbase has been gearing up for its inaugural Coinbase Ventures Builder Summit in California in October and Armstrong’s recent public appearance could be an attempt to spark interest for it. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/wolf-of-all-streets-world-bitcoin-hits-1m-1-million-hall-of-flame/\"><strong><em>Hall of Flame: Wolf Of All Streets worries about a world where Bitcoin hits $1M</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-31T05:30:59.000Z",
    "title": "South African Crypto Premium Surge After Kraken Abruptly Starts Blocking Deposits by Local Residents",
    "url": "https://news.bitcoin.com/south-african-crypto-premium-surge-after-kraken-abruptly-starts-blocking-deposits-by-local-residents/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"South African Crypto Premium Surge After Kraken Abruptly Starts Blocking Deposits by Local Residents\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The premium on crypto assets listed on South African exchanges briefly surged to 3.5% after Kraken&#8217;s abruptly started blocking deposits from users based in the African country. Some South African crypto experts have linked Kraken&#8217;s decision to the Financial Action Task Force&#8217;s recent addition of the African country to its greylist. Impact of the FATF&#8217;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T05:29:49.000Z",
    "title": "Neural Fields in Focus at SIGGRAPH 2023",
    "url": "https://www.cryptopolitan.com/neural-fields-in-focus-at-siggraph-2023/",
    "description": "At this year&#8217;s SIGGRAPH event, the center of attention was undoubtedly the discussion and presentation of Neural Radiance Fields (NeRFs), marking a significant shift in visual computing. From scholarly papers to educational courses and technology demonstrations, NeRFs took the spotlight, emphasizing their transformative potential. The concept gained prominence due to the recognition it received last ... <a title=\"Neural Fields in Focus at SIGGRAPH 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/neural-fields-in-focus-at-siggraph-2023/\" aria-label=\"More on Neural Fields in Focus at SIGGRAPH 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T05:24:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-31T05:17:53.000Z",
    "title": "XRP Price Prediction – Topside Bias Vulnerable Unless Bulls Clear This Hurdle",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-prediction-0-55/",
    "description": "Ripple’s token price is showing bearish signs below $0.550 against the US Dollar. XRP price could start another decline if it trades below $0.500. Ripple’s token price is struggling to recover above $0.540 and $0.550 against the US dollar. The price is now trading below $0.550 and the 100 simple moving average (4 hours). There is a major bearish trend line forming with resistance near $0.540 on the 4-hour chart of the XRP/USD pair (data source from Kraken). The pair might start another decline if there is a break below $0.500. Ripple’s Token Price Eyes Fresh Increase After a sharp decline to $0.40, Ripple’s XRP started a recovery wave against the US Dollar. The price recovered above the $0.48 and $0.50 resistance levels, like Bitcoin and Ethereum. The price was able to surpass the $0.520 resistance as well. Finally, there was a spike above the 50% Fib retracement level of the key drop from the $0.6655 swing high to the $0.3995 low. The bulls are now facing an uphill task near $0.550. XRP is still trading below $0.540 and the 100 simple moving average (4 hours). There is also a major bearish trend line forming with resistance near $0.540 on the 4-hour chart of the XRP/USD pair. Source: XRPUSD on TradingView.com Initial resistance on the upside is near the $0.540 zone and the trend line. The next major resistance is near the $0.550 level or the 61.8% Fib retracement level of the key drop from the $0.6655 swing high to the $0.3995 low. A successful break above the $0.550 resistance level might send the price toward the $0.60 resistance. Any more gains might call for a test of the $0.625 resistance. Another Drop in XRP? If ripple fails to clear the $0.550 resistance zone, it could start another decline. Initial support on the downside is near the $0.505 zone. The next major support is at $0.500. If there is a downside break and a close below the $0.500 level, XRP’s price could extend losses. In the stated case, the price could retest the $0.435 support zone. Technical Indicators 4-Hours MACD – The MACD for XRP/USD is now losing pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $0.505, $0.500, and $0.435. Major Resistance Levels – $0.540, $0.550, and $0.600."
  }
]