[
  {
    "source": "Decrypt",
    "date": "2023-08-08T12:21:14.000Z",
    "title": "Kenyan Authorities Raided a Worldcoin Warehouse Last Week",
    "url": "https://decrypt.co/151719/kenyan-authorities-raided-worldcoin-warehouse-last-week",
    "description": "Kenyan officials raided a Worldcoin warehouse last week, reportedly claiming it failed to disclose its intentions when it registered in Kenya."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-08T12:24:11.000Z",
    "title": "How Self-Sovereign Identity helps users own their data",
    "url": "https://cointelegraph.com/news/self-sovereign-identity-helps-users-own-data",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/e544c699-02ad-47d7-97a7-243288104c21.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>SHIB’s lead developer Shytoshi Kusama recently unveiled plans to integrate Self-Sovereign Identity into Shiba Inu projects.</p>\n                    <p><p>Data has always been a sensitive topic since the advent of the internet. Various challenges like misuse and improper data management have led many to search for a solution — and some believe that it could be found in Web3 through Self-Sovereign Identity (SSI). </p><p>Various projects have introduced SSI within their protocols. One of the most recent projects to do this is the popular dog-themed token project called Shiba Inu (<a href=\"https://cointelegraph.com/shiba-inu-price-index\">SHIB</a>). The project’s pseudonymous lead developer Shytoshi Kusama has recently <a href=\"https://blog.shib.io/shib-ssi-why-wen/\" target=\"_blank\" rel=\"noopener nofollow\">unveiled</a> their plans to integrate SSI into all Shiba Inu projects. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Check out our latest blog post: “Shib SSI: What, Why, &amp; Wen!”  Discover the exciting world of Self-Sovereign Identity and how it revolutionizes our ecosystem. Read it here: <a href=\"https://t.co/5HMrcyAl5C\">https://t.co/5HMrcyAl5C</a></p>&mdash; Shib (@Shibtoken) <a href=\"https://twitter.com/Shibtoken/status/1688217075733450753?ref_src=twsrc%5Etfw\">August 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In a statement sent to Cointelegraph, Kusama described SSI as a concept that emphasizes individuals' control and ownership over their personal data. According to the developer, it lets users create, manage and share their identity information without centralized intermediaries. Kusama explained that: </p><blockquote>“Shib SSI relies on decentralized technologies, like Shibarium, to enable secure, private, and verifiable identity interactions, empowering individuals with greater privacy and control over their online identities.”</blockquote><p>According to Kusama, Shiba Inu is utilizing this technology as another way to \"empower\" their decentralized community. The developer said that they are looking toward a future where this tech is integrated into the full Shibarium ecosystem. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/learn/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\"><strong><em>What is Web 3.0: A beginner's guide to the decentralized internet of the future</em></strong></a></p><h2>How SSI addresses Web2 data challenges</h2><p>Web2 has always faced various <a href=\"https://cointelegraph.com/news/crypto-at-risk-after-facebook-leak-here-s-how-hackers-can-exploit-data\">challenges in data management</a> due to its centralized nature. According to BNB Chain’s senior solution architect Arno Bauer, SSI addresses these challenges and improves how data is managed.</p><p>By aligning Web3 principles of data ownership and utilizing technologies like zero-knowledge (ZK) and soulbound tokens (SBT), Bauer noted that SSI enables a more secure, private and user-centric internet. “Web2 identity systems, being centralized, are prone to challenges such as potential data leakage and duplicated KYC storage,” he explained. </p><p>Bauer also told Cointelegraph in a statement that integrating SSI offers many potential benefits for Web3 projects. This includes compliance with specific regulations without disclosing sensitive Know Your Customer (KYC) information and risk controls. Bauer explained: </p><blockquote>“By enhancing identity verification, SSI helps in avoiding scams and mitigating risks like Distributed Denial of Service (DDOS) attacks, thereby increasing the overall security of the platform.”</blockquote><p>When it comes to users, Bauer believes that SSI can provide privacy protection and data commercialization. Because users have control over who has access to their data, they can protect their privacy and avoid data misuse. Meanwhile, users also have the potential of monetizing their personal data and “turning it into an asset rather than a liability.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-ai-content-cannibalization-problem-threads-a-loss-leader-for-ai-data/\"><strong><em>AI Eye: AI’s trained on AI content go MAD, is Threads a loss leader for AI data?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-08T12:30:42.000Z",
    "title": "Protect against new AI attack vector using keyboard sounds to guess passwords over Zoom",
    "url": "https://cryptoslate.com/protect-against-new-ai-attack-vector-using-keyboard-sounds-to-guess-passwords-over-zoom/",
    "description": "<p>A recent research paper from Durham University in the UK revealed a powerful AI-driven attack that can decipher keyboard inputs solely based on subtle acoustic cues from keystrokes. Published on Arxiv on Aug. 3, the paper &#8220;A Practical Deep Learning-Based Acoustic Side Channel Attack on Keyboards&#8221; demonstrates how deep learning techniques can launch remarkably accurate [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/protect-against-new-ai-attack-vector-using-keyboard-sounds-to-guess-passwords-over-zoom/\">Protect against new AI attack vector using keyboard sounds to guess passwords over Zoom</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-08T12:30:00.000Z",
    "title": "Peer Launches Augmented Reality-Based 3D Social Network On iOS",
    "url": "https://cryptodaily.co.uk/2023/08/peer-launches-augmented-reality-based-3d-social-network-on-ios",
    "description": "<p>The ambitious social metaverse and Web3 startup Peer has hit a major milestone with the launch of its next-generation social app, available to download on iOS devices from today.&nbsp;</p>\n<p>The Peer app is a novel social experience created using augmented reality technology and a proprietary ecosystem that enables people to explore and interact with the world around them in new ways, the startup explains.&nbsp;</p>\n\n<p>&ldquo;All the world&rsquo;s a game and Peer makes everyone a player,&rdquo; said Peer founder and Chief Executive Tony Tran. &ldquo;Get ready for a new kind of social network that&rsquo;s all about fun, joy and gamification at its core.&rdquo;&nbsp;</p>\n\n<p>According to Peer, the app combines geo-location technology with adaptive 3D maps to create a &ldquo;game-like experience&rdquo; of the physical world. With Peer, users will be able to customize and share maps of their own, unique social world, pinning their stories, memories and moments to real-world locations for others to find.&nbsp;</p>\n<p>To understand what Peer is really about, try to think of it as a social network experienced in AR graphics overlaid across the real world. With it, users will be able to explore their physical location and locate digital objects and information that&rsquo;s posted within their surroundings.&nbsp;</p>\n<p>Peer will make it possible to overlay 3D graphics on top of the real world, integrating new experiences into our everyday lives. Unlike other social networks which simply focus on getting people to scroll through a newsfeed with their eyes glued to their device, Peer genuinely wants to get people out and about, interacting with real people and locations in the physical world. As part of this approach, users will be incentivized to post and explore digital content that&rsquo;s tied to specific geographic locations.&nbsp;</p>\n<p>Someone who&rsquo;s feeling hungry will be able to use Peer to facilitate their search for a bite to eat. Simply open up the Peer map and look for nearby restaurants, and you&rsquo;ll find directions overlaid onto the real world to make it easier to find them. As that person arrives at their chosen eatery, they may be able to pick up a digital coupon posted outside by the owner of the business, giving them a 10% discount on their meal. At the same time, the user will be able to check reviews from previous customers, helping them to decide if they want to give the menu a try.&nbsp;</p>\n<p>Businesses will be able to use Peer to enhance their marketing efforts in creative ways. As an example, Peer created a video showing how an aquarium or dinosaur museum might get the attention of visitors by creating marine animals that swim across the skies, or virtual dinosaurs that roam around outside, enticing people to come and take a closer look.&nbsp;</p>\n<p>&nbsp;</p>\n<p></p>\n<p>&nbsp;</p>\n<p>As Peer explains, the Peer app is designed to enable discovery, community-building and other kinds of real-life activities. It will act as a creative canvas anyone can use to design and develop digital experiences that enhance our lives in the real world.&nbsp;</p>\n<p>It&rsquo;s an ambitious idea that has the potential to achieve one of the major promises of the metaverse, morphing digital elements into physical reality.</p>\n<p>Peer said the Peer app is available to download on iOS devices now from the Apple App Store, and will be joined by an Android version that&rsquo;s due to launch later this year. The company is also reported to be working on an AR headset that will make it possible to experience Peer in the most immersive way.&nbsp;</p>\n<p>In the meantime, iOS users can expect to see additional features arrive in Peer soon. &ldquo;In the coming months, we will deepen AI integration and deploy features that are sure to spark a new era of global interconnectedness,&rdquo; Tran promised. &ldquo;No social network puts the world in your hands like Peer.&rdquo;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-08T12:15:00.000Z",
    "title": "Bitcoin Price Analysis:  Large Stops Below 27991 - 9 August 2023",
    "url": "https://cryptodaily.co.uk/2023/08/bitcoin-price-analysis-large-stops-below-27991-9-august-2023",
    "description": "<p>BTC/USD Large Stops Below 27991:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 9 August 2023</p>\n<p>Bitcoin (BTC/USD) awaited fresh technical guidance early in the Asian session as the pair remained unable to sustain moves above the 29500 area and continues to battle with areas of technical resistance.&nbsp; &nbsp;The inability to revisit last month&rsquo;s multi-month high around the 31862 area has resulted in bearish momentum and has seen the pair orbit the 28960 area, representing the 23.6% retracement of the appreciating range from 19568.52 to 31862.21.&nbsp; &nbsp;Large Stops are cited below the 27991.29 area, representing the 23.6% retracement of the broader appreciating range from 15460 to 31862.21.&nbsp;&nbsp; Additional areas of technical support and potential buying pressure in these appreciating ranges include the 27466, 27166, 26428, 26272, and 25715 areas.</p>\n<p>Additional downside price objectives linked to recent selling pressure include the 28432, 28213, 28137, 27979, 27757, 27430, 27409, 27338, 27312, 27246, 26501, 26348, and 26199 levels.&nbsp; Also, the 28095.44 area represents the 23.6% retracement of the historic depreciating range from 69000 to 15460.&nbsp;&nbsp; Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 29176.03 and the&nbsp;50-bar MA&nbsp;(Hourly) at 29041.31.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T12:31:32.000Z",
    "title": "The Growing Threat to Global Security Calls for Urgent Regulation in the AI Arms Race",
    "url": "https://www.cryptopolitan.com/the-growing-threat-to-global-security-calls-for-urgent-regulation-in-the-ai-arms-race/",
    "description": "The rapid evolution of artificial intelligence (AI) has brought remarkable transformations to various aspects of our lives, from education and work to exploration and communication. However, there is a growing apprehension regarding the application of AI in warfare, a concern that rivals even the threats posed by climate change. The unchecked progression of AI in ... <a title=\"The Growing Threat to Global Security Calls for Urgent Regulation in the AI Arms Race\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-growing-threat-to-global-security-calls-for-urgent-regulation-in-the-ai-arms-race/\" aria-label=\"More on The Growing Threat to Global Security Calls for Urgent Regulation in the AI Arms Race\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-08T12:30:43.000Z",
    "title": "Crypto Analyst Deciphers XRP Price Movement: What’s Next For The Altcoin?",
    "url": "https://www.newsbtc.com/analysis/xrp/crypto-analyst-deciphers-xrp-price-movement/",
    "description": "One of the leading names in the crypto analysis sector, Michael van de Poppe, recently shed light on XRP&#8217;s price movements. Known for his crypto observations, his latest tweet has stirred conversations in the crypto community, especially pertaining to Ripple’s native cryptocurrency, XRP. In his most recent analysis, van de Poppe indicated that XRP&#8217;s price movement is now at a critical juncture.  XRP Entering The &#8216;Area Of Interest&#8217; Particularly, according to Michael van de Poppe&#8217;s tweet, XRP is currently moving into what he terms an &#8216;area of interest&#8217; on its weekly chart. This essentially points towards potential pivotal moments in the coin&#8217;s price trajectory that can be significant for traders. Related Reading: Ripple Report Foresees Blockchain Saving Financial Institutions $10 Billion By 2030 It&#8217;s $XRP which is getting into the area of interests. Just be able to buy the dip. pic.twitter.com/mBc71YtC2j — Michaël van de Poppe (@CryptoMichNL) August 7, 2023 Based on his analysis, the current position of XRP may soon pave the way for a favorable long-trade entry, aligning with the upcoming market cycle. Further expanding on this, he advised traders to remain vigilant and consider buying the dip in the impending weeks. This comes at a time when XRP&#8217;s price has seen a decline of over 10% in the past two weeks, a movement influenced heavily by developments with the Securities and Exchange Commission (SEC). As recent data shows, the altcoin experienced a decrease of 10.8% over the previous seven days, positioning its trading value above $0.6. Understanding The Factors Behind The Dip So, what prompted this dip in XRP&#8217;s value? Van de Poppe&#8217;s analysis provides a perspective. He emphasizes that the significant price fall XRP experienced over the last month is majorly attributed to long-term holders. These holders, witnessing the surge or &#8220;heavy impulse&#8221; in XRP&#8217;s price, saw it as an opportune moment to offload their holdings. Additionally, another notable observation from van de Poppe is the current &#8220;lack of interest&#8221; in the cryptocurrency markets. This diminished interest, according to the analyst, is responsible for more pronounced price corrections compared to what&#8217;s usually seen during bull market cycles. Such market sentiment can significantly influence how cryptocurrencies, including XRP, perform and are perceived by potential investors. Related Reading: XRP Journey To $10: Unveiling The Forces That Could Trigger An Upward Momentum Over the past 24 hours, XRP has seen a slight dip of 0.5%. This price action has brought the altcoin to currently trade at a price of $0.61, at the time of writing. Notably, alongside its value, the asset&#8217;s market capitalization has also seen a significant plunge dropping by more than $4 billion, in the past week. XRP&#8217;s market cap is currently valued at $32.5 billion as of today, losing almost $4 billion compared to the value of $36.3 billion seen last Tuesday. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-08T12:22:20.000Z",
    "title": "XRP Advocate Confident of a Ripple Win on SEC Appeal as XRP Proponents Set $10 Price Target",
    "url": "https://www.crypto-news-flash.com/xrp-advocate-confident-of-a-ripple-win-on-sec-appeal-as-xrp-proponents-set-10-price-target/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-advocate-confident-of-a-ripple-win-on-sec-appeal-as-xrp-proponents-set-10-price-target",
    "description": "<img width=\"720\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041__480.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041__480.jpg 720w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041__480-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041__480-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041__480-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041__480-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041__480-48x32.jpg 48w\" sizes=\"(max-width: 720px) 100vw, 720px\" />Attorney Deaton is confident that Ripple XRP will emerge victorious against the SEC.  The market analyst targets $10 for the XRP price in the near term.  Prominent Attorney John Deaton has taken to Twitter to speak on the SEC vs Ripple Lawsuit. Deaton, the founder and host of CryptoLaw is positive that XRP will snag [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-08T12:15:06.000Z",
    "title": "Cosmos Price Prediction: More Pain for ATOM Holders, over 3.7 million $ROE Sold in Record Time",
    "url": "https://www.crypto-news-flash.com/cosmos-price-prediction-more-pain-for-atom-holders-over-3-7-million-roe-sold-in-record-time/?utm_source=rss&utm_medium=rss&utm_campaign=cosmos-price-prediction-more-pain-for-atom-holders-over-3-7-million-roe-sold-in-record-time",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134848.418.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134848.418.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134848.418-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134848.418-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134848.418-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T134848.418-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency market has been a rollercoaster ride for investors, and Cosmos (ATOM) holders are currently facing a challenging period. Price predictions suggest more pain for ATOM holders as the market remains highly volatile. Amidst the turbulence, a contrasting picture emerges for Borroe ($ROE), which recently achieved a remarkable feat by selling over 3.7 million [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-08T12:28:00.000Z",
    "title": "Shopping Video Raises Eyebrows Amid SEC Lawsuit Against Richard Heart",
    "url": "https://coinedition.com/shopping-video-raises-eyebrows-amid-sec-lawsuit-against-richard-heart/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/PulseChain_was_a_flop_users_leaving_HEX_crashing_hexicans_losing-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>After the US Securities and Exchange Commission (SEC) sued HEX and PulseChain founder Richard Heart on July 31 for defrauding investors, he was found with a handful of shopping bags hoarding luxury Louis Vuitton products, according to a TikTok shared by Whale on Twitter. However, another user swiftly clarified in the comment section that it [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/shopping-video-raises-eyebrows-amid-sec-lawsuit-against-richard-heart/\">Shopping Video Raises Eyebrows Amid SEC Lawsuit Against Richard Heart</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-08T12:12:00.000Z",
    "title": "HBAR, SOL, OP Outshine Ethereum (ETH) In the Past 30 Days",
    "url": "https://coinedition.com/hbar-sol-op-outshine-ethereum-eth-in-the-past-30-days/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Top-3-smart-contract-gainers-over-last-30D-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency market intelligence platform Messari revealed in a tweet yesterday that Optimism (OP), Hedera (HBAR), and Solana (SOL) were the three best smart contract gainers against Ethereum (ETH) over the past month. According to the post, OP was the top performer in this regard and gained 42% against the leading altcoin. HBAR was the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/hbar-sol-op-outshine-ethereum-eth-in-the-past-30-days/\">HBAR, SOL, OP Outshine Ethereum (ETH) In the Past 30 Days</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]