[
  {
    "source": "CoinDesk",
    "date": "2023-10-13T11:38:08.000Z",
    "title": "Frax Finance's Fed Yield-Matching Staking Vault Attracts $30M, FXS Steady",
    "url": "https://www.coindesk.com/markets/2023/10/13/frax-finances-fed-yield-matching-staking-vault-attracts-30m-fxs-steady/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Early Thursday, Frax unveiled sFRAX staking vault, allowing users to take advantage of higher interest rates in the U.S."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-13T11:03:29.000Z",
    "title": "Terraform Labs Alleges Citadel Securities Behind May 2022 UST Stablecoin Depeg Event",
    "url": "https://decrypt.co/201342/terraform-labs-alleges-citadel-securities-behind-may-2022-ust-stablecoin-depeg-event",
    "description": "As for the evidence, Terraform points to an alleged conversation Citadel CEO Ken Griffin had with a pseudonymous trader."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T12:00:00.000Z",
    "title": "Tether stablecoin firm appoints CTO Paolo Ardoino as CEO",
    "url": "https://cointelegraph.com/news/tether-appoints-paolo-ardoino-ceo",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/bb171a40-6450-4fc2-ab14-75147ebbfeeb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The change in leadership at Tether reflects its commitment to actively exploring new business operations, the company said.</p>\n                    <p><p>Tether, the issuer of the world’s largest stablecoin by market capitalization, is replacing its CEO as the company works to expand its areas of focus.</p><p>Paolo Ardoino, who has been serving as Tether’s chief technology officer since 2017, will become the new CEO of the firm in December 2023, Tether announced on Oct. 13.</p><p>Ardoino will replace Jean-Louis van der Velde, who will transition to an advisory role for Tether while retaining his position as CEO of Tether’s sister company Bitfinex. Ardoino will continue in his roles as CTO for Bitfinex and chief strategy officer for the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) layer 2 solution Holepunch.</p><p>Ardoino will also “continue to oversee the technology department for the time being” at Tether, a spokesperson for the firm told Cointelegraph.</p><p>Tether said the change in leadership reflects the company’s commitment to actively exploring new business operations, including peer-to-peer communications, renewable energy, resilient data storage and Bitcoin mining.</p><p>As Ardoino has been leading Tether’s expansion strategy over the last couple of years, the transition should be seen as a “natural progression,” a representative of the firm told Cointelegraph.</p><p>The firm said Ardoino is the ideal choice for Tether’s CEO due to his significant impact beyond his organizational roles, including his involvement and understanding of Holepunch, Bitcoin mining, hardware and artificial intelligence. Ardoino's efforts toward enhancing freedom and fostering innovation have also established the exec as one of the most influential figures in the community, Tether noted.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/usdr-stablecoin-depeg-liquid-dai-treasury-drain-redemption\"><strong><em>USDR stablecoin depegs to $0.53, but team vows to provide solutions</em></strong></a></p><p>“Under Paolo’s leadership, Tether will continue to work towards delivering financial services to those in need, reshaping the landscape of global finance,” the Tether spokesperson said, adding:</p><blockquote>“Paolo [Ardoino] envisions Tether as a tech powerhouse poised to revolutionize the industry and serve as an infrastructure partner in the development of resilient cities and countries. Tether’s mission also includes expanding the influence of the USD and Bitcoin in global trade and exchange [...]”</blockquote><p>As previously reported, Tether has been actively developing Bitcoin mining operations in 2023, <a href=\"https://cointelegraph.com/news/tether-moves-into-bitcoin-mining-in-uruguay\">launching a mining operation in Uruguay</a> in May. The firm has continued its aggressive entry into the Bitcoin mining industry, <a href=\"https://cointelegraph.com/news/tether-unveils-mining-software-to-boost-efficiency-capacity\">introducing Tether BTC mining software</a> to enhance the management of mining capacity in August 2023.</p><p>In September 2023, <a href=\"https://cointelegraph.com/news/tether-acquires-stake-northern-data-ai-collaboration\">Tether invested in German crypto miner Northern Data Group</a> in a move backing artificial intelligence initiatives.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T11:11:35.000Z",
    "title": "Caroline Ellison: Secret recording offers trove of explosive revelations",
    "url": "https://cointelegraph.com/news/ftx-alameda-caroline-ellison-secret-recording-explosive-revelations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/4f538939-6ab2-4c0f-957b-9b978f27c390.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Among many critical revelations about Alameda and FTX’s relationship, Caroline Ellison confirmed that Alameda always had access to customers’ funds at FTX.</p>\n                    <p><p>The ongoing trial of former FTX CEO Sam Bankman-Fried has uncovered a series of explosive revelations in the form of testimonies from former key FTX and Alameda Research executives. </p><p>The latest court proceedings on Oct. 12 saw former Alameda CEO Caroline Ellison testify for the third day, following which the jury was presented with a recording of a meeting she held with Alameda staffers on Nov. 9, 2022, just days before the collapse of the FTX empire.</p><p>The meeting, held in Hong Kong and joined by nearly half of Alameda’s employees, was the key moment Ellison came clean about the ongoing scenario with the crypto exchange to her colleagues. This admission was accompanied by explosive revelations about Alameda’s financial relationship with FTX. Cointelegraph has obtained access to the secret recording, and we have curated a list of four striking elements it revealed.</p><h2>Alameda’s bad investments led to the financial crisis at FTX </h2><p>The first and most crucial revelation came early in the meeting when Ellison revealed that Alameda had borrowed money from FTX for a year. She admitted that Alameda had made several illiquid investments using the borrowed funds. </p><p>Due to the market downturn, Alameda’s loan positions were called in, creating a shortfall in FTX’s balance sheet. Here’s an excerpt from the discussion:</p><blockquote>“Most of Alameda’s loans got called in in order to meet those loan recalls. We ended up borrowing a bunch of funds on FTX, which led to FTX having a shortfall in user funds. And so with the, once there started being like FUD about this and users started withdrawing funds.” </blockquote><p>Ellison revealed that Alameda’s bad loans created market panic around FTX, causing users to withdraw their funds. FTX then paused withdrawals to contain the situation, and the exchange came crashing down within days. </p><h2>FTX planned to raise more funds to compensate users</h2><p>When one of the employees attending the meeting asked Ellison how FTX intended to pay back its customers, Ellison said that the crypto exchange was planning to raise further funds to fill the gap.</p><blockquote>“Basically, FTX is trying to raise in order to do this [compensate users], but yeah, after the crash, no one wanted to invest. I don’t know, obviously, in retrospect, the plan of waiting around for several months and like for the market environment to get better and then raise.”</blockquote><p>During the court proceedings on Thursday, Christian Drappi, a former software engineer at Alameda who was present during the meeting, told the court that Ellision’s response about paying back customers sounded concerning to him because he wasn’t aware of a scenario where investors have contributed to making customers whole due to bad financial decisions of the company.</p><h2>The nervous laughter</h2><p>As the secret recording was played in the court, the former Alameda employee also pointed out that Ellison had giggled during the meeting. The employee suggested this was Ellison’s “nervous laughter,” something she often did when in a tight spot.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/changpeng-zhao-tweet-ftx-collapse-caroline-ellison\"><strong><em>Changpeng Zhao’s tweet ‘contributed’ to collapse of FTX, claims Caroline Ellison</em></strong></a></p><p>When Ellison was asked by a staffer at the meeting whose idea it was to plug Alameda’s loan losses with FTX customer money, she responded with, “Um, Sam, I guess,” and giggled.</p><h2>Alameda almost always had access to user’s funds at FTX</h2><p>Another staffer enquired about the backdoor access of Alameda to FTX and asked how long Alameda had been using FTX customers’ funds to bridge holes in its balance sheet. Ellison responded, “FTX basically always allowed Alameda to borrow user funds, as far as I know.” </p><p><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/secret-recording-caroline-ellison-alameda-sbf-trial&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\"><strong>Collect this article as an NFT</strong></a> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\">How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T10:51:07.000Z",
    "title": "Bitcoin price gets new $25K target as SEC decision day boosts GBTC",
    "url": "https://cointelegraph.com/news/bitcoin-price-25k-target-sec-decision-boosts-gbtc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/c5198f79-8b3b-4278-8f61-be5f883251d7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin analysis flags liquidity waiting in the wings above and below the current BTC price range, while GBTC erases more of its discount.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ranged around the key $26,800 mark for a second day on Oct. 13 with a decision due in United States regulators’ battle with crypto investment giant Grayscale.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/7b3567da-22a7-40e9-9e8a-30cba1942385.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>Bitcoin lurks between major liquidity clouds</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> confirmed that the BTC price barely changed from the day prior, acting in a narrow corridor.</p><p>Bitcoin market analysts weighed potential catalysts, among these the U.S. Securities and Exchange Commission (SEC) choosing <a href=\"https://cointelegraph.com/news/what-happens-if-sec-appeal-grayscale-spot-bitcoin-etf-ruling\">whether or not to appeal</a> a court ruling over its refusal to allow a Bitcoin spot exchange-traded fund (ETF).</p><p>“Today is an important day with the SEC Appeal on the Grayscale ruling,” Michaël van de Poppe, founder and CEO of MN Trading, <a href=\"https://twitter.com/CryptoMichNL/status/1712744162922250374\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in part of an X (formerly Twitter) post. </p><blockquote>“If nothing happens, we might be seeing a case where Bitcoin reverses upwards in the coming weeks. I'm positioned long.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/7972ae82-a59c-49ff-9b14-b56bc47b8033.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Michaël van de Poppe/X</em></figcaption></figure><p>Macro data prints were due to take a break following a series of releases throughout the week, which all <a href=\"https://cointelegraph.com/news/bitcoin-cpi-btc-price-tackling-26-8-k\">showed inflation more persistent</a> than market expectations had predicted.</p><p>Summarizing possible BTC price trajectory from here, popular trader and analyst Credible Crypto saw cause for modest optimism.</p><p>“We have a very clear and seemingly controlled ‘stairstep’ down on price here. Clear low timeframe breakdowns, retests, and continuation,” he <a href=\"https://twitter.com/CredibleCrypto/status/1712711636308443542\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> alongside a chart.</p><blockquote>“We are leaving behind equal lows right below us, so ideally I’d like to see these cleaned up before a reversal. Considering we have bids stacked above and below us, a push to the local highs into asks followed by a rejection and sweep of our lows into the waiting bids and local demand seems like the perfect way to form a reversal here. Let’s see how things develop.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/d8b1d1cf-199b-42a0-b836-abc7ec1e8a20.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Credible Crypto/X</em></figcaption></figure><p>Fellow trader Daan Crypto Trades noted BTC/USD moving within a zone between two liquidity clouds, with a reaction more likely should the spot price reach either one.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> Liquidation Map <br><br>Big zones at $26.5K &amp; $27K. Would expect some sort of ssqueeze to occur at those areas. <a href=\"https://t.co/VW6YYPkMe4\">pic.twitter.com/VW6YYPkMe4</a></p>&mdash; Daan Crypto Trades (@DaanCrypto) <a href=\"https://twitter.com/DaanCrypto/status/1712766627106689472?ref_src=twsrc%5Etfw\">October 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Trader and analyst Rekt Capital meanwhile placed a target of $25,000 on Bitcoin should bulls fail to reclaim exponential moving averages (EMAs) lost through the week.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/BTC?src=hash&amp;ref_src=twsrc%5Etfw\">#BTC</a> <br><br>Needs to reclaim at least one of these EMAs as support to avoid a drop into the $25k-$26k area<a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> <a href=\"https://twitter.com/hashtag/Crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#Crypto</a> <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> <a href=\"https://t.co/ywRkdM07uw\">pic.twitter.com/ywRkdM07uw</a></p>&mdash; Rekt Capital (@rektcapital) <a href=\"https://twitter.com/rektcapital/status/1712599046529876320?ref_src=twsrc%5Etfw\">October 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>GBTC claws back more lost ground</h2><p>Ahead of the appeal deadline, Grayscale’s flagship investment fund, the Grayscale Bitcoin Trust (GBTC), continued to outperform.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/sbf-ftx-bitcoin-keep-btc-price-under-20k\">Did SBF really use FTX traders’ Bitcoin to keep BTC price under $20K?</a></em></strong></p><p>The focus of the legal proceedings, GBTC will end up as a spot ETF, Grayscale has said, with an early victory for the firm seeing its fortunes <a href=\"https://cointelegraph.com/news/gbtc-discount-btc-price-at-3-month-lows\">turn around through Q2</a>.</p><p>On Oct. 11, GBTC hit its smallest discount to net asset value — the Bitcoin spot price — since December 2021.</p><p>The discount, technically a negative premium, reached -16.44% before dipping slightly lower, per <a href=\"https://www.coinglass.com/Grayscale\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from monitoring resource CoinGlass.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/8b0fa6fa-fce4-4b34-84db-9ed83758cc1f.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>GBTC premium vs. asset holdings vs. BTC/USD chart (screenshot). Source: CoinGlass</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T10:32:53.000Z",
    "title": "How CBDCs and stablecoins can coexist: FIS panel discussion",
    "url": "https://cointelegraph.com/news/cbdc-stablecoins-future-innovation-summit-panel",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/cbba69e7-e3f7-46c1-86eb-ea458d9811dc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Eetu Kuneinen argued against CBDCs, as they are “centralized by nature,” saying that certain dangers come with government control. </p>\n                    <p><p>At the recent Future Innovation Summit event held in Dubai, Cointelegraph moderated a panel titled “Stablecoins, Central Bank Digital Currencies and Cross-Border Payments” to explore if CBDCs and stablecoins can coexist and how this would be possible. </p><p>The panel included Jorge Carrasco, the managing director of FTI Consulting; Nikita Sachdev, the founder of Luna Media Corp; Jagadeshwaran Kothandapani, the head for Middle East and Africa for Citibank; and Eetu Kuneinen, the co-founder of the gold-backed stablecoin project DGC.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/680deaf8-9731-4e8d-b8ff-fc8300c7cc40.jpg\"  /><figcaption style=\"text-align: center;\"><em>The Future Innovation Summit held in the Jumeirah Beach Hotel in Dubai. Source: Cointelegraph</em></figcaption></figure><p>The group explored various topics, answering whether stablecoins and central bank digital currencies (CBDCs) can coexist. According to Kuneinen, CBDCs would be “centralized by nature” as they would be issued by the government, even though they may be built on a blockchain. The executive argued that certain dangers come along with government control. He explained: </p><blockquote>“Let’s say that they don’t like some political rivals. They can, with one click, freeze the other party’s assets. So, what gives us any security that they won’t use this? Or if they are a smaller country, they are pressured by a bigger country to do so?”</blockquote><p>On the other hand, the executive argued that creating a framework for a stablecoin that’s not controlled by one private company may be preferable. “We could have a framework where anyone with assets and anyone with access to certain technology could be able to issue it. So, we could we could have multiple banks issuing the same stablecoin regulation,” he added. </p><p>Sachdev offered a different opinion on the topic. The executive said that if the government is already intent on freezing a person’s digital assets, they already have various means to do this. Furthermore, Sachdev argued that the government’s exploration of utilizing the blockchain for CBDCs might be a step into progress that may eventually lead to going fully decentralized and fully Web3.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/6db4878d-43d2-4598-9349-3310fbfbc1f3.jpg\"  /><figcaption style=\"text-align: center;\"><em>Panelists for the stablecoins and CBDCs panel discussion at the Future Innovation Summit in Dubai. Source: Cointelegraph</em></figcaption></figure><p>While the executive seemed to be defending CBDCs, she clarified that she is not in favor of either CBDCs or stablecoins yet, as recent incidents such as the TerraUSD (UST) collapse highlighted how stablecoins may also pose their own set of risks for the world. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/stablecoins-singapore-central-bank-says-three-business-days-is-timely-transfer-for-stablecoins\"><strong><em>Singapore central bank says three business days is ‘timely transfer’ for stablecoins</em></strong></a></p><p>Carrasco added that since the technology is at a very early stage, it’s unavoidable to see problems on the way to progress. “I think it’s very normal to see failures and to see learnings as we move forward,” he explained. The executive also believes that CBDCs and stablecoins may even become interoperable in the future. He added: </p><blockquote>“I think they will coexist. And, probably in some years, we will see a transnational body that will take care of the CBDCs and the interoperability between them and ensure that no government can pull the plug or do something that affects the interests of the people.”</blockquote><p>Meanwhile, Kothandapani echoed the sentiments expressed by the other panelists and added that companies or users would always be the ones to decide which solution would be for them. </p><p>According to the executive, they would be the ones to determine which specific “pain points” exist and whether CBDCs or stablecoins would be the answer to that. The executive also believes that the two can coexist as long as stablecoins remain stable and decentralized. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/yuan-stablecoin-team-arrested-wechats-new-bitcoin-prices-hk-crypto-rules-asia-express/\"><strong><em>Yuan stablecoin team arrested, WeChat’s new Bitcoin prices, HK crypto rules: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T10:21:48.000Z",
    "title": "Ripple CTO slams Charles Hoskinson over SEC’s ETH ‘favoritism’",
    "url": "https://cointelegraph.com/news/ripple-cto-ethgate-sec-corruption",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/b4c91ca7-a002-4d14-a820-1b3978c8f1a1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Ripple community and Cardano’s founder have clashed over the definition of corruption in the context of the ETHgate scandal.</p>\n                    <p><p>Ripple chief technology officer David Schwartz has countered the Cardano founder’s comments about possible motives behind the United States regulators’ determination that Ether (<a href=\"https://cointelegraph.com/bitcoin-price\">ETH</a>) is not a security.</p><p>Cardano founder Charles Hoskinson <a href=\"https://www.youtube.com/live/Bvedd--CoPw?si=WNIinsofujtMgSIJ&amp;t=7834\" target=\"_blank\" rel=\"noopener nofollow\">addressed</a> the much-debated ETHgate theory in an AMA session on Oct. 8, arguing that the government’s actions were not about corruption.</p><p>ETHgate is a conspiracy theory alleging that Ethereum received a free pass from U.S. regulators, particularly the U.S. Securities and Exchange Commission (SEC), which has been <a href=\"https://cointelegraph.com/news/senior-us-regulator-says-ethereum-in-its-present-state-is-not-a-security\">reiterating its stance that ETH isn’t a security</a> for years.</p><p>Despite SEC director William Hinman defining Ether as not a security in 2018, U.S. regulators have been struggling to establish the status of other coins, including XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>), which has created significant impediments to their adoption.</p><p>According to Hoskinson, <a href=\"https://cointelegraph.com/news/hinman-docs-unsealed-sec-concerned-over-ether-not-security-statement\">Hinman’s speech drafts on the regulatory status of Ethereum</a> — which were released in June 2023 — do not prove corruption but favoritism.</p><p>“None of that activity presupposes corruption, just favoritism,” Hoskinson argued in the AMA, adding that “this is how the internet works, and it can’t be fixed now.”</p><p>The Cardano founder emphasized that there has been no evidence proving anything apart from favoritism by the SEC. “What evidence do you have of that? Where are the emails? Where are the meetings?” Hoskinson asked. He also argued that XRP serves different customers, doesn’t even have smart contracts and has an entirely different business model. He added:</p><blockquote>“Doesn’t that dilute your entire goal of making Ethereum not a security to also do that? Are you so scared of XRP that’s going to happen? You really believe that? If you do, you’re a crazy person in my book.”</blockquote><p>Hoskinson’s fresh ETHgate-related remarks have quickly triggered a response from the XRP community, particularly executives like XRP chief technology Schwartz. The XRP community specifically clashed with Hoskinson over the definition of corruption.</p><p>“I would argue that a government actor showing favoritism aligned with the personal interests of themselves and their friends is corruption,” Schwartz <a href=\"https://x.com/JoelKatz/status/1712587669342196170?s=20\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> on X (formerly Twitter) on Oct. 12.</p><p>“So saying word ‘corruption’ in much polite way is ‘favoritism’,” one commenter <a href=\"https://x.com/MuhdShan9/status/1712763231432048705?s=20\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> on X.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sbf-like-madoff-cardano-founder-says-media-giving-him-free-pass\"><strong><em>Sam Bankman-Fried just like Bernie Madoff, Cardano founder says</em></strong></a></p><p>Some community members also alleged that Hoskinson’s questions about ETHgate evidence might be related to the fact that he allegedly has a lot to hide about his early days in Ethereum.</p><p>Apart from his role at Cardano, Hoskinson is also one of the eight Ethereum co-founders alongside Vitalik Buterin and even briefly <a href=\"https://cointelegraph.com/tags/charles-hoskinson\">held</a> the position of Ethereum’s CEO between 2013 and 2014. Following a public fall-out between the co-founders, Hoskinson left Ethereum in 2014 to subsequently launch Cardano.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T10:12:34.000Z",
    "title": "China sets stricter rules for training generative AI models",
    "url": "https://cointelegraph.com/news/china-sets-stricter-rules-training-generative-ai-models",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/5afebeda-0488-4833-8c69-7b0a584efcf9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The draft regulations emphasize that data subject to censorship on the Chinese internet should not serve as training material for these models.</p>\n                    <p><p>China has released draft security regulations for companies providing <a href=\"https://cointelegraph.com/news/generative-ai#:~:text=Generative%20AI%20is%20a%20subset,processes%20and%20produce%20unique%20results.\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/generative-ai#:~:text=Generative%20AI%20is%20a%20subset,processes%20and%20produce%20unique%20results./amp\">generative artificial intelligence (AI)</a> services, encompassing restrictions on data sources used for AI model training.</p><p>On Wednesday, Oct. 11, the proposed regulations were <a href=\"https://www.tc260.org.cn/upload/2023-10-11/1697008495851003865.pdf\" target=\"_blank\" rel=\"noopener nofollow\">released</a> by the National Information Security Standardization Committee, comprising representatives from the Cyberspace Administration of China (CAC), the Ministry of Industry and Information Technology and law enforcement agencies.</p><p>Generative AI, as exemplified by the <a href=\"https://cointelegraph.com/news/7-game-changing-uses-of-chatgpt\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/7-game-changing-uses-of-chatgpt/amp\">accomplishments of OpenAI’s ChatGPT</a>, acquires the ability to perform tasks through the analysis of historical data and generates fresh content, such as text and images, based on this training.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/9251ce1d-a272-4cc4-a8ae-47f1c7a013f3.JPG\"><figcaption style=\"text-align: center;\"><em>Screenshot of the National Information Security Standardization Committee (NISSC) publication. Source: NISSC</em></figcaption></figure><p>The committee recommends performing a security evaluation on the content used to train publicly accessible generative AI models. Content exceeding “5% in the form of unlawful and detrimental information” will be designated for blacklisting. This category includes content advocating terrorism, violence, subversion of the socialist system, harm to the country’s reputation and actions undermining national cohesion and societal stability.</p><p>The draft regulations also emphasize that data subject to censorship on the Chinese internet should not serve as training material for these models. This development comes slightly over a month after regulatory authorities granted permission to various Chinese tech companies, including the prominent search engine Baidu, to introduce their generative AI-driven chatbots to the general public.</p><p>Since April, the CAC has consistently <a href=\"https://cointelegraph.com/news/chinese-authorities-to-enforce-security-reviews-for-ai-services\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/chinese-authorities-to-enforce-security-reviews-for-ai-services/amp\">communicated its requirement</a> for companies to provide security evaluations to regulatory bodies before introducing generative AI-powered services to the public. In July, the cyberspace regulator released a set of <a href=\"https://cointelegraph.com/news/china-to-require-generative-ai-tools-to-obtain-license\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/china-to-require-generative-ai-tools-to-obtain-license/amp\">guidelines governing these services</a>, which industry analysts noted were considerably less burdensome compared to the measures proposed in the initial April draft.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/biden-tightening-ai-chip-controls-china-third-parties\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/biden-tightening-ai-chip-controls-china-third-parties/amp\"><strong><em>Biden considers tightening AI chip controls to China via third parties</em></strong></a><strong><em><u> </u></em></strong></p><p>The recently unveiled draft security stipulations necessitate that organizations engaged in training these AI models obtain explicit consent from individuals whose personal data, encompassing biometric information, is employed for training. Additionally, the guidelines include comprehensive instructions on preventing infringements related to intellectual property.</p><p>Nations worldwide are <a href=\"https://cointelegraph.com/news/first-of-many-how-italy-s-chatgpt-ban-could-trigger-a-wave-of-ai-regulation\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/first-of-many-how-italy-s-chatgpt-ban-could-trigger-a-wave-of-ai-regulation/amp\">wrestling with the establishment of regulatory frameworks</a> for this technology. China regards AI as a domain in which it <a href=\"https://cointelegraph.com/news/china-builds-giant-ai-chip-factory\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/china-builds-giant-ai-chip-factory/amp\">aspires to compete with the United States</a> and has set its ambitions on becoming a global leader in this field by 2030.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/\"><strong><em>‘AI has killed the industry’: EasyTranslate boss on adapting to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T09:39:58.000Z",
    "title": "Biden considers tightening AI chip controls to China via third parties ",
    "url": "https://cointelegraph.com/news/biden-tightening-ai-chip-controls-china-third-parties",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/0374f4b9-57b1-4876-bfa9-83c169310593.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The additional restrictions being considered by the Biden administration would try to target ways Chinese developers could access U.S.-made AI semiconductor chips. </p>\n                    <p><p>The United States government is considering additional measures to curb Chinese developers from gaining access to artificial intelligence (AI) semiconductor chips made in the U.S. via third parties.</p><p>According to a <a href=\"https://www.reuters.com/technology/biden-eyes-adding-ai-chip-curbs-chinese-companies-abroad-2023-10-13/\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from Reuters on Oct. 13, people close to the matter have said that the Biden administration is targeting a loophole that has allowed developers in China to purchase chips from the infamous Huaqiangbei electronics area in Shenzhen, a city in southern China.</p><p>The sources reportedly claim that the additional rules on AI chips will come out this month and will apply restrictions previously applied only to the U.S.’s top players like Nvidia and AMD but more broadly to all companies producing similar materials in the market. </p><p>Over the summer, the U.S. government applied additional rules to its largest chip makers, including Nvidia, which <a href=\"https://cointelegraph.com/news/nvidia-briefly-hits-1-trillion-market-cap#:~:text=Computer%20chip%20manufacturer%20Nvidia%20briefly,intelligence%20tech%20reached%20a%20crescendo.\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/nvidia-briefly-hits-1-trillion-market-cap#:~:text=Computer%20chip%20manufacturer%20Nvidia%20briefly,intelligence%20tech%20reached%20a%20crescendo./amp\">currently leads the market</a> in chip manufacturing. It asked the companies to curb exports of their <a href=\"https://cointelegraph.com/news/us-curbs-export-nvidia-ai-chip-to-some-middle-eastern-countries\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-curbs-export-nvidia-ai-chip-to-some-middle-eastern-countries/amp\">high-level semiconductor chips</a> to “some” Middle Eastern countries, among other small details.</p><p>However, U.S. regulators have since <a href=\"https://cointelegraph.com/news/us-regulators-deny-blocking-ai-chip-exports-to-middle-east\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-regulators-deny-blocking-ai-chip-exports-to-middle-east/amp\">denied explicitly blocking</a> AI chip exports to the Middle East.</p><p>In response, Nvidia warned regulators that long-term results in revenue could be “harmed” if the company is “effectively excluded from all or part of China.” The majority of Nvidia’s revenue comes from the U.S., China and Taiwan, while less than 14% comes from all other countries combined.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/saudi-arabia-china-arabic-ai-system\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/saudi-arabia-china-arabic-ai-system/amp\"><strong><em>Saudi Arabia and China collaborate on Arabic-based AI system</em></strong></a></p><p>Reuter’s sources have said that the Biden administration is also trying to troubleshoot a loophole that allows Chinese parties access to U.S. cloud service providers like Amazon Web Services (AWS). According to the report, those solutions seem “less clear.”</p><p>In July, U.S. officials reportedly <a href=\"https://cointelegraph.com/news/us-reportedly-plans-to-restrict-china-s-access-to-cloud-computing-services\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-reportedly-plans-to-restrict-china-s-access-to-cloud-computing-services/amp\">began their considerations</a> on restrictions on access to cloud computing services such as AWS by Chinese companies in an effort to safeguard the country’s advanced technology.</p><p>The U.S. implemented its initial export controls on its most powerful semiconductor chip technology back in October 2022.</p><p>Washington <a href=\"https://cointelegraph.com/news/us-considers-tightening-restrictions-on-ai-chip-exports\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-considers-tightening-restrictions-on-ai-chip-exports/amp\">has since tightened measures</a> and is still considering taking additional action to even further limit the computing power of chips available in the Chinese market.</p><p>China has also acted in response to the ever-tightening measures from the United States. In July, it said it would be controlling <a href=\"https://cointelegraph.com/news/china-to-tighten-control-on-exports-of-ai-chip-making-materials\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/china-to-tighten-control-on-exports-of-ai-chip-making-materials/amp\">exports of gallium and germanium</a>, two primary materials for the production of AI chips.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/\"><strong><em>‘AI has killed the industry’: EasyTranslate boss on adapting to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-13T11:15:19.000Z",
    "title": "Binance Bitcoin reserves double, while proprietary stablecoin BUSD plummets in 2023",
    "url": "https://cryptoslate.com/insights/binance-bitcoin-reserves-double-while-proprietary-stablecoin-busd-plummets-in-2023/",
    "description": "<p>Quick Take Year-to-date data for 2023 reflects significant shifts in Binance&#8217;s proof of reserves, an official disclosure of the exchange&#8217;s on-chain assets. Bitcoin, buoyed by a 60% appreciation, has seen Binance reserves double from $9.4 billion in January to $17.5 billion in October. This surge has boosted Bitcoin&#8217;s share in Binance&#8217;s reserves from 27% at [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/binance-bitcoin-reserves-double-while-proprietary-stablecoin-busd-plummets-in-2023/\">Binance Bitcoin reserves double, while proprietary stablecoin BUSD plummets in 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-13T10:15:42.000Z",
    "title": "Will SEC file appeal by deadline as Grayscale Bitcoin Trust discount hits yearly low?",
    "url": "https://cryptoslate.com/will-sec-make-appeal-by-deadline-as-grayscale-bitcoin-trust-discount-hits-yearly-low/",
    "description": "<p>The discount on Grayscale Bitcoin Trust (GBTC) has reached its lowest point this year, currently standing at 16.58% as of Oct. 12, per data from Coinglass. This narrowing discount is closely linked to the impending deadline for the U.S. Securities and Exchange Commission (SEC) to file an appeal against its previous loss to the asset [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/will-sec-make-appeal-by-deadline-as-grayscale-bitcoin-trust-discount-hits-yearly-low/\">Will SEC file appeal by deadline as Grayscale Bitcoin Trust discount hits yearly low?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-13T10:00:14.000Z",
    "title": "Record low speculation reveals Bitcoin market maturing in silence",
    "url": "https://cryptoslate.com/insights/record-low-speculation-reveals-bitcoin-market-maturing-in-silence/",
    "description": "<p>Quick Take CryptoSlate&#8217;s previous analysis revealed a significant divergence between long-term holders (those who have held Bitcoin for more than 155 days) and short-term holders (those who have held Bitcoin for less than 155 days). Taking this analysis one step further, a striking revelation around speculative Bitcoin purchases emerges using the HODL waves metric, which [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/record-low-speculation-reveals-bitcoin-market-maturing-in-silence/\">Record low speculation reveals Bitcoin market maturing in silence</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-13T11:56:24.000Z",
    "title": "MetaMask Integrates Stripe for Enhanced Crypto On-Ramp Options",
    "url": "https://cryptodaily.co.uk/2023/10/metamask-integrates-stripe-for-enhanced-crypto-on-ramp-options",
    "description": "The Stripe integration is accessible via MetaMask's mobile application, browser add-on, and their comprehensive Portfolio service."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-13T10:09:30.000Z",
    "title": "TerraForm Labs Alleges Citadel Securities Had A Hand In UST Depeg",
    "url": "https://cryptodaily.co.uk/2023/10/terraform-labs-alleges-citadel-securities-had-a-hand-in-ust-depeg",
    "description": "Do Kwon-founded Terraform Labs has once again blamed market maker Citadel Securities for its role in an alleged international effort to cause the depegging of its TerraUSD (UST) stablecoin."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-13T10:15:58.000Z",
    "title": "CFTC Commissioner Launches Scathing Attack On Voyager Digital",
    "url": "https://cryptodaily.co.uk/2023/10/cftc-commissioner-launches-scathing-attack-on-voyager-digital",
    "description": "A Commodity Futures Trading Commission (CFTC) commissioner has slammed Voyager Digital, calling the company no better than a house of cards."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-13T11:30:01.000Z",
    "title": "Nigerian Court Convicts P2P Crypto Trader Accused of Operating a Pig Butchering Scam",
    "url": "https://news.bitcoin.com/nigerian-court-convicts-p2p-crypto-trader-accused-of-operating-a-pig-butchering-scam/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1038184249-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Nigerian Court Convicts P2P Crypto Trader Accused of Operating a Pig Butchering Scam\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1038184249-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1038184249-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1038184249-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1038184249-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1038184249-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1038184249-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1038184249.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A Nigerian court recently convicted and fined a peer-to-peer (P2P) crypto trader accused of running a pig butchering scam. According to the Economic and Financial Crimes Commission, the crypto trader&#8217;s activities were &#8220;contrary to and punishable under the Cybercrimes (Prohibition etc.) Act, 2015.&#8221; Offense &#8216;Bordering on Cybercrimes&#8217; A Nigerian court recently convicted a peer-to-peer cryptocurrency [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T12:08:47.000Z",
    "title": "David Schwartz responds to Hoskinson’s take on SEC’s ETH decisions",
    "url": "https://www.cryptopolitan.com/david-schwartz-responds-to-hoskinsons-take-on-secs-eth-decisions/",
    "description": "Charles Hoskinson, Cardano&#8217;s creator, recently addressed the ongoing ETHgate theory during an AMA session on October 8. ETHgate, a popular conspiracy theory, insinuates that Ethereum enjoyed leniency from U.S. regulators, notably the U.S. Securities and Exchange Commission (SEC). This theory emerged mainly because of the SEC&#8217;s consistent view over the years that Ether (ETH) isn&#8217;t ... <a title=\"David Schwartz responds to Hoskinson’s take on SEC&#8217;s ETH decisions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/david-schwartz-responds-to-hoskinsons-take-on-secs-eth-decisions/\" aria-label=\"More on David Schwartz responds to Hoskinson’s take on SEC&#8217;s ETH decisions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T12:06:52.000Z",
    "title": "Why AI Founders Should Consider Austria",
    "url": "https://www.cryptopolitan.com/why-ai-founders-should-consider-austria/",
    "description": "Austria, a landlocked country in Central Europe, is unarguably one country to watch for entrepreneurs and founders in the artificial intelligence scene looking for an ideal location to expand or set up their AI businesses. The country currently houses some of the biggest tech companies, including IBM, Microsoft, Capgemini, Amazon, Oracle, and many others. Recent ... <a title=\"Why AI Founders Should Consider Austria\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-ai-founders-should-consider-austria/\" aria-label=\"More on Why AI Founders Should Consider Austria\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T12:04:43.000Z",
    "title": "Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?",
    "url": "https://www.cryptopolitan.com/rollbit-price-prediction/",
    "description": "Rollbit coin price prediction 2023-2032 Rollbit has quickly become one of the most popular crypto casinos and trading platforms. Launched in 2019, Rollbit offers a wide range of gaming, sports betting, futures trading, and NFT options for users. With no KYC requirements and support for numerous cryptocurrencies, Rollbit provides an easy entry into the world ... <a title=\"Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rollbit-price-prediction/\" aria-label=\"More on Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T11:27:22.000Z",
    "title": "Unveiling the Implications of the Contentious US-China Trade Relationship",
    "url": "https://www.cryptopolitan.com/implications-us-china-trade-relationship/",
    "description": "The trade relationship between the US and China is like a complicated friendship that affects not just them but the whole world. Imagine two kids in a sandbox, both wanting to build the biggest sandcastle. They need to share the toys (resources) to build their castles (economies), but they also want to be the ones ... <a title=\"Unveiling the Implications of the Contentious US-China Trade Relationship\" class=\"read-more\" href=\"https://www.cryptopolitan.com/implications-us-china-trade-relationship/\" aria-label=\"More on Unveiling the Implications of the Contentious US-China Trade Relationship\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T11:25:06.000Z",
    "title": "Chinese FX regulator discusses potential of CBDC programmability",
    "url": "https://www.cryptopolitan.com/chinese-fx-regulator-discusses-potential-of-cbdc-programmability/",
    "description": "China has heightened its focus on central bank digital currencies (CBDCs), eyeing the substantial potential of their programmable features. As Deputy Administrator of the State Administration of Foreign Exchange, Lu Lei, recently highlighted, these features could redefine the role of M0 currency, traditionally associated with physical cash. Moreover, these developments might impact M2 currency, which ... <a title=\"Chinese FX regulator discusses potential of CBDC programmability\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chinese-fx-regulator-discusses-potential-of-cbdc-programmability/\" aria-label=\"More on Chinese FX regulator discusses potential of CBDC programmability\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T11:24:54.000Z",
    "title": "Warten Sie immer Noch Auf Den Aufstieg des Kryptomarktes? Dringend! Wichtige Informationen für Bitcoin (BTC), Polkadot (DOT), Cosmos (ATOM), Chia (XCH) und Polygon (MATIC) Inhaber!",
    "url": "https://www.cryptopolitan.com/warten-sie-immer-noch-auf-den-aufstieg-des-kryptomarktes-dringend-wichtige-informationen-fur-bitcoin-btc-polkadot-dot-cosmos-atom-chia-xch-und-polygon-matic-inhaber/",
    "description": "“Das Risiko entsteht, wenn man nicht weiß, was man tut” – Warren Buffett In einer Welt, in der sich die Finanzlandschaften rasch verändern, findet sich der Kryptomarkt im Epizentrum wirtschaftlicher Erschütterungen wieder. Jüngste Enthüllungen von Forbes betonen die ernsten Warnungen des Milliardärs und Hedgefonds-Managers Paul Tudor Jones, der angesichts der &#8220;katastrophalen&#8221; Finanzlage in den USA ... <a title=\"Warten Sie immer Noch Auf Den Aufstieg des Kryptomarktes? Dringend! Wichtige Informationen für Bitcoin (BTC), Polkadot (DOT), Cosmos (ATOM), Chia (XCH) und Polygon (MATIC) Inhaber!\" class=\"read-more\" href=\"https://www.cryptopolitan.com/warten-sie-immer-noch-auf-den-aufstieg-des-kryptomarktes-dringend-wichtige-informationen-fur-bitcoin-btc-polkadot-dot-cosmos-atom-chia-xch-und-polygon-matic-inhaber/\" aria-label=\"More on Warten Sie immer Noch Auf Den Aufstieg des Kryptomarktes? Dringend! Wichtige Informationen für Bitcoin (BTC), Polkadot (DOT), Cosmos (ATOM), Chia (XCH) und Polygon (MATIC) Inhaber!\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T11:21:41.000Z",
    "title": "Terraform Labs points fingers at Citadel Securities for TerraUSD depegging",
    "url": "https://www.cryptopolitan.com/terraform-labs-blames-citadel-securities/",
    "description": "Terraform Labs, the blockchain company founded by Do Kwon, is once again pointing the finger at market maker Citadel Securities for its alleged involvement in the collapse of its TerraUSD (UST) stablecoin. The company has filed a motion in the United States District Court in the Southern District of Florida to compel Citadel Securities to ... <a title=\"Terraform Labs points fingers at Citadel Securities for TerraUSD depegging\" class=\"read-more\" href=\"https://www.cryptopolitan.com/terraform-labs-blames-citadel-securities/\" aria-label=\"More on Terraform Labs points fingers at Citadel Securities for TerraUSD depegging\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T11:12:31.000Z",
    "title": "Still Waiting For The Bull Market To Return? Urgent! Important Information For Bitcoin (BTC), Polkadot (DOT), Cosmos (ATOM), Chia (XCH) and Polygon (MATIC) Holders!",
    "url": "https://www.cryptopolitan.com/still-waiting-for-the-bull-market-to-return-urgent-important-information-for-bitcoin-btc-polkadot-dot-cosmos-atom-chia-xch-and-polygon-matic-holders/",
    "description": "“Risk comes from not knowing what you’re doing.” – Warren Buffett In a world where financial landscapes are rapidly shifting, the crypto market finds itself at the epicenter of economic tremors. Recent revelations from Forbes highlight the dire warnings of billionaire hedge fund manager Paul Tudor Jones, who, amidst the &#8220;cataclysmic&#8221; fiscal situation in the ... <a title=\"Still Waiting For The Bull Market To Return? Urgent! Important Information For Bitcoin (BTC), Polkadot (DOT), Cosmos (ATOM), Chia (XCH) and Polygon (MATIC) Holders!\" class=\"read-more\" href=\"https://www.cryptopolitan.com/still-waiting-for-the-bull-market-to-return-urgent-important-information-for-bitcoin-btc-polkadot-dot-cosmos-atom-chia-xch-and-polygon-matic-holders/\" aria-label=\"More on Still Waiting For The Bull Market To Return? Urgent! Important Information For Bitcoin (BTC), Polkadot (DOT), Cosmos (ATOM), Chia (XCH) and Polygon (MATIC) Holders!\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T11:07:24.000Z",
    "title": "MEROBIT’s Take on Cryptocurrency Asset Management",
    "url": "https://www.cryptopolitan.com/merobits-take-on-cryptocurrency-asset-management/",
    "description": "In the dynamic landscape of cryptocurrencies, stability and reliability stand out as key attributes that investors crave. Meeting this need is MEROBIT LTD&#8217;s merobit.com, a platform that has, since 14th September 2023, established itself as a reliable player in the market. Consistent Growth and User Engagement Since its launch, MEROBIT.com has garnered significant interest, amassing ... <a title=\"MEROBIT’s Take on Cryptocurrency Asset Management\" class=\"read-more\" href=\"https://www.cryptopolitan.com/merobits-take-on-cryptocurrency-asset-management/\" aria-label=\"More on MEROBIT’s Take on Cryptocurrency Asset Management\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T10:59:01.000Z",
    "title": "French regulator recommends ‘disintermediated’ approach for DeFi regulation",
    "url": "https://www.cryptopolitan.com/french-regulator-on-defi-regulation/",
    "description": "The Autorité de Contrôle Prudentiel et de Résolution (ACPR), a part of the French Central Bank, has concluded its public consultation on the regulation of decentralized finance (DeFi). This consultation sought input from various stakeholders and experts within the cryptocurrency and blockchain space. The findings of the ACPR indicate that the term &#8220;disintermediated finance&#8221; may ... <a title=\"French regulator recommends &#8216;disintermediated&#8217; approach for DeFi regulation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/french-regulator-on-defi-regulation/\" aria-label=\"More on French regulator recommends &#8216;disintermediated&#8217; approach for DeFi regulation\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-13T11:28:35.000Z",
    "title": "FBI warns of crypto scams impersonating agency in El Paso",
    "url": "https://crypto.news/fbi-warns-of-crypto-scams-impersonating-agency-in-el-paso/",
    "description": "Scammers are trying to lure victims into thinking a real investigation is being conducted, officials said. The Federal Bureau of Investigations (FBI) has warned residents of El Paso, Texas, about phishing email letters from scammers pretending to be the bureau.&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-13T11:23:36.000Z",
    "title": "Terraform Labs accuses Citadel of orchestrating UST stablecoin fall",
    "url": "https://crypto.news/terraform-labs-accuses-citadel-of-orchestrating-ust-stablecoin-fall/",
    "description": "Terraform Labs, founded by Do Kwon, has once again accused Citadel Securities of deliberately causing the depegging of its TerraUSD (UST) stablecoin in 2022. On Oct. 10, the company filed a motion in the United States District Court for the&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-13T11:17:45.000Z",
    "title": "G20 finance heads adopt roadmap for crypto regulation",
    "url": "https://crypto.news/g20-finance-heads-adopt-roadmap-for-crypto-regulation/",
    "description": "G20 finance ministers say the document is necessary to achieve macroeconomic and financial stability goals. The G20 Finance Ministers and Central Bank Governors (FMCBG) adopted a crypto roadmap designed to support a coordinated regulatory framework for all group members. As&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-13T11:09:15.000Z",
    "title": "FTX’s stolen crypto funds linked to Russian cybercrime networks",
    "url": "https://crypto.news/ftxs-stolen-crypto-funds-linked-to-russian-cybercrime-networks/",
    "description": "Blockchain analytics firm Elliptic has released new findings that suggest a Russian-linked entity may be behind the high-profile hack of cryptocurrency exchange FTX. The revelation comes as part of an ongoing investigation into the theft of a staggering $477 million&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-13T11:08:04.000Z",
    "title": "State Street expert: “Bitcoin ETFs approval is inevitable”",
    "url": "https://crypto.news/state-street-expert-bitcoin-etfs-approval-is-inevitable/",
    "description": "Will Bitcoin ETFs get the green light? Nitin Gaur of State Street believes it's just a matter of time. Dive into his views on regulation and Bitcoin's future."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-13T11:01:42.000Z",
    "title": "Crypto Analyst Breaks Down The Factors Behind The Bitcoin Price Decline",
    "url": "https://www.newsbtc.com/news/bitcoin/factors-behind-bitcoin-decline/",
    "description": "As the bear market continues to linger, analysts have weighed in on the decline of the flagship cryptocurrency, Bitcoin, and the crypto market, by extension. This time, another crypto analyst has explained what is influencing Bitcoin’s price decline.  Factors Causing BTC&#8217;s Decline Bitcoin notably dropped below the $27,000 level on October 12. Addressing this decline in a recent episode on the ‘Cheeky Crypto’ YouTube channel, Crypto analyst Nick noted that there wasn’t much going on in the news and the only thing that could have affected Bitcoin’s drop was the US inflation data, which was recently released with the CPI rising higher than expected.  Related Reading: US Mega Bank JPMorgan Predicts Harsh Drop In This Bitcoin Metric He then analyzed key on-chain metrics that could have affected Bitcoin’s price. According to data he pulled up from Cheeky Crypto’s site, there were 903,210 active addresses in the last twenty-four hours (he released the video on October 12). The data also showed that 610,686 active addresses received Bitcoin during that period, and 560,331 active addresses sent Bitcoin during the same time frame, amounting to 265,000 transactions. What was, however, more interesting was the fact that only 23 million addresses held BTC out of the total 48.7 million addresses in existence. He stated that these figures were important to give an insight into Bitcoin’s adoption rate as one could easily assume that almost all the Bitcoin addresses in existence held BTC. Meanwhile, less than half actually did.  BTC price continues to fluctuate &#124; Source: BTCUSD on Tradingview.com More Selling Pressure For Bitcoin As to another factor that could be causing the decline, he noted that retail investors had been selling in the past few days. However, the silver lining, as Nick highlighted, is that this selloff suggests that institutional investors are accumulating once more, considering that they had once dumped their tokens on these retail investors.  Additionally, 108 wallets hold over 10,000 BTC. These wallets, which Nick labeled as the “master manipulators” of BTC’s price, are also experiencing a similar sell-off trend as these wallets are down 8.47% in the last 180 days, which suggests that they are “aggressively” selling off. Related Reading: Bitcoin Price Plunge: Long-Term Holders Buy $1.35 Billion Worth Of BTC From the chart he shared, one could see that the trend dates back to April 2023 (the peak of accumulation by these wallets) as they have begun to cool off and dump some of their holdings on the market. His analysis suggests that there could be a bigger picture regarding Bitcoin’s decline rather than any immediate factor.  Despite this decline and the amount of liquidations that have occurred, Nick is still optimistic that Bitcoin could end this month in the green. October is reported to be one of the best-performing months for Bitcoin, with the crypto token ending October in the green for the last five years. Featured image from The Independent, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-13T11:46:14.000Z",
    "title": "Polkadot’s Game-Changer: Bifrost’s SLPx Pallet Goes Live",
    "url": "https://www.crypto-news-flash.com/polkadots-game-changer-bifrosts-slpx-pallet-goes-live/?utm_source=rss&utm_medium=rss&utm_campaign=polkadots-game-changer-bifrosts-slpx-pallet-goes-live",
    "description": "<img width=\"1920\" height=\"1246\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"polkadot\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-2.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-2-300x195.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-2-1024x665.jpg 1024w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />According to a post shared on the X app, Bifrost SLPx Pallet, a protocol that is designed to leverage the Polkadot (DOT) native cross-consensus messaging format, has gone live.  SLP is built as a module that enables the processing of vToken minting as well as its redemption via the Bifrost chain. The process requires that [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-13T11:05:15.000Z",
    "title": "Crypto Analyst Nicholas Merten Sounds Alarm on Dogecoin: Is DOGE Due for a Major Correction?",
    "url": "https://www.crypto-news-flash.com/crypto-analyst-nicholas-merten-sounds-alarm-on-dogecoin-is-doge-due-for-a-major-correction/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-analyst-nicholas-merten-sounds-alarm-on-dogecoin-is-doge-due-for-a-major-correction",
    "description": "<img width=\"2048\" height=\"1283\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/wpro-doge.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Dogecoin (DOGE)\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/wpro-doge.png 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/wpro-doge-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/wpro-doge-1024x642.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/wpro-doge-768x481.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/wpro-doge-1536x962.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/wpro-doge-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/wpro-doge-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/wpro-doge-163x102.png 163w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" />Top market analyst is bearish on the price of Dogecoin (DOGE). While there is a chance of a correction, he believes it will be long-term. Database founder and crypto analyst Nicholas Merten has issued a warning over the popular dog-themed memecoin Dogecoin (DOGE). In a new video that he posted on YouTube, the analyst pointed [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-13T10:39:22.000Z",
    "title": "Memeinator’s March to $1 Billion – A Clear Contender for  Best Investment in 2023",
    "url": "https://www.crypto-news-flash.com/memeinators-march-to-1-billion-a-clear-contender-for-best-investment-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=memeinators-march-to-1-billion-a-clear-contender-for-best-investment-in-2023",
    "description": "<img width=\"1600\" height=\"800\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Memeinator-Content-Media-Bank-–-Character-Background-9-min1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Memeinator-Content-Media-Bank-–-Character-Background-9-min1.jpg 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Memeinator-Content-Media-Bank-–-Character-Background-9-min1-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Memeinator-Content-Media-Bank-–-Character-Background-9-min1-1024x512.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Memeinator-Content-Media-Bank-–-Character-Background-9-min1-768x384.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Memeinator-Content-Media-Bank-–-Character-Background-9-min1-1536x768.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Memeinator-Content-Media-Bank-–-Character-Background-9-min1-1200x600.jpg 1200w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />Some of the best investments for 2023 so far have been meme coins, with a few managing to post impressive percentage returns during their initial exposure to the market. That said, no meme coin on the market offers the sheer variety of functions that Memeinator does, and the MMTR crypto presale is expected to be [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-13T10:20:12.000Z",
    "title": "Easily earn Bitcoin as passive income with CGMD miner",
    "url": "https://www.crypto-news-flash.com/easily-earn-bitcoin-as-passive-income-with-cgmd-miner/?utm_source=rss&utm_medium=rss&utm_campaign=easily-earn-bitcoin-as-passive-income-with-cgmd-miner",
    "description": "<img width=\"630\" height=\"420\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/cgmd.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/cgmd.png 630w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/cgmd-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/cgmd-104x69.png 104w\" sizes=\"(max-width: 630px) 100vw, 630px\" />CGMD miner is a powerful cryptocurrency mining company that was the first platform to provide easy access to Bitcoin mining. This is an excellent opportunity for those who are looking for passive income from cryptocurrencies, as the CGMD miner offers excellent mining contracts. The platform has multiple mining contracts with specific ROI and time periods [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-13T10:19:38.000Z",
    "title": "Terraform’s Bold Move: Probing Citadel’s Role in UST Depeg Amid Bitcoin Market Collapse",
    "url": "https://www.crypto-news-flash.com/terraforms-bold-move-probing-citadels-role-in-ust-depeg-amid-bitcoin-market-collapse/?utm_source=rss&utm_medium=rss&utm_campaign=terraforms-bold-move-probing-citadels-role-in-ust-depeg-amid-bitcoin-market-collapse",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/stock-market-6693060-1-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/stock-market-6693060-1-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/stock-market-6693060-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/stock-market-6693060-1-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/stock-market-6693060-1-104x69.jpg 104w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Terraform Labs accuses Citadel Securities of intentional actions causing its stablecoin to crash in 2022, prompting a legal battle. Terraform Labs claims market destabilization wasn&#8217;t due to a technical issue but orchestrated efforts to short the stablecoin. Terraform Labs, steered by founder Do Kwon, thrusts a bold accusation against the formidable Citadel Securities in a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-13T10:05:48.000Z",
    "title": "Mastercard Utilizes Ethereum Blockchain in CBDC Pilot, with Plans to Forge Connections to Ripple (XRP) and Chainlink (LINK)",
    "url": "https://www.crypto-news-flash.com/mastercard-utilizes-ethereum-blockchain-in-cbdc-pilot-with-plans-to-forge-connections-to-ripple-xrp-and-chainlink-link/?utm_source=rss&utm_medium=rss&utm_campaign=mastercard-utilizes-ethereum-blockchain-in-cbdc-pilot-with-plans-to-forge-connections-to-ripple-xrp-and-chainlink-link",
    "description": "<img width=\"1280\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Mastercard\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced-48x27.jpg 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Mastercard introduces a groundbreaking solution for CBDCs and blockchain interaction, offering new possibilities in digital finance. This innovation enables CBDCs to seamlessly integrate with various blockchains, empowering users to engage in diverse transactions across blockchain networks.  Mastercard has introduced a groundbreaking solution facilitating seamless interaction between central bank digital currencies (CBDCs) and various blockchain networks. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-13T09:45:51.000Z",
    "title": "Ripple CTO Clashes with Cardano Founder Over Controversial ETH Gate Theory",
    "url": "https://www.crypto-news-flash.com/ripple-cto-clashes-with-cardano-founder-over-controversial-eth-gate-theory/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-cto-clashes-with-cardano-founder-over-controversial-eth-gate-theory",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-20.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-20.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-20-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-20-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple CTO David Schwartz opposes Cardano founder Charles Hoskinson&#8217;s view on the ETH Gate controversy. The theory suggests Ethereum officials influenced SEC decisions, benefiting ETH over other cryptocurrencies like XRP. Rift in Crypto Titans&#8217; Views Ripple CTO, David Schwartz, recently provided a counter-response to remarks voiced by Cardano founder, Charles Hoskinson, about the much-discussed &#8220;ETH [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-13T10:44:44.000Z",
    "title": "Why JPMorgan Launches Platform to Tokenize Financial Assets?",
    "url": "https://www.altcoinbuzz.io/blockchain-technology/why-jpmorgan-launches-platform-to-tokenize-financial-assets/",
    "description": "<p>JPMorgan is one of the US giants when it comes down to banks. Not too long ago, they had a skeptical view of the decentralized space. However, it appears that they&#8217;re slowly making a turn on this view. They now launched a new Tokenized Collateral Network (TCN). So, let&#8217;s take a look at the first [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/blockchain-technology/why-jpmorgan-launches-platform-to-tokenize-financial-assets/\">Why JPMorgan Launches Platform to Tokenize Financial Assets?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-13T11:57:47.000Z",
    "title": "XRP Price Prediction: What to Expect in the Next 48 Hours",
    "url": "https://coinedition.com/xrp-price-prediction-what-to-expect-in-the-next-48-hours/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The on-chain tracking platform, Whale Alert, revealed in a recent X (formerly Twitter) post that there has been a substantial amount of Ripple (XRP) move from an anonymous wallet to a cryptocurrency exchange. According to the post, 30,700,000 XRP tokens, valued at $15,315,06,1 were transferred to Bitstamp. Further, on-chain analysis revealed that the wallet that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-price-prediction-what-to-expect-in-the-next-48-hours/\">XRP Price Prediction: What to Expect in the Next 48 Hours</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-13T11:56:00.000Z",
    "title": "Bitcoin’s ‘Head and Shoulders’ Pattern Shows a Path to $70K",
    "url": "https://coinedition.com/bitcoins-head-and-shoulders-pattern-shows-a-path-to-70k/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Bitcoin_BTC_Transaction_Volume_change_adjusted_7d_MA_just_reached.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin_$BTC_Transaction_Volume_change_adjusted_7d_MA_just_reached\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Bitcoin_BTC_Transaction_Volume_change_adjusted_7d_MA_just_reached.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Bitcoin_BTC_Transaction_Volume_change_adjusted_7d_MA_just_reached-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Bitcoin_BTC_Transaction_Volume_change_adjusted_7d_MA_just_reached-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Bitcoin_BTC_Transaction_Volume_change_adjusted_7d_MA_just_reached-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Bitcoin_BTC_Transaction_Volume_change_adjusted_7d_MA_just_reached-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bitcoin is going to $70,000, according to an acclaimed cryptocurrency trader and technical analyst identified as Mags on X (formerly Twitter). Mags drew his conclusion using an inverted Bitcoin chart to analyze an established ‘Head and Shoulders’ pattern. According to Mags, Bitcoin’s price is currently at the neckline of the established pattern. Mags’ prediction comes [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoins-head-and-shoulders-pattern-shows-a-path-to-70k/\">Bitcoin&#8217;s &#8216;Head and Shoulders&#8217; Pattern Shows a Path to $70K</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-13T11:36:44.000Z",
    "title": "Lookonchain Identifies Ongoing LDO Accumulation by FalconX",
    "url": "https://coinedition.com/lookonchain-identifies-ongoing-ldo-accumulation-by-falconx/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/LDO-Recorded-Largest-Transaction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"LDO Recorded Largest Transaction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/LDO-Recorded-Largest-Transaction.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/LDO-Recorded-Largest-Transaction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/LDO-Recorded-Largest-Transaction-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/LDO-Recorded-Largest-Transaction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/LDO-Recorded-Largest-Transaction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/LDO-Recorded-Largest-Transaction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Lookonchain, the smartmoney on-chain platform, has identified significant transactions involving LDO, the native coin of the liquid staking solution, Lido. According to Lookonchain, FalconX, an institutional crypto trading platform, has accumulated 6.48 million LDO, equivalent to $9.8 million from Binance, in the past five days. According to Lookonchain, the transactions performed by FalconX include a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/lookonchain-identifies-ongoing-ldo-accumulation-by-falconx/\">Lookonchain Identifies Ongoing LDO Accumulation by FalconX</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-13T11:15:00.000Z",
    "title": "CEL’s Trend May Undergo Bullish Reversal as Traders Book Profits",
    "url": "https://coinedition.com/cels-trend-may-undergo-bullish-reversal-as-traders-book-profits/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Bankman-Fried-Sheds-Light-on-How-FTX-Would-Approach-a-Celsius-Bid.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bankman-Fried Sheds Light on How FTX Would Approach a Celsius Bid\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Bankman-Fried-Sheds-Light-on-How-FTX-Would-Approach-a-Celsius-Bid.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Bankman-Fried-Sheds-Light-on-How-FTX-Would-Approach-a-Celsius-Bid-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Bankman-Fried-Sheds-Light-on-How-FTX-Would-Approach-a-Celsius-Bid-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Bankman-Fried-Sheds-Light-on-How-FTX-Would-Approach-a-Celsius-Bid-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Bankman-Fried-Sheds-Light-on-How-FTX-Would-Approach-a-Celsius-Bid-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency trading signals platform SanR.app revealed in an X (formerly Twitter) post, that traders were able to profit off of the drop in Celsius’ (CEL) price over the past 2 weeks. According to the post, traders have realized profits of 21.12% by shorting the altcoin throughout the past fortnight. Traders closing their short positions [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/cels-trend-may-undergo-bullish-reversal-as-traders-book-profits/\">CEL’s Trend May Undergo Bullish Reversal as Traders Book Profits</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-13T10:47:00.000Z",
    "title": "On-chain Sleuth Question ConsenSys About BitLicense",
    "url": "https://coinedition.com/on-chain-sleuth-question-consensys-about-bitlicense/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"CertiK Alert Issues Red Flag on a Discord Server Breach, Honeypot Scams\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-3-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>ConsenSys, a leading Ethereum-focused software company, is facing scrutiny from the blockchain community regarding its lack of a BitLicense to operate in New York State. To provide some context, the BitLicense is a business license that’s required by New York for companies conducting &#8220;virtual currency business activity,&#8221; which involves storing, holding, or maintaining control of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/on-chain-sleuth-question-consensys-about-bitlicense/\">On-chain Sleuth Question ConsenSys About BitLicense</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-13T11:45:32.000Z",
    "title": "Here’s When Ethereum Competitor Cardano May Witness Long-Awaited Breakout, According to Crypto Trader",
    "url": "https://dailyhodl.com/2023/10/13/heres-when-ethereum-competitor-cardano-may-witness-long-awaited-breakout-according-to-crypto-trader/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/Competitor-Cardano-Could-Be-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/Competitor-Cardano-Could-Be-.jpg 1392w, https://dailyhodl.com/wp-content/uploads/2023/10/Competitor-Cardano-Could-Be-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/Competitor-Cardano-Could-Be-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/Competitor-Cardano-Could-Be-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/Competitor-Cardano-Could-Be-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/Competitor-Cardano-Could-Be-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto analyst says Ethereum (ETH) challenger Cardano (ADA) may be approaching a long-awaited breakout moment. Ali Martinez tells his 31,100 followers on the social media platform X that ADA could move above the upper bound of an enduring consolidation range as early as December. &#8220;Cardano&#8217;s current consolidation trend eerily mirrors the 2018-2020 phase! [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/13/heres-when-ethereum-competitor-cardano-may-witness-long-awaited-breakout-according-to-crypto-trader/\">Here’s When Ethereum Competitor Cardano May Witness Long-Awaited Breakout, According to Crypto Trader</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]