[
  {
    "source": "Cointelegraph",
    "date": "2023-11-04T07:49:12.000Z",
    "title": "LedgerX highlights CFTC regulatory gap in customer asset rules",
    "url": "http://cointelegraph.com/news/ledgerx-highlights-cftc-regulatory-gap-in-customer-asset-rules",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/159f4100-b3ac-4714-8696-05e4aa5a0ccd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The new CFTC proposal enhances rules for FCMs and DCOs, mandating high liquidity in customer fund investments.</p>\n                    <p><p>The U.S. Commodity Futures Trading Commission (CFTC) has focused its attention on how companies handle customer assets. Nevertheless, this fresh regulation does not fully encompass the innovative model of the crypto platform LedgerX, leaving key operational aspects subject to regulatory oversight.</p><p>Regarding regulations, the recent CFTC <a href=\"https://www.cftc.gov/PressRoom/PressReleases/8818-23\" target=\"_blank\" rel=\"noopener nofollow\">proposal</a> seeks to enhance the rules for futures commission merchants (FCMs) and derivative clearing organizations (DCOs). These companies are now required to invest customer funds in highly liquid assets. Nonetheless, this revision does not account for LedgerX’s unique operational model.</p><p>LedgerX operates as a DCO, establishing direct connections with clients and deviating from the conventional role of FCMs as intermediaries. This questions how the rule should adapt to encompass such groundbreaking entities.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/1ec28595-140a-4e8e-ab95-25c880bff54d.JPG\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of CFTC's proposed rule.    Source: CFTC</em></figcaption></figure><p>Commissioner Kristin Johnson has <a href=\"https://www.cftc.gov/PressRoom/SpeechesTestimony/johnstatement110323\" target=\"_blank\" rel=\"noopener nofollow\">raised</a> concerns, highlighting that the regulatory framework lags behind the industry’s rapid evolution. LedgerX, which was previously affiliated with FTX and is <a href=\"https://cointelegraph.com/news/ftx-sells-ledgerx-for-50m-to-affiliate-of-miami-based-exchange-holding-company\">currently a part of Miami International Holdings</a>, Inc. (MIH), operates in a unique sector by providing direct client access, deviating from established industry conventions.</p><p>Furthermore, LedgerX has garnered attention for its efforts to<a href=\"https://cointelegraph.com/news/us-cftc-issues-letter-on-digital-asset-derivatives-clearing-compliance-in-3-areas\"> directly settle cryptocurrency transactions for clients</a>, diverging from the conventional practice of involving intermediaries. The company has successfully obtained several CFTC registrations, reinforcing its operations with enhanced consumer safeguards, such as asset segregation.</p><p>Importantly, Commissioner Johnson advocates for a revised regulatory framework that would provide uniform protection for retail clients, regardless of whether they trade through intermediaries or directly with non-intermediated DCOs such as LedgerX.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cftc-pays-whistleblowers-millions-for-crypto-tips\"><strong><em>CFTC pays whistleblowers $16M this year for mostly crypto tips</em></strong></a></p><p>This appeal for action coincides with the public being granted a 75-day window to offer feedback on the proposal. This period of contemplation and dialogue has the potential to guide the CFTC in addressing the regulatory deficiencies pointed out by Commissioner Johnson.</p><p>Hence, it becomes the responsibility of the CFTC to guarantee that regulatory measures remain aligned with the constantly changing derivatives market. This commitment is essential to protect the interests of retail customers and maintain a level and fair environment in this swiftly transforming digital financial arena.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-04T07:53:18.000Z",
    "title": "Lido Finance embraces Obol Network’s decentralized Staking module",
    "url": "https://www.cryptopolitan.com/lido-obol-networks-decentralized-module/",
    "description": "In a recent move heralded as a transformative step in the realm of decentralized finance, Lido Finance, a renowned liquid staking protocol, has given its nod to a pivotal proposal aimed at integrating the Simple Distributed Validator Technology (DVT) derived from the Obol Network. This monumental decision is poised to reshape the landscape of node ... <a title=\"Lido Finance embraces Obol Network&#8217;s decentralized Staking module\" class=\"read-more\" href=\"https://www.cryptopolitan.com/lido-obol-networks-decentralized-module/\" aria-label=\"More on Lido Finance embraces Obol Network&#8217;s decentralized Staking module\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-04T08:05:12.000Z",
    "title": "RUNE Solid 100% Rally Hits Barrier: THORChain Price Nears Key Resistance",
    "url": "https://www.newsbtc.com/news/rune-solid-100-rally-hits-barrier-thorchain-price-nears-key-resistance/",
    "description": "THORChain&#8217;s price has been up by over 100% since the last week of October, hitting levels not seen since May 2022. This is an amazing increment in price. But caution is advised since RUNE, an altcoin, seems overbought, possibly signaling a 20% drop in the near future. At the time of writing, RUNE was trading at $3.42, climbing over 15% in the last 24 hours, and registering an impressive 37% rally in the last seven days, figures by CoinMarketCap shows. Related Reading: This Chainlink Metric Just Hit Meteoric Levels – Good News For LINK Price? RUNE: Potential To Reverse Bearish Trajectory If RUNE closes above the psychological $3.500 mark, it could negate the present downturn and cause the bearish attitude to change. The significance of RUNE closing above the critical $3.500 mark lies in its potential to reverse the prevailing bearish trend and trigger a shift in market sentiment. Achieving this milestone could signify a break in the current downtrend, potentially instigating a more positive outlook among investors and traders. Source: CoinMarketCap THORChain underwent a notable phase of consolidation, a period marked by relatively stable prices and limited fluctuations. Following this consolidation, the market witnessed a substantial surge, propelling THORChain&#8217;s price upwards by over 40%. However, in the aftermath of this surge, the price has demonstrated a consistent stability, remaining within a relatively similar range. This stability has coincided with a broader downturn in market dynamics, where fluctuations and overall activity have shown a decrease across the market. Despite the prior surge, THORChain&#8217;s price has maintained a consistent level, reflecting a degree of resilience amid the current market trends. RUNE market cap currently at $1.16 billion on the weekend chart: TradingView.com The RUNE token holds a substantial long-term liquidation value surpassing $70 million, signifying a considerable reserve or potential value inherent in the token&#8217;s existence. However, a cautionary note emerges from the chart analysis, which reveals a prominent positive deviation highlighted in green. 3. $RUNE LIQUIDATION LEVEL analysis: &#8211; More than 70M in futures liquidations. Green DELTA, means confluence to short. &#8211; More than 1M in Liquidation profile between 2.75$ and 2.65$ (support) &#8211; PA and MS is bearish. There&#8217;s more liquidity below than above, at current price. pic.twitter.com/48j9hI5h35 — CryptoSoulz (@SoulzBTC) November 2, 2023 This deviation might signify an impending decrease in price in the near future, suggesting a potential shift or correction in the market valuation of the token. This could prompt investors to stay vigilant and consider potential fluctuations in the token&#8217;s value in their future investment decisions. The price of RUNE garnered significant attention subsequent to a substantial market surge, as the cryptocurrency experienced a portfolio increase of more than 40% inside that period. Related Reading: Solana Bulls Are Charging – Could $50 Be Just Around The Corner? Signs Of Market Correction For RUNE? Analyzing the technical indicators, THORChain reveals an RSI figure of 72.24, typically signaling overbought conditions when surpassing 70. This situation hints at the possibility of profit-taking or a slight downturn in the coming days. Despite indicating a robust bullish sentiment with an RSI above 50, THORChain might be treading into overextended territory, potentially requiring cautious observation for signs of a market correction or adjustment. Source: Santiment Meanwhile, according to Santiment&#8217;s research, there is a decline in the social dominance of the RUNE cryptocurrency, which means there is less of a presence and conversation on social media. When conversations do happen, they usually center on the altcoin&#8217;s remarkable rise, which may allude to investor anticipation of an upcoming fall. In line with this reality is the rising open interest, which is the sum of all long and short positions in the market. After such a meteoric increase of 120%, short sellers should outnumber long sellers for RUNE among traders. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Frank Cone/Pexels"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-04T07:41:32.000Z",
    "title": "XRP Lawyer Targets SBF’s Father Amid SBF’s Fraud Conviction",
    "url": "https://www.crypto-news-flash.com/xrp-lawyer-targets-sbfs-father-amid-sbfs-fraud-conviction/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-lawyer-targets-sbfs-father-amid-sbfs-fraud-conviction",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/07/prison-gb3c7ad115_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/07/prison-gb3c7ad115_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/prison-gb3c7ad115_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/prison-gb3c7ad115_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/prison-gb3c7ad115_1920-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/prison-gb3c7ad115_1920-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/prison-gb3c7ad115_1920-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/prison-gb3c7ad115_1920-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/prison-gb3c7ad115_1920-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/prison-gb3c7ad115_1920-48x32.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Joseph Bankman, the father of SBF has been slammed for participating in fraudulent activities with his son. The new development comes not long after reports revealed that Sam Bankman-Fried was found guilty of all seven counts of criminal allegations.  Amidst the ongoing legal battle between Sam Bankman-Fried and legal authorities, market players have opened an [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-04T07:49:27.000Z",
    "title": "The SEC Could Suffer Loss Defeat Against Ripple in Remedies Stage",
    "url": "https://coinedition.com/the-sec-could-suffer-loss-defeat-against-ripple-in-remedies-stage/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/SECGov_v_Ripple_In_the_LBRY_case_the_Court_has_issued_its_Decision-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Renowned US Attorney Bill Morgan has raised questions regarding what evidence the SEC has before Judge Analisa Torres to support its claim that XRP institutional investors suffered financial harm. According to Morgan, that is the equitable remedy meant to compensate victims, not give the SEC or the government a windfall. Morgan’s statement in support of [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/the-sec-could-suffer-loss-defeat-against-ripple-in-remedies-stage/\">The SEC Could Suffer Loss Defeat Against Ripple in Remedies Stage</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]