[
  {
    "source": "Decrypt",
    "date": "2023-11-13T21:57:21.000Z",
    "title": "XRP Pumps, Then Dumps on Fake BlackRock Trust Filing",
    "url": "https://decrypt.co/205896/xrp-pumps-dumps-fake-blackrock-filing",
    "description": "What a wild 30 minutes XRP holders just had."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T22:07:20.000Z",
    "title": "XRPL advances with key amendments for NFT and trading",
    "url": "https://www.cryptopolitan.com/xrpl-advances-with-key-amendments-for-nft/",
    "description": "The Ripple XRP Ledger (XRPL) is set to undergo a significant update following the approval of the &#8220;fixNFTokenRemint&#8221; amendment. This change, crucial for the seamless functioning of non-fungible tokens (NFTs) on the platform, received overwhelming support from the community, with 27 out of 34 votes in favor. The amendment, slated for activation on November 27, ... <a title=\"XRPL advances with key amendments for NFT and trading\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrpl-advances-with-key-amendments-for-nft/\" aria-label=\"More on XRPL advances with key amendments for NFT and trading\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T21:52:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-13T22:00:05.000Z",
    "title": "Aave V2 Operational, Will Bulls Break The 15-Month Resistance At $110?",
    "url": "https://www.newsbtc.com/news/defi/aave-v2-operational-bulls-break-110/",
    "description": "All Aave v2 markets are now operational, the team behind the non-custodial liquidity protocol announced in a November 13 post on X. This a day after v3 markets were unfrozen following the approval from the community. Aave is a platform where users can supply liquidity in exchange for rewards while borrowers are free to take loans while paying interest in a trustless environment. Aave v2 Markets Unfrozen, Security Is &#8220;Non-Negotiable&#8221; In the post, Aave said the security of the decentralized finance (DeFi) protocol remains a &#8220;priority and is non-negotiable for the community.&#8221; On November 4, Aave said they received a report &#8220;of an issue on a certain feature.&#8221; After being validated, the protocol decided to take a step and pause the operation of their v2 markets on Ethereum. At the same time, some v2 markets on Avalanche were frozen. Even so, the v2 markets on Polygon were unaffected.  Related Reading: Crypto Analyst Says One Day Left Until XRP Price Blast-Off, What To Expect Aave also froze operations on Aave v3 on Polygon, Arbitrum, and OP Mainnet. However, v3 markets on Ethereum, Base, and Metis were unaffected.  While Aave v2 and v3 markets were frozen, the protocol clarified that users supplying or borrowing affected assets could still withdraw and repay their positions but couldn&#8217;t supply or borrow more. With those markets unfrozen, they can now continue as it was before. Will Bulls Ease Past $110? The resumption of services, looking at the AAVE candlestick arrangements in the daily chart, has not impacted prices. However, the token is trading at around 2023 highs and remains within a bullish formation as optimistic traders expect the uptrend to continue. Despite the uptrend, bulls have failed to break above the $110 resistance level. As it is, this reaction level marks August 2022 highs and has not been breached in the past 15 months.  The token has more than doubled at spot rates, rising from $50, a critical support level marking January and June 2023 lows. For trend continuation, there must be a solid breakout above $110 and the $60 range from where prices have been moving horizontally in a multi-month accumulation. Related Reading: Polygon (MATIC) Price Fueled By Increase In Whale Activity Still, it is unclear how the token will react in the days ahead and whether there will be more upside momentum as liquidity increases as activity resumes on Aave v2 markets.  According to DeFiLlama data, Aave is one of the largest DeFi protocols, with over $6 billion in total value locked (TVL). Most of these assets are locked in Ethereum, where over $5.1 billion of tokens are under management. Feature image from Canva, chart from TradingView"
  }
]