[
  {
    "source": "Decrypt",
    "date": "2023-09-25T22:48:55.000Z",
    "title": "Bitwise Pushes Back Against SEC Rationale for Rejecting Bitcoin Spot ETFs",
    "url": "https://decrypt.co/198662/bitwise-response-sec-rejection-bitcoin-spot-etf-cme-futures",
    "description": "Bitwise argued that CME Bitcoin Futures are responsible for most of Bitcoin's price discovery, and thus are adequate for a surveillance sharing agreement. "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-25T22:48:00.000Z",
    "title": "Bitcoin ($BTC) Price Could Drop Below $25,000 as It Faces ‘800-Pound Gorilla’, Says Bloomberg Analyst",
    "url": "https://www.cryptoglobe.com/latest/2023/09/bitcoin-btc-price-could-drop-below-25000-as-it-faces-800-pound-gorilla-says-bloomberg-analyst/",
    "description": "Bloomberg Intelligence Senior Macro Strategist Mike McGlone has recently shared he believes that the price of the flagship cryptocurrency Bitcoin ($BTC) is now in the “process of reverting” and could move downward in the near future. In a recent Understanding Macro segment, McGlone noted that Bitcoin is emerging from a time characterized by unprecedentedly low-interest rates […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-25T22:45:43.000Z",
    "title": "Former FTX Law Firm Denies Role in Collapse; Challenges Allegations as ‘Fatally Deficient’ in Court Motion ",
    "url": "https://news.bitcoin.com/former-ftx-law-firm-denies-role-in-collapse-challenges-allegations-as-fatally-deficient-in-court-motion/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/fenwiickksd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Former FTX Law Firm Denies Role in Collapse; Challenges Allegations as &#039;Fatally Deficient&#039; in Court Motion \" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/fenwiickksd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/fenwiickksd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/fenwiickksd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/fenwiickksd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/fenwiickksd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/fenwiickksd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/fenwiickksd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />San Francisco-based law firm Fenwick &#38; West LLP is denying allegations from FTX founder Sam Bankman-Fried that the firm provided legal advice enabling the alleged fraud that led to the cryptocurrency exchange&#8217;s collapse. In a recent court filing, Fenwick &#38; West asserts the allegations are &#8220;fatally deficient&#8221; and should be dismissed with prejudice. Law Firm [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-25T23:00:10.000Z",
    "title": "Cardano: Factors That Could Drive ADA Price As High As $12",
    "url": "https://www.newsbtc.com/analysis/ada/cardano-ada-price-12/",
    "description": "The Cardano community has been one of the fastest-growing in the crypto space and this has shone a heavy spotlight on the ADA price. With expectations mounting already even amid the crypto winter, there are key factors that stakeholders believe could drive the altcoin’s price as high as $12. ADA Price Could Reach $12 In the last bull market, the ADA price went on a tremendous rally that saw the coin rise from as low as $0.03 to as high as $3.10 at its peak. This price action cemented the token as one of the winners of the bull, and some investors believe that the coin could be poised for another repeat of this price action. One X (formerly Twitter) user has given some points as to why this could be the case. Related Reading: Shiba Inu (SHIB) Burn Rate Sees Exponential 627% Jump In the post, the user points to the current state of interaction and sentiment in the crypto market right now, which they refer to as brutal. However, they do not believe that this will always be the way things will be. According to the user, a quick change in the interaction and sentiment would lead to a rapid price increase. At this point, they believe that most investors will end up entering the asset at a much higher price of $3 and above. This would put it at its previous all-time high. However, it doesn’t end there. They put forward that at the end of the next bull market, the ADA price would be between $8 and $12. $ADA will be a top mover in the bull mrkt once again But most will be jumping in above $3 Interaction &#38; sentiment out here in #crypto is brutal at this point But this will change very quickly &#8211; and when it does there will be drastic price movements that most won’t be able… — ADA WON’T BE UNDERVALUED FOREVER (@ADA_ONEVETCOTI) September 23, 2023 As with any forecast, a timeframe is often asked and they responded that they expect this to happen in the second quarter of 2025. This would coincide with the current 4-year cycle that usually sees prices of cryptocurrencies topping out by Q2 and Q3. ADA wavers amid expectations &#124; Source: ADAUSD on Tradingview.com Cardano Is In Better Shape A prominent Cardano influencer has also painted a bullish picture for the digital asset. @cardano_whale, an account that boasts over 137,000 followers on X, said in a tweet that the Cardano network is currently in better shape than it has ever been. Related Reading: Is Cardano (ADA) The Worst Investment Of 2023? Here’s What The Data Says They urged investors who have been increasingly critical of the network to think if they are that way because they are projecting their emotions from the ADA price action onto the network itself. “If you’ve noticed yourself become increasingly negative about it over the last year or so, consider that you might just be projecting emotions from price action onto it,” the post read. Although ADA has not seen the most impressive performance, it has not deterred bullish predictions from analysts. One analyst explained that ADA at $0.25 was a prime accumulation price and that the price of the digital asset could climb as high as $5. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Bitcoinist, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-25T22:46:00.000Z",
    "title": "Arbitrum DAO Sends Unclaimed Tokens to Treasury as ARB Drops",
    "url": "https://coinedition.com/arbitrum-dao-sends-unclaimed-tokens-to-treasury-as-arb-drops/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/ARB-Price-Can-we-expect-a-pump-now.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Arbitrum DAO Sends Unclaimed Tokens to Treasury as ARB Drops\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/ARB-Price-Can-we-expect-a-pump-now.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/ARB-Price-Can-we-expect-a-pump-now-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/ARB-Price-Can-we-expect-a-pump-now-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Around $56.5 million worth of ARB in unclaimed tokens were sent back to the project’s treasury. ARB may continue to move between $0.80 and $0.83 in the short term. If the OBV fails to rise, then ARB could drop to $0.79. The Arbitrum (ARB) Foundation has ordered that the 69.44 million unclaimed ARB tokens be [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/arbitrum-dao-sends-unclaimed-tokens-to-treasury-as-arb-drops/\">Arbitrum DAO Sends Unclaimed Tokens to Treasury as ARB Drops</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]