[
  {
    "source": "Cointelegraph",
    "date": "2023-10-26T04:50:10.000Z",
    "title": "FTX probes $6.5M in payments to AI safety group amid clawback crusade",
    "url": "http://cointelegraph.com/news/crypto-exchange-ftx-subpoena-center-ai-safety-group-bankruptcy-proceedings",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/f7b546fb-9432-490a-9e9f-ea61d42a238d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bankrupt crypto exchange FTX wants to look into millions it had given to the Center for AI Safety, a nonprofit that has argued AI should be a global priority next to pandemics and nuclear war. </p>\n                    <p><p>Bankrupt crypto exchange FTX is looking to demand information on millions of dollars in payments it had previously given to a nonprofit AI safety organization — the Center for AI Safety (CAIS).</p><p>In an Oct. 25 bankruptcy court filing, the lawyers helming FTX claimed the firm gave $6.5 million to CAIS between May and September 2022 — months before the crypto exchange collapsed and <a href=\"https://cointelegraph.com/news/ftx-post-bankruptcy-options-sale-or-revival\">declared bankruptcy</a>.</p><p>FTX wants a Delaware Bankruptcy Court judge to approve issuing subpoenas to CAIS that query if it received payments, funds, communications or entered into agreements or contracts with FTX, its affiliates and former executives.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/4307c459-54ad-456f-b606-e3a9fe22df46.png\"  /><figcaption style=\"text-align: center;\"><em>Highlighted excerpt of FTX’s filing outlining its proposed request. Source: Kroll</em></figcaption></figure><p>The exchange claims CAIS rejected “requests to voluntarily provide an accounting related to the transfers” and the two firms had an August phone call and emails in early October.</p><p>CAIS did not immediately respond to a request for comment.</p><p>FTX’s request to probe CAIS is likely part of its efforts to recover funds to repay its creditors and customers caught in its collapse in November 2022. In a June report, FTX said it had <a href=\"https://cointelegraph.com/news/ftx-recovered-7b-assets-has-almost-2b-to-go-to-cover-misappropriations\">recovered around $7 billion</a> and needed another $1.7 billion to cover customer funds it alleges were misappropriated.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-takes-stand\"><strong><em>Will Sam Bankman-Fried fix his case when he takes the stand?</em></strong></a></p><p>CAIS is likely best known for an <a href=\"https://cointelegraph.com/news/ai-experts-sign-doc-comparing-risk-of-extinction-from-ai-to-pandemics-nuclear-war\">open statement on AI risk</a> published in May, which said mitigating extinction risks from AI should be prioritized alongside nuclear war. The statement was signed by multiple high-profile figures including OpenAI CEO Sam Altman and the “Godfather” of AI <a href=\"https://cointelegraph.com/news/godfather-of-ai-resigns-from-google-warns-of-the-dangers-of-ai\">Geoffrey Hinton</a>.</p><p>FTX’s proposed subpoenas request that CAIS produce an array of transfers, documents and communications it received from FTX, FTX Philanthropy, the FTX Foundation, the FTX Future Fund “or any officer, director, contractor or employee” of FTX.</p><p>It also asks for communications specifically from co-founders Sam Bankman-Fried and Gary Wang, Bankman-Fried’s father Joseph Bankman and brother Gabriel Bankman-Fried, former Alameda Research CEO Caroline Ellison and former FTX lawyers Can Sun and Daniel Friedberg, among others.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-26T05:08:09.000Z",
    "title": "AI Risks Amplify as UK Abolishes Surveillance Camera Watchdog",
    "url": "https://www.cryptopolitan.com/ai-risks-uk-abolishes-surveillance-watchdog/",
    "description": "In a startling revelation, the outgoing Biometrics and Surveillance Camera Commissioner (BSCC), Professor Fraser Sampson, has sounded an alarm regarding the potential creation of a &#8220;worrying vacuum&#8221; in the oversight of surveillance cameras and biometric technology by the UK government.&#160; In the course of executing the elimination of the BSCC pursuant to the newly proposed ... <a title=\"AI Risks Amplify as UK Abolishes Surveillance Camera Watchdog\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-risks-uk-abolishes-surveillance-watchdog/\" aria-label=\"More on AI Risks Amplify as UK Abolishes Surveillance Camera Watchdog\">Read more</a>"
  }
]