[
  {
    "source": "CoinDesk",
    "date": "2023-10-25T15:00:00.000Z",
    "title": "This Cybersecurity Pro Gets Paid to Hack Ethereum – for the Good of the Network",
    "url": "https://www.coindesk.com/tech/2023/10/25/this-cybersecurity-pro-gets-paid-to-hack-ethereum-for-the-good-of-the-network/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "One technique that these Ethereum Foundation security researchers use to protect the blockchain is “fuzzing,” a term borrowed from the software-development industry that’s become a common way of checking to make sure a system is secure and resilient."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-25T14:54:02.000Z",
    "title": "Sam Bankman-Fried will testify at criminal trial, say defense lawyers",
    "url": "http://cointelegraph.com/news/sam-bankman-fried-testify-criminal-trial",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/09418aba-8fb0-4114-85da-0389a586885f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>After much speculation, the former FTX CEO will be one of only a handful of witnesses to testify for his defense in the criminal fraud case.</p>\n                    <p><p>Former FTX CEO Sam “SBF” Bankman-Fried will testify as part of his defense case, said his attorney Mark Cohen.</p><p>In an Oct. 25 telephone conference between SBF’s lawyers, prosecutors, and Judge Lewis Kaplan, Cohen said following the prosecution completing the presentation of its case on Oct. 26, his team planned to call three witnesses as well as Bankman-Fried to the stand. Judge Kaplan said he would allow the case to go “straight through” on Oct. 26, moving directly from the prosecutors’ final witness to the defense’s first one.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-25T15:09:45.000Z",
    "title": "Top 30 Crypto Projects Shining Bright in 2023",
    "url": "https://cryptodaily.co.uk/2023/10/top-30-crypto-projects-shining-bright-in-2023",
    "description": "Discover the top 30 cryptocurrency projects that have been shining in 2023. Explore the latest trends, innovations, and game-changers in the crypto space."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-25T15:01:33.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-25T15:04:21.000Z",
    "title": "Impact of FCA’s new crypto rules: market shifts and high-profile exits",
    "url": "https://crypto.news/impact-of-fcas-advertising-rules-on-the-uks-crypto-landscape/",
    "description": "FCA's enforcement of new advertising guidelines triggers changes in the UK crypto space, prompting high-profile exits and the birth of compliance gatekeepers."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-25T14:50:29.000Z",
    "title": "Breaking: FTX founder Sam Bankman-Fried to testify in criminal trial",
    "url": "https://crypto.news/breaking-ftx-founder-sam-bankman-fried-to-testify-in-criminal-trial/",
    "description": "Mark Cohen, lead attorney for the defense in United States v Sam Bankman-Fried, said his client will take the stand and testify at a New York federal courthouse during the fraud trial for FTX’s collapse."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-25T15:00:53.000Z",
    "title": "Cardano Founder Debunks Rumors Of Stablecoin Djed’s Shutdown",
    "url": "https://www.newsbtc.com/news/cardano/cardano-rumor-stablecoin-djed-shutdown/",
    "description": "In a definitive response to swirling rumors regarding the possible discontinuation of the Djed stablecoin, Charles Hoskinson, founder of Cardano, firmly stated that not only will the project continue, but it will also receive a significant upgrade. &#8220;No, we aren&#8217;t dropping Djed. We are supercharging the team,&#8221; he announced. Cardano Developer IOG Doubles Down On Djed Djed, an overcollateralized stablecoin by Input Output Global (IOG) and COTI has been under scrutiny due to its unique financial mechanism recently. Specifically, the stablecoin uses Cardano&#8217;s ADA token as a reserve, aiming to maintain a circulating supply backed by four times the number of its outstanding coins. While designed to provide enhanced security and stability for its users, recent metrics indicated the reserves had decreased to 356%, prompting a temporary suspension of minting new Djed tokens. Related Reading: Cardano Passes Crucial Update As ADA Price Prepares For 65% Rally In the midst of this, IOG issued a series of statements indicating structural changes and expansions. Hoskinson tweeted about the addition of Sean Ford, noting, &#8220;Glad to welcome my good friend Sean Ford to the IOG family.&#8221; This was in conjunction with IOG&#8217;s formal announcement, detailing the appointment of Sean Ford as CEO and David Markley as COO of a newly formed subsidiary concentrating on the stablecoin sector. Ford&#8217;s credentials in the technology sector are quite noteworthy, having been part of the founding team at Algorand where he served in both COO and CEO capacities. Additionally, David Markley, before joining IOG, was deeply entrenched in Algorand&#8217;s Operations, Venture, and Business Solutions teams. Articulating his vision for the evolving stablecoin sector, Ford stated, &#8220;The stablecoin space is rapidly evolving as the next frontier in digital asset payments, settlement, and innovation. I am excited to engage with the IOG team and the broader blockchain, stablecoin, and crypto community as we work collectively to create and launch the next generation of stable assets.&#8221; Related Reading: Crypto Analyst Lists Reasons Why Cardano (ADA) Will Not Do Well In The Bull Market Hoskinson, reflecting on his long-standing involvement in the field, emphasized the necessity of stablecoins for the blockchain industry. Drawing attention to his work from BitShares to Djed, he said, &#8220;The blockchain industry needs stablecoins to realize its mission and fully protect its values. I’m incredibly proud to welcome my friend Sean Ford to lead a new venture to develop stablecoins and other payment solutions alongside their supporting ecosystems.&#8221; These developments suggest a recalibration of the Djed project under new leadership. With firm support from the Cardano ecosystem, Djed could make a new attempt to conquer a part of the huge stablecoin market in the crypto sector. ADA Breaks The Downtrend Last Saturday, the ADA price managed to break above a descending trend line that has its origin in mid-April, when ADA reached its high for the year at $0.463. Since then, ADA has been in a downtrend, which may now be coming to an end, as discussed in our latest analysis. The Cardano price has recaptured the 0.236 Fibonacci retracement level on the 1-day chart and is now close to the extremely important 200-day EMA at $0.298. Featured image from Cardano Forum, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-25T15:09:26.000Z",
    "title": "Polkadot’s $427 Million Unlock: Will It Reverse the Recent Rally?",
    "url": "https://www.crypto-news-flash.com/polkadots-427-million-unlock-will-it-reverse-the-recent-rally/?utm_source=rss&utm_medium=rss&utm_campaign=polkadots-427-million-unlock-will-it-reverse-the-recent-rally",
    "description": "<img width=\"1920\" height=\"1246\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"polkadot\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-2.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-2-300x195.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-2-1024x665.jpg 1024w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Polkadot faces price pressure as 99 million DOT tokens worth $427 million unlock on October 24, potentially impacting the market. Traders are concerned that this massive token release could lead to a bearish trend, reversing recent gains in DOT&#8217;s price. Polkadot (DOT) investors are on high alert as they anticipate a significant unlocking event scheduled [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-25T15:07:54.000Z",
    "title": "Bitcoin and Ripple (XRP) Game Changer: Grayscale and FTSE Russell Forge New Billion-Dollar Crypto Index Partnership",
    "url": "https://www.crypto-news-flash.com/bitcoin-and-ripple-xrp-game-changer-grayscale-and-ftse-russell-forge-new-billion-dollar-crypto-index-partnership/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-and-ripple-xrp-game-changer-grayscale-and-ftse-russell-forge-new-billion-dollar-crypto-index-partnership",
    "description": "<img width=\"1280\" height=\"850\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Tokenizing World Assets\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-1024x680.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Grayscale Investments has announced a partnership agreement with FTSE Russell to launch five distinct rules-based indices.  This comes after the asset manager received approval from the SEC for its spot Ethereum ETF.  Grayscale Investments is in the news again after sealing a strategic partnership agreement with LSEG business and a leading global index provider FTSE [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-25T14:50:30.000Z",
    "title": "Pioneering Stability: Cardano’s Strategic Hire for Its Upcoming Stablecoin Project",
    "url": "https://www.crypto-news-flash.com/pioneering-stability-cardanos-strategic-hire-for-its-upcoming-stablecoin-project/?utm_source=rss&utm_medium=rss&utm_campaign=pioneering-stability-cardanos-strategic-hire-for-its-upcoming-stablecoin-project",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-8-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-8-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-8-1-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cardano&#8217;s founder, Charles Hoskinson, announces new leadership for Input Output Global&#8217;s latest stablecoin initiative. Sean Ford and David Markley bring a wealth of experience to drive the development of next-gen stablecoins using Cardano&#8217;s protocol. Cardano&#8217;s Visionary Move in the Stablecoin Arena Charles Hoskinson, the visionary founder of Cardano, has made a significant announcement that marks [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-25T14:56:00.000Z",
    "title": "LINK Soars 47% in Past Week; Analyst Predicts Further Upward Trend",
    "url": "https://coinedition.com/link-soars-47-in-past-week-analyst-predicts-further-upward-trend/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://coinedition.com/wp-content/uploads/2022/12/LINK-Sharks-Whales.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"LINK Sharks Whales\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/LINK-Sharks-Whales.jpg 696w, https://coinedition.com/wp-content/uploads/2022/12/LINK-Sharks-Whales-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/LINK-Sharks-Whales-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/LINK-Sharks-Whales-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/LINK-Sharks-Whales-600x338.jpg 600w\" sizes=\"(max-width: 696px) 100vw, 696px\" /><p>Amidst a wider market bull rally, ​​the price of LINK, the native token of the blockchain abstraction layer Chainlink, has soared in the past week. Data from CoinMarketCap shows that the token has seen a significant uptick, far outpacing that of major cryptocurrencies. On the weekly price chart, the token has added a whopping 48.15% [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/link-soars-47-in-past-week-analyst-predicts-further-upward-trend/\">LINK Soars 47% in Past Week; Analyst Predicts Further Upward Trend</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]