[
  {
    "source": "CoinDesk",
    "date": "2023-06-21T09:22:29.000Z",
    "title": "Crypto Sites Are Naming Fake Dispute Resolution Organizations: Canada’s Securities Regulator",
    "url": "https://www.coindesk.com/business/2023/06/21/crypto-sites-are-naming-fake-dispute-resolution-organizations-canadas-securities-regulator/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Most organizations the regulator mentions have little or no online presence and, with one exception, aren’t working with any major crypto platforms."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-21T09:11:32.000Z",
    "title": "FTX’s Bankruptcy Fees Already Topped $200M, Court Examiner Says",
    "url": "https://www.coindesk.com/policy/2023/06/21/ftxs-bankruptcy-fees-already-topped-200m-court-examiner-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Transforming a ‘smoldering heap of wreckage’ can cost good money, Katherine Stadler said."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-21T09:11:11.000Z",
    "title": "WisdomTree, Invesco Follow BlackRock With Spot Bitcoin ETF Applications",
    "url": "https://decrypt.co/145566/wisdomtree-invesco-follow-blackrock-with-spot-bitcoin-etf-applications",
    "description": "The SEC is facing a fresh wave of spot Bitcoin ETF applications from major investment firms, in the wake of BlackRock's filing."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T09:15:13.000Z",
    "title": "Bitcoin ETF impulse fuels 'fantastic' $29K BTC price breakout",
    "url": "https://cointelegraph.com/news/bitcoin-etf-fuels-29-k-btc-price-breakout",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/8d82967c-f709-4411-b3ae-d83220e1bb58.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin is \"very unlikely\" to leave its trip to $29,000 as a fluke spike, one popular analyst says.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) hit $29,000 on June 21 as largescale buying fueled a fresh sentiment boost.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e7f8b24c-e5b4-40e4-9d26-7656df94334a.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>Analyst: $29,000 becoming fakeout \"very unlikely\"</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed BTC/USD reaching $29,014 on Bitstamp — its highest since May 7.</p><p>The pair enjoyed continued buyer interest overnight, this coming on the back of multiple announcements concerning new Bitcoin-focused institutional investment products.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This is not a short squeeze, but someone(s) is just buying <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> a lot.<br><br>I repeat.<br><br>This is not a short squeeze, but someone(s) is just buying <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> a lot.<a href=\"https://t.co/gkt9JiizM3\">https://t.co/gkt9JiizM3</a> <a href=\"https://t.co/46KZRb0AMS\">https://t.co/46KZRb0AMS</a> <a href=\"https://t.co/mPZzN317A8\">pic.twitter.com/mPZzN317A8</a></p>&mdash; Ki Young Ju (@ki_young_ju) <a href=\"https://twitter.com/ki_young_ju/status/1671334724281810944?ref_src=twsrc%5Etfw\">June 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>For analysts, who were previously concerned about overall market strength, the latest action was cause for a modest rethink.</p><p>“Fantastic BTC breakout beyond the multi-month downtrend,” popular trader and analyst Rekt Capital <a href=\"https://twitter.com/rektcapital/status/1671422963487211522\" target=\"_blank\" rel=\"noopener nofollow\">reacted</a>. </p><blockquote>“Very unlikely this will end up as an upside wick like in previous months.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/6041297e-8b0c-4ac1-b836-1c7091c6ec9d.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Rekt Capital/Twitter</em></figcaption></figure><p>The day prior, with upside already in motion, Rekt Capital had nonetheless <a href=\"https://cointelegraph.com/news/deutsche-bank-crypto-bitcoin-price-june-27\">cautioned</a> that the weekly candle close was necessary in order to confirm a substantial trend change.</p><p>“A BTC Weekly Candle Close beyond the multi-month downtrend would be a great breakout confirmation. That said, a $BTC dip into the downtrend for a successful retest would offer full confirmation of breakout,” he now <a href=\"https://twitter.com/rektcapital/status/1671423882220257280\" target=\"_blank\" rel=\"noopener nofollow\">added</a>. </p><blockquote>“The retest area is ~$26800.”</blockquote><p>Fellow trader Crypto Tony meanwhile <a href=\"https://twitter.com/CryptoTony__/status/1671412131734904832\" target=\"_blank\" rel=\"noopener nofollow\">continued</a> that Bitcoin could hit his upside target “earlier than anticipated.“</p><p>“As i said, if we did not lose the support zone on Bitcoin at $25,000, then there is no bearish control just yet,” he <a href=\"https://twitter.com/CryptoTony__/status/1671435536358076416\" target=\"_blank\" rel=\"noopener nofollow\">reasoned</a>. </p><blockquote>“Soon as we saw the bulls step in, that was our cue to long. Plan and Execute.”</blockquote><p>Others were more conservative, with both Daan Crypto Trades and Michaël van de Poppe, founder and CEO of trading firm Eight, <a href=\"https://twitter.com/CryptoMichNL/status/1671422632401465345\" target=\"_blank\" rel=\"noopener nofollow\">revealing</a> closed long positions at the $29,000 mark.</p><p>Van de Poppe had nonetheless <a href=\"https://twitter.com/CryptoMichNL/status/1671256355217477632\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> that BTC/USD was now on its way to $38,000 or higher.</p><h2>Short-term holder support proves itself</h2><p>Regarding support levels, on-chain analytics firm Glassnode took the opportunity to underscore the significance of the short-term holder (STH) cost basis.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-price-boredom-18-months-research\">Bitcoin price ‘sideways boredom’ may last 18 months — New research</a></em></strong></p><p>At $26,400, the STH cost basis was now a formidable line in the sand, which BTC/USD rebounding strongly after placing STHs in unrealized loss territory.</p><p>“26,550 remains a significant baseline in determining market trend,” Glassnode tweeted, referring to previous research <a href=\"https://cointelegraph.com/news/bitcoin-price-boredom-18-months-research\">covered by Cointelegraph</a>. </p><blockquote>“The recent deviation below the STH-CB was not decisive, culminating in a reclamation of the prevailing uptrend.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/957ce03d-b169-46b9-b9d0-63aac5ed95e2.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin short-term holder data annotated chart. Source: Glassnode/Twitter</em></figcaption></figure><p>The 200-week moving average, another key bear market support line, currently also lies near the mid-$26,000 zone.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/d8274fa1-5db1-48d1-b3fd-79ef3a20022c.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day chart with 200-week MA. Source: TradingView</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T09:15:00.000Z",
    "title": "US Agencies To Create Joint Task Force For Digital Currency Crime",
    "url": "https://cryptodaily.co.uk/2023/06/us-agencies-to-create-joint-task-force-for-digital-currency-crime",
    "description": "<p>Five United States enforcement agencies have come together to create a joint task force to tackle crimes related to digital currencies and the dark web.&nbsp;</p>\n<p>The agencies have been working together for a number of years but have now made the cooperation official with the announcement made on the 20th of June.&nbsp;</p>\nA New Anti-Crime Task Force&nbsp;\n<p>The joint task force called the Darknet Marketplace and Digital Currency Crimes Task Force, was announced on the 20th of June. Representatives from the Homeland Security Investigations (HSI) Arizona, The Internal Revenue Service (IRS) Criminal Investigation, the United States Drug Enforcement Administration (DEA), the Office for the United States Attorneys, and the Postal Inspection Service signed the memorandum of understanding to formally create the new joint task force.&nbsp;</p>\n\n<p>&ldquo;On the 15th of June, Homeland Security Investigations (HSI) Arizona Special Agent in Charge Scott Brown, U.S. Attorney Gary M. Restaino, IRS Criminal Investigation Special Agent in Charge Al Childress, U.S. Drug Enforcement Administration Special Agent in Charge Cheri Oz, and U.S. Postal Inspection Service acting Inspector in Charge Greg Torbenson signed a memorandum of understanding memorializing the Darknet Marketplace and Digital Currency Crimes Task Force.&rdquo;</p>\n\n<p>Despite the creation of the new task force, it is well known that all agencies involved have been cooperating and working together on a number of cases since 2017.&nbsp;</p>\n\n<p>&ldquo;Since 2017, these federal partners have focused on darknet drug vendors and cryptocurrency-enabled crimes. Ever-evolving technology has allowed drug traffickers and other criminal actors to expand into the digital world and use the darknet to engage in their illegal activity.&rdquo;</p>\n\n<p>The newly created joint task force will work on the investigation of cryptocurrency-related and enabled crimes such as money laundering, drug trafficking, theft of personal information, and child exploitation. Homeland Security Investigations (HSI) Arizona Special Agent in Charge Scott Brown stated,&nbsp;</p>\n\n<p>&ldquo;HSI and our partners have been working at the forefront of combating criminal activities facilitated through the use of cryptocurrency on dark web marketplaces and other anonymous platforms. This task force will have impactful repercussions on those criminal operators who attempt to grow their businesses and launder the illicit proceeds through advancing technology. HSI looks forward to growing in this investigative space alongside our law enforcement partners.&rdquo;</p>\n\nSpecialized Law Enforcement Units&nbsp;\n<p>The past year has seen law enforcement agencies worldwide create specialized units for crypto-related enforcement action. In late 2022, Interpol created a crypto crimes unit to deal with cryptocurrency-related crimes. Local police in several Canadian cities have also started forming local task forces. Keeping this in mind, the newly created Darknet Marketplace and Digital Currency Crimes Task Force will have a global reach, thanks to Homeland Security Investigations having 93 overseas locations spread across 56 countries. Homeland Security Investigations, through its investigations last year, seized nearly $4 billion worth of cryptocurrency.&nbsp;</p>\n\n<p>&ldquo;Working with businesses and industries that manage the very financial systems terrorists and criminal organizations seek to exploit. Homeland Security Investigations seized nearly $4 BILLION in cryptocurrency from illicit activities last year.&rdquo;</p>\n\n<p>Within the United States of America, the Federal Bureau of Investigation (FBI) created a Virtual Asset Exploitation Unit. The unit has been designated to work with the Justice Department&rsquo;s National Cryptocurrency Enforcement Team. The Securities and Exchange Commission has also doubled its Cyber Unit.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T09:34:23.000Z",
    "title": "Why Is the VC Spectra (SPCT) Price Outshining Cardano (ADA) and Polygon (MATIC)?",
    "url": "https://www.cryptopolitan.com/why-is-the-vc-spectra-spct-price-outshining-cardano-ada-and-polygon-matic/",
    "description": "Cardano (ADA) and Polygon (MATIC) are two of the most popular cryptocurrencies with substantial followings. However, their values have taken big knocks due to fundamental events outside their control. But a new project, VC Spectra (SPCT), is outshining their prices. During this bear market in crypto, looking at fresh altcoins like VC Spectra (SPCT) before ... <a title=\"Why Is the VC Spectra (SPCT) Price Outshining Cardano (ADA) and Polygon (MATIC)?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-is-the-vc-spectra-spct-price-outshining-cardano-ada-and-polygon-matic/\" aria-label=\"More on Why Is the VC Spectra (SPCT) Price Outshining Cardano (ADA) and Polygon (MATIC)?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-21T09:17:35.000Z",
    "title": "Bitcoin approaches $29k as long-term HODLers reach new ATH",
    "url": "https://crypto.news/bitcoin-approaches-29k-as-long-term-hodlers-reach-new-ath/",
    "description": "Bitcoin’s (BTC) price reaches a six-week high as data shows that the number of long-term holders — including lost wallets — advances to a new all-time high (ATH). The asset’s price has been tumbling over the past month, especially when&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-21T09:09:52.000Z",
    "title": "TUSD Emerges Strong: 1 Billion Injection Bolsters Supply Amidst Declining Stablecoin Market",
    "url": "https://www.newsbtc.com/altcoin/tusd-emerges-strong-1-billion-injection-bolsters-supply-amidst-declining-stablecoin-market/",
    "description": "On June 16, TUSD supply surged by 52%! The difficulties the dollar-pegged token economy was facing were recently brought to light when significant redemptions caused its market valuation to drop to a 20-month low. Binance&#8217;s dominance in TUSD holdings: Top 10 wallets control 83.31% of the circulating supply. Multiple wallets under Binance&#8217;s control: Wallets holding 389,561,743, 45,233,811, 28,000,000, 10,601,602, and 10,270,001 TUSD tokens. A temporary pause in TUSD minting via Prime Trust: Minting and redemption through other banking partners remain unaffected. Market Capitalization And Supply Growth Of Stablecoins As of June 19, 2023, the combined market capitalization of the top stablecoins stands at $129.99 billion, with a 24-hour trade volume of $20.84 billion. Remarkably, three of the leading stablecoins—USDC, DAI, and BUSD—have seen their supplies decrease by 3.8% to 22% over the past 30 days. Related Reading: Ripple Set To Hit $30 If It Comes Out Victorious In SEC Lawsuit: Hedge Fund Manager Predicts In contrast, TUSD has observed a supply growth of approximately 53.5% during the same period. TUSD&#8217;s market valuation experienced a surge on July 16, 2023, reaching $3.11 billion, a significant leap from the previous day&#8217;s $2.04 billion. This indicates that although TrueUSD increased by 53.5% over the course of 30 days, 52% of that growth occurred on a single day &#8220;last Friday.&#8221; Etherscan&#8217;s smart contract data indicates that the circulating supply of TrueUSD tokens on June 19 is approximately 3,135,633,560. It is noteworthy that there are 52,079 holders of TrueUSD; however, the top 10 wallets dominate 83.31% of the circulating supply. Notably, Binance stands out as the largest holder, possessing 389,561,743 TrueUSD tokens in its leading address. Additionally, Binance controls five out of the top ten addresses with the highest TrueUSD holdings. TUSD: Wallet Distribution And Minting Pause One wallet contains 45,233,811 TUSD, another has precisely 28,000,000, there&#8217;s one with 10,601,602, and lastly, one holds 10,270,001 TrueUSD tokens. Additionally, the decentralized finance (defi) protocol Aave has locked 4,780,182 TUSD for its aTUSD tokens. According to data from Nansen.ai, Binance&#8217;s TUSD holdings represent 5.26% of the exchange&#8217;s $52.45 billion portfolio. TUSD was introduced in mid-2018 as an ERC20-based stablecoin through the Trust Token platform. It claims to be fully backed by US Dollars and supervised by a regulated operator. The stablecoin company collaborated with Custodian Prime Trust, the same company Bitgo expressed intentions of acquiring. Related Reading: Bitcoin Price Rebounds $1,000 From $25,000 Support Level – What Are Whales Up To? However, the team&#8217;s Twitter account recently disclosed that TUSD mints via Prime Trust are temporarily paused until further notice. On Monday, at 8:58 a.m., the company stated once more that mints through Prime Trust are still unavailable. Featured image from Shutterstock, charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T09:38:42.000Z",
    "title": "Bitcoin Bulls Unleashed: Crypto Short Squeeze Triggers Surge to $28K, Eyes Set on $30K",
    "url": "https://www.crypto-news-flash.com/bitcoin-bulls-unleashed-crypto-short-squeeze-triggers-surge-to-28k-eyes-set-on-30k/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-bulls-unleashed-crypto-short-squeeze-triggers-surge-to-28k-eyes-set-on-30k",
    "description": "Bitcoin (BTC) has pared off its losses and is trading at a price above $28,800. The recent rally was fueled by Bitcoin ETF applications from BlackRock and Invesco. It looks like the week-long downward correction of the largest cryptocurrency by market capitalization Bitcoin (BTC) has taken its full course and is now ready for a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T09:19:54.000Z",
    "title": "Forget Shiba Inu, DigiToads Skyrockets 320% in Massive Presale: Don’t Miss Out.",
    "url": "https://www.crypto-news-flash.com/forget-shiba-inu-digitoads-skyrockets-320-in-massive-presale-dont-miss-out/?utm_source=rss&utm_medium=rss&utm_campaign=forget-shiba-inu-digitoads-skyrockets-320-in-massive-presale-dont-miss-out",
    "description": "In the dynamic world of cryptocurrencies, few projects have the huge potential to skyrocket in value, capturing the attention of investors. Among these rare remarkable opportunities, DigiToads (TOADS) stands out as a DeFi project ready to skyrocket 320% in the presale. Read on to find out why DigiToads is generating FOMO in the online crypto [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-21T09:39:16.000Z",
    "title": "The Latest Updates of The SEC – Ripple Lawsuit (June 2023)",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/the-latest-update-of-the-sec-ripple-lawsuit-june-2023/",
    "description": "<p>Since The SEC &#8211; Ripple lawsuit began in December 2020, there have been several updates. A few months ago we wrote an article about this.  So, now we&#8217;ll cover the latest 3 updates of this important lawsuit for the crypto industry. 1) SEC Demands Access to Ripple&#8217;s Legal Advice  In a significant turn of events, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/the-latest-update-of-the-sec-ripple-lawsuit-june-2023/\">The Latest Updates of The SEC &#8211; Ripple Lawsuit (June 2023)</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-21T09:15:01.000Z",
    "title": "Whales Withdraw Over $150,000,000 in Ethereum (ETH) From Crypto Exchanges Binance and Kraken: On-Chain Data",
    "url": "https://dailyhodl.com/2023/06/21/whales-withdraw-over-150000000-in-ethereum-eth-from-crypto-exchanges-binance-and-kraken-on-chain-data/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Withdraw-Over-150.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Withdraw-Over-150.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Withdraw-Over-150.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Withdraw-Over-150.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Withdraw-Over-150.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Withdraw-Over-150.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Withdraw-Over-150.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Three crypto whales withdrew more than $150 million worth of Ethereum (ETH) from the crypto exchanges Binance and Kraken in the past week. All three addresses were newly created wallets, according to the blockchain tracker Lookonchain. The first whale withdrew 35,860 ETH worth more than $64 million from Binance across a series of transactions. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/21/whales-withdraw-over-150000000-in-ethereum-eth-from-crypto-exchanges-binance-and-kraken-on-chain-data/\">Whales Withdraw Over $150,000,000 in Ethereum (ETH) From Crypto Exchanges Binance and Kraken: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]