[
  {
    "source": "Cointelegraph",
    "date": "2023-09-21T05:24:43.000Z",
    "title": "Breaking: Mt. Gox trustee changes repayment deadline to October 2024",
    "url": "https://cointelegraph.com/news/mt-gox-trustee-changes-repayment-deadline-october-2024",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/edb02299-344e-4ac2-b51b-83c650d4cff8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Rehabilitation trustee Nobuaki Kobayashi has extended the Mt. Gox repayment deadline by one year. </p>\n                    <p><p>Mt. Gox trustee Nobuaki Kobayashi has officially changed the deadline for paying back the exchanges' creditors from Oct. 31, 2023, to Oct. 31, 2024.</p><p>In a Sept. 21 <a href=\"https://www.mtgox.com/img/pdf/20230921_announcement_en.pdf\" target=\"_blank\" rel=\"noopener nofollow\">letter</a>, Kobayashi wrote that with permission of the Tokyo District Court, he had extended the deadline for the base repayment, the early lump-sum repayment and the intermediate repayment. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/c0c8403b-2214-4272-b9b4-19f7ff550a9c.png\"  /><figcaption style=\"text-align: center;\"><em>Notice concerning the change of repayment deadlines. Source: Mtgox.com</em></figcaption></figure><p>Additionally, Kobayashi explained that for rehabilitation creditors who have provided the necessary information, repayments will be made in sequence as early as the end of this year.</p><p>\"Please note that the schedule is subject to change depending on the circumstances, and the specific timing of repayments to each rehabilitation creditor has not yet been determined,\" Kobayashi added. </p><p>Presently, the Mt. Gox estate holds some 142,000 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), 143,000 Bitcoin Cash (<a href=\"https://cointelegraph.com/bitcoin-cash-price-index\">BCH</a>) and 69 billion Japanese Yen. </p><p>Mt. Gox was one of the earliest cryptocurrency exchanges, once facilitating more than 70% of all trades made within the blockchain ecosystem. </p><p>Following a major hack in 2011, the site subsequently collapsed in 2014 due to alleged insolvency; the fallout affected about 24,000 creditors and resulted in the loss of 850,000 BTC. </p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T05:38:54.000Z",
    "title": "Intel’s Meteor Lake AI Chip Set to Reshape IoT with AI Capabilities",
    "url": "https://www.cryptopolitan.com/intels-meteor-lake-ai-chip-set-reshape-iot/",
    "description": "In a strategic move aimed at furthering the integration of artificial intelligence (AI) into everyday devices, Intel Corporation is set to broaden the horizons of its Meteor Lake AI chip, introducing a rugged version tailored for deployment in billions of Internet of Things (IoT) devices. The announcement comes hot on the heels of CEO Pat ... <a title=\"Intel&#8217;s Meteor Lake AI Chip Set to Reshape IoT with AI Capabilities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/intels-meteor-lake-ai-chip-set-reshape-iot/\" aria-label=\"More on Intel&#8217;s Meteor Lake AI Chip Set to Reshape IoT with AI Capabilities\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T05:23:51.000Z",
    "title": "Xbox’s Future Hangs in the Balance as Leaked Documents Reveal Phil Spencer’s Concerns",
    "url": "https://www.cryptopolitan.com/xboxs-future-hangs-in-the-balance/",
    "description": "In a surprising turn of events, confidential documents have emerged from the ongoing FTC v. Microsoft case, providing a glimpse into the inner workings of Xbox, Microsoft&#8217;s gaming division. The leaked documents have exposed critical discussions within the company regarding the future of Xbox Game Pass and the broader gaming business until the year 2030. ... <a title=\"Xbox&#8217;s Future Hangs in the Balance as Leaked Documents Reveal Phil Spencer&#8217;s Concerns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xboxs-future-hangs-in-the-balance/\" aria-label=\"More on Xbox&#8217;s Future Hangs in the Balance as Leaked Documents Reveal Phil Spencer&#8217;s Concerns\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-21T05:28:04.000Z",
    "title": "DOT Price (Polkadot) Hints At Potential Recovery, Here’s What Could Propel It To $4.8",
    "url": "https://www.newsbtc.com/analysis/dot/dot-price-polkadot-hints-at-potential-recovery-heres-what-could-propel-it-to-4-8/",
    "description": "Polkadot’s DOT is recovering higher from the $3.92 support against the US Dollar. The price could gain pace if it clears the $4.20 and $4.35 resistance levels. DOT is slowly moving higher above the $4.05 resistance zone against the US Dollar. The price is trading just above the $4.15 zone and the 100 simple moving average (4 hours). There is a key bearish trend line forming with resistance near $4.175 on the 4-hour chart of the DOT/USD pair (data source from Kraken). The pair could gain bullish momentum if there is a close above $4.20 and $4.35. Polkadot’s DOT Price Faces Uphill Task After a sharp decline, DOT price found support near the $3.90 zone. A low is formed near $3.91 and the price is now attempting a fresh increase, like Bitcoin and Ethereum. There was a break above the $4.00 and $4.05 resistance levels. The price surpassed the 23.6% Fib retracement level of the downward move from the $4.80 swing high to the $3.91 low. DOT is now trading just above the $4.15 zone and the 100 simple moving average (4 hours). Immediate resistance is near the $4.20 level. There is also a key bearish trend line forming with resistance near $4.175 on the 4-hour chart of the DOT/USD pair. Source: DOTUSD on TradingView.com The next major resistance is near $4.35. It is near the 50% Fib retracement level of the downward move from the $4.80 swing high to the $3.91 low. A successful break above $4.35 could start a strong rally. In the stated case, the price could easily rally toward $4.80 in the coming days. The next major resistance is seen near the $5.0 zone. Another Decline? If DOT price fails to continue higher above $4.20 or $4.35, it could start another decline. The first key support is near the $4.05 level. The next major support is near the $3.90 level and the last low, below which the price might decline to $3.75. Any more losses may perhaps open the doors for a move toward the $3.50 support zone. Technical Indicators 4-Hours MACD – The MACD for DOT/USD is now gaining momentum in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for DOT/USD is now above the 50 level. Major Support Levels – $4.05, $3.90 and $3.75. Major Resistance Levels – $4.20, $4.35, and $4.80."
  }
]