[
  {
    "source": "Cointelegraph",
    "date": "2023-06-30T10:04:12.000Z",
    "title": "South Korea passes cryptocurrency bill to tackle unfair trading",
    "url": "https://cointelegraph.com/news/south-korea-passes-bill-to-tackle-unfair-cryptocurrency-trading",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/b78588eb-a2f0-48d7-bb50-590572ef0b83.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>South Korea's crypto bill aims to establish a basis for imposing penalties and liability for damages caused by unfair cryptocurrency trading.</p>\n                    <p><p>South Korea's government is taking steps to protect cryptocurrency investors from implosions like Do Kwon’s Terra ecosystem tokens by passing a new crypto bill.</p><p>The parliament of South Korea on June 30 passed the Virtual Asset User Protection legislation. The bill is designed to regulate unfair trade practices and protect crypto investors, the local news agency SBS Biz <a href=\"https://biz.sbs.co.kr/article/20000124984#:~:text=%EA%B0%80%EC%83%81%EC%9E%90%EC%82%B0%20%EC%9D%B4%EC%9A%A9%EC%9E%90%20%EB%B3%B4%ED%98%B8%EB%B2%95%EC%9D%80,%EC%8B%A0%EC%84%A4%ED%95%9C%20%EA%B2%8C%20%EA%B3%A8%EC%9E%90%EC%9E%85%EB%8B%88%EB%8B%A4.\" target=\"_blank\" rel=\"noopener nofollow\">reported</a>.</p><p>The legislation reportedly <a href=\"https://www.bloomberg.com/news/articles/2023-06-30/south-korea-passes-inaugural-standalone-crypto-bill-after-spate-of-scandals\" target=\"_blank\" rel=\"noopener nofollow\">integrates</a> 19 different crypto-related bills, providing a unified bill defining digital assets and imposing penalties for illicit trading activity like use of undisclosed information, market manipulation and other unfair trading practices in crypto.</p><p>According to local media, the main point of the Virtual Asset User Protection Act is to apply the Capital Market Act first to virtual assets with a securities nature. The legislation also aims to establish a basis for imposing penalties and liability for damages caused by unfair crypto trading.</p><p>In order to protect investors, virtual asset service providers (VASPs) in South Korea are now reportedly required to take responsibility of user’s deposits and provide insurance. Such measures are necessary to ensure user protection against hacks, computer failure and other risks.</p><p>According to the SBS Biz report, violation of new rules is subject to a fixed-term imprisonment of not less than one year or major fines. For example, for profits gained from unfair trade, the Financial Services Commission can impose a penalty equivalent to twice that amount.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/chinese-agency-blamed-by-do-kwon-for-passport-forgery\"><strong><em>Do Kwon denies forging passport, blames ‘Chinese’ agency: Report</em></strong></a></p><p>The news comes soon after Terraform Labs founder <a href=\"https://cointelegraph.com/news/do-kwon-sentenced-to-4-months-in-prison-in-montenegro-on-fake-passport-charges\">Do Kwon was sentenced by a court in Montenegro to four months in prison</a> after being found guilty of using a false passport. The exec is also <a href=\"https://cointelegraph.com/news/south-korea-issues-arrest-warrant-for-terra-founder-do-kwon\">facing an arrest warrant in South Korea</a> on allegations of violating the country’s capital markets law.</p><p>South Korean prosecutors recently claimed that Terra’s tokens collapse is the <a href=\"https://cointelegraph.com/news/do-kwon-could-serve-prison-in-both-us-south-korea-prosecutor\">largest financial fraud or financial securities fraud case</a> that has ever happened in the country.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/huobi-lawsuit-hodlnaut-opnx-3ac-asia-express/\"><strong><em>Asia Express: Huobi sues … Huobi? 3AC rises from ashes, Korea crypto contagion</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-30T09:46:48.000Z",
    "title": "Slovakia Votes to Lower Crypto Taxes",
    "url": "https://cryptodaily.co.uk/2023/06/slovakia-votes-to-lower-crypto-taxes",
    "description": "<p>The Slovakian Parliament this week voted in favour of a bill that would lower taxes on income derived from cryptocurrencies. </p>\n<p>Members of the Slovak Republic&rsquo;s National Council, or parliament, voted to approve an amendment that would lower cryptocurrency taxes, along with other measures that would affect crypto holders.</p>\nCrypto Income Tax Reduced to 7%\n<p>Bloomberg Law reports that Slovakia&rsquo;s National Council voted in favour of reducing personal income tax on profits derived from the sale of crypto held by a user for at least one year. As it stands, cryptocurrency profits are taxed on a sliding scale of either 19% or 25%.</p>\n<p>The approved amendment will see taxes lowered significantly to 7%.</p>\n<p>The amendment further declares payments received in cryptocurrencies up to 2,400 euros, or $2,600, will not be taxed. Additionally, the bill excludes cryptocurrency income from a health insurance contribution of 14%.</p>\nSlovakia Will Lose 30 Million Euro Through Tax Cuts\n<p>The newly amended tax policy comes only weeks after parliament passed a constitutional amendment that codifies citizens&rsquo; right to use cash as payment. The amendment was made due to talk about a digital euro.</p>\n<p>According to a local Slovakian media outlet, the Ministry of Finance estimates it will lose around 30 million euros annually due to the tax cut. &nbsp;</p>\nUS Lags as Europe Makes Regulatory Strides\n<p>Slovakia, as one of the 27 member states of the European Union (EU), has been promoting cryptocurrency regulations across the region. The EU voted in favour of its landmark MiCA bill, which will make Europe a hub for digital assets. The bill will take effect in 2024.</p>\n<p>The UK also made a significant step toward its crypto goal. The House of Lords voted to enact the Financial Services and Markets Bill, which will see cryptocurrencies become a &ldquo;regulated activity.&rdquo;</p>\n<p>While Europe, Hong Kong, Singapore and even Dubai compete for their share in the booming crypto market, the situation is less than ideal in the US. With full backing from the Biden administration, the SEC drives the industry away from its shores and ultimately into the arms of those who embrace it.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T10:00:56.000Z",
    "title": "Five Groundbreaking Crypto Casinos Every Avid Gambler Must Explore in 2023",
    "url": "https://www.cryptopolitan.com/five-groundbreaking-crypto-casinos-every-avid-gambler-must-explore-in-2023/",
    "description": "Welcome to the Future of Gambling Welcome to the future of gambling, where the digital world of cryptocurrencies has fused with the exhilarating world of online casinos. It&#8217;s 2023, and the gambling landscape has been revolutionized by the advent of crypto casinos, online platforms that use cryptocurrencies as the medium for transactions. These establishments are ... <a title=\"Five Groundbreaking Crypto Casinos Every Avid Gambler Must Explore in 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/five-groundbreaking-crypto-casinos-every-avid-gambler-must-explore-in-2023/\" aria-label=\"More on Five Groundbreaking Crypto Casinos Every Avid Gambler Must Explore in 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T09:53:43.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T09:50:22.000Z",
    "title": "Buckle Up for July 2023: Buy Ripple (XRP), VC Spectra (SPCT), and SUI At a Discount",
    "url": "https://www.cryptopolitan.com/buckle-up-for-july-2023-buy-ripple-xrp-vc-spectra-spct-and-sui-at-a-discount/",
    "description": "July 2023 will bring a lot of changes in the crypto world. As SEC continues to crack down on cryptocurrencies and exchanges in the US, many are shifting to other regions, targeting previously untouched markets. These include but are not limited to Ripple (XRP), VC Spectra (SPCT), and SUI (SUI). &#62;&#62;BUY SPECTRA TOKENS NOW&#60;&#60; Ripple ... <a title=\"Buckle Up for July 2023: Buy Ripple (XRP), VC Spectra (SPCT), and SUI At a Discount\" class=\"read-more\" href=\"https://www.cryptopolitan.com/buckle-up-for-july-2023-buy-ripple-xrp-vc-spectra-spct-and-sui-at-a-discount/\" aria-label=\"More on Buckle Up for July 2023: Buy Ripple (XRP), VC Spectra (SPCT), and SUI At a Discount\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T09:50:13.000Z",
    "title": "Discovering Why TMS Network (TMSN)’s Innovations Obfuscate Filecoin (FIL) And Optimism (OP)",
    "url": "https://www.cryptopolitan.com/discovering-why-tms-network-tmsns-innovations-obfuscate-filecoin-fil-and-optimism-op/",
    "description": "New platforms are launched regularly, seeking to introduce innovative solutions to transform various industries. TMS Network (TMSN) is one such contender that has rapidly gained prominence. It offers compelling investment potential that competes with established tokens like Filecoin (FIL) and Optimism (OP).&#160; Read more to learn how TMS Network (TMSN), still in phase 4 of ... <a title=\"Discovering Why TMS Network (TMSN)’s Innovations Obfuscate Filecoin (FIL) And Optimism (OP)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/discovering-why-tms-network-tmsns-innovations-obfuscate-filecoin-fil-and-optimism-op/\" aria-label=\"More on Discovering Why TMS Network (TMSN)’s Innovations Obfuscate Filecoin (FIL) And Optimism (OP)\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-30T10:00:11.000Z",
    "title": "CME Group set to launch ETH to BTC ratio futures in July",
    "url": "https://crypto.news/cme-group-set-to-launch-eth-to-btc-ratio-futures-in-july/",
    "description": "The Chicago Mercantile Exchange (CME) Group has announced its intention to launch Ether/Bitcoin ratio futures on July 31, pending regulatory approval.  CME Group revealed its plans for this new product on June 29, aiming to provide traders with a means&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-30T10:00:00.000Z",
    "title": "Dogecoin and Shiba Inu meme coins face stiff competition with the emergence of DigiToads",
    "url": "https://crypto.news/dogecoin-and-shiba-inu-meme-coins-face-stiff-competition-with-the-emergence-of-digitoads/",
    "description": " DigiToads is gaining popularity in crypto and competing with dogecoin (DOGE) and shiba inu (SHIB). TOADS presale has raised over $5.7 million"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T10:00:58.000Z",
    "title": "Arbitrum Gains Tempered By Obstacles, Hindering ARB’s Further Upswing",
    "url": "https://www.newsbtc.com/news/arbitrum-gains-tempered-by-obstacles-hindering-arbs-further-upswing/",
    "description": "Arbitrum (ARB)&#8217;s gains have been tempered by various challenges, hindering its further upswing. The declining inflows of stablecoins on the Arbitrum network have raised concerns among investors and enthusiasts alike, as it signals potential obstacles for the growth and development of the decentralized finance (DeFi) sector.  As a Layer-2 scaling solution for Ethereum, Arbitrum initially garnered significant attention and saw impressive gains, but recent hurdles have dampened the optimism surrounding its future prospects.  While the decline in stablecoin inflows is a cause for worry, there are potential avenues for growth that could help revive Arbitrum&#8217;s momentum.  Source: Coingecko Resilient Growth Amidst Volatility: ARB Performance Despite facing market volatility, both the Arbitrum protocol and its native token, ARB, have demonstrated remarkable growth. CoinGecko reports ARB&#8217;s current price at $1.14, showcasing a 0.9% rally over the past 24 hours and an encouraging seven-day gain of 3.3%. Related Reading: Solana Makes A Comeback: 15% Rally Signals Renewed Momentum However, a recent ARB report highlights a notable decline in stablecoin inflows on the Arbitrum platform, raising concerns about its potential impact on the protocol&#8217;s growth trajectory. The decrease in stablecoin inflows may also impact the protocol&#8217;s overall liquidity. Less stablecoins entering circulation may reduce liquidity in the market. Source: DeFiLlama Such a decline could also indicate a waning demand for stablecoin-based activities within the protocol, potentially affecting its position within the DeFi sector. A Path To Growth For Arbitrum Arbitrum recognizes the potential for expansion by engaging in collaboration within the gaming sector, aiming to attract a larger user base and enhance the Total Value Locked (TVL) on its protocol. Recent developments indicate that Reboot Protocol, in a tweet, has announced its partnership with pixelvaut to launch its flagship game on the Arbitrum network. These strategic alliances have the potential to act as catalysts for growth, offering a promising avenue to counterbalance the decline in stablecoin inflows. Exciting to see the #BattlePlan game on #ArbitrumNova 🧡💙 A launch by @rebootgg_ @pixelvault_ Welcome to the ecosystem 🙌 https://t.co/qCubAO8DYu — Arbitrum (💙,🧡) (@arbitrum) June 28, 2023 By capitalizing on collaborations in the gaming sector, Arbitrum seeks to tap into the ever-growing demand for decentralized applications (dApps) and virtual experiences. Related Reading: Dogecoin Faces Downward Pressure – Will DOGE Bulls Avert A Further Slide? Integrating games and related platforms onto the Arbitrum network could attract a new wave of users, expanding the ecosystem and bolstering the TVL. Moreover, such partnerships can contribute to creating a vibrant and diverse DeFi ecosystem on Arbitrum, offsetting the impact of declining stablecoin inflows. Total market cap of cryptocurrencies nearly unchanged at $1.15 trillion. Chart: TradingView.com Despite facing challenges, Arbitrum remains resilient in its price performance, demonstrating growth in both its protocol and ARB token. The decline in stablecoin inflows serves as a call to action for the platform to explore alternative avenues for growth, such as the collaboration in the gaming sector. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from DeFi Pulse"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T09:59:57.000Z",
    "title": "Bullish for Bitcoin? UK Passes Landmark Bill to Regulate Crypto, Unlocking Investment Opportunities and Boosting Economic Growth",
    "url": "https://www.crypto-news-flash.com/bullish-for-bitcoin-uk-passes-landmark-bill-to-regulate-crypto-unlocking-investment-opportunities-and-boosting-economic-growth/?utm_source=rss&utm_medium=rss&utm_campaign=bullish-for-bitcoin-uk-passes-landmark-bill-to-regulate-crypto-unlocking-investment-opportunities-and-boosting-economic-growth",
    "description": "The United Kingdom has successfully enacted legislation acknowledging cryptocurrency as a regulated financial practice within its borders. Now, with the official approval from King Charles, the Financial Services &#38; Markets Act 2023 has become law. The United Kingdom has successfully enacted legislation acknowledging cryptocurrency as a regulated financial practice within its borders. Specifically, the Financial [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-30T10:09:12.000Z",
    "title": "Binance Research: The State of the Crypto Industry in 2023",
    "url": "https://www.altcoinbuzz.io/top-article/binance-research-the-state-of-the-crypto-industry-in-2023/",
    "description": "<p>Binance Research, the research arm of crypto exchange Binance, has released a report titled &#8220;Institutional Crypto Outlook Survey.&#8221; The Binance research was carried out in collaboration with Binance VIP and Institutional. It provides an optimized digital asset trading experience for institutional clients such as asset managers, hedge funds, market makers, brokers, family offices, and proprietary [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/top-article/binance-research-the-state-of-the-crypto-industry-in-2023/\">Binance Research: The State of the Crypto Industry in 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-30T09:48:09.000Z",
    "title": "The Price of Litecoin (LTC) Surges in the Past 24H: 3 Reasons Why",
    "url": "https://coinedition.com/the-price-of-litecoin-ltc-surges-in-the-past-24h-3-reasons-why/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"The price of Litecoin (LTC) surged more\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/The-price-of-Litecoin-LTC-surged-more-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Many cryptos printed 24-hour gains causing the total crypto market cap to rise 1.82%. LTC delivered a standout performance and surged 14.35% over the past 24 hours to trade at $95.71. The hashrate for the Litecoin network touched a new all-time high over the past few days. According to CoinMarketCap, the global crypto market cap [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/the-price-of-litecoin-ltc-surges-in-the-past-24h-3-reasons-why/\">The Price of Litecoin (LTC) Surges in the Past 24H: 3 Reasons Why</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]