[
  {
    "source": "Cointelegraph",
    "date": "2023-12-11T20:18:32.000Z",
    "title": " Why is Ethereum (ETH) price down today?  ",
    "url": "https://cointelegraph.com/news/why-is-ethereum-eth-price-down-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTIvNzY1MTY5ZjktYTBmMC00MTdlLTgwYTctZTQ2YzYyZDU4ZjI2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ethereum price is down today and data suggests the correction was influenced by more than just futures liquidations.</p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) experienced a steep 9.5% correction in the early hours of Dec. 11. However, buyers quickly stepped in to defend the $2,220 support. Traders are now beginning to question whether the Ethereum network has what it takes to reinstate the bullish momentum to Ether price.</p><p>It is worth noticing that the correction aligned with the broader cryptocurrency market, as Ether's current 6.7% decline in the last 24 hours closely matches Bitcoin's (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) 5.4% and XRP's (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) 6.6% negative performances.</p><p>Naturally, excessive leverage is typically blamed for price movements that partially revert within minutes. The truth is that only $86 million in ETH long future contracts were forcefully terminated in the past 24 hours. This number pales in comparison to the $7.8 billion open interest in ETH futures, indicating that a significant portion of the $600 billion decline in available positions resulted from traders themselves.</p><p><a href=\"https://cointelegraph.com/news/why-is-ethereum-eth-price-down-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-11T20:30:50.000Z",
    "title": "Avalanche DeFi protocols hit 9-month high as AVAX token rallies",
    "url": "https://cryptoslate.com/avalanche-defi-protocols-hit-9-month-high-as-avax-token-rallies/",
    "description": "<p>The total value of assets locked on decentralized finance (DeFi) protocols based on Avalanche has reached a 9-month high amid the market rally of the AVAX token. Interestingly, the increase is coming when the number of locked AVAX tokens has been at its lowest since August 2021. Over the past month, the network users have [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/avalanche-defi-protocols-hit-9-month-high-as-avax-token-rallies/\">Avalanche DeFi protocols hit 9-month high as AVAX token rallies</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-11T20:31:51.000Z",
    "title": "South Korea proposes new regulations for crypto assets",
    "url": "https://cryptobriefing.com/south-korea-proposes-new-regulations-for-crypto-assets/?utm_source=feed&utm_medium=rss",
    "description": "New crypto asset regulations in South Korea address NFTs, interest on deposits, and cold wallet requirements."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-11T20:28:51.000Z",
    "title": "VanEck predicts record high for Bitcoin in late 2024",
    "url": "https://crypto.news/vaneck-predicts-record-high-for-bitcoin-in-late-2024/",
    "description": "VanEck predicts Bitcoin will hit a new all-time high on Nov. 9, 2024, based on its observed three-year price cycle."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-11T20:12:29.000Z",
    "title": "US Senator Elizabeth Warren introduces bill to crack down on crypto",
    "url": "https://crypto.news/us-senator-elizabeth-warren-introduces-bill-to-crack-down-on-crypto/",
    "description": "U.S. Senators, spearheaded by Elizabeth Warren, have broadened bipartisan backing for the Digital Asset Anti-Money Laundering Act to regulate cryptocurrency use."
  }
]