[
  {
    "source": "Decrypt",
    "date": "2023-07-03T12:00:08.000Z",
    "title": "Thailand Follows Singapore, Bans Crypto Exchanges From Offering Lending Services",
    "url": "https://decrypt.co/147114/thailand-follows-singapore-bans-crypto-exchanges-offering-lending-services",
    "description": "Like Singapore, Thailand is putting investor protection at the forefront of its crypto policy approach. "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-03T12:00:00.000Z",
    "title": "WebX Conference Welcomes Distinguished Guests: Japan PM, Yuga Labs CEO, Kabosu (Doge), Desdemona (AI Robot)",
    "url": "https://www.cryptoglobe.com/latest/2023/07/webx-conference-welcomes-distinguished-guests-japan-pm-yuga-labs-ceo-kabosu-doge-desdemona-ai-robot/",
    "description": "[Tokyo, June 28] – WebX, Asia’s leading Web3 conference (July 25-26), is thrilled to announce the participation of more esteemed guests at this year’s event: Japan prime minister Fumio Kishida, Yuga Labs CEO Daniel Alegre, the Dogecoin dog Kabosu, and the groundbreaking AI robot Desdemona (Made by Hanson Robotics, sister to Sophia the Robot). WebX […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-03T11:59:00.000Z",
    "title": "Vitalik Buterin Concerned About Solana",
    "url": "https://cryptodaily.co.uk/2023/07/vitalik-buterin-concerned-about-solana",
    "description": "<p>Ethereum founder Vitalik Buterin has expressed his sympathy and concerns for Solana and other cryptocurrencies in the context of the SEC&rsquo;s crackdown on the crypto markets.&nbsp;</p>\nButerin Feels Sorry For Rival Solana&nbsp;\n<p>In the midst of the ongoing regulatory crackdown on cryptocurrencies by the US Securities and Exchange Commission (SEC), Ethereum co-founder Vitalik Buterin has extended his sympathy to Solana, a rival blockchain platform, in light of the legal actions taken by the SEC against Binance and Coinbase, both renowned cryptocurrency exchanges globally. Buterin voiced his concerns over what he perceived as an unfair approach to crypto regulation, labeling the SEC's actions as unjust.</p>\nButerin Questions SEC&rsquo;s Moves\n<p>Buterin's comments were made during an online discussion with Matt Huang, Co-Founder and Managing Partner of Paradigm, a crypto-focused venture capital firm. While the SEC's actions are aimed at protecting investors, Buterin believes that the approach lacks nuance and could impede the progress of the industry as a whole. When asked how he felt about the United States&rsquo;s crypto policy, Buterin expressed his sympathy, saying,&nbsp;</p>\n\n<p>&ldquo;The one comment I'll make is that I feel bad that Solana and other projects are getting hit in this way. They don&rsquo;t deserve it, and if Ethereum ends up &lsquo;winning&rsquo; through all other blockchains getting kicked off exchanges, that&rsquo;s not an honorable way to win, and in the long term probably isn&rsquo;t even a victory.&rdquo;</p>\n\nSEC Names SOL As Unregistered Security\n<p>Solana, which has gained significant attention and experienced rapid growth in recent times, is among the projects facing increased scrutiny from the SEC. The regulatory agency has been actively investigating projects in the crypto sector to ensure compliance with existing securities laws. It has accused the major crypto firms of Binance and Coinbase of offering unregistered securities to the public. Naturally, these legal actions have also affected other major tokens, like Solana (SOL), Cardano (ADA), Polygon (MATIC), Algorand (ALGO), Filecoin (FIL), Cosmos (ATOM), Sandbox (SAND), Axie infinity (AXS), Decentraland (MANA), BNB (BNB), and others.&nbsp;</p>\n&ldquo;Centralized World Imposing On Decentralized Space&rdquo;\n<p>Buterin's sympathy for Solana reflects a broader sentiment within the crypto community, with many expressing concerns about the regulatory uncertainty faced by various projects. Industry participants are calling for clear guidelines and regulations that promote innovation and safeguard investor interests without stifling technological advancements. Buterin underscores that the crypto firms need to stand united as the true opponent is not each other but the &ldquo;rapidly expanding centralized world that is imposing itself on the decentralized space.&rdquo;&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T11:46:06.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "BTCManager",
    "date": "2023-07-03T11:53:59.000Z",
    "title": "PolyNetwork remains suspended 24 hours after $5m hack",
    "url": "https://crypto.news/polynetwork-remains-suspended-24-hours-after-5m-hack/",
    "description": "PolyNetwork is still trying to recover from the attack on July 2, where hackers stole about $5.5 million, even though the notional value of the episode is reportedly $34 billion. The Poly developers have halted all smart contracts to resolve&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-03T11:43:42.000Z",
    "title": "Hong Kong exchange to launch unlimited crypto credit card",
    "url": "https://crypto.news/hong-kong-exchange-to-launch-unlimited-crypto-credit-card/",
    "description": "Hong Kong-based crypto exchange LBank is preparing to introduce what it claims to be the world&#8217;s first unlimited cryptocurrency credit card. The upcoming card, available in virtual and physical forms, will allow users to make direct cryptocurrency payments through LBank&#8217;s&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T12:00:29.000Z",
    "title": "Tezos (XTZ) Price Prediction: Tradecurve (TCRV) Onboards A Record 13,000 Users",
    "url": "https://www.crypto-news-flash.com/tezos-xtz-price-prediction-tradecurve-tcrv-onboards-a-record-13000-users/?utm_source=rss&utm_medium=rss&utm_campaign=tezos-xtz-price-prediction-tradecurve-tcrv-onboards-a-record-13000-users",
    "description": "Altcoins are gaining significant traction within the cryptocurrency market as investors actively seek out opportunities beyond the famous Bitcoin and Ethereum. In this article, we will review the price predictions for Tezos (XTZ) and Tradecurve (TCRV) which is experiencing an inflow of new investors after adding a one-time bonus offer for stage four of its [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T11:59:48.000Z",
    "title": "Bitcoin Sparks BRICS Currency Surge: 41 Countries Eyeing Acceptance Ahead of Summit",
    "url": "https://www.crypto-news-flash.com/bitcoin-sparks-brics-currency-surge-41-countries-eyeing-acceptance-ahead-of-summit/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-sparks-brics-currency-surge-41-countries-eyeing-acceptance-ahead-of-summit",
    "description": "The list of nations willing to join the BRICS alliance has surged to 41 countries. BRICS countries have made efforts to develop a payment system known as &#8220;BRICS pay. The list of nations willing to join the BRICS alliance and adopt the new currency is expanding. Initially comprising 19 countries in April, the count has [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T11:58:47.000Z",
    "title": "Cardano сталкивается с сильной волатильностью; может ли эта новая монета-мем 100X и стать следующей криптовалютой Marvel в 2023 году?",
    "url": "https://www.crypto-news-flash.com/cardano-%d1%81%d1%82%d0%b0%d0%bb%d0%ba%d0%b8%d0%b2%d0%b0%d0%b5%d1%82%d1%81%d1%8f-%d1%81-%d1%81%d0%b8%d0%bb%d1%8c%d0%bd%d0%be%d0%b9-%d0%b2%d0%be%d0%bb%d0%b0%d1%82%d0%b8%d0%bb%d1%8c%d0%bd%d0%be%d1%81/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-%25d1%2581%25d1%2582%25d0%25b0%25d0%25bb%25d0%25ba%25d0%25b8%25d0%25b2%25d0%25b0%25d0%25b5%25d1%2582%25d1%2581%25d1%258f-%25d1%2581-%25d1%2581%25d0%25b8%25d0%25bb%25d1%258c%25d0%25bd%25d0%25be%25d0%25b9-%25d0%25b2%25d0%25be%25d0%25bb%25d0%25b0%25d1%2582%25d0%25b8%25d0%25bb%25d1%258c%25d0%25bd%25d0%25be%25d1%2581",
    "description": "DigiToads (TOADS) поставила перед собой цель пересмотреть правила рентабельности в криптовалютной игре. Подпитываемый неослабевающими инновациями этой криптовалютной платформы, ее нативный токен TOADS, вдохновленный мемами, стремится не только нарушить рынок, но и потенциально поднять богатство инвесторов до невообразимых высот. Но сможет ли DigiToads стать следующим крипточудом и обеспечить тот неуловимый 100-кратный рост, о котором мечтают многие [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-03T11:45:25.000Z",
    "title": "Crypto Analyst Predicts Monster Moves for Bitcoin, Says BTC Could Hit New All-Time Highs by October",
    "url": "https://dailyhodl.com/2023/07/03/crypto-analyst-predicts-monster-moves-for-bitcoin-says-btc-could-hit-new-all-time-highs-by-october/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/tim-draper-bitcoin-year.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/tim-draper-bitcoin-year.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/tim-draper-bitcoin-year.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/tim-draper-bitcoin-year.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/tim-draper-bitcoin-year.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/tim-draper-bitcoin-year.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/tim-draper-bitcoin-year.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist believes the stage is set for Bitcoin (BTC) to go on a parabolic advance. Pseudonymous analyst Credible Crypto tells his 341,900 Twitter followers that Bitcoin&#8217;s bull market is likely underway after BTC successfully retested $25,000 as support. According to the trader, Bitcoin looks poised to print monster moves in the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/03/crypto-analyst-predicts-monster-moves-for-bitcoin-says-btc-could-hit-new-all-time-highs-by-october/\">Crypto Analyst Predicts Monster Moves for Bitcoin, Says BTC Could Hit New All-Time Highs by October</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]