[
  {
    "source": "Cointelegraph",
    "date": "2023-07-03T10:03:36.000Z",
    "title": "Crypto Twitter has a persistent 'fake followers' problem, data reveals",
    "url": "https://cointelegraph.com/news/crypto-twitter-has-a-persistent-fake-followers-problem-data-reveals",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/cbed4240-b08a-4722-814f-2fd16097f56d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Shiba Inu had the greatest number of fake followers at 10.26% or 80,000 accounts, while Avalanche and Polygon followed suit with 8.14% and 7.58% of fake accounts respectively. </p>\n                    <p><p>Despite changes introduced by Twitter management since <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/elon-musk-and-crypto-twitter\">Elon Musk</a>’s takeover, the issue around fake followers remains a persistent problem. As many as 10% of the followers of accounts belonging to crypto influencers and companies are fake, new data from dappGambl has revealed.</p><p>In April 2023, Musk introduced Twitter Blue — an $8 monthly subscription for verification — to increase the platform’s revenue while making it financially inviable for bots and fake accounts to operate. However, months later, dappGambl’s investigation found that up to 10% of followers from the most followed crypto accounts are fake. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/65b0109c-f825-42d2-89b5-902791af6409.jpg\"  /></figure><p>When it comes to the official accounts of cryptocurrency tokens and ecosystems, Shiba Inu (<a href=\"https://cointelegraph.com/shiba-inu-price-index\">SHIB</a>) had the highest number of fake followers at 10.26% or 80,000 accounts, while Avalanche (<a href=\"https://cointelegraph.com/avalanche-price-index\">AVAX</a>) ranked second with 8.14% fake followers, followed by Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) with 7.58% or 73,000 fake accounts. </p><p>dappGambl suspected that the relationship between Twitter accounts and their fake followers is dependent on the popularity of the tokens. By analyzing the social sentiment behind crypto accounts, dappGambl found that:</p><blockquote>“Dai (<a href=\"https://cointelegraph.com/dai-price-index\">DAI</a>) is the most loved (popular) coin on Twitter whilst XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) is the most hated (unpopular).”</blockquote><p>Generally, the crypto community on Twitter sees DAI as the “future of money” while it tends to associate XRP with scams, states dappGambl.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/d1d30de5-a2c3-48f1-a937-b56eced16ce7.jpg\"  /></figure><p>When it comes to crypto influencers and entrepreneurs, Samson Mow boasts the highest percentage of fake followers among his total following. Mow is currently being followed by 26,000 fake accounts that represent 10% of his total following on Twitter. </p><p>Twitter co-founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/jack-dorsey\">Jack Dorsey</a> has 560,000 (8.62%) fake followers, while El Salvador President <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/nayib-bukele\">Nayib Bukele</a> and Ethereum co-founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/vitalik-buterin\">Vitalik Buterin</a> had nearly 6.5% of fake followers among his total count.</p><p>Other prominent figures with substantial fake followers include MicroStrategy co-founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/michael-saylor\">Michael Saylor</a> (6.16%), Binance CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/changpeng-zhao\">Changpeng ‘CZ’ Zhao</a> (5.58%) and Tesla CEO Elon Musk (4.76%) among others. </p><p>Based on the total number of followers, over 6.7 million fake accounts currently follow Musk as he tries to eradicate the very problem. Some of the methods to identify fake accounts are — checking when the account was created, investigating the profile picture, account bio and tweets sent out by the account and checking the account's followers and following.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/twitter-down-elon-musk-rate-limit-exceeded\"><strong><em>Elon Musk imposes ‘rate limit’ on Twitter, citing extreme ‘system manipulation’</em></strong></a></p><p>A popular Twitter bot that goes by the name of “Explain This Bob” was recently suspended after Musk called it a scam. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This sure looks like a scam crypto account. If so, it will be suspended.</p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1670234733949624320?ref_src=twsrc%5Etfw\">June 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As Cointelegraph previously reported, the bot was created by Prabhu Biswal from India, which used OpenAI’s GPT-4 model to comprehend and provide responses to tweets by those who tagged the account.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-03T09:51:29.000Z",
    "title": "Litecoin’s Resurgence: The ‘Silver’ to Bitcoin’s ‘Digital Gold’ Makes a Comeback",
    "url": "https://www.cryptoglobe.com/latest/2023/07/litecoins-resurgence-the-silver-to-bitcoins-digital-gold-makes-a-comeback/",
    "description": "Litecoin (LTC), which is often referred to as the “silver” to Bitcoin’s “digital gold,” is making a remarkable comeback. This resurgence has been sparked by renewed interest from investors, driven by the recent listing of Litecoin and Bitcoin Cash on EDX Markets, a Wall Street-backed exchange, which was launched on 20 June 2023. Here is […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-03T09:49:03.000Z",
    "title": "Crypto Exchange LBank Launches Cryptocurrency Credit Card",
    "url": "https://cryptodaily.co.uk/2023/07/crypto-exchange-lbank-launches-cryptocurrency-credit-card",
    "description": "<p>Cryptocurrency exchange LBank has announced the launch of the first unlimited crypto credit card. </p>\n<p>According to a press release, world-leading crypto exchange LBank announced the launch of the world&rsquo;s first unlimited cryptocurrency credit card.</p>\n<p>The card will be available in both physical and virtual forms and aims to break the boundaries of crypto payments.</p>\n<p>LBank&rsquo;s crypto credit card allows its users to make any purchase and payments directly with cryptocurrencies granted by the exchange. The card will also support local cash withdrawals.</p>\n<p>The exchange&rsquo;s nine million users are expected to have access to its new service in Q3 2023, with its VIP users enjoying early-access privileges.</p>\n<p>The press release further states the card will have no spending or withdrawal limits and may be used on payment platforms such as Google Play. No information regarding fees and charges is currently available, but such information will be announced before the card&rsquo;s release.</p>\n<p>LBank&rsquo;s founder, Eric He, commented:</p>\n\n<p>For us, an important point is that users from all over the world can order and use our credit card. Our vision is to make crypto assets safer and circulation freer. Launching our own credit card is a significant step towards achieving this goal.</p>\n\n<p>The LBank credit card can be ordered from the exchange&rsquo;s website and is offered in various options, including a metal version.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T09:59:41.000Z",
    "title": "Approximately $2.27M worth of NFTs stolen in June: Reports",
    "url": "https://www.cryptopolitan.com/2-27m-worth-of-nfts-stolen-in-june-reports/",
    "description": "In a recent report by PeckShield, a blockchain security firm, concerning data points on nonfungible tokens (NFTs), some interesting findings have been highlighted. The report reveals that approximately $2.27 million worth of NFTs were stolen in June 2023, representing the lowest recorded value of stolen NFTs throughout the year. This figure also indicates a significant ... <a title=\"Approximately $2.27M worth of NFTs stolen in June: Reports\" class=\"read-more\" href=\"https://www.cryptopolitan.com/2-27m-worth-of-nfts-stolen-in-june-reports/\" aria-label=\"More on Approximately $2.27M worth of NFTs stolen in June: Reports\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T09:47:36.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s&#160;Solana price&#160;is $19.05 with a 24-hour trading volume of $618,897,839.&#160;Solana is up 0.56% in the last 24 hours.&#160;The current CoinMarketCap ranking is #10, with a live market cap of $7,273,881,101.&#160;It has a circulating supply of 394,890,490 SOL coins&#160;and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-03T10:00:55.000Z",
    "title": "Top 10 crypto in June 2023: which assets outperformed the market",
    "url": "https://crypto.news/top-10-crypto-in-june-2023-which-assets-outperformed-the-market/",
    "description": "Since the start of June, the crypto industry has witnessed many ups and downs and even some unexpected events that have impacted the markets significantly. The month started with the US SEC taking legal action against Binance and Coinbase, making&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-03T10:00:00.000Z",
    "title": "Golden Inu presale launch aims to displace Dogecoin and Shiba Inu",
    "url": "https://crypto.news/golden-inu-presale-launch-aims-to-displace-dogecoin-and-shiba-inu/",
    "description": "Golden Inu, a community-focused project, has just passed $110,000 in its GOLDEN token presale"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-03T09:46:17.000Z",
    "title": "On-chain data suggests the rise of long-term BTC investors",
    "url": "https://crypto.news/on-chain-data-suggests-the-rise-of-long-term-btc-investors/",
    "description": "As the bitcoin (BTC) price broke the $30,000 barrier, data shows that long-term investors have risen while showing slow but steady growth. According to data from CryptoQuant, the bitcoin inflows to exchanges indicator witnessed its most significant decline. Simply put,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-03T10:00:55.000Z",
    "title": "Cristiano Ronaldo Goes Crypto Again: Drops Second NFT Collection On Binance",
    "url": "https://www.newsbtc.com/nft/cristiano-ronaldo-goes-crypto-again-drops-second-nft-collection-on-binance/",
    "description": "Cristiano Ronaldo, an acclaimed football player, recently made waves in the news for reasons aside from his prowess on the field. He has expanded his involvement in Non-Fungible Tokens (NFTs) by presenting his second NFT collection. This offering aims to celebrate Ronaldo&#8217;s exceptional accomplishments throughout his illustrious career, particularly showcasing his unique goals in soccer. Celebrating Cristiano Ronaldo&#8217;s Illustrious Career Goals Set to launch on July 3, this new collection will present a diverse selection of 20 unique designs that symbolize significant milestones from Ronaldo&#8217;s impressive journey. These designs have been divided into four levels of rarity, ensuring collectors have various options based on their preferences. Each design elegantly captures memorable moments from Ronaldo&#8217;s goal-scoring genius—whether a breathtaking bicycle kick or a powerful long-range strike. Each piece encapsulates the essence of Ronaldo&#8217;s outstanding ability to find the back of the net. Related Reading: FTX Puts Sale Of $500 Million Stake In AI Firm Anthropic On Hold In the collection, there are highly sought-after items known as NFTs that stand out. These particular NFTs possess six distinct designs, making them exceptionally rare. Only 120 special products exist, turning these super-rare NFTs into valuable collector possessions. Aside from having exclusive digital ownership, each super rare NFT comes with exceptional advantages for its owner. Notably, one of these benefits includes receiving a soccer jersey personally autographed by Cristiano Ronaldo himself—a truly unique and invaluable item that holds immense significance to any football devotee. Anticipation For Cristiano Ronaldo&#8217;s Second NFT Collection Cristiano Ronaldo&#8217;s initial non-fungible token (NFT) collection encountered a difficult start in the market, facing several challenges. These obstacles emerged during a period marked by significant complexities, ultimately influencing how this collection was received and performed. Related Reading: FTT Flies 45% On Rumors Of FTX Planned Relaunch Among the various hurdles confronted by the first collection, one significant challenge arose when it was launched merely a week following the collapse of the FTX Derivatives Exchange. The demise of FTX had substantial ramifications on general crypto market sentiments, resulting in an overall decline and eroding investor trust. Nonetheless, given the increasing traction and comprehension of NFTs among collectors and enthusiasts alike, alongside possible improvements in market conditions, there is potential for Ronaldo&#8217;s second collection to attract a broader audience. Addressing Legal And Regulatory Challenges In The NFT Market The advent of non-fungible tokens (NFTs) has given rise to legal and regulatory complexities on a global scale. This issue primarily stems from lacking an internationally acknowledged legal definition for NFTs. However, countries are currently developing their systems for classifying NFTs, highlighting the urgent need for a worldwide organization that can set universal regulations and legitimize these digital assets. As the NFT market continues to experience substantial expansion, it becomes even more crucial to establish a governing agency that can effectively address these challenges. Featured image from Twitter, charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T10:05:04.000Z",
    "title": "Breaking: When Shiba Inu’s Shibarium Launches, 20T SHIB will be Burned Each Month – Can It Drive Price to $0.0001? Report",
    "url": "https://www.crypto-news-flash.com/breaking-when-shiba-inus-shibarium-launches-20t-shib-will-be-burned-each-month-can-it-drive-price-to-0-0001-report/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-when-shiba-inus-shibarium-launches-20t-shib-will-be-burned-each-month-can-it-drive-price-to-0-0001-report",
    "description": "Shib ecosystem official LUCIE breaks down the impact of Shibarium on the ecosystem and some benefits of the &#8220;burning mechanism.&#8221; She explained that 70 percent of the base fee would be burnt while 30 percent goes into network maintenance.  The burning mechanism of Shibarium is something that excites the crypto community as its potential removal [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T10:00:00.000Z",
    "title": "VC Spectra Shows Incredible Potential vs. Dogecoin and Chainlink",
    "url": "https://www.crypto-news-flash.com/vc-spectra-shows-incredible-potential-vs-dogecoin-and-chainlink/?utm_source=rss&utm_medium=rss&utm_campaign=vc-spectra-shows-incredible-potential-vs-dogecoin-and-chainlink",
    "description": "In the dynamic world of cryptocurrency, market volatility fuels investors to explore uncharted territories. While Dogecoin&#8217;s (DOGE) bearish momentum dampens investor sentiment, Chainlink&#8217;s (LINK) impressive performance has caught investors&#8217; attention. Fortunately, VC Spectra (SPCT) saves the day with its sustainable investment strategies, ensuring optimized returns. SPCT has become a magnet for investors, as its market [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-03T10:08:59.000Z",
    "title": "OP’s Bullish Trend Likely To Continue, But Emission Concern Looms",
    "url": "https://coinedition.com/ops-bullish-trend-likely-to-continue-but-emission-concern-looms/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Optimism OP Coin Skyrockets Following Bedrock Upgrade Announcement\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The DeFi analytics platform DefiLlama announced on Twitter yesterday that it started tracking Optimism’s OP emissions on its Unlocks Dashboard. According to DefiLlama’s data, it is estimated that just over 2.5 billion OP tokens will be unlocked after 2026. This figure was generated by emissions from investors, the Optimism team, Airdrops, Retroactive public goods funding, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ops-bullish-trend-likely-to-continue-but-emission-concern-looms/\">OP’s Bullish Trend Likely To Continue, But Emission Concern Looms</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]