[
  {
    "source": "CoinDesk",
    "date": "2023-07-14T16:00:33.000Z",
    "title": "Co:Create Releases Web3 Loyalty App on Shopify",
    "url": "https://www.coindesk.com/web3/2023/07/14/cocreate-releases-web3-loyalty-app-on-shopify/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The app allows over 4 million Shopify businesses to implement blockchain-based loyalty and rewards programs from their storefront."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-14T15:54:50.000Z",
    "title": "FTX Founder Sam Bankman-Fried Is Getting Lonely and Needs a Maid",
    "url": "https://decrypt.co/148578/sbf-friends-colleagues-household-help-approved-visitors",
    "description": "The lawyers asked that \"close friends and colleagues of Bankman-Fried’s parents and household help\" be allowed to visit without security checks."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T16:01:53.000Z",
    "title": "3AC co-founders' OPNX exchange onboards FTX, Celsius bankruptcy claims",
    "url": "https://cointelegraph.com/news/3ac-co-founders-opnx-exchange-onboards-ftx-celsius-bankruptcy-claims",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/53c2fa8b-007f-4d03-bcb2-5acb7b65eeef.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Claims can be converted into collateral to trade crypto futures on the exchange. </p>\n                    <p><p>OPNX, an exchange dedicated to the trading of bankruptcy claims against fallen crypto firms, has listed FTX and Celsius claims.</p><p>According to the July 14 <a href=\"https://opnx.com/claims\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, FTX claims specifically can be immediately onboarded and converted into collateral in the form of OPNX's native reborn OX (reOX) tokens or oUSD, its credit currency. Users can then trade crypto futures using reOX as collateral. The claims are tokenized in partnership with Heimdall, which also handles onboarding and user verification. Developers wrote:</p><blockquote>\"Claims will initially be converted into reOX tokens at a 100% bonus of the market price, which will converge to 0% bonus over a period of 50 weeks. This means, during Week 1, users will receive double the market price for their FTX claim.\"</blockquote><p>In an illustrative example by OPNX, a $1 million FTX claim with a claim price of 30 cents on the dollar would receive $600,000 in equivalent reOX claim amounts. \"In the case that a user's claim is determined to have preference, an equivalent dollar amount of the issued reOX tokens will be reclaimed from the user,\" the exchange wrote. Claims are transferred and stored in a separate trust. </p><p>OPNX was founded earlier this year by Kyle Davies and Zhu Su, co-founders of bankrupt Singaporean hedge fund Three Arrows Capital, also known as 3AC. On its first day of operations, OPNX saw a meager $13.64 in total volume traded. By late June, daily exchange volume <a href=\"https://cointelegraph.com/magazine/wp-admin/post.php?post=21338&amp;action=edit\">had surpassed $30 million</a>. </p><p>Cointelegraph reported in May that the U.S. Internal Revenue Service is seeking <a href=\"https://cointelegraph.com/news/irs-claiming-44b-from-ftx-bankruptcy-report\">$44 billion in unpaid taxes</a> from FTX's bankruptcy. Likewise, the U.S. Federal Trades Commission issued a <a href=\"https://cointelegraph.com/news/celsius-network-fined-billions-by-ftc\">$4.7 billion fine</a> against Celsius on July 13 on a suspended judgment. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/3ac-cooks-up-a-storm-bitcoin-miner-surges-360-bruce-lee-nfts-dive-asia-express/?doing_wp_cron=1689349815.7624518871307373046875\">3AC cooks up a storm, Bitcoin miner surges 360%, Bruce Lee NFTs dive</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-14T15:40:36.000Z",
    "title": "Sui Network hits 1M active addresses within two months of launch",
    "url": "https://cryptoslate.com/sui-network-hits-1m-active-addresses-within-two-months-of-launch/",
    "description": "<p>Layer-1 blockchain Sui (SUI) Network reached 1 million active addresses less than two months after its mainnet launch, according to a July 14 press statement shared with CryptoSlate. Greg Siourounis, the managing director of the Sui Foundation, stated that the blockchain network&#8217;s success showed a growing demand for the platform. Siourounis added: &#8220;Sui’s success so [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sui-network-hits-1m-active-addresses-within-two-months-of-launch/\">Sui Network hits 1M active addresses within two months of launch</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-14T15:55:06.000Z",
    "title": "CryptoRank publishes 2023 crypto fundraising report",
    "url": "https://cryptodaily.co.uk/2023/07/cryptorank-publishes-2023-crypto-fundraising-report",
    "description": "<p>After a significant downturn in the crypto market, it appears that in the first half of 2023, the venture investment market, much like the price of Bitcoin, has found its bottom. But unlike the BTC price, the recovery trend in fundraising has not been observed yet; the raised amount fell by 87% in Q2 2023 compared to Q2 2022.</p>\n<p>A total of $5.1B was raised across 619 funding rounds in the first half of 2023. Improved market sentiment has not had a significant impact on fee growth. Historical data shows that the total fees figure often lags behind the Bitcoin price by several months.</p>\n<p></p>\n<p>Highlights</p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Service, СeFi, and Infrastructure startups received the highest amount of funding.&nbsp;</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">The largest crypto raise was by Stripe, which closed a $6.5B funding round in March</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Vitalik Buterin, Jack Dorsey, and Sam Altman were prominent investors in the funding rounds.</li>\n</ul>\n<p></p>\n<p>In the first half of the year, Blockchain Service emerged as the dominant category in the fundraising market, capturing a significant 38% of total investments. Interestingly, there has been a notable decline in venture capital&rsquo;s interest in DeFi, which now accounts for only 9% of the overall funding.&nbsp;</p>\nBlockchain service projects are leading the way, largely due to the growing adoption of Web3 technologies. They serve as the main connection between users and blockchain, bridging the gap between web2 and web3 and making the experience of using decentralized networks more convenient. Among blockchain service projects raising money in 2023, Ledger, a crypto wallet developer, and EigenLayer, a liquid staking derivatives restocking platform, are noteworthy.\n<p></p>\n<p>&nbsp;</p>\n<p>VCs continue to prioritize early-stage rounds, with pre-seed and seed rounds accumulating a total of over 1 billion USD in funding.</p>\n<p>In contrast, in later stages such as Series A, B, C, and D, the number of successfully closed rounds tends to decline. Meanwhile, the average amount raised per round is significantly higher at later stages of fundraising.</p>\n<p>However, with the expansion of the crypto market and the emergence of high-quality projects, we can anticipate a potential shift towards increased funding in post-seed rounds.</p>\nTrending Categories in Crypto Fundraising\n<p>A detailed analysis of the category reveals that the position of DeFi projects in terms of fundraising is not as weak as it may appear. While DeFi projects are not leading in terms of fundraising, they are in second place in terms of the number of funding rounds.</p>\n<p>In contrast, Blockchain Infrastructure projects have the opposite pattern. These projects are second in terms of fundraising per month, but they have one of the smallest numbers of funding rounds. Infrastructure projects often have the largest funding rounds, but they occur quite rarely.</p>\n<p></p>\nLet's take a look at the most popular categories among the most active investors. The chart below not only displays the most active investors but also allows us to assess the prioritized sectors for each fund. Coinbase Ventures and Circle prioritize investing in DeFi, while Polygon Fund and a16z Crypto prioritize GameFi.\n<p>Most of the most active investors primarily invest in blockchain service and DeFi projects. However, for some, GameFi is an important area of focus, as they are quick to adopt and allow them to build an entertainment ecosystem, such as Animoca Brands.</p>\n<p></p>\n<p>Notable Funding Rounds of 2023</p>\n<p>Currently, most projects are raising small amounts. Nearly half of all rounds with a known raised amount were in the range of $1 million to $5 million.</p>\n<p></p>\n<p>Investors are still hesitant to invest significant amounts in crypto startups, as evidenced by the top 10 largest fundraising rounds of the first half of 2023. The top three projects in terms of fundraising are only partially integrated into web3 and blockchain, relying mostly on web2 technologies.</p>\n<p></p>\n<p>Apart from Stripe, other notable investments in the top funding rounds include a digital exchange eToro, and character.ai, backed by prominent investors such as a16z and Elad Gil. These strategic investments highlight the diverse range of opportunities and the growing interest in innovative platforms and AI-driven technologies within the investment landscape.</p>\n<p></p>\n<p>Among the key figures in the crypto during the first half of the year were notable individuals such as Vitalik Buterin and Jack Dorsey. These influential figures have actively participated in funding rounds, demonstrating their belief in the potential of blockchain and cryptocurrency. Additionally, seasoned venture capitalists like Tim Draper have also joined the fray, making strategic investments in projects like EtherMail.</p>\nThe Bottom Line\n<p>The first half of 2022 witnessed a weak outcome in raising funds from private investors in cryptocurrency startups. This is evident from the significant drop in raises during Q2, reaching the lowest level of funds raised since the end of 2020. Many investors who were highly active in 2021-2022 have now considerably reduced their investments in Web3.</p>\n<p>However, can we expect a trend reversal? The answer is unequivocal: yes. With the emergence of new trends, further market recovery, and better regulation standards, many investors will return to the market, and we should also expect an influx of new investors.</p>\n<p>As the year progresses, it will be fascinating to observe how these developments shape the future of the industry and pave the way for new innovations and collaborations.</p>\n<p>To keep up-to-date on crypto VC deals you can visit the funding rounds page on CryptoRank: https://cryptorank.io/funding-rounds.</p>\n<p>Follow us on Twitter and Telegram for more insights!</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T16:04:11.000Z",
    "title": "Circle CEO warns Congress about threats to the dollar",
    "url": "https://www.cryptopolitan.com/circle-ceo-congress-about-threats-dollar/",
    "description": "Circle CEO Jeremy Allaire, has sounded the alarm about the United States dollar’s position as a global reserve currency. In a two-minute video released by Circle on July 13, Allaire directed his message to lawmakers, emphasizing the urgent need for Congress to regulate stablecoins. Circle CEO wants urgent regulation of stablecoins The call for action ... <a title=\"Circle CEO warns Congress about threats to the dollar\" class=\"read-more\" href=\"https://www.cryptopolitan.com/circle-ceo-congress-about-threats-dollar/\" aria-label=\"More on Circle CEO warns Congress about threats to the dollar\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T16:01:19.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T15:46:25.000Z",
    "title": "XRP becomes the fourth largest token following a court ruling",
    "url": "https://www.cryptopolitan.com/xrp-becomes-the-fourth-largest-token/",
    "description": "Ripple’s XRP, the digital asset associated with Ripple Labs, has witnessed a remarkable surge in market capitalization following the company’s partial victory in its legal battle against the U.S. Securities and Exchange Commission (SEC) on July 13. Within hours of the court ruling, XRP’s market cap experienced a staggering increase of $21.2 billion, reaching a ... <a title=\"XRP becomes the fourth largest token following a court ruling\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-becomes-the-fourth-largest-token/\" aria-label=\"More on XRP becomes the fourth largest token following a court ruling\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T15:43:41.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-14T15:43:28.000Z",
    "title": "SEC gives official acknowledgment to Bitwise’s resubmitted spot bitcoin ETF application",
    "url": "https://crypto.news/sec-gives-official-acknowledgment-to-bitwises-resubmitted-spot-bitcoin-etf-application/",
    "description": "The U.S. Securities and Exchange Commission has formally acknowledged the spot bitcoin ETF application from San Francisco&#8217;s Bitwise Asset Management, underscoring the escalating institutional engagement in cryptocurrency investments. The U.S. SEC has given official recognition to Bitwise Asset Management&#8217;s spot&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-14T16:00:15.000Z",
    "title": "Here’s What On-Chain Data Reveals About XRP Rally",
    "url": "https://www.newsbtc.com/news/ripple/heres-what-on-chain-data-reveals-about-xrp-rally/",
    "description": "XRP has observed a massive 67% rally during the past 24 hours. Here are some facts on-chain data reveals about this price surge. Several Indicators Have Surged Following The XRP Rally In its latest insight post, the on-chain analytics firm Santiment has looked into the underlying metrics related to XRP as the cryptocurrency has seen an extremely sharp surge during the last day. This rapid growth in the asset&#8217;s value has come following Ripple&#8217;s victory in court as XRP has been declared &#8220;not a security.&#8221; Immediately after the announcement, the coin had managed to rise by around 90%, but in the hours since then, the asset has taken some hit. Nonetheless, the cryptocurrency has still managed to hold onto the majority of its gains so far, as it&#8217;s still up 67%. This rise has now made the asset the fourth largest in the space in terms of market cap, as it has leapfrogged past BNB. Following the rally, the &#8220;social dominance&#8221; of XRP saw a sharp surge toward the 7.4% mark, as the below chart displays. Looks like the metric's value has spiked &#124; Source: Santiment Social dominance measures how the discussions on social media related to any given coin (which, in this case, is XRP) compare against the combined amount of talk the top 100 assets by market cap are receiving currently. At the current value of the metric, 7.4% of all discussions related to these top 100 coins are coming from XRP alone. Such a high amount of interest among social media users is generally a sign of euphoria, which usually leads to a correction in the price. This may explain why the asset has taken a hit since the initial jump. Related Reading: Bitcoin MVRV At Critical Level: Will A Break Happen? In terms of whale activity, the network has naturally been active during this surge, as these humongous investors have made a large number of transactions, as shown below. The value of the metric seems to have been quite high recently &#124; Source: Santiment The number of whale transfers has crossed the 637 mark during the past day, which is the highest level observed in 2023. &#8220;Clearly the pump is being fueled by these large transactions,&#8221; notes Santiment. The trading volume (the total amount of XRP being transacted on the chain) has also registered a steep increase, which isn&#8217;t too surprising considering the high amount of whale activity that has occurred during the past day. The volume has seen a spike &#124; Source: Santiment The current levels of the trading volume are the highest that they have been in around 10 months, further showcasing the extraordinary activity that the blockchain is observing right now. Related Reading: Bitcoin Price Attempts To Follow XRP But This Resistance Is The Key The analytics firm has also pointed out how the sharks and whales of the cryptocurrency had been accumulating during the couple of months that have led to this rally. The sharks and whales have been constantly buying &#124; Source: Santiment &#8220;This group of wallets is essentially the one best to watch to understand how &#8216;smart money&#8217; is behaving,&#8221; explains Santiment. &#8220;And they had been showing confidence in the asset for over two months now, even prior to today&#8217;s court ruling.&#8221; XRP Price At the time of writing, XRP is trading around $0.78, up 69% in the last week. XRP's extraordinary rise during the past day &#124; Source: XRPUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T16:00:32.000Z",
    "title": "Top 3 Cryptos To Invest In Now: July Edition – includes a new token that could leap 80%!",
    "url": "https://www.crypto-news-flash.com/top-3-cryptos-to-invest-in-now-july-edition-includes-a-new-token-that-could-leap-80/?utm_source=rss&utm_medium=rss&utm_campaign=top-3-cryptos-to-invest-in-now-july-edition-includes-a-new-token-that-could-leap-80",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T161119.645.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T161119.645.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T161119.645-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T161119.645-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Market experts are predicting what cryptocurrencies to invest in throughout July and the verdict is in. Shiba Inu and Polygon (MATIC) are must-haves.  Its believed that both projects will not only recover from their June lows, but reach higher than their pre-crash value. But this month, an exciting new token is also making moves throughout [...]"
  }
]