[
  {
    "source": "Cointelegraph",
    "date": "2024-04-06T00:36:45.000Z",
    "title": " ZachXBT claims he is being ‘borderline harassed’ by US law enforcement ",
    "url": "https://cointelegraph.com/news/zachxbt-blockchain-crime-internal-revenue-service-united-states",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvYWEyMzdiNDMtZTdmYS00NWFjLWIyMzAtYjNhNjdhYWJhZjgyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>In an email shared by ZachXBT, an IRS criminal investigations agent asked if he could help him make the “biggest impact” in tackling blockchain crime.</p>\n                    <p><p>Blockchain investigator ZachXBT has alleged that he's been the target of what he deems as borderline harassment by the Criminal Investigation (CI) Unit of the United States Internal Revenue Service (IRS), as they seek his assistance in blockchain investigations.</p><p>According to a March 6 post on X, ZachXBT explained that although he has been willing to help victims and support law enforcement with necessary information, he believes that the U.S. law enforcement agency has crossed his \"personal boundaries\" in their effort to get his assistance to solve blockchain crime.</p><p>“They have shown up irl to old addresses, contacted personal emails using private data, and have sent mail when I have public contact methods readily available,” he claimed.</p><p><a href=\"https://cointelegraph.com/news/zachxbt-blockchain-crime-internal-revenue-service-united-states\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-06T00:14:31.000Z",
    "title": "So, how is Japan’s economy faring now?",
    "url": "https://www.cryptopolitan.com/so-how-is-japans-economy-faring-now/",
    "description": "Japan&#8217;s economy is seeing some pretty wild twists and turns, making for an intriguing, but kinda nerve-wracking, story. For starters, the average household in Japan has been tightening the purse strings, and no, not out of a newfound passion for frugality, but because inflating prices are putting a damper on their shopping sprees. This has [&#8230;]"
  }
]