[
  {
    "source": "Decrypt",
    "date": "2023-12-15T03:02:03.000Z",
    "title": "Casio Drops Virtual G-Shock Watches as Ethereum NFTs—With Exclusive Perks",
    "url": "https://decrypt.co/209939/casio-drops-virtual-g-shock-watches-ethereum-nfts-exclusive-perks",
    "description": "The G-Shock watch brand debuts a pair of fantastical digital designs on Ethereum, with a variety of special benefits for holders."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-15T03:00:24.000Z",
    "title": "SEC Chair Gensler: We Do Things According to Our Authorities and How Courts Interpret Them",
    "url": "https://news.bitcoin.com/sec-chair-gensler-we-do-things-according-to-our-authorities-and-how-courts-interpret-them/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/gary-gensler-bitcoin-etf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC Chair Gensler: We Do Things According to Our Authorities and How Courts Interpret Them\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/gary-gensler-bitcoin-etf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/gary-gensler-bitcoin-etf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/gary-gensler-bitcoin-etf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/gary-gensler-bitcoin-etf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/gary-gensler-bitcoin-etf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/gary-gensler-bitcoin-etf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/gary-gensler-bitcoin-etf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler has affirmed that the securities regulator acts according to its authorities and how the courts interpret them. This includes how the agency plans to deal with spot bitcoin exchange-traded fund (ETF) applications, he noted. Gensler also confirmed that SEC staff has been meeting with various spot [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-15T02:57:24.000Z",
    "title": "Bitcoin Price Uptrend To Continue? These Could Be The Factors To Watch",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-uptrend-43500/",
    "description": "Bitcoin price is attempting a fresh increase above the $42,200 level. BTC could surge once it clears the $43,350 resistance zone in the near term. Bitcoin started a fresh increase above the $42,000 support zone. The price is trading above $42,200 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $42,400 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to move up if there is a clear move above the $43,350 resistance. Bitcoin Price Aims Higher Bitcoin price started a decent increase above the $41,500 level. BTC was able to clear the $42,000 resistance zone to enter a positive zone. The bulls were able to push the price above the $43,000 zone. However, the price seems to be struggling near the $43,350 zone. A high was formed near $43,421 and the price is now consolidating gains. There was a sharp downside correction below the $42,500 level. The price even spiked below the 50% Fib retracement level of the upward move from the $40,606 swing low to the $43,421 high. However, the bulls were active near the $41,500 zone. They protected the 61.8% Fib retracement level of the upward move from the $40,606 swing low to the $43,421 high. Bitcoin is now trading above $42,200 and the 100 hourly Simple moving average. Besides, there is a key bullish trend line forming with support near $42,400 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $43,300 level. Source: BTCUSD on TradingView.com The first major resistance is forming near $43,350. A close above the $43,350 resistance might start a steady increase. The next key resistance could be near $44,200, above which BTC could rise toward the $45,000 level. A clear move above the $45,000 level could set the pace for a test of $46,500. Another Drop In BTC? If Bitcoin fails to rise above the $43,350 resistance zone, it could start another decline. Immediate support on the downside is near the $42,400 level and the trend line. The next major support is near $42,000 and the 100 hourly Simple moving average, below which the price might test the $41,500 zone. If there is a move below $41,500, there is a risk of more losses. In the stated case, the price could drop toward the $40,600 support in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $42,400, followed by $42,000. Major Resistance Levels – $43,350, $44,200, and $45,000."
  }
]