[
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T14:23:00.000Z",
    "title": "Can Bitcoin repeat a 2017-like rally as dollar correlation reverses?  ",
    "url": "https://cointelegraph.com/news/bitcoin-price-2017-like-rally-again-dollar",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/ae9f2d80-087f-4708-839a-1c33c3b76b6c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Dollar Index disconnect from Bitcoin does not necessarily mean that BTC price is about to experience a big rally, historic data suggests.  </p>\n                    <p><p>There is a common belief that when the U.S. dollar declines relative to other main global currencies, as measured by the Dollar Strength Index (DXY), the impact on Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is positive, and vice versa.</p><p>For instance, the DXY index dropped from 103.0 on Jan. 2017 to a 92.6 low on Aug. 2017, while Bitcoin rallied from $1,000 to $4,930 in the same period. But is there enough evidence to justify a bull run similar to 2016–17, as some analysts are arguing?</p><p>But is there enough evidence to justify a bull run similar to 2016–2017, as some analysts are arguing?</p><h2>Is the Bitcoin-dollar inverse trend real?</h2><p>Traders and influencers frequently warn about this negative correlation and how a reversal of DXY will likely push the Bitcoin price higher. </p><p>Investment research @GameofTrades_ recently posted a chart presenting the pattern in early 2023 and then repeating itself later in May. There’s some indisputable evidence of the inverse correlation there.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Bitcoin and DXY have maintained a negative correlation year-to-date in 2023 <a href=\"https://t.co/VTePX3PNs6\">pic.twitter.com/VTePX3PNs6</a></p>&mdash; Game of Trades (@GameofTrades_) <a href=\"https://twitter.com/GameofTrades_/status/1671880720095035393?ref_src=twsrc%5Etfw\">June 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Moreover, technical analyst el_crypto_prof presents a bearish \"Gaussian Channel\" change on the DXY chart, which, according to the analysis, matched two previous bull runs for Bitcoin and altcoins in 2016–17 and 2020–21.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> <br><br>The DXY (US Dollar Index) has changed the color from green to red on the Gaussian Channel. <br><br>The last two times this happened, <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> and Altcoins experienced a bullrun (parabola) in the following months (2016-2017 and 2020-2021).<br><br>Sounds exciting, doesn&#39;t it? <a href=\"https://t.co/kHJeM6iZDH\">pic.twitter.com/kHJeM6iZDH</a></p>&mdash; ⓗ  (@el_crypto_prof) <a href=\"https://twitter.com/el_crypto_prof/status/1673260405962022913?ref_src=twsrc%5Etfw\">June 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>BTC-DXY correlation varies with time</h2><p>The seemingly inverse relationship between Bitcoin and DXY have never lasted more than 7 weeks. The correlation indicator runs from -100%, indicating that certain markets move in opposite ways, to 100%, indicating that the movement is in lockstep; 0 represents a total lack of correlation between the two assets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/0c7f58d4-7ed9-43f6-bef8-1fc277b51b7e.png\"  /><figcaption style=\"text-align: center;\"><em>Dollar Index DXY 20-day correlation versus Bitcoin. Source: TradingView</em></figcaption></figure><p>The metric has been negative for 81% of the past 670 days, indicating that DXY and Bitcoin have generally followed an inverse trend. Still, that’s not how the correlation metric works, because readings between 0% and -50% denote a lack of correlation.</p><p>In fact, the longest-ever period of a correlation lower than -50% has been the 47 days starting on Aug. 18, 2022. Therefore, saying that Bitcoin has an inverse correlation to the DXY index would be statistically incoherent since it was -50% or lower for less than a third of the days since September 2021.</p><p>Between June 2021 and November 2021, the DXY and BTC price presented a very similar pattern as both rallied during that five-month period. </p><p>Events solely relevant to the cryptocurrency might have distorted the metric, however, such as the<a href=\"https://cointelegraph.com/news/proshares-bitcoin-linked-etf-launches-on-nyse-as-btc-price-dips-above-63k\"> first U.S. Bitcoin futures exchange-traded fund</a> launch on October 19, 2021.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/98fa0ef4-b651-440a-baa8-5b24cec74f31.png\"  /><figcaption style=\"text-align: center;\"><em>Dollar Index DXY (orange, left) vs. Bitcoin (blue), 2021. Source: TradingView</em></figcaption></figure><p>But regardless of the rationale behind the move, correlation is not causation, meaning it is impossible to conclude that DXY’s positive performance affected Bitcoin price during the period.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/black-rock-etf-bitcoin-price\">Will BlackRock’s ETF slingshot Bitcoin’s price skyward?</a></em></strong></p><h2>Longer-term analysis still required for DXY</h2><p>Even though analysts and market influencers frequently use 20-day correlation data to explain daily price fluctuations, a longer time frame is required to comprehend any potential, if any, effects of DXY on Bitcoin's price. </p><p>For instance, when <a href=\"https://cointelegraph.com/news/how-does-the-fed-impact-crypto-find-out-on-the-market-report\">the U.S. Federal Reserve</a> injects trillion-dollar stimulus packages into the economy, odds are the impact on inflation and global currency flows will take a couple of weeks. After all, not every family, business, and financial institution will put the money in circulation right away.</p><p>But the price signals on the Bitcoin market are more immediate as coins are traded 24/7. So the price movements are extremely susceptible to news, macroeconomic data, and geopolitical events, with reverberating effects for weeks and even months. </p><p>A perfect example can be demonstrated by Bitcoin’s 38% loss in nine days on June 8, 2022.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/a22b963d-3940-4ef8-b626-caca1b2b6790.png\"  /><figcaption style=\"text-align: center;\"><em>Dollar Index DXY (orange, left) vs. Bitcoin (blue), 2022. Source: TradingView</em></figcaption></figure><p>Notice how it took almost 4 months for the DXY index to move from 102.50 to the 114.2 peak by late Sept. 2022, even though Bitcoin had already bottomed at $18,900 long before that.</p><h2>DXY a poor proxy for BTC price</h2><p>In other words, those betting on the DXY index reversal preceding a BTC price rally have no statistical support given that the correlation varies over time. </p><p>Moreover, even when the inverse correlation happens, there may be a gap between Bitcoin's immediate price action and the longer term trends of the Dollar Strength Index. </p><p>Whenever favorable (or unfavorable) developments in the cryptocurrency industry occur, the historical correlation becomes irrelevant. That might have been the case impacting the recent Bitcoin gains, which can't be directly attributed to the supposed \"Gaussian Channel\" reversion on the DXY chart.</p><p>Ultimately, cherry-picking two or three instances of DXY index inverse correlation happening while a cryptocurrency bull run occurred in the past is not enough to call a bull run similar to 2016–17, considering the multiple instances of positive correlation and gaps between both assets' price action.</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-05T14:15:00.000Z",
    "title": "Bet To The Future, How Scorpion is Joining Fun Token and Stake.com in Conquering The 21st Century!",
    "url": "https://cryptodaily.co.uk/2023/07/bet-to-the-future-how-scorpion-is-joining-fun-token-and-stakecom-in-conquering-the-21st-century",
    "description": "<p>Great Scott! Just as crypto itself is constantly evolving, so is its close relative, the world of online crypto gambling! Despite the huge success that many platforms within the market have already experienced, this hybrid industry is still young and growing in prominence, meaning right now is an important time to pay attention to all the progress it's making.&nbsp;</p>\n<p>A good way to track this is by taking a look at the future long-term plans of some of the best platforms around, such as Scorpion Casino (SCORP), Fun Token (FUN) and Stake.com. Scorpion is especially worth paying attention to at the moment - read more to find out why.</p>\nScorpion Aims To Change The Game!\n<p>Scorpion Casino is currently in the midst of a widely successful presale, which will end with the launch of its native Scorpion Token (SCORP). SCORP will be a deflationary token that improves alongside the platform through automatic burns every single time a user makes a transaction and every single time the casino generates profit.&nbsp;</p>\n<p>The success of the upcoming token is important due to the position it holds as the asset that empowers the platform&rsquo;s ecosystem and its total 370 licensed games (210 casino games and 160 live games) as well as all the sports betting opportunities for popular sports such as American Basketball and International Football. The token will join a short but solid list of top cryptos users can bet with, including the biggest crypto of all time, Bitcoin (BTC).</p>\nHave All The FUN You Want With The Token\n<p>As suggested by its name, Fun Token is a platform focused on becoming the home of all the fun users can have online when it comes to crypto gaming. The platform prides itself on being a diverse place that offers fairness and transparency to all of its player base, meaning that everyone can bet and play amongst each other using the assets in their wallets without any worries of being taken advantage of or worse.&nbsp;</p>\n<p>Some of the latest developments being made in the world of Fun token are about accessibility. The project has partnered with Now Payments that has made for users to pay with FUN easier than before and the integration with ChangeNOW DEX, ensures faster and more secure FUN token swaps.&nbsp;</p>\n<p></p>\nStake.com Builds An Empire\n<p>Stake.com is an online sportsbook and casino that debuted in 2017 and shot to fame right away. They quickly rose to the position of becoming one of the world's largest online casinos, thanks to its numerous sponsorship agreements. The success of Stake.com is proof that the merger of crypto and betting will become a telling tale in the near future!</p>\n<p>According to rumours, Rush Street Interactive may be on Stake.com's list of prospective targets as it seeks acquisitions that could provide it access to the US iGaming market. The platform wants to expand into more regulated gambling areas in the US and abroad. Furthermore, Stake is also aiming to obtain a licence in Australia's regulated online gambling industry. It also has an application for iGaming in Ontario, Canada, that it is currently waiting to hear back from. Considering the fact that Stake is based out of Cura&ccedil;ao and already has offices all over the world, global domination is clearly on its agenda!</p>\n<p></p>\nHow Scorpion Claws its Way To The Top\n<p>One of the platform's primary focuses is its community, ensuring that all its users have an enjoyable and lucrative experience on the platform to make sure they keep coming back for more. Users can create a passive income avenue on the platform, potentially earning up to $10,000 per day by betting with SCORP, thanks to its integrated distribution. On top of that, users can earn rewards of $1000 upwards if they take part in other platform features, such as signing up for the VIP Members Club and much more. There&rsquo;s even more about the platform that could establish it as the go-to place once the presale is over, but for now, when it comes to earning opportunities - it's unmatched!</p>\nFor more information on Scorpion Casino (SCORP):\n<p>Website: https://presale.scorpion.casino/&nbsp;</p>\n<p>Instagram: https://www.instagram.com/scorpion.casino/&nbsp;</p>\n<p>Twitter: https://twitter.com/ScorpionCasino&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T14:16:34.000Z",
    "title": "Adventure Gold Price Prediction 2023-2032: Is AGLD a Buy or Sell?",
    "url": "https://www.cryptopolitan.com/adventure-gold-price-prediction/",
    "description": "Adventure Gold Price Prediction 2023-2031 What&#8217;s the price status of AGLD? An expert tweeted that it could be the &#8220;Bearish Abandoned Baby&#8220;, or a pattern that is a bearish reversal candlestick formation that appears in an uptrend and signals a potential trend reversal. This pattern is characterized by a gap up, followed by a Doji ... <a title=\"Adventure Gold Price Prediction 2023-2032: Is AGLD a Buy or Sell?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/adventure-gold-price-prediction/\" aria-label=\"More on Adventure Gold Price Prediction 2023-2032: Is AGLD a Buy or Sell?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T14:10:25.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-05T14:17:05.000Z",
    "title": "Legal specialist gives new insight on Ripple (XRP) lawsuit",
    "url": "https://crypto.news/legal-specialist-gives-new-insight-on-ripple-xrp-lawsuit/",
    "description": "Responding to a recent piece of writing regarding a legal matter concerning cryptocurrency securities brought against Ripple Labs Inc. and the establishment of a group of investors, lawyer Fred Rispoli provided commentary that all could not be gold for Ripple. "
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-05T14:30:00.000Z",
    "title": "Crypto Markets Plunge to Lowest Quarterly Volume Since 2020: Report",
    "url": "https://coinedition.com/crypto-markets-plunge-to-lowest-quarterly-volume-since-2020-report/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Crypto Markets Plunge to Lowest Quarterly Volume Since 2020: Report\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-2-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a data-driven update, crypto market data provider Kaiko unveiled that the crypto markets plunged to the lowest trade volume in a quarter since 2020. However, despite the downward trend in trade volumes, the quarter ended positively for the crypto industry. Kaiko&#8217;s findings shed light on various key aspects impacting the market. One area of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-markets-plunge-to-lowest-quarterly-volume-since-2020-report/\">Crypto Markets Plunge to Lowest Quarterly Volume Since 2020: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-05T14:30:37.000Z",
    "title": "Cameron Winklevoss Gives ‘Final Warning’ to Barry Silbert and Digital Currency Group After Alleged Debt Delinquency",
    "url": "https://dailyhodl.com/2023/07/05/cameron-winklevoss-gives-final-warning-to-barry-silbert-and-digital-currency-group-after-alleged-debt-delinquency/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/gemini-hit-lawsuit.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/gemini-hit-lawsuit.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/gemini-hit-lawsuit.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/gemini-hit-lawsuit.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/gemini-hit-lawsuit.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/gemini-hit-lawsuit.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/gemini-hit-lawsuit.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Cameron Winklevoss, the co-founder of US-based exchange giant Gemini, has issued his &#8220;best and final offer&#8221; to Digital Currency Group (DCG) CEO Barry Silbert. DCG is the parent company of the bankrupt crypto lender Genesis. Cameron Winklevoss and his twin brother Tyler Winklevoss have been in a public social media spat with Silbert for months [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/05/cameron-winklevoss-gives-final-warning-to-barry-silbert-and-digital-currency-group-after-alleged-debt-delinquency/\">Cameron Winklevoss Gives ‘Final Warning’ to Barry Silbert and Digital Currency Group After Alleged Debt Delinquency</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]