[
  {
    "source": "Decrypt",
    "date": "2024-02-06T01:35:48.000Z",
    "title": "Ownership Doesn’t Need Blockchain or NFTs, Entertainment Execs Say",
    "url": "https://decrypt.co/215930/ownership-doesnt-need-blockchain-or-nfts-entertainment-execs-say",
    "description": "At SEG3 Los Angeles, gaming leaders agree on the importance of ownership, but are split on the role of decentralized ledgers."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-06T01:33:53.000Z",
    "title": " Roblox builds in-house LLM, adds real-time AI translation to metaverse ",
    "url": "https://cointelegraph.com/news/roblox-ai-translation-llm-metaverse-languages",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNjQ2ZDUwODYtY2ZmOC00OGU3LTg4MjUtYzE1MzllMjRmYmIwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The AI-powered translator currently supports 16 languages, allowing users to converse seamlessly while typing in their native language. </p>\n                    <p><p>Online gaming platform Roblox has developed a new AI-powered “unified translation model” — allowing players to converse with one another through text in real time, despite speaking different languages. </p><p>According to a Feb. 5 <a href=\"https://blog.roblox.com/2024/02/breaking-down-language-barriers-with-a-multilingual-translation-model/\" target=\"_blank\" rel=\"noopener nofollow\">statement</a> by Roblox chief technology officer Dan Sturman, the new system required the firm to build its own in-house LLM to be able to translate text-based messages at a base latency of 100 milliseconds — making conversations feel instantaneous for users.</p><p>“Imagine discovering that your new Roblox friend, a person you’ve been chatting and joking with in a new experience, is actually in Korea — and has been typing in Korean the entire time, while you’ve been typing in English, without either of you noticing,” said Sturman. </p><p><a href=\"https://cointelegraph.com/news/roblox-ai-translation-llm-metaverse-languages\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-06T01:32:00.000Z",
    "title": "Crypto Analyst Predicts Cardano ($ADA) Price Could Soon Surge to $8",
    "url": "https://www.cryptoglobe.com/latest/2024/02/crypto-analyst-predicts-cardano-ada-price-could-soon-surge-to-8/",
    "description": "A popular cryptocurrency analyst has recently noted that the price of the native token of smart contract platform Cardano, $ADA, has been in a pattern that mirror its price behavior of late 2020, before the cryptocurrency entered a bull run that saw its price move to a $3 high. In a post shared on the […]\n"
  }
]