[
  {
    "source": "Decrypt",
    "date": "2023-09-18T10:53:51.000Z",
    "title": "Elizabeth Warren's Digital Asset Anti-Money Laundering Act Gets Nine New Sponsors",
    "url": "https://decrypt.co/197565/elizabeth-warrens-digital-asset-anti-money-laundering-act-gets-nine-new-sponsors",
    "description": "Warren's controversial Digital Asset Anti-Money Laundering Act has received support from nine more U.S. senators."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-18T11:00:02.000Z",
    "title": "Binance Charity, CZ defend $3 million crypto donation amid critique after Morocco earthquake",
    "url": "https://cryptoslate.com/binance-charity-cz-defend-3-million-crypto-donation-amid-critique-after-morocco-earthquake/",
    "description": "<p>The controversial donation of $3 million in Binance Coin (BNB) by Binance Charity to victims of the recent earthquake in Morocco has sparked a debate about the role of cryptocurrencies in humanitarian aid. As reported by the Financial Times, some critics have labeled it a PR stunt, arguing that victims of such disasters need immediate essentials [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-charity-cz-defend-3-million-crypto-donation-amid-critique-after-morocco-earthquake/\">Binance Charity, CZ defend $3 million crypto donation amid critique after Morocco earthquake</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-18T11:00:06.000Z",
    "title": "Introducing Presearch: The Decentralized Search Engine",
    "url": "https://news.bitcoin.com/introducing-presearch-the-decentralized-search-engine/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230917_203200_139-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230917_203200_139-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230917_203200_139-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230917_203200_139-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230917_203200_139-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230917_203200_139-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230917_203200_139-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230917_203200_139.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. La Jolla, California &#8211; September 18th, 2023 – Presearch is a revolutionary platform that is changing the way people search the internet. Presearch is a decentralized search engine designed to empower users, respect their privacy, and provide a better search experience. It is powered by almost 70,000 user computers (nodes) in more than [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T10:53:50.000Z",
    "title": "Worldcoin Price Prediction 2023 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, ... <a title=\"Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldcoin-price-prediction/\" aria-label=\"More on Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T10:50:42.000Z",
    "title": "Artificial Intelligence Essential for Global Progress on UN SDGs, President Kagame Affirms",
    "url": "https://www.cryptopolitan.com/artificial-intelligence-un-sdgs-kagame/",
    "description": "President Paul Kagame has underscored the significance of artificial intelligence (AI) in propelling advancements toward achieving the 17 Sustainable Development Goals (SDGs) outlined by the United Nations. Kagame delivered this crucial message during his address at the United Nations Digital Day event in New York, an event organized by the International Telecommunication Union (ITU) and ... <a title=\"Artificial Intelligence Essential for Global Progress on UN SDGs, President Kagame Affirms\" class=\"read-more\" href=\"https://www.cryptopolitan.com/artificial-intelligence-un-sdgs-kagame/\" aria-label=\"More on Artificial Intelligence Essential for Global Progress on UN SDGs, President Kagame Affirms\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T11:00:36.000Z",
    "title": "PUBG developer Krafton teases metaverse video game Overdare",
    "url": "https://crypto.news/pubg-developer-krafton-teases-metaverse-video-game-overdare/",
    "description": "Krafton&#8217;s Roblox-like video game is said to rely on generative artificial intelligence and be based on the game engine Unreal Engine 5. South Korea&#8217;s game developer Krafton, best known for its global mega-hit PlayerUnknown&#8217;s Battlegrounds (PUBG), is set to compete&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-18T11:00:06.000Z",
    "title": "Was The SEC In Bed With Ethereum? ETH Gate Explained",
    "url": "https://www.newsbtc.com/news/sec-in-bed-with-ethereum-eth-gate-explained/",
    "description": "Conspiracy theory or one of the biggest scandals in crypto? The term &#8220;ETH Gate&#8221; has been on the lips of every XRP supporter in recent months and, increasingly, the broader cryptocurrency community. At the heart of this issue is the US Securities and Exchange Commission&#8217;s (SEC) decision to classify Ethereum (ETH) as a non-security, contrasting sharply with its ongoing legal action against Ripple and the XRP token. What is ETH Gate &#8220;ETH Gate&#8221; refers to a theory alleging that the Ethereum Foundation and ConsenSys have fostered close relationships with key individuals within the US Securities and Exchange Commission (SEC) and other entities like JP Morgan, thereby ensuring a favorable regulatory environment for Ethereum. One cornerstone of this theory are the Hinman emails which were released earlier this year. In these emails, Hinman, who made the landmark speech in 2018 declaring that Ethereum was not a security, interacted with Ethereum&#8217;s co-founder, Vitalik Buterin right before the speech. Hinman reportedly consulted Buterin to &#8220;understand the operational dynamics of Ethereum.&#8221; Related Reading: Ethereum Merge Is One: Here Are The Highlights So Far Remarkably, Bill Hinman rejoined the law firm Simpson Thacher in 2020 after leaving the SEC. The significance? Simpson Thacher is associated with the Ethereum Enterprise Alliance. Therefore, the XRP army believes that Hinman&#8217;s decision to deliver a speech giving Ethereum a regulatory &#8220;free pass&#8221; may not have been impartial. Speculations By XRP Army John E Deaton, an outspoken figure in the XRP community and a keen observer of the SEC&#8217;s dealings, has painstakingly put forth allegations suggesting a deeper web of interlinked relationships that hint at possible conflicts of interest. (There are so many that it is not even possible to highlight them all in one article.) His assertions have become pivotal in the &#8220;ETH Gate&#8221; theory, and here we&#8217;ll delve deeper into these connections. 1. Joseph Lubin&#8217;s Strategic Moves: Joseph Lubin, co-founder of Ethereum and founder of ConsenSys, is at the core of Deaton&#8217;s claims. According to Deaton, within just two months of Jay Clayton&#8217;s appointment as the SEC Chairman, Lubin made a potentially strategic hire, bringing on board Patrick Berarducci from the law firm Sullivan &#38; Cromwell. This move is seen by Deaton and many in the XRP community as more than coincidental. Deaton has drawn attention to this connection in the past, positing that it might have provided Ethereum an inside track or at least a more favorable disposition from the SEC. Sullivan &#38; Cromwell is also notable because Jay Clayton himself was a partner there before his stint as the SEC Chairman. 2. The Hinman-Lubin Email Exchange: Deaton frequently refers to the now-infamous email exchange between Bill Hinman and Joseph Lubin. For Deaton, this correspondence underscores a problematic level of proximity between a regulatory figure and a significant player in the crypto sphere. The fact that Hinman reportedly emailed Lubin directly is seen by Deaton as a potential sign of collaboration or at least a peculiar level of familiarity. More so, given Hinman&#8217;s subsequent public remarks about Ethereum being a non-security, despite warnings against such pronouncements from the SEC&#8217;s Office of General Counsel. 3. Jay Clayton and One River Digital Asset Management: After his tenure at the SEC, Jay Clayton joined One River Digital Asset Management. Deaton emphasizes this move as a point of contention. One River is known for its large holdings of Bitcoin and Ethereum. Deaton hints at a potential conflict of interest, questioning if Clayton&#8217;s decisions during his time at the SEC may have been influenced by future career prospects or associations that favored Ethereum. 4. Simpson Thacher, Ethereum Enterprise Alliance, and Hinman: One of the most significant points of contention brought forth by Deaton involves Bill Hinman&#8217;s associations with the law firm Simpson Thacher. This firm played a role in the Ethereum Enterprise Alliance. Deaton suggests that Hinman&#8217;s connection to Simpson Thacher and, by extension, the Ethereum Enterprise Alliance, could have influenced his decision to publicly declare Ethereum a non-security. Related Reading: Bitcoin Dominates Ethereum In Daily Active Addresses Despite Lagging In TX Count Similarly, an XRP community member known as Mr. Huber has been extremely vocal and is raising compelling questions: &#8220;ETH Gate is a conspiracy theory that the SEC tried to create a monopoly for Ethereum?&#8221; He goes on to argue that this is a concerted attempt by powerful Wall Street banks like JPMorgan to &#8220;control the global crypto market by bribing the SEC to gain a monopoly for Ethereum.&#8221; Latest News On ETH Gate Yesterday, John E Deaton indicated that new, potentially damning, information about ETH Gate might soon be disclosed. &#8220;I’ve always said that one day we will get the full truth. Today is one day closer,” Deaton tweeted in response to Steven Nerayoff’s lawyer, Michael Scotto, who indicated that Nerayoff is prepared to make his facts known &#8220;at a time and manner that serves the interests of justice and the people.&#8221; Steven Nerayoff, an early adviser to Ethereum, had extortion charges against him dismissed in May this year. Deaton speculates that Nerayoff could be a significant source of insider information, possibly related to Ethereum&#8217;s regulatory free pass. &#8220;I have the map,” was Nerayoff unequivocal response to Deaton&#8217;s speculative tweets about the matter, as Bitcoinist reported today. The &#8220;ETH Gate&#8221; controversy calls into question the impartiality of the SEC in its treatment of different cryptocurrencies. Although allegations remain unproven, the gathered evidence paints a picture of inconsistent regulatory approaches and potential conflicts of interest. Whether these allegations hold any water remains to be seen, but they have certainly fueled a sense of urgency and scrutiny around the SEC&#8217;s policies. If the hints dropped by Steven Nerayoff and John E Deaton materialize into something substantive, ETH Gate could become a pivotal chapter in the annals of cryptocurrency regulation. At press time, ETH traded at $1,635. Featured image from Blockchain Association &#38; Commerce Society, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T11:00:58.000Z",
    "title": "In a Sea of Uncertainty, Pomerdoge (POMD) Emerges as the Lighthouse for Litecoin (LTC) and Ethereum (ETH) Holders",
    "url": "https://www.crypto-news-flash.com/in-a-sea-of-uncertainty-pomerdoge-pomd-emerges-as-the-lighthouse-for-litecoin-ltc-and-ethereum-eth-holders/?utm_source=rss&utm_medium=rss&utm_campaign=in-a-sea-of-uncertainty-pomerdoge-pomd-emerges-as-the-lighthouse-for-litecoin-ltc-and-ethereum-eth-holders",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-99.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-99.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-99-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-99-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the unpredictable world of cryptocurrency, Pomerdoge (POMD) has surfaced as a beacon of hope for those holding Litecoin (LTC) and Ethereum (ETH). Amid the turbulent waves of market volatility, Pomerdoge&#8217;s presale of discounted tokens offers untapped potential for holders of these two leading cryptocurrencies. Let&#8217;s learn more. Click Here To Find Out More About [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-18T11:01:47.000Z",
    "title": "Crypto Expert Panos Offers Crypto As Substitute To Banks",
    "url": "https://coinedition.com/crypto-expert-panos-offers-crypto-as-substitute-to-banks/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/BANK-8.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/BANK-8.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/BANK-8-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/BANK-8-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/BANK-8-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/BANK-8-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/BANK-8-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/BANK-8-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/BANK-8-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/BANK-8-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/BANK-8-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/BANK-8-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/BANK-8-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/BANK-8-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/BANK-8-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/BANK-8-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/BANK-8-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>On the afternoon of September 17, Anodos Finance founder Panos tweeted about the significance of blockchain-based financial services. According to the founder, banks and monetary establishments staying closed on the weekends pose major challenges for individuals and businesses, including an unmonitored window to manipulate markets, “making it impossible to conduct many financial transactions during this [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-expert-panos-offers-crypto-as-substitute-to-banks/\">Crypto Expert Panos Offers Crypto As Substitute To Banks</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-18T10:43:40.000Z",
    "title": "Sealed Documents in the SEC vs. Binance Unredacts: Court Orders",
    "url": "https://coinedition.com/sealed-documents-in-the-sec-vs-binance-unredacts-court-orders/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/The_way_Binance_and_CZ_handled_this_hack_should_be_‘standard_Transparent-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/The_way_Binance_and_CZ_handled_this_hack_should_be_‘standard_Transparent-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/The_way_Binance_and_CZ_handled_this_hack_should_be_‘standard_Transparent-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/The_way_Binance_and_CZ_handled_this_hack_should_be_‘standard_Transparent-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/The_way_Binance_and_CZ_handled_this_hack_should_be_‘standard_Transparent-3-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/The_way_Binance_and_CZ_handled_this_hack_should_be_‘standard_Transparent-3-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/The_way_Binance_and_CZ_handled_this_hack_should_be_‘standard_Transparent-3-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In an astonishing turn of events in the SEC-Binance legal tussle, Columbia District Court Magistrate Judge Zia Faruqui has recently approved the Securities and Exchange Commission’s (SEC) motion to unveil the documents related to the lawsuit, facilitating public access. According to the court filing, the documents that were sealed as per the demand of the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sealed-documents-in-the-sec-vs-binance-unredacts-court-orders/\">Sealed Documents in the SEC vs. Binance Unredacts: Court Orders</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]