[
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T08:07:28.000Z",
    "title": "Paraluni Crypto Protocol Suffers $336,000 Loss in Price Manipulation Attack",
    "url": "https://www.cryptopolitan.com/paraluni-suffers-price-manipulation-attack/",
    "description": "Paraluni, a well-known crypto protocol, has become the latest victim of a sophisticated price manipulation attack. The incident, uncovered by Beosin, a blockchain security monitoring firm, resulted in a significant financial loss of approximately $336,000.&#160; The attack highlights the ongoing security challenges and vulnerabilities faced by digital asset platforms in an increasingly complex and evolving [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T08:06:54.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T07:59:49.000Z",
    "title": "South Korean Game Publisher Wemade Launches $100 Million Blockchain Investment Fund",
    "url": "https://www.cryptopolitan.com/wemade-100-mil-blockchain-investment-fund/",
    "description": "South Korean game publisher Wemade, in partnership with Singapore-based investment firm Whampoa Digital, has announced the launch of a $100 million Web3 fund. The initiative marks a significant step for Wemade, a company adapting to the restrictive anti-blockchain gaming regulations in its home country by targeting international markets. The newly established Wemade Web3 Fund is [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T07:51:10.000Z",
    "title": "OpenAI gears up for $100 billion boost in massive funding round",
    "url": "https://www.cryptopolitan.com/openai-gears-up-for-100-billion-boost/",
    "description": "OpenAI, the renowned artificial intelligence (AI) developer, is reportedly in discussions with potential investors considering injecting more than $100 billion into the company. This development comes amidst a significant surge in funding within the AI industry, with sources familiar with the matter revealing preliminary discussions between OpenAI and interested investors. Surge in AI industry funding [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T07:43:55.000Z",
    "title": "The Academy of Digital Industries and Tether Invest in the Future of Digital Education",
    "url": "https://www.cryptopolitan.com/tether-education-academy-digital-industries/",
    "description": "Tether Operations Limited (Tether), the company behind the first and most widely used stablecoin, USDt, has announced a strategic investment into the Academy of Digital Industries.&#160; The investment, made during the Series-A funding round of the Georgia-based education platform, marks a new chapter in Tether&#8217;s commitment to advancing digital knowledge and skills. The academy of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-23T08:03:25.000Z",
    "title": "Optimism Price Up By 34% Today – But Investors Should Watch Out For This Sell Signal",
    "url": "https://www.newsbtc.com/optimism-2/optimism-price-up-by-34-today-but-investors-should-watch-out-for-this-sell-signal/",
    "description": "Optimism price has been witnessing significant momentum over the past few days, becoming one of the top gainers in the market today. Thanks to this recent price growth, Optimism has seen its native token OP lay a serious claim to a place within the top 30 cryptocurrencies by market capitalization. However, it seems that the Optimism price movement may soon be turning bearish following the appearance of a sell signal on the price chart.  Indicator That Preceded 80% Rally Turns Bearish, Analyst Says In a recent post on the X platform, crypto analyst Ali Martinez sounded the sell alarm for the OP token. According to the popular crypto pundit, the Optimism price might be in the best range for investors to cash in on their profits. The reasoning behind this forecast revolves around the TD (Tom DeMark) sequential indicator. Based on Martinez’s analysis, the indicator is currently flashing a sell signal on Optimism’s 12-hour price chart. Related Reading: Solana Saga Orders Scrapped As $30 Million BONK Token Package Overshadows Device’s Value The crypto analyst highlighted that a buy signal from the TD sequential indicator preceded a substantial surge in Optimism price earlier in December. And this adds even more weight to the possibility of a bearish turnaround following a sell alarm from the indicator. Martinez advised investors to think about taking profits right away, given that the OP price may decline and mirror the size of the initial bullish upswing. This projection comes during an exhilarating positive run for OP, putting the altcoin’s bullish trajectory in jeopardy.  Optimism Price And Network Growth As of this writing, the Optimism price stands at $3.37, reflecting an almost 34% price increase in the past 24 hours. According to data from CoinGecko, the value of the cryptocurrency has soared by more than 55% in the past week. The OP coin looks set to end the year as one of the 30 largest cryptocurrencies in the sector, with its market cap recently surpassing $3 billion. This positive performance of the token &#8211; in such a short time span &#8211; only underscores the increased rate of network growth. Related Reading: Will Inscriptions On Polkadot Push DOT Prices Back Above $10? According to recent data from IntoTheBlock, the Optimism network boasts more than 5.9 million addresses with a balance. This represents a nearly 400% surge from 1.2 million in January 2023. Growth of this caliber and magnitude suggests increased confidence, adoption, and usage of the Optimism network. And if this positive trend is anything to go by, there is a chance the Optimism price won&#8217;t be down for long &#8211; if the current bearish projection does come true. Optimism price experiences sharp pullback at $3.5 on the daily timeframe &#124; Source: OPUSDT charton TradingView Featured image from iStock, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-23T08:04:58.000Z",
    "title": "Ethereum, Shiba Inu and One Altcoin That’s Exploded Over 250% in Two Months Flashing Bullish Signals: Santiment",
    "url": "https://dailyhodl.com/2023/12/23/ethereum-shiba-inu-and-one-altcoin-thats-exploded-over-250-in-two-months-flashing-bullish-signals-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/Ethereum-Shiba-Inu-and.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/Ethereum-Shiba-Inu-and.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/12/Ethereum-Shiba-Inu-and.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/Ethereum-Shiba-Inu-and.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/Ethereum-Shiba-Inu-and.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/Ethereum-Shiba-Inu-and.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/12/Ethereum-Shiba-Inu-and.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Cryptocurrency analytics platform Santiment is naming three digital assets that it says possess long-term bullish prospects. Santiment says that Ethereum (ETH), Shiba Inu (SHIB) and the artificial intelligence-focused crypto project Fetch.ai (FET) are witnessing a reduction of the supply held on exchanges by their top 10 holders. According to Santiment, the moving of the three [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/23/ethereum-shiba-inu-and-one-altcoin-thats-exploded-over-250-in-two-months-flashing-bullish-signals-santiment/\">Ethereum, Shiba Inu and One Altcoin That’s Exploded Over 250% in Two Months Flashing Bullish Signals: Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]