[
  {
    "source": "Cointelegraph",
    "date": "2023-12-18T05:44:26.000Z",
    "title": " FTX loses $53K every hour on &#039;bankruptcy fees&#039; — latest filings show ",
    "url": "https://cointelegraph.com/news/ftx-bankruptcy-loses-53k-every-hour-lawyer-fees",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYjllYWExOWItYjUyZS00YzA3LTk1YzEtNGUzOTI1NzY3NmJlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>More than $118 million in legal and advisory fees were billed to the bankrupt crypto exchange between August and October or $1.3 million per day.</p>\n                    <p><p>Crypto exchange FTX has been burning through approximately $53,000 every hour over the three months ending Oct. 31 — just on bankruptcy lawyers and advisers, the latest round of compensation filings show. </p><p>Court <a href=\"https://restructuring.ra.kroll.com/FTX/Home-DocketInfo\" target=\"_blank\" rel=\"noopener nofollow\">filings</a> from Dec. 5 to Dec. 16 have shown that the bankruptcy lawyers have charged an accumulated total of at least $118.1 million between Aug. 1 and Oct. 31. Over the 92 days, this equates to $1.3 million per day or $53,300 per hour.  </p><p>The largest bill came from the management consulting firm Alvarez and Marshall, which <a href=\"https://restructuring.ra.kroll.com/FTX/Home-DownloadPDF?id1=MjYxMDIzNA==&amp;id2=-1\" target=\"_blank\" rel=\"noopener nofollow\">charged</a> $35.8 million for its services for the three months.</p><p><a href=\"https://cointelegraph.com/news/ftx-bankruptcy-loses-53k-every-hour-lawyer-fees\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T06:09:06.000Z",
    "title": "SenseTime Group Co-Founder’s Death Sparks Stock Plunge Amid Ongoing Challenges",
    "url": "https://www.cryptopolitan.com/sensetime-group-co-founders-death/",
    "description": "SenseTime Group, the Chinese artificial intelligence (AI) firm, witnessed a substantial drop in its stock value following the unexpected death of its co-founder, Tang Xiao&#8217;ou. The company&#8217;s shares plunged by 18 percent, marking its most significant loss in over a year. Tang&#8217;s demise adds to the mounting challenges already faced by SenseTime, including slowing growth [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T05:53:35.000Z",
    "title": "A Year After ChatGPT – Navigating the Murky Waters of AI and OpenAI’s Drama",
    "url": "https://www.cryptopolitan.com/a-year-after-chatgpt-ai-and-openais-drama/",
    "description": "In the wake of the century&#8217;s sole technological revolution—the convergence of mature software interfaces with GPS-enabled smartphone cameras—the world has been eagerly anticipating the arrival of the next groundbreaking innovation. Yet as 3D printing disrupted the ghost gun industry and augmented reality struggled to fulfill its promises, the grand expectations of transformative tech trends have [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-18T05:48:26.000Z",
    "title": "DOT Price (Polkadot) Holds Strong At $6.6, Signs Point To Fresh Rally Ahead",
    "url": "https://www.newsbtc.com/analysis/dot/dot-price-polkadot-holds-strong-6-6/",
    "description": "Polkadot (DOT) is correcting gains from the $7.75 against the US Dollar. The price could start a fresh increase unless there is a close below $6.30. DOT is consolidating gains above the $6.60 support zone against the US Dollar. The price is trading above the $6.65 zone and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support near $6.65 on the 4-hour chart of the DOT/USD pair (data source from Kraken). The pair could start a fresh increase if the bulls protect the $6.65 and $6.30 support levels. Polkadot Price Holds Ground After forming a base above the $5.50 support, DOT price started a decent increase. The price was able to clear the $5.85 and $6.00 resistance levels to move into a positive zone, like Bitcoin and Ethereum. Polkadot even surpassed the $6.65 resistance zone and settled above the 100 simple moving average (4 hours). Finally, the bears appeared near the $7.75 zone. A high was formed near $7.77 and the price is now correcting gains. There was a drop below the $7.20 and $7.00 levels. DOT declined below the 61.8% Fib retracement level of the upward move from the $6.31 swing low to the $7.77 high. However, it is still above the $6.65 zone and the 100 simple moving average (4 hours). There is also a key bullish trend line forming with support near $6.65 on the 4-hour chart of the DOT/USD pair. The trend line is close to the 76.4% Fib retracement level of the upward move from the $6.31 swing low to the $7.77 high. Source: DOTUSD on TradingView.com Immediate resistance is near the $7.05 level. The next major resistance is near $7.20. A successful break above $7.20 could start another strong rally. In the stated case, the price could easily rally toward $7.75 in the near term. The next major resistance is seen near the $8.00 zone. More Losses in DOT? If DOT price fails to start a fresh increase above $7.05, it could continue to move down. The first key support is near the $6.65 level and the trend line. The next major support is near the $6.30 level, below which the price might decline to $5.70. Any more losses may perhaps open the doors for a move toward the $5.00 support zone. Technical Indicators 4-Hours MACD – The MACD for DOT/USD is now gaining momentum in the bearish zone. 4-Hours RSI (Relative Strength Index) – The RSI for DOT/USD is now below the 50 level. Major Support Levels – $6.65, $6.30 and $5.70. Major Resistance Levels – $7.05, $7.20, and $7.75."
  }
]