[
  {
    "source": "Cointelegraph",
    "date": "2024-01-25T19:37:36.000Z",
    "title": " Bitfinex Bitcoin longs rise to $3B — Bullish or bearish?  ",
    "url": "https://cointelegraph.com/news/bitfinex-bitcoin-longs-rise-to-3b-bullish-or-bearish",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNjU3MGU2ZDEtMDk1Mi00MmZiLTk4MGMtY2I2M2U2YjZlZDgzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A startling number of Bitcoin margin longs recently opened at Bitfinex, but their muted impact on BTC price raises suspicion.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) investors have sought explanations for the lack of bullish momentum since the spot Bitcoin exchange-traded fund (ETF) initiated trading on Jan. 12. Multiple factors for the absence of bullish price action have been identified, but none are entirely conclusive. Meanwhile, leveraged long positions using BTC margin at Bitfinex have increased to a staggering $3 billion, prompting speculation that Bitcoin whales are preparing for a bull run.</p><p>Some analysts, including BitMEX founder Arthur Hayes, believe investors previously expected the <a href=\"https://cointelegraph.com/news/bitcoin-price-risks-30k-supercharged-inflation-arthur-hayes\">U.S. Federal Reserve (Fed) to cut interest rates</a> as soon as March, but recent inflationary events have greatly reduced those odds. Hayes thinks that by not renewing its Bank Term Funding Program (BTFP), the Fed will put U.S. regional banks to the test, draining liquidity from risk markets and negatively impacting assets like Bitcoin.</p><p>The longer interest rates remain high, the fewer incentives investors have to exit fixed-income positions. Under this scenario, Hayes predicts that Bitcoin’s price will fall below $35,000 by March–partially explaining the recent bearish momentum. Despite this being a valid hypothesis, it does not explain the resilience of other risk markets such as the SPDR Bloomberg High Yield Bond ETF (JNK), which tracks debt instruments with a riskier profile. Currently, at $95, the JNK ETF is trading 0.5% below its highest level in five months.</p><p><a href=\"https://cointelegraph.com/news/bitfinex-bitcoin-longs-rise-to-3b-bullish-or-bearish\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-25T19:15:12.000Z",
    "title": "UK government treads carefully on digital pound, prioritizing privacy and cash access",
    "url": "https://cryptoslate.com/uk-government-treads-carefully-on-digital-pound-prioritizing-privacy-and-cash-access/",
    "description": "<p>The U.K. government said it is proceeding cautiously with the design phase of its central bank digital currency (CBDC), according to a Jan. 25 response issued to the Treasury Committee. The Government emphasized that no final decision has been reached regarding the digital pound&#8217;s launch, adding that its officials are still exploring the feasibility and [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/uk-government-treads-carefully-on-digital-pound-prioritizing-privacy-and-cash-access/\">UK government treads carefully on digital pound, prioritizing privacy and cash access</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-25T19:30:32.000Z",
    "title": "Swan Bitcoin Unveils Stealth Mining Operations, Eyes 8 EH/s Goal by 2024 Amid Industry Expansion",
    "url": "https://news.bitcoin.com/swan-bitcoin-unveils-stealth-mining-operations-eyes-8-eh-s-goal-by-2024-amid-industry-expansion/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/swan-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Swan Bitcoin Unveils Stealth Mining Operations, Eyes 8 EH/s Goal by 2024 Amid Industry Expansion\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/swan-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/swan-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/swan-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/swan-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/swan-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/swan-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/swan.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Los Angeles-based firm Swan Bitcoin recently revealed its covert bitcoin mining operations, initiated in the summer of 2023. The company shared on Thursday its anticipation of achieving 8 exahash per second (EH/s) by March 2024. Up to this point, Swan&#x2019;s mining subsidiary has successfully mined 750 bitcoin. Swan Mining Breaks Cover, Sets Sights on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T19:36:32.000Z",
    "title": "BlackRock goes into the deep for Bitcoin with a new BTC definition ",
    "url": "https://www.cryptopolitan.com/blackrock-has-a-new-bitcoin-definition/",
    "description": "BlackRock has a new definition for Bitcoin. Known for its conservative approach, BlackRock&#8217;s foray into the volatile and dynamic world of digital assets marks a significant shift in the traditional investment landscape. The company&#8217;s new perspective on Bitcoin not only underscores the growing acceptance of cryptocurrencies but also introduces a novel definition for BTC (Bitcoin) [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T19:12:39.000Z",
    "title": "Coinbase’s Base falls short in 2023 user acquisition compared to blockchain rivals",
    "url": "https://www.cryptopolitan.com/coinbases-base-falls-short-in-2023/",
    "description": "Coinbase’s Base, a layer-2 Ethereum scaling solution, marked its presence in 2023 but did not reach the level of user adoption seen by its contemporaries. Comparative user growth A recent study by Web3 analytics firm Flipside Crypto revealed that Base garnered just under two million users in 2023. This figure is modest compared to the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-25T19:35:13.000Z",
    "title": "Eco acquires stablecoin shopping app Join",
    "url": "https://crypto.news/eco-acquires-stablecoin-shopping-app-join/",
    "description": "With $95 million in funding, Eco plans to deliver on crypto’s promises of mass adoption and reliable decentralized payments inclusive of existing mainstream platforms."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-25T19:30:10.000Z",
    "title": "Bitcoin Top: This Is When Bull Run Will Peak According To Past Pattern",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-top-when-bull-run-peak-past-pattern/",
    "description": "An analyst has explained when the next Bitcoin bull run peak might appear, if the same pattern as in previous cycles repeats this time as well. This Is What Previous Bitcoin Cycles Suggest Regarding Bull Run Top In a new post on X, analyst Ali has discussed about how the last two Bitcoin bull runs line up against each other and what it could mean for the current cycle of the cryptocurrency. Related Reading: Ethereum Is The Biggest Winner In Post-ETF Approval Market: Glassnode To make the comparison, the analyst has cited a chart that shows the price trend in each of the cycles with the cyclical bottoms being the common start-point for all of them. How the current BTC cycle lines up against the last two &#124; Source: @ali_charts on X From the graph, it&#8217;s visible that the peaks of the last two Bitcoin bull runs took shape at roughly the same amount of time since the bottoms of the respective cycles. For the current cycle, the low that followed the FTX collapse in 2022 has been chosen as the bottom. If the current cycle is lined up against these other two starting from this bottom, then it would still have roughly 600 days before it reaches the same point as when the last couple of bull runs hit their tops. &#8220;If Bitcoin mirrors past bull runs (2015-2018 &#38; 2018-2022) from their respective market bottoms, projections suggest the next market peak could land around October 2025,&#8221; says Ali. &#8220;This implies BTC still has 600 days of bullish momentum ahead!&#8221; BTC Has Been At Risk Of Slipping Below A Historical Line Recently While BTC may have a bullish outlook for the long term, its short-term price trend has been painful for investors, as the cryptocurrency has seen a notable drawdown since the spot ETFs found approval from the US SEC. The cryptocurrency had earlier even slipped down towards the $38,500 mark before making some recovery back around the $40,000 level that it&#8217;s still trading around. BTC has made some recovery from its plunge a couple of days back &#124; Source: BTCUSD on TradingView In this latest plunge, Bitcoin came dangerously close to retesting the &#8220;short-term holder realized price,&#8221; a level that has been significant for the asset throughout history. The &#8220;realized price&#8221; is a metric that keeps track of the price at which the average investor in the Bitcoin market acquired their coins. The spot price being above this value naturally implies the average holder in the sector is carrying profits, while it being under the line implies the dominance of losses. Related Reading: When Will Bitcoin Downtrend End? This Signal Could Be One To Watch As Ali has pointed out in another X post, the &#8220;short-term holder&#8221; group will find themselves underwater if the cryptocurrency&#8217;s price slips under the $38,130 level. The trend in the realized price of the short-term holders &#124; Source: @ali_charts on X Short-term holders (STHs) refer to the Bitcoin investors who purchased their coins within the last 155 days. At the moment, their realized price stands at the $38,125 level. Historically, a sustained break below this line has often meant an extended stay for the coin below it. So far, BTC has avoided a retest of this line, but if the current correction continues, it might even slip under it. &#8220;This potential BTC dip might trigger a new wave of panic selling as these holders will seek to minimize losses,&#8221; explains the analyst. Featured image from Shutterstock.com, charts from TradingView.com, Glassnode.com"
  }
]