[
  {
    "source": "Cryptopolitan",
    "date": "2023-07-01T10:05:52.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-01T09:55:20.000Z",
    "title": "Apple becomes first $3 trillion company as stock soars",
    "url": "https://www.cryptopolitan.com/apple-becomes-first-3-trillion-company-as-stock-soars/",
    "description": "In a historic milestone, Apple Inc. has become the first publicly traded company to achieve a market value of $3 trillion. The company&#8217;s shares surged by approximately 2.31% on Friday, reaching a new all-time high and solidifying its position as a global industry leader. This achievement comes after Apple initially touched the $3 trillion mark ... <a title=\"Apple becomes first $3 trillion company as stock soars\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apple-becomes-first-3-trillion-company-as-stock-soars/\" aria-label=\"More on Apple becomes first $3 trillion company as stock soars\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-01T09:56:45.000Z",
    "title": "Bitcoin Cash (BCH) Up 55% Following BlackRock’s ETF Application, EDX Markets Launch",
    "url": "https://www.newsbtc.com/news/bitcoin-cash/bitcoin-cash-bch-up-55-following-blackrocks-etf-application-edx-markets-launch/",
    "description": "Bitcoin Cash (BCH) has experienced a remarkable upswing, with its value soaring by 55% in the past week. This surge can be attributed to two key factors: BlackRock&#8217;s recent application for a Bitcoin spot ETF with the United States Securities and Exchange Commission and the launch of EDX Markets. BlackRock&#8217;s move to seek SEC approval for a Bitcoin spot ETF has sparked a wave of similar applications, generating a bullish sentiment in the cryptocurrency market. This sentiment has had a particularly positive impact on Bitcoin and related projects, including Bitcoin Cash. Nonetheless, the introduction of EDX Markets, a platform catering to institutional investors, appears to be the primary catalyst behind Bitcoin Cash&#8217;s recent price surge. EDX Markets, backed by industry giants Fidelity, Schwab, and Citadel Securities, carries significant weight despite not being registered with the SEC. Jamil Nazarali, CEO of EDX Markets, expressed confidence in the compliance of the four listed crypto tokens (Bitcoin, Ether, Bitcoin Cash, and Litecoin) with the SEC. The platform&#8217;s selective listing of cryptocurrencies, which includes Bitcoin, Ether, Litecoin, and Bitcoin Cash, has been interpreted as a vote of confidence, specifically in Bitcoin Cash.  The listing of BCH on the EDX Markets exchange is an indication of the token&#8217;s regulatory clearance. This interpretation gains significance as the SEC scrutinizes other blockchain projects. Related reading: Here’s What Caused Bitcoin’s Flash Crash To $29,000 Bitcoin Cash Uptrend Fueled By Volume Spike On Upbit A major factor that could have influenced the recent uptrend in Bitcoin Cash (BCH) is the short squeeze and an unexpected surge in trading volume on the South Korean exchange, Upbit. A short squeeze occurs when the price of an asset rises, leading traders who had bet against the asset&#8217;s price to cover their positions at a loss or face forced liquidation.  The volatility in BCH&#8217;s price resulted in approximately $19 million in liquidations within the past 24 hours, with short orders accounting for 77% of the total amount. These liquidation levels represent the highest recorded in June 2023, according to data from Coinglass. BCH&#8217;s price remained heavily suppressed throughout the year, fluctuating between $100 and $150. However, its value experienced a significant vertical rise after being listed on EDX Markets. Currently, BCH is trading at $308.72, reaching levels last seen 14 months ago in May 2022. According to crypto research outlet The Tie, BCH trading volumes on Binance have reached levels not witnessed in two years. This indicates a resurgence of BCH&#8217;s trading interest following its EDX Markets listing. This renewed interest highlights a positive shift in the trading dynamics surrounding Bitcoin Cash. BCH is trading at $280.7 at press time, with a 5% decline in the past 24 hours. (This site’s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock and charts from Tradingview, Bloomberg, and Coinglass"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-01T10:05:02.000Z",
    "title": "Bitcoin Price Prediction: BTC Surges Past $30,000 and DigiToads (TOADS) presale set to hit $6 million —Will the Rally Continue?",
    "url": "https://www.crypto-news-flash.com/bitcoin-price-prediction-btc-surges-past-30000-and-digitoads-toads-presale-set-to-hit-6-million-will-the-rally-continue/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-price-prediction-btc-surges-past-30000-and-digitoads-toads-presale-set-to-hit-6-million-will-the-rally-continue",
    "description": "Leaving many new altcoins behind, Bitcoin has again proved its mettle with a new milestone — the BTC price recently surged past $30,000. Another token that had the cryptoverse in awe was DigiToads (TOADS) which crossed the $5.7-million mark in presale funding. The ERC-20 token has been designed as a meme coin with a difference. [...]"
  }
]