[
  {
    "source": "CoinDesk",
    "date": "2023-10-27T16:20:21.000Z",
    "title": "Gemini Sues Bankrupt Lender Genesis, Its Former Partner, Over $1.6B Worth of GBTC",
    "url": "https://www.coindesk.com/business/2023/10/27/gemini-sues-bankrupt-lender-genesis-its-former-partner-over-16b-worth-of-gbtc/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Cryptocurrency exchange Gemini has sued lending firm Genesis Global over 60 million GBTC shares that were pledged as collateral for Gemini's Earn users."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-27T16:24:26.000Z",
    "title": "Sam Bankman-Fried denies defrauding FTX users at trial",
    "url": "http://cointelegraph.com/news/sam-bankman-fried-denies-defrauding-ftx-users",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/28d4e0f1-1340-4435-b640-79d776ad1a82.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>As the final witness in his defense case, the former FTX CEO placed some of the blame for the crypto exchange’s failure on Gary Wang and Nishad Singh.</p>\n                    <p><p>The jury overseeing the criminal trial of Sam “SBF” Bankman-Fried listened to the former FTX CEO’s testimony for the first time, which involved largely denying knowledge of fraudulent activities at the crypto exchange.</p><p>According to reports from the New York courtroom on Oct. 27, Bankman-Fried <a href=\"https://twitter.com/innercitypress/status/1717928284686615002\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> Wang, the former chief technology officer at FTX, had been partly responsible for creating the “allow negative” button for Alameda Research. The feature gave the crypto hedge fund the ability to trade more funds than it had available.</p><p>“At the time I wasn’t entirely sure what was happened,” Bankman-Fried reportedly said regarding Alameda’s line of credit. “I thought the funds were being held in a bank account, or sent to FTX in stablecoins. If Alameda was keeping it, I figured it would be reflected as a negative number on FTX.”</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-27T16:15:00.000Z",
    "title": "Fintech, DeFi, GameFi, and more: Web3 startups kick off Cointelegraph Accelerator second cohort",
    "url": "http://cointelegraph.com/news/fintech-defi-gamefi-and-more-web3-startups-kick-off-cointelegraph-accelerator-second-cohort",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/31107cac9931d1f015f05b51808bcf87.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sixteen startups selected from over 1000 applications will present their projects to a global audience.</p>\n                    <p><p>Cointelegraph Accelerator, a startup booster that leverages Cointelegraph’s capabilities as a media and strategic partner, announced its second cohort launching in October 2023 for up-and-coming Web3 startups.</p><p>Selected from over 1000 startup applications, the 16 participants of the second cohort of the <a href=\"https://cointelegraph.com/accelerate/\">Cointelegraph Accelerator program</a> represent a wide array of Web3 verticals, including <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a>, fintech, wallets, entertainment, social, and GameFi.</p><p>By joining Cointelegraph’s accelerator program, Web3 startups will get marketing strategy expertise, access to Cointelegraph media products, and mentorship programs with industry experts on key start-up development topics, including token design, fundraising, legal frameworks, liquidity management, security, etc. The participants will also benefit from access to Cointelegraph’s broad network of investors, foundations, infrastructure partners, and other industry leaders.</p><p>The current cohort of the Cointelegraph Accelerator program consists of 16 Web3 startups focused on bringing innovation to the biggest sectors in the blockchain space. Find out more about them below:</p><h2>DeFi and trading</h2><p>In a world where traditional and decentralized finance coexist, bridging the gap between them is crucial. The latest Cointelegraph Accelerator participants focused on DeFi services are pioneering solutions to enhance accessibility, transparency, and efficiency, thus redefining trading and personal finance management for mainstream users.</p><p><a href=\"https://changex.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Changex</a> is a personal finance mobile app that aims to bring traditional finance users to Web3 by combining centralized and decentralized finance on a single screen. As an all-in-one <a data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/web3s-swiss-army-knife-of-personal-finance-changex-joins-cointelegraph-accelerator/amp\" href=\"https://cointelegraph.com/news/web3s-swiss-army-knife-of-personal-finance-changex-joins-cointelegraph-accelerator\">self-custody wallet solution</a>, Changex offers crypto swapping, buying, selling, and staking. The platform has 2,500 monthly active users (MAU) with over $3 million in staked assets.</p><p><a href=\"https://cryptorobotics.co/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">CryptoRobotics</a> is a crypto trading platform with advanced tools aimed at bringing the crypto community together. Users can utilize the signals and trading strategies coming directly from professional traders and analysts, who, in return, can earn investor rebates for providing their strategies. The platform leverages trading robots powered by smart algorithms with risk management systems to enable automated trading. The team reached over $1 billion in trading volume in 2022 with over 50,000 registered users.</p><p><a href=\"https://www.clip.finance/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Clip Finance</a> is a DeFi protocol that aggregates and benefits from the investment strategies available to the mainstream audience and other protocols. Users can deposit their stablecoins with a single click and get yield from a pool of various DeFi protocols, including Aave, Thena, Stargate, and Biswap. The platform aims to simplify the creation of risk-analyzed yield portfolios and is currently preparing for the main launch based on feedback from the private beta phase.</p><p><a href=\"https://myrenegade.net/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Renegade</a> is bridging the gap between traditional banking and cryptocurrencies. The user-friendly platform offers both a full IBAN account and a Visa card, allowing users to pay in top cryptocurrencies like BTC and ETH effortlessly. A central product element is the noncustodial wallet, ensuring users maintain full control over their crypto assets. After a promising beta test with 2,500 users, the company is gearing up for an open market launch in Q4 2023.</p><p><a href=\"https://www.mc2.fi/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">MC² Finance</a> is a noncustodial, cross-chain token strategy platform. It aims to democratize access to on-chain crypto wealth management through easy-to-use tools and access to aggregated crypto portfolio strategies with a user-friendly UI. The European-based MC² Finance team aims to launch its mainnet after hosting over a thousand users during the platform’s testnet.</p><p><a href=\"https://nolus.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Nolus</a> is a semi-permissioned, blockchain-powered platform that bridges lenders and borrowers in a DeFi money market. With its DeFi Lease, borrowers can secure 3x leveraged yield-generating capital. Inspired by traditional leasing, where one pays a fraction upfront and gains ownership after repayment, Nolus' approach cuts down the DeFi sector's high overcollateralization standards, which boosts capital efficiency and offers borrowers better loan terms.</p><p><a href=\"https://www.velvet.capital/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Velvet Capital</a> is a DeFi platform on the BNB Chain that helps create and manage on-chain funds and structured products. Asset managers can create portfolios of digital assets and mint synthetic tokens representing them. Users can invest in tokenized portfolios and earn yield from lending, staking, capital gains, or providing liquidity. The company offers a Web3 app for regular users and “DeFi-as-a-Service” (with SDK and APIs) for institutional clients. The platform has a live MVP with over 550 active investors.</p><p><a href=\"https://wzone.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">WhiteList Zone</a> is a marketplace where crypto investors and enthusiasts can buy “front-row seats” for upcoming Web3 projects. Its mission is to democratize the market of early Web3 investments in the most efficient and accessible way. Users can buy and trade whitelists, which grant exclusive rights to participate in launch events such as <a href=\"https://cointelegraph.com/learn/initial-dex-offering-ido\">initial DEX offerings (IDOs)</a>. The platform hosts over 50 projects and over 7,000 whitelist submissions, attracting nearly 4,000 users.</p><h2>Data storage and digital assets</h2><p>Data sovereignty and security are paramount in the digital age. By offering decentralized data storage and robust digital asset management solutions, these projects ensure a seamless transition toward digital ownership and secure data management.</p><p><a href=\"https://ghostdrive.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">GhostDrive</a> is a Web3 native data storage platform and user application on the <a href=\"https://cointelegraph.com/learn/what-is-the-interplanetary-file-system-ipfs-how-does-it-work\">InterPlanetary File System (IPFS)</a> and <a href=\"https://cointelegraph.com/learn/what-is-filecoin-the-leading-decentralized-storage-network\">Filecoin</a>, a decentralized alternative to Google Drive where users can store, share, and access data. Users can join by logging in with MetaMask or the traditional email and password combination and start storing data in a decentralized cloud securely.</p><p><a href=\"https://www.ngrave.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">NGRAVE</a> is the first complete solution for full control of digital assets, focusing on self-custody, maximum security, and ease of use. The <a data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/how-to-use-a-crypto-hardware-wallet/amp\" href=\"https://cointelegraph.com/news/how-to-use-a-crypto-hardware-wallet\">hardware wallet</a>, Ngrave Zero, is the world’s only financial product featuring a secure OS with the highest security certification: EAL7, developed with world-renowned cryptography and security experts. The company also offers its users a stainless steel encrypted backup for their keys and a mobile app to track their digital assets.</p><h2>SocialFi and Marketing tech</h2><p>The conventional social media landscape often overlooks fair revenue distribution and user control. However, innovative platforms are being developed to merge social interactions with financial incentives, creating a more equitable social media ecosystem for both content creators and consumers.</p><p><a href=\"https://www.popsocial.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Pop Social</a> is an AI-powered social gateway to Web3. The platform explores a new approach to social media where users create and share their content, interact with each other, and get rewards with native Pop Tokens for active engagement with the app. AI algorithms are used in the content creation features and in the process of generating individual post feeds. Pop Social has already reached over 250,000 downloads on the App Store and Google Play Store and has over 40,000 daily active users.</p><p><a href=\"https://readon.me/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">ReadON</a> is a social app with a Web3 sharing economy where content is owned by creators, and part of the ad revenue is distributed back to them. Creators earn tokens for sharing, users earn tokens for reading, and advertisers buy and burn tokens to place ads and access users' interests targeting data. The app has reached over 510,000 user registrations and app downloads, 45,000 daily active users, and over 563,000 content pieces.</p><p><a href=\"https://gamiworld.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">GAMI</a> is a Web3-focused venture builder that hosts a variety of products tailored to the blockchain industry. Gami’s flagship product is <a href=\"https://midle.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Midle</a>, an all-in-one marketing platform that helps optimize user acquisition and community engagement, working with 100+ partners from the Web3 space. Midle has already reached over 22,000 unique users who have completed over 400,000 quests.</p><h2>EdTech and HRTech</h2><p>Exclusivity and a lack of verified talent pools hinder the growth of the Web3 domain. Some projects, however, are working on democratizing access to Web3 solutions and education, bridging the gap between academic institutions and the blockchain industry, and facilitating continuous innovation.</p><p><a href=\"https://talentre.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Talentre</a> is a Web3 talent platform where users have access to blockchain education courses, events, certifications, and a traceable tokenized achievement system. At the same time, Web3 companies and projects get access to a verified talent pool. More than 50 universities have already partnered with Talentre, and the platform has reached over 170,000 registered wallets and over 50 business clients, including Circle, BNB Chain, Solana, and many others.</p><h2>Entertainment</h2><p>Monetization and user engagement are pressing challenges in the entertainment sector. By embedding blockchain technology in streaming and gaming platforms, these innovative projects are crafting a rewarding and engaging entertainment ecosystem for modern audiences.</p><p><a href=\"https://imaginereplay.org/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Replay</a> has developed a blockchain-powered streaming service called <a href=\"https://rewarded.tv/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">RewardedTV</a> that empowers viewers and creators to take control of their video streaming experience. RewardedTV uses blockchain tech <a data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/how-web3-can-prevent-hollywood-strikes-replay-joins-cointelegraph-accelerator/amp\" href=\"https://cointelegraph.com/news/how-web3-can-prevent-hollywood-strikes-replay-joins-cointelegraph-accelerator\">to reward viewers</a> with digital tokens and collectibles to drive engagement. The platform has over 100,000 registered users, and more than 4,000 videos-on-demand (VOD) live TV channel options, with more partnered streaming apps on the way.</p><p><a href=\"https://www.fan-ton.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Fanton</a> is a Web3 fantasy football game <a data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/press-releases/telegram-and-tons-triple-play-fantons-web3-fantasy-soccer-game-hits-55k-mau/amp\" href=\"https://cointelegraph.com/press-releases/telegram-and-tons-triple-play-fantons-web3-fantasy-soccer-game-hits-55k-mau\">playable on Telegram</a> and integrated with The Open Network (TON) blockchain. Similar to traditional fantasy sports games, which comprise a $25 billion market, the game allows players to create their dream team with NFT cards of soccer superstars and earn points based on the players’ real-life performances. The product has had a successful launch reaching more than 11,000 registered users to date.</p>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-27T16:30:43.000Z",
    "title": "Bitcoin’s price surge not reflected by on-chain activity",
    "url": "https://cryptoslate.com/bitcoins-price-surge-not-reflected-by-on-chain-activity/",
    "description": "<p>While Bitcoin&#8217;s price saw a substantial increase in the past two weeks, there was a simultaneous decrease in the creation of new addresses and the transaction count on the network. Between Oct. 15 and Oct. 27, Bitcoin&#8217;s price surged from $27,140 to $34,160. Historically, such price upticks are accompanied by heightened network activity, as an [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoins-price-surge-not-reflected-by-on-chain-activity/\">Bitcoin&#8217;s price surge not reflected by on-chain activity</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-27T16:26:24.000Z",
    "title": "Hang Tight or Let Go? Decoding the Paths of Avalanche (AVAX), ApeCoin (APE), and Algorand (ALGO)",
    "url": "https://cryptodaily.co.uk/2023/10/hang-tight-or-let-go-decoding-the-paths-of-avalanche-avax-apecoin-ape-and-algorand-algo",
    "description": "Explore in-depth analyses of Avalanche (AVAX), ApeCoin (APE), and Algorand (ALGO), as we dissect their recent price trends and forecasts. Navigate the volatile crypto world with our insights to make informed investment decisions."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-27T16:30:30.000Z",
    "title": "Bitcoin Skyrockets, Yet South Korea Experiences a ‘Kimchi Discount’ Instead of the Usual Premium",
    "url": "https://news.bitcoin.com/bitcoin-skyrockets-yet-south-korea-experiences-a-kimchi-discount-instead-of-the-usual-premium/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/prem-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Skyrockets, Yet South Korea Experiences a ‘Kimchi Discount’ Instead of the Usual Premium\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/prem-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/prem-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/prem-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/prem-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/prem-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/prem-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/prem.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin has soared, doubling its value since the start of the year. Yet, intriguingly, the famed &#x201C;Kimchi premium&#x201D; in South Korea remains absent in this current surge of bullish activity. This is a notable deviation from previous bull markets, where the phenomenon was prominently observed. In fact, this time around, BTC prices in South Korea [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-27T16:23:00.000Z",
    "title": "Microsoft Launches Nationwide AI Upskilling Initiative in Ireland",
    "url": "https://www.cryptopolitan.com/microsoft-launches-nationwide-ai-initiative/",
    "description": "Microsoft has recently unveiled an ambitious nationwide initiative in Ireland aimed at upskilling individuals of all ages and backgrounds in the field of artificial intelligence (AI). Spearheaded by the tech giant&#8217;s &#8216;Skill Up Ireland program, the initiative comprises three distinct educational programs catering to different segments of the population, ranging from primary and post-primary students ... <a title=\"Microsoft Launches Nationwide AI Upskilling Initiative in Ireland\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microsoft-launches-nationwide-ai-initiative/\" aria-label=\"More on Microsoft Launches Nationwide AI Upskilling Initiative in Ireland\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-27T16:12:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Binance coin and the entire crypto market have seen little gains in the past few days, as prices have been consolidating in tight regions. BNB prices have dropped by 14.11% since touching $248.9 in August 2023. What does the future hold for Binance Coin? How much is BNB worth? The ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-27T16:29:00.000Z",
    "title": "Chainlink (LINK) Bulls Face Resistance as Optimism Fades",
    "url": "https://coinedition.com/chainlink-link-bulls-face-resistance-as-optimism-fades/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/LINK-9.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/LINK-9.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/LINK-9-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/LINK-9-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/LINK-9-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/LINK-9-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/LINK-9-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In the recent week, the Chainlink (LINK) market has shown bullish dominance, gaining more than 61% from an intra-week low of $7.54 to a high of $11.8 before seeing a modest retracement. The current price increase in Chainlink may be linked to the general optimistic feeling in the crypto market over the past week, fueled [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/chainlink-link-bulls-face-resistance-as-optimism-fades/\">Chainlink (LINK) Bulls Face Resistance as Optimism Fades</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]