[
  {
    "source": "Decrypt",
    "date": "2024-01-15T19:51:26.000Z",
    "title": "Jupiter Finally Sets a Date for JUP Airdrop, Teases Meme Coin Drop on Solana",
    "url": "https://decrypt.co/212884/jupiter-finally-sets-date-jup-airdrop-teases-meme-coin-drop-solana",
    "description": "Nearly a million Solana DeFi users will be able to claim JUP later this month in the airdrop, with Jupiter teasing a meme coin launch too."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-15T20:01:34.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Lawyers representing former Celsius CEO Alex Mashinsky have requested a federal court to drop charges related to commodities fraud and market manipulation. Meanwhile, An Argentine landlord signed an agreement with their tenant for rent payments in Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), and investment giant BlackRock has launched an advertising campaign for its newly listed spot Bitcoin ETF, with some suggesting it could finally entice the “wealthy boomer” market. </p><p>Alex Mashinksky, the founder and former CEO of failed crypto lending platform Celsius, wants to have <a href=\"https://cointelegraph.com/news/alex-mashinsky-petitions-drop-fraud-charges\">two charges against him dropped</a>. </p><p>In a Jan. 12 filing in the U.S. District Court for the Southern District of New York, Mashinsky’s lawyers requested the dismissal of two felony counts related to commodities fraud and market manipulation. The filing states that the count of commodities fraud was “repugnant” and “inconsistent” with the first count of securities fraud. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-15T20:00:00.000Z",
    "title": " The week the SEC finally approved spot Bitcoin ETFs: Law Decoded ",
    "url": "https://cointelegraph.com/news/sec-approved-spot-bitcoin-etfs-week-law-decoded-jan-8-15",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMDViNGRhNjAtMzExMC00NDBmLWE2Y2QtMWM0NmI2YjEwNDhmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Even Gary Gensler voted to approve the spot Bitcoin ETFs. </p>\n                    <p><p data-ct-non-breakable=\"true\">More than a decade after the first application was filed, the crypto industry finally has spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds in the United States. On Jan. 10, the U.S. Securities and Exchange Commission (SEC) <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-approvals-reporting-live\">approved Bitcoin ETF applications</a> from ARK 21Shares, Invesco Galaxy, VanEck, WisdomTree, Fidelity, Valkyrie, BlackRock, Grayscale, Bitwise, Hashdex and Franklin Templeton. The SEC’s decision was a historic milestone for crypto, but the road was not smooth. <a href=\"https://cointelegraph.com/news/historic-win-crypto-spot-bitcoin-etf\">It all started in 2013</a>, when Gemini co-founders Cameron and Tyler Winklevoss filed the first application for a spot Bitcoin ETF in the United States.</p><p>The decision by the SEC to approve a spot cryptocurrency ETF in the U.S. for the first time raised questions about the intentions of Gary Gensler, the commission’s chair. Since taking office, Gensler has often <a href=\"https://cointelegraph.com/news/gary-gensler-warning-crypto-spot-etf\">spoken about the risks</a> of crypto investments, connecting digital assets to fraud and scams. However, Gensler was one of three commissioners who voted to approve the offerings. The 3-2 vote tally suggests the SEC chair may have been the deciding vote. Some community members <a href=\"https://twitter.com/tyillc/status/1745254850554659327\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> the SEC chair “voted with Wall Street,” as the expansion of crypto products is likely to bring in investor funds. Others <a href=\"https://twitter.com/zGuz/status/1745432808498077966\" target=\"_blank\" rel=\"noopener nofollow\">speculated</a> that “the writing was already on the wall” for the SEC to approve a spot Bitcoin ETF, given that the commission had been mandated by a federal court to review Grayscale’s offering.</p><p>Not <a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-critics-lash-sec-decision-fraud-manipulation\">everyone is happy</a> with the SEC’s decision. In her statement, SEC Commissioner Caroline Crenshaw — one of two commissioners to vote against the approval — wrote that the agency’s move to greenlight the Bitcoin-based investment vehicles was “unsound and ahistorical.” Better Markets, a nonprofit economic organization, also didn’t mince words in its criticism of the ETF decision, describing the asset as inherently worthless and without purpose. Gold advocate and Bitcoin critic Peter Schiff added his voice to the mix, saying that the approvals were nothing more than a series of new ways for speculators to gamble on Bitcoin.</p><p><a href=\"https://cointelegraph.com/news/sec-approved-spot-bitcoin-etfs-week-law-decoded-jan-8-15\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-15T19:42:01.000Z",
    "title": " Wallets with USDC stablecoin grew by 59% in 2023 despite circulation drop ",
    "url": "https://cointelegraph.com/news/wallets-with-usdc-stablecoin-grew-59-percent-2023-despite-circulation-drop-circle-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMmFjZTYxODctODdjNy00NzdjLTgxN2UtOTc1ZjI2NzdjYWI2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Despite a steep drop in USDC's circulating supply, its user base may have increased over the course of the year.</p>\n                    <p><p>The number of wallets holding at least $10 worth of USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) grew by 59% in 2023, according to a Jan. 15 report from its issuer, Circle. This growth <a href=\"https://www.circle.com/reports/state-of-the-usdc-economy\" target=\"_blank\" rel=\"noopener nofollow\">came</a> despite USDC losing $20 billion of its circulating supply, implying that the coin may gained users even as its market capitalization depreciated. </p><p>The report, titled “State of the USDC Economy,” presented a broad overview of the current usage of USDC. In the report, Circle said the coin’s circulating supply fell from $45 billion to $25 billion in the first 11 months of 2023, a decline of approximately 44%. </p><p>Circle attributed the decline to “[r]ising interest rates, regulatory crackdowns, bankruptcies, and outright fraud” in crypto, which caused users to pull their money out of the ecosystem and into traditional markets. They cited the “opportunity costs of holding USDC” as an especially important force behind this decline, as rising interest rates have attracted investors to more traditional markets.</p><p><a href=\"https://cointelegraph.com/news/wallets-with-usdc-stablecoin-grew-59-percent-2023-despite-circulation-drop-circle-report\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2024-01-15T20:00:00.000Z",
    "title": " The week the SEC finally approved spot Bitcoin ETFs: Law Decoded ",
    "url": "https://cointelegraph.com/news/sec-approved-spot-bitcoin-etfs-week-law-decoded-jan-8-15",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMDViNGRhNjAtMzExMC00NDBmLWE2Y2QtMWM0NmI2YjEwNDhmLmpwZw==.jpg\"></p><p>Even Gary Gensler voted to approve the spot Bitcoin ETFs. </p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-15T19:49:41.000Z",
    "title": "Will Cardano's (ADA) Latest Node Improvement Outshine Solana's (SOL) Scalability Feats?",
    "url": "https://cryptodaily.co.uk/2024/01/will-cardanos-ada-latest-node-improvement-outshine-solanas-sol-scalability-feats",
    "description": "Explore the dynamic shifts in the crypto landscape as Bitcoin (BTC) faces volatility, while Cardano (ADA) and Solana (SOL) chart new territories with their latest developments. Discover how Cardano's Node v8.7.3, Plutus improvements, and growing project count contrast with Solana's big tech integrations. Delve into how these developments, along with Bitcoin's halving event and macroeconomic factors, shape the future of these cryptocurrencies."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-15T20:00:33.000Z",
    "title": "Crypto Analyst Says A Solana Price Will Climb To $750, Here’s When",
    "url": "https://www.newsbtc.com/news/solana/solana-price-will-climb-to-750/",
    "description": "Crypto YouTuber Jake Gagain has shared his “insane price prediction” for Solana (SOL) as he said that the crypto token will climb to $750. The crypto analyst didn’t stop there as he also provided a timeframe for when this price level would be attained.  Solana Price To Rise To $750 In 2025 Gagain said that he expects Solana to hit this price level by 2025 in an X (formerly Twitter) post. In the accompanying video, he outlined several reasons for this bullish sentiment. For the first, he alluded to the fact that the Solana network happens to be “quicker, safer, and much more affordable” than Ethereum.  Related Reading: Here Are The Reasons Bitcoin Price Could Drop To $37,000 Before The Halving According to him, more users from Ethereum and other networks are likely to migrate to the Solana network as more projects get built on it. This is based on his expectation that Solana will be the “top competitor” for Ethereum in the next bull run. Gagain further asserted that SOL will end up becoming the third largest token by market cap, only behind Bitcoin and Ethereum. The second reason why the analyst is bullish on SOL is because of how it has impressively recovered from the FTX scandal. Solana was at the heart of it as the crypto exchange’s founder, Sam Bankman-Fried (SBF), was one of the token’s biggest backers. SOL dropped below $10 as a result of this while being in the middle of a bear market.  However, it has recovered nicely since then, climbing above $100 towards the end of last year. That is why Gagain believes that the crypto token could go as far as hitting its all-time high of $260 and surpassing it.  SOL price drops to $95 &#124; Source: SOLUSD on Tradingview.com SOL Is Also Making Its Way Into The Traditional Market Jake Gagain also highlighted the fact that Solana was making its way into the traditional market as another reason he was so bullish on SOL. Solana’s entry into the traditional market is said to be happening through its partnerships with notable brands. One of them, which the crypto analyst mentioned, was its partnership with Shopify.  Related Reading: Shiba Inu Whales Eat The Dip: 2.39 Trillion SHIB Make Their Way To Cold Storage Back when the partnership was confirmed, NewsBTC highlighted how it could help onboard more users into crypto and specifically into the Solana ecosystem. The network was projected to see more activity, considering the number of users Shopify already has.  Interestingly, the number of transactions Solana records daily is another reason why Gagain is most bullish on SOL. Network activity is known to be another factor that can affect a token’s price.  At the time of writing, SOL is trading at around $95, down over 2% in the last 24 hours, according to data from CoinMarketCap. Featured image from Analytics Insight, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-15T19:45:29.000Z",
    "title": "New Phishing Scams on Solana (SOL) Have Stolen Over $4,000,000 in Crypto Assets: Security Firm",
    "url": "https://dailyhodl.com/2024/01/15/new-phishing-scams-on-solana-sol-have-stolen-over-4000000-in-crypto-assets-security-firm/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New data from a cybersecurity firm reveals that recent phishing scams over smart contract platform Solana (SOL) have stolen over $4 million in crypto assets. In a new blog post, security firm Scam Sniffer says that in the past month alone, bad actors were able to exploit $4.17 million worth of digital assets from about [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/15/new-phishing-scams-on-solana-sol-have-stolen-over-4000000-in-crypto-assets-security-firm/\">New Phishing Scams on Solana (SOL) Have Stolen Over $4,000,000 in Crypto Assets: Security Firm</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-15T19:41:31.000Z",
    "title": "Institutions Pour $1,118,000,000 in Capital into Crypto Markets Amid Bitcoin ETF Launch: CoinShares",
    "url": "https://dailyhodl.com/2024/01/15/institutions-pour-1118000000-in-capital-into-crypto-markets-amid-bitcoin-etf-launch-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/billion-investment-giant-bain.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/billion-investment-giant-bain.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/03/billion-investment-giant-bain.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/03/billion-investment-giant-bain.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/03/billion-investment-giant-bain.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/03/billion-investment-giant-bain.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/03/billion-investment-giant-bain.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says institutions are buying into Bitcoin (BTC) and crypto by the billions in the wake of last week&#8217;s landmark spot BTC exchange-traded fund (ETF) approval. In its latest Digital Asset Fund Flows report, CoinShares finds that BTC investment products dominated $1.18 billion in inflows last week after the spot BTC ETF approval [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/15/institutions-pour-1118000000-in-capital-into-crypto-markets-amid-bitcoin-etf-launch-coinshares/\">Institutions Pour $1,118,000,000 in Capital into Crypto Markets Amid Bitcoin ETF Launch: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]