[
  {
    "source": "CoinDesk",
    "date": "2023-07-17T07:00:00.000Z",
    "title": "Financial Stability Board Calls for Tougher Global Crypto Rules After Year of Turmoil",
    "url": "https://www.coindesk.com/policy/2023/07/17/financial-stability-board-calls-for-tougher-global-crypto-rules-after-year-of-turmoil/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The standard-setter called for crypto companies to adapt now, after allegations of misuse of client funds at FTX"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-17T06:58:16.000Z",
    "title": "Binance Embraces Lightning: A Leap Towards Faster Bitcoin Transactions",
    "url": "https://www.cryptoglobe.com/latest/2023/07/binance-embraces-lightning-a-leap-towards-faster-bitcoin-transactions/",
    "description": "In a significant stride towards enhancing Bitcoin transaction efficiency, Binance, one of the world’s leading cryptocurrency exchanges, has successfully integrated the Bitcoin Lightning Network into its platform. This integration, announced on July 17, 2023, enables Binance users to leverage the Lightning Network’s capabilities for their Bitcoin deposits and withdrawals. The Lightning Network, a second-layer protocol, […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-17T07:02:00.000Z",
    "title": "US Lawmakers Pressure Congress To Pass Crypto Law",
    "url": "https://cryptodaily.co.uk/2023/07/us-lawmakers-pressure-congress-to-pass-crypto-law",
    "description": "<p>Following SEC's victory over Ripple, several US lawmakers have called on Congress for regulatory clarity regarding the crypto industry.</p>\n<p>As one of the lawmakers stated, &ldquo;Gary Gensler&rsquo;s SEC cannot continue to pursue its regulation by enforcement approach, which only harms investors and creates uncertainty.&rdquo;</p>\nThe Ripple vs SEC Case\n<p>Following a lengthy 3-year court battle, the SEC-Ripple case has finally ended with a \"partial victory\" for the latter. As per the Southern District of New York Court's ruling, all XRP sales fall under three buckets &ndash;&nbsp; institutional sales, programmatic sales, and other distributions. While the SEC prevailed in the case of institutional sales, Ripple secured a favorable outcome regarding programmatic sales and other distributions. It should be noted that t the SEC still has the option to appeal the court's decisions in the future.</p>\nThe Lawmakers Respond\n<p>Following the ruling, the Chairman of the House Financial Services Committee, Patrick McHenry (NC-10), and the Chairman of the House Agriculture Committee, Glenn &ldquo;GT&rdquo; Thompson (PA-15), issued a joint statement.</p>\n\n<p>&ldquo;This decision underscores the need for Congress to provide clear rules of the road for the digital asset ecosystem&mdash;it&rsquo;s misguided to think otherwise. The ruling gives large institutional investors greater protections than everyday Americans. Outcomes like this happen when regulators force courts to make policy instead of Congress. Our comprehensive market structure legislation will give all investors, customers, and market participants the same longstanding protections found in traditional financial markets.\"</p>\n\n<p>The lawmakers also noted the flaws in the Gensler-led SEC's regulatory approach since digital assets may not &ldquo;be inherently securities, but can be offered as part of an investment contract in certain circumstances, which our legislation acknowledges.\" The SEC's one-size-fits-all approach creates uncertainty and harms investors.</p>\nThe Lummis-Gillibrand Crypto Bill\n<p>Echoing her colleagues' sentiments, Senator Cynthia Lummis urged to pass the Lummis-Gillibrand Responsible Financial Innovation Act, emphasizing the need for regulatory clarity. The bill primarily aims to pass authority over crypto regulation from the Securities and Exchange Commission (SEC) to the Commodities Future Trading Commission (CFTC).</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-17T07:00:50.000Z",
    "title": "QED: A zk-Native blockchain capable of serving millions of concurrent users",
    "url": "https://cryptodaily.co.uk/2023/07/qed-a-zk-native-blockchain-capable-of-serving-millions-of-concurrent-users",
    "description": "<p>Hong Kong, China, July 17th, 2023, Chainwire</p><p>Startup Open Asset Standards has recently announced QED, the world's first ZK 2.0 blockchain protocol. Unlike existing zero-knowledge blockchain protocols, QED has a novel state model which is horizontally scalable, meaning it is no longer limited by TPS restrictions that have previously prevented adoption of blockchain technologies in Web2 use cases such as social networks, traditional finance, and gaming.</p><p>Enabled by advances in fast recursive zero-knowledge proofs, QED is able to achieve this scale without compromising security or decentralization and proves all transactions end-to-end using proof recursion (verifying a zero-knowledge proof in a zero-knowledge proof ). This process of decentralized recursive proving culminates in a single block proof that can be verified by an Ethereum smart contract, making the protocol only reliant on the Proof of Math itself, rather than an incentive based consensus system vulnerable to collusion, hacking and misaligned incentives.</p><p>As the first blockchain capable of serving billions of users in a single block, QED does away with the need for a zk-VM by compiling smart contract functions directly to zero knowledge circuits, making it the first zk-Native blockchain. QED&rsquo;s novel approach to ZKP allows users to prove their own transactions on their own device in milliseconds, enabling a new privacy-centric internet where transactions are private by default and sensitive data never has to leave a user&rsquo;s device.</p><p>With its announcement of the QED Protocol, Open Asset Standards unveiled QED's official Dapen Smart Contract IDE. With Dapen, Web2 developers can write zk Smart Contracts in the world's 2 most popular programming languages, JavaScript and Python, which have a developer market share 357 times larger than the Solidity community which only makes up a miniscule 0.1% of the world&rsquo;s developers.</p><p>In addition to making blockchain accessible to more developers than ever before, Dapen has integrated support for Markdown smart contracts which allow even non-technical users to write smart contracts in English using their integration with several large language AI models (LLMs) including ChatGPT.</p><p>Backed by Animoca Brands' fund Sparkle Ventures whose General Partners include Sebastien Borget, Co-founder of Sandbox, and Yat Siu, Co-founder of Animoca Brands, QED is set to see major adoption within the gaming space which regularly support millions of concurrent gamers playing at once. Due to its horizontal scaling model, QED is able to add transaction processing capacity by simply adding more proving nodes to its network, allowing large-scale gaming to integrate with blockchain technologies such as dynamic NFTs for the first time.</p><p>Headed up by Founder and CEO Carter Feldman, a former childhood hacking prodigy and reverse engineer, the QED core team is made up of a diverse team from both Web2 tech giants and Web3 titans including Binance, reflecting the protocol's mission to unite Web2 and Web3.</p><p>About QED</p><p>QED is the world's first zk-Native blockchain protocol, built to scale trustless computation and privacy for the next generation of the internet.</p><p>Twitter: Official | Founder&nbsp;</p>ContactQED Protocolnews@qedprotocol.com"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-17T06:43:22.000Z",
    "title": "Flipster to give away huge 1,500,000 USDT worth of Bonus",
    "url": "https://cryptodaily.co.uk/2023/07/flipster-to-give-away-huge-1500000-usdt-worth-of-bonus",
    "description": "<p>seychelles, seychelles, July 17th, 2023, Chainwire</p><p class=\"ql-align-justify\">As part of Flipster's (formerly AQX) name launch, the business today announced an additional 1,500,000 USD worth of bonus rewards to encourage new users to join and trade on their exchange. Until the rewards are fully distributed, the futures exchange will run at least one campaign per week to encourage new users to signup and trade derivatives on the Flipster platform. Under the old name the exchange has already made available more than 400,000USDT worth bonus in past campaigns.&nbsp;</p><p class=\"ql-align-justify\">The first promotion in the series kicked off on the 17th of July, 2023 (running for seven days). A massive 110,000 USDT in bonuses has been allocated. 10,000 USDT to reward new users when completing identity verification with a 10 USDT Bonus. The remaining 100,000 USDT bonus is to incentivise and reward high volume traders that give the platform a chance. The top performer by trading volume will be rewarded with 10,000 USDT in Bonus at the end of the weekly campaign.</p><p class=\"ql-align-justify\">Flipster has reimagined futures trading with a mobile-first approach to appeal to casual crypto traders with limited experience in derivatives trading (or, as they say, Flipping).&nbsp;</p><p class=\"ql-align-justify\">The method is to specialize in derivatives trading, stripping back the app experience to make it faster to learn and easier to use. Novice traders can open, close and monitor positions from any location. Potentially meaning some users may make more money on the bus to work, than from their days Labor. Beyond ease of use, the portable experience makes trading fun and feels less like a technical task.&nbsp;</p><p class=\"ql-align-justify\">The flip to a mobile-first approach came after initially having a web experience similar to other futures exchanges. The traditional UI for futures trading has a steep learning curve and is considerably more technical, which strongly contrasts with the UI that most contemporary apps users have become familiar with. The data concluded that users new to derivatives were not attracted to this experience as it had been built for experienced traders. The Flipster team discovered a few alternative UIs for future trading and none that have successfully been created to onboard new users to crypto futures trading at scale.&nbsp;</p><p class=\"ql-align-justify\">While the focus is on simplicity, Flipster has features that will spark the interest of experienced traders as well. The exchange regularly adds new perpetual swap contracts, and as of today, over 120 assets can be traded with leverage, making Flipster a competitive exchange for traders to consider. Amongst their assets are tokens not found for futures on other exchanges and some even with low visibility in spot markets.&nbsp;</p>CEO Yongjin Kim said, \"The team has been working very hard on bringing this new vision for futures trading to life, and now is the right time to incentivise users to trade with us. Once users start trading on our platform, they will be coming back again and again. Rather than just copying what every other exchange has done, we are doing something fresh, and I believe the market is ready for some injection of new ideas. To our existing users, I want to thank you for being with us, and to the new guys coming in now, Welcome\".&nbsp;<p class=\"ql-align-justify\">Get started by creating a Flipster account flipster.xyz</p><p class=\"ql-align-justify\">About Flipster</p><p class=\"ql-align-justify\">Founded in 2021, Flipster (ex AQX) is the industry's easy-to-use crypto derivatives trading platform. It offers users an all-in-one platform trading more than 120 tokens with leverage up to 50x. Get started at flipster.xyz to join online or download the app and play store. For media enquiries including interviews with the team reach out at pr@flipster.xyz</p><p class=\"ql-align-justify\">For more information follow Flipater on Twitter.</p><p></p><p></p>ContactHead of MarketingBen RogersPrex Ltdbenrogers@prestlabs.io"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-17T07:00:56.000Z",
    "title": "QED: A Zk-Native Blockchain Capable of Serving Millions of Concurrent Users",
    "url": "https://news.bitcoin.com/qed-a-zk-native-blockchain-capable-of-serving-millions-of-concurrent-users/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-92-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-92-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-92-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-92-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-92-1536x864.jpg 1536w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-92-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-92-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-92-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-92-1520x855.jpg 1520w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-92-1280x720.jpg 1280w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-92.jpg 1600w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. July 17th, 2023, Hong Kong. Startup Open Asset Standards has recently announced QED, the world&#8217;s first ZK 2.0 blockchain protocol. Unlike existing zero knowledge blockchain protocols, QED has a novel state model which is horizontally scalable, meaning it is no longer limited by TPS restrictions that have previously prevented adoption of blockchain technologies [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T06:40:52.000Z",
    "title": "Flipster to give away huge 1,500,000 USDT worth of Bonus",
    "url": "https://www.cryptopolitan.com/flipster-to-give-away-huge-1500000-usdt-worth-of-bonus/",
    "description": "seychelles, seychelles, July 17th, 2023, Chainwire As part of Flipster&#8217;s (formerly AQX) name launch, the business today announced an additional 1,500,000 USD worth of bonus rewards to encourage new users to join and trade on their exchange. Until the rewards are fully distributed, the futures exchange will run at least one campaign per week to ... <a title=\"Flipster to give away huge 1,500,000 USDT worth of Bonus\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flipster-to-give-away-huge-1500000-usdt-worth-of-bonus/\" aria-label=\"More on Flipster to give away huge 1,500,000 USDT worth of Bonus\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T07:05:30.000Z",
    "title": "TOADS and SOL shining Bright As Investors Confidence Rise After FTX Bankruptcy Fiasco",
    "url": "https://www.crypto-news-flash.com/toads-and-sol-shining-bright-as-investors-confidence-rise-after-ftx-bankruptcy-fiasco/?utm_source=rss&utm_medium=rss&utm_campaign=toads-and-sol-shining-bright-as-investors-confidence-rise-after-ftx-bankruptcy-fiasco",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T100156.625.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T100156.625.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T100156.625-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T100156.625-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto industry continues to grapple with the aftermath of the FTX fiasco that occurred last year, leaving many unresolved issues and uncertainties. FTX had aggressively promoted its brand through various advertising campaigns, sponsorships, and partnerships, contributing to its rapid growth. However, it was revealed that a significant portion of FTX&#8217;s balance sheet consisted of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T07:00:54.000Z",
    "title": "QED: A zk-Native blockchain capable of serving millions of concurrent users",
    "url": "https://www.crypto-news-flash.com/qed-a-zk-native-blockchain-capable-of-serving-millions-of-concurrent-users/?utm_source=rss&utm_medium=rss&utm_campaign=qed-a-zk-native-blockchain-capable-of-serving-millions-of-concurrent-users",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/QED_1600-900_16893407309PBZdzJexR.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/QED_1600-900_16893407309PBZdzJexR.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/QED_1600-900_16893407309PBZdzJexR-300x180.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/QED_1600-900_16893407309PBZdzJexR-1024x614.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/QED_1600-900_16893407309PBZdzJexR-768x461.jpeg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Hong Kong, China, July 17th, 2023, Chainwire Startup Open Asset Standards has recently announced QED, the world&#8217;s first ZK 2.0 blockchain protocol. Unlike existing zero-knowledge blockchain protocols, QED has a novel state model which is horizontally scalable, meaning it is no longer limited by TPS restrictions that have previously prevented adoption of blockchain technologies in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T06:44:21.000Z",
    "title": "Flipster to give away huge 1,500,000 USDT worth of Bonus",
    "url": "https://www.crypto-news-flash.com/flipster-to-give-away-huge-1500000-usdt-worth-of-bonus/?utm_source=rss&utm_medium=rss&utm_campaign=flipster-to-give-away-huge-1500000-usdt-worth-of-bonus",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Scene_Unlock-Opportunity_v02b_1689499027AWX7V2Ki90.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Scene_Unlock-Opportunity_v02b_1689499027AWX7V2Ki90.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Scene_Unlock-Opportunity_v02b_1689499027AWX7V2Ki90-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Scene_Unlock-Opportunity_v02b_1689499027AWX7V2Ki90-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Scene_Unlock-Opportunity_v02b_1689499027AWX7V2Ki90-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />seychelles, seychelles, July 17th, 2023, Chainwire As part of Flipster&#8217;s (formerly AQX) name launch, the business today announced an additional 1,500,000 USD worth of bonus rewards to encourage new users to join and trade on their exchange. Until the rewards are fully distributed, the futures exchange will run at least one campaign per week to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T06:41:48.000Z",
    "title": "Ripple: XRP Poised to Surge Again by More Than 60% Despite SEC Win and Gary Gensler, Thanks to Massive New Partnerships",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-poised-to-surge-again-by-more-than-60-despite-sec-win-and-gary-gensler-thanks-to-massive-new-partnerships/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-xrp-poised-to-surge-again-by-more-than-60-despite-sec-win-and-gary-gensler-thanks-to-massive-new-partnerships",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-09T084850.726.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-09T084850.726.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-09T084850.726-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-09T084850.726-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />XRP&#8217;s status as a non-security in the Ripple case propels its price to surge by 70% in a single day. Senator Cynthia Lummis calls for Congress to provide a comprehensive crypto framework to prioritize consumer protection. Senator Cynthia Lummis took to Twitter to express her response to the Southern District of New York&#8217;s ruling in [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-17T07:04:13.000Z",
    "title": "Rich Dad Poor Dad Author Says He’s Sticking With Bitcoin (BTC) Amid ‘Sad’ State of America",
    "url": "https://dailyhodl.com/2023/07/17/rich-dad-poor-dad-author-says-hes-sticking-with-bitcoin-btc-amid-sad-state-of-america/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-Could-Easily-Rip.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-Could-Easily-Rip.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-Could-Easily-Rip.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-Could-Easily-Rip.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-Could-Easily-Rip.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-Could-Easily-Rip.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-Could-Easily-Rip.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The author of the best-selling personal finance book Rich Dad Poor Dad says he&#8217;s banking on Bitcoin (BTC) and precious metals amid a worsening financial climate.  Robert Kiyosaki tells his 2.4 million Twitter followers that America is in a &#8220;sad&#8221; state right now because of rising national debt and financial inequality. Given his outlook on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/17/rich-dad-poor-dad-author-says-hes-sticking-with-bitcoin-btc-amid-sad-state-of-america/\">Rich Dad Poor Dad Author Says He’s Sticking With Bitcoin (BTC) Amid ‘Sad’ State of America</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]