[
  {
    "source": "Decrypt",
    "date": "2024-04-03T22:57:56.000Z",
    "title": "Bitcoin Ordinals Driving ‘Renaissance’ in BTC Activity: Franklin Templeton",
    "url": "https://decrypt.co/224713/bitcoin-ordinals-driving-renaissance-in-btc-activity-franklin-templeton",
    "description": "The investment giant says the popular project reflects “positive momentum in innovations” in digital assets."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-03T23:02:32.000Z",
    "title": " Bitcoin Cash completes second-ever halving ",
    "url": "https://cointelegraph.com/news/bitcoin-cash-bch-second-ever-halving-event-miner-rewards",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvNzZjODJjYjktZGI5OS00ZmQ4LWJhYWUtOTQzYzZmNDk5YThjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>There has been speculation in the lead-up to the halving, with the price of Bitcoin Cash increasing 147.85% over the past three months, though it has dipped over the last 24 hours. </p>\n                    <p><p>The second ever Bitcoin Cash (<a href=\"https://cointelegraph.com/bitcoin-cash-price-index\">BCH</a>) halving has just taken place as of 10:45 pm UTC on April 3 at block height 840,000 — where miner <a href=\"https://www.nicehash.com/countdown/bch-halving-2024-04-01-12-00\" target=\"_blank\" rel=\"noopener nofollow\">rewards</a> will now be chopped from 6.25 BCH to 3.125 BCH.</p><p>Bitcoin Cash is a proof-of-work blockchain network and cryptocurrency that was designed to be faster and cheaper to use than Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). The first Bitcoin Cash halving event took place on April 8, 2020, with miner rewards dropping <a href=\"https://cointelegraph.com/news/bitcoin-cash-halving-results-in-miner-exodus-and-profitability-decline\">from 12.5 BCH to 6.25 BCH.</a></p><p>There has been speculation in the lead-up to the halving, with the price of Bitcoin Cash increasing 147.85% over the past three months and 24% over the past 30 days. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-cash-bch-second-ever-halving-event-miner-rewards\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-03T22:40:17.000Z",
    "title": " Why is Dogecoin price down today? ",
    "url": "https://cointelegraph.com/news/why-is-dogecoin-doge-price-down-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDQvOTViNTBhZGYtYTBiNC00NmJlLWFmYjctZDQ2NjIyYzVjZGQxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Dogecoin price retracts as the wider crypto market corrects and traders choose to book profit.</p>\n                    <p><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) price is down today as the wider crypto market undergoes a sharp correction.</p><p>DOGE price has dropped over 5.5% over the last 24 hours to an intraday low of $0.1712 on April 3, underperforming the crypto market, which fell by around 0.17% in the same period. The memecoin’s price followed a correction in Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) that has witnessed nearly a 7.7% retreat in the last two days.</p><p>Let’s take a closer look at the most likely reasons behind Dogecoin’s latest pullback.</p><p><a href=\"https://cointelegraph.com/news/why-is-dogecoin-doge-price-down-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-04-03T22:44:00.000Z",
    "title": "Bitcoin ($BTC) Price Hitting $100,000 ‘Inevitable’ This Year, Analyst Predicts",
    "url": "https://www.cryptoglobe.com/latest/2024/04/bitcoin-btc-price-hitting-100000-inevitable-this-year-analyst-predicts/",
    "description": "A popular quantitative cryptocurrency analyst, known for his Stock-to-Flow model, has recently revealed he believes it’s “inevitable” the price of Bitcoin reaches the $100,000 mark this year, and predicted BTC will trade above $200,000 over the coming bull market cycle, and could potentially exceed the $1 million mark. In a recently published video on the […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-04-03T23:00:52.000Z",
    "title": "Bitcoin Cash Undergoes Halving Event, Sets Stage for May Upgrade",
    "url": "https://news.bitcoin.com/bitcoin-cash-undergoes-halving-event-sets-stage-for-may-upgrade/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/04/bchhalving-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Cash Undergoes Halving Event, Sets Stage for May Upgrade\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/04/bchhalving-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/bchhalving-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/bchhalving-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/bchhalving-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/bchhalving-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/bchhalving-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/bchhalving.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Bitcoin Cash network has witnessed its halving event at block height 840,000, leading to a reduction in the miner reward to 3.125 coins per block from the previous 6.25 coins. Miner Rewards Halved on Bitcoin Cash Network The latest block data reveals that the Bitcoin Cash (BCH) network has undergone its anticipated reward-halving event. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-03T23:02:12.000Z",
    "title": "Gurbir Grewal Reflected About Efforts of Compliance of Crypto-Industry.",
    "url": "https://www.cryptopolitan.com/gurbir-grewal-compliance-of-crypto-industry/",
    "description": "Gurbir Grewal, in a recent address at the annual &#8220;SEC Speaks&#8221; conference that was held by the U.S. Securities and Exchange Commission (SEC), emphasized the deficiencies of the current cryptocurrency industry&#8217;s procedures for implementing compliance. Stating at the event which is conducted by the Practicing Law Institute over two days, he voiced his regards to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-03T23:00:23.000Z",
    "title": "Bitcoin Meteoric Rise: Analyst Predicts $90,000 Milestone In April",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-meteoric-rise-analyst-predicts-90000-milestone-in-april/",
    "description": "Amid the bearish pressure witnessed in the price of Bitcoin, Captain Faibik, a popular cryptocurrency analyst and trader, has identified the potential for a significant rebound that could send BTC to an unprecedented level before the end of April. Bitcoin Might Be Poised For New Peak This Month Bitcoin is presently exhibiting a downward pressure on low timeframes, falling to the $65,000 price level after briefly touching $71,000 on Monday. Despite the adverse price action, Captain Faibik is confident there will be an uptick in the price of BTC this month. Related Reading: Bitcoin Weekly Range Breakout Signals Potential Upsurge: Analyst Captain Faibik&#8217;s analysis emphasizes Bitcoin&#8217;s bullish pennant formation on the 12-hour timeframe chart. According to the crypto expert, an upside breakout is anticipated later this week. Should there be a successful breakout, as anticipated by the expert, Bitcoin might be poised to reach a new all-time high. As a result, Captain Faibik has set his price target around the $88,000 and $90,000 threshold this month. The post read: BTC Bullish pennant formation on the 12hrs timeframe Chart. Expecting an upside Breakout later this Week. In case of a Successful Breakout, Bitcoin might hit $88,000-$90,000 this month. The expert has also confirmed that the bullish pennant developed on the daily timeframe chart. Thus, the analyst is optimistic that the breakout will materialize soon. The analyst has also identified some buying pressure on low timeframes, triggering momentum for the crypto asset. &#8220;BTC Bulls are defending the 4-hour Exponential Moving Average (EMA) 200 around $65,600 and bullish pennant also in play,&#8221; he stated. However, for the Bitcoin bulls to regain momentum, they must reclaim the critical resistance level of $70,000. This suggests the bulls still have more work to do to reach the resistance level. Currently, Bitcoin is trading at $66,125, with a decline of over 5% in the past 7 days. Its trading volume has plummeted by nearly 9% in the past day, while its market cap is slightly up by 0.81%. Possible Correction On The Downtrend While Faibik anticipates a recovery, some analysts are pessimistic about the asset&#8217;s movement and express worries about a potential pullback. One of the crypto experts who predicted a further correction in BTC is The Fomo Factory. Related Reading: Bitcoin Flash Crash Washes Out 81,000 Crypto Traders For Over $220 Million The expert discussed possible outcomes and provided several worrying price targets for the coin. According to the analyst, Bitcoin could drop to $60,000, representing strong support, and to the $52,000 and $56,000 Fibonacci retracement line. The analyst further cautions against discounting a more significant retrace to the $48,000 and $42,000 region. This prediction casts a shady ground for the largest cryptocurrency asset as the Bitcoin halving event approaches. However, given the previous impact on the coin&#8217;s price, there is hope for a rally in the short term. Featured image from iStock, chart from Tradingview.com"
  }
]