[
  {
    "source": "Decrypt",
    "date": "2023-12-26T16:01:02.000Z",
    "title": "Biggest Crypto Exploits and Hacks of 2023",
    "url": "https://decrypt.co/210802/biggest-crypto-hacks-of-2023",
    "description": "Hackers made away with a lot of cash in 2023. But not as much as last year."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-26T16:00:43.000Z",
    "title": "Grayscale filing reveals board reshuffle as Barry Silbert exits",
    "url": "https://cryptoslate.com/grayscale-filing-reveals-board-reshuffle-as-barry-silbert-exits/",
    "description": "<p>Key figures at Grayscale, including chairman Barry Silbert and Mark Murphy, president of its parent company Digital Currency Group (DCG), will step down from their board positions effective Jan. 1, 2024, according to a Dec. 26 8-K filing with the United States Securities and Exchange Commission (SEC). Mark Shifke, DCG&#8217;s chief financial officer, will replace [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/grayscale-filing-reveals-board-reshuffle-as-barry-silbert-exits/\">Grayscale filing reveals board reshuffle as Barry Silbert exits</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-26T15:54:01.000Z",
    "title": "Could Litecoin (LTC) and Chainlink (LINK) Market Resilience Make Them Safest Bets Over Ethereum in 2024?",
    "url": "https://cryptodaily.co.uk/2023/12/could-litecoin-ltc-and-chainlink-link-market-resilience-make-them-safest-bets-over-ethereum-in-2024",
    "description": "Explore the latest $24.2 billion crypto market surge: uncover Ethereum's (ETH) key price movements, Litecoin's (LTC) remarkable resilience, and Chainlink's (LINK) strategic dynamics. Get in-depth technical analysis and future predictions for these top cryptocurrencies, including factors driving market trends and investor sentiment. Stay informed and ahead in the dynamic world of cryptocurrency – click for expert insights now!"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T15:53:06.000Z",
    "title": "Why experts have lost all hope for Eurozone’s economy",
    "url": "https://www.cryptopolitan.com/experts-have-lost-hope-for-eurozones-economy/",
    "description": "In the complex tapestry of global economics, the Eurozone has often been a region of both promise and peril. Recent forecasts, however, paint a grim picture, causing experts to question whether there’s any hope left for the Eurozone&#8217;s economy. Despite modest growth predictions and wages outpacing inflation, the overall outlook remains bleak, clouded by a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T15:48:15.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here’s a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T15:46:52.000Z",
    "title": "Will UK ever succeed in matching Germany’s GDP?",
    "url": "https://www.cryptopolitan.com/will-uk-succeed-in-matching-germanys-gdp/",
    "description": "The United Kingdom, often seen as Europe&#8217;s financial powerhouse, is on an ambitious journey to narrow the economic gap with Germany. According to forecasts by the Centre for Economics and Business Research, the UK is set to maintain its position as the world’s sixth-largest economy, potentially reducing the disparity with Germany. But is this goal [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T15:42:16.000Z",
    "title": "Unveiling the Titans: 10 Powerhouses Shaping the AI Hardware Revolution",
    "url": "https://www.cryptopolitan.com/10-powerhouses-shaping-the-ai-hardware/",
    "description": "In the dynamic world of artificial intelligence (AI), a select group of individuals stands at the forefront, steering the course of innovation in hardware development. As the global demand for graphics-processing units (GPUs) persists, these influencers are propelling companies and ventures into the AI frontier. Here&#8217;s an exclusive look at the top 10 minds driving [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-26T15:43:50.000Z",
    "title": "DCG founder Barry Silbert steps down from Grayscale board",
    "url": "https://crypto.news/dcg-founder-barry-silbert-steps-down-from-grayscale-board/",
    "description": "The changes to Grayscale’s board were disclosed weeks before experts expect a spot Bitcoin ETF decision from the SEC. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-26T16:00:26.000Z",
    "title": "Shiba Inu Whale Moves $45 Million In SHIB, Bullish?",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-whale-moves-45-million-in-shib-bullish/",
    "description": "Amid the joyous mood of the festive season, the Ethereum-based meme coin, Shiba Inu has witnessed massive whale activity over the past 24 hours, causing speculation around the crypto community. Shiba Inu Sees Substantial Whale Activity A recent report revealed that a Shiba Inu whale has moved about 4 trillion SHIB tokens to an unidentified wallet. The whale activity came amidst the crypto asset&#8217;s price decline in tandem with the decline in the SHIB burn rate. Data from the on-chain tracker, Whale Alert, shows the unknown wallet 0x9c570088&#8230;a22fd8b51b move 4,239,147,213,294 SHIB to the unknown wallet address 0x72c3f4fc&#8230;fa8d75d719.  Related Reading: Shiba Inu Climbs 12% On Christmas Day – Brewing Bull Run Or False Dawn? The on-chain tracker reported that the whale transaction was valued at $45.12 Million as of the time the transfer was made. Despite the magnitude of this transaction, the gas fee used to initiate the transfer was significantly low. Shiba Inu appears to be experiencing substantial whale activity of this size lately. This marks the second time that such transactions have been carried out in the past few days. On Sunday, December 24, Whale Alert also reported another whale transaction carried out by an unknown wallet. The whale transaction saw a staggering 4.25 trillion SHIB being transferred to an unidentified wallet, according to the on-chain tracker. The data shows that the aforestated SHIB was sent to the unknown wallet address 0x9c570088…a22fd8b51b by the wallet address 0x3ce6bed2…87d896c59f. As of the time of the transaction, the 4.25 trillion SHIB was valued at a whopping $46 million. In just two days, over 8.4 trillion SHIB tokens have been moved between unknown wallet addresses. This has since sparked speculations within the Shiba Inu community about whether these transactions signify a bearish or a bullish move. Nonetheless, the transfer of SHIB between unidentified wallets during a price decline might suggest that traders are feeling more confident.  Shibarium Reaches Another Transaction Milestone Shiba Inu Layer 2 blockchain network Shibarium, has recently crossed a whopping 190 million in network transactions. This marks another major milestone for the project, indicating robust strength and activity within the ecosystem. Related Reading: Shiba Inu Eyes $0.00002 As Shibarium Marks Momentous Milestone According to data from Shibariumscan.io, the total number of completed transactions within the network is approximately 192,000,000. In addition, approximately 1,320,000 active addresses on the network contributed to this significant number of transactions. Furthermore, the Shibarium network&#8217;s daily transactions are currently sitting at about 7.53 million. Shibarium&#8217;s transaction volume has since increased from an average of 20,000 daily to over 7 million daily, putting the network in the limelight. Since it initially went past 7 million transactions daily over the past weeks, the blockchain has continued to maintain within that range. The rise in daily transactions demonstrates the meme coin&#8217;s quick growth and widespread adoption in the past few months. Currently, the price of Shiba Inu is down by 1% in the past 24 hours, trading at $0.00001067 as of the time of writing. Data from CoinMarketCap shows thatiIts trading volume is also down by 5%, currently sitting at $185.31 million. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-26T15:43:57.000Z",
    "title": "Filecoin vs. Google Cloud: Which Ensures Better Data Security?",
    "url": "https://www.crypto-news-flash.com/filecoin-vs-google-cloud-which-ensures-better-data-security/?utm_source=rss&utm_medium=rss&utm_campaign=filecoin-vs-google-cloud-which-ensures-better-data-security",
    "description": "<img width=\"1125\" height=\"637\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/04/Filecoin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/04/Filecoin.jpg 1125w, https://www.crypto-news-flash.com/wp-content/uploads/2021/04/Filecoin-300x170.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/04/Filecoin-1024x580.jpg 1024w\" sizes=\"(max-width: 1125px) 100vw, 1125px\" />Data storage options can vary from decentralized Filecoin offerings to Google Cloud centralized alternatives. While both have their positive and negative sides, the final choice is user-dependent. As businesses and individuals generate and handle vast amounts of data, choosing a storage solution becomes a critical decision. Two prominent contenders in the realm of data storage [...]"
  }
]