[
  {
    "source": "CryptoSlate",
    "date": "2023-06-07T09:36:04.000Z",
    "title": "US senators slam SEC’s Coinbase lawsuit, demand clearer crypto regulations",
    "url": "https://cryptoslate.com/us-senators-slam-secs-coinbase-lawsuit-demand-clearer-crypto-regulations/",
    "description": "<p>Two U.S. senators have criticized the Securities and Exchange Commission&#8217;s (SEC) lawsuit against the biggest American cryptocurrency exchange, Coinbase. On June 6, the SEC filed a lawsuit stating that Coinbase violated securities laws by operating as an unregistered broker, exchange, clearing agency, and offering unregistered securities via its Staking Program. The regulator also alleged that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/us-senators-slam-secs-coinbase-lawsuit-demand-clearer-crypto-regulations/\">US senators slam SEC&#8217;s Coinbase lawsuit, demand clearer crypto regulations</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-07T09:19:58.000Z",
    "title": "Bitcoin investors seem indifferent on potential Binance asset freeze",
    "url": "https://cryptoslate.com/insights/bitcoin-investors-seem-indifferent-on-potential-binance-asset-freeze/",
    "description": "<p>Quick Take Due to the news yesterday of the SEC requesting a restraining order to freeze Binance.US assets temporarily. Looking on-chain, customers don&#8217;t seem overly concerned, as we would expect an outpour of assets such as Bitcoin from Binance.US and even Binance.com, but it appears it was not the case. Only around $100 million of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-investors-seem-indifferent-on-potential-binance-asset-freeze/\">Bitcoin investors seem indifferent on potential Binance asset freeze</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-07T09:29:07.000Z",
    "title": "Shiba Inu (SHIB) Price Analysis",
    "url": "https://www.cryptoglobe.com/latest/2023/06/shiba-inu-shib-price-analysis/",
    "description": "This article provides a meta-analysis of the technical analysis available on Shiba Inu (SHIB) as of 6 June 2023. Shiba Inu (SHIB) is a meme coin created in 2020. It is one of the most popular cryptocurrencies in the world, with a market capitalization of over $10 billion. SHIB has been on a wild ride […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T09:34:13.000Z",
    "title": "How Intermediation Must Align with Decentralization, Security, and User Empowerment",
    "url": "https://www.cryptopolitan.com/overcome-problems-financial-intermediation/",
    "description": "In the ever-evolving finance landscape, the emergence of cryptocurrencies has sparked a revolutionary shift in how we perceive and engage with money. At the core of this digital financial revolution lies a fundamental challenge: the problem of intermediation.&#160; Cryptocurrencies, such as Bitcoin and Ethereum, aim to disrupt traditional financial systems by addressing the limitations and ... <a title=\"How Intermediation Must Align with Decentralization, Security, and User Empowerment\" class=\"read-more\" href=\"https://www.cryptopolitan.com/overcome-problems-financial-intermediation/\" aria-label=\"More on How Intermediation Must Align with Decentralization, Security, and User Empowerment\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T09:27:16.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T09:28:18.000Z",
    "title": "SEC vs Coinbase and new lawsuit: history of the years-long battle",
    "url": "https://crypto.news/sec-vs-coinbase-and-new-lawsuit-history-of-the-years-long-battle/",
    "description": "The conflict between the Coinbase exchange and the Securities and Exchange Commission (SEC) has garnered significant attention over the years. On June 6, the SEC filed a lawsuit against Coinbase, accusing the exchange of operating illegally by not registering with&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-07T09:34:07.000Z",
    "title": "Polygon (MATIC) Large Transactions Explode 742% Amid Latest SEC Attack",
    "url": "https://www.newsbtc.com/news/polygon-matic-large-transactions-explode-742-amid-latest-sec-attack/",
    "description": "Polygon (MATIC) recently experienced a sudden surge in large transactions. These sizable movements of funds on the network have caught the attention of market observers, prompting speculation about the motives and actions of cryptocurrency whales.  The catalyst behind this flurry of activity appears to be the recent lawsuit filed by the US Securities and Exchange Commission (SEC) against Binance and Coinbase.  As regulatory uncertainties loom over the industry, the surge in large transactions on Polygon has become a key indicator of the strategies employed by these investors. Related Reading: Shiba Inu Investors Go All-In: 338 Billion Token Accumulation Signals Bullish Cue Surge In Large Transactions On Polygon Network Raises Speculation  Large transactions within the cryptocurrency market are often viewed as indicative of whales&#8217; actions, serving as a glimpse into the strategies they are formulating. According to IntoTheBlock, an on-chain analytics firm, large transactions are defined as those exceeding $100,000. The firm reports a notable surge in the volume of large transactions on the Polygon network, reaching $64.44 million, which represents a staggering 742% increase within the last 24 hours. The surge in large transactions on Polygon occurs against the backdrop of a broader cryptocurrency market downturn. Following the SEC&#8217;s actions against the major crypto exchanges, most cryptocurrencies have experienced declines. As regulatory uncertainties loom over the industry, market sentiment has been dampened, leading to widespread selling pressure and a decline in prices across various digital assets. MATIC market cap currently at $7.4 billion. Chart: TradingView.com As of the time of writing, Polygon&#8217;s native token, MATIC, is trading at $0.804240, based on CoinGecko data. Over the past 24 hours, MATIC has witnessed a 2.8% decline, while the past seven days have seen a notable slump of 9.6%. Source: Coingecko These downward price movements align with the broader market trend, further emphasizing the challenges faced by cryptocurrency investors amidst the regulatory landscape. SEC Targets Coinbase Following Binance Lawsuit In a sequence of regulatory actions, the SEC has filed a lawsuit against Coinbase, a prominent cryptocurrency exchange headquartered in San Francisco. The legal action comes just a day after the regulator sued Binance, one of the world&#8217;s largest crypto exchanges, for alleged securities violations.  According to the SEC&#8217;s statement released on Tuesday, the regulatory body accuses Coinbase of unlawfully facilitating the buying and selling of crypto asset securities, generating billions of dollars in revenue since at least 2019. Related Reading: Pepecoin Frenzy Fades: How Meme Token’s Price, Market Cap Were Cut In Half Coinbase’s alleged failures deprive investors of critical protections, including rulebooks that prevent fraud and manipulation, proper disclosure, safeguards against conflicts of interest, and routine inspection by the SEC. https://t.co/FwpdmENvoL — Gary Gensler (@GaryGensler) June 6, 2023 The SEC&#8217;s lawsuit against Coinbase alleges various breaches of securities rules. SEC Chair Gary Gensler took to Twitter on Tuesday to assert that Coinbase&#8217;s alleged failures have deprived investors of vital protections, including rulebooks designed to prevent fraud and manipulation, adequate disclosure mechanisms, safeguards against conflicts of interest, and routine inspections conducted by the SEC. This latest development intensifies the regulatory scrutiny surrounding major cryptocurrency exchanges, adding to the ongoing challenges and uncertainties faced by the crypto industry. Featured image from BohatALA.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-07T09:11:37.000Z",
    "title": "CRYPTO SHOCK – Binance & Coinbase SUED by SEC – What’s Next?!?",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/crypto-shock-binance-and-coinbase-sued-by-sec-whats-next/",
    "description": "<p>$320 million losses in liquidation! Leading tokens ADA, MATIC, BNB, &#38; SOL have been accused of being securities. Hell broke loose on Monday when U.S. Securities and Exchange Commission SEC sued Binance for misusing customer funds and other 13 Securities violations. And it&#8217;s worsening as SEC sued Coinbase today. The lawsuit hurt Binance in a big [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/crypto-shock-binance-and-coinbase-sued-by-sec-whats-next/\">CRYPTO SHOCK &#8211; Binance &#038; Coinbase SUED by SEC &#8211; What&#8217;s Next?!?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-07T09:15:31.000Z",
    "title": "$59,470,000,000 in ETH Held by Massive Ethereum Whales, Shattering All-Time High: Santiment",
    "url": "https://dailyhodl.com/2023/06/07/largest-ethereum-whales-now-hold-all-time-high-of-59470000000-in-eth-according-to-analytics-firm-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/largest-whale-now-firm.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/largest-whale-now-firm.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/largest-whale-now-firm.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/largest-whale-now-firm.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/largest-whale-now-firm.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/largest-whale-now-firm.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/largest-whale-now-firm.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The largest non-exchange Ethereum (ETH) whales have been gobbling up the second-largest crypto asset throughout 2023, according to the crypto analytics firm Santiment. Santiment notes that the 10 largest non-exchange Ethereum addresses currently hold an all-time high of 31.8 million ETH, a total that is worth more than $59.6 billion at time of writing. Explains [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/07/largest-ethereum-whales-now-hold-all-time-high-of-59470000000-in-eth-according-to-analytics-firm-santiment/\">$59,470,000,000 in ETH Held by Massive Ethereum Whales, Shattering All-Time High: Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]