[
  {
    "source": "CoinDesk",
    "date": "2024-01-08T18:58:57.000Z",
    "title": "Protocol Village: Ta-da, AI Marketplace Based on 'Gamified Web3,' Raises $3.5M ",
    "url": "https://www.coindesk.com/tech/2024/01/04/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Jan. 4-10."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-08T18:42:35.000Z",
    "title": "SEC Chair Gary Gensler issues stark warning about crypto investing ahead of Bitcoin ETF decision",
    "url": "https://cryptoslate.com/sec-chair-gary-gensler-issues-stark-warning-about-crypto-investing-ahead-of-bitcoin-etf-decision/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) Chair Gary Gensler issued a cautionary advisory regarding crypto asset investments just ahead of the highly anticipated spot Bitcoin exchange-traded fund (ETF) approval deadline. In a Jan. 8 post on social media platform X (formerly Twitter), Gensler highlighted the risks of investing in cryptocurrencies, citing regulatory non-compliance, volatility, [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sec-chair-gary-gensler-issues-stark-warning-about-crypto-investing-ahead-of-bitcoin-etf-decision/\">SEC Chair Gary Gensler issues stark warning about crypto investing ahead of Bitcoin ETF decision</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-08T19:04:32.000Z",
    "title": "Ripple's (XRP) $56M Transfer Amid ETF Speculation: Is a Price Rally to $1 on the Horizon?",
    "url": "https://cryptodaily.co.uk/2024/01/ripples-xrp-56m-transfer-amid-etf-speculation-is-a-price-rally-to-1-on-the-horizon",
    "description": "Explore the latest developments in the cryptocurrency market with a focus on Ripple (XRP). Delve into Ripple's significant $56 million transaction, its impact on XRP's price, and the potential effects of US Bitcoin Spot ETF approvals and XRP ETF speculation. Understand Ripple's position in the evolving crypto landscape with insights into its technical analysis and price predictions."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-08T19:00:00.000Z",
    "title": "Solana drops below $90, new altcoin emerges as alternative",
    "url": "https://crypto.news/solana-drops-below-90-new-altcoin-emerges-as-alternative/",
    "description": "As Solana retraces, analysts are looking at Bitcoin Minetrix whose presale has raised over $7.8 million"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-08T19:00:31.000Z",
    "title": "A Bullish Beginning? $151 Million Poured Into Crypto Funds In 2024’s First Week",
    "url": "https://www.newsbtc.com/news/bullish-beginning-poured-into-crypto-funds-in-2024s-first-week/",
    "description": "The first week of 2024 marked a notable milestone in crypto asset investments. Investment products in this particular sector witnessed inflows amounting to $151 million, according to a recent report from CoinShares. Crypto Asset Funds Sees Surge In Inflows This $151 million surge in inflow, as highlighted by James Butterfill, Head of Research at CoinShares, is particularly noteworthy in light of the Grayscale vs. US Securities and Exchange Commission (SEC) lawsuit, with these inflows contributing to a total of $2.3 billion since the case began in October 2022. Related Reading: Crypto Funds Flourish In 2023: CoinShares Reports $2.2 Billion Inflow This amount accounts for 4.4% of the firm’s total managed assets. Even without a spot exchange-traded fund (ETF) launch in the US, Butterfill revealed that American exchanges contributed to over half of these inflows, at 55%. German and Swiss exchanges followed, contributing 21% and 17% of the inflows, respectively. Bitcoin emerged as the leader in investment inflows, amassing $113 million. This substantial sum equates to 3.2% of the total assets under management (AuM) in the last nine weeks. James Butterfill pointed out an interesting trend that challenges the anticipation of the US SEC approval of a spot Bitcoin ETF being a &#8220;buy the rumor, sell the news&#8221; event. Butterfill noted in the report: If many truly believed that launch of the [spot] ETF in the US would a “buy the rumour, sell the news” event, we surely would expect to see inflows into short-bitcoin ETPs, instead, outflows over the last 9 weeks have amounted to US$7m. Notably, this is because &#8220;buy the rumor, sell the news&#8221; implies that investors buy assets ahead of an anticipated event (like the spot ETF launch) and sell them when the actual event occurs, often leading to a price decline. However, the observation here by Butterfill is quite the opposite. Instead of seeing inflows (more investment) into short-Bitcoin exchange-traded products (ETPs) (which benefit from a decline in Bitcoin&#8217;s price), there have been outflows amounting to $7 million over the last nine weeks. This indicates that investors might not expect a significant price drop following the spot Bitcoin ETF launch in the US, contradicting the &#8220;buy the rumor, sell the news&#8221; expectation. Ethereum And Altcoins: A Mixed Bag Of Sentiments Ethereum&#8217;s performance in the crypto asset investment space has also been noteworthy. The second-largest crypto by market cap saw inflows of $29 million, with the last nine weeks bringing in $215 million. This influx indicates a significant shift in investor sentiment towards Ethereum. While Solana, on the other hand, faced outflows amounting to $5.3 million, Cardano, Avalanche, and Litecoin witnessed inflows. Cardano saw $3.7 million, Avalanche $2 million, and Litecoin $1.4 million in inflows. The blockchain equity sector also started the year on a strong note, recording inflows of $24 million in the past week. Despite Bitcoin&#8217;s dominance in inflows, the flagship crypto has recently experienced a net outflow of $32.8 million, with short Bitcoin investment products also seeing a minor outflow last month. However, Bitcoin&#8217;s recent $113 million inflow has shown the asset&#8217;s move to rebound. Even in price performance, Bitcoin has increased by 5.2% over the past week and appears to be continuing its upward trajectory by 1.1% in the first 24 hours, with its trading price nearing the $45,000 mark. Contrastingly, Ethereum, after a 2% decline over the past week, is showing signs of recovery, increasing by nearly 1% in the past day. Other altcoins such as Solana, Cardano, Avalanche, and Litecoin have been less fortunate, experiencing significant losses, with Avalanche and Cardano being the top losers, down by 27.3% and 17% in the past week. Related Reading: Crypto Funds’ 11-Week Inflow Streak Snapped: Bitcoin Faces $33M Exodus As Altcoins Shine Litecoin and Solana, though also in the red, have seen slightly lesser declines. Solana is down by 10% over the past week and 1.6% in the past 24 hours, while Litecoin mirrors this trend, down by 10.8% over the week and 0.4% in the last day. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-08T19:05:06.000Z",
    "title": "Bloomberg Analyst Mike McGlone Issues Bitcoin Warning, Says ETF Hype Feels Like Previous Price Tops",
    "url": "https://dailyhodl.com/2024/01/08/bloomberg-analyst-mike-mcglone-issues-bitcoin-warning-says-etf-hype-feels-like-previous-price-tops/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/BTC-in-the-Second-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/BTC-in-the-Second-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/BTC-in-the-Second-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/BTC-in-the-Second-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/BTC-in-the-Second-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/BTC-in-the-Second-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/BTC-in-the-Second-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bloomberg Intelligence’s senior macro strategist Mike McGlone is warning that Bitcoin (BTC) is topping out and about to undergo a market correction. In a new discussion with crypto influencer Scott Melker, McGlone predicts that Bitcoin will start to decline after a months-long rally leading up to the possible approval of a spot Bitcoin exchange-traded fund [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/08/bloomberg-analyst-mike-mcglone-issues-bitcoin-warning-says-etf-hype-feels-like-previous-price-tops/\">Bloomberg Analyst Mike McGlone Issues Bitcoin Warning, Says ETF Hype Feels Like Previous Price Tops</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]