[
  {
    "source": "Cointelegraph",
    "date": "2024-02-12T11:57:12.000Z",
    "title": " Google invests 25 million euros to enhance AI skills for Europeans  ",
    "url": "https://cointelegraph.com/news/google-invests-25-million-ai-skills-europeans",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMDFjYmFkYjEtNzgzNi00OWQwLThiMDMtZThhMTUxOWY1NjE3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Google launched the “AI Opportunity Initiative for Europe” to provide skill training to Europeans in the field of AI.  </p>\n                    <p><p data-ct-non-breakable=\"true\">Google announced plans to launch a support fund of 25 million euros ($26.9 million) to help support skill training for Europeans in the field of artificial intelligence (AI). </p><p>The AI Opportunity Initiative for Europe aims to help provide such training, so people can “seize the opportunity of AI” in a moment where the continent is poised to “lead the way” in harnessing AI for economic reasons. </p><p data-ct-non-breakable=\"true\">The tech developer said as a part of this initiative it is working alongside EU governments, civil society, academics and businesses to provide “advanced” AI training to local startups, with a particular focus on vulnerable communities. </p><p><a href=\"https://cointelegraph.com/news/google-invests-25-million-ai-skills-europeans\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-12T11:50:39.000Z",
    "title": "Short-term Bitcoin holders send over $4B in profit to exchanges",
    "url": "https://cryptoslate.com/insights/short-term-bitcoin-holders-send-over-4b-in-profit-to-exchanges/",
    "description": "<p>Quick Take Recent data analysis has uncovered fascinating patterns in the behavior of short-term Bitcoin holders—investors who have held their Bitcoin for less than 155 days. This cohort, known for its propensity towards speculation, has been shown to influence Bitcoin&#8217;s market conditions significantly. The launch of the Bitcoin ETF on Jan. 11 marked a period [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/short-term-bitcoin-holders-send-over-4b-in-profit-to-exchanges/\">Short-term Bitcoin holders send over $4B in profit to exchanges</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-12T12:06:45.000Z",
    "title": "South Korea crypto traders cleared in $3.2B arbitrage case",
    "url": "https://www.cryptopolitan.com/south-korean-crypto-traders-cleared-in-3-2b/",
    "description": "South Korea authorities have acquitted a group of cryptocurrency traders previously accused of exploiting the &#8220;Kimchi premium&#8221; by conducting arbitrage between local and overseas exchanges. The traders were alleged to have capitalized on the price discrepancies to amass profits estimated at $3.2 billion. This ruling has sparked discussions on the regulatory framework surrounding cryptocurrency trading [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-12T12:00:00.000Z",
    "title": "Upcoming Bull Market: 5 AI Low Cap Gems Set to Succeed",
    "url": "https://www.cryptopolitan.com/upcoming-bull-market-5-ai-low-cap-gems-set-to-succeed/",
    "description": "This is the time many investors and the crypto community at large have been waiting for. Yes, the Bull market is here. It is the time when most people are looking for the best assets to buy. Therefore, the question lingers: now that the bulls are running free, what should investors do?&#160; This is the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-12T11:52:06.000Z",
    "title": "Avalanche and Dogecoin investors monitoring Pushd presale",
    "url": "https://crypto.news/avalanche-and-dogecoin-investors-monitoring-pushd-presale/",
    "description": "The Pushd presale is in progress, attracting DOGE and AVAX holders"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-12T11:51:16.000Z",
    "title": "Circle’s IPO to make waves in stablecoin market",
    "url": "https://crypto.news/circles-ipo-to-make-waves-in-stablecoin-market/",
    "description": "Amid a 35% market cap decline since early 2023, how could Circle&#8217;s IPO recalibrate its market position and affect the broader crypto ecosystem? In a move towards regaining the lost market share, Circle Internet Financial, the company behind USD Coin&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-12T11:44:25.000Z",
    "title": "MEXC reportedly cracks down on users from China with no KYC",
    "url": "https://crypto.news/mexc-reportedly-cracks-down-on-users-from-china-with-no-kyc/",
    "description": "Crypto exchange MEXC has reportedly initiated a crackdown on unverified users suspected to be from mainland China. According to Chinese blockchain journalist Colin Wu, citing sources within the local crypto community, MEXC has begun imposing restrictions on accounts of users&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-12T11:43:16.000Z",
    "title": "Avalanche and Uniswap bullish, Everlodge lists on tier-1 exchange",
    "url": "https://crypto.news/avalanche-and-uniswap-bullish-everlodge-lists-on-tier-1-exchange/",
    "description": "Everlodge set to list on Uniswap. Meanwhile, AVAX and UNI prices are on an uptrend"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-12T11:42:15.000Z",
    "title": "Ethereum NFT volume approaches yearly high, following gas price surge",
    "url": "https://crypto.news/ethereum-nft-volume-approaches-yearly-high-following-gas-price-surge/",
    "description": "Non-fungible token (NFT) trading volumes on the Ethereum network have reached their highest levels in almost a year. NFT trading volumes have been at their highest weekly level since Feb. 26, 2023, according to the latest data from CryptoSlam. The&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-12T11:40:38.000Z",
    "title": "Philippine central bank to introduce CBDC without blockchain technology",
    "url": "https://crypto.news/philippine-central-bank-to-introduce-cbdc-without-blockchain-technology/",
    "description": "The Philippines is advancing towards the introduction of a non-blockchain central bank digital currency (CBDC) within the upcoming two years, according to the Governor of Bangko Sentral ng Pilipinas (BSP), Eli Remolona. The initiative, unveiled on Feb. 12, follows global&#8230;"
  }
]