[
  {
    "source": "Bitcoin.com",
    "date": "2023-07-24T05:00:01.000Z",
    "title": "LBank Labs and Seoul Metropolitan Government to Drive Blockchain Innovation at Seoul Web3 Festival",
    "url": "https://news.bitcoin.com/lbank-labs-and-seoul-metropolitan-government-to-drive-blockchain-innovation-at-seoul-web3-festival/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/8005eb5f-a81c-46d2-b2cd-6982304075a3-768x432.jpeg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/8005eb5f-a81c-46d2-b2cd-6982304075a3-300x169.jpeg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/8005eb5f-a81c-46d2-b2cd-6982304075a3-1024x576.jpeg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/8005eb5f-a81c-46d2-b2cd-6982304075a3-768x432.jpeg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/8005eb5f-a81c-46d2-b2cd-6982304075a3-190x107.jpeg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/8005eb5f-a81c-46d2-b2cd-6982304075a3-380x214.jpeg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/8005eb5f-a81c-46d2-b2cd-6982304075a3-760x428.jpeg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/8005eb5f-a81c-46d2-b2cd-6982304075a3.jpeg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. LBank Labs is delighted to announce its collaboration with the Seoul Metropolitan Government in hosting the highly anticipated Seoul Web3 Festival 2023 (SWF 2023) in late July. With the participation of prominent figures from the blockchain and Web3 industry, the event promises to be a momentous occasion for numerous Web3 companies to converge, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-24T04:52:37.000Z",
    "title": "Ethereum Price Hints At Potential Short-term Downtrend, Sell Rallies?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-downtrend-1900/",
    "description": "Ethereum price is struggling to clear the $1,900 resistance against the US Dollar. ETH could gain bearish momentum if there is a close below $1,850. Ethereum is showing bearish signs below the $1,920 level. The price is trading below $1,900 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance near $1,900 on the hourly chart of ETH/USD (data feed via Kraken). The pair could decline steadily if the price remains below $1,900. Ethereum Price Remains At Risk Ethereum’s price made another attempt to settle above the $1,900 level. However, ETH failed to gain bullish momentum above the $1,900 resistance and started a fresh decline, similar to Bitcoin. The price declined below the $1,885 and $1,875 levels. The bulls are now active above the $1,860 level. A low is formed near $1,863 and the price is now consolidating losses. There is also a key bearish trend line forming with resistance near $1,900 on the hourly chart of ETH/USD. Ether is trading below $1,900 and the 100-hourly Simple Moving Average. On the upside, immediate resistance is near the $1,885 level. It is close to the 50% Fib retracement level recent drop from the $1,903 swing high to the $1,863 low. The first major resistance is near the $1,890 level or the 100-hourly Simple Moving Average. It is close to the 61.8% Fib retracement level recent drop from the $1,903 swing high to the $1,863 low. Source: ETHUSD on TradingView.com The next major resistance is near the $1,900 level and the trend line, above which the price could test the main resistance at $1,920. Any more gains could send Ether toward the $2,000 resistance in the near term. More Losses in ETH? If Ethereum fails to clear the $1,900 resistance, it could continue to move down. Initial support on the downside is near the $1,865 level. The first major support is near the $1,850 level, below which the price might gain bearish momentum. The next major support is near the $1,825 support level. A close below $1,825 could spark sharp bearish moves toward the $1,720 level. Any more losses could open the doors for a move toward the $1,650 support level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,850 Major Resistance Level – $1,900"
  }
]