[
  {
    "source": "CoinDesk",
    "date": "2023-06-07T10:41:24.000Z",
    "title": "Crypto Tokens' Status as Securities or Commodities Is Key to SEC's Binance, Coinbase Suits: Bernstein",
    "url": "https://www.coindesk.com/policy/2023/06/07/crypto-tokens-status-as-securities-or-commodities-is-key-to-secs-binance-coinbase-suits-bernstein/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto regulation has become a political debate and a turf battle between the SEC and the CFTC, the report said."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-07T10:50:11.000Z",
    "title": "US Court Gives SEC One Week to Respond to Coinbase’s Rulemaking Petition",
    "url": "https://decrypt.co/143673/us-court-gives-sec-one-week-to-respond-to-coinbases-rulemaking-petition",
    "description": "The U.S. Court of Appeals for the Third Circuit has given the SEC seven days to clarify its position on a rulemaking petition from Coinbase."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-07T10:52:38.000Z",
    "title": "SEC lawsuit against Binance and Coinbase unifies the crypto industry",
    "url": "https://cointelegraph.com/news/sec-lawsuit-binance-coinbase-crypto-industry-comments",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/eb19dc2e-d320-4490-8a1b-0f126e26f792.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchain Association CEO Kristin Smith said that while the SEC's approach to regulation is expected due to its anti-crypto stance, it’s still \"unacceptable.\" </p>\n                    <p><p>Professionals from various parts of the crypto sector have responded to the United States Securities and Exchange Commission’s (SEC) recent actions against some of the biggest crypto exchanges, Binance and Coinbase. </p><p>On June 5, the SEC <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">filed a lawsuit against Binance</a> for allegedly offering unregistered securities. Only a day after filing the Binance suit, the commission also <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">went after Coinbase</a> on somewhat similar grounds, alleging that popular cryptocurrencies offered by the exchange, like Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>), Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) and The Sandbox (<a href=\"https://cointelegraph.com/the-sandbox-sand-price-index\">SAND</a>), qualify as securities. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today we charged Binance Holdings Ltd. (Binance); U.S.-based affiliate, BAM Trading Services Inc., which, together with Binance, operates <a href=\"https://t.co/swcxioZKVP\">https://t.co/swcxioZKVP</a>; and their founder, Changpeng Zhao, with a variety of securities law violations.<a href=\"https://t.co/H1wgGgR5ir\">https://t.co/H1wgGgR5ir</a> <a href=\"https://t.co/IWTb7Et86H\">pic.twitter.com/IWTb7Et86H</a></p>&mdash; U.S. Securities and Exchange Commission (@SECGov) <a href=\"https://twitter.com/SECGov/status/1665779371108335618?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Cointelegraph reached out to various players working within the space to see their responses to the recent actions made by the SEC. From sharing their belief that it will drive crypto companies away from the U.S. to simply calling the SEC’s actions lazy, industry players shared their thoughts on the latest topic hounding the space.</p><h2>An ‘unacceptable’ approach to regulation</h2><p>According to Kristin Smith, the CEO of the Blockchain Association, while the SEC’s actions are expected, it’s still unacceptable. Smith explained that: </p><blockquote>“The SEC doesn’t make the law. Indeed, this approach to regulation is unacceptable – but it is what we have come to expect from the SEC and its anti-crypto stance.”</blockquote><p>In addition, the executive highlighted that while the industry and the U.S. Congress are working to develop effective regulation, the SEC “continues to distract from substantive policy efforts.” The executive believes that by listing assets in this way, the SEC is trying to circumvent formal rulemaking processes and denying public engagement.</p><p>Meanwhile, Paolo Ardoino, the chief technology officer of stablecoin issuer Tether believes that companies’ complaints against the SEC should be listened to. According to Ardoino, the uncertainty of rules and guidance in the U.S. is becoming a common theme, even among the biggest supporters of crypto in the country. </p><p>Turbos Finance CEO Ted Shao also echoed Smith’s sentiment. According to Shao, this is “not the direction Web3 developers want to see.” The executive believes that the SEC showed that it’s against the whole Web3 space as they are also coming after top projects and not just <a href=\"https://cointelegraph.com/explained/centralized-cryptocurrency-exchanges-explained\">centralized exchanges (CEXs)</a>. </p><h2>Driving crypto players abroad and weakening consumer confidence</h2><p>In addition to the SEC’s actions being unacceptable, other professionals working in the space believe that the effects of this recent move include pushing crypto players to more crypto-friendly jurisdictions and weakening consumer confidence in crypto within the US. </p><p>Insider Intelligence crypto analyst Will Paige said that the recent suits highlight that the SEC intends to police the space through enforcement in the absence of a regulatory framework. According to Paige, this could potentially knock down the “already weak consumer confidence in cryptocurrencies” in the country. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e00228a7-257f-463e-895a-e9164f42e728.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto ownership data from 2020-2023 and projection for 2024. Source: Insider Intelligence</em></figcaption></figure><p>Ben Caselin, the chief strategy officer at crypto exchange MaskEX, believes that while this is a case against Binance, it may have implications for other players in the US. The <a href=\"https://cointelegraph.com/news/aax-exec-leaves-the-crypto-exchange-amid-ongoing-operational-halt\">former AAX executive</a> explained that this can “open up more opportunities for other jurisdictions such as Hong Kong, Dubai or even El Salvador to drive innovation and attract capital and talent.”</p><p>Oscar Franklin Tan, the chief legal officer of <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world#:~:text=NFTs%20refer%20to%20nonfungible%20tokens,based%20video%20games%20and%20video.\">nonfungible token (NFT)</a> protocol Enjin, agrees with the sentiment. According to Tan, the world will not wait for the US to make up its mind on crypto. Tan explained: </p><blockquote>“The SEC actions only drive talent and innovation out of the US, to countries with clearer rules that support responsible builders. Singapore in 2020 stated it does not follow the US Howey Test. Japan has a clear self-regulatory framework for exchanges.”</blockquote><p>The executive believes that “progressive countries” will reap the benefits, especially now that explosions in artificial intelligence and extended reality are highlighting the need for blockchain and genuine digital ownership.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/us-financial-services-committee-sets-date-to-discuss-future-of-crypto\"><strong><em>US Financial Services Committee sets date to discuss future of crypto</em></strong></a></p><h2>Doubts cast on SEC’s fairness and motivations</h2><p>While others expressed their beliefs on the potential effect of the SEC’s lawsuit against Binance and Coinbase, other crypto professionals explored the motivation and fairness of the SEC’s move. </p><p>According to David Schwed, the chief operating officer of Blockchain security firm Halborn, the mandate of the SEC is to ensure the safeguarding of investors. Schwed believes that this can be done through clear regulations and not through enforcement actions. The executive added that SEC chair Gary Gensler’s motivations may be skewed. “It seems to me that his personal ambitions and the need to validate his stance have now superseded his core mandate,” he explained.</p><p>Alex Strześniewski, the founder of the <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> protocol AngelBlock, described the SEC’s actions as “lazy.” The executive believes that it does not drive proper regulation forward. He explained: </p><blockquote>“It’s like a school teacher berating you for giving the wrong answers but failing to give any explanation beyond that. I also don’t believe that the SEC does, in fact, have jurisdiction over everything they’re claiming to.”</blockquote><p>Meanwhile, Tim Shan, the chief operating officer at <a href=\"https://cointelegraph.com/learn/what-are-decentralized-exchanges-and-how-do-dexs-work\">decentralized exchange (DEX)</a> Dexalot expressed mixed feelings about the lawsuits and said that the SEC’s actions are unfair to the community. </p><p>“They’ve provided very little clarity or guidance to the crypto community. They are regulating through the courts, which is really quite unfair and not the right way to regulate/govern,” he said.  </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-07T10:48:22.000Z",
    "title": "Binance US users withdraw $78M amid SEC lawsuit and asset freeze concerns",
    "url": "https://cryptoslate.com/binance-us-users-withdraw-78m-amid-sec-lawsuit-and-asset-freeze-concerns/",
    "description": "<p>Crypto traders using Binance US withdrew $78.48 million on June 7 from the embattled platform, according to DeFillama data, despite assurances that their funds were safe. The total value of tokens held by Binance.US on the Ethereum chain is reportedly $321 million indicating the outflows amounted to around 24% of the current TVL. The data [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-us-users-withdraw-78m-amid-sec-lawsuit-and-asset-freeze-concerns/\">Binance US users withdraw $78M amid SEC lawsuit and asset freeze concerns</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-07T10:41:00.000Z",
    "title": "Proof of Talk 2023:  2 Days to Restore Trust in Web3 and  Design the Future of the Industry",
    "url": "https://www.cryptoglobe.com/latest/2023/06/proof-of-talk-2023-2-days-to-restore-trust-in-web3-and-design-the-future-of-the-industry/",
    "description": "On June 14th and 15th, Web3 industry leaders will gather in Paris to set a roadmap for the future of the ecosystem. An ambitious program to address all sides of the conversation, from VC in crypto and adapting to a bear market to institutional adoption to get to the next trillion in and the role […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-07T10:44:00.000Z",
    "title": "Louis Vuitton To Debut New NFT Collection For Top Customers",
    "url": "https://cryptodaily.co.uk/2023/06/louis-vuitton-to-debut-new-nft-collection-for-top-customers",
    "description": "<p>French luxury fashion house Louis Vuitton has announced that it will be launching a new physical-linked NFT collection called Treasure Trunks.</p>\n<p>The collection is the first in a series of projects by the luxury brand that look to offer the brand&rsquo;s elite clientele with exclusive perks and experiences.</p>\nThe Treasure Trunks Collection\n<p>The collection will consist of a few hundred NFTs, with each Treasure Trunk NFT coming with a matching made-to-order Louis Vuitton trunk. A Louis Vuitton trunk sells for tens of thousands of dollars. The collection will open for registration on the 8th of June, 2023. It will only be available to consumers who are based in the United States of America, France, Canada, the United Kingdom, Japan, Australia, and Germany.</p>\n<p>Select customers will be able to purchase the NFTs from the 16th of June onwards, with each NFT priced at $42,000. Treasure Trunk NFT holders will also receive a physical replica of their Treasure Trunk. This will unlock exclusive access to upcoming Louis Vuitton products and exclusive immersive events. The luxury brand also plans to release further limited-edition experiences and products regularly.</p>\nPart Of A Larger Project\n<p>The collection is part of a larger initiative by Louis Vuitton called Via, from the Latin word for road. Treasure Trunk NFT owners can also purchase digital keys and gain access to future Louis Vuitton NFT collections. Furthermore, the Treasure Trunk NFTs and future NFTs will be sold as soulbound tokens. This means holders will not be able to transfer them to others once they have been purchased. Holders will also not be able to sell their Treasure Trunks.</p>\nLouis Vuitton&rsquo;s Foray Into Blockchain And NFTs\n<p>The luxury brand has been expanding its presence in the blockchain ecosystem for several years. In 2019, its parent entity, LVMH, announced plans to roll out the Aura blockchain to help with the tracking of luxury goods. In 2021, Louis Vuitton announced a partnership with fellow luxury brands Prada and Cartier to create the Aura Blockchain Consortium. The primary aim of this consortium was to crack down on counterfeit products. It also released a free-to-play game called &ldquo;Louis The Game,&rdquo; offering players the chance to win 30 NFTs to celebrate the brand&rsquo;s 200th birthday.</p>\n<p>Several other brands have also looked at experimenting with NFTs and blockchain. Balmain has been developing an NFT-backed club exclusively for its niche customers. Another brand, Ralph Lauren, is hosting exclusive events for Web3-initiated customers.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T11:00:44.000Z",
    "title": "Investors are Going Big on XRP, MATIC and TOADS As the Market Shows Bullish Signs",
    "url": "https://www.crypto-news-flash.com/investors-are-going-big-on-xrp-matic-and-toads-as-the-market-shows-bullish-signs/?utm_source=rss&utm_medium=rss&utm_campaign=investors-are-going-big-on-xrp-matic-and-toads-as-the-market-shows-bullish-signs",
    "description": "<p>DigiToads (TOADS) is becoming investors&#8217; favorite crypto of 2023 with 450x profit returns potential by the end of the year. With the crypto industry constantly evolving, this digital investment world never fails to introduce new and exciting investment opportunities for investors. DigiToads, as a result, is one such high-potential meme coin that is gaining momentum [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/investors-are-going-big-on-xrp-matic-and-toads-as-the-market-shows-bullish-signs/\">Investors are Going Big on XRP, MATIC and TOADS As the Market Shows Bullish Signs</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-07T11:01:00.000Z",
    "title": "FET Price Struggles Amid Bearish Sentiment: Will Bulls Overcome Resistance?",
    "url": "https://coinedition.com/fet-price-struggles-amid-bearish-sentiment-will-bulls-overcome-resistance/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/FET_Price_Struggles_Amid_Bearish_Sentiment_Will_Bulls_Overcome_Resistance-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/FET_Price_Struggles_Amid_Bearish_Sentiment_Will_Bulls_Overcome_Resistance-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/FET_Price_Struggles_Amid_Bearish_Sentiment_Will_Bulls_Overcome_Resistance-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/FET_Price_Struggles_Amid_Bearish_Sentiment_Will_Bulls_Overcome_Resistance.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Despite a bearish start that saw the Fetch.ai (FET) price fall to a 24-hour low of $0.234, bulls reclaimed market dominance and pushed the price to an intra-day high of $0.2513. The bulls&#8217; attempts to retake market control were admirable, but the resistance around $0.2513 was too much for them to overcome. Consequently, as of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/fet-price-struggles-amid-bearish-sentiment-will-bulls-overcome-resistance/\">FET Price Struggles Amid Bearish Sentiment: Will Bulls Overcome Resistance?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-07T10:45:14.000Z",
    "title": "Terra (LUNA) Price Prediction 2023-2030: Will LUNA Price Hit $3 Soon?",
    "url": "https://coinedition.com/terra-luna-price-prediction/",
    "description": "<img width=\"150\" height=\"150\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Terra-LUNA-Price-Prediction-150x150.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Terra (LUNA) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" /><p>Bullish LUNA price prediction ranges from $0.300 to $3.00. Analysis suggests that the LUNA price might reach above $2.5446. The LUNA bearish market price prediction for 2023 is $0.3180. Terra is an open-sourced blockchain project supporting decentralized applications (DApps) development. Its native token is called LUNA.&#160; Terra investors are bullish on the token, although the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/terra-luna-price-prediction/\">Terra (LUNA) Price Prediction 2023-2030: Will LUNA Price Hit $3 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-06-07T10:45:26.000Z",
    "title": "What is GoCrypto (GOC)?",
    "url": "https://blog.bitfinex.com/education/what-is-gocrypto-goc/",
    "description": "<p>GoCrypto is a multi-payment processor and infrastructure provider with the objective towards making it extremely simple for merchants to accept multiple types of traditional and crypto asset payment methods. GoCrypto works for bricks and mortar retail locations just as smoothly as it does for online...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/education/what-is-gocrypto-goc/\">What is GoCrypto (GOC)?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]