[
  {
    "source": "CoinDesk",
    "date": "2023-09-01T13:42:44.000Z",
    "title": "Robinhood to Buy Back Sam Bankman-Fried's Stake for $605.7M",
    "url": "https://www.coindesk.com/business/2023/09/01/robinhood-to-buy-back-sam-bankman-frieds-6057m-stock/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The 55 million HOOD shares owned by Bankman-Fried and fellow FTX co-founder Gary Wang through Emergent Fidelity Technologies."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-01T13:45:51.000Z",
    "title": "Polygon makes new sidechain developer stack opensource, supporting ZK-powered Layer 2s on Ethereum  ",
    "url": "https://cointelegraph.com/news/polygon-chain-development-kit-opensource",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/db95a57c-2cf7-4023-b3d8-dcc7c44e2b5d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Polygon’s Chain Development Kit allows developers to freely build, customize and deploy layer 2 chains connected to the wider Ethereum ecosystem. </p>\n                    <p><p>The Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) ecosystem could welcome a variety of new <a href=\"https://cointelegraph.com/tags/layer2\">layer 2</a> (L2) protocols built on Polygon’s newly open sourced codebase Chain Development Kit, which harnesses zero-knowledge proof (<a href=\"https://cointelegraph.com/explained/zero-knowledge-proofs-explained\">ZK-proof</a>) technology to ensure security and fast finality.</p><p>Jordi Baylina, technical lead of Polygon Hermez zkEVM, spoke to Cointelegraph exclusively about the new tool set which is publicly available on a Github repository:</p><blockquote>“The motivating idea is simple: it should be easy and seamless for developers to launch a ZK-powered Layer 2 on Ethereum, tailored to the requirements of their project.”</blockquote><p>Baylina added that a key aspect is that Polygon CDK enables automatic access to liquidity across all of Polygon’s chains as well as the wider Ethereum ecosystem, providing “on-demand scale, without fragmenting liquidity\".</p><p>The Ethereum developer pointed to a number of different projects building CDK-powered chains across a variety of use cases, including from payment-specific L2s, DeFi, gaming, social-specific platforms, and creator or NFT platforms.</p><p><a href=\"https://cointelegraph.com/news/are-zk-proofs-the-answer-to-bitcoin-ordinal-and-brc-20-problem\"><strong><em>Related: Are ZK-proofs the answer to Bitcoin’s Ordinal and BRC-20 problem?</em></strong></a></p><p>Baylina also highlighted the customizability of CDK for different appchains, featuring customizations for rollup or validium mode, zkEVM or another ZK-powered execution environment, various data availability solutions, native token and gas token customization, centralized or decentralized sequencer mode as well as permissioned networks with granular allowlists.</p><p>The importance of ZK-proof technology is another factor that Baylina stressed, highlighting Polygon Labs’ belief that zero-knowledge is the future of scaling Ethereum. As the Hermez zkEVM lead explains, chains launched with Polygon CDK are automatically connected to a shared ZK bridge and plugged into an “interop layer,” which is a cross-chain communication protocol.</p><blockquote>“Suppose there are 1000s of chains in the Polygon ecosystem. It’s inefficient for each of these to submit their proofs directly to Ethereum. Instead, the interop layer will receive proofs from chains and submit a single ZK proof that proves the state of all Polygon chains.”</blockquote><p>Baylina said the technology unlocks sub-minute cross-chain transactions and creates the perception of a single chain environment.</p><p>Cointelegraph also queried the key differences between CDK and other Ethereum ecosystem programming languages like Zk-proof pioneers StarkWare’s Cairo codebase. </p><p>Baylina explains that the architecture unlocked by Polygon CDK is different in that it enables automatic access to shared liquidity through a ZK bridge and interop layer of an L2 ecosystem secured by working ZK-proofs. </p><p>He finished by reaffirming the belief in ZK-proofs as the future of Ethereum scalability given its fast finality and withdrawal times, when compared to week-long delay by fraud proofs that feature in Optimistic rollup L2 solutions. </p><blockquote>“ZK makes better bridges, but also secures chains by rigorous math, without a need for social-economic components required by fraud proofs.”</blockquote><p>Cointelegraph <a href=\"https://cointelegraph.com/learn/a-beginners-guide-on-blockchain-layer-2-scaling-solutions\">previously explored</a> the Ethereum layer 2 ecosystem, unpacking the basics of Ethereum rollups and the different approaches to scaling the smart contract blockchain.</p><p><a href=\"https://cointelegraph.com/magazine/recursive-inscriptions-bitcoin-supercomputer-defi-aws-possible/\"><em>Magazine: Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon</em></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-01T13:40:17.000Z",
    "title": "Why is the crypto market down today?",
    "url": "https://cointelegraph.com/news/why-is-the-crypto-market-down-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-09/8032812d-1d50-46ab-b965-a0cb6dd41a63.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto market is down today as the U.S. securities regulator delays its decision on Bitcoin ETFs.</p>\n                    <p><p>The cryptocurrency market capitalization is down today, with the U.S. Securities and Exchange Commission (SEC) spoiling the rally this week.</p><h2>SEC delays spot Bitcoin ETF applications </h2><p>The combined valuation of all cryptocurrencies has fallen 3.7% in the last 24 hours to $1.02 trillion on Sep. 1.</p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), which makes up nearly half of the crypto market, lost 4.5% in the last 24 hours. The selloff started after the SEC <a href=\"https://cointelegraph.com/news/sec-delays-decision-on-wisdomtree-s-spot-bitcoin-etf\">postponed</a> its decision on six spot Bitcoin ETF applications, including BlackRock's, until October.</p><p>The losses remained intact as Bitwise, one of the Bitcoin ETF applicants, <a href=\"https://cointelegraph.com/news/bitwise-withdraws-bitcoin-and-ethereum-market-cap-etf-application\">withdrew</a> its application after the SEC delay.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/84c9ffba-9c4b-427e-8595-cc6037641ee8.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto market performance in the past 24 hours. Source: Coin360.com</em></figcaption></figure><p>The crypto market has been eagerly waiting for the SEC to approve a Bitcoin ETF in the U.S., under the impression that it would <a href=\"https://cointelegraph.com/news/bitcoin-may-hit-100k-by-capturing-even-2-5-of-gold-s-market-cap-hut8-vp-sue-ennis\">attract institutional investors</a> and, in. turn, bring more capital into the crypto sector. </p><p>On Aug, 29, the crypto market and <a href=\"https://cointelegraph.com/news/btc-price-2-week-highs-grayscale-sec-bitcoin-etf-win\">BTC price rallied over 5%</a> after a federal court <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">directed</a> the SEC to reconsider the crypto asset manager Grayscale Investments' application to launch a Bitcoin ETF. </p><p>These gains are now wiped out. </p><h2>Long liquidations outweigh shorts</h2><p>Bitcoin's losses in the last 24 hours further coincide with massive long liquidations in the same timeframe.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-risks-23k-dive-btc-price-loses-11-august\">Bitcoin risks ‘swift’ $23K dive after BTC price loses 11% in August</a></em></strong></p><p>Notably, the crypto derivatives market has closed $106.32 million worth of long positions in the past 24 hours. In comparison, only around $16 million of short liquidations happened in the same period. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/a2ac661f-1675-4a56-8d7c-10fbd58a31bc.png\"  /><figcaption style=\"text-align: center;\"><em>Liquidation heatmap of crypto assets. Source: Coinglass</em></figcaption></figure><p><a href=\"https://cointelegraph.com/news/large-bitcoin-liquidations-mean-one-man-s-pain-is-another-man-s-pleasure-time-to-buy-the-dip\">Long liquidations</a> involve exchanges selling traders' initial margin to keep themselves from losing funds that the traders have borrowed. Simply put, they sell Bitcoin, for example, to cover the borrowed amount, increasing the selling pressure in the process.</p><h2>Dollar's recovery battering crypto since July</h2><p>A stronger <a href=\"https://cointelegraph.com/news/how-does-the-u-s-dollar-index-dxy-impact-cryptocurrencies-watch-macro-markets\">U.S. dollar</a> is also a big reason for the crypto market's slump thanks to their consistent negative correlation with one another in 2023. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-risks-23k-dive-btc-price-loses-11-august\">Bitcoin risks ‘swift’ $23K dive after BTC price loses 11% in August</a></em></strong></p><p>Notably, the U.S. dollar index (DXY), which measures the greenback's strength against the weight of top foreign currencies, has risen 0.75% since Aug. 31. Meanwhile, its daily correlation coefficient with the crypto market stands near -0.78.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/d82485c2-4c9b-4208-9ba9-fe6a3c868a33.png\"  /><figcaption style=\"text-align: center;\"><em>DXY daily performance chart featuring its correlation with the crypto market cap. Source: TradingView</em></figcaption></figure><p>The DXY has been in an uptrend since early July when Bitcoin marked its yearly highs of around $31,000.</p><h2>Crypto market outlook for September 2023</h2><p>From a technical standpoint, the crypto market treads near its long-serving ascending trendline support, eyeing a rebound toward $1.058 trillion in September. The recovery target coincides with the market's May-June 2023 support line and descending trendline resistance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/bf690f71-8fde-485e-9173-d61678386f39.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto market's daily performance chart. Source: TradingView</em></figcaption></figure><p>Conversely, a decisive break below the ascending trendline support could send the crypto market valuation crashing toward the $950-975 billion area (the red bar in the chart above).</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-01T13:45:40.000Z",
    "title": "Bitwise makes surprise ETH and BTC Market Cap ETF application withdrawal",
    "url": "https://cryptoslate.com/bitwise-makes-surprise-ethereum-and-bitcoin-market-cap-etf-application-withdrawal/",
    "description": "<p>Bitwise Trust Fund has withdrawn its application for a Bitcoin and Ethereum Market Cap Weight Strategy exchange-traded fund (ETF) from the U.S. Securities and Exchange Commission (SEC). Per its withdrawal statement, Bitwise said its &#8220;Trust no longer intends to seek effectiveness of the Fund and no securities of the Fund were sold or will be [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitwise-makes-surprise-ethereum-and-bitcoin-market-cap-etf-application-withdrawal/\">Bitwise makes surprise ETH and BTC Market Cap ETF application withdrawal</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-01T13:59:22.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-01T13:54:20.000Z",
    "title": "FBI and GCHQ issue joint advisory on Russian malware targeting crypto wallets",
    "url": "https://www.cryptopolitan.com/fbi-and-gchq-issue-joint-advisory-russian-malware-targeting-crypto-wallets/",
    "description": "A joint advisory report from the Federal Bureau of Investigation (FBI), National Security Agency (NSA), Cybersecurity and Infrastructure Security Agency (CISA), and the UK&#8217;s National Cyber Security Centre (NCSC) has shed light on a new malware strain known as Infamous Chisel. This malware is specifically designed to target cryptocurrency wallets and exchange applications. The malware ... <a title=\"FBI and GCHQ issue joint advisory on Russian malware targeting crypto wallets\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fbi-and-gchq-issue-joint-advisory-russian-malware-targeting-crypto-wallets/\" aria-label=\"More on FBI and GCHQ issue joint advisory on Russian malware targeting crypto wallets\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-01T13:51:01.000Z",
    "title": "AI-Generated Masterpiece “The Electrician” Takes Center Stage at Lancashire Photography Festival in Preston",
    "url": "https://www.cryptopolitan.com/ai-masterpiece-the-electrician-takes-stage/",
    "description": "In a groundbreaking move that has ignited both admiration and controversy within the global art and photography community, the mesmerizing AI-generated image titled &#8220;The Electrician&#8221; has found its rightful place in the heart of Preston. This unprecedented event has set the stage for fervent discussions about the ever-evolving relationship between technology, creativity, and traditional artistic ... <a title=\"AI-Generated Masterpiece &#8220;The Electrician&#8221; Takes Center Stage at Lancashire Photography Festival in Preston\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-masterpiece-the-electrician-takes-stage/\" aria-label=\"More on AI-Generated Masterpiece &#8220;The Electrician&#8221; Takes Center Stage at Lancashire Photography Festival in Preston\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-09-01T14:07:20.000Z",
    "title": "Polygon’s Influence on Bitcoin Spark: A Game-Changer for Scalability",
    "url": "https://nulltx.com/polygons-influence-on-bitcoin-spark-a-game-changer-for-scalability/",
    "description": "Bitcoin Spark is making waves in the cryptocurrency world, drawing parallels to Polygon, formerly known as MATIC Network, a layer two scaling solution. Let&#8217;s explore how the potential influence of Polygon can further propel the scalability landscape for Bitcoin Spark. Polygon&#8217;s Scalability Polygon addresses Ethereum scalability limitations. It involves the creation of sidechains connected to [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-01T13:56:08.000Z",
    "title": "Hong Kong’s first licensed crypto exchange HashKey launches fund",
    "url": "https://crypto.news/hong-kongs-first-licensed-crypto-exchange-hashkey-launches-fund/",
    "description": "HashKey Capital, the first licensed crypto exchange in Hong Kong, has announced the launch of a new secondary market crypto fund. The fund will use a significant portion of its assets to invest in the cryptocurrency industry, targeting different cryptocurrencies.&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-01T14:00:16.000Z",
    "title": "FTX’s-Sam Bankman-Fried Puts Trial Defense Together With 7 Expert Witnesses",
    "url": "https://www.newsbtc.com/ftx/sam-bankman-fried-ftx-trial/",
    "description": "Sam Bankman-Fried (SBF), the founder of the defunct FTX exchange, is set to face trial in October, barring any postponement. Amid the fracas, the former exchange CEO has maintained that he isn’t guilty of all these charges leveled against him and will be reportedly bringing expert witnesses to prove his innocence. Sam Bankman-Fried Defense To Call Seven Expert Witnesses  According to a Bloomberg report, Sam Bankman-Fried is employing the services of seven different expert witnesses to help bolster his case. These expert witnesses may form part of SBF’s defense, and if so, they will be allegedly paid $1,200 an hour to testify in favor of FTX’s former CEO.  This means that SBF’s defense could be spending up to $8,400 an hour for these expert witnesses, a staggering figure given that high-profile trials like these can drag out for a long time. Related Reading: Bitcoin Price Crashes Below $26,000 As SEC Pushes Back On 7 Spot ETF Filings This list of expert witnesses released so far includes Lawrence Akka, Thomas Bishop, Brian Kim, Joseph Pimbley, Bradley Smith, Peter Vinella, and Andrew Di Wu. Expert witnesses are persons with specialized knowledge in a particular field. They are usually called upon in court proceedings to break down complex or technical issues that the Judge and the jury may not be conversant with.  According to the defendant’s notice, SBF’s expert witnesses will give evidence of various issues, including campaign finance laws, the finances of FTX and its sister company, Alameda Research, and the crypto exchange’s software infrastructure.  However, it is surprising that SBF is calling an expert witness to give background information on the US campaign finance laws, considering that the prosecution had dropped the charge of him violating campaign finance rules.  The charge was dropped because it didn’t form part of the US government’s extradition agreement with the Bahamas government, and thus had no legs to stand on. But it seems defending himself against such allegations is important to the FTX founder given he is preparing a defense for it.  FTT continues to decline as trial draws closer &#124; Source: FTTUSD on Tradingview.com DOJ Objects To SBF’s Expert Witnesses In reply to SBF’s notice of his expert witnesses, the government has filed a motion to exclude the testimony of these witnesses. The prosecutors argue that these experts and their accompanying disclosures suffer from an “array of deficiencies” that necessitate their exclusion.  For one, their opinions have no basis as required by the Federal Rule of Criminal Procedure. According to the prosecutors, their opinions, among other things, are “irrelevant, unfairly prejudicial, and confusing to the jury.” They further argue that these experts will offer legal conclusions that “invade” the power of the court and the jury, so the court should exercise its “gatekeeping authority” and preclude their testimonies.” The Prosecutor’s motion contains extensive arguments on why each of these expert witnesses’ opinions should be excluded. They stated that Professor Smith’s testimony is “irrelevant, confusing, and a waste of time” since SBF’s trial doesn’t include a charge stemming from the defendant’s “illegal campaign finance scheme.” Related Reading: Dogecoin And Bitcoin Become Latest Additions To Robinhood Wallet Meanwhile, they argue that Mr. Vinella&#8217;s testimony should be excluded on the grounds of qualifications, relevancy, and admissibility. If rejected, they have the court to grant them a Daubert hearing to evaluate his “qualifications, methodology, and the relevance and reliability of his proposed testimony.  Mr. Vinella seems to be SBF’s primary expert witness as he is set to opine on various topics, including FTX’s operations and how the company took “commercially reasonable steps” to protect customers&#8217; funds despite the lack of regulatory clarity in the US.  SBF currently faces seven counts of financial fraud, including wire fraud on FTX and Alameda customers, securities fraud, and money laundering. Featured image from Town &#38; Country Magazine, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-01T14:05:47.000Z",
    "title": "Ripple Unlocks 1 Billion XRP as New Twist in SEC Case Could Force Gary Gensler into Immediate Action",
    "url": "https://www.crypto-news-flash.com/ripple-unlocks-1-billion-xrp-as-new-twist-in-sec-case-could-force-gary-gensler-into-immediate-action/",
    "description": "<img width=\"1280\" height=\"960\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-768x576.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Ripple unlocked 1 billion XRP tokens from escrow as part of its monthly strategy to ensure cryptocurrency supply and cross-border transaction facilitation.  After the unlock, a large XRP holder transferred over $10 million worth of XRP to Binance, reflecting significant market activity. On Friday, Ripple, the prominent blockchain firm, executed its monthly release plan by [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-01T14:00:35.000Z",
    "title": "Get Rich In 2023! This Shiba Inu Rival Is Set To Outperform SHIB With A 100x Rally",
    "url": "https://www.crypto-news-flash.com/get-rich-in-2023-this-shiba-inu-rival-is-set-to-outperform-shib-with-a-100x-rally/",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-3.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-3-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-3-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Crypto whales are on the move again, and they are stacking up this hybrid meme coin that is touted as the ultimate rival of Shiba Inu. Investors are poised to make as much as 100x ROI with this new hybrid meme coin in 2023. In this article, we’ll discuss the future price projection of Shiba [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-01T14:01:00.000Z",
    "title": "Oversold Signals Spark Hope for DOGE and SHIB Amid Crypto Slump",
    "url": "https://coinedition.com/oversold-signals-spark-hope-for-doge-and-shib-amid-crypto-slump/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/Are-DogeCoin-and-Shiba-Inu-still-good-investments-for-2023-696x392-1-129x73.jpg 129w\" sizes=\"(max-width: 696px) 100vw, 696px\" /><p>On August 31st, the US Securities and Exchange Commission (SEC) postponed approving spot Bitcoin ETFs, prompting a negative trend in the cryptocurrency market. As a result, Dogecoin (DOGE) followed suit, dropping from a 24-hour high of $0.06692 to an intraday low of $0.06309 before finding support. DOGE was trading at $0.06356 at press time, down [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/oversold-signals-spark-hope-for-doge-and-shib-amid-crypto-slump/\">Oversold Signals Spark Hope for DOGE and SHIB Amid Crypto Slump</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]