[
  {
    "source": "CoinDesk",
    "date": "2024-03-12T16:37:31.000Z",
    "title": "NFT Providers May Need Registration to Comply With UK Money Laundering Rules",
    "url": "https://www.coindesk.com/policy/2024/03/12/nft-providers-may-need-registration-to-comply-with-uk-money-laundering-rules/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.K. started a consultation on its money laundering rules on Monday."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-12T16:34:53.000Z",
    "title": "Craig Wright ‘Committed Perjury’ in U.K. Trial Over Satoshi Claims, COPA Says",
    "url": "https://www.coindesk.com/policy/2024/03/12/craig-wright-committed-perjury-in-uk-trial-over-satoshi-claims-copa-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Crypto Open Patent Alliance said it will ask U.K. prosecutors to consider pursuing Wright for “perjury” over his defense of forgery allegations."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-12T16:29:50.000Z",
    "title": "Notcoin Review: Should You Play the Telegram Game Ahead of the Airdrop?",
    "url": "https://decrypt.co/221344/notcoin-review-should-you-play-telegram-game-airdrop",
    "description": "Buzzy Telegram game Notcoin has racked up 27 million players ahead of the NOT token drop. Here's why it has us in its grasp."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-12T16:15:12.000Z",
    "title": " Patient Capital Management switches out Grayscale Bitcoin Trust for BTC ETP ",
    "url": "https://cointelegraph.com/news/patient-capital-management-switches-out-grayscale-bitcoin-trust-btc-etp",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMDg4MzNlMTktNzViZC00ZWRjLTllZDItYjFkNzk4NzI0NDBmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The asset manager's Opportunity Trust Fund has $1.4 billion in AUM.</p>\n                    <p><p>Patient Capital Management had revised its Patient Opportunity Trust prospectus to replace Grayscale Bitcoin Trust in a filing with the United States Securities and Exchange Commission (SEC) submitted on March 11. In doing so, it has also modified the risk factors in its prospectus, acknowledging “cryptocurrency regulatory risk” in place of “bitcoin risk.” </p><p>The filing reads:</p><p>This move expands the fund’s investment option to include all exchange-traded products (ETPs),  rather than the Grayscale fund. </p><p><a href=\"https://cointelegraph.com/news/patient-capital-management-switches-out-grayscale-bitcoin-trust-btc-etp\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-12T17:05:23.000Z",
    "title": "Grayscale introduces ‘mini’ Bitcoin ETF to alleviate investor tax burdens and curb outflows",
    "url": "https://cryptoslate.com/grayscale-introduces-mini-bitcoin-etf-to-alleviate-investor-tax-burdens-and-curb-outflows/",
    "description": "<p>Grayscale, the issuer of the world&#8217;s largest Bitcoin exchange-traded fund (ETF), has applied for a smaller version of its popular Grayscale Bitcoin Trust (GBTC) ETF under the &#8220;BTC&#8221; ticker, according to a Mar. 12 filing with the US Securities and Exchange Commission (SEC). Grayscale said: &#8220;This would be net-positive for existing GBTC investors, who would [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/grayscale-introduces-mini-bitcoin-etf-to-alleviate-investor-tax-burdens-and-curb-outflows/\">Grayscale introduces &#8216;mini&#8217; Bitcoin ETF to alleviate investor tax burdens and curb outflows</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-12T16:29:49.000Z",
    "title": "Bitcoin’s surge to $73k put 99.76% of entities in profit, signaling mature phase of bull market",
    "url": "https://cryptoslate.com/bitcoins-surge-past-72k-leaves-99-percent-of-entities-in-profit/",
    "description": "<p>There are many different ways to quantify market sentiment. Looking at price action provides a very crude but effective gauge of the market&#8217;s feelings — if the price is going down, the market&#8217;s most likely bearish, and vice versa. However, feelings about the future are very complex to analyze, especially when it comes to Bitcoin, [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoins-surge-past-72k-leaves-99-percent-of-entities-in-profit/\">Bitcoin&#8217;s surge to $73k put 99.76% of entities in profit, signaling mature phase of bull market</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-12T17:05:03.000Z",
    "title": "Tether assists FBI and DOJ in seizing $1.4 million from tech scam",
    "url": "https://cryptobriefing.com/tether-assists-fbi-doj-seizure-tech-scam/",
    "description": "Tether aids FBI and DOJ in recovering $1.4 million from a tech scam that primarily targeted elderly individuals in the US."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-12T16:30:00.000Z",
    "title": "Nibiru Chain Debuts Public Mainnet Along with Four Major Exchange Listings",
    "url": "https://www.cryptoglobe.com/latest/2024/03/nibiru-chain-debuts-public-mainnet-along-with-four-major-exchange-listings/",
    "description": "Tortola, British Virgin Islands, March 12th, 2024, Chainwire Nibiru Chain, a developer and user-centric Layer 1 platform, has officially launched its public mainnet. Nibiru Chain stands out by offering a secure and efficient environment for building highly-performant decentralized applications. It is distinguished by its robust smart contract ecosystem offering superior throughput and unparalleled security, making […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-12T16:16:04.000Z",
    "title": "Gluwa Pays Courtesy Visit to Ghana VP",
    "url": "https://www.cryptoglobe.com/latest/2024/03/gluwa-pays-courtesy-visit-to-ghana-vp/",
    "description": "Abuja, Nigeria, March 12th, 2024, Chainwire Gluwa’s CEO, Tae Oh, has paid a courtesy visit to the Vice President of Ghana, Mahamudu Bawumia, to discuss technological opportunities within the country for improving financial inclusivity.  As part of Gluwa’s continued mission to increase financial access in underserved or unbanked areas across Africa, CEO Tae Oh is […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-12T16:41:18.000Z",
    "title": "Ethereum (ETH) Is on the Verge of the $5,000 Breakthrough, But What Can Go Wrong?",
    "url": "https://cryptodaily.co.uk/2024/03/ethereum-eth-is-on-the-verge-of-the-5000-breakthrough-but-what-can-go-wrong",
    "description": "Explore the excitement in the crypto world as Ethereum's (ETH) bold surge over $4,000 ignites discussions among traders and investors. Will ETH reach the much-anticipated $5,000 milestone? Dive deep into the dynamics of Ethereum's market movements and uncover the mysteries behind its burgeoning potential now!"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-12T17:00:39.000Z",
    "title": "Xuirin Finance (XUIRIN) Launches Presale, Aiming to Transform the DeFi Sector",
    "url": "https://news.bitcoin.com/xuirin-finance-xuirin-launches-presale-aiming-to-transform-the-defi-sector/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240312_184847_029-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240312_184847_029-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240312_184847_029-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240312_184847_029-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240312_184847_029-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240312_184847_029-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240312_184847_029-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240312_184847_029.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. In a significant stride towards revolutionizing the decentralized finance (DeFi) landscape, xuirin Finance is excited to announce the launch of its presale, effective immediately. This pivotal event marks a monumental milestone for the innovative DeFi platform, known for its comprehensive suite of services designed to transform how international transactions are conducted. xuirin Finance, [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-12T16:32:30.000Z",
    "title": "After Exit Scam, Incognito Darknet Market Operators Now Threaten User Data Leak in Extortion Twist",
    "url": "https://news.bitcoin.com/after-exit-scam-incognito-darknet-market-operators-now-threaten-user-data-leak-in-extortion-twist/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/dnm89878-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/dnm89878-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/dnm89878-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/dnm89878-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/dnm89878-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/dnm89878-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/dnm89878-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/dnm89878.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Numerous accounts have recently revealed that shortly after the darknet market (DNM) Incognito apparently conducted an &#x2018;exit scam,&#x2019; its operators have now informed their clients and merchants they are facing extortion. The team behind Incognito claims possession of crypto asset transaction logs and archived conversations from its users, warning that this information will be leaked [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-12T16:52:16.000Z",
    "title": "Arbitrum Price Prediction 2024 – 2033: ARB breaks key barrier",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2024 – 2033 Scaling solutions operate on top of a blockchain’s base layer, such as Ethereum, to enhance performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their transactions more efficiently. Arbitrum adds to Ethereum’s numerous advantages, boosts the network’s sluggish performance, and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-12T16:39:00.000Z",
    "title": "Binance Coin Price Prediction 2024-2033: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2024-2033 After notable changes in its executive team, Binance has shown notable resilience and prospects for recovery. The departure of Changpeng Zhao, Binance&#8217;s CEO, who was also embroiled in legal challenges, initially caused a decline in the value of Binance Coin (BNB). Despite this initial setback, the cryptocurrency has shown a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-12T16:34:11.000Z",
    "title": "Jamie Dimon backs Bitcoin ownership rights, despite personal aversion",
    "url": "https://www.cryptopolitan.com/jamie-dimon-backs-bitcoin-ownership-rights/",
    "description": "The cryptocurrency world is buzzing like a hive on steroids, and Bitcoin is the queen bee everyone&#8217;s talking about. Its price skyrocketing to a jaw-dropping $72,000 and shattering records like a rock star smashes guitars. But here&#8217;s the kicker: Jamie Dimon, the big boss of JPMorgan Chase and Wall Street&#8217;s highest-paid CEO, isn&#8217;t buying the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-12T16:21:45.000Z",
    "title": "Americans are facing an unprecedented financial crisis",
    "url": "https://www.cryptopolitan.com/americans-unprecedented-financial-crisis/",
    "description": "Americans are teetering on the edge of a financial precipice, with many feeling the ground crumble beneath their feet. The financial landscape has morphed into a treacherous terrain, fraught with uncertainties and laden with pitfalls that threaten the very fabric of economic security. This is not your usual market fluctuation or a temporary setback. Nope, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-12T16:15:18.000Z",
    "title": "Nasser Vocational Training Centre and Oman Chamber of Commerce Discuss AI Collaboration",
    "url": "https://www.cryptopolitan.com/oman-chamber-of-commerce-discuss-ai/",
    "description": "In a recent meeting held in Muscat, Dr. Abdullah bin Nasser Al Noaimi, CEO of the Nasser Vocational Training Centre (NVTC), and representatives from the Shaikh Nasser Centre for AI Research and Development, convened with Hamad bin Nasser Al Maskari, Chairman of the Board of Directors of the Oman Chamber of Commerce and Industry (OCCI). [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-12T17:02:18.000Z",
    "title": "The quantum emergency: Ethereum’s race against time",
    "url": "https://crypto.news/the-quantum-emergency-ethereums-race-against-time/",
    "description": "Ethereum gears up against quantum threats. How does the community react to Buterin&#8217;s new proposal, and how real is the danger? The exponential advancement of quantum computing technology poses a daunting challenge to the blockchain platforms, potentially undermining the security&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-12T16:58:53.000Z",
    "title": "Coinbase CEO discusses Bitcoin’s necessity in light of US debt growth",
    "url": "https://crypto.news/coinbase-bitcoin-united-states-debt/",
    "description": "Coinbase CEO Brian Armstrong explains the importance of Bitcoin in response to the United States' $30 trillion surge in national debt over the last 28 years."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-12T16:46:12.000Z",
    "title": "Bitcoin traders move $520m as BTC enters price discovery phase",
    "url": "https://crypto.news/bitcoin-move-520-million-btc-price/",
    "description": "Bitcoin's price hit new all-time highs above $73,000 on March 12 as the pioneer cryptocurrency entered the price discovery phase. "
  },
  {
    "source": "BTCManager",
    "date": "2024-03-12T16:18:55.000Z",
    "title": "Grayscale proposes Bitcoin Mini Trust ETF, aims for lower fees",
    "url": "https://crypto.news/grayscale-bitcoin-mini-trust-etf/",
    "description": "Grayscale is seeking the SEC's approval for a Bitcoin Mini Trust to reduce its Bitcoin ETF fees. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-12T17:00:34.000Z",
    "title": "Solana Demand Soars As Institutions Buy Up SOL At A Massive 870% Premium",
    "url": "https://www.newsbtc.com/news/solana/solana-sol-massive-870-premium/",
    "description": "Solana (SOL) looks to be attracting the attention of institutional investors, with this Solana fund trading as high as an 870% premium following SOL’s bullish momentum. These investors’ interest in the SOL token isn’t surprising as on-chain metrics suggest it is still undervalued, and a parabolic rise might be on the horizon.  Grayscale Solana Trust Trades At A Premium  Per data from Grayscale’s website, the Grayscale Solana Trust (GSOL) is currently trading at $317 per share, representing a significant premium from SOL’s current price. The premium had risen to 870% on March 8 when GSOL was trading at $540. Shares in the fund are designed to track the value of SOL’s price, allowing institutional investors to have exposure to the token without holding it.  Related Reading: Record $1 Billion In Shorts Risk Liquidation If Bitcoin Hits This Price The disparity between the share price of GSOL and SOL’s price might be because institutional investors are limited in the means to gain exposure to SOL. As such, a fund like GSOL could see its price increase exponentially (just like now) when there is increased institutional demand for the SOL token. Institutional interest in SOL is also evident from NewsBTC’s recent report that crypto-focused asset manager Pantera Capital is raising funds to buy $250 worth of SOL. Investors are likely to jump on this opportunity, considering that these SOL tokens will reportedly be sold at a fixed price of $59.95, meaning there is an opportunity to make significant gains from the deal.  SOL Still Greatly Undervalued Crypto analyst Hansolar suggested that SOL was still undervalued when he mentioned that the crypto token might not take off until BTC and ETH hit new all-time highs (ATH). He also predicted that SOL could rise to as high as $600 in this bull cycle. Meanwhile, the argument about SOL being undervalued is backed by the fact that it is still far off from its ATH of $260.  Related Reading: Crypto Expert Reveals Why Bitcoin Could Hit $200,000 By April Crypto tokens are known to set a new ATH in every bull run, and there is every likelihood that it won’t be different for SOL this time around. Moreover, SOL and the Solana network are gaining much traction heading into this cycle, which should contribute to more price surges for the SOL token.  Solana recently registered an ATH in the number of daily new addresses, with many users onboarded into the ecosystem. This increased interest in the network has been partly due to its DeFi landscape, which is going head-to-head with Ethereum&#8217;s, and the current meme coin frenzy on Solana, which has attracted investors.  At the time of writing, SOL is trading at $152, up over 2% in the last 24 hours, according to data from CoinMarketCap.  DOGE price jumps to $0.17 &#124; Source: DOGEUSD on Tradingview.com Featured image from ByteTree, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-12T17:00:00.000Z",
    "title": "Whale Activity: Dogecoin Transferred to Robinhood Platform",
    "url": "https://coinedition.com/whale-activity-dogecoin-transferred-to-robinhood-platform/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Dogecoin (DOGE) Price Analysis: Can the Coin Retest $0.09?\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Whales-Move-Millions-Of-DOGE-To-Exchanges-Potential-Sell-Off-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Whale Alert, 150 million Dogecoin (DOGE) worth $26.44 million, was transferred from an unknown wallet to Robinhood on March 12. Although Coin Edition could not confirm if the 150 million coins had been sold, the deposit to the exchange suggested that liquidation was the intention. Selling that amount of Dogecoin could be profitable [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/whale-activity-dogecoin-transferred-to-robinhood-platform/\">Whale Activity: Dogecoin Transferred to Robinhood Platform</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-12T16:55:59.000Z",
    "title": "Zeus Network Reveals Angel Investor Lineup – Featuring Solana Co-Founder Anatoly Yakovenko, Mechanism Capital Co-Founder Andrew Kang and Stacks Co-Creator Muneeb Ali",
    "url": "https://dailyhodl.com/2024/03/11/zeuz-network-reveals-angel-investor-lineup-featuring-solana-co-founder-anatoly-yakovenko-mechanism-capital-co-founder-andrew-kang-and-stacks-co-creator-muneeb-ali",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/UPSCALED-Zeus-Industry-Announcement-Featured-Image-Template.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/UPSCALED-Zeus-Industry-Announcement-Featured-Image-Template.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2024/03/UPSCALED-Zeus-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2024/03/UPSCALED-Zeus-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2024/03/UPSCALED-Zeus-Industry-Announcement-Featured-Image-Template.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2024/03/UPSCALED-Zeus-Industry-Announcement-Featured-Image-Template.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/UPSCALED-Zeus-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2024/03/UPSCALED-Zeus-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2024/03/UPSCALED-Zeus-Industry-Announcement-Featured-Image-Template.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2024/03/UPSCALED-Zeus-Industry-Announcement-Featured-Image-Template.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>March 12, 2024 – New York, United States In a significant development, Zeus Network has reached a crucial phase in the launch of its ZEUS token, a milestone underpinned by the unwavering support of its community. The network has announced the participation in the Jupiter LFG Launchpad voting process, highlighting the strategic importance of community [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/11/zeuz-network-reveals-angel-investor-lineup-featuring-solana-co-founder-anatoly-yakovenko-mechanism-capital-co-founder-andrew-kang-and-stacks-co-creator-muneeb-ali\">Zeus Network Reveals Angel Investor Lineup – Featuring Solana Co-Founder Anatoly Yakovenko, Mechanism Capital Co-Founder Andrew Kang and Stacks Co-Creator Muneeb Ali</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-12T16:55:51.000Z",
    "title": "BlackRock and MicroStrategy in Neck and Neck Race As Firms’ Bitcoin Holdings Soar to Over $29,170,000,000 in BTC",
    "url": "https://dailyhodl.com/2024/03/12/blackrock-and-microstrategy-in-neck-and-neck-race-as-firms-bitcoin-holdings-soar-to-over-29170000000-in-btc/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/bitcoin-holdings-as-firms.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/bitcoin-holdings-as-firms.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/bitcoin-holdings-as-firms.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/bitcoin-holdings-as-firms.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/bitcoin-holdings-as-firms.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/bitcoin-holdings-as-firms.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/bitcoin-holdings-as-firms.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>MicroStrategy continues to gobble up Bitcoin (BTC) as the top crypto asset soars to new all-time highs. The business intelligence firm recently used proceeds from convertible notes and excess cash to buy an additional 12,000 BTC for $821.7 million (at an average price of approximately $68,477 per Bitcoin), according to Michael Saylor, the company&#8217;s co-founder [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/12/blackrock-and-microstrategy-in-neck-and-neck-race-as-firms-bitcoin-holdings-soar-to-over-29170000000-in-btc/\">BlackRock and MicroStrategy in Neck and Neck Race As Firms’ Bitcoin Holdings Soar to Over $29,170,000,000 in BTC</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]