[
  {
    "source": "Decrypt",
    "date": "2024-04-02T15:15:16.000Z",
    "title": "Meme Coins Are the Biggest Losers as Bitcoin Price Dips Below $65,000",
    "url": "https://decrypt.co/224429/meme-coins-biggest-losers-bitcoin-below-65000",
    "description": "Bitcoin is down bad Tuesday, but meme coins have taken the biggest hit today with Pepe, Bonk, and Dogecoin all suffering sizable losses."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-04-02T15:14:05.000Z",
    "title": "U.S. and UK Join Forces in Pioneering AI Safety Standards",
    "url": "https://www.cryptoglobe.com/latest/2024/04/u-s-and-uk-join-forces-in-pioneering-ai-safety-standards/",
    "description": "On 1 April 2024, a significant stride was taken towards enhancing the safety of artificial intelligence technologies as the United States and the United Kingdom, through their respective AI Safety Institutes, announced a groundbreaking partnership. This collaboration, underscored by a Memorandum of Understanding (MOU) signed between U.S. Commerce Secretary Gina Raimondo and UK Technology Secretary […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-02T15:22:47.000Z",
    "title": "YakDAO Debuts $YAKS Token on Arbitrum, Innovating DeFi Real Estate",
    "url": "https://cryptodaily.co.uk/2024/04/yakdao-debuts-yaks-token-on-arbitrum-innovating-defi-real-estate",
    "description": "YakDAO Debuts $YAKS Token on Arbitrum, Innovating DeFi Real Estate"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-02T15:12:08.000Z",
    "title": "Certo stUSD, a decentralized stablecoin accruing interest from P2P lending got backed by cyberFund",
    "url": "https://cryptodaily.co.uk/2024/04/certo-stusd-a-decentralized-stablecoin-accruing-interest-from-p2p-lending-got-backed-by-cyberfund",
    "description": "Coinscribble – March 28, 2024 / Certo, a new DeFi lending protocol had received a seed investment from cyberFund, backed by funders of Lido DAO and early investors to Cosmos, Solana."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-02T15:29:38.000Z",
    "title": "Option2Trade (O2T) Completes 93% Of Stage 6 Presale, Here’s Why Pepe (PEPE) Coin Investors Have Joined The Revolution",
    "url": "https://www.cryptopolitan.com/option2trade-o2t-completes-93-of-stage-6-presale-heres-why-pepe-pepe-coin-investors-have-joined-the-revolution/",
    "description": "In a groundbreaking development within the cryptocurrency sector, Option2Trade (O2T), an innovative platform harnessing the power of artificial intelligence for trading, has achieved a remarkable milestone, completing 93% of its Stage 6 presale. This achievement has not gone unnoticed, especially among the Pepe (PEPE) Coin investor community, who have rapidly gravitated towards the O2T revolution, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-02T15:26:00.000Z",
    "title": "Binance Coin Price Prediction 2024-2033: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2024-2033 After notable changes in its executive team, Binance has shown notable resilience and prospects for recovery. The departure of Changpeng Zhao, Binance&#8217;s CEO, who was also embroiled in legal challenges, initially caused a decline in the value of Binance Coin (BNB). Despite this initial setback, the cryptocurrency has shown a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-02T15:25:07.000Z",
    "title": "Microsoft Testing AI Chatbots for Xbox Support Tasks",
    "url": "https://www.cryptopolitan.com/microsoft-testing-ai-chatbots-for-xbox/",
    "description": "Microsoft has started the testing process with AI chatbots meant for Xbox support tasks to make the processes of assistance in the ecosystem. The move is part of the Microsoft mega plan to integrate AI into every bit of the company&#8217;s operations, including its gaming world. Purpose and functionality of Xbox AI chatbots According to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-02T15:13:46.000Z",
    "title": "Blizzard Entertainment’s World of Warcraft Franchise Director Confirms Non-Use of Generative AI",
    "url": "https://www.cryptopolitan.com/blizzard-entertainments-world-of-warcraft/",
    "description": "In a recent interview with IGN at the Game Developers Conference 2024, John Hight, the franchise director of the iconic massively multiplayer online game (MMO) World of Warcraft, shed light on the game&#8217;s technological advancements. Addressing the buzz surrounding artificial intelligence (AI) in gaming, Hight clarified that Blizzard Entertainment is not employing generative AI within [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-04-02T15:26:06.000Z",
    "title": "Tether blocks $280k linked to the FixedFloat hack, analyst explains breach",
    "url": "https://crypto.news/tether-fixedfloat-hack-block/",
    "description": "Tether has blocked $280,000 USDT from seven wallets linked to the FixedFloat hack. "
  },
  {
    "source": "BTCManager",
    "date": "2024-04-02T15:19:54.000Z",
    "title": "BNB Chain to reward meme coin issuers with prizes up to $1m",
    "url": "https://crypto.news/meme-coin-competition-bnb-chain/",
    "description": "The BNB Chain ecosystem team has announced a program to support meme coin developers with a prize pool of up to $1 million."
  },
  {
    "source": "BTCManager",
    "date": "2024-04-02T15:16:02.000Z",
    "title": "Ethereum stakers exit Lido for Ether.fi, Renzo",
    "url": "https://crypto.news/ethereum-exit-lido-ether-fi-renzo/",
    "description": "While Ethereum prices fell over 4% in the last 30 days, ETH holders have pivoted away from Lido Finance into restaking protocols."
  },
  {
    "source": "BTCManager",
    "date": "2024-04-02T15:12:40.000Z",
    "title": "BOME, MEME, MEW, and DOGE20 defy market crash",
    "url": "https://crypto.news/bome-meme-mew-and-doge20-defy-market-crash/",
    "description": "Despite recent downturns in the broader cryptocurrency market, select meme coins like Book of Meme, Memecoin, cat in a dog's world, and Dogecoin20 have shown resilience, bucking the trend with positive gains. #partnercontent"
  }
]