[
  {
    "source": "NewsBTC",
    "date": "2023-06-21T23:00:34.000Z",
    "title": "Bitcoin Miner Core Scientific Files for Chapter 11, Seeks Restructuring Amid Crypto Winter",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-miner-core-scientific-files-for-chapter-11-seeks-restructuring-amid-crypto-winter/",
    "description": "Core Scientific, a prominent Bitcoin mining company, has recently made headlines as it filed for Chapter 11 bankruptcy protection. The move comes as the crypto industry grapples with the enduring effects of the ongoing crypto winter, impacting various firms in the sector.  Core Scientific&#8217;s decision to seek bankruptcy protection is part of its strategy to implement a comprehensive restructuring plan to navigate the challenging market conditions. Amid a comprehensive review of potential alternatives and extensive discussions with stakeholders, Core Scientific has taken the step of filing for bankruptcy protection to enable the execution of a restructuring support agreement (RSA).  Related Reading: Bitcoin Cash Surges 20% In One Day As Market Rebounds, What’s Next? The company aims to swiftly address its financial challenges and emerge stronger from the restructuring process. As part of its commitment to transparently communicate its intentions, Core Scientific has filed voluntary petitions for reorganization under Chapter 11 of the US Bankruptcy Code in the US Bankruptcy Court for the Southern District of Texas. The Bitcoin miner has now joined a growing list of crypto firms seeking similar measures. However, the decision reflects the company&#8217;s dedication to implementing a comprehensive restructuring plan to address its financial situation amidst the crypto winter. Core Scientific Pursuing A Comprehensive Restructuring Plan To facilitate its restructuring efforts, Core Scientific has filed voluntary petitions for reorganization under Chapter 11 of the US Bankruptcy Code. With an estimated range of $1 billion to $10 billion in assets and a considerable number of creditors, the company is committed to swiftly navigating the restructuring process. During the Chapter 11 process, Core Scientific remains steadfast in its commitment to operating its existing self-mining and hosting operations, which have demonstrated positive cash flow. The company aims to leverage its state-of-the-art data centers to provide uninterrupted hosting services and self-mining capabilities while undergoing the restructuring process. Core Scientific first filed for bankruptcy in 2022 following the widespread contagion triggered by the FTX exchange collapse. Bitcoin miners suffered severe losses leading to the bankruptcy of multiple mining firms including Celsius Mining and Compute North. However, as the market has begun to recover and BTC&#8217;s price has moved above $30,000 once more, the headwinds for miners are starting to look better. Related Reading: Bitcoin Price Breaks Above $30,000: Is The Bull Run Back On? Core Scientific has already reported an increase in its BTC mining activities as prices have recovered, which has further propelled its ability to move through its current debt issues. The company already produced 1,314 BTC in the last month, a 16% increase from the prior month. As for its stock prices, Core Scientific&#8217;s stocks have suffered massive losses in the last two years. The company was valued at around $4 billion when it went public back in 2021 with its stock price reaching as high as $15. However, it has since lost most of its value with the stock price now sitting at $0.4455 and the company value at around $70 million. CORZQ falls to $0.4455 per share &#124; Source: Core Scientific, Inc. on TradingView.com Featured image from Forkast News, chart from TradingView.com"
  }
]