[
  {
    "source": "Decrypt",
    "date": "2024-02-02T17:41:28.000Z",
    "title": "'Probably Will Go Meme': OPNX Investors Refuse to Sell Tokens Despite Shutdown",
    "url": "https://decrypt.co/215453/opnx-investors-refuse-to-sell-be-comfortable-with-fear",
    "description": "\"What are the chances they can fail again,\" one OPNX investors asked. \"It’s almost statistically impossible.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-02T18:00:47.000Z",
    "title": " VC Roundup: Institutional staking, car network, and Move VM funding deals  ",
    "url": "https://cointelegraph.com/news/vc-roundup-institutional-staking-car-network-move-vm-funding-deals",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYjdlYWEzZjktZmJjYS00OThhLWI5YzEtYmZiMDg2YjUwMmRiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Axiom, Portal, HashKey, Kiln, Digital Infrastructure, Pontem and p0 are among the startups securing venture capital in January 2024. </p>\n                    <p><p>Crypto-based startups kicked off 2024 disclosing new funding rounds across a range of sectors, despite liquidity constraints as private investments<a href=\"https://cointelegraph.com/news/vc-roundup-private-accounts-tokenization-healthcare-infrastructure-investors\"> are burdened by high-interest rates</a>.</p><p>January’s highlights include smart contract platform<a href=\"https://cointelegraph.com/news/smart-contract-platform-axiom-raises-20-million-series-a-round\"> Axiom securing $20 million for a zero-knowledge approach</a> to authenticating data on-chain,<a href=\"https://cointelegraph.com/news/portal-raises-34m-seed-round-bitcoin-atomic-swaps\"> Portal’s $34 million seed funding</a> for Bitcoin atomic swaps, and crypto exchange<a href=\"https://cointelegraph.com/news/hong-kong-hashkey-raise-100m-series-a-funding-valuation\"> HashKey hitting the unicorn status</a> after raising nearly $100 million in a Series A funding round.</p><p>Ecosystems are also playing a role in supporting early-stage ventures. The Solana Foundation, for instance, picked Colosseum to manage its accelerator program, which<a href=\"https://cointelegraph.com/news/colosseum-online-platform-manages-solana-hackathons-accelerator-program\"> seeds startups with a $250,000 investment</a>. Digital asset market maker Keyrock also announced $10 million in token capital into the Radix public ledger to support the ecosystem growth. </p><p><a href=\"https://cointelegraph.com/news/vc-roundup-institutional-staking-car-network-move-vm-funding-deals\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-02T17:57:04.000Z",
    "title": " Price analysis 2/2: BTC, ETH, BNB, SOL, XRP, ADA, AVAX, DOGE, DOT, LINK ",
    "url": "https://cointelegraph.com/news/price-analysis-2-2-btc-eth-bnb-sol-xrp-ada-avax-doge-dot-link",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMzBjM2Q3NWMtZmU4OC00M2ZlLWIzNWUtZmEyN2RjNDBjY2IxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin’s historical performance in February favors bulls, opening the gates for a possible rally above $45,000. Will altcoins follow?</p>\n                    <p><p>The launch of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds (ETFs) in January failed to boost prices as traders focused on the outflows from the Grayscale Bitcoin Trust (GBTC), ignoring the <a href=\"https://cointelegraph.com/news/9-bitcoin-etf-buy-142k-btc-january\">net inflows into the remaining ETFs</a>. This shows that the traders sought to sell the news and book profits on their positions.</p><p>However, a positive sign is that Bitcoin did not stay below the $40,000 level for long. This indicates that lower levels continue to attract investors. Buying on dips and selling on rallies may keep <a href=\"https://cointelegraph.com/news/bitcoin-150-days-5k-btc-price-trading-range\">Bitcoin inside a range for a few days</a>. The next major catalyst for Bitcoin is the halving in April.</p><p>Another positive in favor of the bulls is that Bitcoin has produced an <a href=\"https://cointelegraph.com/news/bitcoin-gains-january-new-sub-40k-btc-price-target\">average monthly gain of about 12% in February</a>, according to CoinGlass data. Since 2013, Bitcoin has ended February with a negative monthly return only in 2014 and 2020.</p><p><a href=\"https://cointelegraph.com/news/price-analysis-2-2-btc-eth-bnb-sol-xrp-ada-avax-doge-dot-link\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-02T17:53:20.000Z",
    "title": "3 Altcoins to Lead the Charge in 2024's Crypto Race",
    "url": "https://cryptodaily.co.uk/2024/02/3-altcoins-to-lead-the-charge-in-2024s-crypto-race",
    "description": "2024's Crypto Race is heating up, and three altcoins are set to lead the charge! Get ready for a transformative year in cryptocurrency where these tokens could potentially skyrocket in value, reshaping the crypto landscape!"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T17:56:00.000Z",
    "title": "Hong Kong tightens grip on virtual asset providers with new licensing deadline",
    "url": "https://www.cryptopolitan.com/hong-kong-tightens-grip-on-virtual-asset-providers-with-new-licensing-deadline/",
    "description": "The Hong Kong government has set a firm deadline for virtual asset service providers (VASPs) to align with new licensing requirements. Christopher Hui, Hong Kong’s Secretary for Financial Services and the Treasury, in blog post, conveyed the urgency for unlicensed VASPs to comply by February 29 or face cessation of operations by May 31. This [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-02T18:00:11.000Z",
    "title": "These Are The Four Key Bitcoin Price Levels To Watch, Reveals Analyst",
    "url": "https://www.newsbtc.com/bitcoin-news/four-key-bitcoin-price-levels-watch-reveals-analyst/",
    "description": "An analyst has revealed the four key Bitcoin price levels that could be to keep an eye on, as they may have an influence on the spot price&#8217;s trajectory. These Are The Four Key Price Points For Bitcoin In a new post on X, CryptoQuant Netherlands community manager Maartunn has shared four key price levels for Bitcoin. Three of these levels involve some kind of variation of the &#8220;realized price&#8221; on-chain indicator. The realized price keeps track of the price at which the average investor on the network acquired their coins. In other words, the metric measures the average cost basis of the asset&#8217;s user base. Related Reading: BitMEX Whales Buy Bitcoin: What History Says Will Happen Next When the spot price of the cryptocurrency is greater than the realized price, it means that the average holder in the sector can be assumed to be carrying some profits right now. On the other hand, the price being under the indicator implies the market as a whole is underwater some net amount at the moment. Naturally, the price is exactly equal to the metric, suggesting the average holder is just breaking even on their investment currently. Historically, this is the condition that has been of particular importance for the coin, as such retests can flip the profit-loss situation of the investors. Now, here is the chart shared by Maartunn that reveals the trend in the four key Bitcoin price points in question over the last few years: The four historically relevant price levels for the cryptocurrency &#124; Source: @JA_Maartun on X In the above graph, the red colored line (which also happens to have the highest value out of these right now) corresponds to the realized price of the &#8220;short-term holders&#8221; (STHs). The STHs refer to the investors who bought their coins within the last 155 days. At present, the average cost basis of this cohort stands at $38,750. In bullish periods, this level has often been a point of major support for the asset, and Bitcoin came quite close to retesting it during its latest drawdown. Opposite to the STHs are the &#8220;long-term holders&#8221; (LTHs), whose realized price is shown by the green curve in the chart. The indicator&#8217;s value is only $18,740 for this cohort currently, implying that these HODLers are carrying high amounts of profits. The purple line in the graph represents the &#8220;adjusted realized price,&#8221; which is a metric that provides a baseline for the market in general. Bitcoin found its bottom back in September when it retested this level. Currently, the indicator&#8217;s value stands at $31,190. Related Reading: XRP Whales Are On The Move, What Are They Up To? Close to this line right now is the fourth and final price level pointed out by the analyst, the 200-week moving average (MA), which is at $30,500. 200 weeks is approximately how long the popular 4-year Bitcoin cycle lasts for, so this MA can help reveal the cycle baseline momentum for the coin. Maartunn, in particular, finds this 200-week MA and the adjusted realized price to be the most intriguing levels out of the four listed here. BTC Price Bitcoin had made a visit under the $42,000 level yesterday, but it appears the asset has already bounced back, as it&#8217;s now trading above $43,000 again. Looks like the price of the asset has seen some surge over the past day &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-02T18:00:43.000Z",
    "title": "Shiba Inu’s Shibarium To Onboard 1,000 Projects, Number of Validators on Avalanche Hits New ATH, NuggetRush Play-to-Earn Game Coming Soon",
    "url": "https://www.crypto-news-flash.com/shiba-inus-shibarium-to-onboard-1000-projects-number-of-validators-on-avalanche-hits-new-ath-nuggetrush-play-to-earn-game-coming-soon/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-shibarium-to-onboard-1000-projects-number-of-validators-on-avalanche-hits-new-ath-nuggetrush-play-to-earn-game-coming-soon",
    "description": "<img width=\"1200\" height=\"799\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-02T121700.475.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-02T121700.475.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-02T121700.475-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-02T121700.475-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-02T121700.475-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-02T121700.475-450x300.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Shiba Inu plans to house over 1,000 projects on its layer-2 network, Shibarium.  The number of validators on the Avalanche network has skyrocketed to a new all-time high of 1,729. NuggetRush is at the last stage of its presale, which means its play-to-earn game is around the corner. Shiba Inu had revealed its plans to [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-02T17:55:42.000Z",
    "title": "Binance Launches Bitcoin and Ethereum Inscriptions Marketplace To Support Wave of New Crypto Assets",
    "url": "https://dailyhodl.com/2024/02/02/binance-launches-bitcoin-and-ethereum-inscriptions-marketplace-to-support-wave-of-new-crypto-assets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/Exchange-Binance-Launches-Inscriptions.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/Exchange-Binance-Launches-Inscriptions.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/02/Exchange-Binance-Launches-Inscriptions.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/Exchange-Binance-Launches-Inscriptions.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/Exchange-Binance-Launches-Inscriptions.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/Exchange-Binance-Launches-Inscriptions.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/02/Exchange-Binance-Launches-Inscriptions.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Binance just introduced a one-stop shop allowing users to mint and trade thousands of tokens in Bitcoin and Ethereum&#8217;s emerging inscription ecosystems. The world’s largest crypto exchange says the newly launched Binance Inscriptions Marketplace enables users to buy, sell and inscribe Bitcoin&#8217;s BRC-20 tokens and Ethereum Virtual Machine (EVM) tokens. “In our ongoing quest to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/02/binance-launches-bitcoin-and-ethereum-inscriptions-marketplace-to-support-wave-of-new-crypto-assets/\">Binance Launches Bitcoin and Ethereum Inscriptions Marketplace To Support Wave of New Crypto Assets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]