[
  {
    "source": "Decrypt",
    "date": "2023-12-19T11:30:19.000Z",
    "title": "Court Approves $2.7 Billion Binance-CFTC Settlement, CZ to Pay $150 Million Fine",
    "url": "https://decrypt.co/210238/court-approves-2-7-billion-binance-cftc-settlement-cz-to-pay-150-million-fine",
    "description": "The settlement requires Binance to pay a $1.35 billion fine to the CFTC, as well as handing over $1.35 billion in \"ill-gotten transaction fees.\""
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-19T11:29:54.000Z",
    "title": "Ethereum MEV-relay bloXroute to deny OFAC-listed transactions, escalating crypto censorship debate",
    "url": "https://cryptoslate.com/ethereum-mev-relay-bloxroute-to-deny-ofac-listed-transactions-escalating-crypto-censorship-debate/",
    "description": "<p>Ethereum MEV-relay bloXroute labs said it will reject blocks containing transactions from addresses listed on the Office of Foreign Assets Control&#8217;s (OFAC) Specially Designated Nationals And Blocked Person List (SDN) list starting Dec. 18. In a Dec. 18 statement on X (formerly Twitter), the firm said: &#8220;Effective immediately, all bloXroute relays will reject block bids [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ethereum-mev-relay-bloxroute-to-deny-ofac-listed-transactions-escalating-crypto-censorship-debate/\">Ethereum MEV-relay bloXroute to deny OFAC-listed transactions, escalating crypto censorship debate</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T11:35:20.000Z",
    "title": "The Revolution of Cloud Gaming: Impact, Trends, and Best Platforms ",
    "url": "https://www.cryptopolitan.com/the-revolution-of-cloud-gaming-impact/",
    "description": "The online gaming industry has undergone remarkable growth over the past three decades, emerging as a multi-billion-dollar powerhouse that rivals the film and music industries in revenue. According to the Global Games Market Report, the global video games market reached an astounding $137.9 billion in 2018, marking its undeniable prominence in the entertainment media landscape. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T11:22:50.000Z",
    "title": "Human Skills vs AI: Where Does the Future of Work Belong?",
    "url": "https://www.cryptopolitan.com/human-skills-vs-ai-future-of-work/",
    "description": "AI is gradually changing the types of jobs available and the skills needed to perform them. Human skills (sometimes referred to as soft skills), once the bedrock of every career, are now being challenged as these algorithms continue to crest across industries. Over time, more people and businesses who were first reluctant are starting to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T11:22:05.000Z",
    "title": "Autonomous Robots Revolutionize Nuclear Decommissioning: The SMuRFs Approach",
    "url": "https://www.cryptopolitan.com/robots-reshapes-nuclear-the-smurfs-approach/",
    "description": "In a groundbreaking development in the field of robotics and nuclear safety, a team of engineers from the University of Glasgow, University of Manchester, Bristol Robotics Laboratory, and Heriot-Watt University have introduced an innovative robotic system known as the SMuRFs (Symbiotic Multi-Robot Fleet). This system marks a significant step forward in the decommissioning of nuclear [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T11:19:42.000Z",
    "title": "Investor Shift to VC Spectra (SPCT) Over Cosmos (ATOM) and Render (RNDR) – Exploring the Reasons Behind the Preference",
    "url": "https://www.cryptopolitan.com/investor-shift-to-vc-spectra-spct-over-cosmos-atom-and-render-rndr-exploring-the-reasons-behind-the-preference/",
    "description": "VC Spectra (SPCT) has received significant praise as one of the top altcoins to buy in 2023 due to its impressive features and remarkable real-world utility. On the other hand, some experts claim that Cosmos (ATOM) and Render (RNDR) are set to resume their bearish trends, so let’s dive into detail and find out which [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-19T11:37:00.000Z",
    "title": "Wall Street insiders hopeful about new banking infrastructure built on blockchain",
    "url": "https://crypto.news/wall-street-insiders-hopeful-about-new-banking-infrastructure-built-on-blockchain/",
    "description": "Large financial companies, including JPMorgan Chase &#38; Co., HSBC Holdings Plc, and Franklin Templeton, are moving to new systems built on the blockchain. Sandy Kaul, Chief Executive of wealth management firm Franklin Templeton, recently highlighted the transformative impact of blockchain&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-19T11:33:54.000Z",
    "title": "SEC defers decision on several ETH ETFs to May 2024",
    "url": "https://crypto.news/sec-defers-decision-on-several-eth-etfs-to-may-2024/",
    "description": "The United States Securities and Exchange Commission (SEC) has postponed its decision on several Ethereum-based exchange-traded funds (ETFs) until May 2024. This announcement came through regulatory filings made on Dec. 18. Among the delayed decisions are those concerning the Hashdex&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-19T11:15:33.000Z",
    "title": "Injective, Fetch.ai, and Meme Moguls riding the Santa Rally",
    "url": "https://crypto.news/injective-fetch-ai-and-meme-moguls-riding-the-santa-rally/",
    "description": "Meme Moguls, Fetch.ai, and Injective Protocol are leading the markets, edging higher in the ongoing Santa Rally"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-19T11:23:00.000Z",
    "title": "Bitcoin’s 2024 Evolution: A Look at Key Milestones and Dates",
    "url": "https://coinedition.com/bitcoins-2024-evolution-a-look-at-key-milestones-and-dates/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Bitcoin-Volatility-Hits.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Bitcoin-Volatility-Hits.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Bitcoin-Volatility-Hits-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Bitcoin-Volatility-Hits-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Bitcoin-Volatility-Hits-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Bitcoin-Volatility-Hits-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Bitcoin-Volatility-Hits-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The lead analyst at CryptoSlate, James Van Straten, shared a potential 2024 timeline for Bitcoin (BTC) in an X (formerly Twitter) post. The very first milestone that the analyst listed in his expected timeline is the approval of Spot Bitcoin exchange-traded funds (ETFs) in January next year. Next on Van Straten’s timeline is ETF trading. [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bitcoins-2024-evolution-a-look-at-key-milestones-and-dates/\">Bitcoin&#8217;s 2024 Evolution: A Look at Key Milestones and Dates</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]