[
  {
    "source": "CoinDesk",
    "date": "2023-11-21T17:00:00.000Z",
    "title": "Crypto Industry Goes Nuclear With Uranium-Linked Tokens",
    "url": "https://www.coindesk.com/business/2023/11/21/crypto-industry-goes-nuclear-with-uranium-linked-tokens/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Uranium3o8 is offering yellowcake-backed tokens on Uniswap through a partnership between Canadian firm Madison Metals and Sainmiguel Investments."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-21T16:55:12.000Z",
    "title": "Bitcoin Bounces as DOJ Preps to Make Binance Settlement Official",
    "url": "https://decrypt.co/206840/bitcoin-bounces-doj-binance-settlement",
    "description": "A Binance settlement bullish for Bitcoin? The market seems to think so."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-21T16:42:03.000Z",
    "title": "Microsoft, Salesforce, and Nvidia swoop in to hire OpenAI employees as walkout threats increase",
    "url": "http://cointelegraph.com/news/microsoft-salesforce-nvidia-artificial-intelligence-swoop-hire-open-ai-employees-walkout-threats-increase-sam-altman",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/ce186a3b-4cf2-424a-99d4-45b8b259680f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>OpenAI’s future remains uncertain as employees threaten a walkout over the firing of former CEO and co-founder Sam Altman. </p>\n                    <p><p>OpenAI’s decision to fire CEO Sam Altman may have put the company’s future in jeopardy. </p><p>Reportedly, a lion’s share of its employees have threatened to walkout unless the ousting is reversed. Complicating matters further, a number of executives from big tech orgnanizations have offered jobs to employees considering leaving. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">To my partners at OpenAI: We have seen your petition and appreciate your desire potentially to join Sam Altman at Microsoft’s new AI Research Lab. Know that if needed, you have a role at Microsoft that matches your compensation and advances our collective mission.</p>&mdash; Kevin Scott (@kevin_scott) <a href=\"https://twitter.com/kevin_scott/status/1726971608706031670?ref_src=twsrc%5Etfw\">November 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Salesforce will match any OpenAI researcher who has tendered their resignation full cash &amp; equity OTE to immediately join our Salesforce Einstein Trusted AI research team under Silvio Savarese.  Send me your cv directly to ceo@salesforce.com.  Einstein is the most successful… <a href=\"https://t.co/1RXoc9ekeo\">pic.twitter.com/1RXoc9ekeo</a></p>&mdash; Marc Benioff (@Benioff) <a href=\"https://twitter.com/Benioff/status/1726695914105090498?ref_src=twsrc%5Etfw\">November 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Microsoft CTO Kevin Scott and Salesforce founder and CEO Marc Benioff have offered to match the compensation of any OpenAI employees looking to jump ship while team leaders at both Meta's FAIR and Nvidia have solicited resumes and offered to place former OpenAI employees in their divisions. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">My team at NVIDIA is hiring. We  you all from OpenAI. Engineers, researchers, product team, alike. Email me at linxif@nvidia.com. DM is open too. NVIDIA has warm GPUs for you on a cold winter night like this, fresh out of the oven.<br><br>I do research on AI agents. Gaming+AI,… <a href=\"https://t.co/fVlUgSrsRc\">pic.twitter.com/fVlUgSrsRc</a></p>&mdash; Jim Fan (@DrJimFan) <a href=\"https://twitter.com/DrJimFan/status/1726490491452379250?ref_src=twsrc%5Etfw\">November 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I&#39;m really sorry to hear what&#39;s happening to our OpenAI friends. Our team at FAIR is actively hiring for our mixed-modal LLM team across the whole pipeline. Please reach out to me if you&#39;re interested.</p>&mdash; Armen Aghajanyan (@ArmenAgha) <a href=\"https://twitter.com/ArmenAgha/status/1726492157060747467?ref_src=twsrc%5Etfw\">November 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The outpouring of support comes on the heels of a rollercoaster 12 months for OpenAI. The firm released its seminal “ChatGPT” product in November of 2022 to worldwide acclaim. In the time since, the company’s valuation has <a href=\"https://www.reuters.com/technology/openais-86-bln-share-sale-jeopardy-following-altman-firing-information-2023-11-18/\" target=\"_blank\" rel=\"noopener nofollow\">catapulted</a> to a reported $86 billion. However Altman’s surprise ousting on Nov. 17 has resulted in unprecedented turmoil for the firm. </p><p>As of Nov. 21, and the time of this article’s publication, a <a href=\"https://twitter.com/ashleevance/status/1726659403124994220\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> 700 of the company’s supposed 770 employees — including Ilya Sutskever, the sole remaining co-founder to occupy a position on the firm’s board of directors — have signed a letter signalling their intent to walk out if Altman isn’t reinstated. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/microsoft-nvidia-stock-reach-all-time-highs-amid-open-ai-ceo-shuffle-artificial-intelligence\"><strong><em>Microsoft and Nvidia stocks reach all-time highs amid OpenAI CEO shuffle</em></strong></a></p><p>While the threat of an employee walkout isn’t unusual in the tech sector after a company overhaul, this particular scenario could have an outsized impact according to speculation from numerous boffins and pundits. </p><p>One unlikely scenario being bandied about involves the hypothetical wholesale hiring of all available OpenAI employees by a larger firm such as Microsoft. This would ostensibly create a hostile takeover scenario wherein OpenAI is acquired in all but name for pennies on the dollar. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It&#39;s in Microsoft&#39;s interest to hire the OpenAI employees to gut OpenAI and build the Advanced AI team at Microsoft, a wild scenario: <br><br>-Microsoft offers *each* of the 770 employees a &quot;modest&quot; $10,000,000 ($10M) signing bonus. <br>-That would cost a meager $7.7B.<br>-A $82.3B saving…</p>&mdash; Jeremiah Owyang (@jowyang) <a href=\"https://twitter.com/jowyang/status/1726644276875161738?ref_src=twsrc%5Etfw\">November 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, there are multiple other scenarios to consider. Recent reports show that OpenAI’s board and newly-hired CEO Emmett Shear are <a href=\"https://cointelegraph.com/news/openai-seeks-to-diffuse-internal-tensions-after-altman-departure-report\">engaged in “intense discussions” with employees and stakeholders</a>. </p><p>If successful, OpenAI could retain its core development team and move forward with its new CEO. But <a href=\"https://cointelegraph.com/news/microsoft-hires-sam-altman-greg-brockman-after-departure-from-openai\">Microsoft’s hiring of Sam Altman as the CEO of an as-yet-undisclosed new AI division</a> within the company could complicate matters as he may no longer be incentivized to lead OpenAI. </p><p>It remains to be seen whether OpenAI employees will make good on their threat to walkout if the company chooses not to overturn its Nov. 17 decision or if Altman refuses to return.</p><p><em>Microsoft and OpenAI did not immediately respond to requests for comment.</em></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-21T16:52:14.000Z",
    "title": "Artificial Intelligence System Shows Promise in Early Autism Diagnosis",
    "url": "https://www.cryptopolitan.com/ai-shows-promise-in-early-autism-diagnosis/",
    "description": "Researchers at the University of Louisville have developed an artificial intelligence (AI) system that demonstrates the potential to diagnose autism in children between the ages of 24 and 48 months with a remarkable accuracy rate of 98.5%. The findings, presented at the annual meeting of the Radiological Society of North America in Chicago, highlight the ... <a title=\"Artificial Intelligence System Shows Promise in Early Autism Diagnosis\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-shows-promise-in-early-autism-diagnosis/\" aria-label=\"More on Artificial Intelligence System Shows Promise in Early Autism Diagnosis\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-21T16:41:59.000Z",
    "title": "Ubisoft announces the suspension of its ads on Twitter",
    "url": "https://www.cryptopolitan.com/ubisoft-suspension-of-its-ads-on-twitter/",
    "description": "Ubisoft has recently joined a growing list of major companies, including Apple, IBM, Oracle, Disney, Paramount, Lionsgate, Comcast, NBCU, and Warner Bros, in putting a pause on its advertising on Twitter, also known as X, according to a report from Axios on Monday. The decision to suspend advertising on the social media platform comes amid ... <a title=\"Ubisoft announces the suspension of its ads on Twitter\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ubisoft-suspension-of-its-ads-on-twitter/\" aria-label=\"More on Ubisoft announces the suspension of its ads on Twitter\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-21T16:58:33.000Z",
    "title": "Crypto analyst predicts breakout coming for ADA",
    "url": "https://crypto.news/crypto-analyst-predicts-breakout-coming-for-ada/",
    "description": "ADA got rejected yet again at the 40 cent barrier it's struggled with all year, but one analyst suggests eventually the crypto sleeping giant will awake."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-21T16:52:22.000Z",
    "title": "U.S. Justice Department to announce Binance settlement later today",
    "url": "https://crypto.news/u-s-justice-department-to-announce-binance-settlement-later-today/",
    "description": "The Department of Justice (DoJ) is scheduled to publicly disclose a resolution with crypto’s largest exchange Binance following news of a multi-billion settlement and major enforcement actions from regulators."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-21T17:00:03.000Z",
    "title": "Ethereum Exchange Supply Drops To 5-Year Lows, What This Means For Price",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-exchange-supply-price/",
    "description": "Ethereum recently cleared the $2,000 price level again in the past 24 hours, as filings of Spot Ethereum ETFs in the US start to pile up. New on-chain data has shown a clearer sentiment among ETH investors, and it looks like many are getting ready for the long haul.  Data shows that the amount of Ethereum held on exchanges has dropped since the middle of last week to the lowest levels since 2018. That means fewer people are selling their Ethereum, and more are holding onto it or staking it. Ethereum Exchange Supply Plummeting Although Ethereum is still down by 2.57% in the past seven days, the cryptocurrency is now trading above $2,000 after breaking the barrier on Monday, November 21. The recent surge would be the third time Ethereum crossed over the price level this month, as it&#8217;s still looking to maintain a sustained price increase.  Related Reading: Shiba Inu Burn Rate Crashes 98.79% With Less Than 1 Million Tokens Burned The recent spikes can be attributed to applications of Ethereum Spot ETFs piling up in front of the US SEC. BlackRock, in particular, joined the spot Ethereum ETF race on November 15th, igniting a price spike that pushed ETH past the $2,000 mark for the second time this month. It would appear that investors reacted to BlackRock&#8217;s ETH filing with the same sentiment they had in response to the investment company&#8217;s spot Bitcoin filing. CryptoQuant&#8217;s Exchange Reserves metric indicates that investor sentiment started to change around this period, as investors started to pull their assets off of exchanges into cold storage immediately after the news.  According to the metric, the number of ETH deposited across crypto exchanges amounted to 14.5 million as of November 15. However, this figure dropped by 152,583 ETH in the days after to reach 14.3 million on November 20th.  Source: CryptoQuant IntoTheBlock&#8217;s exchange netflow reveals a similar sentiment. The netflow calculates the number of tokens entering exchanges minus tokens leaving exchanges. According to the metric, exchanges have had around 228,450 ETH more in outflows than inflows since November 15. Source: IntoTheBlock What To Expect For ETH Price Action In The Coming Months  Dropping exchange reserves reduces the amount of ETH available for trading, thereby increasing scarcity. The data from both Cryptoquant and IntoTheBlock indicates Ethereum might be gearing up for a price spike fueled by increasing scarcity. Related Reading: Crypto Market Expert Identifies The Trigger For 600% Bitcoin Price Surge Ethereum is trading at $2,013 at the time of writing. We&#8217;ve already seen the crypto increase by 67% from $1,200 at the beginning of the year, and many analysts expect this trend to continue if supply tightens. According to crypto analyst Tony The Bull, Ethereum could cross $10,000 very soon if a bullish scenario plays out. ETH price holds $2,000 &#124; Source: ETHUSD on Tradingview.com Featured image from Exame, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-21T17:04:00.000Z",
    "title": "Argentina Unlikely to Join BRICS After Javier Milei’s Victory",
    "url": "https://coinedition.com/argentina-unlikely-to-join-brics-after-javier-mileis-victory/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Argentina Unlikely to Join BRICS\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/Argentina-Unlikely-to-Join-BRICS-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Javier Milei has emerged as the winner of the just-concluded presidential election in Argentina, and stakeholders are already considering the socio-economic implications of the far-right politician’s victory. Top among the issues is the potential decline of Argentina’s invitation to join the BRICS economic bloc, given just three months ago. As part of his campaign promises, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/argentina-unlikely-to-join-brics-after-javier-mileis-victory/\">Argentina Unlikely to Join BRICS After Javier Milei’s Victory</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]