[
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T07:34:05.000Z",
    "title": "Ripple CLO Accuses SEC of “Political Power Play” in Crypto Security War",
    "url": "https://www.cryptopolitan.com/ripple-clo-accuses-sec-political-power-play/",
    "description": "In a heated exchange on social media, Ripple Labs Inc&#8217;s General Counsel, Stuart Alderoty, launched a scathing attack on the United States Securities and Exchange Commission (SEC) over its relentless efforts to crack down on the cryptocurrency ecosystem through what he perceives as a politically motivated &#8220;security war.&#8221; The dispute centers around the SEC&#8217;s classification ... <a title=\"Ripple CLO Accuses SEC of &#8220;Political Power Play&#8221; in Crypto Security War\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-clo-accuses-sec-political-power-play/\" aria-label=\"More on Ripple CLO Accuses SEC of &#8220;Political Power Play&#8221; in Crypto Security War\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T07:12:34.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T07:09:49.000Z",
    "title": "Fox Founder Leads Publishers to Get Billions, Are AI Tech Execs in Trouble?",
    "url": "https://www.cryptopolitan.com/publishers-billions-ai-tech-trouble/",
    "description": "In a move to safeguard their interests and assert control over the rising tide of artificial intelligence, key publishers, led by media mogul Barry Diller, are on the verge of forming a powerful coalition. The coalition aims to file a lawsuit against AI tech companies that have utilized their data to train language models. Notably, ... <a title=\"Fox Founder Leads Publishers to Get Billions, Are AI Tech Execs in Trouble?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/publishers-billions-ai-tech-trouble/\" aria-label=\"More on Fox Founder Leads Publishers to Get Billions, Are AI Tech Execs in Trouble?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-24T07:30:00.000Z",
    "title": "XRP’s Surge: Whale Wallets And Legal Victory Impact",
    "url": "https://nulltx.com/xrps-surge-whale-wallets-and-legal-victory-impact/",
    "description": "The surge in the number of XRP whale wallets holding 100 million or more coins is a significant indicator of growing interest and investment in the cryptocurrency.  XRP Whales Accumulation This rise, reaching a count of 199, reflects a level not seen since May 13 and suggests a potential accumulation of wealth by large players [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-24T07:19:28.000Z",
    "title": "US сongressman proposes to ban CBDC",
    "url": "https://crypto.news/us-%d1%81ongressman-proposes-to-ban-cbdc/",
    "description": "US congressman Warren Davidson has voiced his concerns on central bank digital currencies (CBDCs), claiming they should be banned and criminalized. In a tweet on July 23, the congressman described the Federal Reserve&#8217;s efforts as &#8220;building the financial equivalent of&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-24T07:30:17.000Z",
    "title": "History Repeating? Dogecoin Monthly Chart Signals Massive Rally",
    "url": "https://www.newsbtc.com/news/dogecoin/history-repeating-dogecoin-monthly-chart-massive-rally/",
    "description": "Dogecoin, the popular meme coin, is making waves once again. A recent tweet by renowned analyst Ali Martinez has made waves in the crypto community, hinting at the potential for a significant rally for DOGE. In a Twitter post that quickly gained traction, Martinez highlighted an intriguing pattern on the monthly chart of Dogecoin. According to the analyst, the last time a descending triangle formed on the weekly chart, DOGE experienced a jaw-dropping pump of 23,200%. Now, as history could repeat itself, Martinez is keeping a close eye on a crucial resistance for confirmation. As the tweet states: Dogecoin: The last time a descending triangle developed on the weekly chart DOGE pumped 23,200%. I&#8217;ll be looking at a sustained monthly close above $0.80 for confirmation. The journey for Dogecoin has been quite the rollercoaster ride. Back in January 2018, DOGE reached an all-time high of nearly $0.02, only to enter a prolonged phase of consolidation, forming the descending triangle over the next three years. Related Reading: Dogecoin Becomes 8th-Largest Cryptocurrency After Adding $1 Billion To Market Cap However, with the onset of the new bull market, catalyzed by Bitcoin&#8217;s momentum, DOGE finally managed to break out of its extended consolidation pattern, surging to a peak of $0.7588 on May 8. Dogecoin Price Analysis 1D Chart Taking a closer look at the 1-day chart, it becomes evident that Dogecoin is now facing a critical turning point. Will the price manage to reverse its trend, or will it succumb to a continuation of the downtrend after a short pause of bullish activity? In the case of Dogecoin, the ascending triangle could signal a trend reversal. Since DOGE reached the local high of $0.1591 on November 01, 2022 as a result of the hype surrounding Elon Musk&#8217;s acquisition of Twitter, DOGE has been in a clear downtrend. From November to mid-June, DOGE has written lower highs, lower lows on the 1-day chart. Related Reading: Dogecoin Sees Positive Price Movement, Bulls Set Crosshair At $0.075 But since hitting a 13-month low at $0.0536 on June 10, DOGE has shown signs of an uptrend, forming what&#8217;s known as an ascending triangle. This particular pattern falls under the category of consolidation formations, usually indicating a continuation of the previous trend after a brief period of consolidation. However, in exceptional circumstances, such as this one, an ascending triangle can signal a trend reversal. As the Dogecoin community eagerly awaits the potential implications of this ascending triangle, it is essential to observe the resistance levels that lie ahead. Dogecoin must confirm the pattern by continuing its upward trajectory and break through the $0.075 resistance. This level has proven to be a formidable barrier in the past, as three previous attempts to breach it were unsuccessful. In the event of a successful breakout, the first hurdle lies at $0.0783, marked by the 23.6% Fibonacci retracement level. Should DOGE surpass this resistance, a rise to $0.0936 becomes a realistic possibility, where the 38.2% Fibonacci retracement level is situated. Further bullish targets include $0.1036 (50% Fibonacci retracement level), $0.1186 (61.8% Fibonacci retracement level), and $0.1363 (78.6% Fibonacci retracement level). Ultimately, reaching the previous high of $0.1591 from November 2022 would be the most ambitious goal, although the potential for heightened selling pressure at that point remains a consideration. Currently, a drop below $0.07 would invalidate the ascending triangle theory. Should this happen, the first bearish target could be $0.0636. Then, the yearly low at $0.0536 could come into focus. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-24T07:33:52.000Z",
    "title": "Shibarium Protocol Surpasses Milestone with PuppyNet’s 31 Million Transactions, Fueling SHIB Price Rally",
    "url": "https://www.crypto-news-flash.com/shibarium-protocol-surpasses-milestone-with-puppynets-31-million-transactions-fueling-shib-price-rally/?utm_source=rss&utm_medium=rss&utm_campaign=shibarium-protocol-surpasses-milestone-with-puppynets-31-million-transactions-fueling-shib-price-rally",
    "description": "Shibarium&#8217;s testnet records a significant milestone of 31 million transactions, building anticipation for its imminent mainnet release. Token burns contribute to potential positive price events for $SHIB, $BONE, and #leash tokens. Cryptocurrency enthusiasts are buzzing with excitement as the groundbreaking Shibarium protocol achieves a momentous milestone on its testnet. Recently, Cryptolight Shibarium shared the news [...]"
  }
]