[
  {
    "source": "NewsBTC",
    "date": "2023-07-19T03:59:40.000Z",
    "title": "Ethereum Price Is Showing Early Signs of Fresh Increase, But This Resistance Is Key",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-increase-above-1920/",
    "description": "Ethereum price is finding bids above the $1,875 support zone against the US Dollar. ETH could gain bullish momentum above the $1,940 resistance. Ethereum is holding the key support near $1,875. The price is trading below $1,920 and the 100-hourly Simple Moving Average. There was a break above a key bearish trend line with resistance near $1,900 on the hourly chart of ETH/USD (data feed via Kraken). The pair could gain pace if it clears the $1,920 and $1,940 resistance levels. Ethereum Price Could Start Fresh Increase Ethereum’s price declined again below the $1,900 support. However, ETH bulls were active near the $1,875 level. It seems like a double bottom pattern is forming near the $1,875 level. A low is formed near $1,875 and the price is now attempting a fresh increase. It broke the $1,900 resistance level. There was also a break above a key bearish trend line with resistance near $1,900 on the hourly chart of ETH/USD. The pair cleared the 50% Fib retracement level recent drop from the $1,944 swing high to the $1,874 low. Ether is now trading below $1,920 and the 100-hourly Simple Moving Average. On the upside, immediate resistance is near the $1,920 level. It is close to the 61.8% Fib retracement level recent drop from the $1,944 swing high to the $1,874 low. Source: ETHUSD on TradingView.com The first major resistance is near the $1,940 zone, above which the price could rise toward the $1,985 resistance zone. The next major resistance is near the $2,000 level. Any more gains could send Ether toward the $2,050 resistance or even $2,080. Fresh Decline in ETH? If Ethereum fails to clear the $1,920 resistance, it could start a fresh decline. Initial support on the downside is near the $1,900 level. The first major support is near the $1,875 level, below which the price could extend its decline. The next major support is near the $1,825 support level. Any more losses could open the doors for a move toward the $1,780 support level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,875 Major Resistance Level – $1,920"
  }
]