[
  {
    "source": "NewsBTC",
    "date": "2023-10-03T00:00:57.000Z",
    "title": "Crypto Fund Flows: Bitcoin Leads As Solana Follows, But Why’s Ethereum Left Behind?",
    "url": "https://www.newsbtc.com/bitcoin-news/crypto-fund-flows-bitcoin-leads-as-solana-follows-but-whys-ethereum-left-behind/",
    "description": "Investment products in the crypto arena have recently reported net inflows of $21 million, breaking a persistent six-week drought. With the crypto market’s future continuously debated among experts, such inflows mark a possible resurgence of confidence among investors. The top cryptocurrency remained at the forefront of this resurgence, capturing most of the inflow. But as Bitcoin continues its dominance, emerging coins like Solana also signify the diversifying landscape of the crypto world. Amid these positive indicators, the Ethereum token, however, tells a different story. Related Reading: Crypto’s Six-Week Bleed Out: XRP And Solana Defy The Outflow Downtrend Bitcoin And Solana Shine, Ethereum Faces The Heat Leading the pack, Bitcoin funds reported an inflow of roughly $20.4 million in the past week. In sharp contrast, investment products betting on Bitcoin&#8217;s decline witnessed an outflow of $1.5 million, suggesting a significant retreat from negative market sentiments. James Butterfill, CoinShares&#8217; Head of Research, pointed out the sustained relinquishment of short positions on Bitcoin, indicating a potential bullish sentiment for the top crypto. Solana, a rising star in the crypto ecosystem, continued to impress. Reporting inflows for the 27th week this year, it added $5.1 million to its coffers, reiterating its strong market position. Butterfill acclaimed Solana&#8217;s consistent performance, noting, &#8220;Solana continues to shine,&#8221; emphasizing its resilience in a year that has seen numerous altcoins fluctuate. On the flip side, Ethereum products haven&#8217;t mirrored this positive trend. Despite being one of the leading cryptocurrencies, it registered outflows for the seventh week. Butterfill labeled Ethereum as the current &#8220;least loved&#8221; altcoin. Global Reactions And Influencing Factors On Crypto Geographical dissections of the inflow trends offer noteworthy insights. While Europe and Canada embraced the crypto resurgence with inflows of $23 million and $17 million, respectively, the US displayed contrasting sentiments, pulling out $19 million. Butterfill links this unexpected inflow towards the week&#8217;s end to a blend of positive price momentum, apprehensions regarding US government debt prices, and the recent impasse over governmental funding. However, Butterfill also highlighted the low trading volumes across the investment product and crypto markets. Amid these crypto currents, blockchain equities failed to catch the same wind, seeing outflows totaling $8.4 million. This trend mirrors the broader tech sector&#8217;s direction, which also leaned towards a sell-off, as pointed out by Butterfill. Related Reading: Bitcoin Eyes Turnaround: Could A New All-Time High Be On The Horizon? Analyst Predicts Notably, the fund flows in Bitcoin, Ethereum, and Solana appear reflected even in their prices. While Bitcoin and Solana have spiked over the past day, recording a 3.3% and 6.2% upward trajectory, Ethereum has only seen a slight upward move of just 0.5% over the same period. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-03T00:00:40.000Z",
    "title": "Crypto Trader Outlines Massive Price Target for Solana, Says SOL in Midst of Generational Opportunity for Bulls",
    "url": "https://dailyhodl.com/2023/10/02/crypto-trader-outlines-massive-price-target-for-solana-says-sol-in-midst-of-generational-opportunity-for-bulls/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/SOL-Has-Potential-apple.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto analyst believes that the smart contract platform Solana (SOL) is gearing up for a strong bull market. Pseudonymous analyst Inmortal tells his 199,100 followers on the social media platform X that Solana is giving long-term bulls a shot to accumulate the crypto asset at a point of maximum opportunity. &#8220;This is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/02/crypto-trader-outlines-massive-price-target-for-solana-says-sol-in-midst-of-generational-opportunity-for-bulls/\">Crypto Trader Outlines Massive Price Target for Solana, Says SOL in Midst of Generational Opportunity for Bulls</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]