[
  {
    "source": "CoinDesk",
    "date": "2023-08-03T13:00:00.000Z",
    "title": "Ether Liquid Staking Protocols Could Double in 2 Years: HashKey ",
    "url": "https://www.coindesk.com/markets/2023/08/03/ether-liquid-staking-protocols-could-double-in-2-years-hashkey/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The amount of staked ether could reach between 31%-45% of the total supply by the end of Q2 2025."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-03T13:00:00.000Z",
    "title": "Coinbase Sets Public Launch of ‘Base’  Layer 2 Blockchain for Next Week",
    "url": "https://www.coindesk.com/tech/2023/08/03/coinbase-sets-public-launch-of-base-layer-2-blockchain-for-next-week/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Users will be able to bridge their ETH starting Thursday, with the official launch of the main network for Aug. 9"
  },
  {
    "source": "Decrypt",
    "date": "2023-08-03T13:01:57.000Z",
    "title": "Argent Takes Key Step Towards 'Invisible Wallet' With Newest Web Wallet Launch",
    "url": "https://decrypt.co/151092/argent-takes-key-step-towards-invisible-wallet-newest-web-wallet-launch",
    "description": "Argent takes another step in making its crypto wallet disappear, rolling out a new web wallet that resembles your favorite web2 banking app."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-03T12:45:15.000Z",
    "title": "BlockFi conditionally approved $1B recovery plan sets stage for repayment, larger recoveries",
    "url": "https://cryptoslate.com/blockfi-conditionally-approved-1b-recovery-plan-sets-stage-for-repayment-larger-recoveries/",
    "description": "<p>Bankrupt crypto lender BlockFi announced that it had received conditional approval for its disclosure statement from the United States Bankruptcy Court of New Jersey, according to an Aug. 2 press statement jointly issued with its Official Committee of Unsecured Creditors. As per the press statement, the lender&#8217;s creditors must vote on the Chapter 11 Plan [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/blockfi-conditionally-approved-1b-recovery-plan-sets-stage-for-repayment-larger-recoveries/\">BlockFi conditionally approved $1B recovery plan sets stage for repayment, larger recoveries</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-03T13:07:59.000Z",
    "title": "DeFi Liquid Staking Derivatives Dominance Predicted by HashKey Report",
    "url": "https://cryptobriefing.com/dominance-of-liquid-staking-derivatives-defi/?utm_source=feed&utm_medium=rss",
    "description": "HashKey Capital, one of Asias largest crypto funds, published a report on the Liquid Staking Derivatives (LSDs) in the DeFi market. The report sheds light on current trends, highlighting the..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-03T13:07:56.000Z",
    "title": "3.0 Verse Launches Unified Marketplace for CeFi and DeFi Trading",
    "url": "https://cryptodaily.co.uk/2023/08/30-verse-launches-unified-marketplace-for-cefi-and-defi-trading",
    "description": "<p>Dubai, United Arab Emirates, August 3rd, 2023, Chainwire</p><p>Dubai has emerged as a global VDA hub and digital market convergence by 3.0 Verse will further benefit the global markets and users.</p><p>In the dynamic world of large number of trading platforms and cryptocurrencies, the need for an intelligent, information driven and comprehensive user-friendly trade routing platform has never been more crucial. Today, 3.0 Verse is extremely happy to unveil from Dubai, its 3.0 Verse solution, a cutting-edge trade routing platform that brings together the best of both Centralized Finance (CeFi) (Binance, Huobi, Gate IO and OKX) and Decentralized Finance (DeFi) (AAVE, Compound, Curve, Uniswap, Sushi swap and Pancake swap).</p><p>This innovative platform is poised to revolutionize the crypto trading experience, providing users with seamless access to multiple exchanges, decentralized protocols, information, analytics, BoTs and support ecosystem all from a single interface. The 3.0 Verse solution also has a media channel through 3.0 TV and an educational channel through 3.0 University.</p><p>A World of Convenience and Efficiency</p><p>Multi-Market Trade Routing Platform- The heart of 3.0 Verse lies in its Multi-Market Trade Routing Platform, offering a ground-breaking solution to the fragmented trading experiences faced by crypto participants. This feature empowers users to effortlessly trade on renowned CeFi exchanges along with multiple DeFi platforms besides automated BoT Trading. The beauty of the platform is that a user can do all this from one unified screen and single technology infrastructure. With 3.0 Verse, gone are the days of multiple KYC verifications and the hassles of navigation between exchanges. Our platform consolidates the crypto trading experience and support system on a single platform.</p><p>Empowering Traders with Knowledge</p><p>Trending Coin Monitoring and Market Calls In markets, knowledge is power. 3.0 Verse equips traders with invaluable insights through its Trending Coin Monitoring feature, tracking the hottest coins across CeFi platform, routing lending and borrowing or swapping based on most AI driven most efficient markets.</p><p>Additionally, the pooled Market Calls feature offers a success rate of over 86% in the last five months, providing users with expert market analysis. Armed with curated content and timely information, traders can confidently make informed decisions. If the users desires to use trading strategies without manual intervention due to long trading hours then the users can use their desired Trading Strategies through the inbuilt trading BoT.</p><p>\"In an ever-evolving crypto landscape, convenience and significance are paramount for crypto participants. 3.0 Verse aims to revolutionize the trading experience, uniting CeFi and DeFi on one intuitive platform. At 3.0 Verse, we believe that curated content, market news, data and analytics is instrumental in guiding the users towards smart and informed trading decisions. We constantly enrich the crypto community through 3.0 Verse, 3.0 TV and 3.0 University. With this pioneering trading platform, we aspire to open new doors of opportunities for all crypto enthusiasts.\" said Mr. Mayur Poddar, Director of 3.0 Verse.</p><p>The Technology </p><p>The 3.0 Verse solution is a technology wonder as it handles massive real-time market prices, data, news, orders, trades, queries, analytics, BoTs processing, index computation and education content of LMS of 3.0 University, videos of 3.0 TV, from multiple sources and then aggregates, disseminates and confirms transaction online real time 24/7 with extremely low latency. The 3.0 Verse solution is robust, fault-tolerant, auto-scalable architecture and highly secure with Google Cloud Armour.</p><p>3.0 Verse invites all crypto enthusiasts and traders to embark on a transformative journey. With its intuitive interface, inclusive access to CeFi and DeFi, and expert market insights, users can navigate the crypto universe with ease and confidence.</p><p>Mr. Mayur Poddar, added: \"3.0 verse App is a technology innovation designed to converge global market ecosystem, efficiency and ease of operation for the users trading in virtual digital asset class. We are happy to have strategic collaborations with the ecosystem partners to ensure that end users have seamless access to markets and services. We are open to partnerships with multiple partners who wish to reach end clients with their products or service as our efforts are collaborative and in the interest of the end users. With a focus on technology innovation, information analytics, and user-centric convenience, we aim to empower individuals to navigate the crypto universe with confidence and ease and yet make informed choice.\"</p><p>The TV interview on 3.0TV can be found here&ndash; https://youtu.be/QpGViKhwyhY</p><p></p><p>About 3.0 Verse</p><p>3.0 verse is a one-of-a-kind global digital super app, which brings multiple crypto exchanges on a single platform. Users can leverage unparalleled and unprecedented benefits by accessing the world&rsquo;s top CeFi and DeFi exchanges on a single dashboard. Trusted by more than 3 million users across the crypto industry, 3.0 verse is on an indefatigable mission to create an ever-growing ecosystem of digital asset class trading that can transform lives.</p>ContactDirectorMayur Poddar3.0 Versemayur.poddar@3-verse.io"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-03T13:00:59.000Z",
    "title": "Introducing the CoinMarketCap's Crypto Fear and Greed Index: A Comprehensive Crypto Market Sentiment Tracker",
    "url": "https://cryptodaily.co.uk/2023/08/introducing-the-coinmarketcaps-crypto-fear-and-greed-index-a-comprehensive-crypto-market-sentiment-tracker",
    "description": "<p>London, United Kingdon, August 3rd, 2023, Chainwire</p><p>CoinMarketCap, the leading platform for cryptocurrency data, announces the launch of its groundbreaking CMC Crypto Fear and Greed Index. Designed to meet a crucial market need, this innovative index provides a wide-ranging and quantifiable assessment of fear and greed for the entire cryptocurrency industry.</p><p>Amid recent market turbulence, it became evident that there is no crypto equivalent of the traditional Fear and Greed Index, a well-established tool for stock market analysis. Existing alternatives in the crypto space focus solely on Bitcoin, failing to capture the overall market sentiment of 20,000+ coins listed on CoinMarketCap.&nbsp;</p><p>The CMC Crypto Fear And Greed index leverages an array of key components, meticulously engineered to provide users with valuable insights into the overall sentiment of the crypto market:</p><p>Price Momentum: The index analyzes the price performance of the top 10 crypto coins by market capitalization (excluding stablecoins) through CoinMarketCap's API. By capturing trends in assets like BTC, ETH, XRP, BNB, and DOGE, it provides a more holistic view of market sentiment, as price fluctuations mirror fear and greed levels in the market.</p><p>Volatility: Recognizing volatility's significant impact on market sentiment, the CMC Crypto Fear and Greed Index integrates the Volmex Implied Volatility Indices, BVIV and EVIV, capturing fluctuations across a broad selection of digital assets and reflecting crucial market data for enhanced decision-making.</p><p>Derivatives Market: Option contracts provide insights into market participants' expectations for future returns. The put-call ratio is utilized to infer the sentiment of retail participants in the option markets. A higher ratio of puts to calls signals fear in the market, indicating that retail investors anticipate a bear market or a future crash.</p><p>Market Composition: The relative aggregate value of BTC in the market serves as a vital indicator of market sentiment. The Stablecoin Supply Ratio (SSR) is employed for this purpose, measuring the ratio between Bitcoin's market capitalization and the total market capitalization of major stablecoins. A low SSR indicates a relatively larger stablecoin supply compared to BTC, while a high SSR signifies stronger BTC dominance. This metric not only represents the supply/demand dynamics between BTC and USD but also reflects the composition of the market.</p><p>CMC Proprietary Data: CoinMarketCap analyzes social trend keyword search data, such as phrases like \"crypto moon,\" to gauge market sentiment. Additionally, as a major traffic platform in the crypto industry, CoinMarketCap collects valuable pageview and engagement data, providing insights into market sentiment, retail interest, and emerging trends. By examining user engagement and behavior, the index identifies which coins and projects are generating the most interest, and which themes are driving market sentiment.</p><p>With its comprehensive approach, the CoinMarketCap&rsquo;s Crypto Fear and Greed Index provides a uniquely valuable perspective on the cryptocurrency market, empowering users to make better-informed decisions based on a deeper understanding of market sentiment. As a global leader in cryptocurrency data and research analysis, CoinMarketCap is committed to building innovative tools and resources for participants in the crypto industry.</p><p>About CoinMarketCap</p><p>CoinMarketCap is the world's most-referenced price-tracking website for crypto assets in the rapidly growing cryptocurrency space. Its mission is to make crypto discoverable and efficient globally by empowering retail users with unbiased, high quality and accurate information for drawing their own informed conclusions.</p>ContactResearch LeadAlice LiuCoinMarketCapalice.l@coinmarketcap.com"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-03T12:50:00.000Z",
    "title": "eToro Under Legal Fire Down Under",
    "url": "https://cryptodaily.co.uk/2023/08/etoro-under-legal-fire-down-under",
    "description": "<p>An Australian financial regulator has sued the eToro crypto trading platform over &ldquo;volatile&rdquo; trading products.</p>\nASIC Sues eToro&nbsp;\n<p>The Australian Securities and Investment Commission (ASIC) has taken legal action against eToro's crypto trading platform, alleging violations of licensing and distribution regulations. The ASIC's move comes after around 20,000 eToro clients lost money while trading Contract for Difference (CFDs) between October 2022 and June 2023, including 77% of retail investor accounts.&nbsp;</p>\n<p>The CFD product or Contract for Difference is a leveraged derivative contract used by customers to speculate on asset value changes. The ASIC has accused eToro of not acting fairly as required by the design, distribution, and license mandate of the product.&nbsp;</p>\nASIC Alleges Shoddy Screening\n<p>ASIC has alleged that the platform&rsquo;s screening test was not appropriately thorough and, as a result, effectively useless. The commission also claimed that clients could amend their answers however many times they wished, and the platform also prompted the clients to select favorable answers.&nbsp;</p>\n<p>Since the customer base for the CFD product was not defined clearly, it led to retail clients investing in the high-risk product and losing money.&nbsp;</p>\n<p>Consequently, ASIC wants the court to issue declarations and pecuniary penalties against the trading platform.</p>\n<p>ASIC Deputy Chair Sarah Court said,</p>\n\n<p>&ldquo;Our message to the industry is that CFD target markets should be narrowly defined given the significant risk that retail clients may lose all of their deposited funds.&rdquo;</p>\n\nBinance In Similar Waters\n<p>The ASIC is deeply concerned about eToro's alleged wrongdoing, especially given the trading platform's extensive market presence and reputation as a prominent brand expected to adhere to local and international laws.&nbsp;</p>\n<p>Another prominent name in the industry, Binance, has faced similar charges from the United States Department of Justice (DOJ). While the ASIC pursues eToro, the DOJ is considering federal charges against Binance. The allegations against the largest crypto exchange also involve fraud, but the stakes are higher due to the potential impact on customers.&nbsp;</p>\nLegal Action Could Have Consequences\n<p>The DOJ is concerned about a potential run-on effect that could harm Binance customers, similar to what happened with the FTX exchange when its founder, Sam Bankman-Fried, faced legal issues.</p>\n<p>The ASIC's legal action against eToro reflects its strict stance on targeting markets for CFD products. The commission is determined to protect retail investors from significant financial harm. Conversely, the DOJ's approach to Binance is influenced by considerations of customer welfare and potential repercussions on the market. The outcome of Binance's case remains uncertain, pending confirmation from the DOJ.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T13:07:24.000Z",
    "title": "3.0 Verse Launches Unified Marketplace for CeFi and DeFi Trading",
    "url": "https://www.cryptopolitan.com/3-0-verse-launches-unified-marketplace-for-cefi-and-defi-trading/",
    "description": "Dubai, United Arab Emirates, August 3rd, 2023, Chainwire Dubai has emerged as a global VDA hub and digital market convergence by 3.0 Verse will further benefit the global markets and users. In the dynamic world of large number of trading platforms and cryptocurrencies, the need for an intelligent, information driven and comprehensive user-friendly trade routing ... <a title=\"3.0 Verse Launches Unified Marketplace for CeFi and DeFi Trading\" class=\"read-more\" href=\"https://www.cryptopolitan.com/3-0-verse-launches-unified-marketplace-for-cefi-and-defi-trading/\" aria-label=\"More on 3.0 Verse Launches Unified Marketplace for CeFi and DeFi Trading\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T13:04:03.000Z",
    "title": "Can China save Argentina from IMF default?",
    "url": "https://www.cryptopolitan.com/can-china-save-argentina-from-imf-default/",
    "description": "With the weight of economic turmoil bearing down, Argentina has found itself once again on the brink of defaulting on its IMF debt. However, as the world looked on with a mix of concern and skepticism, a powerful ally emerged to throw the struggling nation a lifeline: China. But can China really save Argentina from ... <a title=\"Can China save Argentina from IMF default?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/can-china-save-argentina-from-imf-default/\" aria-label=\"More on Can China save Argentina from IMF default?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T12:58:58.000Z",
    "title": "US Military Deploys ‘Data Robot’ to Combat Deepfakes and Misinformation",
    "url": "https://www.cryptopolitan.com/data-robot-deepfakes-and-misinformation/",
    "description": "The United States military is currently testing an innovative artificial intelligence (AI) tool known as &#8216;Data Robot&#8217; to identify and counter deepfakes and misleading information. This cutting-edge technology is poised to strengthen the information warfare capabilities of the US armed forces, particularly in response to the growing propaganda campaigns orchestrated by adversaries. Data robot to ... <a title=\"US Military Deploys &#8216;Data Robot&#8217; to Combat Deepfakes and Misinformation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/data-robot-deepfakes-and-misinformation/\" aria-label=\"More on US Military Deploys &#8216;Data Robot&#8217; to Combat Deepfakes and Misinformation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T12:57:37.000Z",
    "title": "Aave Chan suggests acquisition of $2M CRV by Aave treasury ",
    "url": "https://www.cryptopolitan.com/aave-chan-suggests-acquisition-of-2m-crv/",
    "description": "The Aave Chan Initiative, introduced within the Aave governance forum, suggested acquiring $2 million worth of curve tokens (CRV) from Michael Egorov, the founder of Curve.&#160; Spearheaded by Marc Zeller, the creator of Pandemic&#8217;s blockchain consultancy firm and a key player in Aave Companies, the initiative is a delegate platform that operates closely with Aave. ... <a title=\"Aave Chan suggests acquisition of $2M CRV by Aave treasury \" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-chan-suggests-acquisition-of-2m-crv/\" aria-label=\"More on Aave Chan suggests acquisition of $2M CRV by Aave treasury \">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T12:47:12.000Z",
    "title": "European economic outlook worries investors",
    "url": "https://www.cryptopolitan.com/european-economic-outlook-worries-investors/",
    "description": "Investor confidence across the continent is being tested as signs point to a potentially painful economic downturn in Europe. Contrasted with a rising optimism in the U.S., which seems set for a &#8220;soft landing,&#8221; the European scene appears to be mired in uncertainty and disarray. Financial markets are reflecting these concerns, but what exactly is ... <a title=\"European economic outlook worries investors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/european-economic-outlook-worries-investors/\" aria-label=\"More on European economic outlook worries investors\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T12:43:00.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.123, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 0.23% decrease. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-03T13:07:57.000Z",
    "title": "Minnesota man loses $9m in LinkedIn crypto romance scam",
    "url": "https://crypto.news/minnesota-man-loses-9m-in-linkedin-crypto-romance-scam/",
    "description": "A man from Minnesota has fallen prey to a crypto romance scam that has cost him a staggering $9 million. The scam originated from a LinkedIn connection that lured him with false promises of quick wealth and professed love. According&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-03T13:00:55.000Z",
    "title": "Bitstamp Teases Major XRP Announcement, But The Market Hesitates",
    "url": "https://www.newsbtc.com/analysis/xrp/bitstamp-major-xrp-announcement-market-hesitates/",
    "description": "In a cryptic move that has the XRP army speculating, Europe&#8217;s leading cryptocurrency exchange, Bitstamp, has teased a significant announcement related to the token. The Luxembourg-based exchange made this known via a tweet that simply read, &#8220;tomorrow,&#8221; accompanied by the XRP-themed hashtags #XRP, #XRPL and #XRPLedger and a suggestive video. The video, a brief animation showing an XRP rocket ascending, indicates that the forthcoming announcement could potentially result in significant news for the XRP Ledger, eventually boosting the price. However, Bitstamp stopped short of offering any explicit hints about what this announcement might entail, leaving the community buzzing with anticipation. Tomorrow.#XRP #XRPL #XRPLedger pic.twitter.com/aZrKAjXK5j — Bitstamp (@Bitstamp) August 2, 2023 What Might Be Bitstamp&#8217;s Announcement? XRP&#8217;s followers were quick to respond, sharing their theories on what Bitstamp&#8217;s forthcoming announcement might involve. Panos, the founder of Digital Generation Finance, expressed his belief that Bitstamp could be set to announce a full integration with the XRP Ledger (XRPL). &#8220;The announcement could reveal that DEX has been connected to Bitstamp&#8217;s order book, focusing on fiat ramps for payments,&#8221; Panos conjectured. Related Reading: Here’s The Total Number Of XRP That Ripple Currently Holds This notion was seconded by prominent XRP community member @XRPcryptowolf, who also postulated that Bitstamp could be planning an XRPL integration. Meanwhile, another XRP fan named @wEeZiE posited that Bitstamp&#8217;s announcement might have something to do with Ripple&#8217;s recent minority stake acquisition in the exchange. Back in May, Ripple acquired a stake in Bitstamp in a bid to expand its international operations and diversify its offerings beyond payments. A transcript of the Galaxy shareholder conference revealed at the time that Ripple had acquired the shares from Pantera Capital, another crypto investment firm based in the US. Pantera was one of Bitstamp&#8217;s largest shareholders until 2018, when the exchange was acquired by Belgian investment firm NXMH. However, it is unclear how much Ripple paid for the acquisition or how the deal was structured. Related Reading: XRP To Skyrocket To $500 Within 7 Months, Predicts Wells Fargo Treasury Manager &#8220;wEeZiE&#8221; stated, &#8220;Recall Ripple president Monica Long&#8217;s comment about Ripple&#8217;s recent stake acquisition in Bitstamp. She mentioned that the move would strengthen Ripple&#8217;s international presence and diversify its offerings beyond payments. Perhaps Bitstamp&#8217;s tease pertains to this?&#8221; Remarkably, Bitstamp has been a major Ripple gateway for years, granting clients access to RippleNet and serving as a key partner for Ripple&#8217;s On-Demand Liquidity (ODL). XRP Investors Don&#8217;t Buy The News At press time, the market has not reacted to the announcement of the announcement. On the contrary, XRP has lost key support at $0.6760 and marked a new 3-week low following the summary judgment in the US Securities and Exchange Commission (SEC) case. For now, the price has found support at the 200 EMA (Exponential Moving Average) at $0.6543. If this support breaks as well, a plunge towards $0.60 could be on the cards. On a bullish note, if Bitstamp&#8217;s announcement tomorrow can excite XRP investors, the $0.6760 level would be the first resistance. In case of a breakout, a spike up to $0.7249 is likely. Featured image from Twitter, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-03T13:08:05.000Z",
    "title": "3.0 Verse Launches Unified Marketplace for CeFi and DeFi Trading",
    "url": "https://www.crypto-news-flash.com/3-0-verse-launches-unified-marketplace-for-cefi-and-defi-trading/?utm_source=rss&utm_medium=rss&utm_campaign=3-0-verse-launches-unified-marketplace-for-cefi-and-defi-trading",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/1920X1080_1690994038jhvhaIzgTM.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/1920X1080_1690994038jhvhaIzgTM.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/1920X1080_1690994038jhvhaIzgTM-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/1920X1080_1690994038jhvhaIzgTM-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/1920X1080_1690994038jhvhaIzgTM-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Dubai, United Arab Emirates, August 3rd, 2023, Chainwire Dubai has emerged as a global VDA hub and digital market convergence by 3.0 Verse will further benefit the global markets and users. In the dynamic world of large number of trading platforms and cryptocurrencies, the need for an intelligent, information driven and comprehensive user-friendly trade routing [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-03T13:05:36.000Z",
    "title": "3 Reasons Why You Should Buy Pepe and Pomerdoge Right Now",
    "url": "https://www.crypto-news-flash.com/3-reasons-why-you-should-buy-pepe-and-pomerdoge-right-now/?utm_source=rss&utm_medium=rss&utm_campaign=3-reasons-why-you-should-buy-pepe-and-pomerdoge-right-now",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T101400.925.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T101400.925.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T101400.925-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T101400.925-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As the cryptocurrency market approaches bull territory, investors are on the lookout for profitable assets. Crypto analysts have ranked Pepe (PEPE) and Pomerdoge (POMD) very highly, but is that enough to buy them? In this article, you will discover three compelling reasons why Pepe and Pomerdoge are must-have coins right now. Click Here To Find [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-03T12:46:48.000Z",
    "title": "BlockFi Inches Closer to Settlement in Bankruptcy Court Win",
    "url": "https://coinedition.com/blockfi-inches-closer-to-settlement-in-bankruptcy-court-win/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Bankrupt_Crypto_Lender_BlockFi_Inches_Closer_to_Refunding_Clients-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>BlockFin has received conditional approval for a disclosure statement from the United States Bankruptcy Court for the District of New Jersey, a report reveals. The firm, which filed for bankruptcy in November 2022, says the approval forms part of its Chapter 11 plans as it inches closer to the settlement of its debts. According to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/blockfi-inches-closer-to-settlement-in-bankruptcy-court-win/\">BlockFi Inches Closer to Settlement in Bankruptcy Court Win</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]