[
  {
    "source": "Decrypt",
    "date": "2024-01-09T22:57:04.000Z",
    "title": "AI Voice Actors Are Coming to Video Games Thanks to SAG-AFTRA Deal",
    "url": "https://decrypt.co/212164/ai-voice-actors-coming-video-games-thanks-sag-aftra-deal",
    "description": "Instead of fighting against generative AI in games, SAG-AFTRA has signed an agreement with one company to moderate its use."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T23:04:13.000Z",
    "title": " Lawyers, politicians call for investigation of SEC over Bitcoin ETF post ",
    "url": "https://cointelegraph.com/news/lawyers-politicians-investigation-sec-bitcoin-etf-post",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNmIxMTJmY2ItNmY3MS00OTJiLTk1NDktMjA0NjFhZTJmNTlkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Charles Gasparino of Fox Business said he’s been told by securities lawyers that the SEC “will have to investigate itself” for alleged market manipulation.</p>\n                    <p><p>United States lawyers and senators have called on Congress to demand an investigation into the Securities and Exchange Commission after its <a href=\"https://cointelegraph.com/news/sec-account-hacked-no-spot-bitcoin-etf-approval\">X account was reportedly compromised</a> and falsely reported news that the spot Bitcoin exchange-traded funds were approved.</p><p>“Just like the SEC would demand accountability from a public company if they made such a colossal market-moving mistake, Congress needs answers on what just happened. This is unacceptable,” <a href=\"https://x.com/SenatorHagerty/status/1744843824654885024?s=20\" target=\"_blank\" rel=\"noopener nofollow\">said</a> U.S. Senator Bill Hagerty in a Jan. 9 X post.</p><p>Charles Gasparino of Fox Business said he’s been told by securities lawyers that the SEC “will have to investigate itself” for market manipulation.</p><p><a href=\"https://cointelegraph.com/news/lawyers-politicians-investigation-sec-bitcoin-etf-post\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T22:59:23.000Z",
    "title": " Why is Bitcoin price volatile today? ",
    "url": "https://cointelegraph.com/news/why-is-bitcoin-price-volatile-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZWU1MTVhODMtOGYwMy00ZjNiLTllNzYtMDg5YTc5NzM2YTdjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin price whipsaws, wiping out leveraged longs and shorts as the SEC’s social account falsely reported that all spot BTC ETFs had been approved. </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price shot up to over $48,000 after the SEC appeared to announce that all spot BTC ETFs were approved. Before the regulator even had a chance to address the <a href=\"https://cointelegraph.com/news/sec-account-hacked-no-spot-bitcoin-etf-approval\">erroneous tweet</a>, Bitcoin price had already retraced to nearly $45,000, a move which would have confirmed traders’ suspicion that an approval would be a sell-the-news event. </p><p>While some analysts believe the Bitcoin price is pointing toward a <a href=\"https://cointelegraph.com/news/bitcoin-derivatives-data-shows-traders-aiming-for\">breakout to $50,000</a>, BTC has more than doubled the 2023 returns of gold, and the momentum has continued in 2024. MicroStrategy CEO and Bitcoin bull Michael Saylor believes a <a href=\"https://cointelegraph.com/news/bitcoin-spot-etf-biggest-wall-street-development-30-years-michael-saylor\">spot Bitcoin ETF</a> would be the biggest to happen to all finance since the S&amp;P 500 launched. </p><p>The positive sentiment around Bitcoin led the BTC market cap to surpass Berkshire Hathaway on Dec. 5, 2023, and it has remained the <a href=\"https://cointelegraph.com/news/btc-market-cap-passes-berkshire-hathaway\">10th-biggest asset</a> by that measure. Despite BTC’s strength, the SEC continues to proceed cautiously, reissuing a <a href=\"https://cointelegraph.com/news/sec-issues-crypto-fomo-warning-ahead-bitcoin-etf-approval\">crypto FOMO warning</a> on Jan. 6. On Jan. 8, the <a href=\"https://cointelegraph.com/news/gary-gensler-warning-crypto-spot-etf\">SEC released another</a> warning on crypto despite approval seeming imminent. </p><p><a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-volatile-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-09T23:00:18.000Z",
    "title": "Valkyrie executive 95% confident in Wednesday spot Bitcoin ETF approval",
    "url": "https://cryptoslate.com/valkyrie-executive-95-confident-in-wednesday-spot-bitcoin-etf-approval/",
    "description": "<p>A top Valkyrie executive has expressed his belief that regulators will approve a spot Bitcoin ETF on Wednesday, TechCrunch reported on Jan. 9. Valkyrie CIO and co-founder Steven McClurg said: &#8220;We’ve been running hard for the last probably six weeks now on this, and it’s been quite exciting &#8230; myself and others are very confident [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/valkyrie-executive-95-confident-in-wednesday-spot-bitcoin-etf-approval/\">Valkyrie executive 95% confident in Wednesday spot Bitcoin ETF approval</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-09T23:00:11.000Z",
    "title": "SEC’s Spot Bitcoin ETF Approval Post Unauthorized — Chair Gary Gensler Says SEC’s X Account Was Compromised",
    "url": "https://news.bitcoin.com/secs-spot-bitcoin-etf-approval-post-unauthorized-chair-gary-gensler-says-secs-x-account-was-compromised/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-spot-bitcoin-etf-x-post2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC&#039;s Spot Bitcoin ETF Approval Post Unauthorized — Chair Gary Gensler Says SEC&#039;s X Account Was Compromised\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-spot-bitcoin-etf-x-post2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-spot-bitcoin-etf-x-post2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-spot-bitcoin-etf-x-post2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-spot-bitcoin-etf-x-post2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-spot-bitcoin-etf-x-post2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-spot-bitcoin-etf-x-post2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-spot-bitcoin-etf-x-post2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Securities and Exchange Commission (SEC)’s X account announced the approval of spot bitcoin exchange-traded funds (ETFs) on Tuesday. However, minutes later, SEC Chairman Gary Gensler claimed that the agency&#8217;s social media account was compromised and the post was unauthorized. Some suspect an internal SEC error behind the premature bitcoin ETF announcement. SEC&#8217;s &#8216;Unauthorized&#8217; [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-09T23:00:18.000Z",
    "title": "Coinbase Expects A Repeat Of 2018-2022 Bitcoin Cycle, What This Means For Crypto",
    "url": "https://www.newsbtc.com/news/bitcoin/coinbase-2018-2022-bitcoin-cycle/",
    "description": "Crypto exchange Coinbase, one of the largest exchanges in the world, has released its latest report on Bitcoin and the crypto market, highlighting its expectations for the Industry. The 44-page report launched by Coinbase Institutional in conjunction with Glassnode predicts a repeat of one of the most explosive bull markets in recorded crypto history; the 2018-2022 market cycle. Coinbase Says Bitcoin Will Repeat 2018-2022 Cycle In the report, Coinbase and Glassnode analysts take into account a number of indicators and metrics, such as total supply in profit, among others, to figure out which trend the next bull market is expected to follow. Now, after consideration and comparison to all of the previous bull cycles, the analysts settle on the 2018-2022 cycle being the most likely to be emulated this time around. Related Reading: Crypto Analyst Identifies XRP Bear Flag To Trigger A Massive Crash To $0.07 So far, Bitcoin and Ethereum are the cryptocurrencies that have shown the most correlation at the start of the 2018-2022 cycles, suggesting that a similar breakout could be in the cards. However, looking at the chart, it shows a sharp deviation from the previous cycles, especially as the bull market looks to be starting earlier than it did in 2020. When it comes to the level of risk associated with assets such as Bitcoin and Ethereum, the report highlights the fact that crypto has deviated from traditional assets once again. This comes after the correlation between crypto and traditional finance markets rose to new all-time highs back in 2022. But as Coinbase explains, “2023 saw a reversion to historical norms, indicating that crypto can be a source of idiosyncratic risk.” As another Bitcoin halving event draws near, Bitcoin has also seen a resumption in its surge, spurred forward by expectations of a Spot Bitcoin ETF. Coinbase notes that “As crypto has matured as an asset class and institutional participation has increased, volatility has trended steadily lower.” BTC price shakes out longs before recovering &#124; Source: BTCUSD On Tradingview.com What Happens If BTC Price Repeats 2018-2022 Cycle? Looking back at the last bull cycle shows us what to expect if Bitcoin and the crypto market at large were to repeat the same trend. In this case, expectations would be that the BTC price would rise at least 3x higher than its previous all-time high price of $69,000. In this case, Bitcoin would be looking at a value of at least $200,000 by the time the next bull market is in full swing. Following the 3.6x move that Bitcoin did to reach its new 2021 all-time high versus its 2018 all-time high, the BTC price would be looking at a cycle peak of almost $250,000. Related Reading: Crypto Analyst Predicts 100% Surge For Shiba Inu, But There’s A Roadblock As for Ethereum, following the same trend and doing a 3.2x from its previous all-time high to its new all-time high, it would put the ETH price above $15,000. In the same vein, the crypto market would also rise more than $10 trillion. However, all of this is speculation as the crypto market has been known to deviate from expectations. Like the previous bull markets, the next one is expected to be novel, especially given the fact that institutional investors have fully come out to play. This could mean hundreds of billions of dollars in liquidity injections that could drive prices higher than expected. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Analytics Insight, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-09T23:01:11.000Z",
    "title": "Media Empire Fox Corporation Taps Polygon Blockchain To Power New Verification System",
    "url": "https://dailyhodl.com/2024/01/09/media-empire-fox-corporation-taps-polygon-blockchain-to-power-new-verification-system/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/01/explosive-polygon-davis.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/01/explosive-polygon-davis.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/01/explosive-polygon-davis.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/01/explosive-polygon-davis.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/01/explosive-polygon-davis.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/01/explosive-polygon-davis.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/01/explosive-polygon-davis.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Fox Corporation is tapping into the Polygon (MATIC) ecosystem as part of a new protocol for media provenance. In a new announcement, Polygon Labs says they are partnering with the media giant to launch Verify, a system that uses the transparency of blockchain to prove the authenticity and identity of media content in the age of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/09/media-empire-fox-corporation-taps-polygon-blockchain-to-power-new-verification-system/\">Media Empire Fox Corporation Taps Polygon Blockchain To Power New Verification System</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]