[
  {
    "source": "Decrypt",
    "date": "2023-07-10T22:29:49.000Z",
    "title": "Scientists use AI to Discover Drugs That Kill “Zombie Cells” and Fight Age-Related Diseases",
    "url": "https://decrypt.co/147681/scientists-use-ai-to-discover-drugs-that-kill-zombie-cells-and-fight-age-related-diseases",
    "description": "A group of researchers used AI to do in five minutes what could have taken weeks: Discovering new drugs that can kill senescent cells."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-10T22:27:57.000Z",
    "title": "Bitcoin has entered a civil war — Over ‘art’",
    "url": "https://cointelegraph.com/news/bitcoin-has-entered-a-civil-war-over-art",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/635bae5e-86d9-4269-bfc9-8c771a1d0e87.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Ordinals Protocol is generating a circular digital economy where assets are priced, bought and sold via Bitcoin.</p>\n                    <p><p>In an email dated Jan. 17, 1993, Hal Finney — a developer and early contributor to Bitcoin — shared the concept of “encrypted digital cards,” which are now known as <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a>.</p><p>“Giving a little more thought to the idea of buying and selling digital cash, I thought of a way to present it,” Finney wrote at the time. “We’re buying and selling ‘cryptographic trading cards.’”</p><p>The most fascinating detail of his email lies in the fact that, by sharing this idea, Finney intended to facilitate the understanding of the concept of digital money. His vision foreshadowed what we saw in 2021 with the NFT boom. Overnight, the crypto space shifted from being solely about financial decentralization to also encompassing the decentralization of art, gaming, entertainment and more.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5134db43-b2ec-4833-a1b0-1f041f87e6d8.jpg\"  /><figcaption style=\"text-align: center;\"><em>Hal Finney's email about \"encrypted digital cards.\"</em></figcaption></figure><p>The narrative that was once theoretical and pushed forcefully became practical and part of the daily culture of millions of people who had never considered buying cryptocurrencies before. And with the introduction of the Ordinals protocol in early 2023, we are witnessing the emergence of such cases.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-fragments-more-valuable-than-full-bitcoins\"><strong><em>Bitcoin fragments could become more valuable than full Bitcoins</em></strong></a></p><p>However, this movement is not being well-received by some “red-eyed guardians.”</p><h2>The Wizard JPEG that sparked a civil war in Bitcoin</h2><p>In February 2023, the Taproot Wizards achieved a notable feat using the Ordinals protocol. They generated the largest block ever recorded in Bitcoin’s history at that time, reaching nearly 4 megabytes in size.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/f0dd7580-f0fe-489a-8a8c-e1036825da7b.jpg\"  /><figcaption style=\"text-align: center;\"><em>Eric Wall tweet about the largest block in Bitcoin's history. Source: Twitter </em></figcaption></figure><p>Their goal was clear: to challenge the existing norms and cultivate an experimental and rebellious mindset within the Bitcoin ecosystem. More than 14 million inscriptions have occurred since the “Wizard Block,” generating something magnificent: a circular digital economy where assets are priced, bought and sold via Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). (Inscriptions inscribe sats with content, creating NFTs.)</p><h2>Liberté, rare sats and Fraternité</h2><p>To illustrate the rapid pace of experiments within this ecosystem, in February, traders were buying and selling Ordinal NFTs using Google Sheets since there were no available marketplaces.</p><p>“We are experimenters in an experimental protocol. And my goal is clear: to onboard, educate, entertain and experiment on the Bitcoin blockchain,” a figure in the Ordinal ecosystem who goes by “BitGod” told me in an interview.</p><p>Yet, in a matter of mere months, notable corporations and projects entered the scene, providing some framework for this market. As a result, the market has witnessed over 140,000 distinct users and a trading volume surpassing $220 billion.</p><p>And among the experiments sparking this interest, one narrative has captured the attention of the general public: rare sats.</p><p>Many projects are using this narrative to tokenize their artworks. CTRL, for example, was the first project to inscribe on a “Rare” satoshi. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/392a4ec8-dc68-413e-a95b-93a42db4c8ea.jpg\"  /><figcaption style=\"text-align: center;\"><em>CTRL's tweet about inscribing the first \"Rare\" Satoshi. Source: Twitter</em></figcaption></figure><p>“I think the image symbolizes the CTRL movement and its inflection point at the time of discovering the Rare sat,” Jameson Mah told me. “The movement is diverse, humble, cypherpunk, fresh blood and energy. CTRL is quite literally replacing the vintage $2 bill that represents the old archaic systems, and the hash of the Rare sat inscription peeking out the back. Then Satoshi Nakamoto’s genesis block message that started it all is illuminated by the light of the power of the Rare sat in the center. It’s non-violent, but it’s also clearly rebellious.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-etfs-even-worse-for-crypto-than-central-exchanges\"><strong><em>Bitcoin ETFs: Even worse for crypto than central exchanges</em></strong></a></p><p>Currently, only eight Rare sats similar to the one used by CTRL in their artwork have been found. And one of them has a bid of $600,000 in an auction. The other one is Gansy, the founder of the Rare Satoshi Society. He disclosed that RSS has already generated over $2.5 million by providing satoshis with specific attributes for more than 100 Ordinals projects. With the objective of preserving their status as the leading supplier of rare sats in the market, his team has already transacted over $3 billion in BTC, searching for the gems that constitute their current portfolio.</p><p>There are several other experiments bringing fresh blood to the Bitcoin ecosystem. Prominent Ordinals use cases that deserve exploration include BRC-20, bitmap and recursive inscriptions.</p><h2>What to expect from Bitcoin season 2?</h2><p>Recognizing Ordinals as a highly complementary movement to the success of Bitcoin is crucial. The ecosystem’s triumph does not hinge on a single solution, but rather a combination of various factors that contribute to its prosperity.</p><p>In certain instances, such as in Argentina, the adoption of Bitcoin will be driven by necessity. For others, it will stem from their fascination with the underlying principles of Bitcoin. Institutional adoption through ETFs will contribute a significant portion to the adoption curve. Additionally, the emergence of Ordinals applications will bring a dual benefit to the network, fostering both adoption and the evolution of the ecosystem’s infrastructure.</p><p>“My first expectation is that many projects will experiment on Bitcoin,” Mah said, adding, “Next, with this renewed interest, the network will become a lot more expensive to use. Therefore, some of this activity logically should move to<a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-understanding-the-layers-of-blockchain-technology\"> layer 2s</a>. Many builders are already experimenting with rollup architecture on top of Bitcoin, for example.”</p><p>To conclude, Mah said, “It’s important among the hype to always look for true innovation, substance and creativity — and importantly, Bitcoin-native thinking.”</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Lugui Tillier</strong> is the chief commercial officer of Lumx Studios, a Web3 studio that counts BTG Pactual Bank, the largest investment bank in Latin America, among its investors. Lumx Studios has previous Web3 cases with Coca-Cola, AB InBev, Nestlé and Meta.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-10T22:10:48.000Z",
    "title": "Bitcoin ETF approval could be ‘hard to resist,’ ex-SEC chair Jay Clayton says",
    "url": "https://cryptoslate.com/bitcoin-etf-approval-could-be-hard-to-resist-ex-sec-chair-jay-clayton-says/",
    "description": "<p>Former SEC chair Jay Clayton suggested during a CNBC interview on July 10 that regulators could soon feel compelled to approve a spot Bitcoin ETF. Clayton explained that the U.S. Securities and Exchange Commission (SEC) has previously chosen to reject spot Bitcoin ETFs while approving futures Bitcoin ETFs based on the latter&#8217;s surveillance sharing agreements [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-etf-approval-could-be-hard-to-resist-ex-sec-chair-jay-clayton-says/\">Bitcoin ETF approval could be &#8216;hard to resist,&#8217; ex-SEC chair Jay Clayton says</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-10T22:33:04.000Z",
    "title": "Spot bitcoin ETFs deserve approval, asserts former SEC chairman Jay Clayton",
    "url": "https://crypto.news/spot-bitcoin-etfs-deserve-approval-asserts-former-sec-chairman-jay-clayton/",
    "description": "In a recent CNBC interview, former SEC Chair Jay Clayton discussed the changing regulatory environment surrounding bitcoin ETFs, stating that it would be challenging to resist approving them. Clayton explained that institutions are arguing that the distinctions between spot and&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-10T22:19:47.000Z",
    "title": "The One Ingredient Missing From A Full-Bore Bitcoin Bull Run",
    "url": "https://www.newsbtc.com/bitcoin-news/one-ingredient-missing-bitcoin-bull-run/",
    "description": "Bitcoin price is showing resilience in the face of adversity and is up nearly 100% from bear market lows. However, it has yet to show signs of an undeniable bull market as it has in the past. That&#8217;s because of just one missing ingredient, according to a new BTCUSD weekly chart. Bitcoin Bullish Momentum: The Missing Ingredient When cooking, or especially baking, missing even one ingredient can change the end result of the desired dish or dessert. For example, sweets without any sugar just aren&#8217;t that sweet. A prime cut of steak doesn&#8217;t quite taste as good if it hasn&#8217;t had a proper seasoning and sear. Related Reading: Bitcoin Reaches Longest Stretch Ever Without A Bull Run Similarly, a cryptocurrency bull market without the weekly Relative Strength Index at overbought levels, just simply isn&#8217;t a Bitcoin bull run. Historically, Bitcoin reaching oversold conditions has been a requirement for a full-bore bullish impulse. The 1W RSI is currently lacking that key signal appears to be preventing the market from pushing dramatically higher. It’s been a long time since bulls had a turn &#124; BTCUSD on TradingView.com Why Overbought RSI Is Required For A Full-Bore BTCUSD Rally The term &#8220;full-bore&#8221; is rather fitting, with Merriam-Webster defining it as &#8220;with maximum effort or speed.&#8221; The Relative Strength Index provides a read on momentum, by taking a measurement of the speed of price changes within a specific time period. When prices are moving exceedingly fast in one direction, maximum buying or selling effort is required. This is precisely why reaching overbought or oversold conditions can lead to a reversal – it takes consistently increasing effort to maintain maximum speed. However, in cryptocurrencies, the speculative nature of their pricing can result in extreme phases of FOMO where conditions remain overbought at length. Such phases, called a bullish impulse, show corresponding overbought levels in the RSI historically in BTCUSD. Related Reading: Why Bitcoin Dominance Hints At A Surprise Altcoin Season Ahead This particular ingredient is still missing currently in 2023, after is last appearing in 2021 and prior to that 2019. During the 2017 bull run in crypto, Bitcoin repeatedly reached overbought levels, only to return to the zone as it kept soaring higher and higher. Will BTCUSD weekly push higher and finish the recipe? Or is this a sign of a bear market rally? This chart originally appeared in Issue #11 of CoinChartist (VIP). Subscribe now for free. Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]