[
  {
    "source": "CoinDesk",
    "date": "2023-08-01T12:25:22.000Z",
    "title": "First Mover Americas: Bitcoin Starts August in the Red After Losing Ground in July ",
    "url": "https://www.coindesk.com/markets/2023/08/01/first-mover-americas-bitcoin-starts-august-in-the-red-after-losing-ground-in-july/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for August 1, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-01T12:30:00.000Z",
    "title": "Worldcoin launch sparks debate over data privacy and future of AI",
    "url": "https://cointelegraph.com/news/worldcoin-launch-sparks-debate-over-data-privacy-and-future-of-ai",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/fb364232-2b80-4a5b-a813-abc8e6b92ea9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Worldcoin launch has sparked a new debate on the future of decentralized identity, artificial intelligence and whether iris-scanning is the only way forward.</p>\n                    <p><p>The controversial digital ID crypto project Worldcoin <a href=\"https://cointelegraph.com/news/worldcoin-launches-token-to-distinguish-humans-from-bots\">launched on July 24</a> after three years of development. </p><p>The project was co-founded by Sam Altman, the CEO of OpenAI — the company behind the popular artificial intelligence (AI)-based chatbot ChatGPT. </p><p>Worldcoin made headlines right after its announcement in June 2021, as it promised to create a futuristic digital identity system by scanning people’s eyeballs. </p><p>Worldcoin claims it will become increasingly difficult to differentiate between humans and bots online as AI technology advances. Thus, to differentiate humans from AI, it created a digital ID system based on “proof of personhood.” This digital ID will be generated by scanning an individual’s iris and giving them a “World ID.”</p><p>The firm claims all biometric data will be saved on a decentralized blockchain, and the project does not store any personal data. It generates a <a href=\"https://cointelegraph.com/explained/zero-knowledge-proofs-explained\">zero-knowledge proof</a> to verify that the user is human without revealing the data used to create the proof.</p><p>Despite lingering controversy since its announcement, Worldcoin secured <a href=\"https://cointelegraph.com/news/sam-altman-worldcoin-secures-115-million-decentralized-id\">$115 million in funding</a> in May and managed to garner over 2 million signups before its official launch to the public.</p><h2>Worldcoin ecosystem</h2><p>Worldcoin combines World ID and the Worldcoin (WLD) token — two essential ecosystem components. </p><p>The former is a privacy-focused digital identity that assists people in authenticating their identity and uniqueness online while protecting their anonymity. To receive a World ID, users must go through biometric verification using an “Orb.” After completing this verification, individuals are given a unique World ID and, where permitted by law, WLD tokens.</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/magazine/nft-collector-on-chain-music-sounds-off-with-latest-raise-artistic-duo-hackatao-find-their-lane/\">NFT Collector: On-chain music sounds off with latest raise, artistic duo Hackatao find their lane</a> </em></strong></p><p>The digital ID ecosystem also consists of the World App, which functions as a wallet and offers decentralized finance services. The app also contains users’ unique World ID generated by an iris scan. The company claims the app can verify users on any third-party applications. </p><p>Users can scan their iris at designated locations using an Orb. After their irish is scanned, a user receives 25 WLD tokens. Several leading cryptocurrency exchanges, including Binance, Bybit, OKX, Gate.io and Huobi, have already listed the token.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/984be499-b779-4eab-8969-2daeae66653e.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">A Worldcoin Orb is used for iris scanning. Source: Worldcoin</figcaption></figure><p>Bybit’s head of communication, Nathan Thompson, told Cointelegraph that WLD was listed on the platform based on community demand. Asked about the challenges that the project might face, Thompson said that the most significant challenge is public perception:</p><blockquote>“Crypto natives will struggle to get behind a project whose core values are the antithesis of everything they stand for, while ‘nocoiners’ would require significant education on the project’s benefits if they are expected to support the project.”</blockquote><p>Nick Dazé, the CEO of Heirloom — a Web3 platform that proves credentials and personhood — told Cointelegraph that Worldcoin is very interesting, but the execution is way off:</p><p>“Without empowering the creator of this identity to wholly own and control the identity in an immutable way, the project is perilous. If the data is decentralized, sophisticated hacks might be disincentivized because the payoff for the hacker would be harder to understand. However, a massive ‘honey po’ with thousands or millions of IDs is a great target for expensive, professional, possibly state-sponsored hacking operations.” </p><h2>Criticism over data privacy</h2><p>The project has attracted criticism across the board from privacy activists, cybersecurity experts and crypto enthusiasts. Ethereum co-founder <a href=\"https://cointelegraph.com/news/worldcoin-token-launch-sparks-response-from-vitalik-buterin\">Vitalik Buterin was among the first to react</a> to the launch, raising concerns over the method used to create World IDs. Buterin said that someone could potentially scan another person’s iris to determine whether they had a World ID. </p><p>Reporters for the MIT Technology Review <a href=\"https://www.technologyreview.com/2022/04/06/1048981/worldcoin-cryptocurrency-biometrics-web3/\" target=\"_blank\" rel=\"noopener nofollow\">claim</a> that Worldcoin used “deceptive marketing practices, collected more personal data than it acknowledged, and failed to obtain meaningful informed consent.” They further claimed that a major chunk of its early signups came from developing countries in Asia and Africa, where data and privacy laws are not as stringent. </p><p>Cointelegraph reached out to Worldcoin regarding data privacy concerns; a spokesperson said the Worldcoin Foundation complies with all laws and regulations governing the processing of personal data in the markets where Worldcoin is available. The spokesperson added:</p><blockquote>“From its inception, Worldcoin was designed to protect individual privacy. The project has implemented a privacy-centric design and has built a robust privacy program, conducting a rigorous data protection impact assessment and responding timely to individual requests to delete their personal data.”</blockquote><h2>Where is Worldcoin launching?</h2><p>The project was launched in 35 cities across 20 countries, with new signups starting on July 24. Even though the project managed upward of 2 million signups, the response after its <a href=\"https://cointelegraph.com/news/crypto-worldcoin-struggles-scan-iris\">launch seemed lackluster</a> based on early reports. </p><p>Hong Kong recorded the highest number of signups among 20 countries in the first couple of days, accounting for nearly half of all signups. However, on average, the three locations in Hong Kong saw around 200 signups, taking the total number of signups on the first day to about 1000, which is relatively low compared to the pre-release signups.</p><p>When Cointelegraph reached out for the exact number of signups since the release of the project, Worldcoin didn’t offer any numbers, but it did refer to a tweet from Altman:</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">day 3 of <a href=\"https://twitter.com/worldcoin?ref_src=twsrc%5Etfw\">@worldcoin</a> launch, crazy lines around the world. one person getting verified every 8 seconds now. <a href=\"https://t.co/vHRu1sWMT3\">pic.twitter.com/vHRu1sWMT3</a></p>&mdash; Sam Altman (@sama) <a href=\"https://twitter.com/sama/status/1684297687708098565?ref_src=twsrc%5Etfw\">July 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Worldcoin is not launching WLD in the United States and has clarified in its terms of service that it is “not intended to be available for use, purchase, or access” for U.S. residents. </p><p>The U.S. has a history of regulating biometric data, and Fetch.ai CEO Humayun Sheikh told Cointelegraph that the project’s founders seem to be well aware of this regulatory resistance. Worldcoin has primarily focused on countries with fewer privacy rights and regulations for testing, such as Kenya, Sudan and Ghana. </p><p>“Apart from the U.S., the project may also face regulatory troubles from the European Union. While the company claims that it follows the General Data Protection Regulation, The EU has some of the strictest data protection laws in the world. The very nature of Worldcoin’s operations involves building a biometric database. So, they are likely to face challenges in complying with these laws. Even countries like India — where Worldcoin has already started its operations — would be keen to probe into Worldcoin because of their upcoming data protection bill,” Sheikh said.</p><p>The United Kingsom’s data regulatory body said it is looking to investigate Worldcoin, while the French privacy watchdog has <a href=\"https://www.reuters.com/technology/frances-privacy-watchdog-says-worldcoin-legality-seems-questionable-2023-07-28/\" target=\"_blank\" rel=\"noopener nofollow\">raised</a> the alarm on the data collection methods used by the project.</p><p>Fraser Edwards, the co-founder and CEO at decentralized data infrastructure provider cheqd, told Cointelegraph that Worldcoin has elements of best practice (only biometric templates are stored if chosen), but it still ultimately creates a centralized database of these templates, and does so with little to no informed consent, i.e., actually telling people what they’re giving up. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/how-blockchain-is-transforming-fundraising-for-startups-and-entrepreneurs\">How blockchain is transforming fundraising for startups and entrepreneurs</a></em></strong></p><p>He noted that this approach could be dangerous, citing the recent <a href=\"https://www.hrw.org/news/2021/06/15/un-shared-rohingya-data-without-informed-consent\" target=\"_blank\" rel=\"noopener nofollow\">scandal</a> with Rohingya refugees: “UNHCR [United Nations High Commissioner for Refugees] shared the biometric templates of Rohingya refugees to Bangladesh for aid provisioning, who then shared them directly back to the government of Myanmar, i.e., where the refugees had fled to escape genocide.”</p><blockquote>“As soon as these templates are linked to identity (possibly with the Orb), these biometrics can be used to identify people. We need to account for unintended consequences, and a global biometric database is the highest of stakes in unintended consequences.”</blockquote><p>As AI and the supposed solutions to the problems it has created continue to develop, it will be crucial for regulators to keep up with the times and create dynamic frameworks to ensure user privacy and security.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/worldcoin-launch-sparks-debate-over-data-privacy-and-future-of-ai&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-01T12:30:54.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Starts August Trading Below $29,000",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-starts-august-trading-below-29000/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2119648130-2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Starts August Trading Below $29,000\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2119648130-2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2119648130-2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2119648130-2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2119648130-2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2119648130-2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2119648130-2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2119648130-2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin dropped below the $29,000 level to start the month of August, as the greenback continued to strengthen versus other G7 currencies. The U.S. dollar rose ahead of this afternoon&#x2019;s manufacturing Purchasing Managers Index (PMI), which is expected to climb to a reading of 46.8. Ethereum fell to a five-week low. Bitcoin Bitcoin (BTC) slipped [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T12:19:40.000Z",
    "title": "Microsoft, Nvidia, and Caterpillar Are the Top Three AI Bets on Wall Street",
    "url": "https://www.cryptopolitan.com/microsoft-nvidia-and-caterpillar-ai-bets/",
    "description": "Artificial Intelligence (AI) is poised to revolutionize the world and bring new fortunes to Wall Street. According to Dave Smith, the Executive Vice President of Domestic Equities at Bailard, Generative AI represents the potential for the most impactful breakthrough in the last decade. This transformative technology is expected to lead to a proliferation of AI-based ... <a title=\"Microsoft, Nvidia, and Caterpillar Are the Top Three AI Bets on Wall Street\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microsoft-nvidia-and-caterpillar-ai-bets/\" aria-label=\"More on Microsoft, Nvidia, and Caterpillar Are the Top Three AI Bets on Wall Street\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-01T12:25:35.000Z",
    "title": "Bullish Momentum Surging in PEPE: Will Bears Surrender Soon?",
    "url": "https://coinedition.com/bullish-momentum-surging-in-pepe-will-bears-surrender-soon/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"PEPE Token Surges\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/PEPE-Token-Surges-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Pepe&#8217;s (PEPE) decline has been most pronounced in the previous 24 hours, with the price dropping from a high of $0.000001296 to a 30-day low of $0.000001208. At the time of publication, Pepe&#8217;s price showed indications of stability, having begun to rebound marginally, hitting $0.000001234. If the bears lose market control and the bulls retake [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bullish-momentum-surging-in-pepe-will-bears-surrender-soon/\">Bullish Momentum Surging in PEPE: Will Bears Surrender Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-01T12:16:18.000Z",
    "title": "Could Uniswap (UNI) Take Advantage of Curve Finance’s (CRV) Fall?",
    "url": "https://coinedition.com/could-uniswap-uni-take-advantage-of-curve-finances-crv-fall/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Uniswap_labs_announced_that_theyve_raised_165_million.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Uniswap_labs_announced_that_theyve_raised_165_million.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Uniswap_labs_announced_that_theyve_raised_165_million-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Uniswap_labs_announced_that_theyve_raised_165_million-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Uniswap_labs_announced_that_theyve_raised_165_million-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Uniswap_labs_announced_that_theyve_raised_165_million-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Uniswap_labs_announced_that_theyve_raised_165_million-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Decentralized Exchange (DEX) landscape has been witnessing intense challenges and recent market developments have brought Curve Finance (CRV) into the spotlight. As one of the leading DEX platforms, Curve Finance gained traction, but for the wrong reasons after its liquidity pool suffered an exploit. Following the unfortunate incident, the CRV price tanked by 10.24% [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/could-uniswap-uni-take-advantage-of-curve-finances-crv-fall/\">Could Uniswap (UNI) Take Advantage of Curve Finance’s (CRV) Fall?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]