[
  {
    "source": "CoinDesk",
    "date": "2023-07-10T09:00:00.000Z",
    "title": "15 Retail CBDCs Likely by 2030, BIS Study Says",
    "url": "https://www.coindesk.com/policy/2023/07/10/15-retail-cbdcs-possible-by-2030-bis-study-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A survey conducted by the Bank for International Settlements found 93% of central banks worldwide were engaged in digital currency work in 2022."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-10T08:50:27.000Z",
    "title": "Here’s what SOC 2 compliance audits mean for crypto projects",
    "url": "https://cointelegraph.com/news/crypto-soc-2-here-s-what-soc-2-compliance-audits-mean",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/8a92c3ba-fd2b-417e-bb37-c3a70c5af645.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>While the audit demonstrates trust and transparency, Eric Lister from audit firm A-LIGN explained that it does not improve business systems. </p>\n                    <p><p>While trust in the crypto space was severely damaged by a series of global incidents, some still hope to regain this trust by going through processes that provide assurances of compliance with certain business standards like the proper handling of customer data. </p><p>A number of firms have published press releases to announce their compliance with the Service and Organization Controls (SOC) 2 Type 2 audit, which was created to attest to the security and data-handling prowess of their firms. </p><p>To learn more about what this type of security audit means for the industry, Cointelegraph reached out to Eric Lister, the director of service delivery at audit firm A-LIGN, to see what this type of certification could do for crypto companies. </p><p>In a statement, Lister highlighted some of the elements they're looking for during this audit, what this means for the crypto space and how this helps crypto companies to do better. According to Lister: “At a very basic level, we are looking for policies and procedures that outline routine business procedures that guide the operation of the business.” </p><p>In addition, the auditors look for documentation that shows controls that ensure that the procedures are operating effectively and are ensuring the protection of the firm’s system and its corresponding data. He said: </p><blockquote>“Crypto faces a challenge with news of control issues at exchanges in the past 12 months. SOC 2 audits allow crypto companies to demonstrate trust and transparency with customers, especially when it comes to safeguarding customer data and assets.”</blockquote><p>Lister noted that the successful SOC 2 audit would show data and system security. Moreover, the executive said that it would also attest to security over customer funds which is the topmost concern of customers and government agencies. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitgo-completes-further-soc-2-compliance-certification-year-after-deloitte-award\"><strong><em>BitGo completes further SOC 2 compliance certification year after Deloitte award</em></strong></a></p><p>While the audit provides assurances, Lister clarified that it does not improve business systems. “The SOC certification does not improve business systems, but it gives comfort to users and interested parties that controls are in place and operating effectively,” he explained. </p><p>Many prominent crypto companies have already passed this audit process. On July 6, crypto lending firm Nexo said that it has strengthened its data security by passing this process. According to Nexo, this event is a new milestone that enhances user security within their platform. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">️ Nexo is now SOC 2 Type 2 compliant, as audited by <a href=\"https://twitter.com/aligncompliance?ref_src=twsrc%5Etfw\">@aligncompliance</a>.<br><br>The independent examination attests to our processes’ alignment with the most rigorous data privacy and protection standards worldwide.<br><br>Advancing our commitment to your peace of mind.<a href=\"https://t.co/HC82oXFSNB\">https://t.co/HC82oXFSNB</a></p>&mdash; Nexo (@Nexo) <a href=\"https://twitter.com/Nexo/status/1676939178263695363?ref_src=twsrc%5Etfw\">July 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In 2022, crypto exchange crypto.com also <a href=\"https://crypto.com/company-news/crypto-com-completes-soc-2-type-ii-compliance\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that it passed the SOC 2 Type 2 audit. Back then, the firm highlighted that passing the audit proves its commitment to meeting highly regulated standards. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\"><strong><em>Tornado Cash 2.0: The race to build safe and legal coin mixers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-10T08:40:00.000Z",
    "title": "CPI meets low BTC supply — 5 things to know in Bitcoin this week",
    "url": "https://cointelegraph.com/news/cpi-btc-supply-5-things-bitcoin-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/17cc53ef-e440-4b6a-bf08-c8dabf8a1b88.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin is proving everything is bullish but BTC price action this week, with network fundamentals and accumulation data in “up only” mode.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) begins a new week barely clinging to $30,000 as a “bearish divergence” sets the tone.</p><p>After a quiet weekend, BTC price action faces a potential pullback period within its broader bullish trend, traders say.</p><p>What could be on the menu for the market this week? </p><p>After a relative period of calm, external triggers are back for risk assets, with a slew of United States macroeconomic data releases combined with multiple speeches from Federal Reserve officials.</p><p>Add to that some interesting dynamics around U.S. BTC buying now in play, and the recipe for volatility is there.</p><p>Cointelegraph looks at these factors and more in the weekly rundown of what might move markets in the coming days.</p><h2>Limp $30,000 support gets traders hungry for BTC price dip</h2><p>Bitcoin may have closed the week at just over $30,000, confirmed by data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a>, but its strength now looks less convincing.</p><p>A dip into the $20,000 zone immediately afterward set the tone for traders, who believe that a retracement period could enter before upside resumes.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/6c5e5a93-60a8-4bc1-96db-023144235755.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><p>“Will be looking for trend continuation so another higher low between current price &amp; $28K,” trader Skew <a href=\"https://twitter.com/52kskew/status/1678199761822978048\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> in his short-term forecast. </p><blockquote>“Else obvious weakness leads to a break in the 1W structure (Equal high &amp; LL below $25K).”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/9a70a080-8967-40d7-b40d-ab48c430cec0.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Skew/Twitter</em></figcaption></figure><p>Fellow trader Jelle eyed a warning sign on weekly timeframes.</p><p>“Bitcoin locked in a weekly bearish divergence overnight,” he <a href=\"https://twitter.com/CryptoJelleNL/status/1678299461255045120\" target=\"_blank\" rel=\"noopener nofollow\">told</a> Twitter followers about relative strength index (RSI) behavior after the candle close. </p><blockquote>“Time to play defense for a while. The bull market is coming, but pullbacks are part of the game. Bidding lower, let’s see.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/74382831-eec7-4da5-be3f-6759604c61a1.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart with RSI. Source: Jelle/Twitter</em></figcaption></figure><p>For Crypto Tony, the downside could be limited to $29,500, this complementing a previous trip to new yearly highs the week prior.</p><p>“Sweep of $29,500 makes sense to me as the bulls just seem weaker and weaker right now. We have a sweep of the liquidity above us, so now it is time to grab the liquidity below us If you are not yet in a position, be sure to wait for this test and reclaim,” he <a href=\"https://twitter.com/CryptoTony__/status/1678290456403234818\" target=\"_blank\" rel=\"noopener nofollow\">summarized</a>.</p><p>A further post zoomed out to <a href=\"https://twitter.com/CryptoTony__/status/1678121088725729282\" target=\"_blank\" rel=\"noopener nofollow\">predict</a> up to 40% higher for BTC/USD in 2023, this nonetheless to be followed by a “bigger correction.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/957b88a3-bd25-4dc0-89ab-8a4b3f65c0c9.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Crypto Tony/Twitter</em></figcaption></figure><h2>8 Fed speakers accompany major macro data week</h2><p>Macro commentators have their work cut out this week as the Consumer Price Index (CPI) leads U.S. economic data prints.</p><p>Due on July 12, CPI showing inflation dropping will go some way to lessening a still-hawkish Fed.</p><p>Markets almost unanimously agree that interest rates will rise again after last month’s pause, with trend-beating data apt to spark some last-minute uncertainty.</p><p>CPI will be followed by Producer Price Index (PPI) a day later, while a total of eight Fed officials will deliver remarks on the economy and policy.</p><p>“Volatility is set to return to markets this week,” financial commentary resource, The Kobeissi Letter, <a href=\"https://twitter.com/KobeissiLetter/status/1678033788088074242\" target=\"_blank\" rel=\"noopener nofollow\">forecast</a> while summarizing the calendar.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Fed Speakers This Week:<br> <br>1. Fed Vice Chair Barr - Monday<br> <br>2. FOMC Member Daly - Monday<br> <br>3. FOMC Member Mester - Monday<br> <br>4. FOMC Member Bostic - Monday<br> <br>5. FOMC Member Bullard - Tuesday<br> <br>6. FOMC Member Kashkari - Wednesday<br> <br>7. FOMC Member Mester - Wednesday<br> <br>8. Fed Board…</p>&mdash; The Kobeissi Letter (@KobeissiLetter) <a href=\"https://twitter.com/KobeissiLetter/status/1678057430180065283?ref_src=twsrc%5Etfw\">July 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The latest data from CME Group’s FedWatch Tool put rate hike <a href=\"https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html\" target=\"_blank\" rel=\"noopener nofollow\">odds</a> at 92% at the time of writing, slightly down from last week’s 95% figure.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/03fe9f03-0966-42da-87ee-ec1bd256fe26.png\"  /><figcaption style=\"text-align: center;\"><em>Fed target rate probabilities chart. Source: CME Group</em></figcaption></figure><p>Continuing, financial commentator Tedtalksmacro argued that core CPI would be the figure to watch for the Fed.</p><p>“Headline is expected to fall to 3.20% YoY, which would make for the lowest print since March 2021. The Cleveland Fed, University of Michigan + Truflation all anticipating a similar number,” he <a href=\"https://twitter.com/tedtalksmacro/status/1678119760175792129\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> in part of a Twitter thread.</p><blockquote>“Core CPI is expected to tick lower to 5.1% YoY, the lowest level since November 2021. Core remains the concern for the market, and I'd anticipate the market gives it more weight in it's reaction on Wednesday.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/de2d869c-5046-404d-8886-6275a123851d.jpeg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>U.S. core CPI projections chart. Source: Tedtalksmacro/Twitter</em></figcaption></figure><h2>Bitcoin mining difficulty following hash rate to fresh record high</h2><p>In a refreshing turnaround, Bitcoin network fundamentals are gearing up to hit new all-time highs in the coming days.</p><p>The latest estimates from <a href=\"https://btc.com/stats/diff\" target=\"_blank\" rel=\"noopener nofollow\">BTC.com</a> predict that network difficulty will jump by more than 5% — its largest single upward adjustment since late March.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/68796ff6-c2e9-4d5c-a64e-0e92658e903c.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin network fundamentals overview (screenshot). Source: BTC.com</em></figcaption></figure><p>Given stagnant price action, this is significant, speaking to ongoing competition in the mining sector and increasing belief in future profitability. In doing so, the difficulty will cancel out its previous dip to hit new record highs of around 53.2 trillion.</p><p>A similar story concerns hash rate, which by <a href=\"https://www.blockchain.com/explorer/charts/hash-rate\" target=\"_blank\" rel=\"noopener nofollow\">some estimations</a>, crossed the 400 exahashes per second (EH/s) mark for the first time in recent days.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5d8d5891-01f3-445b-9695-e7d15cec0dc6.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin estimated total hash rate chart. Source: Blockchain.com</em></figcaption></figure><p>BTC price remains more than 50% below its 2021 peak, <a href=\"https://cointelegraph.com/news/max-keiser-new-bitcoin-network-hash-rate-high-suggests-price-is-next\">lending additional weight to the classic adage</a><a href=\"https://cointelegraph.com/news/max-keiser-new-bitcoin-network-hash-rate-high-suggests-price-is-next\"></a>, “price follows hash rate.”</p><p>Commenting on what might come, Blockware mining analyst Joe Burnett suggested that Bitcoin would return to finish what it started after the 2020 breakout to pass its all-time highs three years earlier.</p><p>“During the 2017 bull run, there was no national mining ban that put half of the entire network hashrate out of business, and there were also no fake coins being sold by FTX, BlockFi, and Celsius,” he <a href=\"https://twitter.com/IIICapital/status/1676773162309111810\" target=\"_blank\" rel=\"noopener nofollow\">reasoned</a>. </p><blockquote>“Most are not ready for the next parabolic run.”</blockquote><h2>BTC supply shock “inevitable”</h2><p>The recent filings for Bitcoin spot price exchange-traded funds (ETFs) in the U.S. has kickstarted a buying spree.</p><p>As Cointelegraph <a href=\"https://cointelegraph.com/news/blackrock-etf-bitcoin-us-buying-get-off-zero\">reported over the weekend</a>, U.S. activity is back trending higher, vying with Asia when it comes to BTC supply ownership.</p><p>The implications for the dwindling supply become clear over longer periods, analysis argues, with just 7.5% of Bitcoin’s immutable 21 million coins left to mine.</p><p>“During this Bitcoin cycle, differently from the 3 previous cycles. the amount of Bitcoin available to trade decreased over time,” commentator Alessandro Ottaviani <a href=\"https://twitter.com/AlexOttaBTC/status/1678091085732618241/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">argued</a> this weekend. </p><blockquote>“If the trend continues, a supply shock is inevitable. It is only a matter of time, we just don’t know when. Being Bitcoiners, we can wait, because if we are Bitcoiners our Time Preference is low.”</blockquote><p>Ottaviani uploaded a chart known as the “HODL Model” — a popular tool mapping supply availability versus price performance into the future.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/d9bcbfd8-33c4-4194-89a9-205e7e7a9a2a.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin HODL Model chart. Source: Alessandro Ottaviani/Twitter</em></figcaption></figure><p>On the topic of ETFs, notably that of the largest global asset manager, BlackRock, Ottaviani added that the mainstream narrative was already switching to condoning Bitcoin instead of bashing it.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/5<br><br>The “Blackrock effect” in the Bitcoin is already started.<br><br>One of the effects can be seen in the Bitcoin mining world. In the same week we have noticed 4different articles in Forbes in favor of Bitcoin Mining. <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> <a href=\"https://t.co/nXikYM8UtG\">pic.twitter.com/nXikYM8UtG</a></p>&mdash; Alessandro Ottaviani (@AlexOttaBTC) <a href=\"https://twitter.com/AlexOttaBTC/status/1677983863753134086?ref_src=twsrc%5Etfw\">July 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Big fish step up exposure</h2><p>It is not just miners showing “confidence” when it comes to future Bitcoin profitability.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ai-bitcoin-price-prediction-over-750k-arthur-hayes\">AI has potential to send Bitcoin price over $750K — Arthur Hayes</a></em></strong></p><p>As noted by research firm Santiment this weekend, the largest-volume Bitcoin investor cohorts are keenly buying, even amid stagnant BTC price conditions.</p><p>Since mid-June, so-called sharks and whales — entities with between 10 and 10,000 BTC — have increased their exposure by over 70,000 BTC.</p><p>“Bitcoin's sharks and whales aren't showing any signs of slowing down, even with prices beginning to get ‘boring’ in this $30k to $31k range,” Santiment <a href=\"https://twitter.com/santimentfeed/status/1677805758216556544\" target=\"_blank\" rel=\"noopener nofollow\">commented</a>. </p><blockquote>“Since June 17th, 10 to 10k $BTC addresses have accumulated 71k more coins, equating to $2.15 billion.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/4151486d-a3bb-4c7d-96e6-bb4c307c8c4c.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin shark and whale data annotated chart. Source: Santiment/Twitter</em></figcaption></figure><p>Separate data from on-chain analytics firm <a href=\"https://studio.glassnode.com/metrics?a=BTC&amp;category=&amp;m=entities.Min1KCount&amp;s=1664917038&amp;u=1688860800&amp;zoom=\" target=\"_blank\" rel=\"noopener nofollow\">Glassnode</a> shows whale numbers — those with at least 1,000 BTC — at eight-month highs. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/c3f3180a-bbfe-48f9-a130-923e55cf1f23.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin whale entities chart. Source: Glassnode</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\">Should you ‘orange pill’ children? The case for Bitcoin kids books</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-10T09:02:28.000Z",
    "title": "Continued arbitrage in Binance U.S. asset pricing: Bitcoin and USDT",
    "url": "https://cryptoslate.com/insights/continued-dislocation-in-binance-u-s-asset-pricing-bitcoin-and-usdt/",
    "description": "<p>Quick Take Over the past few weeks, there have been noticeable discrepancies in the asset prices on Binance U.S. This issue has come to the forefront due to the abnormal trading rates of Bitcoin (BTC) and Tether (USDT), two of the major cryptocurrencies on the platform. The current trading price of Bitcoin on Binance U.S. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/continued-dislocation-in-binance-u-s-asset-pricing-bitcoin-and-usdt/\">Continued arbitrage in Binance U.S. asset pricing: Bitcoin and USDT</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-10T09:03:38.000Z",
    "title": "Swaap v2 Launches: Revolutionizing DeFi Market Making with Secure, Autopilot Strategies",
    "url": "https://cryptodaily.co.uk/2023/07/swaap-v2-launches-revolutionizing-defi-market-making-with-secure-autopilot-strategies",
    "description": "<p>Paris, France, July 10th, 2023, Chainwire</p><p>Leveraging its successful $4.5m fundraising, Swaap launches its v2 protocol, bringing easy-to-use and powerful market-making strategies to the global DeFi community. Swaap v2 is unique in addressing key challenges such as impermanent loss which have plagued Liquidity Providers.</p><p class=\"ql-align-justify\">Swaap, the cutting-edge market-making protocol for blue-chip crypto assets, is thrilled to announce the launch of its v2 protocol. With an emphasis on ease of use, state-of-the-art strategies, strong security, and solutions to impermanent loss, Swaap v2 is poised to democratize access to advanced market-making tools for the global DeFi community.</p><p>What Sets Swaap v2 Apart: Making Market Making Effortless</p><p class=\"ql-align-justify\">For the first time ever, Swaap v2 offers anyone - from institutions to individuals - a seamless way to engage in advanced market-making strategies. The protocol uses mathematically optimized strategies, which means it intelligently adjusts fees and asset holdings to maximize returns while minimizing risks, all on autopilot. Importantly, Swaap v2 addresses impermanent loss, a problem that has deterred many from participating as liquidity providers.</p>Stanislas Barth&eacute;l&eacute;mi, an early user of Swaap v2, shares: &ldquo;As someone who was an LP in traditional Automated Market Makers but was burned by Impermanent Loss, Swaap v2 has been a game-changer for me. It's like having an expert trader working for you around the clock.&rdquo;<p>The Tech Behind Swaap v2</p><p class=\"ql-align-justify\">With models built in collaboration with the Louis Bachelier Institute, a leading financial research institute, Swaap v2 brings the best of traditional financial market-making models to DeFi. It incorporates strategies that intuitively adapt to market conditions, safeguarding funds while optimizing returns. Moreover, liquidity providers can effortlessly engage with a wide array of assets across the Polygon and the Ethereum ecosystems.</p><p>Launch Partners Powering Swaap v2</p><p class=\"ql-align-justify\">Swaap v2 is backed by notable launch partners to ensure robust functionality and support. Chainlink provides critical price feeds for on-chain defensive mechanisms and safeguards, further reinforcing security for Liquidity Providers.</p><p class=\"ql-align-justify\">Additionally, Paraswap, Odos, and Open Ocean are onboard as aggregators, which already ensures significant volumes on the Swaap platform.</p><p class=\"ql-align-justify\">FRAX, a leading stablecoin protocol, has approved a proposal to incentivize liquidity on a FRAX-ETH pool on Swaap v2 to reinforce its role as a connector token in DeFi.</p><p>Built with Security at its Core</p><p class=\"ql-align-justify\">In the world of DeFi, security is paramount. Swaap v2 has undergone rigorous audits by ChainSecurity &amp; Quantstamp. Furthermore, Swaap v2 pioneers defensive modules and on-chain protections that offer users additional peace of mind.</p><p class=\"ql-align-justify\">Swaap is celebrating the launch by offering Swaap tokens to the first wave of liquidity providers, seamlessly integrating them into the governance ecosystem.</p>&ldquo;With Swaap v2, we&rsquo;re not just launching a product; we&rsquo;re catalyzing a movement to empower people globally through decentralized financial tools. Our goal is to ensure that anyone, anywhere, has access to sophisticated market-making strategies that were once reserved for high-net-worth individuals and established financial institutions,&rdquo; says Cyrille Pastour, co-founder of Swaap.&ldquo;Swaap v2 is an eloquent example of what happens when innovation meets expertise. We believe Swaap is on the verge of redefining how DeFi engages with market-making, and we are thrilled to be part of this transformative journey.\", says Nikolai Lambsdorff, from Signature Ventures.<p class=\"ql-align-justify\">Liquidity Deposits to Secure Launch NFT</p><p class=\"ql-align-justify\">Swapp invites users to deposit liquidity in Swaap v2 to not only unlock the full potential of their assets but also to secure exclusive launch NFT. This uniquely designed digital asset is Swapp's way of acknowledging users early participation and commitment to the evolution of DeFi.</p><p class=\"ql-align-justify\">Users who want to deposit liquidity to secure their piece of blockchain history and join the frontlines of DeFi innovation can visit this link.</p><p>About Swaap</p><p class=\"ql-align-justify\">Swaap is an innovative market-making protocol specializing in blue-chip crypto assets. Through pioneering models developed in collaboration with leading institutions, Swaap is revolutionizing DeFi market-making by providing liquidity providers with effortless and superior market-making strategies.</p>ContactHead of MarketingDavid CostelloSwaapdavid.costello@swaap.finance"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T09:03:57.000Z",
    "title": "SVB Financial sues the FDIC for billions – Here is why",
    "url": "https://www.cryptopolitan.com/svb-financial-sues-the-fdic-for-billions/",
    "description": "There is a heavyweight battle occurring within the United States financial arena. SVB Financial Group, a substantial holding company, is squaring off against a titan of the industry &#8211; the U.S. Federal Deposit Insurance Corporation (FDIC). The clash involves a staggering sum of $1.9 billion, a vault of cash that SVB contends belongs to them, ... <a title=\"SVB Financial sues the FDIC for billions &#8211; Here is why\" class=\"read-more\" href=\"https://www.cryptopolitan.com/svb-financial-sues-the-fdic-for-billions/\" aria-label=\"More on SVB Financial sues the FDIC for billions &#8211; Here is why\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T09:01:13.000Z",
    "title": "Swaap v2 Launches: Revolutionizing DeFi Market Making with Secure, Autopilot Strategies",
    "url": "https://www.cryptopolitan.com/swaap-v2-launches-revolutionizing-defi-market-making-with-secure-autopilot-strategies/",
    "description": "Paris, France, July 10th, 2023, Chainwire Leveraging its successful $4.5m fundraising, Swaap launches its v2 protocol, bringing easy-to-use and powerful market-making strategies to the global DeFi community. Swaap v2 is unique in addressing key challenges such as impermanent loss which have plagued Liquidity Providers. Swaap, the cutting-edge market-making protocol for blue-chip crypto assets, is thrilled ... <a title=\"Swaap v2 Launches: Revolutionizing DeFi Market Making with Secure, Autopilot Strategies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/swaap-v2-launches-revolutionizing-defi-market-making-with-secure-autopilot-strategies/\" aria-label=\"More on Swaap v2 Launches: Revolutionizing DeFi Market Making with Secure, Autopilot Strategies\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T08:55:38.000Z",
    "title": "Top U.S. banks on the verge of loan loss disaster",
    "url": "https://www.cryptopolitan.com/us-banks-on-the-verge-of-loan-loss-disaster/",
    "description": "The tumultuous tide of the U.S. banking sector is about to witness a mammoth wave in the form of escalating loan losses. As the nation&#8217;s top financial institutions prepare to release their second-quarter results, they seem to be on the cusp of reporting a dramatic increase in loan defaults, a nightmare scenario unseen since the ... <a title=\"Top U.S. banks on the verge of loan loss disaster\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-banks-on-the-verge-of-loan-loss-disaster/\" aria-label=\"More on Top U.S. banks on the verge of loan loss disaster\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T08:44:13.000Z",
    "title": "Crypto job boom in Hong Kong? Recruiters disagree",
    "url": "https://www.cryptopolitan.com/crypto-job-boom-in-hong-kong-recruiters-no/",
    "description": "In the buzzing digital landscape of Hong Kong, there&#8217;s a curious anomaly. Despite a high-octane rush from numerous crypto firms vying to establish their base in the city, the anticipated explosion in crypto-related employment has not materialized. This is not speculation, but the reality as observed by some of the most well-established recruitment firms in ... <a title=\"Crypto job boom in Hong Kong? Recruiters disagree\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-job-boom-in-hong-kong-recruiters-no/\" aria-label=\"More on Crypto job boom in Hong Kong? Recruiters disagree\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-10T08:57:39.000Z",
    "title": "Tom Brady faced millions in losses from FTX’s collapse",
    "url": "https://crypto.news/tom-brady-faced-millions-in-losses-from-ftxs-collapse/",
    "description": "Tom Brady suffered a $30 million loss in the collapse of FTX crypto, facing legal challenges. Other celebs like Logan Paul and Neymar Jr. have also been hit hard with similar losses."
  },
  {
    "source": "BTCManager",
    "date": "2023-07-10T08:43:45.000Z",
    "title": "Scammers exploit Threads launch, impersonating crypto Twitter users",
    "url": "https://crypto.news/scammers-exploit-threads-launch-impersonating-crypto-twitter-users/",
    "description": "Threads, Meta's newly launched microblogging app, has become a target for scammers who are wasting no time in their attempts to deceive users. The platform has already drawn the attention of several influential Crypto Twitter users, who are sounding the alarm about imposter accounts lurking on Threads."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-10T09:00:38.000Z",
    "title": "Compound (COMP) Rises By 11% Amidst General Bear Market",
    "url": "https://www.newsbtc.com/news/defi/compound-comp-rises-by-11-amidst-general-bear-market/",
    "description": "COMP, the native token of DeFi lending protocol Compound Finance, has drawn much attention following its positive price performance in the last day. According to data by CoinMarketCap, COMP has risen by 11.03% in the 24 hours, emerging as the top daily gainer of the market. This price rise is quite significant, as COMP recorded some price drops in the last few days, which may have prompted concerns for its numerous investors after the token’s remarkable, bullish form in recent weeks.  COMP To Break Key Resistance Level? In the third week of June, COMP embarked on a stunning bullish run which saw the DeFi token gain over 125% to trade as high as $69.15 as of July 4. Related Reading: Compound (COMP) Token Rallies Over 100% After CEO Quits – Details However, after attaining this price level, COMP came under significant selling pressure, losing over 9.63% of its market value in the last week before experiencing its recent price boost today.  Looking at its 4-Hour Chart, its Relative Strength Index &#8211; a tool for measuring the pace and variation of price movement &#8211; is set at 53 but is currently ascending toward the overbought zone meaning the current price uptrend may last for a while.   In tandem, the token’s Moving Average Convergence Divergence (MACD) line just crossed above the signal line, which is also interpreted as a bullish signal.  Analyzing its price movement, COMP faces major resistance at the $70 price zone as the token has failed to break past this barrier twice in the last three weeks.  However, if the market bulls are able to sustain the current buying pressure pushing past this price level, COMP is likely to resume its initial bullish trajectory. If the token fails to break past the $70 price zone, however, it will likely fall and retest at the $50.00 price mark, which currently represents its imminent support level.  At the time of writing, Compound (COMP) is trading at $58.62, with a 0.60% decline in the last hour. The token’s daily trading volume is valued at $136 million, having gained by 216.75%.  COMP Trading At $58.56 On The 4-Hour Chart &#124; Source: COMPUSD Chart On Tradingview.com General Crypto Market In Red Amidst COMP’s market gain, a majority of the crypto market is experiencing slight losses, with the total crypto market cap declining by 0.77% in the last 24 hours, according to data by CoinMarketCap.  Bitcoin (BTC), the premier cryptocurrency and market leader, is down by 0.60%, while Ethereum (ETH) has also seen its market price drop by 0.56%. Related Reading: ADA Price Consolidates Below $0.30 – What Could Trigger A Sharp Decline? Other notable cryptocurrencies such as Dogecoin (DOGE), Solana (SOL), and Litecoin (LTC) are also experiencing similar fates, losing to the tune of 1.86%, 3.54%, and 3.80%, respectively. Featured Image From Economic Times, Chart From Tradingview"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-10T08:39:51.000Z",
    "title": "Significant Surge: Large Shiba Inu Token Transactions Capture Spotlight",
    "url": "https://www.newsbtc.com/news/surge-large-shiba-inu-transactions/",
    "description": "Shiba Inu (SHIB), a cryptocurrency featuring an adorable dog-inspired logo, has witnessed a remarkable surge in large transactions. However, there&#8217;s more to the recent surge than initially meets the eye.  What is the driving force behind the significant increase in Shiba Inu transactions? Could this be indicative of a larger trend unfolding in the cryptocurrency space? Amidst the noticeable surge in substantial SHIB transactions, it is crucial to acknowledge the significant outflows from prominent holders. This particular observation prompts us to question the underlying motives driving these transactions and the potential consequences they may have on the market. Substantial Surge In SHIB Transactions A remarkable surge in substantial Shiba Inu (SHIB) transactions has recently been reported. According to a SHIB price report, these transactions witnessed an astonishing spike, skyrocketing by an impressive 454% last Thursday. Source: IntoTheBlock Within the span of 24 hours, the cumulative number of these transactions reached an astounding 6.36 trillion tokens, translating into a substantial increase of $36.38 million in monetary terms. Related Reading: Litecoin (LTC) Price Weakens Below $100 As Bears Extend Their Grip SHIB market cap currently at $4.6 billion. Chart: TradingView.com Although there was a slight decrease in volume during the subsequent 24-hour period, the level remained significantly high. During the weekend, the recorded value settled at 4.49 trillion SHIB or $34.38 million. The ongoing enthusiasm and involvement in the Shiba Inu token indicate a consistent commitment to its engagement. Shiba Inu: Market Response And Price Analysis The surge in substantial SHIB transactions and the sustained interest and activity surrounding the Shiba Inu token raise questions about their potential impact on its price. While the reported increase in transactions reflects heightened market engagement, it does not directly indicate the direction of the SHIB price. SHIB on CoinGecko is at $0.00000760. Over the past 24 hours, there has been a slight decline of 1.0% in its price, while the seven-day period has witnessed a marginal decrease of 0.2%. Source: Coingecko The price of SHIB is influenced by a multitude of factors, including supply and demand dynamics, market sentiment, and overall cryptocurrency market conditions. Large transactions alone may not be sufficient to determine the price movement of SHIB, as they could be attributed to various motivations, including profit-taking, portfolio rebalancing, or strategic moves by institutional investors. Related Reading: PEPE Bulls Losing Steam? Fatigue Appears To Undermine Price Rally While the surge in transactions may initially suggest increased demand and positive market sentiment, the subsequent decline in volume could have mixed effects on the price of Shiba Inu. The decrease in transaction volume might indicate a temporary slowdown in buying pressure, potentially exerting downward pressure on the token&#8217;s price. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image: Photo Illustration by Jakub Porzycki/NurPhoto via Getty Images"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T09:05:06.000Z",
    "title": "Swaap v2 Launches: Revolutionizing DeFi Market Making with Secure, Autopilot Strategies",
    "url": "https://www.crypto-news-flash.com/swaap-v2-launches-revolutionizing-defi-market-making-with-secure-autopilot-strategies/?utm_source=rss&utm_medium=rss&utm_campaign=swaap-v2-launches-revolutionizing-defi-market-making-with-secure-autopilot-strategies",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-07_14-48-53_1688730550VLuucVVVfS.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-07_14-48-53_1688730550VLuucVVVfS.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-07_14-48-53_1688730550VLuucVVVfS-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-07_14-48-53_1688730550VLuucVVVfS-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-07_14-48-53_1688730550VLuucVVVfS-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Paris, France, July 10th, 2023, Chainwire Leveraging its successful $4.5m fundraising, Swaap launches its v2 protocol, bringing easy-to-use and powerful market-making strategies to the global DeFi community. Swaap v2 is unique in addressing key challenges such as impermanent loss which have plagued Liquidity Providers. Swaap, the cutting-edge market-making protocol for blue-chip crypto assets, is thrilled [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T09:01:52.000Z",
    "title": "Bitcoin Defends $30K Support Level as Market Anticipates Bitcoin ETF and Eyes Economic Indicators",
    "url": "https://www.crypto-news-flash.com/bitcoin-defends-30k-support-level-as-market-anticipates-bitcoin-etf-and-eyes-economic-indicators/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-defends-30k-support-level-as-market-anticipates-bitcoin-etf-and-eyes-economic-indicators",
    "description": "<img width=\"960\" height=\"640\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/bitcoin-2643188_960_720-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/bitcoin-2643188_960_720-1.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/bitcoin-2643188_960_720-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/bitcoin-2643188_960_720-1-104x69.jpg 104w\" sizes=\"(max-width: 960px) 100vw, 960px\" />Bitcoin faces selling pressure as the market awaits the inflation numbers and jobless claims in the week ahead. Bitcoin shows weakness on the technical chart for the short term but on-chain data shows heavy accumulation by whales and sharks. Despite facing some selling pressure recently, the world&#8217;s largest cryptocurrency Bitcoin (BTC) has continued to defend [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T09:01:03.000Z",
    "title": "Discover the Future of GameFi: The Sandbox vs Pikamoon Battle for 50x ROI",
    "url": "https://www.crypto-news-flash.com/discover-the-future-of-gamefi-the-sandbox-vs-pikamoon-battle-for-50x-roi/?utm_source=rss&utm_medium=rss&utm_campaign=discover-the-future-of-gamefi-the-sandbox-vs-pikamoon-battle-for-50x-roi",
    "description": "<img width=\"512\" height=\"335\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T114934.418.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T114934.418.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T114934.418-300x196.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T114934.418-104x69.png 104w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T114934.418-214x140.png 214w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Growing fast into a multi billion dollar industry, the world of GameFi remains a mainstay in every crypto project comparison and utility discussion. From time to time, new projects hit the crypto market and announce themselves with novel utilities and profit potential.  Of the many GameFi projects out there, Sandbox and Pikamoon have been a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T09:00:18.000Z",
    "title": "Why Uniswap’s enthusiasts are interested in Golteum’s innovative contribution to DeFi",
    "url": "https://www.crypto-news-flash.com/why-uniswaps-enthusiasts-are-interested-in-golteums-innovative-contribution-to-defi/?utm_source=rss&utm_medium=rss&utm_campaign=why-uniswaps-enthusiasts-are-interested-in-golteums-innovative-contribution-to-defi",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T113731.490.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T113731.490.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T113731.490-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T113731.490-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-evolving landscape of decentralized finance (DeFi), Golteum is a ground-breaking project that aims to transform both the convergence of decentralized finance (DeFi) and the world of precious metals. While Uniswap has achieved progress in its field, Golteum aims to reshape the landscape by seamlessly incorporating DeFi features.  This article outlines the advantages of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T08:42:22.000Z",
    "title": "MATIC, HEX Holders in Red, QUBE Holders Up 40% As InQubeta Presale Excites Investors",
    "url": "https://www.crypto-news-flash.com/matic-hex-holders-in-red-qube-holders-up-40-as-inqubeta-presale-excites-investors/?utm_source=rss&utm_medium=rss&utm_campaign=matic-hex-holders-in-red-qube-holders-up-40-as-inqubeta-presale-excites-investors",
    "description": "<img width=\"1280\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/graph-gf0cfd5021_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/graph-gf0cfd5021_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/graph-gf0cfd5021_1280-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/graph-gf0cfd5021_1280-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/graph-gf0cfd5021_1280-768x432.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The crypto market has been a mixed bag lately, with some tokens experiencing losses and others making significant gains. In particular, holders of MATIC and HEX have found themselves in the red, while investors in InQubeta&#8216;s (QUBE) presale are celebrating impressive returns of 40%. This article delves into the recent performance of these cryptocurrencies and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T08:41:00.000Z",
    "title": "Buy Bitcoin at a Massive $3,000 Discount on Binance.US – Here’s How to Profit",
    "url": "https://www.crypto-news-flash.com/buy-bitcoin-at-a-massive-3000-discount-on-binance-us-heres-how-to-profit/?utm_source=rss&utm_medium=rss&utm_campaign=buy-bitcoin-at-a-massive-3000-discount-on-binance-us-heres-how-to-profit",
    "description": "<img width=\"2560\" height=\"1633\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-3137984-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-3137984-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-3137984-300x191.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-3137984-1024x653.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-3137984-312x198.jpg 312w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Bitcoin is going for a massive discount on Binance.US as users become increasingly concerned about the future of the platform. Investors can quickly profit by buying Bitcoin and Ethereum on Binance.US and selling on other exchanges. Over the last few hours, U.S. investors have reported that Bitcoin and Ethereum are selling at a massive discount [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-10T09:01:42.000Z",
    "title": "Top 3 High Potential Privacy Coins",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-high-potential-privacy-coins/",
    "description": "<p>For many people, anonymity in the crypto industry is no longer enough. As a result, projects have been created over the years that attempt to add a layer of privacy. In this article, you will discover three coins you should look closer to if you want privacy. They are Oasis Network, Aleph Zero, and Secret [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-high-potential-privacy-coins/\">Top 3 High Potential Privacy Coins</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-10T08:48:35.000Z",
    "title": "XRP Price Prediction: What to Expect in the Next 48 Hours",
    "url": "https://coinedition.com/xrp-price-prediction-what-to-expect-in-the-next-48-hours/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In response to a member of the XRP community on Twitter, attorney and pro-XRP advocate John Deaton mentioned that Ripple intends to appeal any unfavorable ruling to the Supreme Court, effectively maintaining the current state for the next two to five years. According to Deaton, this timeline aligns with the Supreme Court&#8217;s decision-making process, and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-price-prediction-what-to-expect-in-the-next-48-hours/\">XRP Price Prediction: What to Expect in the Next 48 Hours</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]