[
  {
    "source": "Decrypt",
    "date": "2023-07-11T18:12:12.000Z",
    "title": "FTX Exec Investigated for Illegal Donations to Girlfriend's Congressional Campaign: WSJ",
    "url": "https://decrypt.co/148115/ftx-executive-ryan-salame-donations-investigation-girlfriend-campaign",
    "description": "The FBI raided the home of Ryan Salame in April while investigating Sam Bankman-Fried’s political activities."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-11T18:29:46.000Z",
    "title": "Space and Time’s latest AI integration enables natural language prompts for data queries, pipelines, and more",
    "url": "https://cryptoslate.com/space-and-times-latest-ai-integration-enables-natural-language-prompts-for-data-queries-pipelines-and-more/",
    "description": "<p>Space and Time, an emerging player in this AI data engineering, has unveiled its integration with OpenAI&#8217;s GPT-4, a groundbreaking development that enables automated data queries, pipelines, and dashboards through natural language prompts. Traditionally, these processes have required substantial technical knowledge, specifically proficiency in Structured Query Language (SQL). Now, with Space and Time&#8217;s AI integration, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/space-and-times-latest-ai-integration-enables-natural-language-prompts-for-data-queries-pipelines-and-more/\">Space and Time&#8217;s latest AI integration enables natural language prompts for data queries, pipelines, and more</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-11T18:30:00.000Z",
    "title": "Aave Community to Vote on Gho Deployment For Ethereum $ETH $AAVE",
    "url": "https://cryptodaily.co.uk/2023/07/aave-community-to-vote-on-gho-deployment-for-ethereum-eth-aave",
    "description": "<p class=\"md-end-block md-p\">The Aaave community members are poised to vote on whether to finally deploy gho ($GHO) on the Ethereum chain.</p>\n<p class=\"md-end-block md-p\">Aave is a lending and borrowing platform which recently introduced its own native algorithmic stablecoin, gho. An stablecoin is a type of cryptocurrency designed to maintain a stable value by utilizing algorithmic mechanisms. Unlike traditional cryptocurrencies, stablecoins aim to minimize price fluctuations and provide a stable store of value. In the case of gho, an algorithm determines its supply and demand ratio.</p>\n<p class=\"md-end-block md-p\">Gho will be pegged to the US dollar and its supply will be managed by the Aave DAO as well as its interest and risk parameters. Userds mint gho by using assets they have supplied on to the protocol as collateral. Gho holders will then continue earning interest on their assets. The stablecoin has been on the Goerli testnet and has so far encountered no problems.</p>\n<p class=\"md-end-block md-p\">In a governance post last June 6, Aave Companies released its proposal to deploy the stablecoin on Ethereum&rsquo;s mainnet. With its deployment, Aave expects stablecoin borrowing on the Aave Protocol to become &ldquo;more competitive and generate additional revenue for the Aave DAO by providing to the DAO treasury 100% of the interest payments made on GHO borrows.&rdquo; </p>\n<p class=\"md-end-block md-p md-focus\">Gho will be introduced via &ldquo;facilitators&rdquo;: the V3 Ethereum Pool Facilitator and the FlashMinter Facilitator. The former allows for gho lending against their collateral while the latter functions akin to a flash loan, which are loans not requiring any collateral. These facilitators can be other protocols or entities.</p>\n<p class=\"md-end-block md-p\">Aave has recently launched its V3, which further optimized the yield generation and borrowing power of users&rsquo; assets. Apart from its plans to deploy gho to Ethereum, it is also eyeing the deployment of its V3 to Coinbase&rsquo;s Base network. Aave has been the leading lending platform with over $5.6 billion in total value locked (TVL), per DefiLlama. The $5b is split between its V2 ($3.9 billion) and V3 ($1.95 billion).</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T18:26:53.000Z",
    "title": "Microsoft and Axelar join forces to revolutionize blockchain integration",
    "url": "https://www.cryptopolitan.com/microsoft-and-axelar-new-partnership/",
    "description": "Axelar, a cross-chain protocol, and tech giant Microsoft recently announced a partnership aimed at bridging public and private blockchains. The collaboration involves Axelar joining Microsoft&#8217;s Azure marketplace, marking it as the first cross-chain protocol to be listed on the popular developer&#8217;s online store. By joining the Azure marketplace, Axelar gains access to a vast network ... <a title=\"Microsoft and Axelar join forces to revolutionize blockchain integration\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microsoft-and-axelar-new-partnership/\" aria-label=\"More on Microsoft and Axelar join forces to revolutionize blockchain integration\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T18:24:26.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T18:24:05.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T18:23:38.000Z",
    "title": "U.S. regulator unveils stricter rules for major banks",
    "url": "https://www.cryptopolitan.com/us-regulator-stricter-rules-for-major-banks/",
    "description": "A shake-up is in store for U.S. banking, following the revelation of more rigid capital regulations targeting large lenders. This move, orchestrated by the Federal Reserve, aims to buttress a financial framework made vulnerable by the collapse of several regional banks earlier in the year. Beefing up the financial bulwarks The Federal Reserve&#8217;s vice-chair for ... <a title=\"U.S. regulator unveils stricter rules for major banks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-regulator-stricter-rules-for-major-banks/\" aria-label=\"More on U.S. regulator unveils stricter rules for major banks\">Read more</a>"
  }
]