[
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T06:24:59.000Z",
    "title": "Blackrock’s spot Bitcoin ETF renews optimism, sparks wave of new filings",
    "url": "https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/207a5eb6-24ae-4314-91bb-8b872e2a00e6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Investment managers WisdomTree and Invesco have filed for spot Bitcoin ETFs, hot on the heels of BlackRock. </p>\n                    <p><p>At least two investment firms have made new filings for spot Bitcoin exchange-traded funds (ETF) following investment colossus <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">BlackRock’s move to lodge</a> a similar application for its own spot Bitcoin ETF on June 15. </p><p>New York-based asset management fund WisdomTree is the most recent investment firm to lodge a new filing for a spot Bitcoin ETF. </p><p>According to a June 21 <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/1850391/000121465923008647/p620230s1a2.htm\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> to the United States Securities and Exchange Commission (SEC), WisdomTree requested that the SEC allow it to list its “WisdomTree Bitcoin Trust” on the Cboe BZX Exchange under the ticker “BTCW.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">WisdomTree has filed for spot bitcoin ETF h/t <a href=\"https://twitter.com/NateGeraci?ref_src=twsrc%5Etfw\">@NateGeraci</a> <a href=\"https://t.co/JwXj8rTs2X\">pic.twitter.com/JwXj8rTs2X</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1671271876339933184?ref_src=twsrc%5Etfw\">June 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>WisdomTree has applied for a spot Bitcoin ETF twice before. Its first <a href=\"https://cointelegraph.com/news/sec-rejects-wisdomtree-s-application-for-a-spot-bitcoin-etf-again\">application was rejected by the SEC</a> in December 2021. It's second application <a href=\"https://cointelegraph.com/news/sec-rejects-wisdomtree-s-application-for-a-spot-bitcoin-etf-again\">was rejected once again in October 2022</a>, with the financial regulator citing similar concerns of fraud and market manipulation.  At the time of publication, WisdomTree oversees approximately $83 billion in assets.</p><p>One of the key differences with BlackRock’s recent filing to the SEC is that it intends to enter into a “surveillance sharing agreement” with the Chicago Mercantile Exchange (CME) futures markets. </p><p>BlackRock’s proposal <a href=\"https://listingcenter.nasdaq.com/assets/rulebook/NASDAQ/filings/SR-NASDAQ-2023-016.pdf\" target=\"_blank\" rel=\"noopener nofollow\">cites</a> the SEC’s approval of a Bitcoin futures fund by investment advisory firm Teucrium. That ruling noted that the CME “comprehensively surveils futures market conditions and price movements on a real time and ongoing basis in order to detect and prevent price distortions, including price distortions caused by manipulative efforts.”</p><p>This has been echoed in WisdomTree’s filing as well, which states that it too is willing to enter into such a surveillance agreement with “an operator of a US-based spot trading platform for Bitcoin.” </p><p>Less than four hours after WisdomTree filed its application, global investment manager Invesco “reactivated” its application for a similar product. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">And now Invesco has reactivated their 19b-4 for their spot ETF <a href=\"https://t.co/D2zTpqrqJH\">https://t.co/D2zTpqrqJH</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1671303690420985857?ref_src=twsrc%5Etfw\">June 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the 19b-4 <a href=\"https://cdn.cboe.com/resources/regulation/rule_filings/pending/2023/SR-CboeBZX-2023-038.pdf\" target=\"_blank\" rel=\"noopener nofollow\">document</a> — which informs the SEC of a proposed rule change — Invesco requested that the financial regulator allow its “Invesco Galaxy Bitcoin ETF” product to be listed on the Cboe BZX exchange.</p><p>The filing notes that a spot Bitcoin ETF which uses “professional custodians and other service providers,” removes the need for investors to rely on “loosely regulated offshore vehicles” in turn, allowing for investors to more readily “protect their principal investments in Bitcoin.”</p><p>While the SEC is yet to approve a single spot Bitcoin ETF product, Bloomberg’s senior ETF analyst Eric Balchunas said that “BlackRock breathed new life into the race,” in response to his own tweet concerning the WisdomTree filing. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Fun fact: BlackRock&#39;s record of getting ETFs approved by the SEC is 575-1. That&#39;s another reason this is so big, they don&#39;t play around. <a href=\"https://t.co/f7YIhGRmLf\">https://t.co/f7YIhGRmLf</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1669691447996456963?ref_src=twsrc%5Etfw\">June 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Additionally, Balchunas said that crypto investors may have good reason to be optimistic when it comes to BlackRock’s move, sharing that the investment firm has a “575-1” record of getting ETFs approved by the regulator. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-trust-good-or-bad-for-btc\"><strong><em>BlackRock’s Bitcoin ETF ‘is the best thing to happen’ to BTC, or is it?</em></strong></a></p><p>In addition to the recent activity from WisdomTree and Invesco, rumors have begun circulating that the multi-trillion-dollar fund manager Fidelity Investments is also looking to capitalize on the newfound frenzy for spot Bitcoin ETFs. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-trust-good-or-bad-for-btc\"><strong><em>BlackRock’s Bitcoin ETF ‘is the best thing to happen’ to BTC, or is it?</em></strong></a></p><p>According to a June 19 <a href=\"https://twitter.com/AP_Abacus/status/1670455968608538624\" target=\"_blank\" rel=\"noopener nofollow\">tweet</a> from Arch Public co-founder @AP_Abacus, Fidelity Investment, which manages some $4.9 trillion in assets — may look to file for its own spot Bitcoin ETF. Alternatively Abacus notes that the investment firm could make an offer on Grasyscale’s GBTC ETF product. </p><p>Cointelegraph reached out to Fidelity for confirmation but did not receive an immediate response. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong><em>Bitcoin is on a collision course with ‘Net Zero’ promises</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2023-06-21T06:30:00.000Z",
    "title": "The Race For Bitcoin ETFs: A Thrilling Battle For Mainstream Adoption",
    "url": "https://nulltx.com/the-race-for-bitcoin-etfs-a-thrilling-battle-for-mainstream-adoption/",
    "description": "Invesco, a global asset management firm, has recently reignited its efforts to launch a Bitcoin exchange-traded fund (ETF) by submitting form 19b-4 to the U.S. Securities and Exchange Commission (SEC). This move indicates the growing interest in the crypto market and the race among various platforms to introduce their own Bitcoin ETF offerings. However, obtaining [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-21T06:15:54.000Z",
    "title": "Root Network Set To Reward Its Validators, Stakers With XRP Tokens",
    "url": "https://www.newsbtc.com/news/ripple/root-network-set-to-reward-its-validators-stakers-with-xrp-tokens/",
    "description": "Root Network is poised to address the interoperability issue between the XRP Ledger and the Ethereum Virtual Machine (EVM), simultaneously providing incentives in the form of XRP rewards to validators and stakers. Root Network introduces XRP rewards for validators and stakers. Root Network enables users to pay gas fees in XRP, promoting a seamless token swap experience and facilitating the conversion of other cryptocurrencies into XRP. The XRPL ecosystem demonstrates significant growth in Q1 2023. Root Network: Enabling Seamless Token Swaps And Liquidity Root Network, a cutting-edge cross-chain platform, is preparing to introduce a system where validators and stakers will be rewarded with XRP, the native token of the XRP Ledger. During a discussion on the feasibility of XRP Ledger side chains, an enthusiastic community member and supporter named Dip Collector asserted this forthcoming development. Related Reading: Ripple Set To Hit $30 If It Comes Out Victorious In SEC Lawsuit: Hedge Fund Manager Predicts The primary objective of Root Network is to tackle the challenges surrounding interoperability between the XRP Ledger and the Ethereum Virtual Machine (EVM) ecosystem. By leveraging Polkadot&#8217;s Substrate technology, the network aims to promote tokenomics and compatibility. Users can explore and utilize the ROOT and XRP assets as part of this ecosystem. Root Network&#8217;s XRP-Powered Gas Fees And XRPL DEX Integration Root Network introduces an innovative approach to gas fees by allowing users to pay them in XRP while facilitating the seamless conversion of various cryptocurrencies into XRP. To foster a thriving liquidity ecosystem on the XRP Ledger, Root Network has established a connection to the XRPL decentralized exchange (DEX), providing users with enhanced opportunities for token swaps and trading. With the operational beta launch of the Root Network mainnet, users now have the privilege to delve into the system. This integration is a pivotal step towards bridging the gap between the Ethereum and XRP ecosystems. Related Reading: XRP Price Projection: Assessing The Ripple-Colombia Central Bank Partnership Root Network&#8217;s pioneering solution not only streamlines the payment of gas fees by accepting XRP but also empowers holders of other cryptocurrencies by facilitating effortless conversion into XRP. XRP Ledger Records Promising Growth A comprehensive analysis conducted by Messari reveals a highly productive first quarter for the XRP Ledger (XRPL), showcasing significant growth and advancements. This surge in activity is evident through a notable increase of 13.9% in daily active addresses and a robust 10.7% rise in transactions, underpinning a vibrant ecosystem. The latest Q1 report highlights the progress made within the XRPL ecosystem. Notably, introducing the XLS-20 standard has revolutionized the landscape, enabling the seamless integration of non-fungible token (NFT) transactions. This groundbreaking standard now encompasses five new transaction types, effectively expanding the possibilities for XRPL users. Furthermore, five additional transaction types have been proposed, emphasizing the commitment to continuous development and innovation within the XRPL community. Featured image from Root Network&#8217;s twitter page, chart from TradingView.com"
  }
]