[
  {
    "source": "Cryptopolitan",
    "date": "2023-09-19T02:09:45.000Z",
    "title": "Banks team up against tech giants – Details",
    "url": "https://www.cryptopolitan.com/banks-team-up-against-tech-giants-details/",
    "description": "In the ever-evolving landscape of finance and technology, it seems the banking giants are finally rolling up their sleeves to take on the tech juggernauts. The emergence of Paze, a new mobile wallet, stands as a testament to the escalating tussle between age-old institutions and modern-day disruptors. The New Challenger: Paze Step aside, Big Tech. ... <a title=\"Banks team up against tech giants &#8211; Details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/banks-team-up-against-tech-giants-details/\" aria-label=\"More on Banks team up against tech giants &#8211; Details\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-19T02:00:30.000Z",
    "title": "Crypto VC Firm Blockchain Capital Secures $580M For Expansion Of Investment Funds",
    "url": "https://www.newsbtc.com/news/crypto-vc-firm-blockchain-capital-secures-580m-for-expansion-of-investment-funds/",
    "description": "Blockchain Capital, a venture capital company founded by Bart Stephens and Brad Stephens in 2013, has successfully closed two new funds, raising a total of $580 million.  The firm&#8217;s general partner, Spencer Bogart, confirmed the news to TechCrunch, stating that the funds consist of a sixth early-stage fund and the firm&#8217;s first &#8220;opportunity fund.&#8221;  Approximately two-thirds of the $580 million will be allocated to the early-stage fund, while the remaining one-third will be dedicated to the opportunity fund. Related Reading: End Of The Road? Why A Bitcoin Price Surge to $28,500 Could Lead To A Crash Blockchain Capital Raise For Two New Crypto Funds Per the report, the sixth early-stage fund, valued at $380 million, will primarily focus on investing in newer companies and protocols during pre-seed and Series A funding rounds. On this matter, Spencer Bogart claimed:  It’s doing more of what we’ve been doing for the past decade. This is our bread and butter, and we wanted to stay aligned with LPs [and] think about prior fund sizes, but still grow a bit. On the other hand, the $200 million opportunity fund will target late-stage investments starting from Series B and onward. This strategic allocation reflects the firm&#8217;s intention to continue supporting early-stage projects while also capitalizing on promising opportunities in the later stages of development. The funds will be deployed across six sectors, namely decentralized finance, centralized finance, centralized infrastructure, decentralized infrastructure, gaming, and consumer/social.  According to TechCrunch, by concentrating on these sectors, Blockchain Capital aims to remain at the &#8220;forefront&#8221; of innovation within the blockchain ecosystem. Blockchain Capital&#8217;s investor base consists of two categories: strategic limited partners (LPs) such as Visa and PayPal, and long-term committed capital from entities like university endowments, family offices, and sovereign wealth funds. Bogart further stated: The strategic partners like Visa and PayPal are more limited because it’s more active. It’s not just an LP investment; they don’t care about returns as much, but want us to be the eyes and ears on the ground for who else they should work with. Per the report, the opportunity fund will be utilized to invest in projects that the firm may have missed during its early funding rounds. This allows Blockchain Capital to participate in the growth and development of these projects, even if it had not been involved from the outset. Bogart emphasized that Blockchain Capital now takes a leading role in &#8220;most&#8221; of the funding rounds it participates in, committing over 50% of the funding while also influencing pricing, writing the term sheet, and securing board seats.  Related Reading: This Bitcoin Metric Continues To Retest Bear-Bull Junction, Will A Break Happen? Looking ahead, Blockchain Capital intends to continue investing in blockchain-based startups with a long-term vision, staying true to its core focus over the past decade. The firm remains committed to its niche within the blockchain industry and has no plans to diversify into other sectors or investment strategies. Featured image from iStock, chart from TradingView.com "
  }
]