[
  {
    "source": "CoinDesk",
    "date": "2023-12-20T19:19:12.000Z",
    "title": "If You're in Crypto, You're a Criminal",
    "url": "https://www.coindesk.com/consensus-magazine/2023/12/20/if-youre-in-crypto-youre-a-criminal/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Senator Warren thinks all crypto people are crooks. We obviously agree. 100%."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-20T19:11:51.000Z",
    "title": "Immutable Hits 20-Month High as Gaming Tokens Outpace Bitcoin Gains",
    "url": "https://decrypt.co/210425/immutable-hits-20-month-high-gaming-tokens-outpace-bitcoin-gains",
    "description": "Gaming tokens are rising again, with Immutable's IMX token as well as The Sandbox (SAND), Gala Games (GALA), and Ronin (RON) all gaining."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-20T19:30:15.000Z",
    "title": "Ledger Responds to Connect Kit Exploit With Reimbursement Plan, Security Overhaul",
    "url": "https://news.bitcoin.com/ledger-responds-to-connect-kit-exploit-with-reimbursement-plan-security-overhaul/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/hop-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ledger Responds to Connect Kit Exploit With Reimbursement Plan, Security Overhaul\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/hop-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hop-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hop-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hop-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hop-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hop-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hop.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a decisive move following a significant security incident, Ledger, a well known crypto hardware wallet manufacturer and security firm, announced a response plan. Approximately $600,000 in assets were stolen from users due to an exploit involving blind signing on EVM decentralized applications (dapps). Ledger detailed on Dec. 20, 2023, that it has vowed to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T19:16:31.000Z",
    "title": "China’s new direction in Web3 and blockchain",
    "url": "https://www.cryptopolitan.com/chinas-new-direction-in-web3-and-blockchain/",
    "description": "In a significant departure from its previous stance on cryptocurrencies, China has taken bold steps to position itself as a global leader in Web3 and blockchain technology.&#160; The Chinese Ministry of Industry and Information Technology has recently unveiled a comprehensive plan to foster the development of Web3 and blockchain technologies within the country. This strategic [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-20T19:31:54.000Z",
    "title": "Sam Bankman-Fried denied delayed sentencing over FTX fraud",
    "url": "https://crypto.news/sam-bankman-fried-denied-delayed-sentencing-over-ftx-fraud/",
    "description": "A request to delay the sentencing of Sam Bankman-Fried was rejected by Judge Lewis Kaplan ahead of a presentence interview slated for Dec. 21. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-20T19:30:24.000Z",
    "title": "BNB Price Faces Critical Juncture: Head-And-Shoulders Breakout Or Bearish Dip Below $200?",
    "url": "https://www.newsbtc.com/news/binance-coin/bnb-price-faces-critical-juncture-head-and-shoulders-breakout-or-bearish-dip-below-200/",
    "description": "The Binance Coin (BNB) price is crucial as market analysts offer differing viewpoints on the cryptocurrency&#8217;s potential direction. While one analyst presents a bullish case, anticipating a breakout and surge beyond $300, another raises concerns about a dip below $200. BNB Price Analysis Crypto analyst Ali Martinez suggests that BNB price could be on the verge of breaking out of a head-and-shoulders pattern.  Related Reading: Nansen’s Crypto Crystal Ball: AI Integration And A Potential Plot Twist In 2024? Martinez emphasizes the significance of a sustained close above $261, which could catalyze BNB&#8217;s upward trajectory toward $310. With a 2.9% gain over the past 24 hours and a 12% uptrend in the last fourteen days, the recent price action aligns with Martinez&#8217;s breakout thesis. Martinez analyzes the 1-day chart and identifies the $257 level as a crucial breakout point, signaling a potential shift in trend.  If the sustained uptrend continues, BNB&#8217;s price could see a substantial 19.8% gain shortly, pushing the price toward $310. This projection remains just below BNB&#8217;s yearly high of $350 in April. However, contrasting this bullish outlook, Daan de Rover, a crypto analyst, and YouTuber, highlights BNB&#8217;s downtrend structure in the 1-week chart.  Bearish Outlook For Binance Coin According to de Rover, the current BNB price action “looks weak,” raising concerns about the currency&#8217;s possible continuation of its downward trajectory, which began earlier this year.  The analyst points to the &#8220;green box&#8221; on the 1-week chart, as seen in the graphic below, as a critical support level. If breached, it could lead to a deeper decline for BNB, falling below the $200 mark. De Rover&#8217;s cautious view is further emphasized by the fact that dropping below $200 would mark a level not breached since the bear market and crypto winter.  BNB Chain Records Positive Growth  According to Token Terminal data, the circulating market cap of BNB stands at $39.83 billion, with a slight decrease of 1.56% observed. However, it is important to note that the fully diluted market cap remains the same at $39.83 billion, indicating a stable valuation for the cryptocurrency.  BNB has witnessed a positive revenue trend, with a 30.37% increase in annualized revenue, reaching $16.46 million. The 30-day revenue figure also shows growth at $1.35 million, representing a 21.33% increase. Related Reading: Dogecoin Price In Trouble: Whale Transfers 85 Million DOGE To Robinhood When assessing profitability ratios, the price-to-fully-diluted ratio (P/F) currently stands at 281.75x, indicating the market&#8217;s confidence in BNB&#8217;s potential. While there has been a slight decline of 18.2% in this ratio, it remains relatively high.  The price-to-sales ratio (P/S) is also noteworthy, reaching 2,962.98x, although it has experienced a decline of 18.5%. BNB Chain has seen a positive trend regarding fees generated, with a 30-day increase of 20.92% to $14.22 million. The annualized fees have grown substantially, reaching $173.07 million, a significant 30.15% increase.  The future trajectory of the BNB price and its underlying blockchain remains uncertain. Whether the cryptocurrency will experience continued growth or succumb to a bearish sentiment is yet to be determined. Featured image from Shutterstock, chart from TradingView.com"
  }
]