[
  {
    "source": "Decrypt",
    "date": "2024-03-28T16:09:51.000Z",
    "title": "SBF Sentenced to 25 Years in Prison—How Many Will He Actually Serve?",
    "url": "https://decrypt.co/223785/sam-bankman-fried-prison-sentence-how-many-actual-years",
    "description": "Disgraced crypto founder Sam Bankman-Fried could be stuck in prison for decades, experts say, with little wiggle room."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-28T16:30:00.000Z",
    "title": " 3 metrics hint that the Ethereum (ETH) price correction is not over  ",
    "url": "https://cointelegraph.com/news/3-metrics-hint-that-the-ethereum-eth-price-correction-is-not-over",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMGY5Y2UwYWEtM2IyNi00ZWIwLTgxNDgtYWZlNTQxZDYwNWJhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ethereum price has had a rocky week and data suggests that more downside could be on the way.</p>\n                    <p><p>After rallying to $4,091 leading into the <a href=\"https://cointelegraph.com/news/dencun-upgrade-live-ethereum-mainnet\">Dencun upgrade</a>, Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) has underperformed over the last month compared to <a href=\"https://cointelegraph.com/learn/what-is-bitcoin-a-beginners-guide-to-the-worlds-first-cryptocurrency#:~:text=Bitcoin%20is%20digital%20money%2C%20also,independently%20of%20any%20central%20authority.\">Bitcoin</a> and the broader crypto market, leading traders to doubt whether the altcoin’s downtrend is over.</p><p>To put this into context, Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price fell by 18% during the same period, while the total cryptocurrency market capitalization dropped by 16%.</p><p>A number of market and technical indicators show that ETH may witness a deeper correction before embarking on a sustained recovery.</p><p><a href=\"https://cointelegraph.com/news/3-metrics-hint-that-the-ethereum-eth-price-correction-is-not-over\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-28T16:10:00.000Z",
    "title": " SingularityNet, Fetch.AI, Ocean Protocol merger will drive decentralized AI development: ChainGPT CEO ",
    "url": "https://cointelegraph.com/news/singularity-net-fetch-ai-ocean-protocol-merger-drive-decentralized-ai-development-chaingpt-ceo",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYWU1N2Q0ZGYtYTJhOS00MWI2LThmOTYtMzcyY2Q1ZTRlYWY5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The token merger will drive new resources and create new collaborations to bolster decentralized AI development, ChainGPT’s CEO told Cointelegraph.</p>\n                    <p><p>The upcoming token merger of prominent artificial intelligence (AI) protocols SingularityNet, Fetch.ai, and Ocean Protocol will set a new standard for decentralized AI development, Ilan Rakhmanov, the CEO and founder of ChainGPT, told Cointelegraph in an interview. He explained:</p><p>The $7.5 billion <a href=\"https://cointelegraph.com/news/singularity-net-fetch-ai-ocean-protocol-token-merger\">AI token merger</a> was confirmed on March 27, hours after reports started emerging of the potential deal. The three protocols are united by the common goal of developing blockchain-based decentralized AI protocols, which can't be controlled by centralized parties or large stakeholders.</p><p>The high-level merger is a testament to the benefits of decentralized AI over its centralized counterparties, according to ChainGPT’s Rakhmanov:</p><p><a href=\"https://cointelegraph.com/news/singularity-net-fetch-ai-ocean-protocol-merger-drive-decentralized-ai-development-chaingpt-ceo\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-28T16:29:00.000Z",
    "title": "Mystery Whale Buys 673 BTC; Rebel Satoshi's (RBLZ) Upward Momentum Defies Market Trends",
    "url": "https://cryptodaily.co.uk/2024/03/mystery-whale-buys-673-btc-rebel-satoshis-rblz-upward-momentum-defies-market-trends",
    "description": "In the ever-evolving landscape of cryptocurrency, where market trends often dictate investor sentiment, two notable occurrences have recently captured the crypto community's attention. Firstly, a mysterious whale has made a substantial purchase of 673 BTC,"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-28T16:14:26.000Z",
    "title": "Investors Turn To New Altcoin Looking To Blast To $1, As Cardano and Pepe Plunges",
    "url": "https://cryptodaily.co.uk/2024/03/investors-turn-to-new-altcoin-looking-to-blast-to-1-as-cardano-and-pepe-plunges",
    "description": "Amid the latest bearish market momentum, Pepe's price has dipped 3.3% and 13.7% over the weekly and biweekly periods, respectively. Cardano has followed suit with a 6.0% drop in the past week despite high developer activity."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-28T16:38:46.000Z",
    "title": "Trading volume for Dogecoin doubles on speculation over X use",
    "url": "https://www.cryptopolitan.com/trading-volume-for-dogecoin-doubles/",
    "description": "Dogecoin (DOGE) has led the way, with total volumes jumping to $2 billion as the coin price peaked in December 2021. This rise in digital currency is based on the recent public speculation about integrating the gem-inspired meme asset into social media platform X, owned by famous tech executive Mr. Elon Musk. Doge Rockets to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-28T16:38:16.000Z",
    "title": "Solana Fans Mark NFTFN as Their Top Pick for 2024, Confident It Will Reach a $10 Valuation",
    "url": "https://www.cryptopolitan.com/solana-fans-mark-nftfn-as-their-top-pick-for-2024-confident-it-will-reach-a-10-valuation/",
    "description": "SOL (Solana) investors are having a great time watching their favorite token skyrocket again. What was crashing to below $10 a little over a year ago due to a black swan event from which the whole industry felt the shock, has risen over $200, resurrecting its dominance over the altcoin segment. It is presently trading [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-28T16:38:07.000Z",
    "title": "DOGE Community Leaders Are Buzzing About NFTFN, Forecasting Its Value to Hit $20 by the End of Next Year",
    "url": "https://www.cryptopolitan.com/doge-community-leaders-are-buzzing-about-nftfn-forecasting-its-value-to-hit-20-by-the-end-of-next-year/",
    "description": "The crypto industry is booming this month, and bullish forces are expected to take it higher for the foreseeable future. DOGE has delivered impressive gains of over 100% through the past month. The DOGE community is excited but is also looking at other tokens to increase its profits further. Its leaders are pointing at another [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-28T16:34:08.000Z",
    "title": "Doubtful Pepecoin (PEPE) Will Hit $1 – Why Investors Are Hedging Portfolios with New 1000x Exchange Token Priced $0.029",
    "url": "https://www.cryptopolitan.com/doubtful-pepecoin-pepe-will-hit-1-why-investors-are-hedging-portfolios-with-new-1000x-exchange-token-priced-0-029/",
    "description": "Recently, skepticism has emerged regarding Pepecoin (PEPE)&#8217;s potential to hit the coveted $1 mark, leading investors to seek alternative strategies to hedge their portfolios. Amid this growing uncertainty, a new contender, Option2Trade (O2T), priced at a mere $0.029, is gaining traction as a promising hedge against the unpredictable movements of meme coins like Pepecoin (PEPE). [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-28T16:19:42.000Z",
    "title": "Nvidia Addresses Critical Security Flaws in ChatRTX App",
    "url": "https://www.cryptopolitan.com/nvidia-addresses-flaws-in-chatrtx-app/",
    "description": "In a rapid response to the exposure of significant security vulnerabilities, Nvidia has promptly released a patch for its AI chat application, ChatRTX. This move comes after a security bulletin from Nvidia highlighted severe security flaws within early versions of the app, emphasizing the company&#8217;s commitment to user safety and data protection. Unlike traditional software, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-28T16:18:03.000Z",
    "title": "Kerrisdale Capital: MicroStrategy’s unique way to access Bitcoin ‘long over’",
    "url": "https://crypto.news/microstrategy-bitcoin-kerrisdale-capital/",
    "description": "Investment firm Kerrisdale Capital has called MicroStrategy's shares 'overvalued.'"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-28T16:11:31.000Z",
    "title": "FTX founder Sam Bankman-Fried sentenced to 25 years in prison",
    "url": "https://crypto.news/sam-bankman-fried-sentenced-25-years-ftx/",
    "description": "FTX founder Sam Bankman-Fried has been sentenced to 25 years in prison by Judge Lewis Kaplan."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-28T16:14:42.000Z",
    "title": "BREAKING: Sam Bankman-Fried Sentenced To 25 Years In Prison",
    "url": "https://www.newsbtc.com/breaking-news-ticker/breaking-sam-bankman-fried-sentenced-to-25-years-in-prison/",
    "description": "In a highly anticipated courtroom verdict, Sam Bankman-Fried, the founder of the collapsed cryptocurrency exchange FTX, has been sentenced to 25 years in prison for defrauding users. US District Judge Lewis Kaplan delivered the judgment during a Lower Manhattan federal courtroom hearing. Related Reading: The Bulls Are Back: Spot Bitcoin Inflows Surge With New Records FTX Founder Sam Bankman-Fried Sentenced Judge Kaplan sternly criticized the defense&#8217;s argument, labeling it as “misleading, logically flawed, and speculative.” As reported by our sister site, Bitcoinist, Kaplan highlighted Bankman-Fried&#8217;s obstruction of justice and witness tampering during his defense, which were significant factors considered in the sentencing decision. Bankman-Fried expressed remorse in a statement, acknowledging that his series of &#8220;selfish&#8221; decisions as the leader of FTX had led to the exchange&#8217;s downfall. He admitted to having &#8220;thrown it all away&#8221; and expressed regret that continues to haunt him daily. Prosecutors had initially sought a maximum sentence of 50 years, while Bankman-Fried&#8217;s legal team argued for a maximum of 6 years. In November, Bankman-Fried was found guilty on seven criminal counts, and he has since been held at the Metropolitan Detention Center in Brooklyn. Life Plans Shattered Late Tuesday, prosecutors submitted documents containing testimonies from victims, shedding light on the impact of Bankman-Fried&#8217;s actions. One victim, whose name was redacted, wrote a letter dated March 15, describing the destruction of their entire life and the emotional toll it had taken on their family.  They emphasized that they had entrusted their funds to FTX as a custodian, not consenting to the risks Bankman-Fried had taken with their money. The victim shared the suffering that had led to depression and even thoughts of suicide. Related Reading: Fantom: Market Slowdown Chops Off 10% From Gains – Here’s Why During the trial, prosecutors revealed that Bankman-Fried had diverted funds from FTX customers, amounting to as much as $8 billion. These funds were allegedly used to finance a wide range of external interests, including political initiatives, speculative investments, and funding the lifestyles of FTX executives. Featured image from Shutterstock, chart from TradingView.com "
  }
]