[
  {
    "source": "Cointelegraph",
    "date": "2023-07-21T09:35:18.000Z",
    "title": "Dota 2, Rocket League pros ‘want to explore’ Web3 and blockchain gaming",
    "url": "https://cointelegraph.com/news/web3-blockchain-dota-2-rocket-league-pros-want-to-explore-web3-and-blockchain-gaming",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/dbb3d20f-c3f6-41ab-a181-3408320275c0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Professional Dota 2 player Erik “Tofu” Engel believes that Web3 has features that are very beneficial to gamers. </p>\n                    <p><p>While game developers seem to <a href=\"https://cointelegraph.com/news/game-developers-rage-at-pyramid-scheme-nfts-and-crypto\">hate the idea of Web3</a> coming into games, players who compete in gaming tournaments for a living seem to be open to trying out blockchain gaming. </p><p>Professional Dota 2 player Erik Engel for Gaimin Gladiators, more commonly known by his gamer tag “Tofu,” expressed his thoughts on Web3 and how it can help gamers, in a statement sent to Cointelegraph. </p><p>Engel, who’s won over $400,000from various major tournaments in the Dota 2 competitive gaming scene, said that it’s “refreshing” to see companies make “more out of games than just games.” He explained: </p><blockquote>“The idea of blockchain gaming is still a new and expanding topic for most of us, and it’s something I want to explore more in the future. If it'll improve gaming and make it even more rewarding, then that’s definitely something to look out for in times ahead.”</blockquote><p>In addition, Engel believes that Web3 has features that “genuinely feel beneficial to the player” and expressed that he’s excited to see what companies come up with in the future. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/c36b4a4e-4492-4d76-b32b-58b092504d8c.png\"  /><figcaption style=\"text-align: center;\"><em>Erik \"Tofu\" Engel carrying the trophy after winning the ESL One Berlin Major tournament. Source: Gaimin Gladiators</em></figcaption></figure><p>Rocket League professional gamer Max Ng, known by his gamer tag “Maxeew,” also echoed Engel’s sentiments. According to Ng, he really liked the idea of games being developed differently. He said: </p><blockquote>“The idea behind adding new technology and features is something that pretty much any game can benefit from, especially when it is something that can reward the users' time and expenditure on the game itself.”</blockquote><p>Ng said that while he’s already looked into blockchain-based games, he has never tried them personally. However, the gamer said that once the current busy competitive gaming season ends, he’ll start to get into it. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/eee0734a-dd56-4a20-a839-56287bbcd7d6.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Max \"Maxeew\" Ng competing in a Rocket League tournament. Source: Gaimin Gladiators</em></figcaption></figure><p>Meanwhile, Joseph Turner, the co-founder of Gaimin Gladiators — the organization to which Engel and Ng belong, said that the initial advent of Web3 games built within the <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> space “spooked many major publishers.” </p><p>In 2021, Valve Corporation, the developers of popular video game titles like Dota 2 and Half-Life, <a href=\"https://cointelegraph.com/news/valve-removes-blockchain-games-tells-users-not-to-publish-content-on-crypto-or-nfts\">removed blockchain-based games</a> from its gaming marketplace Steam. The company updated its guidelines to specifically disallow games that issue cryptocurrencies or <a href=\"https://cointelegraph.com/learn/nonfungible-tokens-how-to-get-started-using-nfts\">nonfungible tokens (NFTs)</a>. </p><p>Turner described Valve as an “extremely traditional” gaming company and said that the firm would not be diving into Web3 as other companies did. Despite this, Turner believes that the tide will change. “Although I understand why Valve made the statements they did, I feel their position will change rapidly over time,” he said. </p><p>Apart from integrating Web3 with games, the gaming organization executive encouraged blockchain projects to be involved in the professional gaming scene. “I strongly believe that the Web3 world should directly engage the competitive gaming industry,” Turner added. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/gamers-are-more-interested-in-earning-bitcoin-than-nfts-survey\"><strong><em>Gamers are more interested in earning Bitcoin than NFTs: Survey</em></strong></a></p><p>Walter Lee, partner growth and GameFi leader at BNB Chain — which started to <a href=\"https://coinmarketcap.com/community/articles/63e681b46476eb05f237b2ee/\" target=\"_blank\" rel=\"noopener nofollow\">penetrate</a> the competitive gaming landscape through a partnership with Gaimin Gladiators, said that Web3 and blockchain technology has the capacity to empower traditional gaming ecosystems. </p><p>From the tokenization of in-game assets to other use cases such as an on-chain verifiable random number generation (RNG) mechanism, Lee believes that \"the potential is huge.\" In addition, the executive also believes that because of the speed of the growth of “Web3 gaming,” it will one day just simply be called “gaming.” </p><p>The executive also highlighted that Web3 offers many opportunities for professional gamers as well. He explained: </p><blockquote>“There is a surge of many interesting upcoming games from various new studios, some of these titles may potentially gain massive popularity and generate new exciting eSports leagues for the industry.”</blockquote><p>Lee believes that gamers can also build their brand and revenue streams in Web3. “Players will be able to sustain and build in the industry with lesser reliance on an eSports firm, this balances the demand between eSports firms and players,” Lee added. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/shrapnel-wows-at-gdc-undead-blocks-hot-take-second-trip-web3-gamer/\"><strong><em>Web3 Gamer: Shrapnel wows at GDC, Undead Blocks hot take, Second Trip</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-21T09:17:49.000Z",
    "title": "US Justice Department to double its crypto team, target ransomware crimes",
    "url": "https://cointelegraph.com/news/crypto-us-department-of-justice-to-double-its-crypto-team",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/c8e4975d-8834-4c99-9128-ad36075982e3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The National Cryptocurrency Enforcement Team, established in 2021, will be merged with the Computer Crime and Intellectual Property Section. </p>\n                    <p><p>The United States Department of Justice (DoJ) has said it will double the number of staff on its crypto crime team, established two years ago. The unit will grow the number of acting prosecutors more than twice, and get a new leader. </p><p>On July 20, the DoJ <a href=\"https://www.wsj.com/articles/justice-department-revamps-crypto-enforcement-team-73638efb?mod=lead_feature_below_a_pos1\" target=\"_blank\" rel=\"noopener nofollow\">published</a> the remarks, made by Principal Deputy Assistant Attorney General Nicole M. Argentieri at the Center for Strategic and International Studies. In her speech, Argentieri announces the merge of two DoJ’s Criminal Division teams — the Computer Crime and Intellectual Property Section (CCIPS) and the National Cryptocurrency Enforcement Team (NCET). </p><p>After joining the CCIPS, NCET will continue its activities in investigating and prosecuting criminal offenses involving the abuse of cryptocurrency. Calling the NCET “an enormously successful startup”, Argentieri emphasized that the merger with a larger structure would provide it with new additional resources. </p><p>The number of Criminal Division attorneys available to work on criminal cryptocurrency matters will “more than double”, as any CCIPS attorney could potentially be assigned to work an NCET case. The NCET will also gather access to computer crime and intellectual property work. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/us-justice-department-charges-two-men-in-mt-gox-hack\"><strong><em>US Justice Department charges 2 men in Mt. Gox hack</em></strong></a></p><p>The structure will get a new Acting Director. Argentieri thanked the Inaugural Director of NCET, Eun Young Choi, for her work and named Claudia Quiroz as the new head of the team. Quiroz, a former Assistant Attorney from the U.S. Attorney’s Office in the Northern District of California, has been one of the original deputy directors of NCET since its inception. </p><p>An immediate task for the new “super-charged” unit will be to combat ransomware crimes. The NCET will focus on tracking criminals through their crypto payments, freezing or seizing them “before they go to Russia and other ransomware hotspots.”</p><p>The NCET <a href=\"https://cointelegraph.com/news/how-will-doj-s-new-crypto-enforcement-team-change-the-game-for-industry-players-good-and-bad\">was launched in 2021</a> as a part of DoJ’s <a href=\"https://cointelegraph.com/news/the-long-arm-of-justice-how-far-can-the-doj-really-go-in-prosecuting-foreign-actors\">Cryptocurrency Enforcement Framework</a>. In May 2023, the ex-Director, Eun Young Choi, stated that the department was focusing on <a href=\"https://cointelegraph.com/news/us-justice-department-announces-charges-in-connection-with-chipmixer-takedown\">thefts and hacks involving DeFi</a>, and “particularly chain bridges.” </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/us-enforcement-agencies-turning-up-heat-crypto-related-crime/\"><strong><em>US enforcement agencies are turning up the heat on crypto-related crime</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-21T09:10:02.000Z",
    "title": "Bitcoin no longer asset of choice for criminals - former Elliptic crypto advisor",
    "url": "https://cointelegraph.com/news/criminals-prefer-stablecoins-over-bitcoin-for-illicit-use",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/133f28d8-26f1-4043-9bf8-5087b005c157.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Criminals have moved away from using Bitcoin for money laundering, with stablecoins emerging as an alternative due to accessibility.</p>\n                    <p><p>Crime in Web3 is shifting away from Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) to stablecoins while ponzi schemes remain prevalent, according to Elliptic’s former head of technical crypto advisory.</p><p>Tara Annison shared the latest insights from the murky world of cryptocurrency-related crime during a presentation on the final day of <a href=\"https://cointelegraph.com/news/vitalik-buterin-ethereum-ethcc-paris-account-abstraction-ethereum\">EthCC in Paris</a>, addressing a wide variety of ways in which digitals assets are either facilitating crime or being used to launder funds. </p><p>According to Annison, Bitcoin is no longer the cryptocurrency of choice to carry out illicit activities or launder money. As the cryptocurrency industry has matured, the establishment of decentralized finance (DeFi) protocols, mixing services and stablecoins present new avenues for criminals to explore.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/75ce3c16-6d72-4e1d-b7b3-bd81bfad96e3.png\"  /><figcaption style=\"text-align: center;\">Source: Tara Annison.</figcaption></figure><p>Criminals have shifted towards using dollar-denominated assets, like USD Coin (USDC), as their easy accessibility and ability to be laundered through decentralized exchanges (DEXs). </p><blockquote>“The criminals use that as a target point. It's also super easy to launder through Dex's. There's deep liquidity, really good volume, so that's pretty worrying.”</blockquote><p>Annison highlighted a potential silver lining from a law enforcement perspective, noting that centralized issuers like Circle could freeze specific USDC tokens before criminals are able to “off ramp out of the asset” into fiat through DEXs or centralized exchanges.</p><blockquote>“What we're seeing now is an increased number of accounts with USDC and USDC being blacklisted, and these are frozen funds that the criminals now can't access.”</blockquote><p>Ponzi and pyramid schemes remain a feature of the sector, with Annison noting that $7.8 billion were stolen from unwitting victims of these types of scams. </p><p><a href=\"https://cointelegraph.com/news/how-the-irs-seized-10b-worth-of-crypto-using-blockchain-analytics\"><strong><em>Related: How the IRS seized $10B worth of crypto using blockchain analytics</em></strong></a></p><p>Criminals are finding more sophisticated ways to launder funds. Annison said chain swapping and asset swapping is prevalent as criminals try to hide illicit activity.</p><blockquote>“We've seen that to the tune of about $4.1 billion. So they hop across using a dex. They use a coin swap service, they use a mixer, they use a bridge, all basically to try and throw blockchain analytics firms off the trail.”</blockquote><p>Annison said that $1.2 billion stolen from DEXs eventually ends up on centralized exchanges. In comparison to previous years, scams in the sector are down 46%. The reason, according to Annison, is the ongoing bear market which has inevitably made the sector less appealing for cybercriminals.</p><blockquote>“They're less hyped up, the prices are lower, so it's not as profitable for criminals. So at least next time we're in a bear market. Do bear in mind that the scams are at least down.”</blockquote><p>Annison also touched in the increasing use of cryptocurrencies to evade sanctions and finance terrorist activities, highlighting TRON and USDT as popular assets for illicit use.</p><p>The advent of metaverse experiences has also seen the space attract nefarious actors. Various crimes are also emerging in virtual worlds, including phishing attacks, NFT theft, wallet tainting, and augmented reality hacks.</p><p>Annison’s presentation highlighted the reality of criminal activity in the sector, which will demand increased vigilance and security measures to protect users and combat illicit activities.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/us-enforcement-agencies-turning-up-heat-crypto-related-crime/\">US enforcement agencies are turning up the heat on crypto-related crime</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-21T09:30:36.000Z",
    "title": "Securities Commission Cancels FTX Australia’s License",
    "url": "https://news.bitcoin.com/securities-commission-cancels-ftx-australias-license/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftx-australia-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Securities Commission Cancels FTX Australia’s License\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftx-australia-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftx-australia-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftx-australia-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftx-australia-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftx-australia-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftx-australia-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ftx-australia.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Australia’s securities regulator has canceled the license of the local FTX entity, allowing it to perform only limited financial services. These will be related to the termination of derivatives with clients and arrangements to compensate retail customers. ASIC Revokes Financial Services License of Crypto Exchange FTX Subsidiary The Australian Securities and Investments Commission (ASIC) announced [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T09:20:52.000Z",
    "title": "Coin Center and Blockchain Association join forces against Senate’s DeFi bill",
    "url": "https://www.cryptopolitan.com/coin-center-and-blockchain-association-join-forces-against-senates-defi-bill/",
    "description": "The Crypto-Asset National Security Enhancement and Enforcement Act (CANSEE) has drawn heavy condemnation from prominent crypto advocacy organizations, igniting a fierce debate over the future of decentralized finance (DeFi). Proposed by Senators Jack Reed (D-CT), Mark Warner (D-VA), Mike Rounds (R-KS), and Mitt Romney (R-UT) with bipartisan support, the measure seeks to impose strict controls ... <a title=\"Coin Center and Blockchain Association join forces against Senate&#8217;s DeFi bill\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coin-center-and-blockchain-association-join-forces-against-senates-defi-bill/\" aria-label=\"More on Coin Center and Blockchain Association join forces against Senate&#8217;s DeFi bill\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T09:17:26.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T09:09:50.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T09:30:18.000Z",
    "title": "Bitcoin Cash and Litecoin Turn Bearish – Here’s Why and Where to Invest Instead",
    "url": "https://www.crypto-news-flash.com/bitcoin-cash-and-litecoin-turn-bearish-heres-why-and-where-to-invest-instead/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-cash-and-litecoin-turn-bearish-heres-why-and-where-to-invest-instead",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T114605.123.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T114605.123.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T114605.123-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The past few weeks in crypto have consisted of ups and downs. It began with the SEC lawsuit in June before well-known large financial corporations picked it up. Most recently, the conclusion of the ongoing SEC vs. XRP legal battle also contributed to bullish prices. Still, Bitcoin Cash (BCH) and Litecoin (LTC) have lost some [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T09:18:55.000Z",
    "title": "Chainlink ( LINK ) Price Skyrockets 15% as CCIP Protocol Connects Trillion-Dollar Banks and Ethereum (ETH) and Others",
    "url": "https://www.crypto-news-flash.com/chainlink-link-price-skyrockets-15-as-ccip-protocol-connects-trillion-dollar-banks-and-ethereum-eth-and-others/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-link-price-skyrockets-15-as-ccip-protocol-connects-trillion-dollar-banks-and-ethereum-eth-and-others",
    "description": "<img width=\"1038\" height=\"612\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-300x177.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-1024x604.png 1024w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />The Chainlink (LINK) price has remained relatively stable within the $6-$8 range for an extended period, acting as an investment accumulation zone. Despite the absence of significant price fluctuations, there are indications of increased whale transactions and accumulation by major holders. Amidst consolidation in the wider cryptocurrency market, Chainlink (LINK) has stood out, showcasing impressive [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-21T09:15:10.000Z",
    "title": "Crypto Trader Warns It Could Get ‘Really Ugly’ for Binance Coin (BNB), Updates Outlook on Two Ethereum Rivals",
    "url": "https://dailyhodl.com/2023/07/21/crypto-trader-warns-it-could-get-really-ugly-for-binance-coin-bnb-updates-outlook-on-two-ethereum-rivals/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Really-Ugly-for-Binance.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Really-Ugly-for-Binance.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Really-Ugly-for-Binance.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Really-Ugly-for-Binance.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Really-Ugly-for-Binance.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Really-Ugly-for-Binance.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Really-Ugly-for-Binance.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader is issuing a warning on Binance Coin (BNB) as he charts the path forward for two Ethereum (ETH) competitors. Pseudonymous trader Altcoin Sherpa tells his 195,900 Twitter followers that BNB, the utility token of the Binance Smart Chain, is flashing ominous signs. According to Altcoin Sherpa, BNB could plunge by [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/21/crypto-trader-warns-it-could-get-really-ugly-for-binance-coin-bnb-updates-outlook-on-two-ethereum-rivals/\">Crypto Trader Warns It Could Get ‘Really Ugly’ for Binance Coin (BNB), Updates Outlook on Two Ethereum Rivals</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]