[
  {
    "source": "Decrypt",
    "date": "2023-08-09T21:01:30.000Z",
    "title": "Major US Cities Dominate AI Job Market, Leaving Others Behind: Report",
    "url": "https://decrypt.co/151929/leading-us-cities-home-to-ai",
    "description": "While some cities are thriving on AI, the Brookings Institution warns that other locations are at risk of becoming tech deserts."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T20:49:25.000Z",
    "title": "HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?",
    "url": "https://www.cryptopolitan.com/hbar-price-prediction/",
    "description": "HBAR Price Prediction 2023-2032 Hedera Hashgraph is a trending cryptocurrency focused on providing a sustainable, enterprise-grade blockchain.&#160; The asset has been performing extremely well recently, prompting investors everywhere to search for a Hedera Hashgraph price prediction. So that is a heads-up in crypto winter despite the doom which tends to pull everyone else connected to ... <a title=\"HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hbar-price-prediction/\" aria-label=\"More on HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-09T21:00:36.000Z",
    "title": "MakerDAO Debates New EDSR Optimization Plan As MKR Bears Retain Market Control",
    "url": "https://www.newsbtc.com/maker-mkr/makerdao-debates-new-edsr-optimization-plan-as-mkr-bears-retain-market-control/",
    "description": "MakerDAO has been in the headlines recently following a boost in the maximum Dai Savings Rate (DSR) from 3.19% to 8% on Sunday, August 6. This temporary increment termed the Enhanced Dai Savings Rate (EDSR), was designed to encourage more Dai (Maker’s stablecoin) holders to deposit their tokens on the Maker protocol and earn interest. Following the implementation of EDSR, the Dai token has experienced some traction, with its market cap rising by over $570 million since Sunday, according to data from CoinMarketCap.  In addition, data from the Makerburn dashboard shows the number of DAI in the DSR program has surged, moving 396.8 million on August 6 to its current value of 906.7 million.  However, amidst the massive success of the EDSR, MakerDAO co-founder Christen Rune has proposed to adjust this incentive plan “based on observed data.”  MakerDAO Co-Founder Proposes EDSR Optimization Plan To Curb ETH Whale Dominance  On August 8, Rune submitted a governance proposal on the MakerDAO forum to optimize the Enhanced Dai Savings Rate citing an ongoing ETH whale dominance over regular Dai holders in terms of the program&#8217;s benefits.  Related Reading: Maker (MKR) Signals Bullish Price Formation – Is $1.300 Around The Corner? According to Rune, offering yields on Dai that are higher than the cost of borrowing Dai has led to certain borrowing activity known as “borrow arbitrage,” whereby traders borrow Dai at 3.19% and deposit in the EDSR program for 8% profit. Rune noted that this was not the intended purpose of the EDSR plan. He stated that this investment strategy was mainly practiced by ETH and staked ETH whales, who now receive a higher yield at the expense of regular Dai holders,  the primary target of the EDSR program. To counter this unforeseen circumstance, Christen Rune proposed to reduce the maximum EDSR interest rate from 8% to 5%. Furthermore, the MakerDAO cofounder proposes an increment in the DAI borrowing rate to be equivalent to the EDSR rate at a minimum of 5%, thus halting the ongoing large-scale “borrow arbitrage” activities. The proposal also states that MakerDAO should extend Tier 1 EDSR to cover a utilization range of 0-40% and introduce a Tier 2 EDSR for utilization between 40-55% with the aim of making the EDSR plan sustainable.  For context, utilization refers to the portion of the total capacity of the EDSR system that is in use. Currently, data from Makerburn states that the EDSR has an 18% utilization rate.  Originally, the EDSR maximum yield was meant to drop to 5.8% once utilization surged to 20%, albeit that would not occur upon approval of Rune’s latest proposal.  Maker (MKR) Maintains Bearish Form Amidst ESDR Success In other news, MKR, the native token of the MakerDAO lending protocol, has seen its market price fall in recent days despite the massive boost in DAI’s market shares.  According to data from CoinMarketCap, MKR’s price is down by 0.84% in the last 24 hours. This price drop adds to the token’s prolonged bearish state, whereby it has lost over 8.26% of its market value in the last seven days.  Related Reading: Record-Breaking $10 Billion Open Interest Fuels Bullish Speculation For Bitcoin Reversal During this period, MKR’s price declined from $1,339.22 on Aug.3 to as low as $1,187.66 on Aug.7. However, most MKR investors still likely retain faith in the DeFi token, which boasts of a positive monthly performance gaining by 32.30% in the last 30 days. At the time of writing, MKR is trading at $1,214.28, with a 0.39% loss in the last hour. With a market cap of $1.18 billion, the token is ranked as the 42nd largest cryptocurrency in the market. MKR trading at 1,214.7 on the hourly chart &#124; Source: MKRUSD chart on Tradngview.com Featured image from Binance Academy, chart from Tradingview."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-09T20:45:24.000Z",
    "title": "XRP Price Prediction: Analyst Forecasts $1,896 Surge Driven by Adoption, Do Investors Share the Same Bullish Outlook?",
    "url": "https://www.crypto-news-flash.com/xrp-price-prediction-analyst-forecasts-1896-surge-driven-by-adoption-do-investors-share-the-same-bullish-outlook/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-price-prediction-analyst-forecasts-1896-surge-driven-by-adoption-do-investors-share-the-same-bullish-outlook",
    "description": "<img width=\"1280\" height=\"848\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ripple.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ripple-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ripple-1024x678.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ripple-768x509.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ripple-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />XRP is still enjoying the benefits of the positive ruling from Judge Analisa Torres. With a price on the bounce, experts suggest more upsurge is underway but will be fueled by its utility. Judge Analisa Torres’ July 13 ruling that XRP is not security in Ripple’s almost three-year-long lawsuit with the United States Securities and [...]"
  }
]