[
  {
    "source": "CoinDesk",
    "date": "2023-09-15T18:44:17.000Z",
    "title": "Bitcoin at $26.4K Set for Weekly Gain, but Rallies Might Continue to be Sold",
    "url": "https://www.coindesk.com/markets/2023/09/15/bitcoin-at-264k-set-for-weekly-gain-but-rallies-might-continue-to-be-sold/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The world's largest crypto has bounced from a 3-month low below $25,000 hit on Monday."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-15T19:00:00.000Z",
    "title": "What a US government shutdown would do to Bitcoin",
    "url": "https://cointelegraph.com/news/us-government-shutdown-bitcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/99939e2b-8968-49c0-bf82-9a2a173f3aeb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Marcel Pechman explains the myth of excess cash in U.S. households and the lack of sufficient savings, and how a U.S. government shutdown could impact Bitcoin.</p>\n                    <p><p>On the latest episode of <em>Macro Markets</em>, analyst Marcel Pechman examines the current state of the American economy. He references a headline from Barron’s that highlights the disparity between people’s perception of the economy and the objective data.</p><p>Pechman delves into the concept of excess savings, agreeing with Barron’s that a significant portion of the United States population lacks sufficient savings for retirement, potentially necessitating longer working years. He notes that household wealth in the U.S. has reached new heights, primarily due to surges in equities and real estate assets. </p><p>Shifting his focus, Pechman discusses rising concerns among U.S. consumers about increasing prices, particularly the cost of filling up their vehicles with gasoline. He connects this to the recent surge in U.S. crude futures, influenced by Saudi Arabia’s decision to extend output curbs. </p><p>Pechman foresees challenges for President Joe Biden, especially in managing inflation and the impact of Federal Reserve interest rate hikes on real estate and the S&amp;P 500. He then addresses the implications for Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), suggesting that if inflation outpaces income growth, it could exert downward pressure on the cryptocurrency.</p><p>Moving on to the U.S. budget issue, Pechman explores the possibility of a government shutdown due to disagreements in Congress. In a critical analysis, Pechman questions the use of disaster funds to cover war expenses, drawing attention to the Biden administration’s priorities. He emphasizes the potential consequences and legality of such maneuvers.</p><p>Pechman concludes by suggesting that a U.S. government shutdown could trigger a bull run in Bitcoin and advises keeping an eye on this potential trigger for a cryptocurrency rally in early October.</p><p>Check out the latest episode of <em>Macro Markets</em>, available exclusively on the <a href=\"https://youtube.com/@cointelegraphmarketresearch?si=g6wczoqw_e-S6twa\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research YouTube channel</a>.</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-15T18:45:39.000Z",
    "title": "3 key Ethereum price metrics suggest that ETH is gearing up for volatility",
    "url": "https://cointelegraph.com/news/3-key-ethereum-price-metrics-suggest-that-eth-is-gearing-up-for-volatility",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/64ee26d3-67a7-4ef6-a9be-ede0f9dfcdb5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Network, futures and user data all point toward Ethereum potentially charting a new course.</p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) price has been dealing with some strong headwinds and on Sept. 11, the price of the altcoin endured a critical test when it plunged to the $1,530 support level. In the days that followed, Ether managed to stage an impressive recovery, by surging by 6%. This resurgence may signal a pivotal moment, following a month that had seen ETH endure losses of 16%. </p><p>Even with the somewhat swift recovery, Ether’s price performance raises questions among investors about whether it has the potential to climb back to $1,850, and ETH derivatives and network activity might hold the key to this puzzle.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/ee49c1e1-516b-490f-9b8e-29cd13674335.png\"  /><figcaption style=\"text-align: center;\"><em>Ether/USD price index, 1-day. Source: </em><a href=\"https://www.tradingview.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Macroeconomic factors have played a significant role in mitigating investor pessimism given that inflation in the United States accelerated for the second consecutive month, reaching 3.7% according to the most recent CPI report. Such data reinforces the belief that the U.S. government's debt will continue to surge, compelling the Treasury to offer higher yields. </p><p>Scarce assets are poised to benefit from the inflationary pressure and the expansive monetary policies aimed at bridging the budget deficit. However, the cryptocurrency sector is grappling with its own set of challenges. </p><h2>Regulatory uncertainty and high network fees limit investors’ appetite</h2><p>There's the looming <a href=\"https://cointelegraph.com/news/two-more-top-executives-depart-binance-us-amid-layoffs-sec-action-report\">possibility of Binance exchange facing indictment</a> by the U.S. Department of Justice. Furthermore, Binance.US has found itself entangled in legal battles with the U.S. Securities and Exchange Commission (SEC), leading to layoffs and top executives departing from the company.</p><p>Besides the regulatory hurdles faced by cryptocurrencies, the Ethereum network has witnessed a notable decline in its smart contract activity, which is at the core of its original purpose. The network still grapples with persistently high average fees, hovering above the $3 mark. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/4558609b-92fc-4975-bbb1-7311e9536d6d.png\"  /><figcaption style=\"text-align: center;\"><em>Ethereum network dApps rank by active addresses. Source: DappRadar</em></figcaption></figure><p>Over the past 30 days, the top Ethereum dApps have seen an average 26% decrease in the number of active addresses. An exception to this trend is the Lido (LDO) liquid staking project, which saw a 7% increase in its total value locked (TVL) in ETH terms during the same period. It's worth mentioning that Lido's success has been met with criticism due to the project's dominance, <a href=\"https://cointelegraph.com/news/ethereum-merge-a-year-later-energy-consumption-down-centralization-fears-ongoing\">accounting for a substantial 72% of all staked ETH</a>.</p><p>Vitalik Buterin, co-founder of Ethereum, has acknowledged the need for Ethereum to become more accessible for everyday people to run nodes in order to maintain decentralization in the long term. However, Vitalik does not anticipate a viable solution to this challenge within the next decade. Consequently, investors have legitimate concerns about centralization, including the influence of services like Lido.</p><h2>ETH futures and options show reduced interest from leverage longs</h2><p>A look at derivatives metrics will better explain how Ether’s professional traders are positioned in the current market conditions. Ether monthly futures typically trade at a 5 to 10% annualized premium — a situation known as contango, which is not unique to crypto markets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/64168e56-51f0-4478-b919-75c710a82505.png\"  /><figcaption style=\"text-align: center;\"><em>Ether 2-month futures annualized premium. Source: Laevitas.ch</em></figcaption></figure><p>The premium for Ether futures hit its lowest point in three weeks, standing at 2.2%, indicating a lack of demand for leveraged long positions. Interestingly, not even the 6% gain following the retest of the $1,530 support level on Sept. 11 managed to push ETH futures into the 5% neutral threshold.</p><p>One should look at the options markets to better gauge market sentiment, as the 25% delta skew can confirm whether professional traders are leaning bearish. In short, if traders expect a drop in Bitcoin’s price, the skew metric will rise above 7%, while periods of excitement typically have a -7% skew.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/c4baa826-3a10-4b9c-9cab-7f238b55799b.png\"  /><figcaption style=\"text-align: center;\"><em>Ether 30-day options 25% delta skew. Source: Laevitas.ch</em></figcaption></figure><p>On Sept. 14 the Ether 25% delta skew indicator briefly shifted to a bullish stance. This shift was driven by put (sell) options trading at an 8% discount compared to similar call (buy) options. However, this sentiment waned on Sept. 15, with both call and put options now trading at a similar premium. Essentially, Ether derivatives traders are displaying reduced interest in leverage long positions, despite the successful defense of the $1,530 price level.</p><p>On one hand, Ether has potential catalysts, including requests for a <a href=\"https://cointelegraph.com/news/spot-ethereum-etf-race-begins-vaneck-ark-21-shares-filing\">spot ETH exchange-traded fund (ETF)</a> and macroeconomic factors driven by inflationary pressure. However, the dwindling use of dApps and ongoing regulatory uncertainties create a fertile ground for FUD. This is likely to continue exerting downward pressure on Ether's price, making a rally to $1,850 in the short to medium term appear unlikely.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-15T18:57:40.000Z",
    "title": "Crypto Exchange Coinex Pens an Open Plea for Dialogue With the Hacker ",
    "url": "https://news.bitcoin.com/crypto-exchange-coinex-pens-an-open-plea-for-dialogue-with-the-hacker/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinexxx-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Exchange Coinex Pens An Open Plea for Dialogue With the Hacker \" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinexxx-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinexxx-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinexxx-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinexxx-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinexxx-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinexxx-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/coinexxx.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On September 12, 2023, Coinex was hacked, losing an estimated $54 million after hackers removed significant amounts of BTC, ETH, TRX, and other tokens. Three days later, Coinex released an open letter to the hackers, hoping to &#x201C;build a sincere and open channel of communication.&#x201D; Hacked but Hopeful: Coinex&#x2019;s Pursuit of a Constructive Resolution Founded [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T18:55:20.000Z",
    "title": "Top Democrat urges federal agencies to enhance transparency in cryptocurrency markets",
    "url": "https://www.cryptopolitan.com/top-democrat-urges-federal-agencies-to-enhance-transparency/",
    "description": "U.S. Senator Sherrod Brown, Chair of the Senate Committee on Banking, Housing, and Urban Affairs, has issued a clarion call to federal agencies, urging them to enhance transparency in the cryptocurrency markets. In a letter addressing Treasury Secretary Janet Yellen, Securities and Exchange Commission (SEC) Chair Gary Gensler, and Commodity Futures Trading Commission (CFTC) Chair ... <a title=\"Top Democrat urges federal agencies to enhance transparency in cryptocurrency markets\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-democrat-urges-federal-agencies-to-enhance-transparency/\" aria-label=\"More on Top Democrat urges federal agencies to enhance transparency in cryptocurrency markets\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-15T19:00:29.000Z",
    "title": "These Countries Are Picking Shiba Inu Over Dogecoin And Cardano",
    "url": "https://www.newsbtc.com/news/dogecoin/shiba-inu-dogecoin-cardano/",
    "description": "Shiba Inu has been constantly garnering favor among crypto investors since its first price surge back in 2021. Even with the price drop over the last year, the meme coin still features as an investor favorite, surpassing the likes of Cardano and Dogecoin in countries with a large crypto investor presence. Shiba Inu Search Surpass Dogecoin And Cardano Google Trends has shown that interest in Shiba Inu has surged ahead of that of Dogecoin in Canada and the United States, as well as Cardano. The data which shows the movements over the past 12 months shows points in time where the search for Dogecoin had spiked significantly, leading to a remarkable lead by Dogecoin compared to Shiba Inu and Cardano. Related Reading: Analyst’s Ultra Bullish Prediction Puts XRP Price At $10,000, But When? However, as time has passed and periods of brief spikes have been left behind, the trends have indicated that Shiba Inu remains the asset of the three gaining investors’ attention. Since April 2023, SHIB has appeared ahead of both Cardano and Dogecoin with no end in sight for this trend. In September alone, the interest in Shiba Inu has come out more than double those of Cardano and Dogecoin. Even toward the end of August when the crypto market crashed and interest waned, Shiba Inu went in the opposite direction. SHIB trends higher than ADA and DOGE &#124; Source: Google Trends This spike in interest shown in the chart above coincides with the launch of the Shibarium blockchain. The Layer 2 network built atop the Ethereum blockchain was in the works for a long time and when it eventually launched in August, it triggered renewed interest in the SHIB token which currently serves as its official governance token. SHIB Falls Behind Dogecoin In Profitability While Shiba Inu is leading in terms of interest, it has not translated to profitability for the meme coin&#8217;s holders. The percentage of SHIB holders currently seeing any kind of profit is at only 9% compared to 41% for DOGE holders, according to data from IntoTheBlock. Related Reading: New Reports Shows How Much Capital Was Pulled Out Of Crypto In August However, SHIB is still doing well compared to Cardano in this regard whose holder base is almost completely submerged in losses. Data shows that ADA holders in profit are sitting at a sad 4%. When put in contrast with SHIB’s numbers which is still disappointing, the meme coin is seeing twice as many holders in profit. In terms of price performance, all three have performed similarly when comparing their current prices to their all-time prices. SHIB is down 91.49% from its ATH, while Dogecoin and Cardano are down 91.59% and 91.89%, respectively, data from Messari shows. SHIB price struggles at $0.000007 despite interest &#124; Source: SHIBUSD on Tradingview.com Featured image from Times Tabloid, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-15T19:00:10.000Z",
    "title": "Ethereum Classic (ETC) Price Prediction for September: Should You Buy ETC?",
    "url": "https://www.crypto-news-flash.com/ethereum-classic-etc-price-prediction-for-september-should-you-buy-etc/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-classic-etc-price-prediction-for-september-should-you-buy-etc",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-53.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-53.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-53-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-53-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The Ethereum Classic (ETC) network forked from the main protocol in 2016 and has since featured applications similar to those on Ethereum&#8217;s network. However, unlike Ethereum, the ETC price has not been stellar, and it’s currently trading on a low average, as several market indices are rejecting ETC&#8217;s price surges. In this article, we’ll discuss [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-15T18:44:00.000Z",
    "title": "DPRK Hackers Use Russian Exchanges to Launder  $21M from Harmony: Data",
    "url": "https://coinedition.com/dprk-hackers-use-russian-exchanges-to-launder-21m-from-harmony-data/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/October-Worst-Month-For-DeFi-Protocol-Hacks-Chainalysis-Reports.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"DPRK Hackers Use Russian Exchanges to Launder $21M from Harmony: Data\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/October-Worst-Month-For-DeFi-Protocol-Hacks-Chainalysis-Reports.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/October-Worst-Month-For-DeFi-Protocol-Hacks-Chainalysis-Reports-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/October-Worst-Month-For-DeFi-Protocol-Hacks-Chainalysis-Reports-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/October-Worst-Month-For-DeFi-Protocol-Hacks-Chainalysis-Reports-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/October-Worst-Month-For-DeFi-Protocol-Hacks-Chainalysis-Reports-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to blockchain security research firm Chainalysis, Democratic People’s Republic of Korea (DPRK)-linked hacking groups are intensifying their utilization of Russia-based crypto exchanges known for laundering illicit digital assets. Chainalysis noted that the trend coincides with growing concerns from independent sanctions monitors regarding North Korea&#8217;s evolving tactics in cyber warfare. It cited that an upcoming [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/dprk-hackers-use-russian-exchanges-to-launder-21m-from-harmony-data/\">DPRK Hackers Use Russian Exchanges to Launder  $21M from Harmony: Data</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-15T18:45:18.000Z",
    "title": "Second-Largest Stablecoin USDC Launches on Ethereum (ETH) Competitor NEAR Protocol (NEAR)",
    "url": "https://dailyhodl.com/2023/09/15/second-largest-stablecoin-usdc-launches-on-ethereum-eth-competitor-near-protocol-near/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/second-usdc-near.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/second-usdc-near.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/second-usdc-near.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/second-usdc-near.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/second-usdc-near.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/second-usdc-near.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/second-usdc-near.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The second-largest stablecoin by market cap, USD Coin (USDC), is now available natively on the Ethereum (ETH) competitor NEAR Protocol (NEAR). In addition to NEAR, USDC is also available natively on Algorand (ALGO), Arbitrum ( ARB), Avalanche (AVAX), Base, Ethereum, Flow, Hedera (HBAR), Noble, Optimism (OP), Solana (SOL), Stellar (XLM), and Tron (TRX). Explains USDC&#8217;s issuer [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/15/second-largest-stablecoin-usdc-launches-on-ethereum-eth-competitor-near-protocol-near/\">Second-Largest Stablecoin USDC Launches on Ethereum (ETH) Competitor NEAR Protocol (NEAR)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-15T18:41:20.000Z",
    "title": "SEC Accuses Binance of Offering ‘Extremely Limited Information’ in the Regulator’s Lawsuit Discovery Proceedings",
    "url": "https://dailyhodl.com/2023/09/15/sec-accuses-binance-of-offering-extremely-limited-information-in-the-regulators-lawsuit-discovery-proceedings/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/sec-objects-binance-bid.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/sec-objects-binance-bid.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/sec-objects-binance-bid.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/sec-objects-binance-bid.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/sec-objects-binance-bid.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/sec-objects-binance-bid.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/sec-objects-binance-bid.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Securities and Exchange Commission (SEC) is accusing Binance of holding back information during the discovery phase of the regulator’s lawsuit against the crypto exchange. In a new court filing, the regulatory agency says that Binance refuses to cooperate and is only providing “extremely limited information” even though the court has issued a consent [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/15/sec-accuses-binance-of-offering-extremely-limited-information-in-the-regulators-lawsuit-discovery-proceedings/\">SEC Accuses Binance of Offering ‘Extremely Limited Information’ in the Regulator’s Lawsuit Discovery Proceedings</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]