[
  {
    "source": "CoinDesk",
    "date": "2023-07-03T08:42:46.000Z",
    "title": "Singapore's MAS Orders Crypto Firms to Keep Customer Assets in a Trust by Year-End",
    "url": "https://www.coindesk.com/policy/2023/07/03/singapores-mas-orders-crypto-firms-to-keep-customer-assets-in-a-trust-by-year-end/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto service providers in Singapore are now required to safekeep customer assets under a statutory trust before the end of the year."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-03T08:58:44.000Z",
    "title": "Hut8 relocates 6,400 rigs, sees growth in AI & high performance computing ",
    "url": "https://cointelegraph.com/news/hut8-relocates-6-400-rigs-sees-growth-in-ai-high-performance-computing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/c7f0cca7-c584-4d40-a196-899e77e1e864.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin mining firm Hut8 continues to relocate miners from idle North Bay site as demand for AI and high power computing drives new demand.</p>\n                    <p><p>North American mining firm Hut8 is seeing new demand for AI and high performance computing as it looks to re-energize some 6,400 rigs being moved from its inoperative North Bay site in Ontario.</p><p>As previously <a href=\"https://cointelegraph.com/news/bitcoin-miner-hut-8-takes-stoush-with-ontario-power-supplier-to-court\">reported</a>, Hut8 is in an ongoing legal battle with its third party energy supplier Validus Power over alleged failure to meet contractual obligations. Operations at the facility have been suspended since Nov. 2022.</p><p>Hut8 declined to comment on proceedings of the court case in correspondence with Cointelegraph but confirmed that some 6,400 miners are being moved to Texas as the company looks to bring its idle equipment back online.</p><p>The firm expects this specific batch of miners to be operational by the end of July 2023, providing 600 PH/s of operational capacity which will take Hut8’s total installed hashrate up to 3.2 EH/s.</p><p>A three month hosting agreement for the 6,400 miners from North Bay has been agreed and Hut8 plans to renew the arrangement on a month to month basis. Hut8 previously moved 988 miners from North Bay to its Medicine Hat facility in Alberta, Canada in March 2023.</p><p><a href=\"https://cointelegraph.com/news/riot-platforms-add-bitcoin-miners-ahead-of-2024-halving\"><strong><em>Related: Riot Platforms to add 33,000 Bitcoin miners ahead of 2024 halving</em></strong></a></p><p>Hut8 CEO Jaime Leverton also touched on the current climate for the cryptocurrency mining ecosystem in lieu of tough market conditions that have prevailed for some 18 months:</p><blockquote>“The industry has rebounded well over the past few months and we have seen more momentum than originally anticipated, partly due to some of our peers following our lead in the HPC and AI computing spaces.”</blockquote><p>Artificial intelligence and high performance computing continue to grab attention and attract investment. The likes of Palo Alto-based Inflection AI <a href=\"https://cointelegraph.com/news/inflection-ai-raises-1-3b-in-funding-led-by-microsoft-and-nvidia\">raised $1.8 billion </a>led by Microsoft and Nvidia, with part of the investment earmarked for the construction of a 22,000 strong Nvidia H100 Tensor GPU cluster.</p><p>Hut8 has also begun deploying its infrastructure to power services and solutions outside of its Bitcoin mining-focused operations. </p><p>Leverton highlighted a new five-year agreement to provide computer infrastructure and <a href=\"https://www.sec.gov/Archives/edgar/data/1731805/000127956923000779/ex991.htm\" target=\"_blank\" rel=\"noopener nofollow\">hosting services</a> to British Columbia’s Interior Health authority as well as a <a href=\"https://hut8.io/high-performance-computing/services/sub-services/case-study-xyz-ai/\" target=\"_blank\" rel=\"noopener nofollow\">case study</a> carried out with 3D generative AI firm XYZ AI.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ordinals-turned-bitcoin-into-a-worse-version-of-ethereum-can-we-fix-it/\">Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-03T09:08:33.000Z",
    "title": "Second-largest exchange balance drop in Bitcoin of 2023",
    "url": "https://cryptoslate.com/insights/second-largest-exchange-balance-drop-in-bitcoin-of-2023/",
    "description": "<p>Quick Take This past Saturday, July 1, marked the year&#8217;s second-largest decline of Bitcoin from exchanges. Approximately 20,000 Bitcoin were withdrawn from exchange platforms, a substantial movement highlighting the intense activity within the crypto market. This substantial withdrawal was categorized as a &#8216;whale withdrawal,&#8217; denoted by the orange color on the chart below to signify [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/second-largest-exchange-balance-drop-in-bitcoin-of-2023/\">Second-largest exchange balance drop in Bitcoin of 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-03T08:44:59.000Z",
    "title": "SEC dismisses rumors of chairman Gary Gensler’s resignation",
    "url": "https://cryptoslate.com/sec-dismisses-rumors-of-chairman-gary-genslers-resignation/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) reportedly denied rumors that chairman Gary Gensler resigned from his position, according to a July 3 tweet shared by Fox Business journalist Eleanor Terrett. The report was further corroborated by Fox senior correspondent Charles Gasparino, who also contacted the Commission. CryptoSlate has contacted the SEC for further commentary. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-dismisses-rumors-of-chairman-gary-genslers-resignation/\">SEC dismisses rumors of chairman Gary Gensler&#8217;s resignation</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-03T08:46:39.000Z",
    "title": "Bitcoin has momentum on its side this time",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-has-momentum-on-its-side-this-time",
    "description": "<p>Another weekly close above $30,000 means bitcoin is still primed to break through the all-important $31,000 resistance.</p>\nBitcoin has more in the tank\n<p>Another week passes and bitcoin is still at the locked gate that provides a potential quick passage to $36,000 and beyond. This is the second major attempt at this resistance, and with more in the tank this time, bitcoin could do the business.&nbsp;</p>\n<p>&ldquo;More in the tank&rdquo; points to the fact that momentum is on bitcoin&rsquo;s side this time. When the king of the cryptocurrencies last came up against the $31,000 barrier it was on the back of a surge from $20,000, and all the momentum had evaporated by the time it reached the most important level.</p>\nMomentum indicators move higher\n<p>Currently bitcoin is at resistance and is moving sideways before potentially breaking through. On the longer time frame of the weekly, the Stochastic RSI (momentum indicator) is getting to around half way up, and heading higher - an extremely bullish signal.</p>\n<p>Going into lower time frames, both the 8-hour and 12-hour have bottomed and are heading higher, and the daily time frame is now on the way down.</p>\n<p>Back in April when bitcoin was at these levels all these time frames were at the overbought level and of course, with bitcoin having arrived at resistance in exhaustion, there was only one way to go and that was back down.</p>\n<p>Another reason for optimism is that bitcoin has broken through the top of the bull flag it has formed since that last April rejection. Granted, it hasn&rsquo;t shot out of the top and headed higher straight away. Instead, it has followed a process of going back inside the flag and then just sideways action now that it has emerged again.</p>\nIs bitcoin such a risk asset?\n<p>Perhaps bitcoin is just waiting for that particular bullish news that will break the inertia and send it rocketing upwards. All the same, nothing much has changed in traditional finance, and the much feared recession (that could be worse than recession) is still that black cloud that all can see on the horizon.</p>\n<p>Some analysts might say that in a heavy market crash bitcoin is bound to be the first to drop precipitously as investors divest themselves of their risk assets first.&nbsp;</p>\n<p>However, it could very much be argued that even if this were the case, bitcoin is the scarcest asset on the planet and the most uncorrelated to all the assets inside of the traditional financial system. In such a chaotic mess with governments going to the money printers to try and prop everything up, bitcoin is likely to be extremely valuable property indeed.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-03T08:55:38.000Z",
    "title": "Why AVAX Price Rumble Stalls Despite Surge In Daily Activity",
    "url": "https://www.newsbtc.com/news/avax-price-rumble-stalls/",
    "description": "Avalanche (AVAX) has been experiencing a surge in daily activity, with traders and investors eagerly observing its progress. The crypto community had high hopes for the AVAX price to surpass the $14 mark, signifying a significant milestone in the asset&#8217;s growth.  However, despite the increased interest and activity surrounding the crypto, the price failed to breach the elusive barrier. This unexpected development has left many wondering about the underlying factors contributing to this stagnation in price movement. What’s going on with AVAX? Related Reading: Solana Firedancer: 15% Rally Fueled By Ongoing Network Improvements Surge In Daily Activity Fails To Propel AVAX  The current AVAX price on CoinGecko stands at $13.26, showcasing a 2.9% rally over the last 24 hours. However, despite this recent uptick, the asset has also experienced a 0.9% decline in the past seven days. Source: Coingecko Avalanche witnessed an impressive surge in daily activity, yet this accomplishment did not translate into the expected boost for AVAX to break through the critical $14 resistance level. According to a price report, AVAX  has been experiencing a series of lower lows since mid-April, signaling a strong downtrend. During this period, the Relative Strength Index (RSI) has remained below or just slightly above the neutral position, indicating muted buying pressure in the market. AVAX 7-day price movement. Source: CoinMarketCap Currently, the RSI hovers around the neutral level, signifying a more balanced market sentiment. However, the Money Flow Index (MFI) has crossed the mid-level point, suggesting a recent easing of buying pressure while notable trading volume remains.  Given the current technical indicators and market conditions, AVAX&#8217;s price is likely to consolidate within the range of $12 to $13.5 in the coming days. Bitcoin’s Consolidation Above $30,000 Affects AVAX Price Bitcoin&#8217;s prolonged consolidation above the $30,000 level has played a significant role in shaping the broader cryptocurrency market sentiment, including AVAX&#8217;s price movement. As one of the leading digital assets, Bitcoin often sets the tone for the overall market, impacting investor confidence and risk appetite. AVAX market cap below the $5 billion mark. Chart: TradingView.com The prolonged sideways movement of Bitcoin has resulted in a cautious approach among traders and investors. With uncertainty prevailing in the market, many participants have adopted a wait-and-see stance, leading to subdued trading activity and limited buying pressure for AVAX and other altcoins. Related Reading: Polygon 2.0 Upgrade – Potential Bullish Implication Moreover, Bitcoin&#8217;s role as a key trading pair on various exchanges further solidifies its influence on AVAX&#8217;s price dynamics. As traders often use BTC as a reference point for their altcoin trades, Bitcoin price fluctuations can trigger ripple effects across the entire cryptocurrency landscape, amplifying price movements in both positive and negative directions. Featured image from David Jackson/Park Record"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T09:00:42.000Z",
    "title": "Make Money with Meme Coins: How DogeMiyagi, Dogecoin and Shiba Inu Harness the Power of Meme Culture",
    "url": "https://www.crypto-news-flash.com/make-money-with-meme-coins-how-dogemiyagi-dogecoin-and-shiba-inu-harness-the-power-of-meme-culture/?utm_source=rss&utm_medium=rss&utm_campaign=make-money-with-meme-coins-how-dogemiyagi-dogecoin-and-shiba-inu-harness-the-power-of-meme-culture",
    "description": "Memes have had an incredible journey, from social media, to popular culture, to the financial space. This is especially clear in the crypto market, where meme coins help investors to make money with crypto. Dogecoin and Shiba Inu started off as jokes in the market, and while they did not intend to have utility in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T08:57:49.000Z",
    "title": "Binance NFT Marketplace Welcomes Cristiano Ronaldo’s Spectacular ‘ForeverCR7: The GOAT’ Collection",
    "url": "https://www.crypto-news-flash.com/binance-nft-marketplace-welcomes-cristiano-ronaldos-spectacular-forevercr7-the-goat-collection/?utm_source=rss&utm_medium=rss&utm_campaign=binance-nft-marketplace-welcomes-cristiano-ronaldos-spectacular-forevercr7-the-goat-collection",
    "description": "Binance, partners with Cristiano Ronaldo, to introduce exclusive NFT collections. The upcoming collection, titled &#8220;ForeverCR7: The GOAT,&#8221; serves as a remarkable homage to Cristiano Ronaldo&#8217;s impressive record of 838 career goals. Forming a powerful partnership, Binance, the world&#8217;s largest cryptocurrency exchange, has joined forces with the renowned footballer, Cristiano Ronaldo, to introduce exclusive NFT collections [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-03T08:55:33.000Z",
    "title": "4 Decentralized Platforms to Replace Twitter",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/4-decentralized-platforms-to-replace-twitter/",
    "description": "<p>One such incident involved tech mogul Elon Musk&#8217;s latest Twitter move. This caused a ripple effect within the crypto community. Fueled by concerns over increasing centralization, crypto enthusiasts are now exploring decentralized alternatives like Nostr. Some see it as a move that could eventually force users to pay for a subscription. The goal would be [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/4-decentralized-platforms-to-replace-twitter/\">4 Decentralized Platforms to Replace Twitter</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-03T08:59:00.000Z",
    "title": "Critics Accuse SEC of Delays, Political Influence in Crypto Regulations",
    "url": "https://coinedition.com/critics-accuse-sec-of-delays-political-influence-in-crypto-regulations/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/05-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/05-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/05-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/05-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/05-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/05-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/05-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/05-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/05-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/05-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/05-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/05-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/05-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/05-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/05-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/05-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/05-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent series of tweets, renowned pro-XRP lawyer Bill Morgan expressed frustration over the lack of regulatory clarity in the crypto industry, highlighting two prominent cases involving Dash and Ripple. Morgan&#8217;s first tweet pointed out the unexpected development regarding Dash, the popular privacy-focused crypto. After nine years of operating without any indications that proof-of-work [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/critics-accuse-sec-of-delays-political-influence-in-crypto-regulations/\">Critics Accuse SEC of Delays, Political Influence in Crypto Regulations</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]