[
  {
    "source": "CoinDesk",
    "date": "2023-08-30T20:49:53.000Z",
    "title": "Grayscale’s SEC Victory May Render Alameda’s Redemptions Lawsuit Unnecessary, Bloomberg Analysts Say",
    "url": "https://www.coindesk.com/business/2023/08/30/grayscales-sec-victory-may-render-alamedas-redemptions-lawsuit-unnecessary-bloomberg-analysts-say/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The ruling could lead to Grayscale's GBTC converting into a bitcoin ETF, which would allow redemptions, making Alameda's suit unnecessary, Bloomberg Intelligence analysts said in a note on Wednesday."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-30T21:00:41.000Z",
    "title": "Pseudonymous FTX Creditors Could Be Doxxed Following Kroll Data Breach",
    "url": "https://decrypt.co/154349/ftx-affiliate-links-customer-information-kroll-breach",
    "description": "Customers who posted affiliate links to earn rewards for referring others may be unmasked."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-30T21:00:00.000Z",
    "title": "No, Bitcoin withdrawals from exchanges are not inherently bullish for crypto",
    "url": "https://cointelegraph.com/news/bitcoin-withdraws-from-exchanges-is-not-inherently-bullish-for-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/b023582f-8fbb-4308-9dbc-24381cdc8c95.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Traders say the record-low number of BTC held on exchanges is a bull signal, but data suggests otherwise. </p>\n                    <p><p>Crypto analysts on X (the social media platform formerly known as Twitter) and in YouTube interviews have been abuzz with talk about the trend of Bitcoin leaving centralized exchanges.</p><p>On Aug. 29, the quantity of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) held within exchanges saw a decline, reaching its <a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-up-today\">lowest point since January 2018</a>. While various factors might underlie this movement, experts analyzing blockchain data often interpret the shift as a positive indicator. Traders are now questioning what might have been causing Bitcoin’s inability to break above $31,000 since this price action doesn’t align with their view that fewer coins on exchanges is bullish for the BTC price. </p><p>The perspective on the decline of Bitcoin held at centralized exchanges stems from the notion that when traders withdraw their coins, it signals a bullish sentiment. This is typically associated with a strategy of holding assets in self-custody for the long haul.</p><p>Although these suppositions lack conclusive evidence, their persistence likely stems from historical precedent. However, establishing a relationship between these events and a specific cause remains elusive, regardless of the frequency of such occurrences. While selling on exchanges might necessitate depositing fiat currency beforehand, the reverse is not necessarily true.</p><h2>Data fails to show correlation between on-chain metrics and Bitcoin price action</h2><p>Data from blockchain transactions displays a consistent reduction in Bitcoin deposits on exchanges since mid-May. Concurrently, Bitcoin’s price trajectory fails to offer substantial indications of a bullish upswing, with the exception of a brief surge in mid-June that coincided with BlackRock's submission of an application for a spot exchange-traded fund.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/39cc33fb-5d81-4efe-8ffc-9ef264928b6f.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin aggregate exchange net position change, in BTC. Source: Glassnode</em></figcaption></figure><p>It’s worth noting that the period encompassing a 30% surge from March 12 to March 19 witnessed an increase in deposits on exchanges, contrasting the predictions of on-chain analysis. Despite this contradiction, instances of influencers addressing the weaknesses in these enduring myths are scarce. This could be attributed to the simplicity of linking deposits on exchanges to an augmented inclination for selling.</p><p>Certainly, all indicators are prone to occasional inaccuracies, and depending solely on on-chain analysis to dictate market trends is unwise. Yet, the notion that withdrawals from exchanges are predominantly earmarked for transfer to cold storage lacks substantial grounding and exists largely as a hypothetical proposition. For example, there are three possible reasons that explain reduced deposits on exchanges unrelated to a diminished short-term selling intent.</p><h2>Bitcoin holders shifted to a reliable custody solution</h2><p>The foremost explanation for Bitcoin withdrawals from exchanges not necessarily indicating a decrease in short-term selling pressure is the burgeoning trust in custody solutions. This implies that these coins might have been acquired in the past, and only recently has the owner felt at ease moving them. Notably, reputable custodians like Prime Trust took investors by surprise when it sought Chapter 11 bankruptcy protection in Delaware due to a shortage in customer funds. Additionally, a staggering sum of approximately <a href=\"https://cointelegraph.com/news/atomic-wallet-hack-losses-top-35\">$35 million in crypto assets was pilfered from Atomic Wallet</a> users in June. The prevailing lack of trust in custody solutions could elucidate the cautious approach investors adopted before initiating withdrawals from exchanges.</p><h2>Investors have lost confidence in centralized exchanges</h2><p>On June 5, the Securities and Exchange Commission launched a legal suit against Binance, alleging the offering of unregistered securities. Just a day following the Binance lawsuit, <a href=\"https://cointelegraph.com/news/coinbase-vs-sec-court-dates-confirmed\">the commission turned its focus to Coinbase</a> on analogous grounds, contending that prominent altcoins provided by the exchange meet the criteria for securities. Further compounding matters, an Aug. 2 report from Semafor disclosed that <a href=\"https://cointelegraph.com/news/us-doj-concerned-binance-run-prosecutors-fraud-charges\">United States Justice Department officials expressed apprehensions about a Binance indictment</a> triggering a run on the exchange, akin to the events surrounding FTX in November 2022. These regulatory actions may have influenced users’ decisions to keep their deposited coins away from exchanges, irrespective of their selling intentions, thus rendering the withdrawals unrelated to price fluctuations.</p><h2>Decreasing interest from buyers could balance out the trend</h2><p>Even if one postulates that the majority of the Bitcoin departing from exchanges is indeed headed to cold wallets, implying holders have a reduced propensity to engage in short-term selling, the demand facet of the equation has encountered its own set of challenges. For instance, a search for “buy Bitcoin” on Google Trends has struggled to surpass 50% of its previous two-year peak.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f468682e-c09b-4705-bebf-e0be036dcec8.png\"  /><figcaption style=\"text-align: center;\"><em>Google Trend searches for “buy Bitcoin” worldwide. Source: Google</em></figcaption></figure><p>Similarly, Bitcoin’s spot trading volume has averaged a modest $7 billion per day in August, representing less than half the trading activity observed between January and March.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/89f0c901-988b-4495-8319-c81afd2c1c9c.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin adjusted daily volume, USD. Source: Messari and Kaiko</em></figcaption></figure><p>As a result, the data underscores a waning interest from buyers, which in turn mirrors Bitcoin’s lack of bullish momentum. This parallel trend aligns with the decrease in the number of coins being deposited on exchanges. Consequently, despite Bitcoin’s exchange deposits plummeting to levels last seen in 2018, the effect on the supply-demand equilibrium is negligible, owing to the subdued trading activity that has prevailed.</p><p>Ultimately, while on-chain metric analysis might provide foundational support for the notion of coins transitioning to the possession of long-term holders, this viewpoint offers scant backing in terms of price dynamics, as the movement may reflect a broader reluctance to actively trade the asset.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T20:48:22.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T20:44:44.000Z",
    "title": "Worldcoin Price Prediction 2023 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, ... <a title=\"Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldcoin-price-prediction/\" aria-label=\"More on Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T20:41:56.000Z",
    "title": "AI’s Impact on Design Workstreams is a Balancing Act",
    "url": "https://www.cryptopolitan.com/ais-impact-on-design-workstreams/",
    "description": "The realm of design is undergoing a seismic shift as AI tools assert their presence, triggering a blend of excitement and skepticism. Amidst the rise of AI&#8217;s prowess, concerns regarding its potential to supplant human creativity are juxtaposed with the notion of AI as a valuable ally. At the forefront of this narrative stands Won ... <a title=\"AI&#8217;s Impact on Design Workstreams is a Balancing Act\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ais-impact-on-design-workstreams/\" aria-label=\"More on AI&#8217;s Impact on Design Workstreams is a Balancing Act\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-30T21:00:34.000Z",
    "title": "Shibarium Reaches Key Goals: Is SHIB Poised For New Heights?",
    "url": "https://www.newsbtc.com/shib/shibarium-reaches-key-goals-is-shib-poised-for-new-heights/",
    "description": "In a surprising turn of events, Shiba Inu (SHIB) experienced a brief consolidation break, reaching a 10-day high of $0.00000850, following the overall market uptrend on Tuesday.  This upswing was further fueled by Grayscale&#8217;s legal victory against the US Securities and Exchange Commission (SEC). However, Shibarium, the Ethereum layer-2 network backed by SHIB tokens, was the most significant catalyst for the newfound optimism.  Shibarium&#8217;s Resurgence Fuels Bullish Sentiment For SHIB Price Shibarium, the layer-2 blockchain explicitly designed for the Shiba Inu token SHIB, has achieved a significant milestone with a remarkable surge in wallet count, reaching 337,100. Related Reading: $28,100 Next Level To Break For Bitcoin, Here’s Why This surge in new wallet addresses indicates renewed interest and heightened expectations, following recent challenges faced by the SHIB-backed layer-2 platform. The surge in wallet activity clearly demonstrates restored confidence in Shibarium and its potential to provide an “enhanced user experience.” Moreover, the transaction count has rebounded significantly, recovering from a dip that saw daily transactions drop to 40,000 on August 27, after peaking at 132,000 on August 25. The resurgence, growing confidence, and surge in new wallets and daily transactions have made Shibarium an attractive option for retail investors seeking faster, more cost-effective, and private off-chain transactions while benefiting from the underlying security of the blockchain. After a difficult start, Shiba Inu delivered positive news by announcing the successful functionality of the highly anticipated Shibarium Bridge on August 28, 2023. This bridge facilitates seamless movement of funds from the Ethereum Layer-1 to the Layer-2 Shibarium platform, improving transaction speed and reducing fees. Shibarium initially encountered challenges upon its launch, experiencing significant user and transaction volumes that caused an “outage.”  To tackle this issue, according to crypto influencer Keyur Rohit, Shytoshi Kusama, co-founder of SHIB, sought assistance from Sandeep Nailwal, co-founder of Polygon Labs. Together, they resolved the problems, ensuring the safety of funds. Kusama expressed gratitude to Sandeep for his help. Notably, in the aftermath of the initial challenges, Shibarium undertook significant improvements. The team expanded their server infrastructure by an impressive 1500% to “better handle” on-chain congestion.  These corrective measures have resulted in rapid growth of the user base and an increase in the price of the SHIB token. Additionally, Shibarium has achieved a notable Total Value Locked (TVL) of $1.42 million. This achievement signifies a significant milestone and reflects the increasing enthusiasm within the Shiba Inu network. SHIB&#8217;s Uptrend At Risk?  SHIB&#8217;s recent recovery and positive developments within its native ecosystem have failed to sustain the initial excitement, as the token&#8217;s price action has experienced a sharp decline. Over the past 24 hours, SHIB has lost more than 3% of its value, currently trading at $0.00000813. Adding to the concern is the token&#8217;s inability to surpass its 50-day Moving Average, as depicted by the brown line on the daily chart above. Since July 2023, when SHIB briefly surged to the $0.000001137 mark, it has struggled to break above this key moving average. Related Reading: Large Transactions Put XRP Price Under Pressure: Are Whales Making An Exit? However, there is a glimmer of hope if the overall market, particularly the flagship cryptocurrency, Bitcoin (BTC), paves the way for improved liquidity in the emerging sector.  If SHIB manages to surpass this significant moving average, it could signal the potential for another strong uptrend, similar to the ones witnessed in July and January, during which the token reached its yearly high. Featured image from iStock, chart from TradingView.com"
  }
]