[
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T10:37:09.000Z",
    "title": "Circle argues USDC stablecoin is not a security in response to SEC’s Binance lawsuit",
    "url": "https://www.cryptopolitan.com/circle-argues-usdc-is-not-a-security/",
    "description": "Circle, the company behind the popular stablecoin USDC, has entered the legal battle between the U.S. Securities and Exchange Commission (SEC) and Binance. In a recent filing, Circle asserted that stablecoins like USDC do not constitute investment contracts and therefore should not fall under the SEC&#8217;s jurisdiction. The move comes as the SEC pursues a ... <a title=\"Circle argues USDC stablecoin is not a security in response to SEC&#8217;s Binance lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/circle-argues-usdc-is-not-a-security/\" aria-label=\"More on Circle argues USDC stablecoin is not a security in response to SEC&#8217;s Binance lawsuit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T10:18:56.000Z",
    "title": "Esports Achieves Milestone: Official Medal Sport in Hangzhou Asian Games",
    "url": "https://www.cryptopolitan.com/esports-achieves-milestone/",
    "description": "In a historic development, esports has been officially recognized as a medal sport in the Hangzhou Asian Games, marking a significant milestone for the gaming industry. While this achievement brings honor to the participants, it holds a life-changing implication for South Korean male players. Winning a gold medal in the Asian Games or the Olympic ... <a title=\"Esports Achieves Milestone: Official Medal Sport in Hangzhou Asian Games\" class=\"read-more\" href=\"https://www.cryptopolitan.com/esports-achieves-milestone/\" aria-label=\"More on Esports Achieves Milestone: Official Medal Sport in Hangzhou Asian Games\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T10:13:24.000Z",
    "title": "French authorities conduct unannounced raid at Nvidia’s offices",
    "url": "https://www.cryptopolitan.com/french-authorities-raid-at-nvidias-offices/",
    "description": "In an unexpected turn of events, French antitrust authorities conducted an unannounced raid at Nvidia&#8217;s offices in France on September 28. This action is part of a broader inquiry into the cloud computing sector and its alleged anticompetitive practices. The raid, authorized by a judge, was carried out as part of an investigation into potential ... <a title=\"French authorities conduct unannounced raid at Nvidia&#8217;s offices\" class=\"read-more\" href=\"https://www.cryptopolitan.com/french-authorities-raid-at-nvidias-offices/\" aria-label=\"More on French authorities conduct unannounced raid at Nvidia&#8217;s offices\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-29T10:30:38.000Z",
    "title": "CRV Price Surges 16% – What’s The Next Move For Curve DAO Token?",
    "url": "https://www.newsbtc.com/news/crv-price-surges-15-whats-the-next-move-for-curve-dao-token/",
    "description": "Curve Finance&#8217;s native token, CRV, has recently experienced a notable uptick in value, driven by a sudden surge in whale accumulation. As the decentralized finance (DeFi) platform&#8217;s token rebounds from its November 2022 low of $0.4, crypto enthusiasts are left wondering whether this momentum is sufficient to initiate a sustained bullish trend for CRV. Over the weekend, cryptocurrency tracker Lookonchain detected an interesting activity involving two significant whales. The first whale orchestrated a substantial withdrawal, amassing a staggering 19.56 million CRV tokens valued at approximately $10.33 million from the popular crypto exchange Binance. Related Reading: Maker (MKR) Inks 20% Price Advance, Leads Top 50 Coins Today What makes this move even more intriguing is that the whale proceeded to stake the entire sum on Convex Finance (CVX), a DeFi platform intricately designed to empower Curve users in enhancing their rewards. Not to be outdone, another whale executed a withdrawal of 5.78 million CRV tokens, worth in excess of $3 million, from Binance on a Sunday, further piquing the curiosity of the crypto community. Whale&#8221;0xDf14&#8243; withdrew 5.12M $CRV($2.7M) from #Binance again 6 hours ago. And the whale has withdrawn a total of 19.56M $CRV($10.33M) from #Binance in the past 3 days. The whale staked all $CRV on #Convex.https://t.co/eSOmZSlmk8 pic.twitter.com/8fXj2VVk3T — Lookonchain (@lookonchain) September 25, 2023 Resistance Looms, Yet Potential For CRV Persists The current price of CRV on CoinGecko stands at $0.515, reflecting a 0.1% decline over the past 24 hours but showing a promising seven-day rise of 16%. Despite the upward surge, CRV is currently confronting a resistance zone in the vicinity of the $0.55 mark, potentially attributable to short-term traders capitalizing on their gains. In the event that supply pressure mounts, this altcoin could undergo a minor retreat, possibly descending to levels around $0.5 or even $0.45 as it regains its bullish footing. CRV market cap currently at $459 million. Chart: TradingView.com If the ongoing recovery trend retains its momentum, CRV&#8217;s price, according to a price report, may aspire to another notable ascent, targeting a 10% upswing to challenge the upper threshold of a long-standing channel pattern. Taking a step back to assess the broader picture, the CRV token has endured a prolonged correction phase, ensnared within a descending channel pattern that has persisted since February 2023. Related Reading: Maker (MKR) Inks 20% Price Advance, Leads Top 50 Coins Today Implications For The Future As CRV navigates the currents of the crypto market, the recent surge in whale accumulation adds a layer of anticipation to its journey. Whether this accumulation is indicative of a more sustained bullish run remains to be seen, as the token grapples with resistance levels and supply dynamics.  Nonetheless, the evolving dynamics surrounding CRV underscore the ever-evolving nature of the cryptocurrency space, where market sentiment and investor behavior can rapidly shift the course of a digital asset.  (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-29T10:13:43.000Z",
    "title": "Best 5 Crypto With High Growth Potential – Vechain, Cosmos, Iota, Polkadot and New One",
    "url": "https://www.crypto-news-flash.com/best-5-crypto-with-high-growth-potential-vechain-cosmos-iota-polkadot-and-new-one/?utm_source=rss&utm_medium=rss&utm_campaign=best-5-crypto-with-high-growth-potential-vechain-cosmos-iota-polkadot-and-new-one",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-29T125719.768.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-29T125719.768.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-29T125719.768-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market presently mirrors a roller coaster ride, taking traders through soaring heights and unforeseen drops. With the Fear &#38; Greed Index at 46, marking ‘Fear,’ traders exhibit caution, contemplating every move in this volatile landscape. However, this precarious environment also teases lucrative returns for those who dare to delve and discern the potential [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-29T10:20:20.000Z",
    "title": "Top 3 OVERLOOKED & UNDERVALUED Altcoins for Oct 2023",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-overlooked-undervalued-altcoins-for-oct-2023/",
    "description": "<p>You got it all wrong! Wait, let me explain. All along this bear market have you been DCAing into only Bitcoin &#38; Ethereum? If yes, then you have been missing out on some potential profit-making opportunities.  In this article, I will be talking about 3 altcoins. They are at present undervalued and overlooked but have [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-overlooked-undervalued-altcoins-for-oct-2023/\">Top 3 OVERLOOKED &#038; UNDERVALUED Altcoins for Oct 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-29T10:16:01.000Z",
    "title": "$100k Prediction in Bitcoin: Will BTC See a Bullish Future?",
    "url": "https://coinedition.com/100k-prediction-in-bitcoin-will-btc-see-a-bullish-future/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/btc6-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"$100k Prediction in Bitcoin: Will BTC See a Bullish Future?\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/btc6-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/btc6-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/btc6-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/btc6-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/btc6-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/btc6-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/btc6-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/btc6-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/btc6-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/btc6-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/btc6-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/btc6-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/btc6-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/btc6-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/btc6-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/btc6-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent interview, Adam Back shares his bullish perspectives on Bitcoin. Previously, Back has placed a bet with Vikingo on Bitcoin surpassing $100k before the next Bitcoin Halving. The current bearish track of Bitcoin results from several factors, including the impacts of the pandemic and the Ukraine war. In a recent interview with the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/100k-prediction-in-bitcoin-will-btc-see-a-bullish-future/\">$100k Prediction in Bitcoin: Will BTC See a Bullish Future?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]