[
  {
    "source": "Decrypt",
    "date": "2023-06-06T08:50:10.000Z",
    "title": "PEPE Leads Market Losses Amid SEC Crackdown on Binance",
    "url": "https://decrypt.co/143540/pepe-leads-market-losses-sec-crackdown-binance",
    "description": "The wider crypto market cap dropped $1.14 trillion amid the latest lawsuit against Binance, with PEPE leading losses."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T09:00:08.000Z",
    "title": "Bitcoin traders bet on $24K BTC price as market digests SEC vs. Binance",
    "url": "https://cointelegraph.com/news/bitcoin-traders-bet-on-24k-btc-price-as-market-digests-sec-vs-binance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/5d96b241-1b4d-48dc-8476-7bcfaf7bc249.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin is looking ripe for a trip to its lowest levels since March, say market participants, with BTC price action staying below $26,000.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) circled $25,800 on June 6 as the aftermath of fresh panic over largest exchange Binance lingered.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/6ff377e8-87ce-4987-b106-bdbdd32ed4d9.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day candle chart on Bitstamp. Source: TradingView</em></figcaption></figure><h2>BTC price risks losing multi-month range</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> followed BTC/USD as it steadied after dropping to near three-month lows.</p><p>The weakness came as part of a knee-jerk market reaction to news that United States regulators were suing Binance and its CEO, Changpeng Zhao, also known as CZ, over “a variety of securities law violations.”</p><p>“Through thirteen charges, we allege that Zhao and Binance entities engaged in an extensive web of deception, conflicts of interest, lack of disclosure, and calculated evasion of the law,” SEC Chair Gary Gensler stated in part of a <a href=\"https://www.sec.gov/news/press-release/2023-101\" target=\"_blank\" rel=\"noopener nofollow\">press release</a>.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Wonder if he ever reads the comments under his post, from the consumers he is suppose to protect. <a href=\"https://t.co/xQjC872GsD\">https://t.co/xQjC872GsD</a></p>&mdash; CZ  Binance (@cz_binance) <a href=\"https://twitter.com/cz_binance/status/1665817591229579267?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While sparks continued to fly between the exchange and the U.S. Securities and Exchange Commission (SEC) — even on social media — Bitcoin traders looked to what a recovery might look like.</p><p>Popular trader Crypto Ed considered $26,200 as a bounce target before fresh downside kicked in thanks to a lack of spot buyer demand.</p><p>“I think we’re pretty close to a bounce, but could be a short-term bounce,” he summarized in a dedicated <a href=\"https://www.youtube.com/watch?v=yKXQp3dwBuY\" target=\"_blank\" rel=\"noopener nofollow\">YouTube market update</a> following the Binance news.</p><p>Crypto Ed added that his downside target lay at or just above the $24,000 mark.</p><p>Fellow trader Crypto Tony agreed, sharing a similar mid-term roadmap for BTC price.</p><p>“Shed some more profit on my short this morning, but now looking for a relief wave before the final leg down towards $24,500,” he <a href=\"https://twitter.com/CryptoTony__/status/1665986631764000768/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">told</a> Twitter followers. </p><blockquote>“I anticipate this is the final leg down before we accumulate for pump to come July / August.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/ee2d581a-c8ca-4508-acbc-86f0fde0f8f7.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Crypto Tony/ Twitter</em></figcaption></figure><p>On the day, trading suite Decentrader warned over a high long/short ratio on Bitcoin, this even beating levels seen after the implosion of exchange FTX in November 2022.</p><p>“We would typically like to see this start to decrease, if we are to keep bouncing,” it <a href=\"https://twitter.com/decentrader/status/1665939335592710145\" target=\"_blank\" rel=\"noopener nofollow\">argued</a> in part of Twitter commentary.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>&#39;s Long/Short ratio is now extremely high, higher than during the FTX collapse.<br><br>We would typically like to see this start to decrease, if we are to keep bouncing. <a href=\"https://t.co/TBohV62y6O\">https://t.co/TBohV62y6O</a> <a href=\"https://t.co/2kSxndd9QV\">pic.twitter.com/2kSxndd9QV</a></p>&mdash; Decentrader (@decentrader) <a href=\"https://twitter.com/decentrader/status/1665939335592710145?ref_src=twsrc%5Etfw\">June 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Risk assets already \"on edge\"</h2><p>Others looked beyond the Binance story to call for the broader risk asset environment to improve in the coming months.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/31k-was-not-the-end-5-things-to-know-in-bitcoin-this-week\">‘$31K was not the end’ — 5 things to know in Bitcoin this week</a></em></strong></p><p>Among them was Arthur Hayes, former CEO of derivatives exchange BitMEX, who in a reaction suggested that sub-par crypto performance was tied directly to activity within the U.S. economy.</p><p>The Treasury General Account (TGA) was increasing, he noted, repeating an <a href=\"https://cointelegraph.com/news/arthur-hayes-bets-on-bitcoin-altcoin-surge-in-h1-2023-as-he-buys-btc\">existing theory</a> about what would happen to crypto prices for the rest of 2023.</p><p>\"The market is down on some binance FUD. But regardless of the catalyst, risk mrkts r on edge cause of the TGA refill,\" he <a href=\"https://twitter.com/CryptoHayes/status/1665877495558844418\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in part of a Twitter post. </p><blockquote>\"By end of summer the mrkt will move past that and onto the lg amt of money printing humming along in the background.\"</blockquote><p>According to monitoring resource <a href=\"https://www.coinglass.com/LiquidationData\" target=\"_blank\" rel=\"noopener nofollow\">CoinGlass</a>, crypto long traders saw liquidations, which totaled just shy of $300 million on June 5.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/82eeb2ac-2992-4ca0-a6b3-3439aa701b79.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto liquidations chart. Source: CoinGlass</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-home-loan-bitcoin-mortgage-risky/\">Home loans using crypto as collateral: Do the risks outweigh the reward?</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-06T09:06:26.000Z",
    "title": "Dissecting the SEC lawsuit through on-chain analysis",
    "url": "https://cryptoslate.com/insights/dissecting-the-sec-lawsuit-through-on-chain-analysis/",
    "description": "<p>Quick Take Following the announcement of the SEC suing Binance, we saw very similar behaviors to when the CFTC announced they were suing Binance. Kaiko&#8217;s research shows the Bitcoin price move between the CFTC and SEC lawsuit announcement in the chart below. Bitcoin recovered from the CFTC suit in a shorter amount of time than [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/dissecting-the-sec-lawsuit-through-on-chain-analysis/\">Dissecting the SEC lawsuit through on-chain analysis</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-06T08:56:43.000Z",
    "title": "SEC-induced panic saw $53 billion wiped from crypto market",
    "url": "https://cryptoslate.com/sec-induced-panic-saw-53-billion-wiped-from-crypto-market/",
    "description": "<p>The total crypto market cap fell $53 billion as news of the U.S. Securities and Exchange Commission (SEC) filing against Binance came through. On June 5, the SEC charged Binance, its CEO Changpeng Zhao, and related entities with 13 violations, including wash trading, evasion of regulations, and offering unregistered securities. Binance said it was disappointed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-induced-panic-saw-53-billion-wiped-from-crypto-market/\">SEC-induced panic saw $53 billion wiped from crypto market</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-06T09:00:36.000Z",
    "title": "Walbi AI-Powered Platform to Launch MVP, Enhance Decision-Making for Crypto Traders",
    "url": "https://cryptodaily.co.uk/2023/06/walbi-ai-powered-platform-to-launch-mvp-enhance-decision-making-for-crypto-traders",
    "description": "<p>Whether it's crypto, stocks, or forex, the cold hard truth is that most traders lose.</p>\n<p>An analysis of eToro trades revealed that nearly 80% of the platform's active users were unprofitable over the course of a year, with a 36.3% median loss. Another study found that 97% of futures traders in Brazil lost money over 300 days. Only 5% of Taiwanese day traders were profitable between 1992 and 2006.</p>\n<p>When the stakes are high, human error becomes costly. This is the case with trading, where trader decisions are often tainted with split-second decisions, panic-based actions, and a sunk cost fallacy mentality. This is likely why the stock market is increasingly run by machines and algorithms.</p>\n<p>Artificial intelligence has proved capable of tackling this challenge, and one company called Walbi has already designed an AI solution to assist crypto traders.</p>\nTapping Into the Power of AI\n<p>Recent breakthroughs in generative AI have created tremendous hype around artificial intelligence tools.</p>\n<p>The technology has proven effective in tasks thought to be impossible for an algorithm, like content creation and art generation. Now, AI technology is increasingly prolific in the financial industry. While robo-advisor AUM is expected to reach $2.02 trillion by 2027, startups are leveraging AI to enhance crypto trader performance.</p>\n<p>AI offers the advantage of processing data much faster than a human. Where a human has to spend hours or days understanding trends and making decisions based on them, an AI can recognize patterns in seconds and offer advice to the trader. It can analyze the market in real-time and catch sudden shifts, fraud, and malicious activity, and even make low-level trading decisions. This allows traders with AI assistance to make quick and confident trading decisions, which in the trading world is incredibly important.&nbsp;</p>\n<p>Walbi is currently building a crypto trading platform that offers all these benefits, and the project is expected to achieve a significant milestone with the launch of its minimum viable product (MVP) in June 2023.</p>\nWalbi's AI-Driven Crypto Trading Solution\n<p>Walbi is a next-gen hybrid decentralized finance (DeFi) platform consisting of a crypto exchange, non-custodial Web3 wallet, and AI tool suite to supercharge trader decision-making. The project has multiple flagship solutions that aim to fulfill Walbi&rsquo;s mission to make the blockchain industry simpler and more intuitive for everyone.</p>\n<p>The first one is the Walbi Exchange, a crypto exchange offering up to 500 times more leverage for futures traders without a mandatory KYC. Besides managing liquidity, Walbi's AI tools optimize the order book by predicting demand for digital assets and automatically detecting wash trading, spoofing, and other malicious activity.&nbsp;</p>\n<p>Besides Walbi Exchange, the project will offer:</p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Walbi Lighthouse: An AI-based trading assistant that does research on behalf of traders and assists them with real-time financial data analysis and personalized trading advice. Lighthouse helps traders make more confident and well-informed decisions while minimizing the risks of human error</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Walbi Earn: Allows users to stake their crypto assets on Walbi to earn interest without any locking periods and with weekly payouts</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Walbi Cloud Miner: A cloud mining solution enabling users to mine BTC without purchasing or operating expensive equipment</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Walbi Wallet: A decentralized, non-custodial Web3 wallet offering users full control over their funds</li>\n</ul>\nWalbi's Upcoming MVP Launch\n<p>Walbi is currently in closed alpha but will soon launch its MVP. This release will expand the project's ecosystem with several features and functions, including:</p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\">WalletConnect integration</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">digital asset deposits and withdrawals</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">margin trading</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">AI-driven trading insights via Walbi Lighthouse</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">the Walbi Waves invite system</li>\n</ul>\n<p>Besides the features listed above, Walbi's roadmap includes numerous future feature releases. During Q3-Q4 2023, the platform plans to launch WalletConnect integration and margin trading, NFTs, Walbi Lighthouse, and token swaps. Walbi Waves and Cloud Mining, Walbi Exchange, Walbi Earn and portfolio tools, and Walbi Wallet will become accessible to platform users throughout 2024.</p>\n\nCrypto Trading, Supercharged\n<p>Artificial intelligence models are poised to be an unprecedented improvement to trader performance which has long struggled with unprofitable strategies and approaches.</p>\n<p>Walbi is arriving soon and will be one of the first to leverage the power of AI to make trading faster, easier, and safer. With the assistance of AI tools, the project enables crypto traders to make data-driven decisions, potentially increasing their long-term profitability.</p>\n<p>Want to learn more about Walbi? Check out the project's blog and subscribe to its Telegram and Twitter channels.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-06T09:00:41.000Z",
    "title": "Kraken faces issues with funding gateways, deposits and withdrawals affected",
    "url": "https://crypto.news/kraken-faces-issues-with-funding-gateways-deposits-and-withdrawals-affected/",
    "description": "Kraken is experiencing delays in deposits and withdrawals due to issues with multiple crypto funding gateways such as bitcoin (BTC), ether (ETH), and ERC20. On June 6, Kraken announced that it is addressing an issue causing delays in deposits and&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-06T09:00:00.000Z",
    "title": "Ethereum struggles to break $2,000, DigiToads presale on track to raise over $5 million",
    "url": "https://crypto.news/ethereum-struggles-to-break-2000-digitoads-presale-on-track-to-raise-over-5-million/",
    "description": "DigiToads (TOADS) has outperformed the market while Ethereum (ETH) faces rejections at the $2,000 level. The ongoing presale is on track to raise over $5 million"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-06T09:04:52.000Z",
    "title": "A Shiba Inu Veteran Who Bought Minutes After Launch Is Now Backing A New Memecoin Guess Which?",
    "url": "https://www.crypto-news-flash.com/a-shiba-inu-veteran-who-bought-minutes-after-launch-is-now-backing-a-new-memecoin-guess-which/?utm_source=rss&utm_medium=rss&utm_campaign=a-shiba-inu-veteran-who-bought-minutes-after-launch-is-now-backing-a-new-memecoin-guess-which",
    "description": "<p>The hunt for the next profitable investment never ends for investors. While they&#8217;re profiting massively from a project, you’ll find them already on the lookout for the next big thing in the industry. The next big play for this veteran investor who cashed out big on Shiba Inu is a new memecoin that analysts believe [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/a-shiba-inu-veteran-who-bought-minutes-after-launch-is-now-backing-a-new-memecoin-guess-which/\">A Shiba Inu Veteran Who Bought Minutes After Launch Is Now Backing A New Memecoin Guess Which?</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-06T08:59:00.000Z",
    "title": "Apple Enters the Metaverse Arena with Vision Pro Mixed Reality Headset",
    "url": "https://coinedition.com/apple-enters-the-metaverse-arena-with-vision-pro-mixed-reality-headset/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Apples_New_Headset_Could_Change_the_Way_We_Design_the_Metaverse-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Apples_New_Headset_Could_Change_the_Way_We_Design_the_Metaverse-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Apples_New_Headset_Could_Change_the_Way_We_Design_the_Metaverse-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Apples_New_Headset_Could_Change_the_Way_We_Design_the_Metaverse-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Apples_New_Headset_Could_Change_the_Way_We_Design_the_Metaverse-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Apples_New_Headset_Could_Change_the_Way_We_Design_the_Metaverse-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Apples_New_Headset_Could_Change_the_Way_We_Design_the_Metaverse.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Apple has made a significant splash in the world of immersive digital technology with the release of its highly anticipated Vision Pro mixed reality headset. The Vision Pro headset, an extension of Apple’s existing hardware lineup, introduces a range of cutting-edge features and capabilities. It boasts an impressive 23 million pixels across two high-resolution displays, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/apple-enters-the-metaverse-arena-with-vision-pro-mixed-reality-headset/\">Apple Enters the Metaverse Arena with Vision Pro Mixed Reality Headset</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-06T08:45:00.000Z",
    "title": "Coinbase CLO Urges Clear Crypto Rules as US Falls Behind on Capitol Hill",
    "url": "https://coinedition.com/coinbase-clo-urges-clear-crypto-rules-as-us-falls-behind-on-capitol-hill/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/coinbase-7-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/coinbase-7-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/coinbase-7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/coinbase-7-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/coinbase-7-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/coinbase-7-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/coinbase-7.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Coinbase chief legal officer Paul Grewal has recently announced that he will be testifying on Capitol Hill before the House Committee on Agriculture. In a long Twitter thread, he stated that the testimony addresses the necessity for clear crypto rules and the Digital Asset Market Structure Discussion Draft. Grewal chalked out the summary of what [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-clo-urges-clear-crypto-rules-as-us-falls-behind-on-capitol-hill/\">Coinbase CLO Urges Clear Crypto Rules as US Falls Behind on Capitol Hill</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]