[
  {
    "source": "Cointelegraph",
    "date": "2023-08-10T07:44:46.000Z",
    "title": "BNB Chain hard fork to improve security & compatibility with EVM chains ",
    "url": "https://cointelegraph.com/news/bnb-chain-hard-forks-improve-finality-security",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/1e939590-354b-407b-a406-ad05a59197e7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance’s BNB Chain is set for two upgrades that are aimed at improving finality of the network and compatibility with other EVM blockchains. </p>\n                    <p><p>Binance’s proprietary <a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-the-bnb-chain-the-evolution-of-the-binance-smart-chain\">BNB Smart Chain</a> (BSC) is set to undergo two hard forks through August 2023 that are aimed at reducing the possibility of a malicious blockchain reorganization and increasing the compatibility with other EVM blockchain networks.</p><p>The Plato and Hertz upgrades are scheduled for Aug. 10 and Aug. 30 respectively, following extensive testing. The Plato upgrade, which has already taken place, introduces BEP-126. The latest evolution proposal implements a fast finality mechanism that is expected to rule out the ability for blocks to be reverted.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2ddaa3da-d95a-4750-82e4-ea83bc2a3a8f.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>The Plato upgrade and hard fork was carried out Aug. 10 at block height 30724096. Source: bscscan.com</em></figcaption></figure><p>Arno Bauer, Senior Solution Architect at BNB Chain, unpacked the specifics of the network upgrades in conversation with Cointelegraph. The fast finality mechanism is expected to reduce the chance of chain reogranization and stabilize block production, while allowing users to access accurate information from the latest finalized block instantly.</p><blockquote>“Overall, BEP-126 aims to enhance blockchain security and efficiency on the BNB Smart Chain by introducing a fast finality mechanism.”</blockquote><p>Bauer added that finality is a core concept of blockchain technology, referring to the point at which a transaction or block of transactions can no longer be altered or reversed. Finality remains a crucial component in maintaining trust and preventing double-spending in blockchain systems.</p><p>BEP-126 introduces fast finality through a series of steps. Validators begin by proposing a block to the network which is propagated to other validators. Validators then sign for the block using their private key, creating a vote message. Voting aggregation then takes place, with validator votes gathered into a pool and aggregated if the direct parent block has enough votes. </p><p><a href=\"https://cointelegraph.com/news/binance-smart-chain-becomes-bnb-chain\"><strong><em>Related: Binance Smart Chain and Binance Chain become BNB Chain</em></strong></a></p><p>Validators must follow specific rules when voting for blocks, an example being not publishing two distinct votes for the same height. The finality rules also stipulate that a block is ‘justified’ if there’s an attestation in the child block's header, while it's finalized if it's justified and its direct child is justified.</p><p>The fork including the highest justified block is considered the longest chain, even if other chain forks have a higher difficulty sum. Producing blocks and finalizing blocks also have different requirements in terms of the number of validators needed.</p><p>Lastly, BNB Chain validators are rewarded for voting, and those who violate the vote rules are slashed in a similar manner to Ethereum’s proof of stake protocol.</p><p>The Hertz hard fork is earmarked for Aug. 30 and is aimed at keeping the BNB Chain up to date with the latest development of Ethereum Virtual Machine (EVM) blockchains. As Bauer explains, the BSC needs to keep its block and transaction structures as well as its base EVM updated to match Ethereum's recently implemented Berlin and London forks.</p><blockquote>“Therefore, for compatibility reasons it is important that those EIPs are also enabled on BSC to ensure a smooth development and ecosystem growth.”</blockquote><p>Bauer said that the fast finality mechanism should provide a more secure environment for decentralized applications (DApps), while faster transaction finality should improve responsiveness and efficiency of DApps running on BSC.</p><p><em><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\">Deposit risk: What do crypto exchanges really do with your money?</a></strong></em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-10T07:43:24.000Z",
    "title": "Biden administration launches AI cybersecurity challenge to ‘protect Americans’",
    "url": "https://cointelegraph.com/news/us-launches-ai-challenge-to-strengthen-critical-infrastructure",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/aeb668f8-1a72-459f-95ab-146a20ef04c3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>With an allocation of nearly $20 million in rewards, the AI Cyber Challenge brings together prominent AI enterprises such as Anthropic, Google, Microsoft and OpenAI.</p>\n                    <p><p>In an Aug. 9 press release, the Biden administration revealed an opportunity for hackers to compete for substantial monetary rewards by applying <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligence\"></a><a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligence\">artificial intelligence (AI)</a> to safeguard vital United States infrastructure from cybersecurity vulnerabilities.</p><p>In spring, a preliminary phase will select up to 20 high-performing teams for DEF CON 2024’s semifinals. Of these, a maximum of five teams will earn $2 million each and move on to DEF CON 2025's finals. The top three teams will vie for extra prizes, including a $4 million award for the best safeguarding of vital software, as stated in an official press <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2023/08/09/biden-harris-administration-launches-artificial-intelligence-cyber-challenge-to-protect-americas-critical-software/\" target=\"_blank\" rel=\"noopener nofollow\">release</a>.</p><p>With an allocation of nearly $20 million in rewards, the AI Cyber Challenge brings together prominent AI enterprises such as Anthropic, Google, Microsoft, and OpenAI. These industry leaders will contribute their technology to the competition, which was unveiled during the Black Hat U.S.A. hacking conference held in Las Vegas.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f6e55c2f-5f6b-4023-bba8-62ff8167d1d4.JPG\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of the press release announcing the challenge. Source: The White House</em></figcaption></figure><p>Participants will be requested to publicly share the inner workings of their systems, enabling broader utilization of their solutions. Additionally, guidance for the challenge is provided by the Open Source Security Foundation, a division of the Linux Foundation.</p><p>The organizing body of the competition, the Defense Advanced Research Projects Agency (DARPA), has committed to offering financial support of up to $1 million to seven small enterprises aiming to join the competition, thus ensuring a diverse range of participants.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/us-house-financial-services-committee-leadership-opposing-sides-paypal-stablecoin\"><strong><em>US House Financial Services Committee leadership takes opposing sides on the PayPal stablecoin</em></strong></a></p><p>The use of hacking competitions to foster innovation is not a new approach for the government. Back in 2014, DARPA initiated the Cyber Grand Challenge, aimed at creating an open-source automated defense system capable of safeguarding computers against cyber threats. The present two-year challenge follows a comparable framework to this prior initiative.</p><p>The contest shows that there are official efforts to deal with a new threat that experts are working to fully understand. In the past year, several <a href=\"https://cointelegraph.com/news/meta-releases-commercial-ai-tools-to-rival-google-open-ai\">U.S. companies have created different AI tools</a>, like ChatGPT, that let users make realistic videos, images, texts and code.</p><p>On August 9, President Joe Biden <a href=\"https://www.whitehouse.gov/briefing-room/presidential-actions/2023/08/09/executive-order-on-addressing-united-states-investments-in-certain-national-security-technologies-and-products-in-countries-of-concern/\" target=\"_blank\" rel=\"noopener nofollow\">issued</a> an executive order with the intention of overseeing fresh U.S. investments and knowledge contributing to the advancement of sensitive technologies in China. Anticipated for implementation in the coming year, the recent action focuses on investments in semiconductors, microelectronics, quantum computing and specific artificial intelligence capacities.</p><p>In the executive order, Biden cautioned that specific American investments might aid the creation of sensitive technologies and products in nations using them to counter U.S. and allied strengths.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\"><strong><em>Experts want to give AI human ‘souls’ so they don’t kill us all</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T08:09:57.000Z",
    "title": "Hackers Exploit ‘Prompt Injection’ Technique to Manipulate AI Systems",
    "url": "https://www.cryptopolitan.com/hackers-exploit-prompt-injection-technique/",
    "description": "Hackers have discovered a new technique called &#8216;prompt injection&#8217; that exploits the responsiveness of AI systems, enabling them to manipulate these systems using simple English commands. One notable instance involves Johann Rehberger, a security researcher, who successfully coaxed OpenAI&#8217;s ChatGPT into performing unauthorized actions, such as reading an email, summarizing its content, and posting it ... <a title=\"Hackers Exploit &#8216;Prompt Injection&#8217; Technique to Manipulate AI Systems\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hackers-exploit-prompt-injection-technique/\" aria-label=\"More on Hackers Exploit &#8216;Prompt Injection&#8217; Technique to Manipulate AI Systems\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T07:56:21.000Z",
    "title": "Ethereum, Optimism, and VC Spectra: Evaluating Current Prices and Future Prospects",
    "url": "https://www.cryptopolitan.com/ethereum-optimism-and-vc-spectra-evaluating-current-prices-and-future-prospects/",
    "description": "Despite Optimism (OP) being Ethereum&#8217;s layer-2, it&#8217;s gaining more value traction. Still, Ethereum (ETH) continuously thrives on new collaborations to maintain its superiority. In the midst of these two altcoins is VC Spectra (SPCT). While little known, this will soon change as more investors come on board to receive unparalleled returns. Let&#8217;s look at the ... <a title=\"Ethereum, Optimism, and VC Spectra: Evaluating Current Prices and Future Prospects\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-optimism-and-vc-spectra-evaluating-current-prices-and-future-prospects/\" aria-label=\"More on Ethereum, Optimism, and VC Spectra: Evaluating Current Prices and Future Prospects\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-10T08:08:40.000Z",
    "title": "SEC challenges Ripple with appeal over XRP’s status",
    "url": "https://crypto.news/sec-challenges-ripple-with-appeal-over-xrps-status/",
    "description": "SEC files an appeal against Ripple&#8217;s recent court win, reigniting the debate on XRP&#8217;s status as a security. The US Securities and Exchanges Commission (SEC) has filed an interlocutory appeal of the trial sentence against Ripple. The regulator aims to&#8230;"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-10T07:56:49.000Z",
    "title": "Uzbekistan Ramps up Crypto Adoption, Issuing New Regulatory License",
    "url": "https://coinedition.com/uzbekistan-ramps-up-crypto-adoption-issuing-new-regulatory-license/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Vladmir_Norov_tweets_about_the_regulators_issuance_of_license_for-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Vladimir Norov, the former Minister of Foreign Affairs of Uzbekistan shared a Twitter thread earlier today, announcing that the payment platform Paynet Crypto has acquired a license for its crypto activities. As per the tweet, The National Agency for Perspective Projects (NAPP) of the Republic of Uzbekistan has permitted a license for LLC Paynet Crypto, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/uzbekistan-ramps-up-crypto-adoption-issuing-new-regulatory-license/\">Uzbekistan Ramps up Crypto Adoption, Issuing New Regulatory License</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]