[
  {
    "source": "CryptoSlate",
    "date": "2023-06-03T09:00:14.000Z",
    "title": "NFTs and Big Brands: Exploring new possibilities",
    "url": "https://cryptoslate.com/nfts-and-big-brands-exploring-new-possibilities/",
    "description": "<p>The surge in popularity of NFTs, which are unique digital tokens that cannot be replicated, has recently captured the attention of notable corporations. Big names such as Marvel (a subsidiary of Disney), Coca-Cola, Gucci, Pizza Hut, KFC, Taco Bell, Lamborghini, and Hot Wheels (which is owned by Mattel) have joined the frenzy by delving into [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/nfts-and-big-brands-exploring-new-possibilities/\">NFTs and Big Brands: Exploring new possibilities</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-03T09:03:08.000Z",
    "title": "Liquity price analysis: Bulls maintain an uptrend as LQTY touches $1.24",
    "url": "https://www.cryptopolitan.com/liquity-price-analysis-2023-06-03/",
    "description": "The Liquity price analysis (LQTY) market is showing signs of strength as the cryptocurrency continues to build upon its recent gains. The digital token has maintained an impressive uptrend over the past few days, with the price of LQTY rising above $1.24 today. The coin is up by nearly 4 percent in the past 24 ... <a title=\"Liquity price analysis: Bulls maintain an uptrend as LQTY touches $1.24\" class=\"read-more\" href=\"https://www.cryptopolitan.com/liquity-price-analysis-2023-06-03/\" aria-label=\"More on Liquity price analysis: Bulls maintain an uptrend as LQTY touches $1.24\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-03T08:42:50.000Z",
    "title": "Floki Inu Gains Momentum As Chinese E-Commerce Giant Recognizes Its Utility",
    "url": "https://www.newsbtc.com/news/floki-inu-gains-momentum-as-chinese-e-commerce-giant-recognizes-its-utility/",
    "description": "Floki Inu (FLOKI) is taking a giant leap forward in the world of meme assets. In an exciting development, the team behind this dog-themed cryptocurrency has unveiled a groundbreaking announcement: users can now utilize Floki to make purchases on AliExpress, a global e-commerce giant.  This unprecedented integration with one of the world&#8217;s largest online retailers is set to revolutionize the way people perceive and interact with cryptocurrencies, catapulting Floki Inu to new heights of recognition and utility. Related Reading: Can Shiba Inu Rebound As It Wraps Up May With A Discouraging 16% Decline? Floki Inu: Revolutionizing E-Commerce With AliExpress Integration In an announcement, FLOKI holders can now harness the power of their digital assets to make seamless purchases on AliExpress. AliExpress is a Chinese-based online retail service operated by the Alibaba Group. It was established in 2010 and is comprised of small businesses in China and other locations, such as Singapore, that sell products to international online shoppers. You can now purchase products on #AliExpress using $FLOKI through https://t.co/ee0PBRn2Nh!🔥 Buy from a selection of over 100 million items and enjoy shipping to over 200 countries.#FLOKI&#8216;s ecosystem keeps growing!💪🏽 https://t.co/XEeOLamoQ9 — FLOKI (@RealFlokiInu) May 31, 2023 This milestone has been made possible through the integration of Shopping.io, a crypto-focused e-commerce protocol that opens doors for shoppers to utilize various digital currencies for transactions with major retailers.  Among its extensive list of partner platforms are retail giants such as Walmart, Amazon, eBay, and Etsy, offering an unparalleled shopping experience powered by cryptocurrencies. Shopping.io serves as a bridge between the realm of cryptocurrencies and mainstream e-commerce, revolutionizing the way digital assets are perceived and utilized in everyday transactions.  By seamlessly integrating with popular online marketplaces, this crypto-focused e-commerce protocol provides a frictionless experience for users, making it possible to spend their cryptocurrencies effortlessly on goods and services.  BTCUSD has slightly regained the $27K territory on the weekend chart by TradingView.com FLOKI Price Impact The recent announcement of AliExpress accepting Floki Inu as a form of payment has had minimal impact on the meme asset&#8217;s price. At the time of writing, Floki Inu was trading at $0.00003184, data from crypto market tracker CoinGecko shows, experiencing a marginal decrease of 0.3% from the time of the announcement and a slight increase of 1.1% over the last 24 hours. Source: Coingecko Despite the partnership with the global online retail giant, market dynamics have resulted in modest price fluctuations for FLOKI. Moreover, analysis has shown compelling insights into the financial positions of the meme coin earlier this week. The findings indicate that 78% of FLOKI owners are sitting on losses if they were to sell their assets at the current market prices. In contrast, only 14% of FLOKI holders are currently in a profitable position, while 9% are breaking even.  Related Reading: XRP $1 Threshold On The Horizon? Noted Trader Fuels Speculation The marginal price changes observed in the wake of the AliExpress integration should be considered alongside the broader context of the meme asset market. While short-term price fluctuations may not always reflect the long-term prospects of an asset, it is essential for investors to conduct thorough research and exercise diligence when making investment decisions. -Featured image from The Cold Wire"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-03T08:45:56.000Z",
    "title": "As Avalanche (AVAX) reaches a significant milestone, DigiToads (TOADS) presale gains more confidence from investors",
    "url": "https://www.crypto-news-flash.com/as-avalanche-avax-reaches-a-significant-milestone-digitoads-toads-presale-gains-more-confidence-from-investors/?utm_source=rss&utm_medium=rss&utm_campaign=as-avalanche-avax-reaches-a-significant-milestone-digitoads-toads-presale-gains-more-confidence-from-investors",
    "description": "<p>With average user numbers recently soaring to a new high, AVAX surpasses a significant milestone as it continues to gain momentum in the altcoin world. This news hits the press just after DigiToads (TOADS) also reached a new milestone: surpassing $4.4 million in sales in just a few short weeks of its early presale journey. [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/as-avalanche-avax-reaches-a-significant-milestone-digitoads-toads-presale-gains-more-confidence-from-investors/\">As Avalanche (AVAX) reaches a significant milestone, DigiToads (TOADS) presale gains more confidence from investors</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-03T08:58:00.000Z",
    "title": "Binance CEO: We Won’t Mine Bitcoin But Will Integrate Lightning Network",
    "url": "https://coinedition.com/binance-ceo-we-wont-mine-bitcoin-but-will-integrate-lightning-network/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance CEO: We Won&#039;t Mine Bitcoin But Will Integrate Lightning Network\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>During a recent Ask Me Anything (AMA) session, Binance CEO Changpeng Zhao (CZ) sent shockwaves through the crypto community, making bold declarations that sent ripples through the mining and transaction sectors. Zhao firmly stated that Binance has no intentions of dabbling in the complex world of Bitcoin mining hardware. He acknowledged that mining is a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-ceo-we-wont-mine-bitcoin-but-will-integrate-lightning-network/\">Binance CEO: We Won&#8217;t Mine Bitcoin But Will Integrate Lightning Network</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]