[
  {
    "source": "Cryptopolitan",
    "date": "2023-10-07T15:08:54.000Z",
    "title": "SBF’s tweets take center stage in trial – Details",
    "url": "https://www.cryptopolitan.com/sbfs-tweets-take-center-stage-in-trial/",
    "description": "The echoes of Sam Bankman-Fried&#8217;s digital utterances are ringing loud and clear across the courtroom in New York, making one wonder: in an age where tweets can be casually dashed off in seconds, can those very seconds come back to cost you years, or even a lifetime? The billionaire entrepreneur, commonly known as SBF, finds ... <a title=\"SBF&#8217;s tweets take center stage in trial &#8211; Details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sbfs-tweets-take-center-stage-in-trial/\" aria-label=\"More on SBF&#8217;s tweets take center stage in trial &#8211; Details\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-07T14:46:36.000Z",
    "title": "Six Reasons Why AI Doesn’t Conquer Creativity",
    "url": "https://www.cryptopolitan.com/six-reasons-why-ai-doesnt-conquer-creativity/",
    "description": "In the beginning, there was excitement surrounding the potential of Artificial Intelligence (AI) to revolutionize various industries, from content creation to healthcare. The prospect of AI taking over jobs seemed imminent. However, as we approach the midpoint of the year, a stark reality has set in: AI is not a silver bullet but a tool ... <a title=\"Six Reasons Why AI Doesn&#8217;t Conquer Creativity\" class=\"read-more\" href=\"https://www.cryptopolitan.com/six-reasons-why-ai-doesnt-conquer-creativity/\" aria-label=\"More on Six Reasons Why AI Doesn&#8217;t Conquer Creativity\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-07T15:00:02.000Z",
    "title": "Here’s How Sam Bankman-Fried Allegedly Used Customer Funds On Alameda Research",
    "url": "https://www.newsbtc.com/ftx/sam-bankman-fried-allegedly-used-customer-funds/",
    "description": "On day four of the criminal trial of former FTX CEO Sam Bankman-Fried, Gary Wang, who co-founded the now-bankrupt crypto exchange and served as its former chief technology officer (CTO), testified. During his testimony, the former FTX executive revealed details about the connection between the cryptocurrency exchange and Alameda Research. FTX’s Sam Bankman-Fried Allegedly Gave Alameda Research &#8216;Special Privileges&#8217; According to various reports, on Friday, October 6, Wang appeared again in court and testified that Alameda Research’s account on FTX was allowed to trade more funds than it had available. The former FTX CTO reportedly said that Sam Bankman-Fried authorized the integration of a “allow negative” feature, which afforded Alameda “special privileges” on FTX. Wang reportedly revealed that the “allow negative” feature enabled Alameda to hold a negative balance more than FTX’s revenue at some point in 2020 ($200 million against $150 million). According to reports, Wang claimed that he increased Alameda’s line of credit several times and up to $65 billion under Bankman-Fried’s instructions. Related Reading: Dogecoin Under Pressure: Will Bearish Momentum Push Meme Coin Below $0.06? When the government&#8217;s prosecutors questioned where the money came from, Wang reportedly affirmed that it came from FTX’s customers’ funds. Based on the co-founder’s testimony, Bankman-Fried claimed that the “allow negative” feature was all about FTT, a native cryptocurrency “created to act as equity in FTX.” Wang reportedly acknowledged that the customers never authorized their funds to be used by Alameda Research. “The customers did not give us permission to use their accounts like this,” the former FTX chief technology officer allegedly said. Did SBF Repeatedly Lie About Connections With Alameda? During his testimony, Wang was asked whether he remembered Bankman-Fried making public statements about Alameda’s unusual connections with the FTX exchange. “Yes, he (SBF) said they (Alameda Research) were treated equally and didn&#8217;t use FTX funds,” the FTX cofounder allegedly affirmed. Furthermore, the prosecutors showed Wang &#8211; and the court &#8211; a 2019 tweet from SBF claiming that Alameda was not using funds from FTX. Interestingly, Wang affirmed that Bankman-Fried ordered the addition of “allow negative” in the exchange’s codebase on the same day the tweet was made. Related Reading: Trillions In Shiba Inu On The Move: What Lies Ahead For The Meme Coin? It appears that is not the only time Bankman-Fried lied about Alameda’s activities on the FTX exchange. The former FTX CTO testified that Bankman-Fried subsequently claimed on Twitter (now X) and on phone calls that customer funds were kept safe. On Thursday, October 5, Gary Wang reportedly admitted to committing fraud-related crimes while at the FTX exchange alongside Sam Bankman-Fried, former Alameda CEO Caroline Ellison, and former engineering director Nishad Singh. With the trial expected to continue till November, it remains to be seen whether or when the other former top FTX and Alameda executives will take the stand. FTT price trading at $1.188 on the daily timeframe &#124; Source: FTTUSDT chart on TradingView Featured image from Vox, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-07T14:53:25.000Z",
    "title": "Blockchain für Energie: Öl-Konsortium bringt bahnbrechende Logistiklösung auf den Markt – basiert sie auf VeChain?",
    "url": "https://www.crypto-news-flash.com/blockchain-for-energy-oil-consortium-launches-game-changing-logistics-solution-is-it-based-on-vechain/?utm_source=rss&utm_medium=rss&utm_campaign=blockchain-for-energy-oil-consortium-launches-game-changing-logistics-solution-is-it-based-on-vechain",
    "description": "<img width=\"1000\" height=\"697\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-300x209.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-VeChain-768x535.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Das Energiekonsortium Blockchain for Energy (B4E) ist jetzt in die Logistik eingestiegen. Als Top-Blockchain für das Lieferkettenmanagement scheint VeChain der richtige Kandidat für die zukünftige Integration durch B4E zu sein. Das Öl- und Gaskonsortium Blockchain for Energy (B4E) hat angekündigt den Start seiner Logistiklösung mit dem Namen Commodity Transport Web3 Field Automation bekannt gegeben. Die [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-07T15:09:00.000Z",
    "title": "Justin Sun’s $132M ETH Withdrawal: Is He About to Dump?",
    "url": "https://coinedition.com/justin-suns-132m-eth-withdrawal-is-he-about-to-dump/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Justin-Sun-Takes-a-Stand-for-User-focused-Trading-Platform.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Justin Sun’s Large ETH Withdrawal Ignites Selloff Fears\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Justin-Sun-Takes-a-Stand-for-User-focused-Trading-Platform.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Justin-Sun-Takes-a-Stand-for-User-focused-Trading-Platform-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Justin-Sun-Takes-a-Stand-for-User-focused-Trading-Platform-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Justin-Sun-Takes-a-Stand-for-User-focused-Trading-Platform-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Justin-Sun-Takes-a-Stand-for-User-focused-Trading-Platform-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Justin-Sun-Takes-a-Stand-for-User-focused-Trading-Platform-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The founder of TRON (TRX) and cryptocurrency entrepreneur, Justin Sun, applied to withdraw 80,251 Ethereum (ETH) tokens on Wednesday, according to a post shared by Lookonchain earlier today. This is making ETH holders jumpy as they are now questioning whether Sun is getting ready to dump his tokens, which could trigger a steep price drop. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/justin-suns-132m-eth-withdrawal-is-he-about-to-dump/\">Justin Sun&#8217;s $132M ETH Withdrawal: Is He About to Dump?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]