[
  {
    "source": "Cointelegraph",
    "date": "2023-08-18T09:20:28.000Z",
    "title": "ChatGPT politically biased towards left in the US and beyond: Research",
    "url": "https://cointelegraph.com/news/chatgpt-politically-biased-towards-left-in-us-and-beyond",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/cbd0cdaa-a64e-49a5-aec5-a6f14aa3802a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Even after facing evidence that ChatGPT has a political bias, the chatbot continued to insist that it and OpenAI were unbiased.</p>\n                    <p><p>ChatGPT, a major large language model (LLM)-based chatbot, allegedly lacks objectivity when it comes to political issues, according to a new study.</p><p>Computer and information science researchers from the United Kingdom and Brazil claim to have <a href=\"https://link.springer.com/article/10.1007/s11127-023-01097-2\" target=\"_blank\" rel=\"noopener nofollow\">found</a> “robust evidence” that ChatGPT presents a significant political bias towards the left side of the political spectrum. The analysts — Fabio Motoki, Valdemar Pinho and Victor Rodrigues — provided their insights in a study published by the journal <em>Public Choice </em>on Aug. 17.</p><p>The researchers argued that texts generated by LLMs like ChatGPT can contain factual errors and biases that mislead readers and can extend existing political bias issues stemming from traditional media. As such, the findings have important implications for policymakers and stakeholders in media, politics and academia, the study authors noted, adding:</p><blockquote>“The presence of political bias in its answers could have the same negative political and electoral effects as traditional and social media bias.”</blockquote><p>The study is based on an empirical approach and exploring a series of questionnaires provided to ChatGPT. The empirical strategy begins by asking ChatGPT to answer the political compass questions, which capture the respondent’s political orientation. The approach also builds on tests in which ChatGPT impersonates an average Democrat or Republican.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/edae31e2-6328-44e6-b97f-9dad55b18fc8.png\"  /><figcaption style=\"text-align: center;\"><em>Data collection diagram in the study “More human than human: measuring ChatGPT political bias”</em></figcaption></figure><p>The results of the tests suggest that ChatGPT’s algorithm is by default biased towards responses from the Democratic spectrum in the United States. The researchers also argued that ChatGPT’s political bias is not a phenomenon limited to the U.S. context. They wrote:</p><blockquote>“The algorithm is biased towards the Democrats in the United States, Lula in Brazil, and the Labour Party in the United Kingdom. In conjunction, our main and robustness tests strongly indicate that the phenomenon is indeed a sort of bias rather than a mechanical result.”</blockquote><p>The analysts emphasized that the exact source of ChatGPT’s political bias is difficult to determine. The researchers even tried to force ChatGPT into some sort of developer mode to try to access any knowledge about biased data, but the LLM was “categorical in affirming” that ChatGPT and OpenAI are unbiased.</p><p>OpenAI did not immediately respond to Cointelegraph’s request for comment.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/meta-open-ai-says-gpt-4-ai-cuts-content-moderation-time-down-from-months-to-hours\"><strong><em>OpenAI says ChatGPT-4 cuts content moderation time from months to hours</em></strong></a></p><p>The study authors suggested that there might be at least two potential sources of the bias, including the training data as well as the algorithm itself.</p><p>“The most likely scenario is that both sources of bias influence ChatGPT’s output to some degree, and disentangling these two components (training data versus algorithm), although not trivial, surely is a relevant topic for future research,” the researchers concluded.</p><p>Political biases are not the only concern associated with artificial intelligence tools like ChatGPT or others. Amid the ongoing massive adoption of ChatGPT, people around the world have flagged many associated risks, including privacy concerns and challenging education. Some AI tools like AI content generators even <a href=\"https://cointelegraph.com/news/ai-increase-crypto-identity-verification-risk\">pose concerns over the identity verification process</a> on cryptocurrency exchanges.</p><p><a href=\"https://cointelegraph.com/magazine/ai-eye-apple-devloping-pocket-ai-deep-fake-music-deal-hypnotize-gpt-4/\"><strong><em>AI Eye: Apple developing pocket AI, deep fake music deal, hypnotizing GPT-4</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-18T09:30:26.000Z",
    "title": "TRX leads market, $100B wiped from total crypto market cap, as ETH transaction values soar over 100%",
    "url": "https://cryptoslate.com/trx-leads-market-100b-wiped-from-total-crypto-market-cap-as-eth-transaction-values-soar-over-100/",
    "description": "<p>All major cryptocurrencies saw a sharp decrease in their values following a massive sell-off yesterday, Aug. 17. The global market cap of the crypto industry fell 8% to $1.06 trillion, wiping out over $100 billion. The trading session affected the performance of prominent cryptocurrencies, including Bitcoin (BTC), Ethereum (ETH), Tron (TRX), Ripple (XRP), and Binance [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/trx-leads-market-100b-wiped-from-total-crypto-market-cap-as-eth-transaction-values-soar-over-100/\">TRX leads market, $100B wiped from total crypto market cap, as ETH transaction values soar over 100%</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-18T09:36:41.000Z",
    "title": "Launching Rangers Protocol Node Management Platform 2.0: Empowering Node Operators",
    "url": "https://cryptodaily.co.uk/2023/08/launching-rangers-protocol-node-management-platform-20-empowering-node-operators",
    "description": "<p>Singapore, Singapore, August 18th, 2023, Chainwire</p><p>Rangers Protocol is excited to unveil its Node Management Platform 2.0, an innovative multi-functional tool designed to provide comprehensive support in node hosting. This major update not only streamlines the process for users to become verification nodes but also introduces powerful features such as the Delegated Staking System. This upgrade is a testament to Rangers Protocol's commitment to fostering an efficient and inclusive blockchain ecosystem.</p><p>Background</p><p>Rangers Protocol has consistently enabled users to access a high-performing Mainnet blockchain, a secure Connector for cross-chain transport and public chain interconnection, an optimized Sub-Chain for gaming AppChains, and a fully Ethereum-compatible REVM. Its comprehensive infrastructure has made it an essential tool for the Web3 ecosystem.</p><p>A recent highlight of Rangers Protocol's capability was its support for MetaCene, a post-apocalyptic MMORPG. Successfully deployed on Rangers Protocol&rsquo;s Robin Testnet, MetaCene showcased the performance and scalability of Rangers Protocol's blockchain technology. This application, among others, illustrates the potential of Rangers Protocol in fostering an efficient and decentralized Web3 ecosystem.</p><p>Introducing Node Management Platform 2.0</p><p>Rangers Protocol's Node Management Platform 2.0 is a one-stop solution for all user needs in node services and portfolio management. It offers features that cater to a wide range of users, from expert miners and investors to blockchain enthusiasts.</p><p>Main Features</p><p>Wallet Account Management &amp; Top Up: Users can easily register or log in using their email address, top up their hot wallets, and review top-up history.</p><p>Aggregated Application Processes: Node server purchasing, validator application, and mine owner application are now consolidated under one dashboard, offering users greater flexibility and ease of navigation.</p><p>Validator Center for Delegated Staking: Users can view, add, and look up all active validator nodes under the Validator Center, and review information about delegators, stakings, and rewards.</p><p>Delegated Staking System: This integrated system enables ecosystem nodes to open for delegations and benefit from customized commissions, while mass investors can delegate their RPG tokens to preferred nodes and enjoy distributed rewards.</p><p>Node Hosting Management: Users can review and modify their nodes and delegate under the Portfolio tab, including real-time node data on the Rangers Protocol decentralized network.</p><p>Data Interface: Users can view ecosystem nodes, monitor earnings, and gain quantitative insight on node performances with the Calculator feature.</p><p>Redefining the Node Management Experience:</p><p>The release of Node Management Platform 2.0 represents more than just an update &mdash; it is a transformative shift towards a more cohesive and intuitive experience for node operators. Rangers Protocol has consolidated essential features under a single dashboard, streamlining the process and simplifying navigation to make it easier for even those new to the blockchain industry to join the RP verification network. Furthermore, the addition of the Calculator feature provides miners with insights into their income and earnings, making monitoring straightforward and transparent. This new platform is not only accessible and user-friendly but also affordable, allowing users to join for free and rent a node at an industry-competitive price of 300 $USDT per month. By doing so, they can tap into the vast potential of the decentralized ecosystem and gain steady $RPG rewards. This comprehensive approach ensures that node hosting is more accessible, efficient, and rewarding than ever before, setting a new standard in the field of node management.</p>\"Rangers Protocol is revolutionizing node hosting and management with the launch of Node Management Platform 2.0. With its advanced features and user-friendly interface, we are empowering node operators and setting new standards in the blockchain industry.\" &ndash; Nicolas Zhu, CBO, Rangers Protocol<p>Rangers Protocol's Node Management Platform 2.0 reaffirms the company's commitment to fostering an efficient and inclusive blockchain ecosystem. With its comprehensive features and user-centered design, it offers unprecedented value to node operators, setting a new benchmark for node hosting and management. As the blockchain industry continues to grow, Rangers Protocol's cutting-edge solutions are poised to play a pivotal role in shaping the future of this technology.</p><p>About Rangers Protocol</p><p>Rangers Protocol is the backbone of a Web3 engine for creating immersive Web3 applications. It minimizes the development difficulty for Web3 developers and maximizes the user experience of its Web3 applications. Rangers Protocol provides comprehensive infrastructures for efficient complex-app development, successful cross-chain and mass distribution, diverse in-app NFT and DeFi features, and more. Through its full EVM compatibility, strategic industry partnerships, and curated all-in-one IDE, Rangers Protocol supports AAA and indie developers to succeed in the Web3 world.</p>ContactCBONicolas ZhuRangers Protocolnicola.zhu@rangersprotocol.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T09:11:22.000Z",
    "title": "Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?",
    "url": "https://www.cryptopolitan.com/rollbit-price-prediction/",
    "description": "Rollbit coin price prediction 2023-2032 Rollbit has quickly become one of the most popular crypto casinos and trading platforms. Launched in 2019, Rollbit offers a wide range of gaming, sports betting, futures trading, and NFT options for users. With no KYC requirements and support for numerous cryptocurrencies, Rollbit provides an easy entry into the world ... <a title=\"Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rollbit-price-prediction/\" aria-label=\"More on Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-18T09:37:53.000Z",
    "title": "Mastercard Forges CBDC Alliance with Ripple (XRP) and Ethereum’s ConsenSys and Industry Leaders to Shape Financial Future",
    "url": "https://www.crypto-news-flash.com/mastercard-forges-cbdc-alliance-with-ripple-xrp-and-ethereums-consensys-and-industry-leaders-to-shape-financial-future/?utm_source=rss&utm_medium=rss&utm_campaign=mastercard-forges-cbdc-alliance-with-ripple-xrp-and-ethereums-consensys-and-industry-leaders-to-shape-financial-future",
    "description": "<img width=\"1280\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Mastercard\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/05/mastercard-enhanced-48x27.jpg 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Mastercard advances in the digital currency realm with its CBDC Partner Program, fostering collaboration for CBDC innovation. Mastercard&#8217;s pivotal CBDC Partner Program aligns with global CBDC momentum and innovation, emphasizing usability and integration. Mastercard&#8217;s entrance into the digital currency sector has marked a noteworthy advancement with the introduction of its CBDC Partner Program. This initiative [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-18T09:27:54.000Z",
    "title": "VeChain’s Triumph: Revolutionizing IP Security with Blockchain",
    "url": "https://www.crypto-news-flash.com/vechains-triumph-revolutionizing-ip-security-with-blockchain/?utm_source=rss&utm_medium=rss&utm_campaign=vechains-triumph-revolutionizing-ip-security-with-blockchain",
    "description": "<img width=\"1000\" height=\"640\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/RuskaDesign-VeChain-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coinbase adds two new digital assets, they are VeChain and VeThor additionally Bince U.S includes VET in the list of 10 selected cryptocurrencies offering both USD and USDT trading.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/RuskaDesign-VeChain-1.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/RuskaDesign-VeChain-1-300x192.jpg 300w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The roles of VeChain or other blockchain technologies in reducing counterfeit products from the toy ecosystem have been highlighted in a recent post. However, there are challenges with implementation such as time and financial commitment.  The efforts to harness the potential of blockchain technology cut across several industries and countries. VeChain (VET), for instance, has [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-18T09:17:28.000Z",
    "title": "Ripple Unlocks Next-Level Treasury Management: ODL Revolution",
    "url": "https://www.crypto-news-flash.com/ripple-unlocks-next-level-treasury-management-odl-revolution/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-unlocks-next-level-treasury-management-odl-revolution",
    "description": "<img width=\"1038\" height=\"584\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-48x27.png 48w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />Ripple&#8217;s on-demand liquidity payments solution ensures that multinational businesses can complete cross-border payments with speed, ease, and cost efficiency. The solution to unlock next-level treasury management further enhances operations with on-time global payments and high liquidity helping businesses expand into new markets. Ripple is at the forefront of boosting business growth and expanding on an [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-18T09:13:18.000Z",
    "title": "Shiba Inu Continues Upward Surge, Pepe Slumps; Everlodge a Beacon of Hope for Significant Profits",
    "url": "https://www.crypto-news-flash.com/shiba-inu-continues-upward-surge-pepe-slumps-everlodge-a-beacon-of-hope-for-significant-profits/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-continues-upward-surge-pepe-slumps-everlodge-a-beacon-of-hope-for-significant-profits",
    "description": "<img width=\"512\" height=\"329\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-64.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-64.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-64-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market is characterized by its volatility and rapid shifts. As a result, it is often a roller-coaster ride for investors. In recent times, Shiba Inu (SHIB) and Pepe (PEPE) have captured the attention of investors and enthusiasts, but for different reasons. Shiba Inu continues its upward surge while Pepe experiences a decline in [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-18T09:15:56.000Z",
    "title": "XRP, Shiba Inu and Two Additional Altcoins Witnessing Increased Interest From Whales, Says Santiment",
    "url": "https://dailyhodl.com/2023/08/18/xrp-shiba-inu-and-two-other-altcoins-could-rally-as-whale-activity-surges-says-santiment-heres-the-timeline/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Whale-Activity-Surges.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Whale-Activity-Surges.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Whale-Activity-Surges.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Whale-Activity-Surges.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Whale-Activity-Surges.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Whale-Activity-Surges.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Whale-Activity-Surges.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analytics platform Santiment is singling out four top altcoins that are experiencing increased interest from whales. Santiment’s director of marketing Brian Quinlivan says that the four altcoins are &#8220;seeing some major whale activity that could indicate they could have some nice rebounds if and when crypto starts to stabilize again.&#8221; Starting with XRP, Quinlivan [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/18/xrp-shiba-inu-and-two-other-altcoins-could-rally-as-whale-activity-surges-says-santiment-heres-the-timeline/\">XRP, Shiba Inu and Two Additional Altcoins Witnessing Increased Interest From Whales, Says Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-18T09:15:17.000Z",
    "title": "$1,000,000,000 in Bitcoin, Ethereum and Crypto Assets Liquidated in Just 24 Hours As Markets Roil",
    "url": "https://dailyhodl.com/2023/08/18/220000000-in-bitcoin-ethereum-and-other-crypto-assets-liquidated-in-just-24-hours-as-markets-dip/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Crypto-Assets-Liquidated.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Crypto-Assets-Liquidated.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Crypto-Assets-Liquidated.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Crypto-Assets-Liquidated.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Crypto-Assets-Liquidated.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Crypto-Assets-Liquidated.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Crypto-Assets-Liquidated.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>More than $1 billion in crypto assets have been liquidated in the last 24 hours as Bitcoin (BTC) leads a volatile move to the downside. New data from market intelligence firm Coinglass shows that $1.02 billion in digital assets were liquidated in the last day as the king crypto sank to as low as $26,410. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/18/220000000-in-bitcoin-ethereum-and-other-crypto-assets-liquidated-in-just-24-hours-as-markets-dip/\">$1,000,000,000 in Bitcoin, Ethereum and Crypto Assets Liquidated in Just 24 Hours As Markets Roil</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]