[
  {
    "source": "CoinDesk",
    "date": "2023-07-21T17:58:48.000Z",
    "title": "Federal Reserve’s ‘FedNow’ Launch Triggers Fresh Speculation Over Digital Dollar",
    "url": "https://www.coindesk.com/business/2023/07/21/federal-reserves-fednow-launch-triggers-fresh-speculation-over-digital-dollar/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Federal Reserve denies that its new instant payments service, FedNow, is in any way tied to the digital asset space. But experts say the new system could lay the groundwork for the infrastructure needed for a potential central bank digital currency (CBDC) in the U.S. And so this week’s announcement has led to a fresh airing of warnings about potential privacy and control risks around a digital dollar."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-21T17:59:08.000Z",
    "title": "OpenAI, Google, Microsoft Promise White House to Keep AI Safe",
    "url": "https://decrypt.co/149585/openai-google-microsoft-promise-white-house-keep-ai-safe",
    "description": "Industry leaders commit to safe, secure, and transparent development of artificial intelligence in agreement with the Biden administration."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T18:08:27.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices considering investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it brings. For ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T17:54:01.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-21T17:45:10.000Z",
    "title": "Polygon Proposes Upgrading MATIC; DigiToads Amazes Its Investors with Parabolic Presale Growth",
    "url": "https://nulltx.com/polygon-proposes-upgrading-matic-digitoads-amazes-its-investors-with-parabolic-presale-growth/",
    "description": "In the DeFi market, numerous cryptocurrencies possess outstanding qualities that can enhance investor profitability. Among these cryptocurrencies, Polygon (MATIC) stands out as one of the best DeFi cryptos, primarily due to its distinctive scalability feature. Recent developments have emerged regarding upgrading the MATIC token to further enhance its ecosystem. Simultaneously, a new crypto called DigiToads [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-21T18:00:57.000Z",
    "title": "Ethereum Daily Users Plunge Amid Declining Network Revenue",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-daily-users-plunge/",
    "description": "The second quarter of 2023 brought significant challenges for the Ethereum network as its revenue experienced a sharp decline. Ethereum network revenue plummeted from $1.27 billion to $847 million during Q2, representing a staggering 33.3% drop.  The network revenue for Ethereum encompasses all transaction fees paid by users to Ether validators, as well as the portion of charges that are removed from circulation through burning.  Given this, the decline in revenue reflects the decrease in overall activity on the platform, especially in the Decentralized Finance (DeFi) market, where developments have been far from welcoming. Related Reading: Terraform Labs Appoints New CEO Following Do Kwon’s Sentencing In Montenegro During Q2 2023, the DeFi market faced a lean period, characterized by a lack of significant growth and unfavorable events. Notably, hack incidents in the DeFi sector increased by a staggering 63% during the quarter, resulting in losses of $228 million across 79 hacks. This was confirmed by Arltduv, a Crypto Directory in a Twitter Post on July 20, 2023.  These incidents have had a negative impact on user confidence and contributed to the decline in the overall value locked (TVL) in DeFi protocols, with Ether-based protocols accounting for more than 90% of the total TVL. Ethereum&#8217;s Daily Active Addresses Decline In addition to the revenue decline, Ethereum&#8217;s daily active addresses experienced a notable drop of 6% during Q2 2023. The metric measures the number of unique wallet addresses that have conducted transactions on the Ether blockchain per day during the quarter. Despite the ongoing bear market, the decline in daily active addresses hasn&#8217;t worsened significantly, indicating a level of resilience in user activity. ETH price resting at $1,891 &#124; Source: ETHUSD on Tradingview.com Ethereum&#8217;s performance during the second quarter suggests that while it faced challenges in network revenue and daily user engagement, the platform remains a key player in the DeFi space. The continuous efforts to improve the network&#8217;s usability and scalability are crucial in attracting a broader user base, as demonstrated by Ethereum co-founder Vitalik Buterin&#8217;s recent proposal. ETH Still King Of DeFi Despite the decline in daily users and network revenue, Ethereum has managed to maintain its spot as the leading blockchain when it comes to DeFi activity. The network currently accounts for more than 50% of Total Value Locked (TVL) across all blockchains, establishing it as the leader in this regard. Related Reading: Ethereum Monthly Burn Surpasses 146,000 ETH As Total Clears $6.5 Billion Layer 2 blockchains such as Arbitrum and Polyon built atop the Ethereum network are also doing incredibly well. Arbitrum is currently sitting at $2.649 billion in TVL, with Polygon trailing behind at $1.044 billion in TVL. In terms of price, ETH is still closely following the performance of Bitcoin. The altcoin is trading at $1,892 at the time of this writing, with meager gains of 0.07% in the last day. Featured image from Yahoo Finance, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T17:57:33.000Z",
    "title": "Revolutionizing User-Node Interaction: A Breakthrough Solution for Mainstream Adoption of IOTA and Distributed Ledgers",
    "url": "https://www.crypto-news-flash.com/revolutionizing-user-node-interaction-a-breakthrough-solution-for-mainstream-adoption-of-iota-and-distributed-ledgers/?utm_source=rss&utm_medium=rss&utm_campaign=revolutionizing-user-node-interaction-a-breakthrough-solution-for-mainstream-adoption-of-iota-and-distributed-ledgers",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"IOTA MIOTA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-48x32.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />IOTA has continued to lead innovation in DLT space through research. The protocol is pushing to improve its Quality of Service (QoS) to drive adoption. IOTA recently issued a pioneering research paper addressing the usability of distributed ledgers and offering creative techniques to streamline user-node interaction. The evolution of blockchain technology has laid the foundation [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-21T18:05:42.000Z",
    "title": "Whales Move Over $640,000,000 in Bitcoin, Ethereum, Solana, Shiba Inu and Chainlink – Here’s the Destination",
    "url": "https://dailyhodl.com/2023/07/21/whales-move-over-640000000-in-bitcoin-ethereum-solana-shiba-inu-and-chainlink-heres-the-destination/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Whales-Accumulate-Over-690.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Whales-Accumulate-Over-690.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Whales-Accumulate-Over-690.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Whales-Accumulate-Over-690.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Whales-Accumulate-Over-690.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Whales-Accumulate-Over-690.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Whales-Accumulate-Over-690.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Deep-pocketed crypto investors are abruptly shifting hundreds of millions of dollars worth of digital assets, including the king crypto and the top altcoin. New data from whale-surveying platform Whale Alert reveals that one high-net-worth trader suddenly moved 14,159 Bitcoin (BTC) worth a staggering $421.7 million from one unknown wallet to another. Further activity centered around [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/21/whales-move-over-640000000-in-bitcoin-ethereum-solana-shiba-inu-and-chainlink-heres-the-destination/\">Whales Move Over $640,000,000 in Bitcoin, Ethereum, Solana, Shiba Inu and Chainlink – Here’s the Destination</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]