[
  {
    "source": "CryptoGlobe",
    "date": "2023-09-28T22:48:00.000Z",
    "title": "MakerDAO ($MKR) Price Reaches 16-Month high After Surging Nearly 200% Year-to-Date",
    "url": "https://www.cryptoglobe.com/latest/2023/09/makerdao-mkr-price-reaches-16-month-high-after-surging-nearly-200-year-to-date/",
    "description": "The price of MakerDAO’s native token $MKR has been bucking the bearish trend in the cryptocurrency space, having surged nearly 200% so far this year to now trade at a 16-month high above $1,500 per token. According to available market data, the cryptocurrency started the year trading at around $500 after falling from an all-time […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-28T23:00:43.000Z",
    "title": "What Is Behind The 16% PEPE Price Recovery And Will It Continue?",
    "url": "https://www.newsbtc.com/analysis/pepe/16-pepe-price-recovery/",
    "description": "Over the last week, the PEPE price has emerged as one of the best performers in the crypto market. This followed a long period of drawdown that dragged the meme coin’s price almost 90% below its June 2023 all-time high. This prolonged bear period coupled with its declining momentum is why the price reversal has caught the market by surprise. Social Discussions Around PEPE Rise To figure out why the PEPE price has been on a rally at a time when the broader crypto market has suffered declines, let’s take a look at the social discussions around the token. In particular, a report from on-chain tracker Santiment shows the social media discussion trends of top meme coins. Related Reading: Factors That Suggest A Recovery For The ADA Price Santiment’s report which was shared on X (formerly Twitter) points out that meme coins have not really been on the radar of traders, except for PEPE. As the chart shows, discussions around the PEPE meme token saw an uptick this week. PEPE sees uptick in discussions &#124; Source: Santiment on X It is the only meme coin whose social media discussions rose during the week with the likes of Dogecoin seeing their own metrics drop to 3-year lows. This uptick could present the reason behind the PEPE price recovery this week. Usually, when investors start getting interested in a coin, they will often talk about it on social media platforms. Depending on whether investors are collectively bullish or bearish, it can cause a swing in the price toward either direction. In this case, the uptick in discussions coincides with the rise in price, suggesting a higher level of bullishness. PEPE Price Rises 16% In One Week PEPE’s double-digit surge this week saw the altcoin hit a local peak of $0.00000075 on Wednesday, resulting in one of its highest levels in September 2023. This rally has since lost momentum but the meme coin continues to maintain a good chunk of its gains. Related Reading: Ethereum Open Interest Barrels Past $5.2 Billion, Is It Time To Buy? The PEPE price is up more than 16% on the weekly chart and enjoying a 92% surge in its daily trading volume over the last 24 hours. This increase in trading volume also shines a light on the rising investor interest, which could suggest a continuation of the rally once the correction finds a bottom. However, with most of the crypto market still deeply in the throes of the bear market, it’s unlikely that the rally would be able to continue for too long, presenting a hindrance. If the coin fails to establish support above $0.00000071, then all of this week’s gains could be wiped out by the time the weekend is over. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Watcher Guru, chart from TradingView.com"
  }
]