[
  {
    "source": "Cointelegraph",
    "date": "2023-11-26T06:46:06.000Z",
    "title": "California governor calls for statewide generative AI training",
    "url": "http://cointelegraph.com/news/california-governor-gavin-newsom-gen-ai",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/4ef675d2-d8cb-4fab-bb22-55911892ef78.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In a recent report, California Governor Gavin Newsom emphasized the significance of preparing for the next generation of skills essential to thrive in the GenAI economy.</p>\n                    <p><p>California Governor Gavin Newsom has stressed the importance of people staying ahead of the curve in generative artificial intelligence (GenAI) by acquiring new skills and becoming acquainted with the emerging technology.</p><p>As outlined in the <a href=\"https://www.gov.ca.gov/2023/11/21/newsom-administration-releases-genai-report/\" target=\"_blank\" rel=\"noopener nofollow\">report</a>, there is a suggestion that residents of California should have access to educational and training opportunities in GenAI, noting:</p><blockquote>\"To support California’s state government workforce and prepare for the next generation of skills needed to thrive in the GenAI economy, agencies will provide trainings for state government workers to use state-approved GenAI to achieve equitable outcomes.”</blockquote><p>It stated that this is considered essential in response to the notable employment impact indicated by recent reports on GenAI.</p><p>The report cited Goldman Sachs' forecast, indicating that GenAI is expected to affect 300 million jobs worldwide, despite the potential productivity gains expected to be achieved. </p><p>“As such, the State must lead in training and supporting workers, allowing them to participate in the AI economy and creating the demand for businesses to locate and hire here in California,” it noted.</p><p>It further stated that GenAI <a href=\"https://cointelegraph.com/news/limited-generative-ai-usage-allowed-in-japanese-schools\">education initiatives</a> should commence at higher education institutions and vocational schools. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ibm-launches-500-million-fund-develop-generative-ai-enterprise\">IBM launches $500M fund to develop generative AI for enterprise</a></em></strong></p><p>There have been several reports in recent times on AI’s potential impact on jobs in the worldwide economy.</p><p>On July 12, The Organisation for Economic Co-operation and Development (OECD) released a report outlining the jobs most at risk of AI. </p><p>The research goes on to label “high-skill, white collar jobs” as the <a href=\"https://cointelegraph.com/news/high-skilled-jobs-most-exposed-to-ai\">most exposed</a> to AI.</p><p>Furthermore, the areas showing the most progress are those areas requiring “non-routine, cognitive tasks such as information ordering, memorization, and perceptual speed.”</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/train-kickass-ai-model-sell-nfts-llms-are-largely-lying-machines-ai-eye/\">Train AI models to sell as NFTs, LLMs are Large Lying Machines: AI Eye</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]