[
  {
    "source": "CoinDesk",
    "date": "2023-05-31T15:00:17.000Z",
    "title": "USDT Issuer Tether Ventures Into Payment Processing With Georgia Investment",
    "url": "https://www.coindesk.com/business/2023/05/31/usdt-issuer-tether-ventures-into-payment-processing-with-georgia-investment/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The stablecoin issuer announced earlier this week it is investing in a sustainable bitcoin mining facility in Uruguay."
  },
  {
    "source": "Decrypt",
    "date": "2023-05-31T14:55:00.000Z",
    "title": "NVIDIA's AI Push Could Change Gaming Forever",
    "url": "https://decrypt.co/videos/interviews/79ArMuzj/nvidias-ai-push-could-change-gaming-forever",
    "description": "Computer tech firm NVIDIA profited off the crypto mining industry. Now, it's looking to artificial intelligence—and its stock price is soaring."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-31T14:48:25.000Z",
    "title": "Bitcoin hodlers exited 'capitulation' above $20K, new metric hints",
    "url": "https://cointelegraph.com/news/bitcoin-hodlers-exited-capitulation-above-20k-new-metric-hints",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/af67013d-ae8f-4940-a730-4daed2cb50bb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Long-term holder spending is \"seeking equilibrium,\" Glassnode suggests — but nothing will be quiet for long.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is in a “transition,\" which should pave the way to the next bull market top, new research has concluded.</p><p>In the latest edition of its weekly newsletter, “<a href=\"https://insights.glassnode.com/the-week-onchain-week-22-2023/\" target=\"_blank\" rel=\"noopener nofollow\">The Week On-Chain</a>,” analytics firm Glassnode unveiled its latest tool for tracking Bitcoin’s resurgence.</p><h2>Bitcoin hodlers in \"transition\"</h2><p>After the 2022 bear market and signs of recovery in Q1 this year, on-chain metrics have undergone a <a href=\"https://cointelegraph.com/news/one-of-the-greatest-bitcoin-metrics-says-btc-price-bull-run-is-here\">broad transformation</a>, many suggesting that a long-term BTC price bottom is already in.</p><p>With price action stagnating since mid-March, however, doubts have returned — along with downside targets which <a href=\"https://cointelegraph.com/news/bitcoin-losing-its-200-week-trendline-puts-20k-in-play-btc-price-analysis\">stretch toward $20,000</a>.</p><p>For Glassnode analysts, however, Bitcoin’s long-term investor base is already preparing for better times ahead.</p><p>Using existing on-chain tools, analysts unveiled a new way of tracking sentiment among these long-term holders (LTHs) — those hodling BTC for at least 155 days.</p><p>The tool, “Long Term Holder Spending &amp; Profitability,” splits LTH behavior patterns into four phases.</p><p>After a period of “capitulation” at the end of 2022, LTHs have begun a “transition” toward a state of “equilibrium” before full “euphoria” — the next BTC price cycle top — hits.</p><p>Capitulation is defined as a situation in which “Spot price is lower than the LTH cost basis,” Glassnode explains, with significant LTH spending thus “likely due to financial pressure and capitulation.”</p><p>Transition, meanwhile, is when the “Market is trading slightly above the long-term holders cost basis, and occasional light spending is part of day-to-day trade.”</p><p>The LTH cost basis, as of May 30, lies at around $20,800, separate data shows.</p><p>“Our current market has recently reached the Transition phase, flagging a local uptick in LTH spending this week,” “The Week On-Chain” commented. </p><blockquote>“Depending on what direction volatility erupts next, we can employ this tool to locate local periods of overheated conditions, as observed from the lens of Long-Term Holders.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/dbf0f19c-1017-4faa-8229-659219bc7b4e.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Long Term Holder Spending &amp; Profitability chart (screenshot). Source: Glassnode</em></figcaption></figure><h2>\"Seeking equilibrium\" — but for how long?</h2><p>Complementing LTHs, Bitcoin’s short-term holder (STH) cohort, which corresponds to more speculative investors, is already on the radar.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-risks-new-lows-into-monthly-close-as-btc-price-retests-27k\">Bitcoin risks ‘new lows’ into monthly close as BTC price retests $27K</a></em></strong></p><p>Speculative activity has increased in 2023, Glassnode <a href=\"https://cointelegraph.com/news/bitcoin-reaches-decision-point-4-btc-price-metrics-to-watch\">previously stated</a>, making their cost basis — at around $26,000 — an increasingly important level.</p><p>Overall, however, BTC/USD remains in a narrow range, having acted within a $5,000 corridor for almost three months, data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.142027444.742658523.1640948929-762064149.1640948929\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> shows.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/a327b336-f61d-434e-99dd-63d3b979cc34.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day candle chart on Bitstamp. Source: TradingView</em></figcaption></figure><p>“The digital asset market continues to outperform major commodities in 2023, however all are currently experiencing a meaningful correction. Having recovered from the depths of the 2022 bear market, Bitcoin investors find themselves in a form of equilibrium, with little gravity in either direction,” the newsletter summarized. </p><blockquote>“Given the extremely low volatility, and narrow trading ranges of late, it seems this equilibrium is soon to be disturbed.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/fca4a56a-890e-4857-9e79-4fe4f5954120.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin LTH, STH cost basis comparison chart. Source: Glassnode</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ai-eye-traders-chatgpt-stock-picks-ai-dice-adobe-firefly/\">AI Eye: 25K traders bet on ChatGPT’s stock picks, AI sucks at dice throws, and more</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2023-05-31T15:00:14.000Z",
    "title": "Investors looking for reliable assets like Ripple or Avorak AI amid Hotbit closure",
    "url": "https://nulltx.com/investors-looking-for-reliable-assets-like-ripple-or-avorak-ai-amid-hotbit-closure/",
    "description": "The Hotbit shutdown has left many investors in a state of uncertainty and are searching for safe havens for their investments after the troubled exchange urged investors to withdraw. Among the crypto assets investors turn to are Ripple (XRP) and Avorak AI (AVRK), which have proven to be steady performers in the recent market turbulence. [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T15:02:06.000Z",
    "title": "Binance won’t support privacy tokens in Poland, France, and Italy",
    "url": "https://crypto.news/binance-wont-support-privacy-tokens-in-poland-france-and-italy/",
    "description": "Crypto exchange giant Binance said that users in Poland, France, and Italy will no longer be able to trade privacy tokens on its platforms."
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-31T15:05:26.000Z",
    "title": "Indian Banks Urged To Embrace AI And Blockchain For Future Readiness",
    "url": "https://www.newsbtc.com/crypto/indian-banks-urged-to-embrace-ai-and-blockchain-for-future-readiness/",
    "description": "The Reserve Bank of India (RBI) recently organized a conference exclusively for directors of Indian banks, shedding light on the importance of adopting technologies like Blockchain and AI. During the event, RBI Deputy Governor Mahesh Kumar Jain took center stage, urging the bank directors to embrace technologies such as Artificial Intelligence (AI) and Blockchain. Related Reading: Pepecoin Eyes Rebound As It Finds Support In Strong Algorithm Data Score Jain believes that Indian banks can unlock new avenues for growth and enhanced stability in the ever-evolving financial landscape by harnessing the power of innovative technologies.  The conference aimed to encourage the integration of these technologies to propel sustainable progress and future-proof the banking industry in India. SBI Governor Addresses The Potential Risks During his speech, Deputy Governor Mahesh Kumar Jain evaluated the risks involved in sustainable growth. He further discussed the importance of effective corporate governance, governance structure, and how to prepare for potential risk.  According to Jain, banks face a series of challenges arising from technological disruption, customer expectations, and cyber threats in today&#8217;s ever-changing environment. These factors introduce new risks across technology, business, and operations.  As such, the deputy Governor advised banks to prioritize technology adoption to tackle these challenges effectively. Jain further emphasized the importance of technological integration, highlighting it as a key strategy to ensure sustainable growth in the banking sector and mitigate risks.  In his words, &#8220;To prepare for the future,&#8221; banks need &#8220;adopt innovative technologies such as Blockchain and AI,” also investing in cybersecurity measures. India Embraces Blockchain Innovation The Reserve Bank of India (RBI) initiated pilot trials for the digital rupee, targeting improved cross-border payments and mitigated arbitrage losses.  RBI&#8217;s Central Bank Digital Currency (CBDC) experiments aim to enhance efficiency and foster secure transactions in retail and wholesale sectors. The India Finance Minister, Nirmala Sitharaman, recently said India is not against blockchain technology, but crypto needs monitoring. She further claims that blockchain gives too many options and can be utilized in many different ways. SItharaman believes the central bank must drive crypto; otherwise, it can fall like those without proper government backing, causing huge spillover effects like FTX. She highlights the limitations of individual countries&#8217; actions in regulating crypto assets, stating that the interconnectedness of the global order renders such measures ineffective. Related Reading: Floki Inu: Does Meme Coin Have What It Takes To Re-Enter Top 100 Spot? As technology transcends boundaries, she emphasizes the need for coordinated efforts in addressing the challenges posed by cryptocurrencies, surpassing geographical borders. India takes a stringent stance on crypto trading, disallowing traders from offsetting losses against gains.  Notably, Sitharaman imposed a 30% flat tax on crypto income last year and a 1% tax deducted at source (TDS) on crypto trades above 10,000 Indian rupees ($122). Also, there are severe penalties, including penalties equal to TDS for non-deduction and 15% annual interest charges for late payments. Moreover, imprisonment for up to six months is possible, demonstrating a strong regulatory approach. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-31T14:43:39.000Z",
    "title": "U.S.A. TikTok Ban: What is the Potential Impact on Crypto and Finance Influencers?",
    "url": "https://www.newsbtc.com/research/usa-tiktok-ban-impact-on-crypto-and-finance-influencers/",
    "description": "TikTok has been in the news recently as the U.S. wants to ban the app over fears of the Chinese government using it for surveillance, with Montana being the first state to officially ban the app. With 150 million Americans using TikTok, a blanket ban of the app could have a large impact on people’s livelihoods, especially those who rely TikTok for income. At NewsBTC we wanted to analyze some of the biggest crypto and financial influencers on the platform to find out what they could potentially lose if TikTok is banned in the U.S.A. TikTok Financial Influencers Potential Monthly Loss From our seed list the financial influencer who could have the biggest loss in earnings is Tori Dunlap or @herfirst100k on TikTok. Dunlap has 2.2 million followers on TikTok and we estimate she could lose over $600k a month if TikTok is banned. Another influencer who could see a massive loss in earnings is Vivian Tu or @yourrichbff on TikTok. With 2.4 million followers Tu is estimated to have a potential earning loss of almost $160k a month. Mark Tilbury &#8211; @marktilbury – is also set to lose a massive $108k a month if TikTok is banned. TikTok Crypto Influencers Potential Monthly Loss From our list of crypto influencers the influencer who could have the biggest loss in earnings is Mason Verslius @cryptomasun on TikTok. According to our research he could lose over $61k a month if a ban is put in place. The crypto influencer who could face the second largest loss in earnings is @cryptowendyo, who could lose just under $60k a month. Lucas Dimos &#8211; @theblockchainboy – is third on our list with a potential monthly loss of over $31k. TikTok Financial Influencers Total Earnings Estimated earnings are based on the number of videos an influencer posts and their engagement rate. Therefore, for some of the larger influencers analyzed, the TikTok ban is estimated to have less impact. For example, Erika Kaulberg &#8211; @erikakullberg – has 9.2 million followers but is 6th on our list for total earnings at $1.09 million and estimated to lose $45k a month. TikTok Crypto Influencer Total Earnings From our list of crypto influencers @cryptoprojects has the biggest following of 1.4 million with estimated total earnings of $106k putting him at 7th on our list of top earners. Just above @cryptoprojects is @nft.degen, the second largest crypto influencer on our list with 1.3 million followers. His estimated total earnings are just $124k, making his estimated monthly earning loss $5.6k. Methodology NewsBTC analyzed the biggest Finance and Crypto influencers on TikTok to find out what their potential monthly loss of earnings could be if TikTok is banned in the U.S.A. A list of the top 50 influencers was collated by merging a list of &#8216;best crypto currency influencers&#8217; from the top Google results. NewsBTC did this by calculating what the estimated total earnings are for top crypto and financial influencers, and dividing that by the number of months they had been active on the platform. Total earnings were calculated using the TikTok Money Calculator on Influencer Marketing Hub which takes the number of videos and engagement rate into account when providing earning estimations."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T14:42:36.000Z",
    "title": "Polygon Hits New All-Time High with Millions in Assets, Lower Fees, and Rapidly Growing User Base",
    "url": "https://www.crypto-news-flash.com/polygon-hits-new-all-time-high-with-millions-in-assets-lower-fees-and-rapidly-growing-user-base/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-hits-new-all-time-high-with-millions-in-assets-lower-fees-and-rapidly-growing-user-base",
    "description": "<p>On May 25, the single-day transaction volumes for Polygon&#8217;s zkEVM Mainnet Beta touched an all-time high of 25k. The Polygon zkEVM Mainnet Beta stands out as one of the cheapest Layer-2 roll-ups, offering reduced fees through gas optimizations and increased network activity. Ethereum&#8217;s Layer-2 scalability solution Polygon continues to be at the forefront of new [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/polygon-hits-new-all-time-high-with-millions-in-assets-lower-fees-and-rapidly-growing-user-base/\">Polygon Hits New All-Time High with Millions in Assets, Lower Fees, and Rapidly Growing User Base</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-31T15:00:00.000Z",
    "title": "2,383 Cryptocurrencies Fail, But a New Era Dawns in the Crypto Industry",
    "url": "https://coinedition.com/2383-cryptocurrencies-fail-but-a-new-era-dawns-in-the-crypto-industry/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Heres-How-Many-Crypto-Coins-Failed-Last-Year-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Heres-How-Many-Crypto-Coins-Failed-Last-Year-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Heres-How-Many-Crypto-Coins-Failed-Last-Year-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Heres-How-Many-Crypto-Coins-Failed-Last-Year-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Heres-How-Many-Crypto-Coins-Failed-Last-Year-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Heres-How-Many-Crypto-Coins-Failed-Last-Year-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Heres-How-Many-Crypto-Coins-Failed-Last-Year.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Coin Kickoff, as cited by a report from The Ascent, a Motley Fool service, revealed that from 2013 to 2022, 2,383 cryptocurrency coins experienced failure. The average lifespan of these projects was a mere 15 months, highlighting the challenges faced by many early ventures in the industry. However, a closer look at the numbers reveals [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/2383-cryptocurrencies-fail-but-a-new-era-dawns-in-the-crypto-industry/\">2,383 Cryptocurrencies Fail, But a New Era Dawns in the Crypto Industry</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-31T14:49:50.000Z",
    "title": "Simplifying Exchange: The Transparent and Convenient Approach of BestChange",
    "url": "https://coinedition.com/simplifying-exchange-the-transparent-and-convenient-approach-of-bestchange/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Simplifying_Exchange_The_Transparent_and_Convenient_Approach_of-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Simplifying_Exchange\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Simplifying_Exchange_The_Transparent_and_Convenient_Approach_of-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Simplifying_Exchange_The_Transparent_and_Convenient_Approach_of-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Simplifying_Exchange_The_Transparent_and_Convenient_Approach_of-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Simplifying_Exchange_The_Transparent_and_Convenient_Approach_of-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Simplifying_Exchange_The_Transparent_and_Convenient_Approach_of-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Simplifying_Exchange_The_Transparent_and_Convenient_Approach_of.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Introduction In a world where financial efficacy is paramount, securing the most advantageous currency conversion rates is vital. Favorable exchange rates play a crucial role in the global economy, whether for investors, travelers, or businesses seeking expansion. Even minute rate fluctuations can substantially impact financial goals, travel plans, and business outcomes. However, the complexities of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/simplifying-exchange-the-transparent-and-convenient-approach-of-bestchange/\">Simplifying Exchange: The Transparent and Convenient Approach of BestChange</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]