[
  {
    "source": "Decrypt",
    "date": "2023-09-18T22:47:23.000Z",
    "title": "How ‘Spiderchain’ Plans to Build Ethereum on Bitcoin",
    "url": "https://decrypt.co/197687/how-spiderchain-plans-to-build-ethereum-on-bitcoin",
    "description": "Following weeks of debate about Bitcoin drivechains, a similar project to unlock the network’s programming potential is picking up steam."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T23:02:43.000Z",
    "title": "SEC commissioner Hester Peirce calls for clarity in crypto regulation",
    "url": "https://www.cryptopolitan.com/sec-hester-peirce-on-crypto-regulation/",
    "description": "Hester Peirce, one of the commissioners at the United States Securities and Exchange Commission (SEC) known for her support of cryptocurrencies, has voiced her concerns over the lack of regulatory clarity in the digital asset space. Peirce&#8217;s comments highlight the growing need for a clear and comprehensive regulatory framework for cryptocurrencies in the United States. ... <a title=\"SEC commissioner Hester Peirce calls for clarity in crypto regulation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-hester-peirce-on-crypto-regulation/\" aria-label=\"More on SEC commissioner Hester Peirce calls for clarity in crypto regulation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T22:54:52.000Z",
    "title": "9 US Senators rally behind ‘Digital Asset Anti-Money Laundering Act’",
    "url": "https://www.cryptopolitan.com/us-senators-behind-anti-money-laundering-act/",
    "description": "In a significant display of bipartisan support, nine United States Senators have thrown their weight behind Senator Elizabeth Warren&#8217;s Digital Asset Anti-Money Laundering Act. This move is poised to bolster the legislative push to regulate and combat illicit activities within the cryptocurrency space. Bipartisan support grows Senator Elizabeth Warren&#8217;s initiative has gained backing from prominent ... <a title=\"9 US Senators rally behind ‘Digital Asset Anti-Money Laundering Act’\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-senators-behind-anti-money-laundering-act/\" aria-label=\"More on 9 US Senators rally behind ‘Digital Asset Anti-Money Laundering Act’\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T22:53:49.000Z",
    "title": "Blockchain Capital raises $580 million for a new era in crypto investments",
    "url": "https://www.cryptopolitan.com/blockchain-capital-raises-580-million-for-crypto-investments/",
    "description": "Despite the ongoing crypto bear market, Blockchain Capital has successfully closed two new venture funds amounting to $580 million, marking a significant milestone in the venture capital landscape for blockchain and cryptocurrency. Blockchain Capital&#8217;s general partner, Spencer Bogart, revealed that the two funds would be allocated in a two-thirds to one-third ratio. The larger portion ... <a title=\"Blockchain Capital raises $580 million for a new era in crypto investments\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockchain-capital-raises-580-million-for-crypto-investments/\" aria-label=\"More on Blockchain Capital raises $580 million for a new era in crypto investments\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T22:46:44.000Z",
    "title": "SEC raises concern over Ceffu’s involvement with Binance ",
    "url": "https://www.cryptopolitan.com/sec-raises-concern-over-ceffu-and-binance/",
    "description": "The United States Securities and Exchange Commission (SEC) has filed a motion at a District of Columbia court to allow the inspection of Binance.US. The ground of this motion was that the organization has failed to disclose documents needed in another suit between both parties. Earlier this year, the SEC sued Binance Holdings, the company ... <a title=\"SEC raises concern over Ceffu’s involvement with Binance \" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-raises-concern-over-ceffu-and-binance/\" aria-label=\"More on SEC raises concern over Ceffu’s involvement with Binance \">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-18T23:00:08.000Z",
    "title": "How Much Will Dogecoin Trade At If It Attains The Market Cap Of Bitcoin Or Ethereum?",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-bitcoin-ethereum/",
    "description": "Comparisons in the crypto market are not out of the norm, especially given the fierce rivalry that goes on between two or more tokens at a time. So this report will take a look at where the price of Dogecoin will realistically be if the meme coin’s market cap were to reach the current market cap of Bitcoin or Ethereum. Dogecoin With The Market Cap Of Bitcoin Bitcoin, the world’s largest cryptocurrency, has a market cap of $521 billion. This is over 2x the market cap of the second-largest cryptocurrency Ethereum, and makes up around half of the total crypto market cap. While this is interesting, a more interesting fact is where the price of Dogecoin would be if it were to reach the market cap of Bitcoin. Related Reading: Ethereum Surges Ahead Of Bitcoin In Active Addresses, What Does This Mean? CoinGecko’s Coin Comparison feature allows users to input two different cryptocurrencies and show how much one would trade for if they had the market cap of the others. Using this feature, NewsBTC has been able to determine how much a single DOGE token would be at a market cap of $521 billion. DOGE would trade at $3.70 with Bitcoin's market cap &#124; Source: CoinGecko A single DOGE token at such a market cap comes out to $3.70 per token, an over 59x (5,900%) increase from its current price. Inversely, Bitcoin at the $8.8 billion market cap of Dogecoin would put each BTC at a price of $448. Where Will DOGE Trade With Ethereum’s Market Cap Ethereum is currently the second-largest cryptocurrency in the space with a market cap of $196 billion. With this market cap, the price of Ethereum’s nice ETH token is sitting at $1,635 with a circulating supply of 120,225,429 ETH. Now, using CoinGecko’s Coin Comparison feature and checking the price of where Dogecoin would be if it reaches the $196 billion market cap of Ethereum, it comes out to a $1.39 price point for the meme coin. DOGE would trade at $1.39 with Bitcoin's market cap &#124; Source: CoinGecko From its current price of $0.06192, it comes out to a 22x or 2,200% move. On the flip side, Ethereum falling to the market cap of DOGE at $8.8 billion would see the digital asset’s price trade at just $72.53, a long way from its present value. Related Reading: Litecoin Eliminates Pre-Halving Gains As Volume Drops, Is A Fall To $50 Coming? The price differences between the cryptocurrencies mentioned at the same market cap come down to their circulating supply. Dogecoin has a circulating supply of over 141 billion DOGE compared to 19.48 million BTC for Bitcoin and 120 million ETH for Ethereum. DOGE price at $0.06 with $8.8 billion market cap &#124; Source: DOGEUSD on Tradingview.com Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from CoinMarketCap, chart from TradingView.com"
  }
]