[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T21:39:40.000Z",
    "title": "Worldcoin Price Prediction 2023 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, ... <a title=\"Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldcoin-price-prediction/\" aria-label=\"More on Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-07T21:54:32.000Z",
    "title": "NFT theft decreased 20% in July: report",
    "url": "https://crypto.news/nft-theft-decreased-20-in-july-report/",
    "description": "NFT thefts drop by 31%, totaling $1.73M in July ahead of a sales decline, reflecting a struggling NFT market. This comes as the FBI also issued a vigilance alert against rising NFT fraud."
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-07T22:00:35.000Z",
    "title": "TRON’s Justin Sun’s Reassures Crypto Community That Huobi Exchange Is Solvent",
    "url": "https://www.newsbtc.com/huobi-ht/justin-sun-huobi-exchange-is-solvent/",
    "description": "In a recent development, Justin Sun, founder of popular blockchain Tron, has urged people to disregard speculations that the crypto exchange Huobi is facing severe challenges following news of the alleged detention of some of the platform&#8217;s officials.  The rumors appear to be a major contributing factor to why the firm experienced multi-million withdrawals during the weekend, while Tron’s Total Value Locked (TVL) has fallen below $2.5 billion.  Trouble In Paradise? Over the past weekend, cryptocurrency exchange Huobi experienced massive outflows worth about $64 million amid reports that Chinese authorities were investigating its executives and the likelihood of insolvency. There were speculations that the platform’s leaders were arrested on the 5th of August in China. According to popular Chinese reporter Colin Wu, the arrest was due to Huobi’s involvement with gambling websites. One top official of the exchange also recently left the company, though it remains unclear if that was connected to the ongoing investigations by Chinese authorities. Related Reading: XRP Whales Trigger Price Decline With Large Selling A third of the $64 million is believed to be made up of Bitcoin (BTC), while Tron’s native token (TRX) and Huobi Token (HT) follow respectively at 26.5% and 20.3%. The rumors were so rife that the withdrawals triggered serious volatility in HT’s price and the token fluctuated during the weekend before settling at its present level of about $2.66. Furthermore, there are also rumors that the exchange is undergoing protracted financial challenges. According to Adam Cochran, an angel investor and fintech executive, there are some discrepancies in the platform’s Tether (USDT) holding.  Based on on-chain data, Huobi held less than $90 million of assets on the 5th of August. However, their recent “Merkle Tree Audit” claims they hold $630 million in USDT.  Cochran believes this means that Huobi might be insolvent, implying the platform may not have sufficient funds to meet its obligations. HT price sitting at $2.6 &#124; Source: HTUSD on Tradingview.com Huobi Reacts To Speculations In response to the speculations, Justin Sun, who serves as an Advisor to the exchange, recently took to his Twitter account to offer some clarifications. In a series of tweets, he asked users to “ignore FUD, keep! #TRON  and Huobi will thrive through continuous development. Trust in our vision and community efforts for a stronger future. Perseverance guarantees success!” Related Reading: Curve Finance Announces $1.85 Million Bounty For Stable Pool Exploiter Many users simply responded by posting the figure “4” below his tweet. The figure, which was popularized in the crypto space by Changpeng ‘CZ’ Zhao, Binance CEO, simply means “Ignore FUD, fake news, attacks, etc.”  This is not the first time Sun and his team are facing serious troubles. In the past, there have been rumors of financial troubles at the exchange. However, it remains to be seen what the likely fallout would be in the most recent event. Featured image from Coinpedia, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-07T22:06:00.000Z",
    "title": "Crypto Supporters in Czech Republic Rise; Garners Visit from Buterin",
    "url": "https://coinedition.com/crypto-supporters-in-czech-republic-rise-garners-visit-from-buterin/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/10.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Crypto Supporters in Czech Republic Rise; Garners Visit from Buterin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/10.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/10-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/10-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/10-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/10-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A young group of crypto enthusiasts is raising awareness about DeFi and crypto in the Czech Republic. “We’re here to support the ecosystem and are open to collaborating with anyone whose ethos aligns with ours,” said one of the members. Interestingly, there are others including royals that are interested in growing the crypto space in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-supporters-in-czech-republic-rise-garners-visit-from-buterin/\">Crypto Supporters in Czech Republic Rise; Garners Visit from Buterin</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-07T22:01:22.000Z",
    "title": "Ethereum Rival Solana Catches Eye of Big Players As Institutions Take Bitcoin Profits: CoinShares",
    "url": "https://dailyhodl.com/2023/08/07/ethereum-rival-solana-catches-eye-of-big-players-as-institutions-take-bitcoin-profits-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/solana-creator-end-goal.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/solana-creator-end-goal.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/solana-creator-end-goal.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/solana-creator-end-goal.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/solana-creator-end-goal.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/solana-creator-end-goal.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/solana-creator-end-goal.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says institutional investors are becoming more optimistic about the Ethereum (ETH) competitor Solana (SOL) while they collect profits on king crypto Bitcoin (BTC). In its latest Digital Asset Fund Flows Weekly Report, CoinShares finds that digital assets saw outflows of over $100 million last week, marking the third week of outflows in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/07/ethereum-rival-solana-catches-eye-of-big-players-as-institutions-take-bitcoin-profits-coinshares/\">Ethereum Rival Solana Catches Eye of Big Players As Institutions Take Bitcoin Profits: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]