[
  {
    "source": "Decrypt",
    "date": "2023-07-04T17:47:08.000Z",
    "title": "ChatGPT Users Abused Web Browsing Feature So OpenAI Has Turned It Off",
    "url": "https://decrypt.co/147300/openai-disables-web-browse-bing-chatgpt",
    "description": "This is why we can’t have nice things."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-04T18:00:49.000Z",
    "title": "Cardano (ADA) Price Analysis Report – 4 July 2023",
    "url": "https://www.cryptoglobe.com/latest/2023/07/cardano-ada-price-analysis-report-4-july-2023/",
    "description": "Introduction This report provides a comprehensive analysis of Cardano (ADA) for 4 July 2023. The data includes real-time price, volume, bid/ask, day’s range, technical indicators, and moving averages. Price and Volume Overview As of 5:29:14 p.m. UTC on 4 July 2023, Cardano is trading at $0.2929, down by $0.0013 (-0.44%) from its previous close. The […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-04T18:08:59.000Z",
    "title": "UN and FATF try to get crypto travel rule implemented worldwide",
    "url": "https://cryptodaily.co.uk/2023/07/un-and-fatf-try-to-get-crypto-travel-rule-implemented-worldwide",
    "description": "<p>According to a recent report by the FATF, more than half of all UN member countries have still not implemented the Travel Rule.</p>\n<p>As of June 2023, as reported by the FATF, more than half of the UN member countries have failed to enforce the Travel Rule. According to the Financial Action Task Force, the rule is necessary in order to close a loophole in crypto assets that might be exploited by money launderers and those funding terrorism.</p>\n<p>According to an article in the Business Times Online, the Travel Rule is recommendation #16 of the Financial Action Task Force (FATF) which lays down that all crypto companies must &ldquo;screen, record and communicate the information of all users of their platform&rdquo;.</p>\n<p>This would have the effect of destroying any anonymity for crypto users, with the exception of those who are transacting in amounts less than $1,000.</p>\nWhat is the FATF?\n<p>The FATF is a 39-member body that gives financial recommendations to all UN nations. Given that it is an unelected body, financial decisions in each country are the responsibility of that country and the recommendations can be implemented or not by each country.</p>\n<p>However, should any country choose not to implement all of the recommendations then it comes under &ldquo;increased monitoring&rdquo; of its financial activities.</p>\nAML and terrorist financing\n<p>According to the FATF, at the heart of all the recommendations are a desire to root out any money laundering or terrorist financing that might be taking place in a country&rsquo;s financial system. This purportedly gives it the right and full authority to investigate how money is dealt with everywhere in the world.</p>\n<p>The FATF is of the opinion that crypto assets can be used for the aforementioned illegal activities and therefore wants all countries to enforce the Travel Rule in order to negate any of these activities.</p>\nMany jurisdictions ignore recommendations\n<p>The fact that nearly three quarters of jurisdictions across the world have complied only partially or not at all with the FATF recommendations perhaps says much for a feeling that this non-elected agency is maybe interfering too much in the financial affairs of sovereign countries.</p>\n<p>Also, given that the FATF is closely associated with the IMF and the World Bank, it might be seen as having a more &lsquo;Western&rsquo; bias that may not be as acceptable to certain jurisdictions across the world.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T17:58:31.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T17:48:01.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-04T17:58:12.000Z",
    "title": "Bitcoin cash (BCH) surges 166.3% over past 2 weeks",
    "url": "https://crypto.news/bitcoin-cash-bch-surges-166-3-over-past-2-weeks/",
    "description": "Bitcoin cash (BCH), a cryptocurrency that originated as a fork of bitcoin, aims to enhance transaction efficiency for both individuals and businesses, and it has remained a prominent player in the top 50 cryptocurrencies based on market capitalization."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-04T18:00:14.000Z",
    "title": "TRX Bulls Charge Ahead As Tron Network Prepares For Major Upgrade",
    "url": "https://www.newsbtc.com/analysis/trx/trx-bulls-charge-ahead-as-tron-network-prepares-for-major-upgrade/",
    "description": "The Tron (TRX) Network is set to undergo a major upgrade on July 11th, and TRX and other key metrics have seen a steady uptrend as the upgrade approaches. The upcoming Periander upgrade brings significant enhancements to the Tron Network, while TRX experiences a surge in on-chain metrics. Tron Network&#8217;s latest update, Great Voyage—v4.7.2 (Periander), introduces four critical upgrades aimed at enhancing the functionality and usability of the network. These upgrades include an advanced Stake 2.0 mechanism, seamless compatibility with Ethereum&#8217;s EIP-3855, streamlined smart contract interface calling, and a revamped P2P network module. Tron&#8217;s Periander Upgrade The new Stake 2.0 mechanism offers users greater flexibility in staking and unstaking their resources, with the ability to customize lockup periods for delegated resources according to their individual needs.  The compatibility with Ethereum&#8217;s EIP-3855 promotes interoperability between the two ecosystems, attracting more developers to TRON and reducing migration costs for projects across both chains.  Related Reading: XRP, Cardano Among Altcoins To Keep An Eye On: Santiment On the other hand, the streamlined smart contract interface calling provides developers with estimated transaction fees for deploying their contracts, simplifying the development of smart contracts.  Finally, the revamped P2P network module enhances the connection efficiency, availability, scalability, and transmission efficiency of the TRON network. TRON founder Justin Sun emphasized the organization&#8217;s commitment to fostering the growth of the TRON ecosystem, attracting more developers, capital, and users to the platform.  With over 169 million users worldwide, TRON has processed more than 6 billion transactions and boasts a total value locked (TVL) of over $5 billion. It has built a comprehensive ecosystem encompassing NFTs, DeFi, GameFi, stablecoins, the metaverse, and cross-chain solutions, and hosts the largest USDT circulating supply worth over $46 billion, making it an industry leader. Overall, the TRON MainNet Periander upgrade brings significant improvements to the Tron Network, providing greater flexibility, compatibility, and efficiency to its users and developers. The upgrade encourages greater participation in the network, attracts more developers to the platform, and stimulates the growth of the ecosystem.  The revamped P2P network module provides a robust infrastructure that empowers developers and users to explore new possibilities and drive innovation within the TRON ecosystem. On-chain Metrics Show Bullish Trend For TRX As the TRON Network&#8217;s upgrade day approaches, the platform has experienced a notable uptick in its on-chain metrics, according to data from DeFiLlama.  Since the beginning of the month, TRX&#8217;s trading volume has seen a gradual increase, which indicates that there is growing demand for the token. In the last few days, TRX&#8217;s trading volume has reached over $9 million.  Additionally, the network activity on TRON has also been rising in recent weeks. On-chain activity, such as the number of transactions and unique addresses, is an essential metric to consider.  In the lead-up to the upgrade, TRON&#8217;s on-chain activity has increased, which suggests that there is a growing demand for TRX. In the last three days alone, there have been over 20 million transactions on the TRON network.  This growing network activity and usage of the TRON network are positive indicators for the TRON ecosystem and could lead to further growth in the future.  Related Reading: Coinbase Stock Soars Nearly 12% As BlackRock Reveals Surveillance Partnership On the flip side, TRX has been on an uptrend since June 20th, starting from a value of $0.06788 and now trading above the $0.07784 mark. This represents a considerable gain of 13% over the last 14 days and 4% in the seven-day period. However, TRX is currently facing its yearly high resistance at the same trading level. This could potentially create a delay in reaching new yearly highs if it is unable to surpass its nearest resistance. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T18:00:36.000Z",
    "title": "Alex The Doge (ALEX) Predicted 50x returns, Pepe Coin (PEPE) Community Still Going Strong",
    "url": "https://www.crypto-news-flash.com/alex-the-doge-alex-predicted-50x-returns-pepe-coin-pepe-community-still-going-strong/?utm_source=rss&utm_medium=rss&utm_campaign=alex-the-doge-alex-predicted-50x-returns-pepe-coin-pepe-community-still-going-strong",
    "description": "With its unique features and promising roadmap, Alex The Doge (ALEX) has predicted 50x returns for its investors, making it an attractive investment opportunity. While Pepe Coin (PEPE) has also gained traction in the market, the Alex The Doge (ALEX) community is growing stronger by the day, with its ongoing presale drawing attention from crypto [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-04T18:05:39.000Z",
    "title": "Coinbase Stock (COIN) Explodes After Crypto Exchange Named in New Bitcoin ETF Filing",
    "url": "https://dailyhodl.com/2023/07/04/coinbase-stock-coin-explodes-after-crypto-exchange-named-in-new-bitcoin-etf-filing/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-hit-lawsuit-stolen.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-hit-lawsuit-stolen.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-hit-lawsuit-stolen.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-hit-lawsuit-stolen.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-hit-lawsuit-stolen.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-hit-lawsuit-stolen.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-hit-lawsuit-stolen.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Shares of Coinbase (COIN) are up after news that exchange operator Cboe Global Markets has refiled its spot Bitcoin exchange-traded fund (ETF) application. The U.S Securities and Exchange Commission (SEC) previously rejected Cboe&#8217;s application, which was filed on behalf of financial giants BlackRock and Fidelity, for being unclear and incomprehensive. Bloomberg senior ETF analyst Eric [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/04/coinbase-stock-coin-explodes-after-crypto-exchange-named-in-new-bitcoin-etf-filing/\">Coinbase Stock (COIN) Explodes After Crypto Exchange Named in New Bitcoin ETF Filing</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]