[
  {
    "source": "CoinDesk",
    "date": "2023-06-16T02:58:32.000Z",
    "title": "OKCoin Accused by FDIC of Making False Claims About Customer Protections",
    "url": "https://www.coindesk.com/policy/2023/06/16/okcoin-accused-by-fdic-of-making-false-claims-about-customer-protections/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "OKCoin must scrub misleading statements that suggest its customers’ accounts are protected by the U.S. Federal Deposit Insurance Corp. (FDIC), the U.S. banking regulator ordered late Thursday, complaining the company is making false claims."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-16T03:07:14.000Z",
    "title": "Bitcoin Price Aims $26,200 But 100 SMA Hold The Key In Short-Term",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-aims-26200/",
    "description": "Bitcoin price is attempting a recovery wave above the $25,200 resistance. BTC must clear the 100 hourly SMA to continue higher in the near term. Bitcoin is slowly recovering higher above the $25,200 support. The price is trading below $25,750 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance near $25,680 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could rise further if it clears $25,750 and the 100 hourly Simple moving average. Bitcoin Price Attempts Recovery Bitcoin price remained in a bearish zone below the $26,200 resistance zone. BTC extended its decline below the $25,500 support and even spiked below $25,000. A low is formed near $24,751 and the price is now attempting a recovery wave. There was a clear move above the $25,000 and $25,200 resistance levels. The price climbed above the 50% Fib retracement level of the downward move from the $26,062 swing high to the $24,751 low. Bitcoin price is now trading below $25,750 and the 100 hourly Simple moving average. Besides, there is a key bearish trend line forming with resistance near $25,680 on the hourly chart of the BTC/USD pair. The pair is now facing resistance near the trend line and the 100 hourly Simple moving average. It is close to the 61.8% Fib retracement level of the downward move from the $26,062 swing high to the $24,751 low. The next major resistance is near the $25,750 level. Source: BTCUSD on TradingView.com A clear move above the $25,750 resistance might start a fresh increase. The next major resistance is near the $26,200 level, above which the bulls might send BTC toward the $26,500 resistance zone. Fresh Decline in BTC? If Bitcoin’s price fails to clear the $25,750 resistance, it could start another decline. Immediate support on the downside is near the $25,200 level. The next major support is near the $24,820 level, below which the price might start another major decline. In the stated case, the price could drop toward the $24,000 support in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is above the 50 level. Major Support Levels – $25,200, followed by $24,820. Major Resistance Levels – $25,680, $25,750, and $26,200."
  }
]