[
  {
    "source": "CoinDesk",
    "date": "2023-11-15T12:00:00.000Z",
    "title": "Blockchain Startup Kinto Plans 'First KYC'd' Ethereum Layer-2 Network After Raising $5M",
    "url": "https://www.coindesk.com/business/2023/11/15/blockchain-startup-kinto-plans-first-kycd-ethereum-layer-2-blockchain-after-raising-5m/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Kinto network, built with the Optimism's OP Stack, features native know-your-customer (KYC) checks and investor accreditation mechanism to help onboard regulated financial institutions."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-15T11:45:09.000Z",
    "title": "OKX joins forces with Komainu, CoinShares to boost security for segregated institutional crypto trading",
    "url": "https://cryptoslate.com/okx-joins-forces-with-komainu-coinshares-to-boost-institutional-crypto-trading-security/",
    "description": "<p>OKX, the prominent crypto exchange firm, has teamed up with Komainu and CoinShares to enable continuous trading of segregated assets held for institutional clients, according to a Nov. 15 statement shared with CryptoSlate. Through this collaboration, CoinShares can trade institutional assets on the OKX platform while maintaining custody through Komainu. This move represents a significant [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/okx-joins-forces-with-komainu-coinshares-to-boost-institutional-crypto-trading-security/\">OKX joins forces with Komainu, CoinShares to boost security for segregated institutional crypto trading</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-15T11:45:00.000Z",
    "title": "Market maturity: Bitcoin investors stay calm amid 5% value fluctuation",
    "url": "https://cryptoslate.com/insights/market-maturity-bitcoin-investors-stay-calm-amid-5-value-fluctuation/",
    "description": "<p>Quick Take The Bitcoin market continues to demonstrate maturation, as evidenced by a unique reaction to the recent 5% dip in Bitcoin&#8217;s price. Historically, such fluctuations have triggered panic selling among investors, notably those who purchased Bitcoin at a value exceeding $35,000. This demographic, primarily composed of short-term holders who have retained Bitcoin for less [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/market-maturity-bitcoin-investors-stay-calm-amid-5-value-fluctuation/\">Market maturity: Bitcoin investors stay calm amid 5% value fluctuation</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-15T11:59:15.000Z",
    "title": "Crypto introduces trust into finance",
    "url": "https://cryptodaily.co.uk/2023/11/crypto-introduces-trust-into-finance",
    "description": "A report published by ZeroHash on Tuesday highlights the new wave of crypto adoption is being inspired by a perception of renewed trust in the sector."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-15T12:04:54.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 How much is LTC worth? Today, the price of Litecoin stands at $72.2, backed by a 24-hour trading volume amounting to $336 million. With a market capitalization of $5 billion, its market dominance is 0.48%. Over the past 24 hours, the LTC price has seen a 1.81% increase. Currently, the circulating ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-15T11:59:46.000Z",
    "title": "Major crypto wallet vulnerability uncovered: Billions at risk",
    "url": "https://www.cryptopolitan.com/major-crypto-wallet-vulnerability-uncovered/",
    "description": "A critical vulnerability, dubbed &#8220;Randstorm,&#8221; has been identified by cybersecurity firm Unciphered, posing a significant threat to millions of cryptocurrency wallets. This vulnerability impacts wallets created using web browsers from 2011 to 2015, potentially affecting around $2.1 billion in crypto assets. The discovery and impact of Randstorm While attempting to retrieve a Bitcoin wallet, Unciphered ... <a title=\"Major crypto wallet vulnerability uncovered: Billions at risk\" class=\"read-more\" href=\"https://www.cryptopolitan.com/major-crypto-wallet-vulnerability-uncovered/\" aria-label=\"More on Major crypto wallet vulnerability uncovered: Billions at risk\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-15T11:48:17.000Z",
    "title": "OpenSea users targeted in latest phishing scam amid security concerns",
    "url": "https://www.cryptopolitan.com/opensea-users-targeted-in-latest-scam/",
    "description": "In recent developments, users of OpenSea, a leading nonfungible token (NFT) marketplace, have reported a surge in phishing attacks. These attacks, masquerading as official communications from OpenSea, have raised alarms across the platform&#8217;s community. Users and developers alike have encountered various deceptive emails, including false developer account risk alerts and fake NFT offers. A developer ... <a title=\"OpenSea users targeted in latest phishing scam amid security concerns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/opensea-users-targeted-in-latest-scam/\" aria-label=\"More on OpenSea users targeted in latest phishing scam amid security concerns\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-15T11:41:44.000Z",
    "title": "John Deaton critiques US rep’s inaction on SEC subpoena",
    "url": "https://www.cryptopolitan.com/john-deaton-critiques-us-reps-inaction-on-sec-subpoena/",
    "description": "In a recent development, U.S. Representative Patrick McHenry faces criticism from John Deaton, an attorney representing XRP investors, over his handling of the SEC&#8217;s reluctance to comply with Congressional oversight. Deaton, involved in the high-profile SEC v. Ripple lawsuit, has expressed disappointment in McHenry&#8217;s approach towards SEC head Gary Gensler, who stands accused of non-compliance ... <a title=\"John Deaton critiques US rep&#8217;s inaction on SEC subpoena\" class=\"read-more\" href=\"https://www.cryptopolitan.com/john-deaton-critiques-us-reps-inaction-on-sec-subpoena/\" aria-label=\"More on John Deaton critiques US rep&#8217;s inaction on SEC subpoena\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-15T12:04:12.000Z",
    "title": "This token is up 600% in a week amid meme coin rally",
    "url": "https://crypto.news/this-token-is-up-600-in-a-week-amid-meme-coin-rally/",
    "description": "The crypto market is seeing a new rally in memcoins. The CorgiAI (CORGIAI) token has grown 600% last week. CorgiAI is a web3 project that harnesses the limitless potential of artificial intelligence to transform the way crypto interacts and communicates.&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-15T11:53:16.000Z",
    "title": "Hex Trust bags in full Dubai operating license",
    "url": "https://crypto.news/hex-trust-bags-in-full-dubai-operating-license/",
    "description": "Hong Kong-based institutional cryptocurrency asset custodian Hex Trust has been approved to provide virtual asset custodial services to institutional clients and investors in Dubai. The firm, which opened its office in Dubai in June 2022, has been awarded a full&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-15T11:44:52.000Z",
    "title": "Hong Kong’s HashKey announces $10k application fee for token listings",
    "url": "https://crypto.news/hong-kongs-hashkey-announces-10k-application-fee-for-token-listings/",
    "description": "Applicants seeking listing on HashKey Exchange must pay an application fee of $10,000 to enter the token review process. Hong Kong crypto firm HashKey Group has unveiled a listing policy for those interested in bringing their cryptos to the Asian&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-15T12:00:39.000Z",
    "title": "XRP Will Not Become A Stablecoin For Banks After AMM Launch: Expert",
    "url": "https://www.newsbtc.com/xrp-news/xrp-not-bank-stablecoin-post-amm/",
    "description": "In the wake of Ripple&#8217;s announcement regarding the integration of an Automated Market Maker (AMM) into the XRP Ledger (XRPL), the community has been abuzz with speculation and debate. Central to this discourse is the potential transformation of XRP in light of this update, particularly in regard to its classification and function as a digital asset. Ripple&#8217;s Chief Technology Officer, David Schwartz, previously hailed this update as the most significant for XRPL, raising expectations among stakeholders. Additionally, at the recent Swell conference, Ripple revealed plans to integrate its rebranded Ripple Payments product with the XRPL&#8217;s native decentralized exchange (DEX), further stirring discussions among community members. The community&#8217;s response has been a mix of euphoria and confusion. Digital Perspectives, a key community influencer with over 150,000 followers on X, expressed concerns over the potential implications of this update: &#8220;Are we watching XRP become a stablecoin with the introduction of AMMs and the Prudential Treatment requirements from the Bank of International Settlement [BIS]? Cat 1 vs Cat 2, where would you classify XRP?&#8221; Related Reading: New XRP Ledger Upgrade Goes Live, What’s New? He further questioned, &#8220;When XLS-30D passes and AMMs become an integral part of the XRPL, will it change the characteristics of XRP and qualify as a group 1b asset for BIS and other banks?” XRP Price Volatility Is Necessary Panos Mekras, the co-founder of crypto-focused company Anodos, quickly intervened to dispel the rumors and speculation about XRP morphing into a stablecoin to fit into the 1b asset class of the BIS with the advent of the AMM. Mekras, who has previously clashed with Digital Perspectives over misinformation, laid out a detailed refutation of the idea that XRP could become a stablecoin. He emphasized, “The fundamental nature of XRP as the native coin of the XRP Ledger, a decentralized digital asset traded freely, is unchangeable. It’s technically impossible for XRP to transform into a stablecoin, a concept that completely contradicts its inherent design.” Related Reading: Stunning Correlation Emerges Between XRP And XLM, What’s Going On? He further delved into the dynamics of AMMs, noting that they are most effective in environments with high volatility. This volatility benefits liquidity providers (LPs) by attracting more traders and, consequently, increasing trading volume and fees. According to Mekras, the AMM is tailored to take advantage of such market conditions. Mekras also highlighted the potential impact of the AMM on XRP&#8217;s market dynamics. He suggested that the AMM&#8217;s implementation might lead to an increase in buying pressure on XRP. A significant portion of the token is expected to be locked in the AMM, which would enhance its liquidity and attract more traders. This, in turn, would make the crypto token more versatile and efficient for various use cases. In his concluding remarks, Mekras called for a more informed understanding within the community. He stressed the need to focus on the technical aspects of XRPL and the AMM, advising against following individuals who propagate misinformation. “The community should stop following and paying attention to enablers of misinformation such as Digital Perspectives and learn more about the technicals of the XRPL and the AMM,&#8221; Mekras said. At press time, the XRP price found support at the 0.382 Fibonacci retracement level in the 1-day chart and traded at $0.6333. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-15T12:04:05.000Z",
    "title": "Top Altcoins to Buy in the Crypto Bull Run | Best Alt Coins with Massive Potential and New Meme Coins",
    "url": "https://www.crypto-news-flash.com/top-altcoins-to-buy-in-the-crypto-bull-run-best-alt-coins-with-massive-potential-and-new-meme-coins/?utm_source=rss&utm_medium=rss&utm_campaign=top-altcoins-to-buy-in-the-crypto-bull-run-best-alt-coins-with-massive-potential-and-new-meme-coins",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-46.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-46.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-46-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Interest in altcoins is growing as Bitcoin and Ethereum clock in growth rates exceeding 30% over the last 30 days and murmurs of a bull run become increasingly loud. Crypto buyers are scouting out the new coins and altcoins fields, in search for interesting gems to add to their coin collections. Among the emerging digital [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-15T11:52:08.000Z",
    "title": "Dogecoins (DOGE) Remarkable 10% Jump: Bullish Momentum or Time to Sell?",
    "url": "https://www.crypto-news-flash.com/dogecoins-doge-remarkable-10-jump-bullish-momentum-or-time-to-sell-2/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoins-doge-remarkable-10-jump-bullish-momentum-or-time-to-sell-2",
    "description": "<img width=\"1502\" height=\"1000\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Doge-dogecoin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Doge-dogecoin.jpg 1502w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Doge-dogecoin-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Doge-dogecoin-1024x682.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Doge-dogecoin-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Doge-dogecoin-104x69.jpg 104w\" sizes=\"(max-width: 1502px) 100vw, 1502px\" />Dogecoin&#8217;s value has risen significantly, with a 14.74% increase in 48 hours and a 15% spike in trading volume, indicating a critical phase in the digital currency market. Market sentiment is currently in the &#8216;Greed&#8217; category, suggesting potential overheating and risk of price correction despite positive technical indicators and on-chain metrics supporting a bullish outlook. [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-15T11:50:46.000Z",
    "title": "ETH Could Drop to $1.7K as Sell Signal Gets Flagged: Analyst",
    "url": "https://coinedition.com/eth-could-drop-to-1-7k-as-sell-signal-gets-flagged-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Eth-Has-Lost-30-Of-Its-Market-Value-Since-September-12-This-Year.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Eth-Has-Lost-30-Of-Its-Market-Value-Since-September-12-This-Year.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Eth-Has-Lost-30-Of-Its-Market-Value-Since-September-12-This-Year-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Eth-Has-Lost-30-Of-Its-Market-Value-Since-September-12-This-Year-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Eth-Has-Lost-30-Of-Its-Market-Value-Since-September-12-This-Year-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Eth-Has-Lost-30-Of-Its-Market-Value-Since-September-12-This-Year-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Renowned cryptocurrency trader and analyst Ali revealed in an X post today that a sell signal has been triggered on the 3-day chart for Ethereum (ETH). In the post, the analyst noted that the TD Sequential indicator flagged a sell signal for the leading altcoin. This comes as ETH tests a major resistance zone between [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/eth-could-drop-to-1-7k-as-sell-signal-gets-flagged-analyst/\">ETH Could Drop to $1.7K as Sell Signal Gets Flagged: Analyst</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]