[
  {
    "source": "NewsBTC",
    "date": "2023-11-07T01:00:10.000Z",
    "title": "Polkadot (DOT) Market Cap Dips: Q3 Sees 16% Decrease In Value",
    "url": "https://www.newsbtc.com/analysis/dot/polkadot-dot-market-cap-dips-q3-sees-16-decrease-in-value/",
    "description": "Polkadot (DOT), one of the prominent blockchain networks in the crypto space, experienced a 16% decline in market capitalization in the third quarter (Q3) of 2023, according to a recent report from Messari.  This decline came after a moderate downturn in the overall cryptocurrency market during Q3, despite favorable court rulings for XRP and Grayscale. The total crypto market capitalization declined by 5.8%, with Bitcoin (BTC) and Ethereum (ETH) falling by 7.5% and 10.0%, respectively. Polkadot Closes Q3 With $5.2 Billion Market Cap As reported by Messari, Polkadot&#8217;s market capitalization closed at $5.2 billion, positioning it as the 13th largest crypto asset by market cap in Q3 2023 (currently 15th).  Polkadot&#8217;s financial structure is based on a weight-based fee model, which differs from the gas-metering model in other networks, such as Ethereum. Transaction fees in Polkadot are determined and charged before execution, with the calculation comprising a weight fee reflecting computational resources, a length fee based on transaction size, and an optional tip to incentivize block authors.  Related Reading: Expert Predicts Date For Next Bitcoin Cycle High Of $130,000 In Q3 2023, Polkadot generated revenue amounting to $94,000, representing a 3% decrease compared to the previous quarter. Messari suggests that Polkadot&#8217;s revenue tends to be relatively lower compared to its competitors due to the network&#8217;s structural design. On the other hand, the native token of Polkadot, DOT, serves three primary purposes: governance, staking, and parachain bonding. During Q3 2023, the staking percentage of DOT rose by 12% compared to the previous quarter, reaching 49%.  This increase led to reduced staking rewards and a 12% decline in the annualized nominal yield to 15%. According to Messari, the close alignment of Polkadot&#8217;s staking rate with the ideal rate demonstrates the effectiveness of its mechanism. Polkadot&#8217;s OpenGov Milestone The Polkadot treasury supported various initiatives in Q3, including software development, bounties, client upgrades, and community events like meetups and hackerspaces.  According to Messari, the implementation of OpenGov on June 15 marked a significant milestone, revolutionizing treasury management and enabling concurrent proposals with distinct requirements. At the end of the quarter, the Polkadot treasury held approximately 45 million DOT ($185 million). Furthermore, Polkadot has recently completed the official release of Polkadot 1.0, marking the achievement of a significant milestone outlined in the Polkadot whitepaper.  Related Reading: The Main Drivers Behind The 23% XRP Price Rally Revealed The network&#8217;s codebase has been fully transitioned to a repository managed by the community through Polkadot OpenGov and the Technical Fellowship. The roadmap for the next iteration, Polkadot 2.0, will be determined through community discussions and consensus.  Founder Gavin Wood has proposed ideas for additional mechanisms to allocate Polkadot&#8217;s block space and for creating treaty-like agreements between multiple blockchains called &#8220;accords.&#8221; As of this writing, the DOT token has exhibited a noteworthy upward trend since October 19, closely following Bitcoin’s lead. Presently, the token is trading at $4,839, reflecting a notable increase of over 16% within the past fourteen days. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-07T01:00:01.000Z",
    "title": "Trader Predicts More Rallies for Chainlink (LINK) and One AI-Focused Crypto, Calls for Altcoin Market Cap Breakout",
    "url": "https://dailyhodl.com/2023/11/06/trader-predicts-more-rallies-for-chainlink-link-and-one-ai-focused-crypto-calls-for-altcoin-market-cap-breakout/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/exchange-altcoins-available.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/exchange-altcoins-available.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/exchange-altcoins-available.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/exchange-altcoins-available.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/exchange-altcoins-available.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/exchange-altcoins-available.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/exchange-altcoins-available.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist believes that Chainlink (LINK) has officially entered bull territory after months of sideways price action. Pseudonymous analyst Rekt Capital tells his 365,500 followers on the social media platform X that LINK is now in the midst of a long-term uptrend. &#8220;The macro downtrend is over. The macro range is over, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/06/trader-predicts-more-rallies-for-chainlink-link-and-one-ai-focused-crypto-calls-for-altcoin-market-cap-breakout/\">Trader Predicts More Rallies for Chainlink (LINK) and One AI-Focused Crypto, Calls for Altcoin Market Cap Breakout</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]