[
  {
    "source": "CoinDesk",
    "date": "2024-01-03T17:48:57.000Z",
    "title": "Goldman Sachs Eyeing Bitcoin ETF Role Via BlackRock and Grayscale: Sources",
    "url": "https://www.coindesk.com/business/2024/01/03/goldman-sachs-eyeing-bitcoin-etf-role-via-blackrock-and-grayscale-sources/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Goldman Sachs is in talks to play the key role of being an \"authorized participant\" for BlackRock and Grayscale's bitcoin ETFs, if the SEC approves them, according to people familiar with the situation."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-03T18:08:31.000Z",
    "title": " The right to a self-hosted wallet? Crypto laws Congress should pass in 2024 ",
    "url": "https://cointelegraph.com/news/self-hosted-wallet-crypto-laws-congress-should-pass-2024",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZDMyNDg5OTYtYmI2OS00YjMyLWFjMTMtODQ5NjJlMjQ1NjU0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>From amending the definition of \"legal tender\" to codifying a right to own self-hosted wallets, there is a lot of action Congress could take on crypto in 2024.</p>\n                    <p><p>To begin the new year on the right foot, many people have already chosen resolutions for 2024. From losing weight to saving money, the new year is a great time to start fresh. Yet, perhaps Congress should also set a few resolutions.</p><p>From reining in the Federal Reserve to leveling the playing field for cryptocurrency use, there are many options to choose from. However, to not risk setting too many goals all at once, here are five reforms that Congress should strive for this year.</p><p>First, Congress should formally establish that the Federal Reserve does not have the authority to launch a <a href=\"https://cointelegraph.com/cryptocurrency-regulation-for-beginners/what-are-cbdcs-a-beginners-guide-to-central-bank-digital-currencies\">central bank digital currency (CBDC)</a>. The Federal Reserve’s recently released “Doomsday Book” makes it clear that all too often, the Federal Reserve has relied on its own discretionary authority rather than explicit congressional authorization. Furthermore, statements from Federal Reserve officials have similarly preserved a sort of legal gray area around the authority to issue a CBDC.</p><p><a href=\"https://cointelegraph.com/news/self-hosted-wallet-crypto-laws-congress-should-pass-2024\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-03T18:00:00.000Z",
    "title": " UK terrorism tsar says new laws needed to prosecute people who train extremist AI bots ",
    "url": "https://cointelegraph.com/news/uk-terrorism-tsar-says-new-artificial-intelliegence-laws-needed-to-prosecute-people-train-extremist-ai-bots",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMzVlYjg1OGMtNzYzMi00M2MxLWFlNmMtZDA5M2ZkOTNiODI5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The request comes after the U.K.’s top terrorism legislation advisor was “recruited” by AI chatbots posing as terrorists on the Character.AI platform.</p>\n                    <p><p>The United Kingdom’s independent reviewer of terrorism legislation, Jonathan Hall KC, wants the government to consider legislation that would hold humans responsible for the outputs generated by artificial intelligence (AI) chatbots they've created or trained. </p><p>Hall recently penned an op-ed for the Telegraph wherein he described a series of “experiments” he conducted with chatbots on the Character.AI platform. </p><p>While the op-ed stops short of making formal recommendations, it does point out that both the U.K.’s Online Safety Act of 2023 and the Terrorism Act of 2003 fail to properly address the problem of generative AI technologies as they don’t cover content specifically created by the modern class of chatbots. </p><p><a href=\"https://cointelegraph.com/news/uk-terrorism-tsar-says-new-artificial-intelliegence-laws-needed-to-prosecute-people-train-extremist-ai-bots\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2024-01-03T17:54:49.000Z",
    "title": "CoinShares sees $2.2b influx in 2023 crypto product investments",
    "url": "https://crypto.news/coinshares-sees-2-2b-influx-in-2023-crypto-product-investments/",
    "description": "In the final week of 2023, cryptocurrency investments surged with a $243 million inflow, reaching a yearly total of $2.2 billion, fueled by Bitcoin's substantial 86% share and market optimism."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-03T18:07:17.000Z",
    "title": "Why The Crypto Flash Could Be The Buy The Dip Moment",
    "url": "https://www.newsbtc.com/crypto/why-the-crypto-flash-could-be-the-buy-the-dip-moment/",
    "description": "In a flash, nearly $200 billion in value was wiped out of the cryptocurrency market today in a larger selloff driven by rumors that pending Bitcoin ETF approvals could end up denied by the SEC. Despite the carnage across crypto today, this could be the moment dip buyers have been waiting for. Recapping The Crypto Market Flash Crash At around 6AM this morning, Bitcoin price began falling, causing a cascade of liquidations in altcoins. Bitcoin dropped nearly 10% while altcoins fell anywhere between 20 and 30% from local highs. Related Reading: Bitcoin Trend Strength Exhibits Striking Similarities With Last Bull Run The move has likely caused a lot of fear, uncertainty, and doubt. And when in doubt, you&#8217;re supposed to zoom out. Moving away from the daily timeframe and into higher timeframes like the monthly can provide comforting view in contrast to the nasty wick left behind on the daily chart. Instead, the high timeframe view shows that there is a breakout confirmed by high volume. The market has the rest of January to close with a gain, turning the volume bar green. If it does, this could prove to be the ideal buy the dip moment. Volume precedes price &#124; TOTAL on TradingView.com Why A Breakout Could Be Confirmed By The End Of January A high volume breakout after three years of declining volume is undeniably significant and could hint at a cryptocurrency market bull run in the coming months. Volume tends to confirm price breakouts when paired with technical indicators and/or chart patterns. In the example above, 1M BTCUSD closed above the Ichimoku&#8217;s Kijun-sen. This didn&#8217;t happen in 2019, but did in 2020 into 2021. Not pictured, Bitcoin also closed above the upper Bollinger Band – another situation that only happened in 2020. Related Reading: Forget The SEC And Bitcoin ETF Approval Drama, Here’s Why Bitcoin Flash Crashed A close above the Bollinger Band is a buy signal, especially when confirmed with high volume. Volume being high represents more BTC being traded at the current price. The more trading volume, the more orders being filled which often is due to either big players or widespread market participation. Both scenarios are potentially bullish, but the monthly must close with a green volume bar. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-03T18:00:06.000Z",
    "title": "Crypto Analyst Blasts $20,000 XRP Price Target, Reveals Why It’s Impossible",
    "url": "https://www.newsbtc.com/analysis/xrp/crypto-analyst-20000-xrp-price/",
    "description": "XRP YouTuber Moon Lambo has hit out at those who believe that the XRP price could be worth $20,000 in the future. The analyst believes that this price level is unattainable for the crypto token as he highlighted reasons why he holds this belief.  Why The XRP Price Cannot Rise To $20,000 In a video on his YouTube Channel, Moon Lambo explained that XRP’s market cap will need to run into quadrillions of dollars if it were to achieve that price level based on its current market cap. However, from his calculation, there is not enough money in the world for such an occurrence, as at least $100 trillion will need to flow into the XRP ecosystem for that to happen. Related Reading: Solana Meme Coins: A Guide to Buying, Trading, And Profiting From SOL Investments According to the YouTuber, there is a “0% chance” that this will happen. He dismissed any argument that some assets could be sold off to fund this amount of inflows into the XRP ecosystem. This is unlikely to happen as those assets will need to go to zero to get the amount of liquidity needed to get the XRP price to $20,000, Moon Lambo argued.  XRP being worth that amount would also mean the crypto token having a market cap worth over ten times more than the value of the US stock market. Moon Lambo says that it is “utter nonsense” to think that this will happen. He believes there is no way that XRP can be more valuable than all the foremost companies in the US put together.  He also alluded to arguments that XRP can attain this price by becoming the currency for the global reserve. He says that swapping out the dollar, which currently accounts for a huge chunk of the global reserve, won’t still see the crypto token get the required liquidity to hit $20,000. XRP price at $0.63 &#124; Source: XRPUSD on Tradingview.com Enough Reason To Still Be Excited As An XRP Holder Despite his stance, Moon Lambo is still bullish on the XRP price. He stated that the crypto token doesn’t need this “crazy hype nonsense” for one to be excited as an XRP holder. The crypto analyst believes that as far as XRP is widely adopted, there is enough money that can flow into it, which could cause its price to hit three digits.  Related Reading: Top 5 Events That Shook Up The Crypto Industry In 2023 Unlike a price prediction of $20,000, XRP’s price hitting three digits is still within the “realm of possibilities.” However, Moon Lambo doesn’t see that instantaneously happening as he says that it could take “many market cycles.” The good news is that anyone who has been in on XRP for some time is already well-positioned for such a multiplier effect.  Meanwhile, analysts who have in the past made such “impossible” price predictions of $20,000 were not spared in the crypto analyst’s rant. Moon Lambo mentioned that such people only make baseless claims and do not provide justification for such assertions.  He provided insight into why these analysts make such predictions as he suggested that they were doing this to get more audience. He remarked that he would probably get more subscribers if he jumped on this “bandwagon.” However, he has no intention to do that as he says it will be “intellectually dishonest” to do that. Featured image from Tekedia, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-03T18:00:49.000Z",
    "title": "Solana Inscriptions Exceed $1 Million; RebelSatoshi Aims for a Powerful Memecoin Rally",
    "url": "https://www.crypto-news-flash.com/solana-inscriptions-exceed-1-million-rebelsatoshi-aims-for-a-powerful-memecoin-rally/?utm_source=rss&utm_medium=rss&utm_campaign=solana-inscriptions-exceed-1-million-rebelsatoshi-aims-for-a-powerful-memecoin-rally",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-36.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />In the fast-evolving landscape of cryptocurrencies, Solana, a prominent smart contracts platform, is making waves. The second week of December witnessed an extraordinary milestone as the total number of inscriptions on Solana surpassed a staggering one million. This surge in activity is not merely a numerical feat but a testament to the growing influence and [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-03T17:56:34.000Z",
    "title": "OANDA’s Acquisition of Coinpass – Pioneering Crypto Trading",
    "url": "https://dailyhodl.com/2024/01/03/oandas-acquisition-of-coinpass-pioneering-crypto-trading/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-OANDA-Industry-Announcement-Featured-Image-Template.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-OANDA-Industry-Announcement-Featured-Image-Template.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-OANDA-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-OANDA-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-OANDA-Industry-Announcement-Featured-Image-Template.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-OANDA-Industry-Announcement-Featured-Image-Template.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-OANDA-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-OANDA-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-OANDA-Industry-Announcement-Featured-Image-Template.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-OANDA-Industry-Announcement-Featured-Image-Template.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Singapore In a landmark move that promises to reshape the contours of the cryptocurrency trading landscape, OANDA, a renowned global leader in online multi-asset trading services and currency data, has announced its acquisition of Coinpass. This acquisition amplifies OANDA&#8217;s commitment to diversifying its offerings and solidifies its foothold in the burgeoning digital currency market. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/03/oandas-acquisition-of-coinpass-pioneering-crypto-trading/\">OANDA’s Acquisition of Coinpass – Pioneering Crypto Trading</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-03T17:55:52.000Z",
    "title": "Nearly $300,000,000 in Losses Recorded in 2023 Due to Crypto Phishing Scams, According to Cybersecurity Firm",
    "url": "https://dailyhodl.com/2024/01/03/nearly-300000000-in-losses-recorded-in-2023-due-to-crypto-phishing-scams-according-to-cybersecurity-firm/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/losses-phishing-scams-due.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/losses-phishing-scams-due.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/losses-phishing-scams-due.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/losses-phishing-scams-due.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/losses-phishing-scams-due.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/losses-phishing-scams-due.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/losses-phishing-scams-due.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto phishing scams facilitated the theft of more than $295 million worth of assets in 2023, according to the cybersecurity firm Scam Sniffer. In a new analysis, Scam Sniffer notes that phishing websites employ a type of crypto-malware known as &#8220;wallet drainers&#8221; that trick victims into greenlighting malicious transactions. Roughly 324,000 crypto holders fell victim [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/03/nearly-300000000-in-losses-recorded-in-2023-due-to-crypto-phishing-scams-according-to-cybersecurity-firm/\">Nearly $300,000,000 in Losses Recorded in 2023 Due to Crypto Phishing Scams, According to Cybersecurity Firm</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]