[
  {
    "source": "CoinDesk",
    "date": "2023-07-06T11:04:55.000Z",
    "title": "Bitcoin Price Rally Puts Focus on Futures Spread That Underscores Need for Spot ETFs",
    "url": "https://www.coindesk.com/markets/2023/07/06/bitcoin-rally-puts-focus-on-futures-market-quirk-that-underscores-need-for-spot-based-etfs/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Observers call for spot-based bitcoin ETF as the bull market raises cost of pre-expiry rollover of positions for futures-based ETFs."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-06T10:40:12.000Z",
    "title": "Bitcoin and historical financial bubbles",
    "url": "https://cryptoslate.com/insights/bitcoin-and-historical-financial-bubbles/",
    "description": "<p>Quick Take Bitcoin: A Critiqued Investment Since its inception in 2009, Bitcoin has often been disparaged as a financial bubble. Now, in 2023, Bitcoin is valued at over $30,000, offering a significant return for investors over the past fourteen years. The price of Bitcoin even surged by 1,000% in a mere 600-day timeframe. From an [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-and-historical-financial-bubbles/\">Bitcoin and historical financial bubbles</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-06T10:57:27.000Z",
    "title": "Formerly Crypto-Skeptic CEO of World’s Largest Asset Manager Now Believes Role of Bitcoin Is ‘Digitizing Gold’",
    "url": "https://www.cryptoglobe.com/latest/2023/07/formerly-crypto-skeptic-ceo-of-worlds-largest-asset-manager-now-believes-role-of-bitcoin-is-digitizing-gold/",
    "description": "On Wednesday (5 July 2023), Larry Fink, Chairman and Chief Executive Officer of BlackRock, the world’s largest asset manager by AUM, shared his thoughts on Bitcoin during an interview on the Fox Business Network program “The Claman Countdown.” lackRock, which was founded in 1988, started with just eight people working in one room. It made […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-06T11:07:35.000Z",
    "title": "Bitcoin claims new highs as bull market gets into gear",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-claims-new-highs-as-bull-market-gets-into-gear",
    "description": "<p>Perhaps on the back of incredibly bullish statements by Blackrock CEO Larry Fink, Bitcoin has set a new yearly high with expectations that it will go much higher.</p>\nBitcoin bull market is building\n<p>The crypto bull market looks to be very much on this morning as bitcoin touches $31,500, a new high for this year. All that is needed is for bitcoin to get above this level and stay there for a few days in order to give the signal that the break is confirmed and that bitcoin can start traversing higher.</p>\n<p>This new bullish environment may have been caused in part by the CEO of Blackrock, the biggest AUM company on the planet, saying on national TV yesterday that bitcoin was \"digitising gold\", and that it was an &ldquo;international asset&rdquo;.&nbsp;</p>\n<p>This is also after Blackrock had filed for a Spot Bitcoin ETF along with some other large institutional entities. With Blackrock&rsquo;s experience and fantastic success in getting the regulators to sign off on their many ETF filings, this one extra filing has the hallmarks of being an extremely good bet.</p>\n<p>Bitcoin&rsquo;s current good fortune is also shared with some of the cryptocurrency market. If bitcoin rides high then most of the crypto market will follow suit, at least as long as impending regulation will allow.</p>\nSolana\n<p>One of those high riders today is Solana. Itself a target of the SEC, which has labelled it a security. This lightning fast layer 1 has been beaten to a pulp, falling from its November 2021 high of $260 to as low as $8 in December of last year.</p>\n<p>However, at $8 it could be imagined that the bottom was in for Solana, with a wick down to $12.60 possibly signalling a double bottom. A descending trendline has suppressed the price since July of 2022 and therefore the $SOL break of this line today could herald much greater things as long as the break is confirmed.</p>\nStacks\n<p>Stacks (STX) is another cryptocurrency to watch. It happens to be one of the only SEC-approved cryptocurrencies. It should certainly also benefit from the bitcoin narrative given that it's one of the very few bitcoin layer 2s, which enable apps to be built on top of bitcoin. It hit the 0.786 Fibonacci level yesterday and looks primed to go higher from here.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-06T11:00:58.000Z",
    "title": "FraXion Launches First Security Token Offering in the USA",
    "url": "https://news.bitcoin.com/fraxion-launches-first-security-token-offering-in-the-usa/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/9544f7b8-a4ca-46c9-b2e9-74f80d453fc9-768x432.jpeg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/9544f7b8-a4ca-46c9-b2e9-74f80d453fc9-300x169.jpeg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/9544f7b8-a4ca-46c9-b2e9-74f80d453fc9-1024x576.jpeg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/9544f7b8-a4ca-46c9-b2e9-74f80d453fc9-768x432.jpeg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/9544f7b8-a4ca-46c9-b2e9-74f80d453fc9-190x107.jpeg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/9544f7b8-a4ca-46c9-b2e9-74f80d453fc9-380x214.jpeg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/9544f7b8-a4ca-46c9-b2e9-74f80d453fc9-760x428.jpeg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/9544f7b8-a4ca-46c9-b2e9-74f80d453fc9.jpeg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Randolph &#38; Main Capital Group (RMCG) has announced the launch of FraXion (FRXN). It is one of the first debt Security Tokens aimed at retail investors who wish to invest alongside institutional investors in the most sought-after real estate developments in the United States. The Tokens will have a 5-year life, earn an [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T11:04:41.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T11:01:18.000Z",
    "title": "UAE is becoming the leading destination for Bitcoin miners: Reports",
    "url": "https://www.cryptopolitan.com/uae-the-leading-destination-for-btc-miners/",
    "description": "The United Arab Emirates (UAE) is quickly emerging as a leading destination for Bitcoin mining in the Middle East. With over 30 free trade zones and a growing contribution to the Bitcoin mining hash rate, the country has established itself as a pro-Web3 and crypto-friendly environment. In May, the country&#8217;s foray into Bitcoin mining began ... <a title=\"UAE is becoming the leading destination for Bitcoin miners: Reports\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uae-the-leading-destination-for-btc-miners/\" aria-label=\"More on UAE is becoming the leading destination for Bitcoin miners: Reports\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T10:39:34.000Z",
    "title": "Tether’s sinister dance with China shows ties beyond its commercial paper",
    "url": "https://www.cryptopolitan.com/tethers-sinister-dance-with-china/",
    "description": "Tether Holdings Ltd. has had a long-standing dance with China for years. Documents released by New York’s attorney general revealed that Tether Holdings Ltd., the issuer of the world’s largest stablecoin, USDT, used to include securities issued by Chinese companies in its reserve portfolio. But Tether’s connections to China run far deeper than its commercial ... <a title=\"Tether&#8217;s sinister dance with China shows ties beyond its commercial paper\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tethers-sinister-dance-with-china/\" aria-label=\"More on Tether&#8217;s sinister dance with China shows ties beyond its commercial paper\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-06T10:57:09.000Z",
    "title": "Circle eyes stablecoin launch in Japan as new policies take effect",
    "url": "https://crypto.news/circle-eyes-stablecoin-launch-in-japan-as-new-policies-take-effect/",
    "description": "Circle, the issuer of the USDC stablecoin, is reportedly exploring the possibility of launching a stablecoin in Japan following the implementation of new regulations governing stablecoins in the Asian nation."
  },
  {
    "source": "BTCManager",
    "date": "2023-07-06T10:49:56.000Z",
    "title": "Twitter receives money transmitter licenses in 3 US states",
    "url": "https://crypto.news/twitter-receives-money-transmitter-licenses-in-3-us-states/",
    "description": "Twitter has recently obtained money transmitter licenses in Michigan, Missouri, and New Hampshire, as confirmed by Nationwide Multistate Licensing System database records. This development indicates the social media platform's intention to potentially expand into the realm of payment services."
  },
  {
    "source": "BTCManager",
    "date": "2023-07-06T10:42:32.000Z",
    "title": "Binance CEO Changpeng Zhao predicts bitcoin bull run",
    "url": "https://crypto.news/binance-ceo-changpeng-zhao-predicts-bitcoin-bull-run/",
    "description": "Binance CEO, Changpeng Zhao, predicts a forthcoming Bitcoin bull run based on historical patterns and the upcoming halving event. He remains optimistic despite regulatory challenges."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-06T11:00:26.000Z",
    "title": "Solana Registers 20% Rise In Past Week, But Can SOL Keep This Up?",
    "url": "https://www.newsbtc.com/news/solana/solana-registers-20-rise-past-week-can-sol-keep-up/",
    "description": "Solana has observed an increase of more than 20% in the past week. Here&#8217;s what on-chain data says regarding whether this is sustainable or not. Solana Trading Volume Has Remained Low Despite Price Rise In its latest insight post, the on-chain analytics firm Santiment has looked at the underlying metrics of Solana to see what has been driving the latest increase in the price. The firm has looked at the &#8220;social volume&#8221; of the cryptocurrency for various social media platforms and has found that the asset has seen elevated interest on Reddit recently. Here, the social volume refers to a metric that measures the total number of unique posts or threads on a given social media platform that is making at least one mention of SOL. This metric can tell us about the degree of discussion that the coin is currently receiving on the website in question. Now, below is a chart that shows the trend in the Solana social volume on four major social media platforms: Telegram, Reddit, Twitter, and 4chan. Looks like the value of the metric has been relatively low for most of these platforms &#124; Source: Santiment As displayed in the above graph, the Solana social volume on Reddit has seen some spikes as the cryptocurrency has risen during the past week or so. The other platforms, however, haven&#8217;t observed that much discussion related to the asset. Related Reading: Blame The “Supermoon” If Bitcoin Crashes Or Rallies Towards $35,000 In July A notable spike in the social volume on Reddit also occurred before the coin&#8217;s 5% surge during the past 24 hours. This may imply that interest from users on the platform could partly be helping fuel the rise. In terms of the actual trading volume, though, SOL has continued to observe muted activity, despite the growth. Here is a chart that displays the trend in this indicator: The value of the metric hasn't been too high recently &#124; Source: Santiment Interestingly, the initial, strong rise that Solana enjoyed was accompanied by elevated volumes, but at the start of this month, the indicator&#8217;s value noted some decline. Since this drop in volume, SOL has mostly moved sideways. Generally, for any price rise to be sustainable, high trading volumes are required. This is due to the fact that participation from a large number of traders is needed to provide enough fuel for any such price move to go on. Related Reading: Bitcoin Cash (BCH) Registers 28% Gain – How Long Will It Last? Despite the sharp growth that Solana has observed today, the trading volume remaining at low values would suggest that the wider market isn&#8217;t finding the rally interesting enough to make moves on the network. Naturally, if the rally has to go on for an extended period, volumes may have to return to the market. There is also the fact that the SOL funding rates (a measure of the periodic fee that futures traders are exchanging between each other) on Binance and DyDx have become quite positive recently. Longs are dominating the market &#124; Source: Santiment From the graph, it&#8217;s visible that the earlier increase in the asset&#8217;s price may have been helped by shorts being liquidated in the market &#8211; as the funding rates had been highly negative then. As long contract holders are the majority force in the futures market now, the chances of a long squeeze taking place are higher now. In this case, if one does take place, the price would feel a bearish effect. SOL Price At the time of writing, Solana is trading around $20, up 20% in the last week. SOL has shot up in the past day &#124; Source: SOLUSD on TradingView Featured image from GuerrillaBuzz on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T11:00:39.000Z",
    "title": "Best Crypto Presale | Why ApeMax is a Top New Crypto Presale to watch in 2023 and beyond",
    "url": "https://www.crypto-news-flash.com/best-crypto-presale-why-apemax-is-a-top-new-crypto-presale-to-watch-in-2023-and-beyond/?utm_source=rss&utm_medium=rss&utm_campaign=best-crypto-presale-why-apemax-is-a-top-new-crypto-presale-to-watch-in-2023-and-beyond",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-39.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-39.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-39-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market seems to be witnessing upwards momentum and in the past months, and the world of cryptocurrencies has been swept up in an enthusiastic wave of crypto presale mania. With an ardent hunger for breakthrough opportunities, crypto purchasers are actively exploring the top crypto presales, driven by their unrelenting pursuit to unearth the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T10:45:12.000Z",
    "title": "Zilliqa (ZIL) Prepares for Game-Changing Upgrade: All the Details",
    "url": "https://www.crypto-news-flash.com/zilliqa-zil-prepares-for-game-changing-upgrade-all-the-details/?utm_source=rss&utm_medium=rss&utm_campaign=zilliqa-zil-prepares-for-game-changing-upgrade-all-the-details",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Akarat-Phasura-zilliqa.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Akarat-Phasura-zilliqa.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Akarat-Phasura-zilliqa-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Akarat-Phasura-zilliqa-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Akarat-Phasura-zilliqa-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />In a recent announcement, Zilliqa reveals that the highly anticipated upgrade v9.2.0 has been successfully deployed to the Zilliqa mainnet.  The new upgrade will usher in the launch of a new development network and ensure consistent development platform support. The Zilliqa network is in the proceeds of a major network upgrade poised to improve the [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-06T10:53:00.000Z",
    "title": "Circle Considers Launching its Stablecoin in Japan",
    "url": "https://coinedition.com/circle-considers-launching-its-stablecoin-in-japan/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Circle-Considers-Issuing-Stablecoin-in-Japan-Under-New-Rules-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Circle, a stablecoin issuer, is considering issuing a stablecoin in Japan. The Japanese government recently passed legislation that regulates stablecoins, and this new law has caught the attention of Circle&#8217;s co-founder and CEO, Jeremy Allaire. In an interview, Allaire mentioned that if stablecoins are widely used for international trade and global transactions, Japan could become [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/circle-considers-launching-its-stablecoin-in-japan/\">Circle Considers Launching its Stablecoin in Japan</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]