[
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T10:04:43.000Z",
    "title": "Mortal Kombat 1 on PC Faces Player Base Decline Amidst Technical and Controversial Issues",
    "url": "https://www.cryptopolitan.com/mortal-kombat-1-on-pc/",
    "description": "In the world of competitive fighting games, Mortal Kombat has long been a staple. With the recent release of Mortal Kombat 1, fans were eager to dive into the latest installment of the iconic franchise. However, recent data analysis from SteamDB and SteamCharts reveals a concerning trend: Mortal Kombat 1 on PC appears to be ... <a title=\"Mortal Kombat 1 on PC Faces Player Base Decline Amidst Technical and Controversial Issues\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mortal-kombat-1-on-pc/\" aria-label=\"More on Mortal Kombat 1 on PC Faces Player Base Decline Amidst Technical and Controversial Issues\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T09:54:32.000Z",
    "title": "The 12 Most Beautiful Nintendo Switch Games",
    "url": "https://www.cryptopolitan.com/the-12-most-beautiful-nintendo-switch-games/",
    "description": "The Nintendo Switch has unquestionably cemented its status as a gaming juggernaut, boasting a vast and diverse library of titles that cater to every gamer&#8217;s preferences. Among the myriad genres and experiences it offers, there&#8217;s a particular category that stands out: games that envelop players in breathtakingly beautiful worlds.  Breath of the Wild: The Legend ... <a title=\"The 12 Most Beautiful Nintendo Switch Games\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-12-most-beautiful-nintendo-switch-games/\" aria-label=\"More on The 12 Most Beautiful Nintendo Switch Games\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T09:53:38.000Z",
    "title": "Web3 Education Platform Rise In Acquires BlockBeam to Train the Next Generation of Web3 Developers in the U.S.",
    "url": "https://www.cryptopolitan.com/web3-education-platform-rise-in-acquires-blockbeam-to-train-the-next-generation-of-web3-developers-in-the-u-s/",
    "description": "Boston, Massachusetts, October 30th, 2023, Chainwire Rise In, a leading education platform that onboards web2 developers into web3, has further expanded its 200k+ talent community with the acquisition of U.S.-based BlockBeam. BlockBeam is one of the first and largest web3-focused ed-tech companies in the U.S. thanks to its partnerships with 90+ university blockchain clubs, including ... <a title=\"Web3 Education Platform Rise In Acquires BlockBeam to Train the Next Generation of Web3 Developers in the U.S.\" class=\"read-more\" href=\"https://www.cryptopolitan.com/web3-education-platform-rise-in-acquires-blockbeam-to-train-the-next-generation-of-web3-developers-in-the-u-s/\" aria-label=\"More on Web3 Education Platform Rise In Acquires BlockBeam to Train the Next Generation of Web3 Developers in the U.S.\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T09:53:34.000Z",
    "title": "Greek Data Watchdog to Rule on AI Systems in Refugee Camps",
    "url": "https://www.cryptopolitan.com/greek-data-watchdog-to-rule-on-ai-systems/",
    "description": "The Greek Data Protection Authority (DPA) is poised to make a pivotal decision regarding the legality of advanced surveillance and security systems deployed in Greek refugee camps. The ruling, expected by year-end, will have implications for using artificial intelligence (AI) and biometric-recognition systems in European migration management. The case centers on the Centaur and Hyperion ... <a title=\"Greek Data Watchdog to Rule on AI Systems in Refugee Camps\" class=\"read-more\" href=\"https://www.cryptopolitan.com/greek-data-watchdog-to-rule-on-ai-systems/\" aria-label=\"More on Greek Data Watchdog to Rule on AI Systems in Refugee Camps\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-30T09:52:40.000Z",
    "title": "Axie Infinity gains 16% amid increased whale transactions ",
    "url": "https://crypto.news/axie-infinity-gains-16-amid-increased-whale-transactions/",
    "description": "Axie Infinity (AXS) is the biggest gainer among the largest 100 crypto assets, surging by 16% in the past 24 hours amid increased whale transactions and development activity. The asset&#8217;s recent uptrend began on Oct. 20 following a collapse to&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-30T09:45:52.000Z",
    "title": "Zodia Custody expands to Hong Kong",
    "url": "https://crypto.news/zodia-custody-expands-to-hong-kong/",
    "description": "Zodia Custody has announced its expansion to Hong Kong, one of the leading financial hubs in Asia. Zodia Custody is a regulated platform that provides secure storage and transfer of cryptocurrencies. The move comes as the demand for crypto-related services&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-30T10:00:14.000Z",
    "title": "Crypto Analyst Presents Uniswap’s UNI As The Next Coin Primed For Breakout",
    "url": "https://www.newsbtc.com/altcoin/crypto-analyst-uniswap-uni/",
    "description": "Several altcoins are currently on the rise following Bitcoin’s resurgence, and popular crypto analyst Ali Martinez has singled out the Uniswap UNI token as one of those tokens that could rally further as he projects that UNI is set to break out soon from its current resistance level.  Why Uniswap Is Poised For A Breakout In a post shared on his X (formerly Twitter) platform, Martinez noted that the majority of UNI holders were positioned ‘Out of the Money,’ which suggests that the token was preparing for a breakout. Accompanying his post was data from the crypto analytics platform Intotheblock based on the ‘Historical In/Out of the Money’ metric. Related Reading: Bitcoin Bull Market: Crypto Spot Trading Volumes Climb To 8-Month Highs The data shows that over 75% of the token holders are ‘out of the money’, which means that they were yet to break even in their investments as the average cost price at which they bought these tokens is greater than its current price.  More addresses are out of the money &#124; Source: IntoTheBlock Furthermore, the crypto analyst explained that selling pressure has gotten exhausted and that the UNI token has been able to build “an important support” level at around $4. This could serve as a lift-off point for the altcoin. Key Supply Walls UNI Needs To Break To further support his breakout theory, Martinez noted two supply walls that UNI “needs” to overcome in order to signal a bullish breakout. According to him, one of these supply walls is at $4.23, where data from Intotheblock shows that 7,000 addresses have bought 14.24 million worth of UNI.  The other supply wall is at $4.45, where data from Intotheblock shows that 2,000 Uniswap addresses have accumulated 10.28 million worth of UNI. Whales and institutional players may also be aware of this potential breakout and may be looking to position themselves, as Martinez noted.  Related Reading: XRP Price Prediction: Analyst Points Out Incoming Mega Bounce, Here’s The Target The crypto analyst also recently commented on a potential Ethereum breakout. In a different post on his X platform, he said that the second largest cryptocurrency by market cap will need to overcome the huge supply wall at $1,960, where data from Intotheblock showed that 1.14 million addresses bought close to 33 million ETH. Meanwhile, Martinez believes that now is a good time for people to accumulate Bitcoin based on his examination of the past two cycles from the market bottom and the present Bitcoin trend. According to him, a similar trajectory points to the next Bitcoin market top being around October 2025. At the time of writing, the UNI token is trading at around $4.10, according to data from CoinMarketCap.  Uniswap looks ready for breakout &#124; Source: UNIUSDT on Tradingview.com Featured image from Shutterstock, chart from Tradingview.com"
  }
]