[
  {
    "source": "CoinDesk",
    "date": "2023-07-28T21:39:52.000Z",
    "title": "Sam Bankman-Fried's Attempts to Influence Witnesses Show He Must Be Jailed Before Trial: DOJ",
    "url": "https://www.coindesk.com/policy/2023/07/28/sam-bankman-frieds-attempts-to-influence-witnesses-show-he-must-be-jailed-before-trial-doj/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Sam Bankman-Fried's repeated efforts to contact witnesses and influence their testimony shows that \"no combination of conditions will reasonably assure the safety of the community,\" prosecutors said in a written filing calling for his bond to be revoked."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-28T21:51:52.000Z",
    "title": "Russia’s Bitcoin Mining Boom Amid Economic Sanctions",
    "url": "https://www.cryptoglobe.com/latest/2023/07/russias-bitcoin-mining-boom-amid-economic-sanctions/",
    "description": "Despite economic challenges, Russia is reportedly witnessing a boom in the Bitcoin mining sector, with hardware giants Bitmain and MicroBT ready to seize this opportunity. According to an article by Eliza Hkritsi for CoinDesk published earlier today, Russia is the leading recipient of mining machines globally. Historically, Russia’s affordable energy and cold climate have made […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-28T22:00:40.000Z",
    "title": "Why Worldcoin (WLD) And PEPE Dominate The Crypto Market Trends This Week",
    "url": "https://www.newsbtc.com/news/why-worldcoin-wld-and-pepe-dominate-the-crypto-market-trends-this-week/",
    "description": "Worldcoin and its native token WLD have been taking the attention of crypto investors, according to recent data from Coingecko. The project recently announced its worldwide launch inviting users to “visit the orb” and receive rewards by onboarding the platform. Related Reading: Bitcoin Rally May Not Resume Until This Happens WLD has doubled its value from its launch on July 24th, when the cryptocurrency was trading at around $1. The token rose to $2.19 the following week and has been moving sideways since amid a surge in controversy from different angles. Worldcoin (WLD) Leads Crypto Tendencies In addition to WLD, Coingecko shows that Bitcoin (BTC), Unibot (UNIBOT), Chainlink (LINK), HarryPotterObamaSonic10Inu, and Pepe Coin (PEPE) have been trending along with other tokens. Bitcoin remains the leader on this chart despite the crash in the BTC.D chart. This metric gauges the percentage of the crypto total market cap comprised solely of Bitcoin’s market capitalization. Often, when the chart trends to the upside, altcoins, such as Worldcoin (WLD) and PEPE, experience a drop in their prices and vice versa. In that sense, WLD’s launch came at a favorable time for small tokens. The project has promised a reward for every user willing to scan their eyeballs with one of the devices scattered around different countries. Thus, sparking controversy about their practices from the crypto community and regulators, some of which are already looking into the project’s legitimacy. Via his Twitter (X) account, Adam Cochran wondered if the hype around WLD is organic or fabricated by a marketing strategy. Cochran wrote: So either Worldcoin, or some group of Orb operators are legit paying plants to stand in line at orbs both for videos and to create demand for the orbs. Got pinged by an old marketing firm friend who does field event marketing, who was asking if Worldcoin is legit. PEPE Leads Trends In The United States While WLD took over the global attention in the nascent sector, PEPE Coin is still the king of the top trending tokens in 2023. Research conducted by Marketplace Fairness indicates that the token has been trending across 23 of the 50 states in the U.S., including Florida, California, and Texas. Related Reading: UK Regulator To Enquire About Worldcoin, As WLD Declines By 17% One Day Post-Launch The cryptocurrency was launched a few months ago but has already garnered more interest than Cardano (ADA), XRP, Litecoin (LTC), Dogecoin, etc. Most of these tokens only trended in 2 of the 50 states in the U.S. in 2023."
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-28T22:01:10.000Z",
    "title": "Republican Congressman Indicted for Role in ‘Nigerian Prince’ Fraudulent Crypto Scheme: The New York Times",
    "url": "https://dailyhodl.com/2023/07/28/republican-congressman-indicted-for-role-in-nigerian-prince-fraudulent-crypto-scheme-the-new-york-times/",
    "description": "<img width=\"810\" height=\"475\" src=\"https://dailyhodl.com/wp-content/uploads/2020/07/scammer-hood.jpg?w=810\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2020/07/scammer-hood.jpg 810w, https://dailyhodl.com/wp-content/uploads/2020/07/scammer-hood.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2020/07/scammer-hood.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2020/07/scammer-hood.jpg?resize=750,440 750w\" sizes=\"(max-width: 810px) 100vw, 810px\" /><p>A Republican Congressman has reportedly been indicted for his alleged role in the fraudulent “Nigerian Prince” crypto scam. According to a new report by The New York Times, George Santos, a U.S. Representative of New York, has been charged for allegedly perpetrating a scheme that resembles the classic Nigerian Prince email fraud. The report says [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/28/republican-congressman-indicted-for-role-in-nigerian-prince-fraudulent-crypto-scheme-the-new-york-times/\">Republican Congressman Indicted for Role in ‘Nigerian Prince’ Fraudulent Crypto Scheme: The New York Times</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]