[
  {
    "source": "Decrypt",
    "date": "2023-07-17T21:22:46.000Z",
    "title": "BlockFi CEO Knew About Shaky FTX Balance Sheet Before Collapse, Creditors Allege",
    "url": "https://decrypt.co/148942/blockfi-ftx-ftt-alameda-exposure-ceo-zac-prince",
    "description": "Zac Prince reportedly told his management team to “get comfortable” with Alameda despite its massive exposure to FTT."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-17T21:19:16.000Z",
    "title": "AI Could Bring ‘The Biggest Bubble of All Time’, Says Stable Diffusion Creator",
    "url": "https://decrypt.co/148938/ai-bubble-hype-investment-stability-stable-diffusion",
    "description": "What could be worse than a cataclysmic collapse of the market for tulips or jpeg monkeys? The bursting of a hype-filled AI bubble, of course."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-17T21:19:31.000Z",
    "title": "Bitcoin price falls under $30K as macro and regulatory worries take center stage",
    "url": "https://cointelegraph.com/news/bitcoin-price-falls-under-30k-as-macro-and-regulatory-worries-take-center-stage",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/44ee86a0-1114-4149-a06c-aecd2230a944.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>As investor’s euphoria over Bitcoin subsides, regulatory and macroeconomic headwinds resurface to negatively impact BTC price.</p>\n                    <p><p>Multiple data points point to Bitcoin price falling below $29,000 in the short term. </p><p>Yes, you read that right. </p><p>Let’s investigate the main issues contributing to the current downside in Bitcoin price.</p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) encountered difficulties breaking above $31,800 on July 13, resulting in a 6.3% correction down to $29,700 on July 17. The price action could reflect investors’ concerns that ongoing regulatory developments and macroeconomic headwinds could drive Bitcoin below the $29,000 level, which was last observed on June 21.</p><p>On the derivatives side, Bitcoin futures show increased demand, but Asian markets are slowing down.</p><p>Bitcoin quarterly futures typically trade at a slight premium compared to spot markets, reflecting sellers' willingness to receive more money in exchange for delaying settlement. Healthy markets generally exhibit BTC futures contracts trading at a 5% to 10% annualized premium, a situation known as contango, which is not unique to crypto markets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/500416ef-918c-464d-a455-2b507f388340.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 3-month futures premium. Source: Laevitas.ch</em></figcaption></figure><p>Between July 14 and July 17, BTC futures maintained a neutral-to-bullish 7% premium, surpassing the 5% threshold. This suggests moderate conviction among bulls following the unsuccessful attempt to break above $31,800.</p><p>However, the Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) premium in Asia has been declining. The stablecoin premium serves as an indicator of demand from China-based retail crypto traders, measuring the difference between peer-to-peer trades and the United States dollar.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/bc05ad56-c659-462c-8362-4c2682a73f68.png\"  /><figcaption style=\"text-align: center;\"><em>Tether (USDT) peer-to-peer vs. USD/CNY. Source: OKX</em></figcaption></figure><p>The Tether premium in Asia recently reached a discount of 1.8%, marking its lowest point in over six months. This inverse premium trend started on July 12 and has continued to widen, indicating moderate sell pressure.</p><h2>Regulatory worries continue to plague crypto </h2><p>Regulation of the crypto sector is also still on investors’ minds. Even the July 13 ruling that the sale of XRP via exchanges and OTC desks did not violate securities regulations did boost markets, the SEC's decision did not definitively determine whether XRP's initial coin offering (ICO) was <a href=\"https://cointelegraph.com/news/ripple-decision-is-troublesome-on-multiple-fronts-says-former-sec-official\">classified as a security offering</a>. This lack of clarity has left some investors uneasy, as it raises the possibility of other cryptocurrencies also facing potential securities designations.</p><p>In addition to the SEC's ruling on XRP, Binance also announced the<a href=\"https://cointelegraph.com/news/binance-headcount-reduction-hits-1-000-employees-report\"> layoff of 1,000 employees</a>. Although the exchange has refuted the reports and claimed routine resource reallocation and ongoing hiring, concerns have arisen regarding Binance's future following the departure of several key executives and the <a href=\"https://cointelegraph.com/news/sec-targeting-coinbase-binance-proxies-crypto\">ongoing court action</a> from the regulator.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-vs-ripple-referred-to-judge-who-ordered-hinman-documents-release\"><strong><em>SEC vs Ripple referred to judge who ordered release of ‘Hinman Documents’</em></strong></a></p><h2>Macroeconomic trends do not favor crypto </h2><p>The macroeconomic environment has not been favorable for Bitcoin and risk-on assets. China's GDP growth slowed to 6.3% in the second quarter, falling short of market expectations, with factors such as the ongoing trade war with the United States and the government's efforts to address debt contributing to the slowdown.</p><p>Considering the external factors and pending court decisions that could negatively impact the two largest exchanges, the odds of Bitcoin breaking below $29,000 have increased. This creates a favorable scenario for bears, causing the $30,000 resistance to gain strength.</p><h2>Bitcoin price could dip under $29,000 this week</h2><p>There appears to be no specific catalyst restricting Bitcoin's upside potential, aside from worsening macroeconomic conditions and indications of further interest rate increases by the Federal Reserve in 2023.</p><p>From a trading perspective, BTC futures show higher confidence among professional traders using leverage. However, the sell pressure from retail investors in Asia limits the overall upside for cryptocurrencies.</p><p>Considering the external factors and pending court decisions that could negatively impact the two largest exchanges, the odds of Bitcoin breaking below $29,000 have increased. This creates a favorable scenario for bears, causing the $30,000 resistance to gain strength.</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-17T21:35:56.000Z",
    "title": "Binance cuts employee benefits; hints at more layoffs as profits decline",
    "url": "https://cryptoslate.com/binance-cuts-employee-benefits-hints-at-more-layoffs-as-profits-decline/",
    "description": "<p>Crypto exchange Binance has reportedly cut employee benefits effective June 19, citing a declining profit margin, Wall Street Journal reported on July 17. The exchange stated that its workers would no longer get mobile-phone reimbursement, fitness reimbursement, and other staff-related bonuses. WSJ reported that Binance attributed its decision to the &#8220;current market environment and regulatory climate,&#8221; which has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-cuts-employee-benefits-hints-at-more-layoffs-as-profits-decline/\">Binance cuts employee benefits; hints at more layoffs as profits decline</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-17T21:30:03.000Z",
    "title": "G20’s FSB Pushes for Global Crypto Regulations and Standards Aiming to Curb Crypto ‘Spillover’ Risks",
    "url": "https://news.bitcoin.com/g20s-fsb-pushes-for-global-crypto-regulations-and-standards-aiming-to-curb-crypto-spillover-risks/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/g2089-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"G20&#039;s FSB Pushes for Global Crypto Regulations and Standards Aiming to Curb Crypto ‘Spillover’ Risks\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/g2089-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/g2089-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/g2089-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/g2089-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/g2089-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/g2089-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/g2089.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Monday, the Financial Stability Board (FSB), a product of the G20 organization, unveiled its proposed guidelines for a global regulatory structure overseeing the operations of crypto assets. The international entity emphasizes that nations should confront the risks cryptocurrencies pose to global financial stability. The FSB contends that occurrences within the preceding year have underscored [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-17T21:21:24.000Z",
    "title": "Canadian crypto hacker Soup allegedly stole over $1m in scams",
    "url": "https://crypto.news/canadian-crypto-hacker-soup-allegedly-stole-over-1m-in-scams/",
    "description": "A prominent crypto investigator ZachXBT has revealed that a Canadian hacker known as Soup (Dan) is the brain behind several high-profile phishing scams. The scams allegedly include Orbiter Finance’s Discord server security breach earlier this year and the Crypto Punk 6983&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-17T21:30:40.000Z",
    "title": "Uniswap Launches UniswapX Protocol, Sparking 3% Surge In UNI’s Price",
    "url": "https://www.newsbtc.com/analysis/uni/uniswap-launches-uniswapx-protocol-sparking-3-surge-in-unis-price/",
    "description": "Uniswap, the leading decentralized exchange (DEX), has announced the launch of UniswapX, a permissionless and open-source protocol for trading across automated market makers (AMMs) and other liquidity sources.  According to the announcement, UniswapX aims to improve self-custody swapping and grow on-chain trading by offering better prices through the aggregation of liquidity sources, gas-free swapping, protection against maximal extractable value (MEV), and no cost for failed transactions.  Uniswap Latest Protocol Launch  UniswapX addresses the growing complexity of on-chain routing and the fragmentation of liquidity pools resulting from the increasing number of customized pool designs.  The protocol outsources routing complexity to a network of third-party fillers who compete to fill swaps using on-chain liquidity like AMM pools or their private inventory. This allows swappers to use the Uniswap interface without worrying about getting the best price and ensures that transactions are always transparently recorded and settled on-chain. Related Reading: zkSync Unveils Boojum Upgrade: The Ultimate Solution For Scalability And Security? Per the announcement, gas-free swapping is a key feature of UniswapX. Swappers sign a unique off-chain order, which is then submitted on-chain by fillers who pay gas on the swappers&#8217; behalf.  This eliminates the need for swappers to pay gas or hold a chain&#8217;s native network token to trade. MEV protection is also provided by UniswapX, which returns MEV that would be left on the table to be captured by an arbitrage transaction to swappers through improved prices. UniswapX also has plans to launch a cross-chain version later this year that combines swapping and bridging into one seamless action.  This will provide users with the ability to exchange between different blockchain networks in a seamless and trustless manner. This is made possible through the use of bridges, which are specialized smart contracts that enable the transfer of assets between different blockchain networks. In addition, instead of receiving a bridge-specific token, users can choose which assets to receive on the destination chain.  Strong Resistance Causes UNI To Retract After the announcement of the launch of the UniswapX protocol, the price of Uniswap&#8217;s native token, UNI, experienced a surge of around 3%. UNI reached a high of $6.152, a level not seen since April 2023. The excitement generated by the launch of this new protocol led to a surge in demand for UNI, as traders anticipated improved user experience and better prices for on-chain trading. Related Reading: XRP Crosses 1 Million Trades Per Minute Following Court Ruling However, UNI faced a strong resistance line at this same level, causing the token to retrace and lose all the gains generated by the announcement. At present, UNI is trading at $5.738, down by 1.4% in the last 24 hours. Despite this recent dip, UNI has posted significant gains in the 30-day timeframe, with a staggering 28% profit. On the flip side, according to Token Terminal data, Uniswap&#8217;s market cap (circulating) currently stands at $4.76 billion, representing a 28.3% increase over the past 30 days. The market cap (fully diluted) is $5.77 billion, up 26.01% over the same period. Uniswap&#8217;s total value locked (TVL) is currently $3.67 billion, a decrease of 0.54% over the past 30 days. The price fees (P/F) ratio (fully diluted) stands at 17.50x, indicating that the market values Uniswap&#8217;s future earnings potential at a premium. Uniswap&#8217;s trading volume (annualized) is $349.19 billion, representing a decrease of 8.05%. In terms of user activity, Uniswap has had an average of 69.640 daily active users over the past 30 days, representing an increase of 2.7%.  Featured image from Unsplash, chart from TradingView.com "
  }
]