[
  {
    "source": "CoinDesk",
    "date": "2023-06-27T17:26:25.000Z",
    "title": "Web3 Payment Firm Crossmint Launches Wallet-as-a-Service to Expand NFT Use Cases",
    "url": "https://www.coindesk.com/web3/2023/06/27/web3-payment-firm-crossmint-launches-wallet-as-a-service-to-expand-nft-use-cases/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The new API will allow users to create smart contracts and send NFTs via email, with the infrastructure to generate backend wallets for NFT collectors."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-27T17:23:26.000Z",
    "title": "Nevada Places Crypto Custodian Prime Trust Into Receivership",
    "url": "https://www.coindesk.com/policy/2023/06/27/nevada-places-crypto-custodian-prime-trust-into-receivership/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Nevada's Financial Institutions Divisoin filed to appoint a receiver for crypto custodian on Prime Trust, the regulator announced on Tuesday."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-27T17:15:09.000Z",
    "title": "Jack Dorsey Questions Apple's Tim Cook Over Bitcoin Support as Damus Deplatforming Looms",
    "url": "https://www.coindesk.com/tech/2023/06/27/jack-dorsey-questions-apples-tim-cook-over-bitcoin-support-as-damus-deplatforming-looms/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Apple cited violations of its in-app purchase guidelines as the primary reason for the delisting, according to Damus founder William Casarin."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-27T17:33:36.000Z",
    "title": "Azuki Elementals NFT Drop Yields $38 Million in Just 15 Minutes",
    "url": "https://decrypt.co/146426/azuki-elementals-nft-drop-yields-38-million-in-just-15-minutes",
    "description": "All 10,000 Azuki Elementals NFTs offered for sale were snatched up during the presale, even in a weakened market."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-27T17:15:10.000Z",
    "title": "Judge says arguments behind SBF’s motions to dismiss criminal charges are ‘moot or without merit’",
    "url": "https://cointelegraph.com/news/judge-arguments-sam-bankman-fried-motion-dismiss-criminal-charges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/0902f35a-d5f6-4718-905e-baf5c17e5cce.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Former FTX CEO Sam Bankman-Fried will likely still face 13 criminal counts over two separate trials starting in October 2023 and March 2024.</p>\n                    <p><p>A federal judge overseeing the case against former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a> (SBF) has denied motions from his legal team seeking to dismiss all but three criminal charges against him.</p><p>In a June 27 filing in the United States District Court for the Southern District of New York, Judge Lewis Kaplan <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590940/gov.uscourts.nysd.590940.167.0_3.pdf\" target=\"_blank\" rel=\"noopener nofollow\">issued</a> a memorandum opinion on motions that would have stopped the discovery and disclosure of certain information related to SBF’s criminal case. Bankman-Fried’s legal team <a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-urges-court-to-dismiss-charges\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ftx-founder-sam-bankman-fried-urges-court-to-dismiss-charges/amp\">filed motions on May 8</a> aiming to have the judge dismiss 10 out of the 13 criminal counts he faces, which would have left only conspiracy to commit commodities fraud, conspiracy to commit securities fraud and conspiracy to commit money laundering.</p><p>The judge considered whether to dismiss 10 charges, which included wire fraud, conspiracy to commit wire fraud, and violations of campaign finance laws. He largely denied the basis for the motions, citing precedent from the U.S. Court of Appeals for the Second Circuit.</p><p>“Dismissal of charges ‘is an “extraordinary remedy” reserved only for extremely limited circumstances implicating fundamental rights,‘” said Kaplan. “The Second Circuit has deemed dismissal an ‘extreme sanction’ that has been upheld ‘only in very limited and extreme circumstances,’ and should be ‘reserved for the truly extreme cases,’ ‘especially where serious criminal conduct is involved.’”</p><p>The judge added in his conclusion:</p><blockquote>“The Court has considered all of the arguments of the parties. To the extent not addressed herein, the arguments are either moot or without merit.”</blockquote><p>Bankman-Fried will face all eight charges originally brought in December 2022, four <a href=\"https://cointelegraph.com/news/unsealed-superseding-indictment-against-sam-bankman-fried-includes-12-criminal-charges\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/unsealed-superseding-indictment-against-sam-bankman-fried-includes-12-criminal-charges/amp\">added in February 2023</a> as part of a superseding indictment, and one in March 2023 related to the former CEO allegedly bribing a Chinese government official. However, the last five counts will be addressed in a separate trial scheduled to start in March 2024 due to their addition following SBF’s extradition from the Bahamas. His first trial is scheduled to begin in October.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-two-criminal-trials\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ftx-founder-sam-bankman-fried-two-criminal-trials/amp\"><strong><em>FTX founder Sam Bankman-Fried now faces two criminal trials</em></strong></a></p><p>The former FTX CEO has pleaded not guilty to all charges. In December 2022, former Alameda Research CEO Caroline Ellison and FTX co-founder Gary Wang <a href=\"https://cointelegraph.com/news/caroline-ellison-gary-wang-plead-guilty-to-fraud-charges\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/caroline-ellison-gary-wang-plead-guilty-to-fraud-charges/amp\"></a><a href=\"https://cointelegraph.com/news/caroline-ellison-gary-wang-plead-guilty-to-fraud-charges\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/caroline-ellison-gary-wang-plead-guilty-to-fraud-charges/amp\">pleaded guilty to related federal fraud charges</a>. </p><p>Both the U.S. Securities and Exchange Commission and Commodity Futures Trading Commission are expected to bring civil lawsuits against SBF following the conclusion of his criminal trials. FTX’s bankruptcy case is also ongoing in the District of Delaware.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T17:30:49.000Z",
    "title": "Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices considering investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand&#8217;s price prediction from 2023 to 2032, its expected minimum price, and what it brings. For ... <a title=\"Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T17:20:59.000Z",
    "title": "Baidu’s Ernie Bot Outperforms OpenAI’s ChatGPT in Key Tests, Propelling AI Competition",
    "url": "https://www.cryptopolitan.com/ernie-bot-3-5-model-outperforms-chatgpt/",
    "description": "Baidu, the Chinese search engine, announced on Tuesday that its artificial intelligence model, Ernie 3.5, has surpassed OpenAI&#8217;s ChatGPT and GPT 4 in crucial areas, marking significant progress in the race for AI dominance. Baidu unveiled its Ernie Bot in March and has since been conducting public tests in China. The chatbot is built on ... <a title=\"Baidu&#8217;s Ernie Bot Outperforms OpenAI&#8217;s ChatGPT in Key Tests, Propelling AI Competition\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ernie-bot-3-5-model-outperforms-chatgpt/\" aria-label=\"More on Baidu&#8217;s Ernie Bot Outperforms OpenAI&#8217;s ChatGPT in Key Tests, Propelling AI Competition\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T17:26:41.000Z",
    "title": "Meme coins bullish: Shiba Inu, Dogecoin, and Alex The Doge free from SEC scrutiny",
    "url": "https://crypto.news/meme-coins-bullish-shiba-inu-dogecoin-and-alex-the-doge-free-from-sec-scrutiny/",
    "description": "Alex The Doge, Shiba Inu, and Dogecoin are bullish and away from the US SEC scrutiny. Even so, regulations in the future could change"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-27T17:30:23.000Z",
    "title": "PEPE Coin Shines Among Top Gainers, Tallies 78% In Last Week",
    "url": "https://www.newsbtc.com/analysis/pepe/pepe-coin-shines-among-top-gainers-tallies-78-in-last-week/",
    "description": "The Frog-themed meme coin, PEPE, has buckled up with high gains as the market sees recovery. The token bullishly rode on the positive wave of crypto community sentiments in the last week, adding 78% gains in seven days.  PEPE’s rally coincides with days of incredible performance across the crypto market. Bitcoin gained 15.03% last week, while the second-largest cryptocurrency by market cap, Ethereum, has scored 9.56% over the past seven days. Pepe Coin topped charts over the past few days and still maintains a 12.43% 30-day price increase among top-gaining coins despite a slight pullback. Possible Factors Behind Pepe Coin’s Price Moves As of the time of writing, Pepe Coin&#8217;s trading volume has declined slightly by 8.07%, suggesting the ongoing rally isn&#8217;t coming from inflows. PEPE traded with little liquidity due to the prevailing selling pressure from the previous downtrend. So the most plausible reason for the rally could be the Pepe developers who previously sold their pre-mines at high levels.  Related Reading: Bitcoin Holders Expect Retrace, Will BTC Move Against Crowd Once Again? The cash-out plus the recent market recovery could&#8217;ve catalyzed PEPE&#8217;s price rally. The bullish sentiment must have generated enough buzz to push the PEPE price since it is a community-driven token.  Pepe Hits Market With Unparalleled Performance Amid Heightened Volatility The frog-theme-inspired meme token hit the market with a disruptive wave, adding growth percentage in thousands, gaining it a front seat in the hearts of meme enthusiasts. However, the enthusiasm died down when the meme coin succumbed to a long dark tunnel of a bearish trend.  But that didn&#8217;t last too long, as PEPE quickly picked pace with substantial growth that saw its price rise to $0.00000164 on June 23. PEPE closed June 22 trading session at $0.00000138, with a 29.5% price increase after rallying 13% on June 21.  The meme token also scored a nearly 20% price increase over the weekend and 3.9% on Monday, June 26, when most coins traded sideways. These consecutive gains brought the token to a price of $0.00000165, with a 3.52% increase at press time. Besides the price rise, PEPE&#8217;s market cap-to-volume ratio has increased by 36.58% within a 24-hour time frame, according to CoinMarketCap data. PEPE has bounced above its primary support level at $0.0000013675 and is fighting to defend the $0.00000163 resistance level. A break above the current price position could trigger more rallies for the meme token. Irrespective of the meme coin’s incredible performance over the past few days, the bulls must press on to sustain the momentum. Otherwise, PEPE might plunge back into an all-time low. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T17:22:58.000Z",
    "title": "Chainlink Bulls on the Move: Analyst Predicts Major Rally as LINK Gains Momentum",
    "url": "https://www.crypto-news-flash.com/chainlink-bulls-on-the-move-analyst-predicts-major-rally-as-link-gains-momentum/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-bulls-on-the-move-analyst-predicts-major-rally-as-link-gains-momentum",
    "description": "Chainlink (LINK) has received a very positive price target from market analyst, Michaël van de Poppe. The positivity surrounding the oracle provider is fueled by DeFi and smart contract embrace. Looking at the spike in Chainlink&#8217;s (LINK) network activity, it is believed that the innovative oracle network that connects smart contracts to real-world data is [...]"
  }
]