[
  {
    "source": "Cointelegraph",
    "date": "2023-11-25T08:42:56.000Z",
    "title": "Nigeria’s Patricia Technologies relieved as arrest made in crypto wallet heist",
    "url": "http://cointelegraph.com/news/nigeria-patricia-technologies-relieved-as-arrest-made-in-crypto-wallet-heist",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/50227bfc-bfa7-49f3-a47e-653f85ad262f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Nigerian Police Force spokesperson said in the statement that Ambassador Wilfred Bonse has been arrested concerning the theft, conversion of cryptocurrency wallets, and unauthorized fund diversion from Patricia Technologies Limited.</p>\n                    <p><p>The Nigeria Police Force (NPF) said it has arrested one politician, Ambassador Wilfred Bonse, concerning the theft of over $246,153 (200 million naira) from Patricia Technologies’ crypto wallet.</p><p>The disclosure was made by ACP Olumuyiwa Adejobi, the Force Public Relations Officer, in a statement <a href=\"https://twitter.com/PoliceNG/status/1727933517105873394?s=20\" target=\"_blank\" rel=\"noopener nofollow\">issued</a> on Friday. It was reported that Bonse assisted hackers in laundering $61,538 (50 million naira) from the stolen funds.</p><p>He stated that the Force, via its National Cybercrime Center (NPF-NCCC), has achieved notable progress in probing an intricate financial fraud case reported by Patricia Technologies Limited. The case encompasses criminal conspiracy, unauthorized alteration of computer systems and network data, and the illicit diversion of funds exceeding $246,153 (200 million naira), as outlined in a petition submitted to the Inspector General of Police.</p><p>The NPF spokesperson said in the statement that Ambassador Wilfred Bonse has been arrested concerning the theft, conversion of cryptocurrency wallets, and unauthorized fund diversion from Patricia Technologies Limited. The petition detailed the alleged involvement of several individuals, and while some are still at large, Bonse has been apprehended. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">PRESS BRIEFING BY THE FORCE PUBLIC RELATIONS OFFICER, ACP OLUMUYIWA ADEJOBI ON ACHIEVEMENTS RECORDED BY THE NPF-NCCC<br><br>NPF-NCCC ARRESTS ONE WILFRED BONSE IN CONNECTION WITH PATRICIA SECURITY BREACH AND COMPLEX FINANCIAL FRAUD<br><br>Similarly, the NPF-NCCC has made significant strides…</p>&mdash; Nigeria Police Force (@PoliceNG) <a href=\"https://twitter.com/PoliceNG/status/1727933517105873394?ref_src=twsrc%5Etfw\">November 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>He is accused of conspiring to launder $61,538 (50 million naira) from the fraudulent diversion of $747,076 (607 million naira) from Patricia Technology’s account to his bank account through a cryptocurrency wallet. The investigation is ongoing, and the Nigeria Police Force assures all involved individuals will be brought to justice.</p><p>The arrest linked to the Patricial Technologies heist brings potential relief to the crypto trading company. Patricia Technologies <a href=\"https://cointelegraph.com/news/crypto-nigerian-crypto-exchange-s-token-launch-draws-scrutiny\">faced significant scrutiny after a hacking incident</a> earlier this year resulted in the loss of billions in customer funds.</p><p>Responding to customer requests, Patricia <a href=\"https://cointelegraph.com/news/crytpo-token-nigeria-s-patricia-crypto-exchange-seeks-to-explain-its-token-amid-confusion\">converted the value of customer assets into Patricia Tokens</a>, assuring repayment in the future. A White Paper attributed this move to a cyberattack that resulted in asset loss. Patricia emphasized its dedication to integrity and customer trust, <a href=\"https://cointelegraph.com/news/patricia-exchange-ceo-announces-debt-restructuring-via-convertible-notes\">introducing the Patricia Token as an internal customer holding</a>.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/nigeria-nitda-advocates-ai-integration-payments-global-recognition\"><strong><em>Nigeria’s NITDA advocates AI integration in payments for global recognition</em></strong></a></p><p>As per the firm, the Token is committed to reimbursing holders with 1 USDT for each Patricia Token, ensuring asset recovery post the security breach. Patricia clarified that the Patricia Token is not on-chain but functions as an internal token, representing debt and managed by the company.</p><p>To appease its concerned clients, Patricia Technologies <a href=\"https://twitter.com/PatriciaSwitch/status/1717073898880094651\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> in October that it had enlisted DLM Trust as an escrow agent for distributing customer repayments. Despite DLM’s withdrawal due to disagreements, Patricia Technologies intends to proceed with the repayment schedule this month.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-crypto-deaths/\"><strong><em>Big Questions: What’s with all the crypto deaths? </em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-25T08:44:39.000Z",
    "title": "TIES CAPITAL GLOBAL Launches Innovative Cryptocurrency Trading Platform, Redefining Possibilities for Traders",
    "url": "https://cryptodaily.co.uk/2023/11/ties-capital-global-launches-innovative-cryptocurrency-trading-platform-redefining-possibilities-for-traders",
    "description": "TIES CAPITAL GLOBAL Launches Innovative Cryptocurrency Trading Platform, Redefining Possibilities for Traders"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-25T08:49:50.000Z",
    "title": "UK Businesses Struggle with Digital Transformation: A Deep Dive into Data Management Challenges",
    "url": "https://www.cryptopolitan.com/uk-struggle-with-data-management-challenges/",
    "description": "In the era of rapid technological evolution, UK businesses face a critical juncture in managing customer data. Recent research reveals a surprising reluctance among business owners to adopt online records management tools. A notable 31% have never used such tools, citing high costs (37%), security concerns (16%), and apprehension towards system usage (over 12%). This ... <a title=\"UK Businesses Struggle with Digital Transformation: A Deep Dive into Data Management Challenges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-struggle-with-data-management-challenges/\" aria-label=\"More on UK Businesses Struggle with Digital Transformation: A Deep Dive into Data Management Challenges\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-25T08:48:11.000Z",
    "title": "Bitcoin Price Rockets Past $38,000, Hits Highest Peak Since May 2022 – Details",
    "url": "https://www.newsbtc.com/news/bitcoin-price-rockets-past-38000-hits-highest-peak-since-may-2022-details/",
    "description": "In a dramatic twist, a mere 48 hours after the United States laid out a hefty $4.3 billion settlement proposal with the major player in the crypto market, Binance, Bitcoin price defied expectations by catapulting to a new peak for the year. Breaking the $38,000 barrier in the early stages of the New York trading session on Friday, the cryptocurrency sector, witnessed the long-anticipated surge. Bitcoin&#8217;s recent consolidation within a pennant pattern had hinted at the prospect of a bullish upswing, and it seems those predictions have materialized. Related Reading: BLUR Token Rules Today’s Top 100 Crypto Ranking With 88% Rally – Details Bitcoin Price Hits Highest Peak Since 2022 Bitcoin&#8217;s rally also occurred following the Thanksgiving holiday in the US, marking its highest point since May 2022. This surge took place in the face of subdued activity in conventional markets. Although the top coin has experienced a slight pullback, it still holds a 1.5% gain for the day. Traders are incredibly excited by Friday&#8217;s surge in Bitcoin&#8217;s price, which has rekindled the fear of missing out (FOMO) feeling. Because of this spike, Bitcoin may be able to reach the next major resistance level, which is located at about $42,000, in the next few weeks. Still so far, so good on #Bitcoin. Slowly grinding upwards to a new resistance point and a break above $38K immediately means $40K is next. pic.twitter.com/3ZUkS72I6g — Michaël van de Poppe (@CryptoMichNL) November 24, 2023 Some market watchers are optimistic about its short-term trajectory, with trader Michael Van Pope suggesting in a tweet that the next milestone for Bitcoin is set at $40,000. The US Department of Justice and Binance reached an agreement, which is undoubtedly the most significant development of the month. Changpeng Zhao was forced to resign as the CEO of the company, and the exchange was forced to pay a punishment totaling around $4.3 billion. Binance, the biggest cryptocurrency exchange in the world, has named Richard Teng as its new CEO. Bitcoin poised to reclaim the $38K territory today. Chart: TradingView.com Bitcoin Circulating Supply In Profit Region A recent uptick in market liquidations is another important component impacting the Bitcoin price. Long and short position liquidations have increased significantly across different time frames, with a total of $80.29 million in liquidations in the last 24 hours, according to statistics from Coinglass. Related Reading: Analyst’s Crystal Ball: XRP Bulls Eyeing $40 Price Target, Despite Doubts Source: Coinglass In a related development, during last week&#8217;s gain, the proportion of Bitcoin&#8217;s circulating supply that is currently in profit hit 84%, or 16.36 million BTC. Additionally, Glassnode noted that this is historically noteworthy because it is significantly higher than the 74% all-time mean number. With #Bitcoin trading at yearly highs above $37k last week, over 83% of the coin supply was driven back into profitable territory. However, the magnitude of unrealized profit remains modest, and is not yet sufficient for long-term investors to divest.https://t.co/IGJpglF20J — glassnode (@glassnode) November 22, 2023 Meanwhile, further fueling the positive outlook is the heightened expectation surrounding the potential approval of spot bitcoin exchange-traded funds (ETFs) by the US Securities and Exchange Commission. With a looming deadline of January 10, the SEC is tasked with evaluating numerous pending applications for these ETFs. If given the green light, these ETFs are poised to provide investors with a more cost-effective avenue to tap into the Bitcoin market, adding another layer of optimism to the current bullish sentiment. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Freepik"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-25T08:59:52.000Z",
    "title": "Polygon Village Relaunches with $110 Million in MATIC Grants, Mentorship, and Ecosystem Support",
    "url": "https://www.crypto-news-flash.com/polygon-village-relaunches-with-110-million-in-matic-grants-mentorship-and-ecosystem-support/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-village-relaunches-with-110-million-in-matic-grants-mentorship-and-ecosystem-support",
    "description": "<img width=\"960\" height=\"540\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-768x432.jpg 768w\" sizes=\"(max-width: 960px) 100vw, 960px\" />Lugano, Switzerland, has integrated Polygon into its MyLugano crypto payment app, enhancing its cryptocurrency capabilities. The city is launching an NFT collection based on local art, including a Yuri Catania mural demonstrating its commitment to blockchain technology. The Swiss city of Lugano has significantly enhanced its cryptocurrency payment capabilities by integrating Polygon into its municipal [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-25T08:58:33.000Z",
    "title": "Kaspa (KAS) Rise Sparks Analysts’ Interest; Celestia (TIA) and InQubeta (QUBE) Ready for Big Gains",
    "url": "https://www.crypto-news-flash.com/kaspa-kas-rise-sparks-analysts-interest-celestia-tia-and-inqubeta-qube-ready-for-big-gains/?utm_source=rss&utm_medium=rss&utm_campaign=kaspa-kas-rise-sparks-analysts-interest-celestia-tia-and-inqubeta-qube-ready-for-big-gains",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-66.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-66.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-66-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-66-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Analysts are constantly looking for promising opportunities in the decentralized cryptocurrency list that could mirror the monumental rallies witnessed in the past. Owing to the steady and rapid price rise of Kaspa (KAS) for a while now, this crypto has sparked the interest of some renowned analysts. These analysts have watched the project&#8217;s development and [...]"
  }
]