[
  {
    "source": "Cointelegraph",
    "date": "2023-09-08T06:03:09.000Z",
    "title": "Decentralized Infura launch within months, Web2 cloud giants may join: Consensys",
    "url": "https://cointelegraph.com/news/decentralized-infura-to-launch-first-phase-within-months",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/b23c58ae-8c3a-4f12-9da7-3627f7a4bfcb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Decentralized Infura will consist of Infura and a decentralized market of other third-party data providers. </p>\n                    <p><p>Decentralized Infura will launch by the end of the year — with major Web2 cloud providers set to become part of the network — according to Consensys head of strategy Simon Morris at Korean Blockchain Week. </p><p>“We're looking to launch something later this year, but then there's going to be what they call a federated phase that they're expecting to like to last of the order of six months,” said Morris in an interview with Cointelegraph, referring to a trial period while the network was still under centralized control.  </p><p>Infura is the access point for most DApps to access real-time on-chain data from the Ethereum blockchain, but given it is controlled solely by Consensys, it provides a single point of failure. In November 2020, the MetaMask wallet <a href=\"https://coinmarketcap.com/alexandria/article/ethereums-infura-iating-outage-revives-decentralization-concerns\" target=\"_blank\" rel=\"noopener nofollow\">stopped</a> working when Infura went down, and centralized exchanges and DeFi projects were affected too. Infura also came under fire from some users for complying with U.S. sanctions against Tornado Cash, but as a U.S.-based company, there is little else Consensys could do. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">2/x<br><br>Infura launched in 2016 with one mission: to make it easy for Web3 developers to access Ethereum and build the future they want to live in. <br><br>Infura was the first blockchain API service of its kind. </p>&mdash; Infura (@infura_io) <a href=\"https://twitter.com/infura_io/status/1570794319539478528?ref_src=twsrc%5Etfw\">September 16, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Work is well advanced on setting up a decentralized marketplace of up to five different data providers who can perform a similar role to Infura but are distributed around the world. Infura itself will become just one of the providers in the network. </p><p>This will make access to Ethereum more reliable and censorship-resistant as DApps won’t <a href=\"https://cointelegraph.com/news/infura-is-to-blame-for-metamask-s-violation-of-the-crypto-spirit\">need to rely on a single data service provider</a> located in one jurisdiction, said Morris. </p><blockquote>“If you have different people setting up their infrastructure in different ways on different cloud providers using different node software, then you can start to build antifragility into [the system].”</blockquote><p>The end goal is to build a TCP IP-like architecture that can’t be regulated, says Morris:</p><blockquote>“You can't regulate TCP IP, but you can certainly regulate the providers. So we’re trying to create a new architecture of Web3 with how it can grow [...] then our role within it [...] is to drive that paradigm shift.”</blockquote><p>Morris said both crypto native companies, and large Web2 cloud providers were keen to join, but did not expressly confirm that Google Cloud or AWS are in negotiations with Consensys. </p><p>\"There's interest from both of them [Web2 and Web3 providers]. I mean, they kind of see this as a novel, kind of potential source of a huge amount of business in the future.\"</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/web3-startups-queue-up-consensys-startup-program-partners-with-cointelegraph-accelerator\"><strong><em>Web3 startups queue up: Consensys Startup Program partners with Cointelegraph Accelerator </em></strong></a></p><p>He added the federated stage was necessary to iron out the bugs and get the system working properly while still under centralized control — whether Consensys or a new body is yet to be determined. It is expected to transition into a permissionless marketplace of data providers sometime in 2024.</p><p>Decentralizing Infura blockchain’s data providers is crucial because monopolies may be shut down by a single court order. For a Web3 wallet like MetaMask relying on Infura for data, this could have serious repercussions.</p><p>The decentralized version of Infura could governed either by a decentralized autonomous organization (DAO) or a foundation, the firm’s chief strategist added.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/chinese-police-web3-blockchain-centralization-continues-asia-express/?doing_wp_cron=1691052881.1558809280395507812500\"><strong><em>Chinese police vs. Web3, blockchain centralization continues: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-08T05:48:02.000Z",
    "title": "Aussie fintech prays for crypto clarity as it launches Bitcoin-backed loans",
    "url": "https://cointelegraph.com/news/block-earner-hopes-for-crypto-clarity-bitcoin-backed-loans",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/81fef7c5-bb09-45c2-804e-134358fb847e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Block Earner has unveiled a new crypto-backed loan product for the Australian market, amid an ongoing tussle with a federal regulator over its shuttered Earn product.</p>\n                    <p><p>Australian fintech firm Block Earner is charging ahead with plans to launch a crypto-backed loans product, despite staring down an upcoming court date with the financial regulator for allegedly offering financial products without a license. </p><p>The new crypto loan product allows Australian crypto investors to use crypto as collateral to borrow cash. Similarly, a Colorado-based lending platform called SALT offers crypto-backed loans to U.S. clients. The major cryptocurrency exchange Coinbase <a href=\"https://cointelegraph.com/news/coinbase-to-cease-issuing-new-bitcoin-backed-loans-via-borrow-service\">once offered a similar service</a> to its U.S. customers but shuttered it in May this year. </p><p>The initial rollout from Block Earner is expected at the end of September and will initially only allow loans using Bitcoin as collateral. </p><p>Block Earner co-founder Charlie Karaboga told Cointelegraph that the new loan products have been designed in a “very conservative way” in a bid to fit neatly into an existing licensing model.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Australia&#39;s 1st Crypto-Backed Loans<br><br>Borrow Australian dollars without selling your crypto, using your <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> or Ethereum as security<br><br>The first 1000 waitlist sign ups enjoy their first 30 days interest free*<br><br>Join the Waitlist <a href=\"https://t.co/cfbRiiuSwr\">https://t.co/cfbRiiuSwr</a><br><br>Thread ⬇️ <a href=\"https://t.co/V55z5BXfOa\">pic.twitter.com/V55z5BXfOa</a></p>&mdash; Block Earner (@blockearner) <a href=\"https://twitter.com/blockearner/status/1699597875452539055?ref_src=twsrc%5Etfw\">September 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Karaboga’s firm was burned in November last year, after it was sued by the Australian Securities and Investments Commission (ASIC) for allegedly offering crypto-linked fixed-yield earning products without an Australian Financial Services (AFS) license.</p><p>At the time, <a href=\"https://cointelegraph.com/news/block-earner-ceo-calls-for-licensing-clarity-after-being-sued-for-crypto-products\">Karaboga lashed out against the regulator</a> for its lack of clarity, claiming that his firm had spent considerable time and resources building out products he believed were compliant with ASIC’s existing guidelines. </p><blockquote>“Our position remains the same. There is no clear regulation in Australia.”</blockquote><p>“Like any company in the fintech ecosystem, before we launched the product we got legal opinions. We think that there was no sufficient regulation, or sufficient licenses for us to apply,” Karaboga added. </p><p>However, Charlie said that the regulatory moves against Block Earner and competitor crypto company Finder were largely reactive, and likely due to the <a href=\"https://cointelegraph.com/news/ftx-collapse-the-crypto-industry-s-lehman-brothers-moment#:~:text=Eric%20Chen%2C%20CEO%20and%20co,liabilities%20far%20exceeded%20their%20assets.\">FTX crash</a> in November. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">&quot;ASIC has commenced civil penalty proceedings in the Federal Court against fintech company Block Earner alleging it provided unlicensed financial services in relation to its crypto-asset based products...&quot; <a href=\"https://t.co/MpgKojxRRG\">https://t.co/MpgKojxRRG</a> <a href=\"https://twitter.com/hashtag/cryptolaw?src=hash&amp;ref_src=twsrc%5Etfw\">#cryptolaw</a></p>&mdash; Aaron Lane (@AMLane_au) <a href=\"https://twitter.com/AMLane_au/status/1595499006054088704?ref_src=twsrc%5Etfw\">November 23, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“We were impacted, unfortunately, most likely probably because we were more visible with our product compared to others, because they were using as an ancillary product, whereas we were using a core product.”</p><p>Despite being unaffected by the fallout of FTX, in the wake of ASIC’s legal action, Karaboga said he closed the company’s “earn” products and paid back all users. </p><p>The company appears to have learnt its lesson. James Coombes, head of business at Block Earner said the new launch won’t see the same fate as their Earn product, as it already fits within the rules of an Australian credit license. </p><p>“There is a core difference,” said Coombes. “The Earn product — there was no clear guidance on whether or not a license was required, and that’s why we hold a conflicting view. Whereas this one, the clear guidance is that a license is required to provide consumer credit. So we went and got the license.”</p><h3>Hopes for clarity</h3><p>Looking forward, Karaboga said that faster regulatory progression in jurisdictions such as Singapore, Hong Kong and the United Kingdom will pressure the Australian government to catch up, or risk losing market share of crypto enterprises. </p><blockquote>“I’m expecting within 12 to 18 months, we’ll see some more clarity.”</blockquote><p>Karaboga explained that because Australia is one of the wealthiest countries by way of per-capita GDP and because Australians were “early starters” in the crypto industry, its citizens had become prime targets for scammers.</p><p>Ultimately, Karaboga asserted that domestic regulators are firmly pro-crypto and want to “push that innovation” moving forward. </p><p>This is a view that was shared by Binance Australia General Manager Ben Rose <a href=\"https://cointelegraph.com/news/binance-australia-head-confident-positive-crypto-regulation\">who recently told Cointelegraph he was confident</a> Aussie regulators would side with crypto in the long-term. </p><p>As recently as Sept. 6, Coinbase listed Australia <a href=\"https://cointelegraph.com/news/coinbase-near-term-priorities-eu-canada-brazil-singapore-australia\">as one of its primary locations for expansion</a> outside of the U.S. </p><p>Block Earner’s Federal Court hearing is scheduled for November this year, with a decision to be handed down by January 2024. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T06:01:38.000Z",
    "title": " Protecting Minors Online: A.I. Exploitation Expert Commission Takes Shape",
    "url": "https://www.cryptopolitan.com/a-i-exploitation-expert-commission/",
    "description": "In an endeavor to combat the disturbing misuse of artificial intelligence (A.I.) in cases related to child exploitation, South Dakota&#8217;s Attorney General, Marty Jackley, is leading a collective initiative. Alongside 53 fellow attorneys general from various states across the U.S., he has formally announced the establishment of an A.I. Exploitation Expert Commission. This unified effort ... <a title=\" Protecting Minors Online: A.I. Exploitation Expert Commission Takes Shape\" class=\"read-more\" href=\"https://www.cryptopolitan.com/a-i-exploitation-expert-commission/\" aria-label=\"More on  Protecting Minors Online: A.I. Exploitation Expert Commission Takes Shape\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T05:40:00.000Z",
    "title": "Coding a Poker Game Masterpiece with ChatGPT Assistance",
    "url": "https://www.cryptopolitan.com/coding-poker-game-chatgpt-assistance/",
    "description": "In the world of programming, the partnership between humans and artificial intelligence (AI) has continued to evolve. The innovative endeavor undertaken by Volos Projects exemplifies the harmonious convergence of artificial intelligence, specifically the ChatGPT framework, with the realm of software development.&#160; This ambitious undertaking revolves around the conception and execution of a digital poker game ... <a title=\"Coding a Poker Game Masterpiece with ChatGPT Assistance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coding-poker-game-chatgpt-assistance/\" aria-label=\"More on Coding a Poker Game Masterpiece with ChatGPT Assistance\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-08T05:45:36.000Z",
    "title": "J.P. Morgan Launches Crypto-Based Deposit Token for Faster International Payments – Will Ripple and XRP Be the Backbone for This Trillion-Dollar Market Opportunity?",
    "url": "https://www.crypto-news-flash.com/j-p-morgan-launches-crypto-based-deposit-token-for-faster-international-payments-will-ripple-and-xrp-be-the-backbone-for-this-trillion-dollar-market-opportunity/?utm_source=rss&utm_medium=rss&utm_campaign=j-p-morgan-launches-crypto-based-deposit-token-for-faster-international-payments-will-ripple-and-xrp-be-the-backbone-for-this-trillion-dollar-market-opportunity",
    "description": "<img width=\"1280\" height=\"960\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-768x576.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />JPMorgan is making strides in the realm of digital finance with the development of blockchain-based deposit tokens. These tokens are designed to expedite settlements and payments for corporate clients and may introduce competition into the crypto tokens market. In recent news on September 8th, JPMorgan is on the cusp of a groundbreaking development in digital [...]"
  }
]