[
  {
    "source": "Decrypt",
    "date": "2023-11-17T01:04:38.000Z",
    "title": "AI Is Making People ‘Question Their Own Reality’: Chelsea Manning",
    "url": "https://decrypt.co/206449/chelsea-manning-web-summit-ai-technology-privacy",
    "description": "Manning highlighted the clash between humans and technology at Lisbon's Web Summit, questioning AI's rapid development."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-17T00:56:31.000Z",
    "title": "Emu Video and Emu Edit: Meta Debuts AI Models for Video and Images",
    "url": "https://decrypt.co/206440/emu-video-edit-meta-ai-video-generation-image-editing",
    "description": "The social giant’s latest tools can conjure stunning visuals from text, setting up a generative AI showdown."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-17T01:03:00.000Z",
    "title": "XRP Relisted on Major Cryptocurrency Exchange After Moving up 85% Year-to-Date",
    "url": "https://www.cryptoglobe.com/latest/2023/11/xrp-relisted-on-major-cryptocurrency-exchange-after-moving-up-85-year-to-date/",
    "description": "A major cryptocurrency trading platform has recently relisted the native token of the XRP Ledger, XRP, after delisting the cryptocurrency in the wake of the U.S. Securities and Exchange Commission’s lawsuit against Ripple alleging it was a security. In a new announcement, popular cryptocurrency exchange CEX.IO has announced that XRP is now once again available […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-17T01:00:04.000Z",
    "title": "Vivek Ramaswamy Reveals Crypto Policy Framework — Plans to Roll Back Most of SEC Crypto Regulations",
    "url": "https://news.bitcoin.com/vivek-ramaswamy-reveals-crypto-policy-framework-plans-to-roll-back-most-of-sec-crypto-regulations/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/vivek-crypto-policy-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Vivek Ramaswamy Reveals Crypto Policy Framework — Plans to Roll Back Most of SEC Crypto Regulations\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/vivek-crypto-policy-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/vivek-crypto-policy-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/vivek-crypto-policy-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/vivek-crypto-policy-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/vivek-crypto-policy-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/vivek-crypto-policy-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/vivek-crypto-policy.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S. presidential candidate Vivek Ramaswamy has unveiled his “Three Freedoms of Crypto” policy framework. He stated that as President, he will ensure that innovative sectors, including crypto, are “liberated from the shackles of the unconstitutional shadow government.” He expects to rescind most, if not all, of the U.S. Securities and Exchange Commission (SEC) regulations that [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-17T01:00:06.000Z",
    "title": "Dogecoin Is Literally Going To The Moon: 100% DOGE Price Blast Expected",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-to-the-moon/",
    "description": "‘Dogecoin to the moon’ is a saying that anyone in the crypto community is familiar with. This is usually said figuratively in relation to the DOGE price actually surging. But Dogecoin is now actually headed to the moon &#8211; literally &#8211; after the official account confirmed the first DOGE space mission. Strap In: Dogecoin Is Headed To The Moon On Thursday, November 16, the official Dogecoin account on X (formerly Twitter, confirmed that a mission that will be taking the meme coin to the moon has now been confirmed. The mission is being orchestrated by Astrobotic Technology, a robotics company headquartered in Pennsylvania. Related Reading: Bitcoin Price Is Up Despite SEC Delay, Is The Spot ETF Decision Priced In Already? The details of the mission included in the post include the fact that a physical Dogecoin is being included in the DHL Moonbox via ULA&#8217;s Vulcan Centaur Rocket which is set to take off on December 24, 2023. The DHL Moonbox is a memento box that carries different keepsakes to take to the moon. More info, with the physical dogecoin travelling in the &#8220;MoonBox&#8221; https://t.co/aS1zGvb0if pic.twitter.com/L7WUhg3aIj — Dogecoin (@dogecoin) November 16, 2023 According to data from Astrobotic Technology, the DHL Moonbox headed to the moon in December has been filled with items from all around the world, including the United States, Germany, Canada, etc. Upon the completion of the mission, DOGE will be the first cryptocurrency to be sent to the moon, marking an important milestone for the meme coin. DOGE price surges as news spreads &#124; Source: DOGEUSD On Tradingview.com DOGE Price Ready To Double The Dogecoin price is already in a position where it is expected to surge. But the confirmation of the Dogecoin on the moon mission has added fuel to the fire. Following the announcement, the DOGE price jumped above $0.83 for the first time in four years. Crypto analyst Crypto Kaleo earlier shared an analysis of the Dogecoin price that puts it above $0.15. According to Kaleo, DOGE is expected to move very fast and will hit $0.09 to $0.1 first, before continuing on to the $0.15 target. Related Reading: ‘Vitalik Slept On My Couch &#38; Copied My Inventions’ Ethereum Insider Says Kaleo bases his analysis on the DOGE/BTC chart where he says; “I&#8217;m just looking for a touch of HTF resistance on the BTC pair around 550 sats.” This is apparently the confirmation of the rally that the crypto analyst thinks could possibly push the price to $0.2. Here&#8217;s my playbook for $DOGE: Sometime in the next week or two, Dogecoin finally starts to move. When DOGE starts moving higher, it usually moves pretty fast. I wouldn&#8217;t be surprised to see a daily from here to somewhere in the 9 &#8211; 10 cents range, chop there for a bit, then… pic.twitter.com/BN1AqSe8d2 — K A L E O (@CryptoKaleo) November 9, 2023 Dogeocoin’s daily volume is already up more than 50% in the last day alone, suggesting a higher level of interest from investors. Once sellers&#8217; fatigue kicks in and demand rises, DOGE could clear the $0.09 level before the end of the day. At the time of this writing, the DOGE price is sitting at $0.0804, with 7.86% gains in the last day. It is the 9th-largest cryptocurrency in the market with a market cap of $11.4 billion. Featured image from Stock Buys, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-17T01:00:31.000Z",
    "title": "Crypto Whale Deposits Over $4,000,000 Worth of DYDX to Kraken After 117% Rally in a Month",
    "url": "https://dailyhodl.com/2023/11/16/crypto-whale-deposits-over-4000000-worth-of-dydx-to-kraken-after-117-rally-in-a-month/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/whale-over-dydx-after.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/whale-over-dydx-after.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/whale-over-dydx-after.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/whale-over-dydx-after.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/whale-over-dydx-after.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/whale-over-dydx-after.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/whale-over-dydx-after.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto whale deposited more than $4 million worth of dYdX (DYDX) to the crypto exchange Kraken on Monday as the asset&#8217;s price pumped, according to the blockchain tracker Lookonchain. DYdX is a decentralized derivatives exchange. The project&#8217;s native token surged by 30% on Monday, the day the whale made the deposit. The whale would [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/16/crypto-whale-deposits-over-4000000-worth-of-dydx-to-kraken-after-117-rally-in-a-month/\">Crypto Whale Deposits Over $4,000,000 Worth of DYDX to Kraken After 117% Rally in a Month</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]