[
  {
    "source": "Decrypt",
    "date": "2023-08-15T06:00:45.000Z",
    "title": "Crypto Custodian Prime Trust Files for Bankruptcy",
    "url": "https://decrypt.co/152508/prime-trust-chapter-11-bankruptcy",
    "description": "A former Bank of Nevada president will oversee the Chapter 11 process, which may include the sale of all remaining Prime Trust assets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-15T05:45:19.000Z",
    "title": "Singapore central bank releases regulatory framework for stablecoins",
    "url": "https://cointelegraph.com/news/singapore-central-bank-releases-regulatory-framework-for-stablecoins",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/4d1469bf-13de-4b69-ab51-6197843d54b4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The framework outlines requirements for stablecoin issuers to meet to be deemed as regulated by the Monetary Authority of Singapore.</p>\n                    <p><p>Singapore's central bank has released a revised regulatory framework aimed at ensuring stability for single-currency stablecoins regulated in the city-state.</p><p>The Monetary Authority of Singapore <a href=\"https://www.mas.gov.sg/news/media-releases/2023/mas-finalises-stablecoin-regulatory-framework\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> the framework on Aug. 15 and said it will police single-currency stablecoins (SCS) pegged to the value of the Singapore dollar or G10 currencies such as the euro, British pound and United States dollar.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/da3f8910-66ef-4cec-988a-6e560b7a7812.PNG\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Excerpt from statement regarding its stablecoin regulatory framework. Source: MAS</em></figcaption></figure><p>“MAS’ stablecoin regulatory framework aims to facilitate the use of stablecoins as a credible digital medium of exchange, and as a bridge between the fiat and digital asset ecosystems,\" said the bank's deputy managing director of financial supervision Ho Hern Shin.</p><p>\"We encourage SCS issuers who would like their stablecoins recognized as 'MAS regulated stablecoins' to make early preparations for compliance,” Shin added.</p><p>The framework outlines several requirements that stablecoin issuers would have to adhere to, including timely redemptions and robust reserve management, among others: </p><ul><li>Value stability: Reserve assets will be subject to requirements relating to their composition, valuation, custody and audit, to give a high degree of assurance of value stability.</li><li>Capital: Stablecoin issuers must maintain minimum base capital and liquid assets to reduce the risk of insolvency and enable an orderly wind-down of business if necessary.</li><li>Redemption at Par: Issuers must return the par value of the stablecoins to holders within five business days from a redemption request.</li><li>Disclosure: Issuers must provide appropriate disclosures to users, including information on the SCS’ value stabilizing mechanism, rights of SCS holders, as well as the audit results of reserve assets.</li></ul><p>MAS noted only stablecoin issuers that fulfill the requirements under the framework will be able to apply to become MAS-regulated.</p><p>\"This label will enable users to readily distinguish MAS-regulated stablecoins from other digital payment tokens, including 'stablecoins' which are not subject to MAS’ stablecoin regulatory framework,\" it said.</p><p>It also warns any person that represents a token as being MAS-ceritified would be subject to penalties set out in the new framework, along with being added to an alert list. </p><p>The revised regulatory framework accounts for feedback from an October 2022 public consultation.</p><p><strong><em>Asia Express: <a href=\"https://cointelegraph.com/magazine/chinas-risky-bitcoin-court-decision-is-huobi-in-trouble-or-not-asia-express/\">China’s risky Bitcoin court decision, is Huobi in trouble or not? </a></em></strong></p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T05:45:14.000Z",
    "title": "Binance seeks court injunction against SEC’s extensive probes",
    "url": "https://www.cryptopolitan.com/binance-seeks-court-injunction-against-secs-extensive-probes/",
    "description": "Binance, the leading cryptocurrency exchange, has approached the court for a protective injunction. This move directly responds to what Binance labels a “fishing expedition” by the Securities and Exchange Commission (SEC). Significantly, the SEC&#8217;s discovery requests and deposition summons, dated August 14, have raised eyebrows in the crypto community. Binance emphasized its commitment to transparency, ... <a title=\"Binance seeks court injunction against SEC&#8217;s extensive probes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-seeks-court-injunction-against-secs-extensive-probes/\" aria-label=\"More on Binance seeks court injunction against SEC&#8217;s extensive probes\">Read more</a>"
  }
]