[
  {
    "source": "Cointelegraph",
    "date": "2023-07-15T08:20:10.000Z",
    "title": "SEC accepts BlackRock’s Bitcoin ETF application, signaling regulatory review",
    "url": "https://cointelegraph.com/news/sec-accepts-black-rock-bitcoin-etf-application-signaling-regulatory-review",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/fc581fdf-33ad-4236-a4df-f67849b63748.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The SEC’s acknowledgment indicates the commencement of the official review process for BlackRock’s ETF proposal.</p>\n                    <p><p>The United States Securities and Exchange Commission (SEC) has accepted https://www.sec.gov/rules/sro/nasdaq.htm application for a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) following its acknowledgment of a similar application by Bitwise the day before.</p><p>The SEC’s <a href=\"https://www.sec.gov/rules/sro/nasdaq.htm\" target=\"_blank\" rel=\"noopener nofollow\"></a><a href=\"https://www.sec.gov/rules/sro/nasdaq.htm\" target=\"_blank\" rel=\"noopener nofollow\">acknowledgment</a> indicates the commencement of the official review process for BlackRock's ETF proposal. While it is an initial step in a lengthy regulatory journey, it holds great importance for the Bitcoin community. The SEC’s readiness to explore the idea of a Bitcoin ETF and assess its potential market effects is evident from this acknowledgment.</p><p>ETFs are investment funds that typically follow specific indexes and are commonly traded on exchanges. In the realm of cryptocurrencies, a fund that mirrors the value of one or multiple digital tokens and comprises a variety of cryptocurrencies is known as a cryptocurrency ETF.</p><p>On Friday, July 14, the regulator <a href=\"https://www.sec.gov/rules/sro/cboebzx.htm\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that it is also in the process of reviewing applications for various funds, including Wise Origin Bitcoin Trust, WisdomTree Bitcoin Trust, VanEck Bitcoin Trust and Invesco Galaxy Bitcoin ETF. This move demonstrates the companies’ recognition of the growing demand for regulated Bitcoin investment vehicles and their desire to cater to the needs of their clients.</p><p>BlackRock Inc’s <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">entry into the spot Bitcoin ETF race</a> is significant due to its stature in the financial industry. In the filing for a spot Bitcoin ETF by asset manager BlackRock, an agreement for \"surveillance-sharing\" was included, partnering with cryptocurrency exchange Coinbase. The company’s decision to pursue a Bitcoin ETF highlights the growing acceptance and recognition of cryptocurrencies within the traditional financial sector.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-larry-fink-crypto-will-transcend-international-currencies\"><strong><em>Crypto will transcend international currencies — BlackRock CEO</em></strong></a><strong><em><u> </u></em></strong></p><p>The competition among companies vying to be the first to launch a Bitcoin ETF in the United States is a positive development for the crypto industry. With multiple filings, the chances of success are heightened, as diverse approaches and proposals enable the SEC to assess different strategies and address any potential concerns.</p><p>Spot Bitcoin ETFs have been denied since 2017 by the SEC. In Canada, however, the financial product is already available. Three significant funds — Purpose Bitcoin, 3iQ CoinShares and CI Galaxy Bitcoin — are all directly invested in spot Bitcoin.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/sec-accepts-black-rock-bitcoin-etf-application-signaling-regulatory-review&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/sec-calls-etf-filings-inadequate-binance-loses-euro-partner-and-other-news-hodlers-digest-june-25-july-1/\"><strong><em>SEC calls ETF filings inadequate, Binance loses euro partner and other news: Hodler’s Digest, June 25 – July 1</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-07-15T08:32:48.000Z",
    "title": "Binance lays off over 1,000 employees amid regulatory hurdle",
    "url": "https://crypto.news/binance-lays-off-over-1000-employees-amid-regulatory-hurdle/",
    "description": "Binance is reportedly laying off over 1,000 employees as part of a restructuring effort that could result in a reduction of more than a third. Wall Street Journal shared an insight on June 14. According to an unnamed Binance spokesperson,&#8230;"
  }
]