[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T06:49:29.000Z",
    "title": "Magic Eden launches $1 million creator fund to boost Polygon’s NFT ecosystem",
    "url": "https://www.cryptopolitan.com/magic-eden-1m-creator-fund-boost-polygons-nft-ecosystem/",
    "description": "Magic Eden has announced the launch of a $1 million fund dedicated to supporting creators building on the Polygon blockchain. The fund aims to bolster a blue-chip NFT presence on Polygon, a blockchain renowned for web3 gaming. Fostering Innovation: Magic Eden&#8217;s commitment to supporting Polygon-based projects The newly launched fund offers creators the opportunity to ... <a title=\"Magic Eden launches $1 million creator fund to boost Polygon&#8217;s NFT ecosystem\" class=\"read-more\" href=\"https://www.cryptopolitan.com/magic-eden-1m-creator-fund-boost-polygons-nft-ecosystem/\" aria-label=\"More on Magic Eden launches $1 million creator fund to boost Polygon&#8217;s NFT ecosystem\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-18T07:00:30.000Z",
    "title": "Mastercard Partners With Ripple, But XRP Falls Below Pre-SEC Ruling Levels",
    "url": "https://www.newsbtc.com/ripple-2/mastercard-partners-ripple-xrp-falls-below-pre-sec-ruling/",
    "description": "In a significant move signaling the growing importance of Central Bank Digital Currencies (CBDCs) in global financial systems, Mastercard has announced a strategic partnership with several blockchain companies, including Ripple. Meanwhile, the XRP price took a nosedive in the past 24 hours, falling 14.3% amidst the marketwide downturn. Ripple Partners With Mastercard Unveiling its CBDC Partner Program, Mastercard emphasized its intent to work with leading figures in the CBDC ecosystem. The objective: to offer central banks a comprehensive understanding of CBDCs and their potential for redefining the future monetary systems. Ripple, recognized as a &#8220;CBDC platform&#8221; in Mastercard’s media release, stands at the forefront of this ambitious initiative. &#8220;The inaugural set of partners includes CBDC platform Ripple, blockchain and Web3 software company Consensys, multi-CBDC and tokenized assets solution provider Fluency, digital identity technology provider Idemia, digital identity consultant Consult Hyperion, security technology group Giesecke+Devrient and digital asset operations platform Fireblocks,&#8221; Mastercard detailed in its announcement. Related Reading: Institutional XRP Holdings Rise Rapidly Following Ripple’s Win Over SEC Ripple&#8217;s recent accomplishments, such as the partnership with the Republic of Palau, which resulted in the launch of a government-issued stablecoin, further reinforce its position as a key player in the CBDC arena. Mastercard highlighted this collaboration as a testimony to Ripple&#8217;s capabilities, stating, &#8220;Ripple’s launch of an inaugural government-issued national stablecoin in collaboration with the Republic of Palau, in addition to work on four CBDC pilots.&#8221; Commenting on this collaboration, Mastercard’s CEO, Michael Miebach, stated, &#8220;We’re partnering with several central banks to help them research new digital currencies projects. It starts with understanding what they want to achieve with this technology, then building in transparency, consumer privacy and stability. We’re working toward those goals with a new #CBDC partner program, with Mastercard teaming up with a handful of key blockchain/Web3/payments players so we can learn from each other.&#8221; In response, Antony Welfare, CBDC advisor at Ripple, shared his enthusiasm, noting, &#8220;Excited to be working with Mastercard on #DigitalCurrency and CBDC projects.&#8221; Related Reading: Best-Selling Author Touts Buy XRP Now, But This Price Is Crucial Ripple&#8217;s involvement in the CBDC Partner Program is yet another testament to its growing influence in the domain. The company has already marked its presence with partnerships spanning nations like Montenegro, Hong Kong, Colombia, and Bhutan. XRP Price Crashes To Pre-SEC Ruling Levels Amid the downturn in the crypto market, the XRP price has fallen to a crucial level. XRP briefly fell to $0.4347, below the price level before the summary judgment in the legal battle between Ripple and the US Securities and Exchange Commission (SEC). At the time of writing, XRP was trading at $0.5048, below the 200-day EMA at $0.5251. In a recovery rally, this should be the first target for XRP bulls before the 23.6% Fibonacci level at $0.5524 comes into focus. On the downside, XRP should defend yesterday&#8217;s low at $0.43 at all costs. Otherwise, a crash towards $0.41 could loom. Featured image from Yahoo Finance, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-18T06:53:12.000Z",
    "title": "98% of All Worldcoin Tokens Controlled by 10 Wallets, InQubeta Multiplying Early Adopters’ Wealth",
    "url": "https://www.crypto-news-flash.com/98-of-all-worldcoin-tokens-controlled-by-10-wallets-inqubeta-multiplying-early-adopters-wealth/?utm_source=rss&utm_medium=rss&utm_campaign=98-of-all-worldcoin-tokens-controlled-by-10-wallets-inqubeta-multiplying-early-adopters-wealth",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-38.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-38.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-38-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-38-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The InQubeta (QUBE) presale has incentivized early adopters to buy into its presale with price increases at each of the event’s ten stages. Investors who got in during its beta stage get to grow their capital by 400%, while those who join the action now get to grow theirs 3x. Opening up the InQubeta presale [...]"
  }
]