[
  {
    "source": "Cointelegraph",
    "date": "2023-10-12T09:27:28.000Z",
    "title": "Caroline Ellison testimony: SBF bribed Chinese officials for $150M to unfreeze funds ",
    "url": "https://cointelegraph.com/news/caroline-ellison-sam-bankman-fried-sbf-bribed-chinese-officials-thai-sex-workers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/ad97a85d-2fbe-40dc-8f14-b3da546c4cef.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Caroline Ellison, the star witness in the Sam Bankman-Fried criminal trial, testified that SBF tried to use identities linked to Thai sex workers to unfreeze funds before bribing Chinese officials for millions. </p>\n                    <p><p>Caroline Ellison, the former romantic partner of embattled FTX founder Sam “SBF” Bankman-Fried and former CEO of Alameda Research, has claimed in <a href=\"https://cointelegraph.com/news/sbf-trial-alameda-ceo-caroline-ellison-sam-bankman-fried\">her courtroom testimony</a> that SBF bribed Chinese officials for millions of dollars to unfreeze funds locked in local exchanges. </p><p>In her Oct. 11 testimony, Ellison said there was $1 billion in funds locked up in China and that in order to access them Alameda paid a $150 million bribe to Chinese government officials.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">AUSA: How much was frozen in China?<br>Ellison: $1 billion. Sam wanted to find ways to address it. <br>AUSA: How were they unfrozen?<br>Ellison: Alameda paid a bribe to Chinese government officials<br>SBF: Objection, move to strike.<br>Judge Kaplan: I will strike that</p>&mdash; Inner City Press (@innercitypress) <a href=\"https://twitter.com/innercitypress/status/1712133691965636829?ref_src=twsrc%5Etfw\">October 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The funds, which belonged to Alameda Research, were frozen on the cryptocurrency exchanges Huobi and OKX as a result of a 2021 money laundering probe opened by Chinese authorities. </p><p>Ellison testified that Bankman-Fried ordered her and other FTX employees to delete all related messages that were sent via the encrypted messaging app Signal. </p><p>However, prior to bribing Chinese officials, Ellison said they attempted to hire a local lawyer in China who could help with negotiations with the government.  </p><p>After attempts with lawyers were unsuccessful, Ellison claimed that Bankman-Fried attempted to use wallets of “other people's accounts,” to access the funds, though was unsuccessful. This included what turned out to be Thai sex workers. </p><p>Ellison said, “On OKX we made several accounts using the IDs of different people who I believe were Thai prostitutes, and we tried to basically have our main account lose money and have those other accounts make money, so do very imbalanced trades between the two accounts so those other accounts would be able to make money and withdraw it.”</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-us-president-says-caroline-ellison\"><strong><em>Sam Bankman-Fried aspired to become US president, says Caroline Ellison</em></strong></a></p><p>When questioned how the accounts were ultimately unfrozen Ellison said her impression was that they were unfrozen through Alameda paying the bribe. </p><p>According to a post on X (formerly Twitter) from a witness in attendance in the courtroom, Ellison has to return on Oct. 12 for a cross-examination from SBF’s lawyer Mark Cohen.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Oh, she has to (come back tomorrow) - now for cross examination by Bankman-Fried&#39;s lawyer Mark Cohen, which began a big slow and disorganized at the end of today&#39;s session. We&#39;ll see tomorrow - I aim to be live tweeting it, starting at 9:30 am <a href=\"https://t.co/mUdG7ST2qm\">https://t.co/mUdG7ST2qm</a></p>&mdash; Inner City Press (@innercitypress) <a href=\"https://twitter.com/innercitypress/status/1712290794512515370?ref_src=twsrc%5Etfw\">October 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In total, SBF faces 13 charges. The first seven charges of fraud are being heard in his current trial which began on Oct. 3 and does not include charges of bribing Chinese officials.  </p><p>However, in a second trial scheduled in March 2024, he is facing an additional five charges which include bank fraud and foreign bribery conspiracy charges. Bankman-Fried has pleaded not guilty to all charges pressed against him. </p><p>Cointelegraph reporters are on the ground in New York covering the trial. As the saga unfolds,<a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\"> check here for the latest updates</a>.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/sbf-trial-underway-mashinsky-trial-set-binances-market-share-shrinks-hodlers-digest-oct-1-7/\"><strong><em>SBF trial underway, Mashinsky trial set, Binance’s market share shrinks: Hodler’s Digest, Oct. 1–7</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-12T09:13:12.000Z",
    "title": "Anthropic’s CEO Takes on the Future of AI and LLMs, Shares Key Insights",
    "url": "https://www.cryptopolitan.com/anthropics-ceo-future-of-ai-and-llms/",
    "description": "In a recent conversation with Dario Amodei, CEO of Anthropic, profound insights into the future of Artificial Intelligence (AI) and Large Language Models (LLMs) emerged. Amodei, a leading figure in the field, shared perspectives on the limitations of current models, the evolving landscape of Reinforcement Learning, scalability challenges, future predictions for LLMs, and groundbreaking advancements ... <a title=\"Anthropic&#8217;s CEO Takes on the Future of AI and LLMs, Shares Key Insights\" class=\"read-more\" href=\"https://www.cryptopolitan.com/anthropics-ceo-future-of-ai-and-llms/\" aria-label=\"More on Anthropic&#8217;s CEO Takes on the Future of AI and LLMs, Shares Key Insights\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-12T09:30:21.000Z",
    "title": "Cardano Founder Addresses ETHGate Rumors: Did Ethereum Bribe The SEC To Go After XRP?",
    "url": "https://www.newsbtc.com/news/ethereum/cardano-founder-ethgate-ethereum/",
    "description": "Cardano founder Charles Hoskinson recently gave his thoughts on whether the US Securities and Exchange Commission (SEC) had given Ethereum a regulatory free pass as recent rumors suggest.   Cardano Founder Alleges Favoritism Toward Ethereum In an AMA session shared on X (formerly Twitter), Hoskinson mentioned that the Himman emails and other revelations expose the thought process of the SEC and show that there was unequal application, which he doesn’t see anything wrong with. Furthermore, he believes that none of the Commission’s actions presupposes corruption but only favoritism.  Related Reading: XRP Price Prediction: Crypto CEO Delivers Bad News For The Altcoin It is worth mentioning that Hoskinson happens to be a co-founder of Ethereum. However, he was forced to exit the team after he suggested that Ethereum be run as a commercial entity rather than a nonprofit, but this idea didn’t seem to resonate with others on the team.  As such, one can easily assume that there could be some form of bias in his statement, as he could feel endeared to Ethereum despite the circumstances surrounding his exit. Reacting to the clip, One X user stated that Hoskinson’s “old ETHGATE buddies” may have convinced him to make such statements.  Meanwhile, others in the crypto community criticized his statement, emphasizing that there was really no difference between favoritism and corruption, especially when a government agency is involved. Some went as far as alleging that Hoskinson could well have been involved in the scandal and that he was talking “like a defendant.” ETH price continues to struggle &#124; Source: ETHUSD on Tradingview.com Himman Emails And Other Revelations A Big Deal While Hoskinson may have tried to downplay the Himman emails and other revelations, they undoubtedly lay a foundation as to possible wrongdoings of the Commission. For one, the email showed that Bill Hinman had interacted with Ethereum’s co-founder, Vitalik Buterin before he gave his speech, where he mentioned that ETH wasn’t a security. With this in mind, Buterin could have possibly influenced Hinman’s speech. There have also been revelations of how the SEC had close ties with Ethereum, which instantly presupposes a conflict of interest as it becomes harder to regulate or deal fairly with such a body without being influenced by external factors.  Related Reading: No Love For FTX: Ex-Girlfriend Delivers Scathing Testimony Against Sam Bankman-Fried Meanwhile, Steven Nerayoff, who was an active participant during Ethereum’s Initial Coin Offering (ICO), continues to allege that the SEC was corrupt in its dealings with Ethereum and that he has evidence to back up his claims.  Pro-XRP legal expert John Deaton has also confirmed Nerayoff&#8217;s claims as he has seen this supposed evidence under the attorney-client relationship.  In his announcement last month, Deaton mentioned that Bill Himman’s cross-examination would be of “epic proportions” and even offered to handle that personally if the SEC’s case against Ripple were to go to trial. Featured image from Bitcoinist, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-12T09:17:00.000Z",
    "title": "Tangible Faces Crisis as USDR Stablecoin Crashes: What’s Next?",
    "url": "https://coinedition.com/tangible-faces-crisis-as-usdr-stablecoin-crashes-whats-next/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next.jpg 730w, https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/10/Tangible_Faces_Crisis_as_USDR_Stablecoin_Crashes_Whats_Next-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Tangible, an ecosystem for tokenized real-world assets, suffered from the crash of its stablecoin, Real USD (USDR). The stablecoin is a native yield stablecoin backed by real estate, but Tangible shared that there has been “an accelerated drawdown in the market cap, combined with the lack of DAI for redemptions; panic selling ensued, causing a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/tangible-faces-crisis-as-usdr-stablecoin-crashes-whats-next/\">Tangible Faces Crisis as USDR Stablecoin Crashes: What&#8217;s Next?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-12T09:15:59.000Z",
    "title": "USDT Whale Activity Heating Up As Exchange Deposits Rapidly Accelerate, According to Analytics Firm Santiment",
    "url": "https://dailyhodl.com/2023/10/12/usdt-whale-activity-heating-up-as-exchange-deposits-rapidly-accelerate-according-to-analytics-firm-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/usdt-issuer-rumors.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/usdt-issuer-rumors.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/usdt-issuer-rumors.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/usdt-issuer-rumors.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/usdt-issuer-rumors.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/usdt-issuer-rumors.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/usdt-issuer-rumors.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Top stablecoin USDT is witnessing a surge in on-chain activity, according to the crypto analytics firm Santiment. Santiment notes that USDT, which is issued by Tether and aims to maintain to maintain a 1:1 peg with the US dollar, recently notched a three-month high in active addresses, in large part due to an increase in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/12/usdt-whale-activity-heating-up-as-exchange-deposits-rapidly-accelerate-according-to-analytics-firm-santiment/\">USDT Whale Activity Heating Up As Exchange Deposits Rapidly Accelerate, According to Analytics Firm Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]