[
  {
    "source": "CoinDesk",
    "date": "2023-10-10T20:43:41.000Z",
    "title": "Bitcoin Hovers Above $27,000 as U.S. Stocks Advance",
    "url": "https://www.coindesk.com/markets/2023/10/10/bitcoin-hovers-above-27000-as-us-stocks-advance/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Meanwhile, bitcoin's dominance continues to climb"
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-10T20:47:35.000Z",
    "title": "Protocol Village: Spark Protocol Expands Beyond Ethereum to Gnosis",
    "url": "https://www.coindesk.com/tech/2023/10/09/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the week of Oct. 9-15, with live updates throughout."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-10T21:08:17.000Z",
    "title": "What is Tezos (XTZ)?",
    "url": "https://decrypt.co/resources/tezos",
    "description": "Tezos is a crypto platform that supports smart contracts and Dapps. It also looks to evolve faster than other blockchains."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-10T21:05:15.000Z",
    "title": "Lightning Network Growth Is a ‘Shock‘, Says Bitcoin Analyst",
    "url": "https://decrypt.co/200923/shocking-growth-lightning-network-river-financial-analyst",
    "description": "According to a new report by River Financial, Bitcoin’s layer-2 solution has grown 1,212% over the past two years. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-10T21:00:00.000Z",
    "title": "Galxe replacing 110% of funds users lost in recent front-end hack, over $400K",
    "url": "https://cointelegraph.com/news/galxe-replacing-110-funds-users-lost-front-end-hack-over-400-k",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/5c487ee6-86ba-49ae-99fb-36b1ba43f9bb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The platform was the victim of a phishing scam that routed users to a website that drained their wallets after they approved a transaction. </p>\n                    <p><p>Galxe is making users whole by 110% if they lost funds in a recent hack, the firm announced on Oct. 10. “We want to express our deepest gratitude to those who are standing by us during this difficult time,” the company said.</p><p>Users’ funds will be automatically returned on Oct. 16 to the wallet addresses they were taken from unless they request other handling. The affected users will be paid in Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) with the value calculated as of 10:00 UTC Oct. 9.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Attention Raisers! <br><br>The first October partnership campaign on Galxe is landing at 12 PM (UTC) on October 5th! <br><br> Just 200 spots are up for grabs! - FCFS! <br><br>Don't forget to flaunt your Galxe role on Discord and keep following us on Galxe for exclusive event access!… <a href=\"https://t.co/JacShzKVXj\">pic.twitter.com/JacShzKVXj</a></p>— CoinRaise (@CoinRaise_xyz) <a href=\"https://twitter.com/CoinRaise_xyz/status/1709469731252847076?ref_src=twsrc%5Etfw\">October 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Users who authenticated transactions on a phishing site on Oct. 6 were affected, Galxe <a href=\"https://help.galxe.com/en/articles/8461267-october-6th-security-incident-fund-recovery-plan\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a letter to users. The hack lasted just over five hours. </p><p>In a preliminary estimate dated Oct. 10, over $396,000 of losses were recorded, in amounts ranging from over $53,000 to just pennies. The company had <a href=\"https://blog.galxe.com/oct-6th-dns-security-incident-statement-0cfc789bf9dc\" target=\"_blank\" rel=\"noopener nofollow\">estimated</a> earlier that around 1,120 users were affected by hack.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/crypto-suffered-153-percent-yoy-increase-hacks-scams-q3-immunefi\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-suffered-153-percent-yoy-increase-hacks-scams-q3-immunefi/amp\">Crypto suffered 153% YoY increase in hacks and scams in Q3: Immunefi</a></em></strong></p><p>Platform co-founder Charles Wayn told Cointelegraph in a written response that Galxe is working with two security firms to track down the hacked funds. In addition, it has improved its domain name service security settings, changed its domain provider and is conducting security audits. Wayn said:</p><blockquote>“The incident was mainly caused by [domain registrar] Dynadot resetting our account information and granting permission to an impersonator who provided fake documentation claiming to be an authorized member of Galxe.”</blockquote><p>The Galxe protocol is a permissionless self-sovereign identity infrastructure. Its native GAL token fell from $1.20 to $1.15 on Friday, Oct. 6. It reached $1.21 over the weekend with high trading volume through Saturday morning. It had settled at $1.16 at the time of writing, <a href=\"https://www.coingecko.com/en/coins/galxe\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to CoinGecko. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ethics-101-crypto-projects-negotiate-hackers/\">Should crypto projects ever negotiate with hackers? Probably</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-10T20:40:28.000Z",
    "title": "Crypto advocates weigh on race for next US House Speaker",
    "url": "https://cointelegraph.com/news/crypto-advocates-next-us-house-speaker",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/2c132bde-b7dd-448f-a203-bd295c71e3df.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Lawmakers are scheduled to return to the House of Representatives on Oct. 11 to vote on a replacement for Speaker Kevin McCarthy, whose position has been vacant for a week.</p>\n                    <p><p>At the time of publication, half of the legislative branch of the federal government of the United States was largely paralyzed following a vote ousting then Speaker Kevin McCarthy.</p><p>U.S. lawmakers voted to declare the office of Speaker of the House of Representatives vacant on Oct. 3, marking the first time in the history of the United States the government body was without leadership. Representatives are scheduled to return to Congress on Oct. 11 to vote on a new Speaker, with reports suggesting that Republicans Jim Jordan and Steve Scalise were the leading candidates.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">House speaker race.<br><br>Convention (Scalise) Vs Chaos (Jordan).<a href=\"https://t.co/sTQKHjY2wC\" data-amp=\"https://amp-cnn-com.cdn.ampproject.org/c/s/amp.cnn.com/cnn/politics/live-news/house-speaker-race-10-09-23/index.html\">https://t.co/sTQKHjY2wC</a></p>— CryptoSmind (@SmindCrypto) <a href=\"https://twitter.com/SmindCrypto/status/1711541641616765083?ref_src=twsrc%5Etfw\">October 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Following McCarthy’s absence, crypto-friendly lawmaker Patrick McHenry has been <a href=\"https://cointelegraph.com/news/rep-patrick-mchenry-interim-house-speaker-mccarthy-oust\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/rep-patrick-mchenry-interim-house-speaker-mccarthy-oust/amp\">acting as the interim Speaker</a> but is not expected to be a contender for the job. Former U.S. President Donald Trump has given his endorsement to Jordan, who has <a href=\"https://www.cnn.com/2023/10/09/politics/jim-jordan-january-6-2020-election/index.html\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://amp-cnn-com.cdn.ampproject.org/c/s/amp.cnn.com/cnn/2023/10/09/politics/jim-jordan-january-6-2020-election/index.html\">repeated</a> falsehoods surrounding the results of the 2020 presidential election. Scalise, who has reportedly described himself as akin to white supremacist David Duke “without the baggage” may also receive support from many in the Republican Party. </p><p>“[The Speaker’s race] paralyzes the House on nearly every front legislatively,” <a href=\"https://twitter.com/RonwHammond/status/1711740745369928135\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the Blockchain Association director of government relations Ron Hammond in an Oct. 10 X thread. “If it drags out over another week then a lot of things can happen including potential new speaker candidates coming forward. For crypto though, McHenry is still the person to watch. He wants votes on crypto ASAP.”</p><p>According to Hammond, the uncertainty surrounding the House Speaker along with the criminal trial of Sam Bankman-Fried and the <a href=\"https://cointelegraph.com/news/israel-web3-community-launches-crypto-aid-israel-help-displaced-citizens\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/israel-web3-community-launches-crypto-aid-israel-help-displaced-citizens/amp\">war between Israel and Hamas</a> “could push bills like stablecoins” to November or December:</p><blockquote>“These major events will also dovetail into the 2024 election cycle. Presidential election years are hard to pass anything meaningful in Congress as everyone is focusing on winning.”</blockquote><p>Ji Kim, head of global policy for the Crypto Council for Innovation, told Cointelegraph crypto was \"becoming a priority\" for Congress. According to Kim, legislation including the Financial Innovation and Technology for the 21st Century Act and the Clarity for Payment Stablecoin Act \"will likely be delayed until a new Speaker is elected\". </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-bills-delayed-us-government-shutdown\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-bills-delayed-us-government-shutdown/amp\"><strong><em>Crypto bills could be delayed as many prepare for US gov’t shutdown</em></strong></a></p><p>It’s unclear how Republican lawmakers plan to prevent a repeat of the events leading to McCarthy being chosen as Speaker in January. It <a href=\"https://cointelegraph.com/news/us-congress-investigations-into-ftx-are-in-limbo-without-a-house-speaker\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-congress-investigations-into-ftx-are-in-limbo-without-a-house-speaker/amp\">took 15 rounds of voting</a> before the California Representative could officially hold the gavel, during which time all legislation was on hold. </p><p>Neither Jordan nor Scalise have been particularly outspoken about any pro- or anti-crypto positions they may hold. Crypto-focused bills passed by the House Financial Services Committee in July <a href=\"https://cointelegraph.com/news/first-major-success-in-us-congress-for-two-crypto-bills-law-decoded-24-31-july\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/first-major-success-in-us-congress-for-two-crypto-bills-law-decoded-24-31-july/amp\">could move forward</a> with a floor vote in the full House before the next session of Congress, but delays in determining a Speaker and consequently dealing with a potential government shutdown in November could stymie progress. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\"><strong><em>Opinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-10T20:50:18.000Z",
    "title": "Lenovo directs $1.2B into artificial intelligence research as AI investment markets boom",
    "url": "https://cryptoslate.com/lenovo-directs-1-2b-into-artificial-intelligence-research-as-ai-investment-markets-boom/",
    "description": "<p>Technology giant Lenovo has announced a $1.2 billion investment in artificial intelligence, aiming to tap into the projected $29 billion AI server and storage market and drive partner sales. According to CRN, Stacey Goodman, senior director of U.S. VAR Partner Sales for Lenovo, announced this strategic move at the 2023 XChange Best of Breed conference. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/lenovo-directs-1-2b-into-artificial-intelligence-research-as-ai-investment-markets-boom/\">Lenovo directs $1.2B into artificial intelligence research as AI investment markets boom</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-10T21:03:03.000Z",
    "title": "Binance Helps Israel Freeze Hamas Crypto Accounts",
    "url": "https://cryptobriefing.com/binance-helps-israel-freeze-hamas-crypto/?utm_source=feed&utm_medium=rss",
    "description": "Israel police report Binance helped freeze Hamas crypto accounts that raised funds via social media campaigns."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-10T21:00:39.000Z",
    "title": "Crypto Analyst Identifies 6 Overlooked Altcoins That Could Be Due For A Price Surge",
    "url": "https://www.newsbtc.com/altcoin/crypto-analyst-overlooked-altcoins/",
    "description": "With tens of thousands of altcoins circulating the market, crypto investors can easily miss out on the next 100x coin due to it not being on their radar. This is often not the fault of the investor as it can be hard to keep track of so many coins. As a result of this, a Santiment analyst has presented a total of 6 overlooked altcoins that could be primed for a rally. Crypto Analyst Presents Altcoins Using Network Activity As pointed out by the crypto analyst in the Santiment post, the altcoins outlined were picked due to an uptick in their network activity. These tokens have been able to stay under the radar but their activities spread across transaction volumes, network growth, and large transaction numbers, among others, have caught attention. Related Reading: Why Does Ripple Return Unlocked Tokens To Escrow? Pro-XRP Lawyer Provides Answers “The extra juicy opportunities lie with projects that maybe haven&#8217;t seen any special price decouplings recently, yet have a surge in network growth, or whale transactions and accumulation.” He further added that these projects are “at minimum, likely to have some increased volatility due to extra activity that hasn&#8217;t existed on their respective networks in quite some time.” 1 &#8211; Bancor (BNT) Emerges Top Of Altcoins List As outlined in the post, the Bancor Network, a permissionless protocol that caters to open-source DeFi protocols, has seen a notable rise in its network metrics. This spans across high transaction volumes, active addresses, network growth, whale transactions, exchange inflows, and age destroyed (Consumed). This could be a predecessor to a rise in the BNT price. Source: Santiment 2 &#8211; Cartesi (CTSI) The application-specific rollups Cartesi network which features a Linux runtime has also seen a rise in metrics similar to Bancor that could signal a rise in its native CTSI token. This also spans “High Transaction Volume, Active Addresses, Whale Transactions, Age Destroyed (Consumed)” as pointed out in the post. Source: Santiment 3 &#8211; Holo (HOT) Holo (HOT) on the Holochain allows for Peer-To-Peer (P2P) applications and has made it to this list mainly due to its whale transactions. The Santiment post shows a rise in whale accumulation among addresses holding between $100,000 and $1 million, as well as high whale transactions, exchange inflows, and age destroyed (Consumed). Source: Santiment 4 &#8211; Powerpool (CVP) The Powerpool (CVP) protocol is a governance-facing protocol that has seen similar trends to Holo (HOT) above. Just like Holo, there has been accumulation among whales holding $100,000 to $1 million. “High Active Addresses, Network Growth, $100K-$1M Whale Accumulation, Age Destroyed (Consumed),” the analyst writes. Source: Santiment 5 &#8211; Storj (STORJ) The Storj (STORJ) project is one that aims to provide cleaner storage services, allowing organizations to cut down their carbon footprint as well as reduce their cloud storage costs. But this under-the-radar altcoin has made it into the list. The analyst points to “High Transaction Volume, Active Addresses, Network Growth, Whale Accumulation, Age Destroyed (Consumed)” as shown in the chart. Source: Santiment 6 &#8211; UniLend (UFT) Unilend (UFT), a protocol that brings all decentralized finance (DeFi) trading to offer in one place, making them accessible through smart contracts, has seen a rise in activity as well. Coming up as the 6th altcoin on the list, Unilend’s growth spans “High Transaction Volume, Active Addresses, Network Growth, Whale Transactions, $100K-$1M Whale Accumulation, Exchange Inflow.” Source: Santiment Altcoins: Exercise Caution With These Cryptos Although these assets have seen a lot of increase in their network activities, the crypto analyst warns that “It appears that 4 out of these 6 highlighted projects are likely getting hot network activity BECAUSE of the price pump. For the other 2, there are no guarantees that a pump is around the corner.” Related Reading: These Bullish Factors Prove XRP Price Rally Is Not Over Yet However, as always, crypto investors are urged to “make your own assessments, research these and the many other projects that show similar hot network activity on this model in weeks to come.” Total market cap sitting at $1.045 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com Featured image from Busha, chart from Tradingview.com"
  }
]