[
  {
    "source": "CoinDesk",
    "date": "2023-05-26T13:53:16.000Z",
    "title": "Avalanche’s AVAX Token Remains Flat Ahead of its $130 Million Token Unlock",
    "url": "https://www.coindesk.com/business/2023/05/26/avalanches-avax-token-remains-flat-ahead-of-its-130-million-token-unlock/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "More than 9.3 million tokens will be unlocked Sunday, representing 1.2% of AXAX’s total supply."
  },
  {
    "source": "Decrypt",
    "date": "2023-05-26T13:44:25.000Z",
    "title": "ESMA Raises Concerns Over Unregulated Crypto Products Ahead of MiCA Rollout",
    "url": "https://decrypt.co/142518/esma-raises-concerns-unregulated-crypto-products-mica-rollout",
    "description": "Despite the adoption of MiCA, ESMA said today firms must still label crypto offerings as unregulated until the framework is implemented."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-26T14:01:20.000Z",
    "title": "US Treasury General Account dwindles to critical levels with less than $50B remaining",
    "url": "https://cryptoslate.com/insights/us-treasury-general-account-dwindles-to-critical-levels-with-less-than-50b-remaining/",
    "description": "<p>Quick Take The U.S. Treasury General Account (TGA) continues to be depleted; as of May 24, it had just $49 billion left in its coffers. This is the lowest number in the account since 2017 when the balance fell to around $23 billion. The Treasury&#8217;s General Account is the primary operating account for the United [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/us-treasury-general-account-dwindles-to-critical-levels-with-less-than-50b-remaining/\">US Treasury General Account dwindles to critical levels with less than $50B remaining</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T13:59:55.000Z",
    "title": "DCG Closes Institutional Trading Platform TradeBlock",
    "url": "https://cryptodaily.co.uk/2023/05/dcg-closes-institutional-trading-platform-tradeblock",
    "description": "<p>DCG announced on Thursday the closure of its prime brokerage subsidiary TradeBlock. The company cites broad economic concerns and the uncertain regulatory climate in the US. </p>\n<p>Digital Currency Group (DCG) announced on Thursday that it would officially start the process of shutting down its institutional trading platform on May 31, Bloomberg reports.</p>\n\n<p dir=\"ltr\" lang=\"en\">Barry Silbert&rsquo;s crypto conglomerate, Digital Currency Group, is shuttering its TradeBlock institutional trading platform https://t.co/duE4YnknrR</p>\n&mdash; Bloomberg Crypto (@crypto) May 25, 2023\n<p>\n\n</p>\n<p>A spokesperson for the venture capital conglomerate told Bloomberg that concerns over the broader economic climate and an uncertain regulatory environment for cryptocurrencies in the US drove the decision to shutter TradeBlock&rsquo;s operations.</p>\n\n<p>Due to the state of the broader economy and prolonged crypto winter, along with the challenging regulatory environment for digital assets in the US, we made the decision to sunset the institutional trading platform side of the business.</p>\n\nChallenging Times for DCG\n<p>Established in 2011, the company was acquired by DCG&rsquo;s crypto-focused media platform CoinDesk in 2021. CoinDesk retained only its index data business which it later rebranded to CoinDesk Indices, Finance Magnates reports.</p>\n<p>DCG has been under severe pressure after one of its subsidiaries, Genesis Global Trading, halted customer withdrawals in November and went bankrupt, reportedly owing creditors $3 billion.</p>\n<p>The company is further facing pressure over a lending product called &ldquo;Earn&rdquo;, which Genesis offered in partnership with crypto exchange Gemini.</p>\n<p>Earlier in the week, it was reported that DCG missed a payment concerning a $900 million loan made by Gemini to Genesis. The crypto exchange warned earlier in the month that if DCG could not make the required loan repayment or restructure its debt, the company would be at risk of defaulting on its obligations.</p>\n<p>The conglomerate further revealed in its Q4 2022 investor report that it suffered losses worth $1.1 billion due to the collapse of Three Arrows Capital. DCG is reportedly 3AC&rsquo;s largest creditor, which owes around $2.36 billion in funds.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T14:06:38.000Z",
    "title": "French government revises strict rules on influencer marketing for cryptocurrency companies",
    "url": "https://www.cryptopolitan.com/french-government-revises-strict-rules-on-influencer-marketing-for-cryptocurrency-companies/",
    "description": "In a stunning twist, French legislators have taken an unexpected stance by revising the strict rules initially proposed in March. These regulations had intended to impose severe limitations on cryptocurrency companies registered in the country, particularly those engaging in influencer marketing. However, the lawmakers have now opted for a more innovative approach, signaling a significant ... <a title=\"French government revises strict rules on influencer marketing for cryptocurrency companies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/french-government-revises-strict-rules-on-influencer-marketing-for-cryptocurrency-companies/\" aria-label=\"More on French government revises strict rules on influencer marketing for cryptocurrency companies\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-26T14:04:19.000Z",
    "title": "Compromised Twitter account amplifies crypto phishing scam",
    "url": "https://crypto.news/compromised-twitter-account-amplifies-crypto-phishing-scam/",
    "description": "In a worrisome development, an infiltrated Twitter account, @steveaoki, has been exploited to endorse a cryptocurrency phishing scam. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-26T13:59:13.000Z",
    "title": "Bitcoin Exchange Inflows Mostly Coming From Loss Holders, Weak Hands Exiting?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-exchange-inflows-loss-weak-hands-exiting/",
    "description": "On-chain data suggests a majority of the Bitcoin exchange inflows are currently coming from investors holding their coins at a loss. Bitcoin Exchange Inflow Volume Is Tending Towards Losses Right Now According to data from the on-chain analytics firm Glassnode, the short-term holders are mostly contributing to these loss inflows. The &#8220;exchange inflow&#8221; is an indicator that measures the total amount of Bitcoin that&#8217;s currently flowing into the wallets of centralized exchanges. Generally, investors deposit to these platforms whenever want to sell, so a large amount of inflows can be a sign that a selloff is going on in the BTC market right now. Low values of the metric, on the other hand, imply holders may not be participating in much selling at the moment, which can be bullish for the price. In the context of the current discussion, the exchange inflow itself isn&#8217;t of relevance; a related metric called the &#8220;exchange inflow volume profit/loss bias&#8221; is. As this indicator&#8217;s name already suggests, it tells us whether the inflows going to exchanges are coming from profit or loss holders currently. When this metric has a value greater than 1, it means the majority of the inflow volume contains coins that their holders had been carrying at a profit. Similarly, values under the threshold imply a dominance of the loss volume. Related Reading: Bitcoin Hangs At $26,200: Why This Is A Crucial Support Level Now, here is a chart that shows the trend in the Bitcoin exchange inflow profit/loss bias over the last few years: The value of the metric seems to have observed some decline in recent days &#124; Source: Glassnode on Twitter As shown in the above graph, the Bitcoin exchange inflow volume profit/loss bias has had a value above 1 for most of the ongoing rallies that started back in January of this year. This suggests that most of the exchange inflows in this period have come from the profit holders. This naturally makes sense, as any rally generally entices a large number of holders to sell and harvest their gains. Related Reading: Bitcoin Bearish Signal: NUPL Finds Rejection At Long-Term Resistance There have been a couple of exceptional instances, however. The first was back in March when the asset&#8217;s price plunged below the $20,000 level. The bias in the market shifted towards loss selling then, implying that some investors who bought around the local top had started capitulating. A similar pattern has also occurred recently, as the cryptocurrency&#8217;s price has stumbled below the $27,000 level. Following this plunge, the indicator&#8217;s value has come down to just 0.70. Further data from Glassnode reveals that the bias of the long-term holders (LTHs), the investors holding their coins since at least 155 days ago, have actually leaned towards profits recently. Looks like the indicator has a positive value right now &#124; Source: Glassnode on Twitter From the chart, it&#8217;s visible that the indicator has a value of 1.73 for the LTHs, implying a strong bias toward profits. Naturally, if the LTHs haven&#8217;t been selling at a loss, the opposite cohort must be the short-term holders (STHs). This group seems to have a heavy loss bias currently &#124; Source: Glassnode on Twitter Interestingly, the indicator&#8217;s value for the STHs is 0.69, which is almost exactly the same as the average for the entire market. This would mean that the LTHs have contributed relatively little to selling pressure recently. The STHs selling right now would be the ones that bought at and near the top of the rally so far and their capitulation may be a sign that these weak hands are currently being cleansed from the market. Although the indicator hasn&#8217;t dipped as low as in March yet, this capitulation could be a sign that a local bottom may be near for Bitcoin. BTC Price At the time of writing, Bitcoin is trading around $26,400, down 1% in the last week. BTC has struggled recently &#124; Source: BTCUSD on TradingView Featured image from 愚木混株 cdd20 on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T14:00:38.000Z",
    "title": "World Mobile Successfully Launches Commercial Network in East Africa",
    "url": "https://www.crypto-news-flash.com/world-mobile-successfully-launches-commercial-network-in-east-africa/?utm_source=rss&utm_medium=rss&utm_campaign=world-mobile-successfully-launches-commercial-network-in-east-africa",
    "description": "<p>London, England, May 26th, 2023, Chainwire World Mobile has announced the successful launch of its commercial telecom network in Zanzibar. The official debut of World Mobile in the East African territory means Zanzibaris can enjoy mobile data that is 50% cheaper than the national average. The transition from a proof of concept to a commercial [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/world-mobile-successfully-launches-commercial-network-in-east-africa/\">World Mobile Successfully Launches Commercial Network in East Africa</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T13:55:55.000Z",
    "title": "Get a Whopping 1000% Return with This Hot GameFi Token: Why Shiba Inu Can’t Compete",
    "url": "https://www.crypto-news-flash.com/get-a-whopping-1000-return-with-this-hot-gamefi-token-why-shiba-inu-cant-compete/?utm_source=rss&utm_medium=rss&utm_campaign=get-a-whopping-1000-return-with-this-hot-gamefi-token-why-shiba-inu-cant-compete",
    "description": "<p>While Shiba Inu may have grabbed the spotlight in the crypto world, there&#8217;s a new contender on the block that is poised to leave Shiba Inu in the dust. This game-changing GameFi token is causing a frenzy among investors who are seeking the next big opportunity for substantial gains. In this article, we will delve [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/get-a-whopping-1000-return-with-this-hot-gamefi-token-why-shiba-inu-cant-compete/\">Get a Whopping 1000% Return with This Hot GameFi Token: Why Shiba Inu Can&#8217;t Compete</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T13:53:29.000Z",
    "title": "Central Bank of Brazil Chooses Visa and Microsoft for CBDC Pilot – Is Stellar Suitable to Serve Billions of People Worldwide? Report",
    "url": "https://www.crypto-news-flash.com/central-bank-of-brazil-chooses-visa-and-microsoft-for-cbdc-pilot-is-stellar-suitable-to-serve-billions-of-people-worldwide-report/?utm_source=rss&utm_medium=rss&utm_campaign=central-bank-of-brazil-chooses-visa-and-microsoft-for-cbdc-pilot-is-stellar-suitable-to-serve-billions-of-people-worldwide-report",
    "description": "<p>The central bank of Brazil has partnered with 14 selected institutions, including private banks like Nubank and Bradesco, and MNCs like Microsoft and VISA, for the pilot testing of its central bank digital currency (CBDC) called Digital Real. Starting mid-June 2023, the participants will be onboarded onto the Digital Real Pilot platform, where simulated transactions [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/central-bank-of-brazil-chooses-visa-and-microsoft-for-cbdc-pilot-is-stellar-suitable-to-serve-billions-of-people-worldwide-report/\">Central Bank of Brazil Chooses Visa and Microsoft for CBDC Pilot &#8211; Is Stellar Suitable to Serve Billions of People Worldwide? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-26T13:50:00.000Z",
    "title": "Crypto Analyst Expects 200- 250% Rally in IOTA’s Price Soon",
    "url": "https://coinedition.com/crypto-analyst-expects-200-250-rally-in-iotas-price-soon/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Crypto_Analyst_Expects_A_200_250_Rally_In_IOTAs_Price_Soon-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Crypto_Analyst_Expects_A_200_250_Rally_In_IOTAs_Price_Soon-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Crypto_Analyst_Expects_A_200_250_Rally_In_IOTAs_Price_Soon-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Crypto_Analyst_Expects_A_200_250_Rally_In_IOTAs_Price_Soon-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Crypto_Analyst_Expects_A_200_250_Rally_In_IOTAs_Price_Soon-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Crypto_Analyst_Expects_A_200_250_Rally_In_IOTAs_Price_Soon-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Crypto_Analyst_Expects_A_200_250_Rally_In_IOTAs_Price_Soon.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Earlier today, a crypto analyst by the name of Captain Faibik took to Twitter to share his belief in the potential for a significant price surge in IOTA (MIOTA) in the near future. The analyst highlighted that IOTA has been trading within a bullish Falling Wedge Formation on its weekly chart for a considerable period [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-analyst-expects-200-250-rally-in-iotas-price-soon/\">Crypto Analyst Expects 200- 250% Rally in IOTA’s Price Soon</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-26T13:48:04.000Z",
    "title": "Toncoin (TON) Price Prediction 2022-2030: Will TON Price Hit $3 Soon?",
    "url": "https://coinedition.com/toncoin-ton-price-prediction/",
    "description": "<img width=\"150\" height=\"150\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Toncoin-TON-Price-Prediction-150x150.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" /><p>Bullish TON price prediction ranges from $2.5482 to $2.832. TON price might also reach $3 this 2023. TON’s bearish market price prediction for 2023 is $0.926. After facing the crypto winter, the communities&#8217; demand for decentralization emerged once again. Currently, many decentralized projects out there are getting recognition and TON Blockchain is one such platform.&#160;&#160; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/toncoin-ton-price-prediction/\">Toncoin (TON) Price Prediction 2022-2030: Will TON Price Hit $3 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-05-26T13:53:54.000Z",
    "title": "The Most Interesting Announcements out of Bitcoin 2023",
    "url": "https://blog.bitfinex.com/education/the-most-interesting-announcements-out-of-bitcoin-2023/",
    "description": "<p>Bitcoin Magazine’s Bitcoin conference is the world’s largest gathering of Bitcoin and crypto enthusiasts in the world. Past years have witnessed major industry announcements like El Salvador’s Bitcoin legal tender law. Let’s take a glance at the most interesting announcements from this year’s conference. Bitcoin...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/education/the-most-interesting-announcements-out-of-bitcoin-2023/\">The Most Interesting Announcements out of Bitcoin 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]