[
  {
    "source": "Decrypt",
    "date": "2023-07-25T14:04:55.000Z",
    "title": "Traders Are Turning From Bitcoin to Altcoins Amid Favorable Ripple Ruling",
    "url": "https://decrypt.co/149969/traders-are-turning-from-bitcoin-to-altcoins-amid-favorable-ripple-ruling",
    "description": "Alt season? Among the 25 largest exchanges, Bitcoin’s market dominance has dropped to levels not seen since April this year."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T13:44:00.000Z",
    "title": "AI and dot-com bubble share some similarities but differ where it counts  ",
    "url": "https://cointelegraph.com/news/ai-and-dot-com-bubble-share-some-similarities-but-differ-where-it-counts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/069a41e8-a450-4799-ba3d-36bcd3dc10a7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>AI has seen massive growth in recent years, leading to comparisons with the now infamous dot-com bubble and crash of the 1990s. </p>\n                    <p><p>Artificial intelligence (AI) has seen tremendous growth in recent years, exploding into popular culture and industry and leading to comparisons with the now infamous dot-com bubble and crash of the 1990s.</p><p>During the late 1990s <a href=\"https://cointelegraph.com/news/what-the-dot-com-bust-can-teach-us-about-the-crypto-crash\">up until the early 2000s</a>, internet-based companies were the subject of massive hype and investment, with the sector peaking at a value of $2.95 trillion before slumping to $1.195 trillion as capital dried up and investors left in droves, causing many companies in the industry to go bust. </p><p>According to data from analytics platform Statista, the AI market has seen steady growth since 2021, with the current market size <a href=\"https://www.statista.com/statistics/1365145/artificial-intelligence-market-size/\" target=\"_blank\" rel=\"noopener nofollow\">estimated</a> to be around $200 billion and forecasted to reach $1.8 trillion by 2030. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/8a53575a-0ec2-44f9-9c4f-9d61986e1097.jpg\"  /><figcaption style=\"text-align: center;\">The market cap of AI has seen steady growth since 2021, with forecasts predicting it could reach $1.8 trillion by 2030. Source: Statista</figcaption></figure><p>Speaking to Cointelegraph, Henry Nothhaft Jr., who has worked in the AI industry since 2009 in various roles and founded the early AI software company Trapit, said the rapid expansion of AI and the dot-com bubble share some key attributes.</p><p>Nothhaft pointed to the scale of impact on the economy and society in both cases. AI, in particular, has been a polarizing topic, prompting tech leaders like Elon Musk to <a href=\"https://cointelegraph.com/news/elon-musk-and-tech-execs-call-for-pause-on-ai-development\">warn of impending doom</a> while also <a href=\"https://cointelegraph.com/news/elon-musk-kickstarts-new-ai-company-to-understand-the-universe\">investing in the sector</a>. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ai-related-crypto-returns-rose-up-to-41-after-chatgpt-launched-study\"><strong><em>AI-related crypto returns rose up to 41% after ChatGPT launched: Study</em></strong></a></p><p>“Both represent transformative technological innovation that redefine industries and change societal behaviors,” he said. </p><p>“As with the dot-com bubble, with AI, we’re experiencing a hype cycle characterized by rapid innovation, a frothy investment environment, a lot of new entrants and, I think, inflated expectations,” Nothhaft added.</p><h2>AI still in its infancy</h2><p>Although Nothhaft thinks it’s still early to make a call on just how inflated expectations are for AI, he does believe that most of the AI companies created during this hype period will fail and a small number of winners will shape the future of the industry. </p><p>OpenAI’s chatbot ChatGPT <a href=\"https://cointelegraph.com/news/chatgpt-openai-launch-official-app-ios-iphone\">launched in November 2022</a> and quickly became one of the fastest-growing web platforms in history, eclipsing 1 million daily users in just five days and <a href=\"https://www.reuters.com/technology/chatgpt-sets-record-fastest-growing-user-base-analyst-note-2023-02-01/\" target=\"_blank\" rel=\"noopener nofollow\">reaching</a> the 100 million monthly users mark by January 2023.</p><p>However, it has seen a <a href=\"https://cointelegraph.com/news/chatgpt-sees-traffic-fall-10-in-june-after-initial-rush-from-users\">dropoff in traffic recently</a>, and rivals such as Google’s Bard, Microsoft’s Bing and Character.ai have so far failed to reach the same levels of success. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/1f6edc75-b066-4ce2-8ad0-2db314679471.png\"  /><figcaption style=\"text-align: center;\">Preliminary data on ChatGPT’s traffic performance against Bing, Character.ai and Bard. Source: Similarweb</figcaption></figure><p>According to Nothhaft, AI won’t experience a crash on the same scale as the dot-com bubble though. Unlike the early years of the internet, which he thinks were more a period of exploration and novelty than utility, AI has already seen applications across various sectors, including media, healthcare, finance, transportation and education.</p><p>“While AI is just in the infancy of its capabilities, these applications of AI are not future projections — they’re here and now. AI is delivering tangible value today,\" Nothhaft said.</p><p>“Soon, it will be challenging to distinguish between the AI industry and the broader software industry, as AI will become a ubiquitous part of the digital landscape,” he added. </p><h2>AI and crypto</h2><p>AI’s rise has drawn parallels with crypto as well, which has had its own meteoric rise over the last decade, surpassing a total market cap of $3 trillion at its peak in November 2021 before losing more than half its value in 2022.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/48bab3f4-f26f-4396-a00b-dfc4ea5a837f.jpg\"  /><figcaption style=\"text-align: center;\">The crypto market cap reached all-time highs in 2021 before crashing back to earth. Source: CoinGecko</figcaption></figure><p><a href=\"https://cointelegraph.com/news/to-ico-or-to-ido-that-is-the-question\">Initial coin offerings (ICO)</a> gained enormous popularity as a fundraising technique for blockchain initiatives between 2016 and 2017. One key benefit was that entrepreneurs could receive funds directly from the crypto community.</p><p><a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">Nonfungible tokens (NFT)</a> also experienced a massive boom period, but Nothhaft said NFTs and ICOs couldn’t be more different from AI.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-is-just-like-the-end-of-the-90s-with-the-internet-bubble-says-hodl-ceo-maurice-mureau\"><strong><em>Crypto is ‘just like the end of the 90s with the internet bubble,’ says Hodl CEO Maurice Mureau</em></strong></a></p><p>According to Nothhaft, NFTs and ICOs represent niche applications of blockchain tech, while AI <a href=\"https://cointelegraph.com/news/ai-in-healthcare-new-tech-in-diagnosis-and-patient-care\">represents substantial technological innovation</a> with wide-ranging, tangible applications.</p><p>“Unlike the crypto space, where the hype has often exceeded reality, the promise of AI is grounded in substantial technological advancements and nearly limitless applications,” he said. </p><blockquote>“The growth of AI may seem rapid, but it’s not a bubble in the way that we’ve seen with certain crypto phenomena.” </blockquote><p>Sam Huber, CEO of <a href=\"https://cointelegraph.com/news/industry-seeks-solutions-for-nft-image-hosting-disasters\">metaverse platform LandVault</a>, shared another perspective with Cointelegraph. He believes that NFTs and ICOs do share some similarities to the AI market, particularly in terms of initial hype, rapid growth and subsequent potential for market corrections — but differ in the factors driving growth.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/svb-collapse-chilled-nft-trading-volumes-dappradar\"><strong><em>SVB collapse chilled NFT trading volumes: DappRadar</em></strong></a></p><p>According to Huber, AI’s growth is primarily driven by <a href=\"https://cointelegraph.com/news/zero-knowledge-proofs-artificial-intelligence-redefine-future\">technological advances and practical applications</a>, whereas crypto and related assets, such as NFTs and ICOs, frequently attract speculative investments motivated by the prospect of quick financial gains.</p><p>“AI is a broad field encompassing various technologies and applications, whereas cryptocurrencies such as Bitcoin and Ethereum are specific digital assets,” he said. </p><p>“The value proposition of AI is its ability to improve and transform multiple industries, whereas cryptocurrencies serve primarily as decentralized digital currencies or investment assets,” Huber added. </p><h2>Differences from the dot-com bubble</h2><p>Huber said the rapid growth of AI and the dot-com bubble do share some parallels — specifically that in both cases, not all businesses or investment opportunities in the space have a viable business model.</p><p>“Many businesses were calling themselves ‘internet businesses’ by just having a website. It is similar to many companies today calling themselves ‘AI companies’ because they plug into ChatGPT,” he said.</p><blockquote>“These companies attract speculative investment but are not building significant differentiation nor defensible technology. When these companies fail to deliver or raise their next round, it can cause a market crash.”</blockquote><p>However, Huber says it’s a very different environment to the 1990s when the companies in the dot-com sector were going public much earlier and, once on the market, retail investors were able to invest in them. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ai-could-help-audit-smart-contracts-but-not-yet\"><strong><em>Experiments show AI could help audit smart contracts, but not yet</em></strong></a></p><p>“Today, companies are able to raise a lot more capital privately, so do not need to list,” Huber said. </p><p>“If they fail, the market impact is much less because they only have institutional investors on their cap tables, so the general public is protected and mass panic is avoided,” he added.</p><p>Overall, Huber argues that one of the main differences between other tech bubbles and AI is that it’s supported by tangible applications and use cases, with many companies incorporating AI into their operations and products.</p><p>The crypto industry is <a href=\"https://cointelegraph.com/news/here-s-how-the-crypto-industry-is-using-artificial-intelligence\">ripe with AI projects</a>, and the music and film industries have also begun <a href=\"https://cointelegraph.com/news/the-rise-of-ai-and-the-impact-it-could-have-on-the-music-industry\">experimenting with it</a>.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">AI-generated songs are getting scary good.<br><br>The music industry is NOT prepared for this.<br><br>Here&#39;s 9 songs created 100% with AI:<br><br>1. Michael Jackson singing &quot;I Feel It Coming&quot; by the Weeknd <a href=\"https://t.co/XiaHDSrXOf\">pic.twitter.com/XiaHDSrXOf</a></p>&mdash; The AI Solopreneur (@aisolopreneur) <a href=\"https://twitter.com/aisolopreneur/status/1648300684738023424?ref_src=twsrc%5Etfw\">April 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“This fundamental distinction implies that AI’s advancement is driven by practical utility rather than speculation alone,” Huber said. </p><h2>AI on a different path than dot-com bubble</h2><p>Osman Masud, CEO of independent video game developer The Game Company — which uses AI in its products — told Cointelegraph it’s unlikely AI will follow the same path as the dot-com bubble.</p><p>“The dot-com bubble was driven by speculation around internet companies. AI technologies have already proven their practical use in industries such as healthcare, finance and automation,” he said. </p><p>“While AI and the dot-com bubble have experienced rapid expansion, the difference lies in the level of maturity and tangible value generated,” Masud added.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/apple-has-gpt-ai-system-no-stated-plans-for-public-release-report\"><strong><em>Apple has its own GPT AI system but no stated plans for public release: Report</em></strong></a></p><p>Overall, Masud believes that the growth of AI is being driven by advancements in machine learning, deep learning and neural networks, which continue to evolve and improve. </p><p>With the potential to transform industries and improve efficiency, he said the AI industry is expected to continue to experience significant growth in the years to come rather than collapse.</p><p>“While there may be fluctuations and market corrections, AI’s long-term impact and potential are expected to be substantial due to its wide-ranging applications and transformative capabilities,” Masud said.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T13:44:00.000Z",
    "title": "Japan Embracing Web3 Through Policies",
    "url": "https://cryptodaily.co.uk/2023/07/japan-embracing-web3-through-policies",
    "description": "<p>Japan's Web3 strategy is likely to influence other nations' approaches to embracing the digital revolution.</p>\nCorporate Partnership To Expand Metaverse Economic Zone\n<p>Japan is set to embrace Web3 technology with the backing of major companies like Fujitsu and Mitsubishi. In a significant partnership, these companies are joining forces to create the necessary infrastructure for an open metaverse and to support Japan's Web3 strategy.</p>\n<p>Fujitsu, along with nine other firms, has revealed plans to establish an interoperable metaverse structure known as RYUGUKOKU (TBD). The primary objective of this structure is to expand the Japan Metaverse Economic Zone, enabling a seamless virtual world experience.</p>\nEstablishing An Interoperable Metaverse&nbsp;\n<p>The scope of this initiative goes beyond just entertainment and gaming. It also aims to provide a framework for corporations to leverage Web3 marketing effectively. As part of the project, prominent players such as automobile manufacturer Mitsubishi and global bank Mizuho have also stepped in, highlighting the broad support for the country's Web3 ambitions.</p>\n<p>The Japanese government has been actively promoting the adoption of emerging technologies, and Web3 is no exception. By embracing decentralized systems, blockchain, and virtual reality, Japan seeks to position itself at the forefront of technological innovation.</p>\n<p>The concept of an open metaverse holds promise in transforming various industries, from entertainment and gaming to commerce and finance. As the world moves towards a more interconnected and digitized future, creating a virtual space where users can interact seamlessly becomes increasingly vital.</p>\nJapan&rsquo;s Revised Web3 Policy\n<p>The country has already published a whitepaper earlier this year, recommending widespread Web3 adoption. On top of that, the National Tax Agency (NTA) has revised its corporate tax rules to provide a 30% tax exemption to companies issuing cryptocurrencies.&nbsp;</p>\n<p>These web3-friendly policies have raised some questions as the company had tightened regulations in the wake of major hacks like Mt. Gox and Coincheck. Initially poised to become a crypto capital, Japan's regulatory landscape changed drastically after the hacks. It was extremely challenging even to list new tokens on Japanese crypto exchanges.&nbsp;</p>\n<p>However, the nation took decisive steps to enhance security measures, requiring the separation of customer and exchange assets, with most exchange assets stored in cold wallets. As a result, when FTX faced a crisis, Japan's regulations proved effective, ensuring the potential return of Japanese customer assets. These lessons from past emergencies have empowered Japan's regulatory approach, making it more knowledgeable and resilient in crypto.</p>\n<p>Experts predict that the global Web3 market will witness exponential growth in the coming years, and Japan intends to position itself strategically to harness its benefits fully. As the infrastructure takes shape and the metaverse expands, Japan's Web3 strategy is likely to influence other nations' approaches to embracing the digital revolution.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T14:06:53.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T14:03:08.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-25T14:06:01.000Z",
    "title": "Top Crypto Expert Foresees Borroe (ROE)’s Potential to Outpace Dogecoin (DOGE) and Filecoin (FIL) in Growth",
    "url": "https://nulltx.com/top-crypto-expert-foresees-borroe-roes-potential-to-outpace-dogecoin-doge-and-filecoin-fil-in-growth/",
    "description": "In the fast-changing world of digital assets, new names keep popping up every day, but the interest in Borroe (ROE) is growing at an unprecedented pace. More specifically, the pioneering platform that challenges the traditional finance and invoice financing markets is stirring discussions in the crypto community. Renowned experts foresee Borroe’s potential not only to [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-25T14:00:47.000Z",
    "title": "Compound, Solana, and Borroe continue to show promise. Will they be Q3’s top tokens?",
    "url": "https://nulltx.com/compound-solana-and-borroe-continue-to-show-promise-will-they-be-q3s-top-tokens/",
    "description": "During the second half of 2023, the price of bitcoin, the leading cryptocurrency, reached an impressive value of $31,200, despite the many challenges faced by the market. Analysts and experts are carefully studying different factors that could affect the future direction of the price and the possibility of a significant increase in the coming months. [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-25T13:54:46.000Z",
    "title": "Chainlink (LINK) and Ripple (XRP) Bow to InQubeta (QUBE)’s AI Dominance and Vision",
    "url": "https://nulltx.com/chainlink-link-and-ripple-xrp-bow-to-inqubeta-qubes-ai-dominance-and-vision/",
    "description": "The crypto landscape is witnessing a profound shift as innovative projects like InQubeta redefine the meaning of progress and achievement. Even powerhouses like Chainlink (LINK) and Ripple (XRP) are recognizing the formidable influence InQubeta&#8217;s (QUBE) AI dominance and vision are having in the crypto space. Amid a vast ocean of cryptocurrencies, InQubeta&#8217;s success offers a [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-25T13:52:50.000Z",
    "title": "Investors Sell Their Polygon (MATIC) Bag to invest big sums in DigiToads (TOADS) Presale",
    "url": "https://nulltx.com/investors-sell-their-polygon-matic-bag-to-invest-big-sums-in-digitoads-toads-presale/",
    "description": "A revolutionary new gem, DigiToads (TOADS) is breaking new milestones during its ICO, reaching $6.2 million in presale funds. This newfound interest in the next-gen meme coin seems to be impacting Polygon (MATIC), a popular altcoin, which has experienced a noticeable dip in price over the past week. It appears that several investors are divesting [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T14:01:08.000Z",
    "title": "Spanish private bank A&G launches crypto investment fund",
    "url": "https://crypto.news/spanish-private-bank-ag-launches-crypto-investment-fund/",
    "description": "Spain's leading private bank A&#38;G has launched a crypto investment fund, indicating a rise in adoption in the European nation."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T14:02:34.000Z",
    "title": "Crypto Bull Run Guide To The Biggest Crypto Bull Run Predictions | Analyzing Bitcoin, ApeMax, Ethereum, Solana, Cardano, Ripple, and Cryptocurrencies",
    "url": "https://www.crypto-news-flash.com/crypto-bull-run-guide-to-the-biggest-crypto-bull-run-predictions-analyzing-bitcoin-apemax-ethereum-solana-cardano-ripple-and-cryptocurrencies/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-bull-run-guide-to-the-biggest-crypto-bull-run-predictions-analyzing-bitcoin-apemax-ethereum-solana-cardano-ripple-and-cryptocurrencies",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T130503.526.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T130503.526.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T130503.526-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Welcome to the comprehensive guide on the biggest crypto bull run predictions. This well-researched and in-depth analysis looks into the exciting world of cryptocurrency bull runs, covering top contenders like Bitcoin, Ethereum, Solana, Cardano, Ripple, and the new exciting coin ApeMax. Get ready to explore the crypto market as we discuss and dissect some of [...]"
  }
]