[
  {
    "source": "Cointelegraph",
    "date": "2024-04-05T08:00:00.000Z",
    "title": " BTCFi innovation to match Ethereum DeFi in the future — MerlinSwap co-founder ",
    "url": "https://cointelegraph.com/news/btcfi-innovation-match-ethereum-defi-future-merlinswap",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvNTE5MmMxMWEtZTllNi00MGI0LThlYjMtZWNmNGVjZGVlNzdiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>While Bitcoin-native DeFi used to be considered impossible, BTCFi is slowly emerging as a new blockchain paradigm, according to MerlinSwap’s co-founder.</p>\n                    <p><p data-ct-non-breakable=\"true\">Bitcoin <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a>, or BTCFi, is a recent paradigm seeking to bring DeFi capabilities to the world’s first blockchain network. Provided that its current adoption rate continues, BTCFi could match the innovation of Ethereum-based DeFi in the future.</p><p>This is the view of Nash Lee, co-founder of MerlinSwap, who told Cointelegraph:</p><p data-ct-non-breakable=\"true\">Showcasing investor demand for Bitcoin-native DeFi applications, decentralized exchange (DEX) MerlinSwap raised 6,599 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) worth $480 million during its initial DEX offering (IDO) on April 5. The IDO attracted over 52,000 participants. </p><p><a href=\"https://cointelegraph.com/news/btcfi-innovation-match-ethereum-defi-future-merlinswap\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-05T07:47:01.000Z",
    "title": " Paradigm leads $20M funding round for Ellipsis Labs’ DeFi expansion ",
    "url": "https://cointelegraph.com/news/paradigm-20m-funding-ellipsis-labs-defi-expansion",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvOTdlNzM1OTUtYmU5Ny00MWE4LWEzYTItMTU5NDcwN2E0NjhhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ellipsis Labs will use the new funding to accelerate the progress of DeFi up and down the stack.</p>\n                    <p><p data-ct-non-breakable=\"true\">Ellipsis Labs, a developer in the crypto exchange sector, has secured $20 million in Series A funding, with Paradigm leading the investment round.</p><p>According to a <a href=\"https://twitter.com/ellipsis_labs/status/1775893415466848720\" target=\"_blank\" rel=\"noopener nofollow\">post</a> on X, Electric Capital also participated in the round, which had additional support from Justin Drake and Mike Neuder of the Ethereum Foundation, Sreeram Kannan from EigenLayer, Anatoly Yakovenko from Solana Labs, Uri Klarman from bloXroute and others</p><p>Ellipsis Labs is the developer behind Phoenix, a decentralized exchange (DEX) with an on-chain order book built on the Solana blockchain. </p><p><a href=\"https://cointelegraph.com/news/paradigm-20m-funding-ellipsis-labs-defi-expansion\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-05T08:01:29.000Z",
    "title": "Philippines SEC Targets eToro Following Binance Action",
    "url": "https://cryptodaily.co.uk/2024/04/philippines-sec-targets-etoro-following-binance-action",
    "description": "The Philippines Security and Exchange Commission has issued an advisory against online trading platform eToro, accusing it of offering unregistered securities in the country."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-05T08:02:44.000Z",
    "title": "South Korean Firms Make Strides in the European Medical AI Market",
    "url": "https://www.cryptopolitan.com/south-korean-make-strides-in-the-medical/",
    "description": "EU countries experience the strong presence of South Korean medical artificial intelligence (AI) companies, which are worth $155 billion worldwide. This makes the EU the second-largest artificial intelligence marketplace after the USA. The move reflects a strategic initiative of South Korean companies to access international markets, with state-of-the-art technology putting them in a perfect position [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-04-05T08:04:49.000Z",
    "title": "A16z co-founder backs crypto startup from Goldman Sachs, BlockTower ex-staff",
    "url": "https://crypto.news/a16z-co-founder-backs-crypto-startup-from-goldman-sachs-blocktower-ex-staff/",
    "description": "A new crypto startup Neoclassic Capital founded by former employees from Goldman Sachs, BlockTower raised funding from Marc Andreessen, Chris Dixon, and Jeff Vinik. A pair of alumni from banking giant Goldman Sachs, BlockTower Capital secured funding for their new&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-04-05T08:02:59.000Z",
    "title": "Bhutan to increase Bitcoin mining operations sixfold ahead of halving",
    "url": "https://crypto.news/bhutan-to-increase-bitcoin-mining-operations-sixfold-ahead-of-halving/",
    "description": "Bhutan and Bitdeer are set to expand Bitcoin mining capacity amid halving concerns, aiming to expand the nation&#8217;s mining capacity by 500 megawatts by 2025. Bhutan&#8216;s investment arm, Druk Holding &#38; Investments (DHI), is gearing up to boost its mining&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-04-05T07:40:01.000Z",
    "title": "Analyst drops huge DOGE price prediction; FET, KangaMoon surge",
    "url": "https://crypto.news/analyst-drops-huge-doge-price-prediction-fet-kangamoon-surge/",
    "description": "Amid Bitcoin's dominance, Dogecoin's anticipated bull run, Fetch.ai's record highs, and KangaMoon's presale success spotlight the diversifying landscape of cryptocurrency investments. #sponsored"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-05T08:00:40.000Z",
    "title": "Bitcoin Crash Warning: CryptoQuant CEO Sees LUNA-Like Risks Ahead",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-crash-cryptoquant-ceo-luna-like-risks-ahead/",
    "description": "Ethena Labs has revealed its latest strategic move: the inclusion of Bitcoin (BTC) as collateral for its synthetic dollar-pegged product, USDe. This decision, aimed at significantly scaling the product&#8217;s supply from its current $2 billion, capitalizes on the burgeoning BTC derivative markets for enhanced scalability and liquidity in delta hedging practices. Ethena Labs&#8217; ambitious goal is to leverage the considerable growth of BTC open interest, which has seen a substantial rise from $10 billion to $25 billion in just one year, far outpacing Ethereum&#8217;s (ETH) growth rates. Ethena&#8217;s statement highlighted the strategic benefits of integrating BTC, emphasizing the superior liquidity and duration profile of Bitcoin compared to liquid staking tokens and the potential for USDe to achieve greater scalability as a result &#8220;With $25bn of BTC open interest readily available for Ethena to delta hedge, the capacity for USDe to scale has increased &#62;2.5x,&#8221; the announcement noted, illustrating the robust backing that BTC provides. Excited to announce that Ethena has onboarded BTC as a backing asset to USDe This is a crucial unlock which will enable USDe to scale significantly from the current $2bn supply pic.twitter.com/FOZRWBrVZV &#8212; Ethena Labs (@ethena_labs) April 4, 2024 CryptoQuant CEO Issues Bitcoin Crash Warning This move has not been met without skepticism. Ki Young Ju, CEO of the analytics firm CryptoQuant, took to X to voice his concerns, drawing parallels to the infamous LUNA collapse and questioning the risk management strategies employed by Ethena Labs. &#8220;This isn&#8217;t good news for Bitcoin holders—it sounds like a potential contagion risk, like LUNA. How do they maintain a delta-neutral strategy for BTC in bear markets?&#8221; Ju queried, implying that the success of such strategies is largely contingent on market conditions that favor bull runs. Related Reading: Bitcoin Bulls Roar: Analysts Predict Surge To $82,000 Amid Bullish Pennant Formation He further elaborated on the complexities of shorting BTC in bear markets, suggesting that the market size for such operations could be smaller than the total value locked (TVL), potentially leading to significant market disruptions. The CryptoQuant CEO stated: How do they maintain a delta-neutral strategy for BTC in bear markets? In bull markets, they hold spot BTC and short BTC. If there&#8217;s a method to short BTC by holding some DeFi-wrapped BTC, the market size would be smaller than its TVL. This is a CeFi stablecoin run by a hedge fund, effective only in bull markets. Correct me if I&#8217;m wrong. Ju added that he’S concerned about a repeat of a LUNA-like doom scenario: “selling BTC to stabilize USDe&#8217;s peg if their algorithm fails during bear markets.” Adding to the discourse, OMAKASE, a former advisor for Sushiswap, referenced historical challenges faced by delta-neutral strategies, highlighting their propensity to turn illiquid and the difficulty in unwinding such positions without causing market slippage. Related Reading: US Govt Moves $90 Million in Bitcoin, ETH From Estonian Scammers &#8220;Delta neutral strategies are usually never delta neutral. Post dot-com boom in Singapore, it took years for banks to unwind delta neutral books that had suddenly turned illiquid. Size begets slippage,&#8221; OMAKASE remarked, underscoring the inherent risks of such financial maneuvers. The industry&#8217;s reaction to Ethena Labs&#8217; announcement has been mixed, with some lauding the potential for increased scalability and others cautioning against the risks of replicating past financial crises. A few days ago, Fantom founder Andre Cronje also questioned the stability of USDe. Amidst these concerns, Ethena Labs stands by its decision, pointing to the advantageous market conditions and the growing BTC derivative markets as key factors supporting their strategy. &#8220;While BTC does not possess a native staking yield like staked ETH, staking yields of 3-4% are less significant in a bull market when funding rates are &#62;30%,&#8221; the company stated, indicating a strategic optimization for the current market environment. This move, according to Ethena, is not just about scaling but also about offering a safer and more robust product to its users. At press time, BTC traded at $67,018. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-04-05T08:00:11.000Z",
    "title": "Polygon Price Prediction: MATIC Targets $3 By 2024, NuggetRush Expected to 100x this Year",
    "url": "https://www.crypto-news-flash.com/polygon-price-prediction-matic-targets-3-by-2024-nuggetrush-expected-to-100x-this-year/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-price-prediction-matic-targets-3-by-2024-nuggetrush-expected-to-100x-this-year",
    "description": "<img width=\"1200\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-04T221119.790.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-04T221119.790.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-04T221119.790-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-04T221119.790-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-04T221119.790-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-04T221119.790-450x253.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />NuggetRush is a rising star in the GameFi industry, blending gaming with cryptocurrency and tangible rewards. NuggetRush play-to-earn mechanics and NFT staking platform offer users the chance to earn real-world rewards while having fun. Polygon witnessed a surge in daily active addresses, indicating renewed interest and potential for price growth. The Polygon (MATIC) chain has [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-04-05T08:00:22.000Z",
    "title": "TOKEN2049 Dubai Officially Sold Out with 10,000 Attendees Following Unprecedented Demand",
    "url": "https://coinedition.com/token2049-dubai-officially-sold-out-with-10000-attendees-following-unprecedented-demand/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"TOKEN2049 Dubai Officially Sold Out with 10,000 Attendees Following Unprecedented Demand\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2.jpg 730w, https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/04/TOKEN2049_Dubai_Officially_Sold_Out_with_10000_Attendees_Following-2-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>TOKEN2049, the premier crypto event, has officially announced that tickets for the inaugural Dubai conference have sold out over two weeks in advance with 10,000 industry participants confirmed. The unprecedented demand underscores the event&#8217;s role as the leading international gathering within the crypto and Web3 space, and the status of Dubai as a hub for [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/token2049-dubai-officially-sold-out-with-10000-attendees-following-unprecedented-demand/\">TOKEN2049 Dubai Officially Sold Out with 10,000 Attendees Following Unprecedented Demand</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]