[
  {
    "source": "Cointelegraph",
    "date": "2024-02-14T09:44:44.000Z",
    "title": " EU committee greenlights world&#039;s first AI legislation ",
    "url": "https://cointelegraph.com/news/eu-greenlights-ai-legislation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvN2Y2YTk0MDktY2M2ZC00M2Q4LWIzZTItOWI5MDNhNDNjM2NhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The European Union (EU) Committee’s endorsement follows EU countries’ voting to approve the final text of the EU’s AI Act.</p>\n                    <p><p data-ct-non-breakable=\"true\">Legislators in the European Parliament approved the preliminary agreement on groundbreaking regulations for artificial intelligence (AI) on Feb. 13. This sets the stage for the world’s first legislation on this technology, with a legislative assembly vote scheduled for April.</p><p>The <a href=\"https://www.europarl.europa.eu/news/en/press-room/20240212IPR17618/artificial-intelligence-act-committees-confirm-landmark-agreement\" target=\"_blank\" rel=\"noopener nofollow\">approval</a> by the Internal Market and Civil Liberties Committees was reached with a vote of 71-8. The AI Act, as it is commonly known, intends to establish guidelines for a technology employed across various industries, including banking, automotive, electronics, aviation, security, and law enforcement.</p><p>The regulations will oversee foundational models or generative AI, such as the one developed by OpenAI and supported by Microsoft. These are AI systems trained on extensive data sets, capable of learning from new data for diverse tasks.</p><p><a href=\"https://cointelegraph.com/news/eu-greenlights-ai-legislation\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-14T10:00:00.000Z",
    "title": "Unlock Financial Freedom: 3 Must-Have Cryptos for the Upcoming Surge: Borroe Finance, Blur, Optimism",
    "url": "https://www.cryptopolitan.com/unlock-financial-freedom-3-must-have-cryptos-for-the-upcoming-surge-borroe-finance-blur-optimism/",
    "description": "If you are looking for tokens that can make you a crypto millionaire in 2024, experts have recommended Blur (BLUR), Optimism (OP), and Borroe Finance ($ROE). Blur whales are accumulating tokens, while Optimism is improving its network operations. Similarly, Borroe Finance also plans to revolutionize web3 fundraising. Keep reading to see expert forecasts and opinions [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-14T09:54:27.000Z",
    "title": "Russia witnesses alarming rise in crypto-related fraud",
    "url": "https://www.cryptopolitan.com/russia-witnesses-alarming-crypto-fraud/",
    "description": "In a revealing report from the Central Bank of Russia, a significant shift in the landscape of fraudulent financial schemes has been highlighted, with cryptocurrency emerging as the primary tool for illicit activities. The report underscores a worrying trend in 2023, where nearly all pyramid schemes and illegal brokerages have leveraged cryptocurrencies to facilitate their [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-14T09:53:34.000Z",
    "title": "Reserve Bank of New Zealand governor sparks debate with comments on central banking and Bitcoin",
    "url": "https://www.cryptopolitan.com/reserve-bank-of-new-zealand-governor-sparks/",
    "description": "Reserve Bank of New Zealand Governor Adrian Orr&#8217;s recent remarks during a parliamentary committee meeting have ignited discussions within the cryptocurrency community. While meant as a jest, Orr&#8217;s comments about the nature of central banking and the rise of decentralized digital currencies like Bitcoin have drawn attention and sparked debates on the future of finance. [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-14T09:53:59.000Z",
    "title": "Kaspa surging as capital flows to DeeStream presale",
    "url": "https://crypto.news/kaspa-surging-as-capital-flows-to-deestream-presale/",
    "description": "Kaspa (KAS) could reach $0.70 by the end of the year. At the same time, DeeStream (DST) can rally, though this carries more risk"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-14T09:51:33.000Z",
    "title": "Australian police officer indicted for alleged theft of 81 BTC from drug proceeds",
    "url": "https://crypto.news/australian-police-officer-indicted-for-alleged-theft-of-81-btc-from-drug-proceeds/",
    "description": "William Wheatley, an officer of the Australian police, is currently undergoing court proceedings in connection with accusations of stealing crypto assets seized during the dismantling of an online drug-trafficking operation. The officer in question is being charged with theft, managing&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-14T09:45:42.000Z",
    "title": "Kraken started requiring users from the UK to verify their self-custodial crypto wallets",
    "url": "https://crypto.news/kraken-started-requiring-users-from-uk-to-verify-their-self-custodial-crypto-wallets/",
    "description": "Crypto exchange Kraken now requires U.K. users to verify self-custodial wallets or validate wallet identities, referring to local regulations. According to an X post published by James Van Straten, analyst at CryptoSlate, the U.S.-headquartered crypto exchange Kraken has started requiring&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-14T09:43:47.000Z",
    "title": "Analysts backing 4 meme coins in 2024",
    "url": "https://crypto.news/analysts-backing-4-meme-coins-in-2024/",
    "description": "Dogecoin, Bonk, and Honk have churned millionaires in the past. In stage 5 of the presale, the Meme Moguls token trades for $0.0036"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-14T09:43:31.000Z",
    "title": "Defi TVL reaches 20-month highs with Ethereum dominating the scene",
    "url": "https://crypto.news/defi-tvl-reaches-20-month-highs-with-ethereum-dominating-the-scene/",
    "description": "The decentralized finance (defi) total value locked (TVL) has been constantly rising since the start of the month and is getting close to the $70 billion mark.&#160; According to data provided by Defi Llama, the global defi TVL recorded a&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-14T10:00:34.000Z",
    "title": "Bitcoin Price Breaks Past $51,500: 4 Key Reasons",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-breaks-past-51500-4-key-reasons/",
    "description": "On Tuesday, the Bitcoin price plunged from $49,900 to $48,300 following the release of the US inflation data. As NewsBTC reported, the data came in hotter than expected. Instead of 2.9%, headline CPI came in at 3.1%, while the core CPI was even at 3.9% instead of the expected 3.7%. The traditional financial market reacted negatively and dragged Bitcoin down with it, as expectations for interest rate cuts have shifted further into the future. The prediction markets are now pricing in only 4 rate cuts in 2024 after CPI inflation reached 3.1% in January. This is a huge drop in expectations as just over a month ago the markets were still pricing in 6 rate cuts. The Fed&#8217;s most recent forecast was for 3 rate cuts in 2024. The probability of a rate cut in March is below 10% and the probability of a rate cut in May is falling rapidly. In contrast to the S&#38;P 500, however, the Bitcoin price showed a strong reaction and quickly rose again to $49,900. The reaction of the Bitcoin market is quite telling for the short-term future. And the Bitcoin price is showing just that today. At press time, BTC rose above $51,500, marking a new yearly high. Here are 4 key reasons: #1 Record-Breaking Bitcoin ETF Inflows The surge in Bitcoin ETF inflows marks a pivotal moment for Bitcoin, reflecting a significant shift in investor sentiment and market dynamics. On a record-breaking day on Tuesday, the net inflows into spot Bitcoin ETFs reached $631 million, led by The Nine with an inflow of $704 million, signaling a substantial accumulation of Bitcoin. Key players like Blackrock and Fidelity played a significant role in this influx, with Blackrock experiencing nearly half a billion dollars ($493 million) in inflows and Fidelity $164 million. The overall net inflow of $2.07 billion over four trading days, averaging over half a billion per day, highlights the staggering sustained demand for Bitcoin. Related Reading: Inflationary Concerns Rise As US CPI Exceeds Predictions, Bitcoin Price Reacts This demand is notably new capital, as GBTC outflows remained stable at $73 million, indicating these inflows are not merely a rotation from GBTC but represent fresh investments. Matt Hougan, CIO of Bitwise emphasized the significance of this movement: IMHO the [numbers] undercounts the fundamental new investor demand for these ETFs. People assume all of the money flowing out of GBTC to date is rotating into other bitcoin ETFs. But a good chunk of it is from inorganic holders [&#8230;] Long-term investors have backfilled that and added $3b more on top. I suspect the real new investor-led new demand is north of $5b, and shows no signs of slowing. #2 Genesis GBTC Liquidation Concerns Alleviated Fears of a Bitcoin crash, similar to FTX&#8217;s sale of GBTC, triggered by Genesis&#8217; planned liquidation of Grayscale Bitcoin Trust (GBTC) shares have been alleviated, as reported today on Bitcoinist. The liquidation, necessary due to Genesis&#8217; bankruptcy, was initially viewed as a potential market downturn catalyst. The bankrupt lender needs to liquidate approximately 36 million shares of GBTC, valued at around $1.5 billion, as part of its strategy to resolve financial challenges stemming from significant loans and regulatory settlements. Related Reading: Bitcoin Continues To Break Wall Street Records: The Whales Are Here However, the proposed Chapter 11 settlement involves in-kind repayments to creditors, reducing direct selling pressure on Bitcoin. This strategy aligns with the interests of long-term Bitcoin holders, potentially limiting market volatility. Greg Schvey, CEO at Axoni, highlighted: The proposed Ch 11 settlement requires Genesis to repay creditors in kind (i.e. bitcoin lenders receive bitcoin in return, rather than USD). [&#8230;] Notably, in-kind distribution was a priority negotiation topic to prevent long-term BTC holders from recognizing gains when receiving USD back (i.e. a forced sale). This would seem to indicate a substantial volume of lenders don&#8217;t plan to sell immediately. #3 OTC Demand Exceeds Supply The statement by CryptoQuant CEO Ki Young Ju that &#8220;Bitcoin demand exceeds supply at OTC desks currently&#8221; is a significant indicator of underlying market strength. OTC transactions, preferred by large institutional investors for their discretion and minimal market impact, are reflecting a robust demand for Bitcoin. This demand-supply imbalance at OTC desks suggests that large players are accumulating Bitcoin, a bullish signal for the cryptocurrency&#8217;s price outlook. #4 Futures And Spot Market Dynamics The analysis of futures and spot market indicators by @CredibleCrypto sheds light on the technical factors signaling a bullish continuation for Bitcoin. The analyst points out, &#8220;Data supporting the idea that that was &#8216;the dip&#8217;. &#8211; OI reset back to levels before the last pump &#8211; Funding decreasing through this local consolidation &#8211; Spot premium is back.&#8221; These observations suggested a healthy market correction rather than the start of a bearish trend, with the reset in open interest and the decrease in funding rates indicating that the market has absorbed the shock and is primed for upward movement. In conclusion, The combination of record ETF inflows, alleviated concerns over Genesis&#8217; GBTC liquidation, strong OTC demand, and favorable futures and spot market dynamics provides a compelling case for Bitcoin&#8217;s potential rally. Each of these factors, supported by expert insights and market data, underscores a growing investor confidence. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-14T10:07:58.000Z",
    "title": "Bitcoin Maven Tuur Demeester Forecasts $600K BTC Price Amid Global Economic Turmoil",
    "url": "https://www.crypto-news-flash.com/bitcoin-maven-tuur-demeester-forecasts-600k-btc-price-amid-global-economic-turmoil/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-maven-tuur-demeester-forecasts-600k-btc-price-amid-global-economic-turmoil",
    "description": "<img width=\"1200\" height=\"799\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-13T091740.506.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-13T091740.506.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-13T091740.506-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-13T091740.506-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-13T091740.506-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-13T091740.506-450x300.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Bitcoin has surpassed $50,000, boosted by the approval of spot Bitcoin ETFs and anticipation of the next halving event. Analysts predict Bitcoin&#8217;s price could reach between $200,000 and $600,000 by 2026 due to macroeconomic factors and increased demand. Bitcoin has once again crossed the $50,000 threshold, marking a significant recovery and stirring optimism in the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-14T10:00:58.000Z",
    "title": "Curbing the $1.3B Romance Scams: How Binance is Protecting Hearts and Wallets",
    "url": "https://www.crypto-news-flash.com/curbing-the-1-3b-romance-scams-how-binance-is-protecting-hearts-and-wallets/?utm_source=rss&utm_medium=rss&utm_campaign=curbing-the-1-3b-romance-scams-how-binance-is-protecting-hearts-and-wallets",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/scam-4126798_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/scam-4126798_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/scam-4126798_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/scam-4126798_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/scam-4126798_1920-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/scam-4126798_1920-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/scam-4126798_1920-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/scam-4126798_1920-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/scam-4126798_1920-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/scam-4126798_1920-48x32.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Online romance and dating scams defrauded $1.3 billion from over 70,000 victims in 2022, a sharp surge from 11,000 victims in 2016, according to FTC data. Binance is curbing these scams, many of which rely on crypto, and is working with the FBI and the DOJ to crack down on scammers while training thousands of [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-14T09:50:09.000Z",
    "title": "Polyhedra Network Airdrop Guide",
    "url": "https://www.altcoinbuzz.io/product-release/polyhedra-network-airdrop-guide/",
    "description": "<p>With the Polyhedra Network, we move into the Web3 infrastructure builders space. Among others, it built a cross-chain bridge for NFTs. This bridge uses zk-tech or zero knowledge tech. By using the ZK tech, it manages to find a way to include privacy and remain compliant. Currently, it already supports well over 20 blockchains. There&#8217;s [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/product-release/polyhedra-network-airdrop-guide/\">Polyhedra Network Airdrop Guide</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-14T09:48:00.000Z",
    "title": "Is ERC404 on Notice? New Standard DN404 Promises Improved Efficiency",
    "url": "https://coinedition.com/is-erc404-on-notice-new-standard-dn404-promises-improved-efficiency/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency.jpg 730w, https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/02/Is_ERC404_on_Notice_New_Standard_DN404_Promises_Improved_Efficiency-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A team of anonymous developers has announced the launch of a new blockchain token standard, DN404. In a post on X (formerly Twitter), the team’s representative noted that the novel protocol aims to solve the critical issues arising from the newly popular &#8220;ERC404&#8221; tokens. According to the anonymous team representative, ERC404 integrated functionalities from ERC20 [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/is-erc404-on-notice-new-standard-dn404-promises-improved-efficiency/\">Is ERC404 on Notice? New Standard DN404 Promises Improved Efficiency</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]