[
  {
    "source": "CoinDesk",
    "date": "2023-08-21T13:30:26.000Z",
    "title": "BNB Chain Exploiter Liquidated for $30M on Venus Protocol",
    "url": "https://www.coindesk.com/tech/2023/08/21/bnb-chain-exploiter-liquidated-for-30m-on-venus-protocol/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "This is the second major liquidation in under a week and potentially safeguards bnb prices from crashing suddenly."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T13:28:41.000Z",
    "title": "Ethereum co-founder Vitalik Buterin moves $1M of ETH to Coinbase",
    "url": "https://cointelegraph.com/news/ethereum-co-founder-vitalik-buterin-moves-600-eth-to-coinbase",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/2cea5bca-766a-4d29-ba69-5dd0740091e3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Onchain data shows that Ethereum co-founder Vitalik Buterin moved 600 ETH to U.S. exchange Coinbase amid ongoing market woes.</p>\n                    <p><p>Blockchain sleuths have flagged the transfer of $1 million of ETH belonging to a wallet controlled by Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) co-founder Vitalik Buterin as cryptocurrency markets remain depressed after widespread weekend losses.</p><blockquote class=\"twitter-tweet\"><p lang=\"et\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/PeckShieldAlert?src=hash&amp;ref_src=twsrc%5Etfw\">#PeckShieldAlert</a> vitalik.eth has transferred 600 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> (~$1M) to <a href=\"https://twitter.com/hashtag/Coinbase?src=hash&amp;ref_src=twsrc%5Etfw\">#Coinbase</a> <a href=\"https://t.co/XVTwLqPENM\">pic.twitter.com/XVTwLqPENM</a></p>&mdash; PeckShieldAlert (@PeckShieldAlert) <a href=\"https://twitter.com/PeckShieldAlert/status/1693541323532620159?ref_src=twsrc%5Etfw\">August 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The publicly labeled Ethereum wallet address <a href=\"https://etherscan.io/address/0xd8da6bf26964af9d7eed9e03e53415d37aa96045\" target=\"_blank\" rel=\"noopener nofollow\">vitalik.eth</a><a href=\"https://etherscan.io/address/0xd8da6bf26964af9d7eed9e03e53415d37aa96045\" target=\"_blank\" rel=\"noopener nofollow\"></a> transferred 600 ETH on Aug. 21, with the address still holding over 3,900 ETH valued at $6.5 million as per data from Etherscan.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/29e410a4-bf32-480c-9257-ca8086f1d5b6.png\"  /></figure><p>Blockchain data analysis from Lookonchain also revealed that vitalik.eth repaid 251,000 RAI tokens on Maker and withdrew 1,000 ETH, worth $1,67 million, hours before the movement of ETH to Coinbase.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">vitalik.eth repaid 251K <a href=\"https://twitter.com/search?q=%24RAI&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$RAI</a> on <a href=\"https://twitter.com/hashtag/Maker?src=hash&amp;ref_src=twsrc%5Etfw\">#Maker</a> and withdrew 1,000 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a>($1.67M) yesterday.<br><br>Then deposited 600 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a>($1M) to <a href=\"https://twitter.com/hashtag/Coinbase?src=hash&amp;ref_src=twsrc%5Etfw\">#Coinbase</a> 5 hrs ago.<a href=\"https://t.co/pw8ekIYSs1\">https://t.co/pw8ekIYSs1</a> <a href=\"https://t.co/rkJo42OSlq\">pic.twitter.com/rkJo42OSlq</a></p>&mdash; Lookonchain (@lookonchain) <a href=\"https://twitter.com/lookonchain/status/1693550177863549268?ref_src=twsrc%5Etfw\">August 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>A number of prominent blockchain data aggregators and publications shared insights into the transfer of 600 ETH to United States-based cryptocurrency exchange Coinbase. The move caused a stir on social media in the hours after the transfer, with speculation around the transaction rife. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">JUST IN: <a href=\"https://twitter.com/hashtag/Ethereum?src=hash&amp;ref_src=twsrc%5Etfw\">#Ethereum</a> founder Vitalik Buterin transfers 600 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> ($1,000,000) to Coinbase.</p>&mdash; Watcher.Guru (@WatcherGuru) <a href=\"https://twitter.com/WatcherGuru/status/1693594618766545320?ref_src=twsrc%5Etfw\">August 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Buterin's transaction comes as wider cryptocurrency markets remain fragile follow a sharp correction over the weekend. Bitcoin and Ethereum <a href=\"https://cointelegraph.com/news/bitcoin-bearadise-20k-back-btc-price-target\">saw losses of 11%</a> and <a href=\"https://cointelegraph.com/ethereum-price\">8%</a> respectively. </p><p><a href=\"https://cointelegraph.com/news/vitalik-dumps-700k-worth-of-shitcoins-that-he-never-asked-for\"><strong><em>Related: Vitalik dumps $700K worth of shitcoins that he never asked for</em></strong></a></p><p>As Cointelegraph has previously <a href=\"https://cointelegraph.com/news/as-ether-price-breaks-all-time-high-buterin-s-eth-holdings-up-8x-in-a-year\">reported</a>, Buterin has admitted to selling portions of his ETH holdings on separate occasions <a href=\"https://cointelegraph.com/news/vitalik-buterin-sold-his-ether-for-fiat-not-bitcoin\">over the past five years</a> and has also publicly dumped tokens he has received in <a href=\"https://cointelegraph.com/news/vitalik-dumps-700k-worth-of-shitcoins-that-he-never-asked-for\">unsolicited alt coin airdrops</a>.</p><p><em>Magazine: <a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\">Deposit risk: What do crypto exchanges really do with your money?</a></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-21T13:20:02.000Z",
    "title": "Shiba Memu Ignites the Crypto World: $2M Presale Surge as Meme Coin Races Toward Listing",
    "url": "https://www.cryptoglobe.com/latest/2023/08/shiba-memu-ignites-the-crypto-world-2m-presale-surge-as-meme-coin-races-toward-listing/",
    "description": "London, United Kingdom, August 21st, 2023, Chainwire Shiba Memu, a dynamic new cryptocurrency meme coin supported by AI, is causing a stir as its presale surpasses the impressive $2 million fundraising milestone. This remarkable achievement was further spurred by the recent news it would list on BitMart, a renowned crypto exchange, all within the first […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-21T13:13:35.000Z",
    "title": "$SHIB: An Overview of Shytoshi Kusama’s Vision for the Shiba Inu Decentralized Digital Nation",
    "url": "https://www.cryptoglobe.com/latest/2023/08/shib-an-overview-of-shytoshi-kusamas-vision-for-the-shiba-inu-decentralized-digital-nation/",
    "description": "Shytoshi Kusama, the lead developer of the Shiba Inu (SIB) project, has recently unveiled an abridged 26-page version of the Shiba Inu World Paper, commonly referred to as the “ShibPaper.” This document presents an innovative blueprint for a digital society that harmoniously merges traditional values with modern technological advancements. The Shiba Inu Digital Realm stands […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-21T13:37:40.000Z",
    "title": "\n                        Beyond Instant Payments: Zebec Launches Modular L3 Nautilus for Scalable Payment Streaming\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/beyond-instant-payments-zebec-launches-modular-l3-nautilus-for-scalable-payment-streaming",
    "description": "\n                        <p>New York, USA, August 21st, 2023, Chainwire</p>\n<p>&nbsp;</p>\n<p>Zebec has launched Nautilus, a modular L3 network that supports its blockchain-based global payment infrastructure. Nautilus enables continuous payment streaming and real-time payroll services on a previously impossible scale.</p>\n<p>As a first-of-its-kind L3, Nautilus enables more than just instant payments. It can also facilitate Zebec Protocol&rsquo;s live-payment streaming service at scale, made possible by the fastest EVM environment in web3.&nbsp;</p>\n<p>Capable of parallel transaction processing, Nautilus is built for scalability, interoperability, and security through interchangeable modules for consensus, settlement, data availability, and transaction execution. This modularity will have a significant impact on how web3 payment infrastructure is composed and adopted.</p>\n<p>\"Zebec is helping to create a future where money moves more freely, providing individuals, businesses, investors, and teams with quicker and easier access to funds and tokens,\" said Zebec Founder Sam Thapaliya. \"Launching the Nautilus Chain, and the new suite of products built on it, is a significant step towards our vision.\"</p>\n<p>With Nautilus now live, Zebec&rsquo;s team is set to bring single-side staking and DeFi yields online in select jurisdictions and power ZebecPay - its live streaming web3 payroll services. Zebec is also in the process&nbsp;of launching a traditional payroll app, WageLink, with a planned integration with Circle. With the Nautilus chain functionality, Zebec is able to offer crypto off-ramps directly linked to US bank accounts (via a partnership with CoinFlow) and roll out Zebec Card programs in Asia and Europe. These products and services will augment Zebec's existing services.</p>\n<p>Zebec started as a continuous settlement protocol that enabled real-time payments, or payment streaming, allowing businesses to pay employees and partners in real-time in a tax-compliant way. However, the limitations of existing blockchain technology soon became apparent. Networks were either too slow or too unreliable to keep up with demand. To solve the issue, Zebec Labs created a next-generation blockchain: fast enough to facilitate payment streaming at scale, which could, critically, integrate with Ethereum-based chains.&nbsp;</p>\n<p>Originally planned for Zebec&rsquo;s core DeFi projects for internal payments and value/assets transfer, Nautilus testnet became one of the most prominent testnets in the crypto world. Having facilitated over 50 million transactions, with 400,000 wallets and 3,000 smart contracts deployed in its first 8 months, Nautilus chain has proven its utility and functionality beyond DeFi and opened to projects from other sectors, such as NFTs, Gamefi, etc., thus becoming a &ldquo;general purpose&rdquo; L3.</p>\n<p>A huge upside to Nautilus&rsquo; modular system is that it gives developers the flexibility to configure the &ldquo;chain stack&rdquo; they use to build their dApps. A modular chain uses interchangeable modules for consensus, data availability, settlement, and execution. Each of these layers can be configured to developer needs or optimized based on the dApp being serviced. Especially at the execution layer, customized rollups can be deployed that optimize for privacy or scalability, or decentralization &mdash; whatever is required by the dApp.&nbsp;</p>\n<p>Modular chains allow for infinite horizontal scaling and greater levels of interoperability. Since developers build from the same pool of modules, code is safer, more battle-tested, and easier to connect. More rollups and parallel chains can be deployed to increase block space and throughput effectively. Nautilus is a pioneer in this new type of blockchain, and its architecture will permanently change how blockchains are built and bring them into the real world.&nbsp;</p>\n<p>At launch, Nautilus&rsquo; settlement layer is built using Solana&rsquo;s VM, MOVE, and its execution layer on Neon EVM using Solidity smart contracts. Data availability is stored off-chain using Celestia. Nautilus' initial default execution layer will use optimistic rollups, but the team plans to transition to zkRollups for faster settlements, privacy, and even higher levels of scalability.&nbsp;</p>\n<p>Nautilus is built with Celestia and Eclipse empowering modular chains. Through Celesita, Nautilus allows projects to tailor their consensus and settlement layers. Eclipse allows builders on Nautilus to deploy customized rollups on their execution layer.&nbsp;</p>\n<p>The result is a chain with Soloana-like speeds but with the security and decentralization of Ethereum. According to its engineers, Nautilus has been tested up to 3,000 TPS, but the team expects the number to increase with the transition to zkRollups. By having such a high TPS, Nautilus chain provides a platform that can keep up with the demands of the real world, opening the door to decentralized markets for financial instruments and assets, such as stocks, bonds, real estate, and tokenized real-world assets.</p>\n<p>Thanks to Nautilus, Zebec can now operate on a much larger scale. Businesses can pay employees and partners in real time through live payments or payment streaming. Zebec&rsquo;s goal isn&rsquo;t merely to provide more efficient payment services; it&rsquo;s to onboard millions of new users through user-friendly, secure payment apps and new use cases.</p>\n<p>Zebec&rsquo;s innovation paves the way for pay-as-you-go payment plans for streaming services, car-sharing platforms, gyms, residential clubs, and more. It enables potential new business models and applications not yet created. As Zebec continues to innovate and grow its ecosystem, it invites developers and founders from around the world to join it in creating a more connected, efficient, and accessible financial future.</p>\n<p>About Zebec</p>\n<p>Zebec enables real-time and continuous streams of payments and financial transactions for payroll, investments, and more. It was founded in 2021, with investments from Circle, Coinbase, Solana Ventures, Breyer Capital, Republic, and Lightspeed Venture Partners, among others. Zebec already services hundreds of companies, running thousands of continuous payment streams and bringing the blockchain to our day-to-day lives.</p>\n<p>Website | Twitter | Discord | Telegram</p>\n<p>About Nautilus</p>\n<p>Nautilus is a high-performance real-world payment modular chain. Using celestia and eigenlayer, It delivers high-speed and low-cost transaction processing with a secure and stable decentralized foundation.</p>\n<p>Website | Twitter | Telegram | Medium </p>\n<p>&nbsp;</p>\nContact\n<p>Elena SolovyovZebecelena@zebec.io</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-21T13:36:44.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC, ETH Consolidate, Following Last Week’s Losses",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-eth-consolidate-following-last-weeks-losses/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077303516-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC, ETH Consolidate, Following Last Week’s Losses\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077303516-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077303516-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077303516-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077303516-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077303516-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077303516-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077303516.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin rebounded from this weekend&#x2019;s low on Monday, as markets attempted to consolidate following recent losses. The cryptocurrency rose back above the $26,000 level, after a brief stint below this point. Ethereum also settled, after declines over the weekend. Bitcoin Bitcoin was marginally higher to start the week, as the cryptocurrency climbed back above the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T13:38:55.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T13:32:23.000Z",
    "title": "Oman’s MTCIT unveils massive $350 million Bitcoin mining facility in Salalah Free Zone",
    "url": "https://www.cryptopolitan.com/omans-mtcit-unveils-massive-350-million-bitcoin-mining-facility-in-salalah-free-zone/",
    "description": "The Ministry of Transport, Communications, and Information Technology (MTCIT) in Oman has unveiled a state-of-the-art Bitcoin mining and data hosting facility within the Salalah Free Zone. Valued at approximately $350 million (RO 135 million), the newly established facility marks a significant stride toward positioning Oman as a global data hosting and mining epicenter. This recent ... <a title=\"Oman&#8217;s MTCIT unveils massive $350 million Bitcoin mining facility in Salalah Free Zone\" class=\"read-more\" href=\"https://www.cryptopolitan.com/omans-mtcit-unveils-massive-350-million-bitcoin-mining-facility-in-salalah-free-zone/\" aria-label=\"More on Oman&#8217;s MTCIT unveils massive $350 million Bitcoin mining facility in Salalah Free Zone\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T13:24:15.000Z",
    "title": "Popular Web3 platform Recur to shut down its NFT platform despite $50 million raise",
    "url": "https://www.cryptopolitan.com/recur-to-shut-down-its-nft-platform-despite-50-million-raise/",
    "description": "Recur, a prominent Web3 platform known for hosting big-name IPs like Hello Kitty and Nickelodeon, announced the discontinuation of its platform on August 18. Despite raising $50 million and being valued at $333 million in late 2021, the company cited unforeseen challenges and shifts in the business landscape as the reason for its closure. Founded ... <a title=\"Popular Web3 platform Recur to shut down its NFT platform despite $50 million raise\" class=\"read-more\" href=\"https://www.cryptopolitan.com/recur-to-shut-down-its-nft-platform-despite-50-million-raise/\" aria-label=\"More on Popular Web3 platform Recur to shut down its NFT platform despite $50 million raise\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-21T13:32:28.000Z",
    "title": "Bitcoin Ordinals dominate majority of BTC transactions",
    "url": "https://crypto.news/bitcoin-ordinals-dominate-majority-of-btc-transactions/",
    "description": "Despite the recent price drop and fading hype over NFTs, Ordinals inscriptions remain prominent on the Bitcoin (BTC) network. On Aug. 21, the developer behind Ordinals, known as &#8220;Leonidas,&#8221; revealed that Bitcoin had processed 530,788 transactions in the past 24&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-21T13:25:22.000Z",
    "title": "Glow token founder sues Crypto.com after falling victim to scam",
    "url": "https://crypto.news/glow-token-founder-sues-crypto-com-after-falling-victim-to-scam/",
    "description": "After falling victim to an apparent scam, Bryan Lawrence, CEO of crypto startup Glow Token, has sued major crypto exchange Crypto.com. Glow Token LLC has taken legal action in a Florida court against Crypto.com, accusing the exchange of breach of&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-21T13:14:22.000Z",
    "title": "What is Friend.tech, social platform earning over $1m in fees",
    "url": "https://crypto.news/what-is-friend-tech-social-platform-earning-over-1m-in-fees/",
    "description": "Friend.tech, a decentralized social platform, sees a rapid ascent post-beta launch, sparking debates on data privacy and novel monetization of social interactions. Friend.tech has set the crypto world abuzz in less than a week since its beta launch. This decentralized&#8230;"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-21T13:30:51.000Z",
    "title": "PancakeSwap (CAKE) Price Prediction 2023-2030: Will CAKE Price Reach $10 Soon?",
    "url": "https://coinedition.com/pancakeswap-cake-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/PancakeSwap-CAKE-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Pancake Swap (CAKE) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/PancakeSwap-CAKE-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/PancakeSwap-CAKE-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/PancakeSwap-CAKE-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/PancakeSwap-CAKE-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/PancakeSwap-CAKE-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>PancakeSwap (CAKE) is the most popular decentralized exchange on the BNB Chain. PancakeSwap allows you to trade directly from your wallet without using a centralized exchange. On this exchange, you can swap BEP-20 tokens, stake CAKE in Syrup Pools, lend and offer liquidity on the automated market maker (AMM), participate in IFOs (Initial Farm Offerings), [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/pancakeswap-cake-price-prediction/\">PancakeSwap (CAKE) Price Prediction 2023-2030: Will CAKE Price Reach $10 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-21T13:25:00.000Z",
    "title": "Binance Listing Spurs Bullish CYBER Surge, Is a Reversal Imminent?",
    "url": "https://coinedition.com/binance-listing-spurs-bullish-cyber-surge-is-a-reversal-imminent/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent.png 730w, https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/Binance_Listing_Spurs_Bullish_CYBER_Surge_Is_a_Reversal_Imminent-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Binance&#8216;s recent announcement of listing CyberConnect (CYBER) futures trading, available at 20x leverage, has fueled a bullish surge in the cryptocurrency. As a result, the price of CYBER rocketed from an intra-day low of $4.14 to a 24-hour high of $4.72&#160; before facing resistance. CYBER token at press time was priced at $4.44, reflecting a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-listing-spurs-bullish-cyber-surge-is-a-reversal-imminent/\">Binance Listing Spurs Bullish CYBER Surge, Is a Reversal Imminent?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-08-21T13:11:35.000Z",
    "title": "Bitfinex Alpha | Brace for More Volatility",
    "url": "https://blog.bitfinex.com/bitfinex-alpha/bitfinex-alpha-brace-for-more-volatility/",
    "description": "<p>Markets were left reeling last week as Bitcoin plunged below the psychologically significant $25,000 mark. This recent downward spiral was accompanied by a hair-raising $1 billion in futures liquidations. Before this tumble, Bitcoin had been enjoying an almost serene market period, with historically low volatility...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/bitfinex-alpha/bitfinex-alpha-brace-for-more-volatility/\">Bitfinex Alpha | Brace for More Volatility</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]