[
  {
    "source": "CoinDesk",
    "date": "2024-01-09T22:03:04.000Z",
    "title": "Spot Bitcoin ETF Approval Will Trigger 'Selling Pressure' on CME Futures Market: K33",
    "url": "https://www.coindesk.com/markets/2024/01/09/spot-bitcoin-etf-approval-will-trigger-selling-pressure-on-cme-futures-market-k33/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin futures' open interest on the Chicago Mercantile Exchange surged to an all-time high Tuesday as institutions piled into the asset, speculating on a spot bitcoin ETF approval."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-09T21:49:47.000Z",
    "title": "Bitcoin Plunges After 'Compromised' SEC Twitter Account Tweets Fake ETF Approval",
    "url": "https://decrypt.co/212195/bitcoin-plunges-after-compromised-sec-twitter-account-tweets-fake-etf-approval",
    "description": "Bitcoin briefly hit a two-year high after apparent news of a spot ETF approval, but the price fell sharply after it was revealed to be false."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T21:53:31.000Z",
    "title": " Update: Spot Bitcoin ETFs not yet approved in the United States ",
    "url": "https://cointelegraph.com/news/spot-bitcoin-etf-approval-united-states",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYzc4OTJiMTQtMjU1Mi00MDA5LWJjNDgtNzkzZDY2MTU4ZWU2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The United States Securities and Exchange Commission has not given the green light to the first spot Bitcoin ETF in the country on Tuesday, Garry Gensler confirms on X. </p>\n                    <p><p>A false story was published after the official X (formerly Twitter) account from the United States Securities and Exchange Commission (SEC) posted a tweet claiming that the regulator had approved spot Bitcoin ETF.</p><p>In a Jan. 9 X post, SEC chair Gary Gensler <a href=\"https://twitter.com/GaryGensler/status/1744833049064288387\" target=\"_blank\" rel=\"noopener nofollow\">confirmed</a> the commission had “not approved the listing and trading of spot bitcoin exchange-traded products,” despite a tweet from the official SEC X account. News outlets, including Cointelegraph, Blockworks, and Reuters initially reported on the story from the SEC before Gensler’s statement.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><p><a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-approval-united-states\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-09T22:08:58.000Z",
    "title": "SEC’s Twitter/X was hacked to post fake spot Bitcoin ETF approval: Gensler",
    "url": "https://cryptoslate.com/secs-twitter-x-was-hacked-to-post-fake-spot-bitcoin-etf-approval-gensler/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) said that its Twitter/X profile was hacked on Jan. 9 to post a false ETF approval message. Gary Gensler, chair of the SEC, wrote: &#8220;The [SEC] twitter account was compromised, and an unauthorized tweet was posted. The SEC has not approved the listing and trading of spot bitcoin [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/secs-twitter-x-was-hacked-to-post-fake-spot-bitcoin-etf-approval-gensler/\">SEC’s Twitter/X was hacked to post fake spot Bitcoin ETF approval: Gensler</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-09T22:00:32.000Z",
    "title": "Elon Musk’s X platform to introduce peer-to-peer payments",
    "url": "https://cryptoslate.com/elon-musks-x-platform-to-introduce-peer-to-peer-payments/",
    "description": "<p>Social media platform X (formerly Twitter) will launch a peer-to-peer (P2P) payment system this year. In a Jan. 9 post outlining its roadmap for the new year, the microblogging platform unveiled plans for this payment system, emphasizing its potential to enhance user utility and open new avenues for commerce. &#8220;We will launch peer-to-peer payments, unlocking more [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/elon-musks-x-platform-to-introduce-peer-to-peer-payments/\">Elon Musk&#8217;s X platform to introduce peer-to-peer payments</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-09T22:00:01.000Z",
    "title": "North Korean Lazarus Group Withdraws $1 Million in BTC Using Mixing Service",
    "url": "https://news.bitcoin.com/north-korean-lazarus-group-withdraws-1-million-in-btc-using-mixing-service/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/8be70921-0a01-4b4e-b579-4732abf7ded0-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"North Korean Lazarus Group Withdraws $1 Million in BTC Using Mixing Service\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/8be70921-0a01-4b4e-b579-4732abf7ded0-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/8be70921-0a01-4b4e-b579-4732abf7ded0-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/8be70921-0a01-4b4e-b579-4732abf7ded0-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/8be70921-0a01-4b4e-b579-4732abf7ded0-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/8be70921-0a01-4b4e-b579-4732abf7ded0-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/8be70921-0a01-4b4e-b579-4732abf7ded0-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/8be70921-0a01-4b4e-b579-4732abf7ded0.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Lazarus Group, one of the most infamous cryptocurrency hacking collectives, has made one of its largest cryptocurrency withdrawals in over a month. According to Arkham, an on-chain intelligence exchange system, the group withdrew a million dollars worth of bitcoin from one of its addresses, likely using a mixing service. Lazarus Group Moves $1 Million [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T22:08:08.000Z",
    "title": "BREAKING: Gary Gensler says BTC ETFs haven’t been approved, SEC Twitter account hacked",
    "url": "https://www.cryptopolitan.com/gary-gensler-says-btc-etfs-hasnt-approved/",
    "description": "The U.S. Securities and Exchange Commission (SEC) encountered a security breach in a recent development that has stirred the cryptocurrency market. The SEC&#8217;s official Twitter account was hacked, leading to the false announcement of the approval of Bitcoin Spot Exchange-Traded Funds (ETFs).  SEC Chairman Gary Gensler promptly addressed the situation, clarifying that the tweet was [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-09T22:00:30.000Z",
    "title": "Bitcoin dips 3% on false SEC spot Bitcoin ETF approval",
    "url": "https://crypto.news/bitcoin-dips-3-on-false-sec-spot-bitcoin-etf-approval/",
    "description": "Unknown hackers hijacked the X account of the United States Securities and Exchange Commission (SEC), posting a fake spot Bitcoin ETF approval message."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-09T22:00:17.000Z",
    "title": "VanEck Announces Massive $72 Million Bitcoin ETF Seeding As Two Tickers Appear On DTCC Website",
    "url": "https://www.newsbtc.com/news/bitcoin/vaneck-72-million-bitcoin-etf/",
    "description": "As the US SEC prepares to make its final decision regarding Spot Bitcoin ETF approvals, the Depository Trust and Clearing Corporation (DTCC) has officially listed the Spot ETFs tickers from investment management firm, VanEck. VanEck’s Spot ETF Ticker Listed on DTCC American investment management firm VanEck’s Spot Bitcoin ETF has recently appeared on the active and pre-launch list of the DTCC. VanEck’s ETF can be identified by the ticker ‘HODL’ on the DTCC’s official platform.  Related Reading: Rocket Carrying Physical Dogecoin To The Moon Takes Off, But Why Is Price Struggling? This move positions VanEck as a key player in the evolving landscape of Spot ETF investments. Additionally, the listing is seen as a crucial step towards integrating Spot Bitcoin ETFs into the mainstream financial sector if the United States Securities and Exchange Commission (SEC) decides to approve Spot Bitcoin ETFs.  Alongside VanEck, WisdomTree’s Spot Bitcoin ETF ticker, ‘BTCW’ has also been officially listed on the DTCC website. The investment management firm previously submitted its Spot BTC ETF application to the US SEC in June 2023. However, the regulator has consistently delayed approval of WisdomTree’s Spot Bitcoin ETF application.  The US SEC has also delayed 13 Spot Bitcoin ETF applications from prominent companies such as BlackRock, ARK Invest, Grayscale, and others. The regulatory agency faces a deadline of January 10, to either accept or reject these Spot Bitcoin ETF applications.  Although there is a possibility for the SEC to decline Spot BTC ETFs several experts, including Bloomberg analysts, James Seyffart and Eric Balchunas have revealed a 90% chance of the regulator approving Spot BTC ETFs in January.  BTC flash dip could be a sign of what to come &#124; Source: BTCUSD On Tradingview.com VanEck Reveals $72 Million Bitcoin ETF Seed Fund On Monday, January 8, VanEck submitted an amended Spot Bitcoin ETF S-1 filing to the SEC. In its filing, VanEck disclosed that the financial company had purchased 1,640.92489329 BTC worth $72.5 million on January 5, to support its Spot ETF. The substantial seeding will provide a solid foundation for VanEck’s Spot Bitcoin ETF, potentially paving the way for increased participation by institutional investors.  Related Reading: Shiba Inu Breakout To $0.001? Rumored 9.25 Trillion SHIB Token Burn Could Be The Catalyst In addition to VanEck’s Seed Creation Baskets, major asset management companies in the Spot Bitcoin ETF race like BlackRock, Bitwise, and Fidelity have announced their various seed funds. Bitwise revealed a $200 million seed fund made by Pantera Capital to support its Spot BTC ETF. The asset management company has also put forward $500,000 to fund its proposed Spot BTC ETF.  Meanwhile, BlackRock and Fidelity have announced plans to seed their Spot Bitcoin ETFs with $10 million and $20 million respectively. BlackRock previously submitted an amended S-1 filing to the SEC in December, revealing a 227.9 BTC purchase to seed its Spot ETF by January 3.  Featured image from Swissborg, chart from Tradingview.com"
  }
]