[
  {
    "source": "Cointelegraph",
    "date": "2023-12-10T13:26:34.000Z",
    "title": " AI deepfake nude services skyrocket in popularity: Research ",
    "url": "https://cointelegraph.com/news/ai-deepfake-nude-services-skyrocket-in-popularity-research",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZGFkYzhiYTQtNDRlYS00OTcxLTgwNTEtNDlkN2VlZjY1MTQ4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Social media analytics company Graphika noted a stark increase in offerings of synthetic NCII services. </p>\n                    <p><p>Social media analytics company Graphika has stated that the use of “AI undressing” is increasing.</p><p>This practice involves utilizing generative <a href=\"https://cointelegraph.com/tags/ai\">artificial intelligence (AI)</a> tools precisely adjusted to eliminate clothing from images provided by users.</p><p>According to its <a href=\"https://public-assets.graphika.com/reports/graphika-report-a-revealing-picture.pdf\" target=\"_blank\" rel=\"noopener nofollow\">report</a>, Graphika measured the number of comments and posts on Reddit and X containing referral links to 34 websites and 52 Telegram channels providing synthetic NCII services, and it totaled 1,280 in 2022 compared to over 32,100 so far this year, representing a 2,408% increase in volume year-on-year.</p><p><a href=\"https://cointelegraph.com/news/ai-deepfake-nude-services-skyrocket-in-popularity-research\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-10T13:15:58.000Z",
    "title": "Following in the footsteps of Reddit and Twitter: Web3 loves alienating its user base",
    "url": "https://cryptoslate.com/following-in-the-footsteps-of-reddit-and-twitter-web3-loves-alienating-its-user-base/",
    "description": "<p>The following is a guest post from Oleg Fomenko, the CEO of Sweatcoin. In the rapidly evolving landscape of technology, where innovation is standard and breakthroughs are expected, one fundamental principle often gets overlooked amidst the buzz and excitement: understanding the consumer. Tech companies, ranging from Silicon Valley giants to Web3 startups, often find themselves [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/following-in-the-footsteps-of-reddit-and-twitter-web3-loves-alienating-its-user-base/\">Following in the footsteps of Reddit and Twitter: Web3 loves alienating its user base</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-10T13:19:42.000Z",
    "title": "Altcoins beat Bitcoin in the bull run – Here are the top picks",
    "url": "https://www.cryptopolitan.com/altcoins-beat-bitcoin-in-the-bull-run/",
    "description": "While Bitcoin has long been regarded as the flagship crypto coin and a store of value, the recent surge in interest and innovation within the altcoins space has propelled a select few to new heights. &#160;Michaël van de Poppe, a crypto analyst, has selected four altcoins for the ongoing bull run in a YouTube video. ... <a title=\"Altcoins beat Bitcoin in the bull run &#8211; Here are the top picks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/altcoins-beat-bitcoin-in-the-bull-run/\" aria-label=\"More on Altcoins beat Bitcoin in the bull run &#8211; Here are the top picks\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-10T13:29:09.000Z",
    "title": "Crypto Market Experts Predict When Cardano (ADA) Price Will Cross $7",
    "url": "https://www.newsbtc.com/news/crypto-market-experts-predict-when-cardano-ada-price-will-cross-7/",
    "description": "Cardano (ADA) has had one of the best price gains this year, up by 137% from its price point of $0.2464 at the beginning of the year. Various predictions have come in on ADA&#8217;s future price trajectory as investors begin to wonder if the altcoin can continue to lead market gains. Changelly&#8217;s long-term forecasts indicate that the value of ADA may continue to rise steadily, finally surpassing its all-time high in the years to come and reaching over $7 by the end of the decade. Related Reading: Cardano Rises $56% To Dominate Weekend’s Top 10 Roster – Details Cardano Price Predictions From Top Crypto Analysts Cardano has had 17 green days in the past 30 days. At the time of writing, the altcoin is trading at $0.5845, down 81.19% from its all-time high of $3.09 in September 2021. However, crypto exchange Changelly&#8217;s prediction indicates this is poised to change soon, with technical indicators now indicating an 82% bullish market sentiment. According to the prediction, the bullish sentiment could as well push ADA to $0.628404 by the end of the year. The bullish outlook of the crypto exchange extends well beyond the scope of the current year&#8217;s forecast, approaching a slow but steady prediction basis. Changelly predicted that ADA could break the $1 mark again by December 2025, and break above its current all-time high of $3.09 by October 2028. Assuming the trend of price appreciation continues, ADA might end the decade around the $7 price point. This represents a staggering 1100% increase from its current price. If this happens, this would mean Cardano&#8217;s total market cap would grow well over $300 billion. Additionally, Changelly projects ADA reaching an average price of $13.23 by December 2032. ADA market cap currently at $20.826 billion on the daily chart: TradingView.com How Feasible Is This Price Point? $7 may look like a lofty price point for ADA in this decade, but several factors point to this happening, especially if development and adoption continue at the current pace of the last quarter in 2023. CoinMarketCap&#8217;s Fear and Greed Index now points to an extreme greed of 80, indicating that the entire market is set for a strong bullish run in 2024.  Related Reading: Ethereum Price Soars To Over $2,300 – Is $3,000 Next? According to a crypto analyst, Cardano (ADA) is on the verge of a bullish weekly cross for the first time since June 2020. The last time this happened, the crypto went on a 6000% run over the next 66 weeks. A repeat would see Cardano (ADA) reach $35 from its current price. #ADA is about to get a bullish weekly cross for the first time since JUNE 2020 The last time this happened it pumped 6,000% over the next 66 weeks#cardano pic.twitter.com/xQvvbf3b1O — Tyler Strejilevich (@TylerSCrypto) December 9, 2023 On the other hand, crypto analyst Ali Martinez warns of a potential short-term pullback before the restart of an uptrend.  Watch out! ⚠️ Sell signals have emerged on both the 3-day and 1-day $ADA charts, suggesting a potential correction of one to four candlesticks. This may just be a short-term pullback before #Cardano resumes its uptrend! pic.twitter.com/t1e1aQLotw — Ali (@ali_charts) December 9, 2023 Featured image from Shutterstock"
  }
]