[
  {
    "source": "Decrypt",
    "date": "2023-06-07T23:48:25.000Z",
    "title": "What’s the Difference Between the Binance and Coinbase SEC Lawsuits?",
    "url": "https://decrypt.co/143718/difference-between-binance-coinbase-sec-lawsuits",
    "description": "The SEC has gone after the two major crypto brands this week—but with very different allegations. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-08T00:03:07.000Z",
    "title": "Bitcoin Retests Moving Average That Marked All Major Market Bottoms",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-retests-moving-average-that-marked-all-major-market-bottoms/",
    "description": "Bitcoin price is falling, crypto is crumbling, and the United States SEC appears to be out for blood. But before a bloodbath occurs across the digital asset market, the top cryptocurrency by market cap is making a stand at a key level. In fact, BTCUSD is retesting an important moving average that in the past marked ever single major bear market bottom. Take a look below. Bitcoin retests the 200-week moving average &#124; BTCUSD on TradingView.com SEC Onslaught Brings Bitcoin Down Against The 200-Week Moving Average The cryptocurrency market is on the ropes, quite literally. On weekly timeframes, BTCUSD has touched back down on the 200-week moving average. The pullback comes in the wake of a string of SEC-made charges against top crypto exchanges this week. Both Binance and Coinbase have been caught in the crosshairs. Related Reading: Bitcoin Weekly Momentum Crosses Bearish For First Time In 2023 Although the onslaught mostly focused on altcoins which are now deemed securities, the sell pressure has been able to cut Bitcoin down a few notches. But it is holding on for dear life. The 200-week moving average makes for an ideal location for a bounce, as this is where Bitcoin has put in a bear market bottom in the past. The line must hold for Bitcoin bulls &#124; BTCUSD on TradingView.com Why It&#8217;s Critical For BTCUSD To Hold For Renewed Confidence In Crypto Upon zooming out, we can see that a major bottom was put in when BTCUSD touched the line several times in 2015. It served as the bottom bounce yet again in 2018, and one more time in 2020 after the COVID crash. Considering its track record of success, it was especially shocking to see the moving average lost in 2022 following the LUNA collapse. Bitcoin then spent a cumulative 36 weeks below the long-term span. When the US banking sector began to fall apart in March 2022, BTCUSD rocketed above the line for the first time since losing it. Related Reading: Rare Crypto Signal Emerges That Could Spark Another 2017-Style Boom Now, it finds itself back there, even piercing the ever-critical line. Support is holding at the moment and the weekly is currently forming a hammer – a potential bullish reversal candlestick pattern. It is far too early to tell, however, considering there are still several days left before the weekly candle closes. If Bitcoin can hold above the 200-week moving average, it could tell the market that the bottom is in and finally lead to some renewed confidence in the crypto market. Losing the line again would be unprecedented, but then again, few thought it would be lost in 2022. Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-08T00:04:28.000Z",
    "title": "De-Dollarization Now Evident As Central Banks US Dollar Reserves Drop to Record Lows: JPMorgan",
    "url": "https://dailyhodl.com/2023/06/07/de-dollarization-now-evident-as-central-banks-us-dollar-reserves-drop-to-record-lows-jpmorgan/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/US-Dollar-Reserves-Dip.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/US-Dollar-Reserves-Dip.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/US-Dollar-Reserves-Dip.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/US-Dollar-Reserves-Dip.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/US-Dollar-Reserves-Dip.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/US-Dollar-Reserves-Dip.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/US-Dollar-Reserves-Dip.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Financial behemoth JPMorgan says the trend of de-dollarization is gaining steam as central banks around the world unload their US dollar holdings. In a new Reuters report, JPMorgan strategists Meera Chandan and Octavia Popescu say that the dollar&#8217;s share in central banks&#8217; foreign exchange reserves has dipped to 58%, a record low.  JPMorgan analysts also [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/07/de-dollarization-now-evident-as-central-banks-us-dollar-reserves-drop-to-record-lows-jpmorgan/\">De-Dollarization Now Evident As Central Banks US Dollar Reserves Drop to Record Lows: JPMorgan</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-08T00:00:02.000Z",
    "title": "Binance Customers Appear Unfazed by SEC Lawsuit As Exchange Sees Only Modest Bitcoin Withdrawals: CryptoQuant",
    "url": "https://dailyhodl.com/2023/06/07/binance-customers-appear-unfazed-by-sec-lawsuit-as-exchange-sees-only-modest-bitcoin-withdrawals-cryptoquant/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Binance-Customers-Unfazed-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Binance-Customers-Unfazed-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Binance-Customers-Unfazed-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Binance-Customers-Unfazed-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Binance-Customers-Unfazed-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Binance-Customers-Unfazed-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Binance-Customers-Unfazed-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Binance customers do not seem to be particularly affected by the Securities and Exchange Commission&#8217;s (SEC) lawsuit against the world&#8217;s largest crypto exchange by trading volume. According to data shared by Ki Young Ju, the CEO says that Binance did suffer outflows of 10,000 Bitcoin (BTC), the largest withdrawal total of 2023. But that outflow [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/07/binance-customers-appear-unfazed-by-sec-lawsuit-as-exchange-sees-only-modest-bitcoin-withdrawals-cryptoquant/\">Binance Customers Appear Unfazed by SEC Lawsuit As Exchange Sees Only Modest Bitcoin Withdrawals: CryptoQuant</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]