[
  {
    "source": "CoinDesk",
    "date": "2023-07-06T19:19:21.000Z",
    "title": "Welcome to the NEW Crypto for Advisors Newsletter",
    "url": "https://www.coindesk.com/business/2023/07/06/welcome-to-the-new-crypto-for-advisors-newsletter/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Digital assets and crypto are rapidly changing the investing landscape. We’re here to help financial advisors find their way."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-06T19:23:49.000Z",
    "title": "Bad Blood? FTX Called It Off With Taylor Swift, Not the Other Way Around: Reports",
    "url": "https://decrypt.co/147564/bad-blood-ftx-called-off-taylor-swift",
    "description": "Taylor Swift reportedly signed the proposed $100 million deal, contrary to previous claims, but NYT sources now say that FTX’s founder backed out."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-06T19:19:00.000Z",
    "title": "Bitcoin Tax Evasion Can’t Be Stopped With Just Anti-Money Laundering: IMF Report",
    "url": "https://decrypt.co/147562/bitcoin-tax-evasion-anti-money-laundering-imf",
    "description": "“Whether crypto withers or blossoms, the tax system still needs to deal with it,” the IMF authors wrote."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T19:22:25.000Z",
    "title": "Buckle up, Reddit: Closed APIs cost more than you’d expect",
    "url": "https://cointelegraph.com/news/reddit-closed-api-costs-more-than-you-expect",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/2c4f0ee3-db74-4ab6-8ed7-97101e2cebab.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Open APIs are vital for healthy communities on social platforms. With Web2 companies beginning to reject that principle, Web3 could be poised to supplant them.</p>\n                    <p><p>On July 1, the popular discussion website <a href=\"https://cointelegraph.com/news/reddit-crypto-community-goes-offline-here-s-why\">Reddit took a ruinous step</a>: Its <a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-blockchain-apis\">application programming interface (API)</a> — the tool that gives developers access to its rich store of data as they build and train applications — ceased providing free, open access. Going forward, it will be closed and, for some developers, too expensive to access.</p><p>The Reddit community has been rocked by ongoing protests against this move, which Reddit CEO Steve Huffman billed as a business decision designed to force profit-making companies that feed off Reddit data to fund the API. </p><p>Here’s the truth, though: When a social platform powered to prominence on the back of its community shuts the gate on its API, it imperils the future of more than the development community that grew up under its protection.</p><p>Not only do centralized, seemingly arbitrary moves like these alienate users, but they also risk choking off the innovative spirit and creative energy that fuel the early success, engagement and <em>esprit de corps</em> of most successful social platforms. </p><h2>Betray your community, endanger your future</h2><p>Despite the protests, Reddit’s Huffman has persisted in <a href=\"https://www.theverge.com/2023/6/15/23762868/reddit-ceo-steve-huffman-interview\" target=\"_blank\" rel=\"noopener nofollow\">arguing</a> that Reddit is “a living organism, this democratic living organism, created by its users.” To Reddit developers and users, changing the rules constitutes a betrayal of that promise. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The biggest indictment of Reddit’s and Twitter’s product chops is the user love for third party apps <br><br>The entire API saga both companies went through was an embarrassing show of incompetence of wasting opportunity to create a nice app over a decade and with limitless funding <a href=\"https://t.co/1NVe3KqYLx\">https://t.co/1NVe3KqYLx</a></p>&mdash; Sar Haribhakti (@sarthakgh) <a href=\"https://twitter.com/sarthakgh/status/1676740734710599683?ref_src=twsrc%5Etfw\">July 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The betrayal is all the more stinging given that many suspect Hufffman’s real motive is to fatten Reddit’s bottom line and craft a narrative of future revenue streams ahead of this year’s expected initial public offering of shares. Twitter made a similar move before its IPO. Facebook’s Open Graph, a launchpad for breakout companies like Zynga and Spotify, was also replaced by a walled garden.</p><p>Users’ expressions of displeasure have ranged from a mid-month 48-hour blackout by nearly 9,000 forums — or subreddits — to flooding the platform with John Oliver posts. At best, these are disruptive. At worst, they are causing lasting harm.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/can-we-still-trust-ledger\"><strong><em>Users will decide if they can still trust Ledger with their seed phrases</em></strong></a></p><p>Hundreds of popular subreddits remain dark. At least two of its most popular third-party browsing applications — Apollo and RIF is Fun — are shutting down. Finally, there are growing <a href=\"https://sub.rehab/\" target=\"_blank\" rel=\"noopener nofollow\">calls</a> for an exodus to other platforms. </p><h2>This is going to hurt</h2><p>It is true that many major technology companies draw upon social media data to train applications for free. Among these are the large language models helping develop ChatGPT and other artificial intelligence systems likely to be worth billions.</p><p>But most of the developers who will be affected by Reddit’s API change are far smaller, and many are responsible for tools and functionality expressly designed to improve the user experience of the platform — by making navigation easier, for instance, or by helping subreddit moderators maintain peace and order. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/701cf13f-c7e2-4e6c-ad9c-f2315cc94e02.jpg\"  /></figure><p>This last element is important, given research from the University of Minnesota that <a href=\"https://twin-cities.umn.edu/news-events/upcoming-reddit-blackout-and-future-third-party-applications\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> Reddit’s moderators are the source of a significant amount of its value.</p><p>Unfortunately, Web2 companies that may have placed great store on the innovative energy third parties bring to their businesses risk losing sight of this as they grow and assume the trappings of more traditional corporations. </p><p>It is for this reason that no Web2 social platform will ever be truly safe from one-sided “business” decisions that leave communities and developers in the lurch. </p><p>Web3 social spaces offer a potential solution. </p><h2>Community comes first</h2><p>To those Web2 developers who may shy away from decentralized platforms because they equate them with cryptocurrency exchanges, it is important to remember that there are very different motivations at play in these two arenas — just as there are between <a href=\"https://cointelegraph.com/explained/how-web3-resolves-fundamental-problems-in-web2\">Web2 and Web3</a>. </p><p><a href=\"https://cointelegraph.com/blockchain-for-beginners/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\">Web3</a> social platforms set out to offer all the functionality of a Web2 space (if not more!) but with this critical difference: Their objective is to maximize openness, collaboration with partners and transparency, not just the platform’s dollars and cents. </p><p>Since many Web3 social media platforms are owned and guided by their communities and highly value partner collaboration, they tend to be safer from arbitrary decision-making and profiteering. They are also built on blockchain technology, which can include (crypto) financial rails that enable platforms, users and partners to synergistically profit from platform growth.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cybernetic-organizations-borgs-doomed-fail\"><strong><em>Cybernetic organizations — BORGs — are doomed to fail</em></strong></a></p><p>And critically for developers, these platforms and the ecosystems behind them are committed to achieving and maintaining open APIs, which they see as crucial to bringing innovation to their platforms and to protecting the choices of users.</p><p>This means they will never forget the truth that Reddit and many other Web2 platforms seem to forget in the throes of ambition: that nurturing an engaged, innovative user and developer community leads to exciting functionality that serves the community.</p><p>Social media platforms should be built to serve their communities, not just to produce profits for investors and executives. And however successful they may become, they should never turn their backs on the committed and enthusiastic developers that helped them at the start. </p><p>True democracy has spoken — and Web3 is listening.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Rick Porter</strong> has served as the founder and CEO of DSCVR, a Web3 social media platform, since 2022. He previously worked as a technical program manager for Google and as an engineering director for BCG Digital Ventures.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T19:20:14.000Z",
    "title": "Bitcoin forks BCH, BSC and XEC soared last month, but are the gains organic and sustainable?",
    "url": "https://cointelegraph.com/news/bitcoin-forks-bch-bsc-and-xec-soared-last-month-but-are-the-gains-organic-and-sustainable",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/222a170b-ed4f-4bba-b8e6-318d0008e41b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin forks, BCH, BSC, XEC rallied over the last 30 days while KAS and FLEX led among altcoin gainers in June, but data questions the sustainability of their rallies.</p>\n                    <p><p>The start of June saw <a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-down-today\">negative price action</a> across the cryptocurrency market after the U.S. Securities and Exchange Commission brought fresh lawsuits against the world’s largest exchanges, <a href=\"https://cointelegraph.com/news/binance-and-cz-sued-by-the-sec\">Binance</a> and <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">Coinbase</a>.</p><p>However, the sentiment quickly turned bullish after a crucial <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">exchange-traded fund proposal</a> was filed by the world’s largest asset management firm, BlackRock, on June 16. A wave of ETF fillings and institutional trading interest in digital assets followed BlackRock’s ETF filling.</p><p>The <a href=\"https://cointelegraph.com/news/wall-street-giants-back-edx-markets-cryptocurrency-exchange\">launch of EDX Markets</a> backed by Wall Street giants Fidelity Investments, Citadel Securities, and Charles Schwab on June 20 fueled a particular sector of the market in Bitcoin forks like Bitcoin Cash (<a href=\"https://cointelegraph.com/bitcoin-cash-price-index\">BCH</a>) and Bitcoin SV (<a href=\"https://cointelegraph.com/bsv-price-index\">BSV</a>) and other proof-of-work (PoW) cryptocurrencies like Kaspa (KAS).</p><p>The exchange debuted with Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) and BCH. The inclusion of BCH catalyzed an uptrend across other Bitcoin forks.</p><p>Among the top gainers in June, three Bitcoin forks populated the list, followed by Kaspa and FLEX Coin (FLEX). FLEX benefited from its integration with Open Exchange, backed by co-founders of the bankrupt Three Arrows Capital digital fund.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/9dd47cfd-2315-4348-b7ed-08e06d7a8c3c.JPG\"  /><figcaption style=\"text-align: center;\">The top five performing coins in June. Source: CoinGecko</figcaption></figure><p>In comparison, Bitcoin’s monthly gains stood at 11.94%, as it traded above the $30,000 level for the first time since April 2023.</p><h3>CoinFlex (FLEX) receives short-term boost from link with 3AC co-founders</h3><p>CoinFlex announced a <a href=\"https://coinflex.com/blog/coinflex-to-opnx-account-migration\" target=\"_blank\" rel=\"noopener nofollow\">transition</a> to bankruptcy claim exchange, Open Exchange (OPNX), in May 2023. The token’s price reached a 13-month high of $4.37 on June 27.</p><p>Open Exchange is backed by co-founders of now bankrupt venture fund, Three Arrows Capital. Reportedly, the co-founders face <a href=\"https://cointelegraph.com/news/three-arrows-liquidators-recoup-losses-from-founders\">$1.3 billion in liability</a> from their actions that exacerbated the losses of the fund.</p><p>Still, the duo continued to endorse Open Exchange under a <a href=\"https://cointelegraph.com/news/former-three-arrows-capital-founders-launch-new-vc-fund#:~:text=OPNX%20was%20founded%20by%20Su,Three%20Arrows%20Capital%20(3AC).\">new venture fund</a>, under the same brand as their previous fund.</p><p>CoinFLEX took an approval for a restructuring of its exchange from the Seychelles courts on March 6. Its integration with Open Exchange imparts utility to the FLEX in OPNX to settle claims and earn staking rewards.</p><p>Notably, as FLEX prices surged to 2022 peak levels, the trading volumes remained subdued at around 0.01% of the $1 billion daily volume versus now, which raises a red flag. </p><p>It represents a case of significant volatility in illiquid assets. Due to their limited liquidity, it can be easier to push the price of these coins compared to larger, more liquid assets.</p><p>Technically, the 2022 breakdown levels at around $5.08 and all-time high level of $7.56 will act as resistance levels to the upside. The token faces 80% downside risk toward $0.75, which represent the accumulation levels in May 2023.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/8d8a1845-b5bb-429f-b169-af0209b05251.JPG\"  /><figcaption style=\"text-align: center;\">FLEX/USD daily price action. Source: CoinGecko</figcaption></figure><h3>Bitcoin Cash (BCH) riding the EDX Markets uptrend</h3><p>BCH price more than doubled in June following listing on EDX Exchange. BCH was one of the four cryptocurrencies that debuted on the platform alongside BTC, ETH, and LTC. </p><p>While EDX listing acted as a positive catalyst, negative funding across perpetual swap markets and potential market manipulation on South Korean exchange Upbit are also the primary drivers of the recent uptrend.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/2a2a3d6e-19b9-4481-9c2f-20d2b170faae.JPG\"  /><figcaption style=\"text-align: center;\"><em>Funding rate for BCH perpetual swaps. Source: Coinglass</em></figcaption></figure><p>The token’s price witnessed a combined liquidation of $21 million in June, according to an <a href=\"https://twitter.com/TheTieIO/status/1674482699967275025\" target=\"_blank\" rel=\"noopener nofollow\">update</a> from crypto analytics outlet The Tie. The levels are significantly higher than usual where the “daily liquidations total tens of thousands of dollars, if anything.”</p><p>The total fees paid on the Bitcoin Cash blockchain has ranged lower than $200 since the start of the year, indicating that the blockchain’s usage has been limited. </p><p>In comparison, Litecoin, which provides a similar utility, generates around 10 times larger revenue for the miners in fees than BCH. The poor fundamentals and high liquidation levels raises a yellow flag on the sustainability of the recent gains.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/abac47de-13fc-426c-ac12-bfe1ade3b2e0.JPG\"  /><figcaption style=\"text-align: center;\">The total fees paid on the Bitcoin Cash blockchain. Source: CoinMetrics</figcaption></figure><h3>BSV rides the BCH wave despite poor fundamentals</h3><p>BCH and BSV have a strong correlation of 0.78, which appears to be the reason why BSV enjoyed 31.4% gains in June.</p><p>BSV has been in a consistent downtrend since 2022 as the interest in the blockchain faded after the crypto bull market and its trading volumes dried up.</p><p>The token made an all-time low at $21.43 on June 10, before catching the BCH bullish tide and staging an uptrend. </p><p>Its poor performance drove miners away from its ecosystem, making a <a href=\"https://cointelegraph.com/news/what-is-a-51-attack-and-how-to-detect-it#:~:text=While%20there%20are%20many%20mechanisms,then%20assumes%20control%20over%20it.\">51% attack</a> relatively cheaper on Bitcoin SV— a one-hour attack requiring less than <a href=\"https://www.crypto51.app/\" target=\"_blank\" rel=\"noopener nofollow\">$2,000</a> compared to $1.4 million for Bitcoin, which makes the blockchain vulnerable.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/e28c2b26-7c20-4a94-9929-d359f1aaa9c8.JPG\"  /><figcaption style=\"text-align: center;\"><em>BSV daily price action. Source: CoinGecko</em></figcaption></figure><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/roger-ver-ethereum-catalyst-for-crypto-adoption\">‘Bitcoin Jesus’ says Ethereum is the front-runner for global crypto adoption</a></em></strong></p><h3>Kaspa (KAS) benefits from improved performance and low liquidity </h3><p>Kaspa is a PoW consensus-based blockchain network similar to Bitcoin and Litecoin. </p><p>Kaspa offers a high throughput of one block per second compared to 10 minutes for Bitcoin. Kaspa Labs, the team building the blockchain, also hinted at the launch of a public testnet that will enhance its scalability <a href=\"https://twitter.com/DesheShai/status/1674382827108876288\" target=\"_blank\" rel=\"noopener nofollow\">10,000 times</a>, which appears to be fueling its market sentiments.</p><p>However, the token is primarily traded on unregulated exchanges with low trading volumes and low trust scores, according to <a href=\"https://www.coingecko.com/en/coins/kaspa\" target=\"_blank\" rel=\"noopener nofollow\">CoinGecko</a>. This makes the cryptocurrency susceptible to high volatility and manipulation.</p><p>Technically, if the bullish momentum continues KAS will look to retest 2023 highs at around $0.40. To the downside, the token faces risk of correction toward the yearly lows at around $0.15.</p><p>While the token exhibits illiquid market signs, making it susceptible to volatility and faces tough competition from large PoW networks like Bitcoin and Litecoin, its one-year price action has been positive with higher highs and higher lows.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/c7ca2b18-7410-4bb0-a37e-dbc5c82d850d.JPG\"  /><figcaption style=\"text-align: center;\"><em>KAS daily price chart. Source: CoinGecko</em></figcaption></figure><h3>eCash (XEC) joins BSV and BCH in a Bitcoin fork-rally</h3><p>eCash is a <a href=\"https://cointelegraph.com/news/bitcoin-cash-abc-rebrands-to-ecash-embraces-proof-of-stake-and-2-decimal-places\">rebranded version</a> of a tertiary Bitcoin fork, Bitcoin Cash ABC, which was another fork of Bitcoin Cash besides Bitcoin SV. </p><p>Similar to BCH and BSV, XEC also rode the positive tide that lifted all boats which aligned to the fork category.</p><p>Similar to Bitcoin SV, eCash lacks fundamental value and exhibits volatility due to illiquid market conditions. The token is listed on a few top exchanges like Binance and Bithumb, however, it has yet to be supported on any U.S.-based exchange, which raises a yellow flag.</p><p>The rise of tokens with low liquidity and loosely based narratives suggest that there could be some price manipulation in these tokens which is influencing their short-term price. The long-term value proposition of Bitcoin forks remains questionable with low utility and security.</p><p>Moreover, the cryptocurrency market is still suffering from the adverse impacts of <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">SEC’s case</a>. The tokens regarded as securities such as Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>), Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) and Flow (FLOW) all posted more than a 20% loss over the month. </p><p>As the markets struggle with legal challenges, building bullish narratives has been difficult. Given that <a href=\"https://cointelegraph.com/news/bitcoin-btc-reach-50-percent-market-dominance\">Bitcoin is leading the market</a>, its price action will be crucial in determining the direction of altcoins.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-06T19:30:43.000Z",
    "title": "BAYC-Centric Apecoin Hits All-Time Low, Suffers 92% Decline From Last Year’s Peak",
    "url": "https://news.bitcoin.com/bayc-centric-apecoin-hits-all-time-low-suffers-92-decline-from-last-years-peak/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/ape-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BAYC-Centric Apecoin Hits All-Time Low, Suffers 92% Decline From Last Year’s Peak\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/ape-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ape-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ape-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ape-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ape-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ape-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ape.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In the midst of a considerable drop in the base price of non-fungible tokens (NFTs) from the Bored Ape Yacht Club, the related cryptocurrency, apecoin (APE), has likewise suffered due to the bearish trends in that specific market. While many crypto assets have seen an increase in worth over the past month, APE has endured [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T19:38:20.000Z",
    "title": "Namibia embraces crypto legislation",
    "url": "https://www.cryptopolitan.com/namibia-embraces-crypto-legislation/",
    "description": "Namibia, a Southern African nation, is making headway in establishing its position on the digital financial landscape. The National Assembly recently approved a pivotal bill, the objective of which is to legalize and govern virtual assets, such as cryptocurrencies. Now in the stage of being officially enacted, the law is a cornerstone for Namibia&#8217;s journey ... <a title=\"Namibia embraces crypto legislation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/namibia-embraces-crypto-legislation/\" aria-label=\"More on Namibia embraces crypto legislation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T19:29:40.000Z",
    "title": "Dollar demand surges as Chinese investors seek safe haven",
    "url": "https://www.cryptopolitan.com/dollar-demand-surges-among-chinese-investors/",
    "description": "The epicenter of global finance is witnessing an unanticipated shift. In an unforeseen turn of events, a growing wave of Chinese investors are making a beeline for dollar deposits and Hong Kong insurance. This recent surge indicates the wary economic sentiment back home, painting a picture of an economy grappling with an ailing yuan and ... <a title=\"Dollar demand surges as Chinese investors seek safe haven\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dollar-demand-surges-among-chinese-investors/\" aria-label=\"More on Dollar demand surges as Chinese investors seek safe haven\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T19:15:58.000Z",
    "title": "Twitter Payments LLC earns money transmitter license in the US",
    "url": "https://www.cryptopolitan.com/twitter-payments-earns-transmitter-license/",
    "description": "Twitter Payments LLC, a subsidiary of Elon Musk’s Twitter social network, has achieved a significant milestone by obtaining its initial money transmitter licenses. The states of Michigan, New Hampshire, and Missouri have approved the company’s applications, allowing it to offer transfer services and payment instruments. These licenses distinguish Twitter Payments as a facilitator of secure ... <a title=\"Twitter Payments LLC earns money transmitter license in the US\" class=\"read-more\" href=\"https://www.cryptopolitan.com/twitter-payments-earns-transmitter-license/\" aria-label=\"More on Twitter Payments LLC earns money transmitter license in the US\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-06T19:30:15.000Z",
    "title": "Ethereum Whale Transfers Over 25,000 ETH To Exchange: Massive Dip On The Horizon?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-whale-transfers-to-exchange/",
    "description": "Ethereum&#8217;s price seems to have been following Bitcoin&#8217;s, but recent large transactions suggest it may soon move independently. Whale Alert reported a sum of 25,264 ETH, roughly valued at around $48 million, was moved from an unidentified wallet to the leading cryptocurrency exchange, Coinbase. 🚨 🚨 25,264 #ETH (48,302,924 USD) transferred from unknown wallet to #Coinbasehttps://t.co/ViF7z23ixe — Whale Alert (@whale_alert) July 6, 2023 Analyzing The Potential Impact While these large transfers can, on occasion, herald an upcoming uptrend, they can also imply a short-term surge in volatility. Particularly, such movements can be used to discern possible price sentiment changes. Related Reading: Ethereum Continues Uptrend As Staked ETH Soars To New High In addition to the 25,264 ETH transferred, another substantial transaction of 30,000 ETH was also noted. This amount was relocated from an anonymous wallet to OKEX, another prominent crypto exchange.  🚨 🚨 🚨 30,000 #ETH (57,687,950 USD) transferred from unknown wallet to #OKExhttps://t.co/ENxRwsJMLh — Whale Alert (@whale_alert) July 6, 2023 Notably, as with any financial market, the crypto industry is impacted by many factors, with &#8216;whale&#8217; movements being just one of them. While they can potentially influence price sentiment, other elements, such as broader market trends, global economic indicators, and investor sentiment, should also be considered for a holistic market understanding. Ethereum Latest Price Action Thiese Ethereum transactions come at a time when ETH has been trading between an intra-day high of $1,957.35 and an intra-day low of $1,872.94. At the time of writing, Ethereum has only seen a slight decline of 1.4% in the past day, with a market price of $1,884. This modest plunge indicates whales might not have moved or sold just a small amount of the ETH deposited. Notably, a &#8216;whale&#8217; in cryptocurrency refers to an individual or entity holding a large amount of a cryptocurrency. This individual or entity has the potential to influence the market due to the sizeable volume of its holdings. When such transfers occur, they can create waves in the market and often signal potential price shifts. Related Reading: Ethereum Price Retests Uptrend Support But Can Bulls Save The Day Over the past week, Ethereum has seen more than a $3 billion surge in its market capitalization. The second largest asset by market cap has surged from the $223 billion seen last Thursday to $226 billion. ETH&#8217;s daily trading volume has also surged significantly in the same period. Ethereum&#8217;s daily trading volume has soared from $6 billion last week to above $12 billion over the past 24 hours. Featured image from Shutterstock, Chart from TradingView"
  }
]