[
  {
    "source": "CoinDesk",
    "date": "2023-09-20T07:20:30.000Z",
    "title": "The Salvation of Domain Ownership May Lie in Tokenization, and One Firm is Pressing Hard to Make This a Reality",
    "url": "https://www.coindesk.com/web3/2023/09/20/the-salvation-of-domain-ownership-may-lie-in-tokenization-and-one-firm-is-pressing-hard-to-make-this-a-reality/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "URLs are the pathway to the internet. While top domains might fetch in the hundreds of millions, they are still auctioned off like it’s the twentieth century. Here’s how web3 can change that."
  },
  {
    "source": "CoinDesk",
    "date": "2023-09-20T07:12:37.000Z",
    "title": "Avalanche Developer, Known for Minting Millionaires and Duds, Is Back With ‘WAGMI’ Tokens",
    "url": "https://www.coindesk.com/tech/2023/09/20/avalanche-developer-known-for-minting-millionaires-and-duds-is-back-with-wagmi-tokens/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Sestagalli’s previous Avalanche projects created a cult-like following in the 2021 bull run under the “frog nation” moniker."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-20T07:12:03.000Z",
    "title": "Circle Launches USDC On Polkadot, Extends Parachain Compatibility",
    "url": "https://cryptodaily.co.uk/2023/09/circle-launches-usdc-on-polkadot-extends-parachain-compatibility",
    "description": "The newly launched Polkadot USDC is natively issued on the Polkadot hub, simplifying the process for users to transfer funds to parachains through the XCM protocol."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T07:30:42.000Z",
    "title": "Decoding The Fed: The Future Of Bitcoin And Crypto Post-Tightening",
    "url": "https://www.newsbtc.com/news/decoding-the-fed-bitcoin-crypto-post-tightening/",
    "description": "As the market braces itself for the Federal Reserve&#8217;s imminent announcement regarding its monetary policy, speculations are rife about the potential impact on Bitcoin and crypto. Based on Grayscale&#8217;s recent analysis by Zach Pandl, today&#8217;s announcement could be the critical juncture the Bitcoin and crypto community has been awaiting. In the aftermath of the COVID-19 crisis in 2020, the Federal Reserve embarked on a path of significant monetary easing to reignite the US economy. Their initial stance was one of unwavering support: &#8220;The Federal Reserve committed to overstimulating the US economy–with hopes to avoid the sluggish recovery that followed the 2008-2009 financial crisis.&#8221; This decision saw a bolstered Bitcoin and other cryptocurrencies in 2020. Related Reading: Bitcoin Sees Sudden Boost Amid Mt. Gox Rumors, But QCP Capital Targets $22,000 However, as Pandl points out, the tide seemed to turn in mid-2021 when the Federal Reserve had a revelation: &#8220;[The Fed] seemed to realize it was overdoing it.&#8221; What followed was a series of the most &#8220;largest and steepest funds rate increases in modern history.&#8221; As real interest rates rebounded, Bitcoin&#8217;s valuation, which had soared during the period of monetary easing, began to see a massive downturn. The Road Ahead For Bitcoin And Crypto Pandl&#8217;s analysis elucidates the heightened anticipation around the FOMC&#8217;s meeting. He notes, &#8220;We believe the FOMC is likely to keep rates on hold at tomorrow’s meeting.&#8221; Notably, this is in line with broader market expectations. According to the FedWatch tool, 99% expect a pause by the Fed. Despite hints earlier in June 2023 about potential rate increments beyond the 5.25-5.50% range, the current economic indicators, such as &#8220;benign inflation data&#8221; and steady &#8220;oil prices,&#8221; could influence the committee&#8217;s decision, argues Pandl. Yet, as the report astutely mentions, it&#8217;s not just about the immediate policy decision: &#8220;For crypto, whether the Fed hikes one more time or not may be less important than the fact that the broader tightening cycle is coming to an end.&#8221; This perspective, when viewed in light of historical data, suggests a potential upliftment for digital assets. After all, &#8220;After the funds rate peaked in the last five tightening cycles, real interest rates declined and equity market performance generally improved.&#8221; Related Reading: Wyckoff Support Holds Strong: Bitcoin Bulls Eyeing $31,000 In Near-Term Rally Although the crypto ecosystem continues to evolve at a rapid pace with &#8220;new applications, enhancements to existing protocols, and wider adoption,&#8221; its valuations haven&#8217;t always mirrored these advancements. Over the last few years, as Pandl underscores, &#8220;valuations have been heavily influenced by the macroeconomics backdrop and swings in Fed monetary policy–from ultra-easy policy in 2020 to steep rate increases more recently.&#8221; The potential conclusion of the Fed&#8217;s rate increases could signify a pivotal moment for Bitcoin and other digital assets. As we approach this juncture, the crypto market may find itself at a crossroads where &#8220;A possible end of the tightening process could remove a headwind to crypto valuations, and allow prices to more closely track the industry’s improving fundamentals.&#8221; At press time, BTC traded at $27,099. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T07:11:26.000Z",
    "title": "Ripple News: 9 out of 10 Central Banks Exploring CBDCs and Partnering with Ripple Labs to Explore Trillion-Dollar Market Opportunity – Will it Drive XRP Price to a New ATH of $10?",
    "url": "https://www.crypto-news-flash.com/ripple-news-9-out-of-10-central-banks-exploring-cbdcs-and-partnering-with-ripple-labs-to-explore-trillion-dollar-market-opportunity-will-it-drive-xrp-price-to-a-new-ath-of-10/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-news-9-out-of-10-central-banks-exploring-cbdcs-and-partnering-with-ripple-labs-to-explore-trillion-dollar-market-opportunity-will-it-drive-xrp-price-to-a-new-ath-of-10",
    "description": "<img width=\"800\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-48x29.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />Central banks actively delving into CBDCs, anticipating a potential market boom by 2030. Ripple&#8217;s New Value Report highlights overwhelming support for digital assets in the global financial sector. Referring to a recent tweet by Ripple, nine out of ten central banks are currently in the process of researching and analyzing the potential of Central Bank [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-20T07:15:43.000Z",
    "title": "Coinbase CEO Questions Scientific Research; Sees ResearchHub Solution",
    "url": "https://coinedition.com/coinbase-ceo-questions-scientific-research-sees-researchhub-solution/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Coinbase-CEO-Hopes-Film-on-Exchange-Changes-Minds-of-Policymakers.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coinbase CEO Hopes Film on Exchange Changes Minds of Policymakers\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Coinbase-CEO-Hopes-Film-on-Exchange-Changes-Minds-of-Policymakers.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Coinbase-CEO-Hopes-Film-on-Exchange-Changes-Minds-of-Policymakers-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Coinbase-CEO-Hopes-Film-on-Exchange-Changes-Minds-of-Policymakers-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Coinbase-CEO-Hopes-Film-on-Exchange-Changes-Minds-of-Policymakers-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Coinbase-CEO-Hopes-Film-on-Exchange-Changes-Minds-of-Policymakers-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Brian Armstrong, CEO of crypto exchange Coinbase, shared on X (formerly Twitter) his opinion on today’s science and research work. He stated that much of science is fake, with results that won’t replicate, papers of no consequence, and fake disciplines. Armstrong believes that the community could benefit from more scientists working on higher-risk, higher-reward breakthroughs. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-ceo-questions-scientific-research-sees-researchhub-solution/\">Coinbase CEO Questions Scientific Research; Sees ResearchHub Solution</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]