[
  {
    "source": "Cointelegraph",
    "date": "2023-06-03T04:12:00.000Z",
    "title": "Net Bitcoin ATMs record an increase after 4 months of global downtrend",
    "url": "https://cointelegraph.com/news/net-bitcoin-atms-record-an-increase-after-4-months-of-global-downtrend",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/5f67e40b-e9e9-4d69-8a56-f52fae628a5b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In the first four months of 2023, the net crypto ATMs worldwide declined by 5,850. In May, however, 1,397 machines were added back to the global crypto ATM network.</p>\n                    <p><p>Breaking the year-long trend of declining Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and crypto ATMs across the globe, May recorded a steep increase in net installations with nearly 1,400 machines.</p><p>The total number of crypto ATMs witnessed a consistent decline for the first four months of 2023. During the timeframe, while major economies including the United States and Europe contributed to the dwindling numbers, Australia, Poland and Spain amped up crypto ATM installations in their respective regions.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/72a20630-2cde-4bb4-8b36-a90de223c782.png\"  /><figcaption style=\"text-align: center;\"><em>A histogram chart showing net change of cryptocurrency machines number installed and removed monthly. Source: Coin ATM Radar</em></figcaption></figure><p>The chart above shows that, in the first four months of 2023, the net crypto ATMs worldwide declined by 5,850. In May, however, 1,397 machines were added back to the global crypto ATM network, confirms <a href=\"https://coinatmradar.com/charts/net-growth/\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from Coin ATM Radar</p><p>While Bitcoin ATMs do not contribute to the growth of the Bitcoin network, it serves as a physical gateway for people to exchange their fiat currencies for crypto. In 2023 alone, Australia installed a total of 233 ATMs, climbing up the ranks to become <a href=\"https://cointelegraph.com/news/australia-installed-more-bitcoin-atms-than-entire-asia\">the third-largest crypto ATM hub</a> in the world.</p><p>Despite a poor year-long reduction, the United States maintains a leading position — representing 84.7% of crypto ATMs in the world, followed by Canada at 7.6%.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/australia-ranks-3rd-in-crypto-atm-installations-after-us-and-canada\"><strong><em>Australia ranks 3rd in crypto ATM installations after US and Canada</em></strong></a></p><p>At the time of writing, 35,069 ATMs remain operational worldwide. Recently, a hacker managed to gain access to sensitive information of Bitcoin ATM manufacturer General Bytes, including passwords, private keys and funds.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">On March 17-18th, 2023, GENERAL BYTES experienced a security incident.<br><br>We released a statement urging customers to take immediate action to protect their personal information.<br><br>We urge all our customers to take immediate action to protect their funds and <a href=\"https://t.co/fajc61lcwR\">https://t.co/fajc61lcwR</a>…</p>&mdash; GENERAL BYTES (@generalbytes) <a href=\"https://twitter.com/generalbytes/status/1637192687160897537?ref_src=twsrc%5Etfw\">March 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“We have taken immediate steps to prevent further unauthorized access to our systems and are working tirelessly to protect our customers,” General Bytes said in its statement.</p><p>As previously reported by Cointelegraph, the hacker managed to drain at least 56 BTC and 21.82 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). To avoid a similar situation in the future, the company advised its operators and customers to migrate to a self-hosted server installation, which can be secured by a VPN.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  }
]