[
  {
    "source": "CoinDesk",
    "date": "2024-01-29T20:51:53.000Z",
    "title": "Su Zhu Recommends Prison for All, in an Attempt to Rebuild a Reputation",
    "url": "https://www.coindesk.com/consensus-magazine/2024/01/29/su-zhu-recommends-prison-for-all-in-an-attempt-to-rebuild-a-reputation/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Flipping the narrative, the disgraced 3AC financier says he enjoyed life behind bars. “I had the best sleep of my life.”"
  },
  {
    "source": "Decrypt",
    "date": "2024-01-29T20:32:09.000Z",
    "title": "Solana Traders Send WEN on Wild Ride After $35 Million in Tokens Burned",
    "url": "https://decrypt.co/214643/solana-traders-wen-wild-ride-after-burning-35-million-tokens",
    "description": "WEN plunged 23% Monday after ending its airdrop campaign. Solana traders left $35 million worth of the meme coin on the table."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-29T20:06:49.000Z",
    "title": "Billionaire Biohacker Gets Into NFTs with Drip Solana Airdrop",
    "url": "https://decrypt.co/214635/bryan-johnson-blueprint-solana-nft-airdrop-drip-haus-degen-poet",
    "description": "The Blueprint collection, in collaboration with SuperTeamDAO, offers three free and random Bryan Johnson-themed collectibles."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-29T19:55:44.000Z",
    "title": "There's a New Bitcoin ETF Offering 30% Yield: Here's How It Works",
    "url": "https://decrypt.co/214630/theres-a-new-bitcoin-etf-offering-30-yield-heres-how-it-works",
    "description": "Though it doesn't offer direct Bitcoin exposure, the new product uses BTC to generate a purported 30% yield for investors."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-29T19:40:38.000Z",
    "title": "Bitcoin Pumps as Market Awaits Fed Rate Verdict",
    "url": "https://decrypt.co/214629/bitcoin-pumps-as-market-awaits-fed-rate-verdict",
    "description": "Traders have already priced in Wednesday’s Fed committee meeting. But a signal that interest rates will drop in March could see the asset go up further."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-29T20:35:00.000Z",
    "title": " EU begins sorting MiFID-regulated securities out of crypto assets  ",
    "url": "https://cointelegraph.com/news/eu-begins-sorting-mifid-regulated-securities-out-of-crypto-assets",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMzhmMDdjMTYtYTU5Ny00YzI0LTg4NmUtNzdmYjRhZDkyNTA2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>MiCA passed in 2022, but aspects of it are still being worked out. Defining a financial instrument is a big outstanding question.</p>\n                    <p><p>The European Securities and Markets Authority (ESMA) released two consultation papers on Jan. 29 pertaining to its mandate to create standards and guidelines for the implementation of the Regulation on Markets in Crypto-Assets (MiCA). The papers considered reverse solicitation and crypto assets qualifying as financial instruments.</p><p>Reverse solicitation is the name given by European regulators to the practice of a potential customer approaching a firm for crypto asset services. An exemption to the MiCA framework allows third-country crypto asset firms to service a European Union client through this mechanism alone. </p><p>“Third-country firms may not solicit clients in the Union as they are not authorised to provide CASP [presumably, crypto-asset service provider] services in the Union,” the report <a href=\"https://www.esma.europa.eu/sites/default/files/2024-01/ESMA35-1872330276-1619_Consultation_Paper_on_the_draft_guidelines_on_reverse_solicitation_under_MiCA.pdf\" target=\"_blank\" rel=\"noopener nofollow\">explained</a>, unless “the client at its own, exclusive initiative contacted the firm and requested the service, the third-country firm may provide it.” ESMA sees reverse solicitation as only a narrow exemption for third-country firms:</p><p><a href=\"https://cointelegraph.com/news/eu-begins-sorting-mifid-regulated-securities-out-of-crypto-assets\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-29T20:15:49.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Assets under management (AUM) held by BlackRock's Bitcoin (BTC) exchange-traded fund have surpassed $2 billion, industry data shows. Meanwhile, the Hong Kong Securities and Futures Commission (SFC) received its first spot Bitcoin BTC ETF application, and Solana-based decentralized exchange Jupiter has topped trading volumes over the last 24 hours.</p><p>BlackRock’s Bitcoin ETF, which trades under the ticker IBIT, <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-2b-holdings-gbtc-outflows\">has crossed $2 billion</a> in assets under management mere weeks after its launch.</p><p>Industry data shows that IBIT now holds more than 52,000 BTC, worth more than $2 billion at current prices. IBIT has seen the highest total volume outside of the Grayscale Bitcoin Trust (GBTC).</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-29T20:00:00.000Z",
    "title": " SEC delays decision on Grayscale, BlackRock spot Ethereum ETFs: Law Decoded  ",
    "url": "https://cointelegraph.com/news/sec-delays-grayscale-blackrock-spot-ethereum-etfs-law-decoded-jan-22-29",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy80ZWViM2Q4ODM3NWI0MGQwNmYyNDRmMmJhYzcwMDE4Mi5qcGc=.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>History repeats itself, as the U.S. SEC is now pushing the spot Ethereum ETF decision deadlines as far as possible.</p>\n                    <p><p data-ct-non-breakable=\"true\">On Jan. 24, the United States Securities and Exchange Commission (SEC) <a href=\"https://cointelegraph.com/news/sec-delay-decision-blackrock-spot-ethereum-etf-to-march\">pushed back its decision</a> on BlackRock’s proposed spot Ethereum exchange-traded fund application (ETF) a day before the deadline, citing the need for more time to review the proposed rule change. While the SEC must make a final decision on BlackRock’s spot Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) ETF decision by Aug. 7, Bloomberg ETF analyst Eric Balchunas has predicted a final decision will be made on all pending spot Ether ETFs in May — similar to the way the SEC decided on 10 pending spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETFs in January. </p><p>The next day, the SEC also delayed its decision on <a href=\"https://cointelegraph.com/news/sec-grayscale-spot-ether-etf-deadline\">whether to approve a spot Ether ETF</a> from Grayscale Investments, opening the application to public comments. The SEC said it would institute proceedings to determine whether to approve or disapprove a proposed rule change allowing NYSE Arca to list and trade Grayscale Ethereum Trust shares. Opening the proposed investment vehicle to public comment will push the deadline for a decision by an additional 35 days upon publication in the Federal Register.</p><p>The SEC remains one of the most consistently anti-crypto forces in the United States. According to a report from litigation consulting firm Cornerstone Research, the number of crypto-related enforcement cases brought by the SEC in 2023 <a href=\"https://cointelegraph.com/news/sec-enforcement-actions-gary-gensler\">was the highest since 2013</a>, suggesting that digital assets were a “top priority” for the commission. Of the 46 enforcement actions in 2023, Cornerstone reported the SEC imposed $281 million in monetary penalties for settlements and tripled the number of administrative proceedings from 2022.</p><p><a href=\"https://cointelegraph.com/news/sec-delays-grayscale-blackrock-spot-ethereum-etfs-law-decoded-jan-22-29\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-29T19:50:00.000Z",
    "title": " Teaching robots to speak local dialects could make it easier for AI to exploit us ",
    "url": "https://cointelegraph.com/news/teaching-robots-artificial-intelligence-speak-local-dialects-could-make-easier-ai-exploit-humans",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvM2NlNDdmZTUtYjA0YS00ZWZiLTg3OGUtMWZlYjFiNzFjNGI4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Humans tend to trust robots more when they speak our dialects but there are exceptions, according to recent research. </p>\n                    <p><p>A team of researchers in Germany recently published a study examining the relationship between language and trustworthiness when it comes to human views on talking robots. </p><p>The question at hand was whether humans would find a robot more trustworthy if it spoke in a standard language or if they’d prefer it spoke in a local dialect. </p><p>A group of 120 German native speakers were <a href=\"https://www.frontiersin.org/articles/10.3389/frobt.2023.1241519/full\" target=\"_blank\" rel=\"noopener nofollow\">recruited</a> to find out. Study participants were shown videos of a small robot speaking in both a Berlin dialect and in the more general standard German dialect. Respondents were then asked which seemed more trustworthy. </p><p><a href=\"https://cointelegraph.com/news/teaching-robots-artificial-intelligence-speak-local-dialects-could-make-easier-ai-exploit-humans\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-29T20:56:54.000Z",
    "title": "BlackRock, VanEck, and Franklin Templeton compete to promote Bitcoin ETFs on Google Ads",
    "url": "https://cryptobriefing.com/blackrock-vaneck-franklin-templeton-bitcoin-etfs-google-ads/?utm_source=feed&utm_medium=rss",
    "description": "BlackRock, VanEck, and Franklin Templeton now promote their spot Bitcoin ETFs on Google Ads following a recent policy update."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-29T21:00:42.000Z",
    "title": "Kresus App and Worldcoin’s Tools for Humanity Forge Web3 Partnership",
    "url": "https://news.bitcoin.com/kresus-app-and-worldcoins-tools-for-humanity-forge-web3-partnership/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/hjjjjjj89000-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Kresus App and Worldcoin’s Tools for Humanity Forge Web3 Partnership\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/hjjjjjj89000-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/hjjjjjj89000-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/hjjjjjj89000-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/hjjjjjj89000-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/hjjjjjj89000-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/hjjjjjj89000-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/hjjjjjj89000.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Monday, Kresus, the Web3 platform specializing in cryptocurrencies and non-fungible tokens (NFTs), unveiled a collaboration with Tools for Humanity, the creators of the Worldcoin initiative and the World ID identification system. World ID Meets Kresus App Kresus and Tools for Humanity (TFH) have unveiled a new partnership. In a joint effort, TFH&#8217;s World ID [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-29T20:30:27.000Z",
    "title": "Hong Kong’s SFC Issues Warning on Floki’s ‘Highly Risky’ Staking Programs",
    "url": "https://news.bitcoin.com/hong-kongs-sfc-issues-warning-on-flokis-highly-risky-staking-programs/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/floki_stake-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SFC Warns Against Unregulated Floki and TokenFi Crypto Staking Programs\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/floki_stake-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/floki_stake-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/floki_stake-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/floki_stake-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/floki_stake-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/floki_stake-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/floki_stake.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A Hong Kong watchdog, the SFC, has cautioned investors about the enticing yet potentially risky &#8216;Floki Staking Program&#8217; and &#8216;Tokenfi Staking Program,&#8217; which offer high annualized returns without the required regulatory green light. SFC Warns Against Unregulated Floki and Tokenfi Crypto Staking Programs The Hong Kong Securities and Futures Commission (SFC) has issued a public [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-29T20:38:38.000Z",
    "title": "dYdX Chain introduces liquid staking in latest upgrade",
    "url": "https://www.cryptopolitan.com/dydx-chain-introduces-liquid-staking/",
    "description": "The dYdX Chain, known for its pivotal role in decentralized finance (DeFi), has substantially upgraded to version 3.0. This latest iteration marks a noteworthy expansion in its capabilities, chiefly by introducing liquid staking on its Cosmos-based network. Enhancing liquidity and flexibility The core of this upgrade revolves around enabling interchain accounts, a feature that significantly [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-29T20:00:05.000Z",
    "title": "Bank of England maintains status quo amid inflation uptick",
    "url": "https://www.cryptopolitan.com/bank-of-england-maintains-status-quo/",
    "description": "The Bank of England, steadfast in its resolve, faces the new year with a familiar stance. Despite the uptick in inflation, the revered institution remains anchored in its current monetary policy. The Monetary Policy Committee (MPC), meeting for the first time in 2024, is expected to hold interest rates at a steady 5.25% for the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-29T19:50:10.000Z",
    "title": "UK’s lonely crypto ETF battle amid global acceptance",
    "url": "https://www.cryptopolitan.com/uks-lonely-anti-crypto-etf-battle/",
    "description": "The United Kingdom&#8217;s financial landscape is increasingly looking like an old pub in a ghost town, especially when it comes to cryptocurrency exchange-traded products (ETPs). As countries around the globe, including the usual suspects like continental Europe, Australia, Brazil, Canada, and recently the US, open their arms wide to crypto ETFs, the UK stands aloof, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-29T19:44:52.000Z",
    "title": "There is something very wrong with U.S. financial system",
    "url": "https://www.cryptopolitan.com/something-very-wrong-us-financial-system/",
    "description": "The ominous shadows of the 2008 financial crisis still loom large over the U.S. financial system, a chilling reminder of the havoc wreaked by unchecked debt and leverage. Fast forward to the present, and the echoes of the past ring loud with the recent turbulence in the banking sector, including the fall of Silicon Valley [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-29T20:00:24.000Z",
    "title": "Selling Pressure Subsides As Grayscale Sends 8.6K Bitcoin To Coinbase, Falling Below Average",
    "url": "https://www.newsbtc.com/bitcoin-news/selling-pressure-subsides-as-grayscale-sends-8-6k-bitcoin-to-coinbase-falling-below-average/",
    "description": "In the third week of January, Bitcoin (BTC) demonstrated a modest 3% price recovery, following increased selling pressure exerted by asset manager Grayscale since January 12.  Interestingly, there are indications that this selling pressure is now diminishing, pointing towards a potential restart of the bullish trend that Bitcoin has been experiencing since October 2023. Grayscale&#8217;s Resumed Selling Spree As previously reported, since the approval of the Bitcoin spot exchange-traded fund (ETF), Grayscale has deposited a significant sum of 103,134 BTC ($4.23 billion) into Coinbase Prime as of January 25.  However, recent data from Arkham Intelligence, which tracks Grayscale&#8217;s transfers, reveals that the asset manager sent an additional 11,800 BTC to Coinbase on Friday. Furthermore, Grayscale has resumed its selling spree as the month draws to a close, with a fresh transfer of 8,670 BTC sent to Coinbase for selling on Monday.  Related Reading: 13% Surge Sends AVAX Rumbling – Is This The Start Of Something Big? Grayscale has now sent 123,604 BTC to the exchange, with an approximate value of over $5 billion. However, it is important to note a key aspect amidst this ongoing selling spree. Despite the continuous selling activity, this latest transfer to Coinbase represents Grayscale&#8217;s smallest amount of BTC to the exchange for selling purposes. This development suggests the possibility of a reduction in the selling spree, potentially paving the way for Bitcoin&#8217;s price to make another upward move and regain previously lost levels.  Bitcoin Price Outlook Brightens Renowned crypto analyst Rekt Capital has provided insights into Bitcoin&#8217;s recent price action, highlighting significant levels and indicators to watch.  According to Rekt’s analysis, Bitcoin&#8217;s weekly close managed to surpass the lower boundary of a key range, which was around $41,300. This breakout from the low range is seen as a positive development for cryptocurrency. Related Reading: XRP Predicted To Rally 250% After Final Price Dip: Crypto Analyst Rekt Capital also points out that BTC’s Relative Strength Index (RSI), a widely used momentum indicator, is currently challenging the downtrend line (in red in the chart above).  Rekt suggests that if the RSI can break above this downtrend line, it would invalidate the bearish divergence. A bearish divergence occurs when the price of an asset is rising, but the related indicator, in this case, the RSI, is moving in the opposite direction.  Should the RSI successfully break above the downtrend line, Rekt Capital believes that Bitcoin could potentially revisit the upper boundary of the mentioned range, which is approximately $43,800. Reaching this range high would indicate a further recovery in Bitcoin&#8217;s price. In the meantime, BTC continues to regain upper territory, currently trading at $42,645, representing a 1.5% price recovery in the past 24 hours.  Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-29T21:01:09.000Z",
    "title": "Bitcoin Mining Company GRIID Debuts on Nasdaq Expanding its Market Presence and Sustainability",
    "url": "https://www.crypto-news-flash.com/bitcoin-mining-company-griid-debuts-on-nasdaq-expanding-its-market-presence-and-sustainability/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-mining-company-griid-debuts-on-nasdaq-expanding-its-market-presence-and-sustainability",
    "description": "<img width=\"1897\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background.jpg 1897w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background-300x190.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background-1024x648.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background-768x486.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background-1536x972.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background-150x95.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background-450x285.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Stacked-bitcoin-BTC-coins-with-computer-trading-chart-in-the-background-1200x759.jpg 1200w\" sizes=\"(max-width: 1897px) 100vw, 1897px\" />GRIID initiates listing on Nasdaq, marking a breakthrough in visibility and attracting investors to the market. After merger with Adit EdTech, GRIID expands Bitcoin mining operations, focusing on sustainability and energy efficiency. GRIID, a Bitcoin mining company, begins trading on Nasdaq under the ticker symbol &#8220;GRDI&#8221;, a move that marks an important change in its [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-29T20:39:51.000Z",
    "title": "Charles Schwab Eyeing Entry into the Bitcoin ETF Arena, Analysts Say",
    "url": "https://www.crypto-news-flash.com/charles-schwab-eyeing-entry-into-the-bitcoin-etf-arena-analysts-say/?utm_source=rss&utm_medium=rss&utm_campaign=charles-schwab-eyeing-entry-into-the-bitcoin-etf-arena-analysts-say",
    "description": "<img width=\"1792\" height=\"1024\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitcoin-ETF-Bull-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Grayscale\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitcoin-ETF-Bull-3.jpg 1792w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitcoin-ETF-Bull-3-300x171.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitcoin-ETF-Bull-3-1200x686.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitcoin-ETF-Bull-3-768x439.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitcoin-ETF-Bull-3-1536x878.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitcoin-ETF-Bull-3-150x86.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Bitcoin-ETF-Bull-3-450x257.jpg 450w\" sizes=\"(max-width: 1792px) 100vw, 1792px\" />Charles Schwab may launch a Bitcoin ETF, challenging competitors with lower fees and a cautious approach. Schwab&#8217;s conservative style could lead to cost-effective ETFs, possibly disrupting the cryptocurrency market. Charles Schwab, a prominent player in the financial services industry with $8.5 trillion in client assets under management, is under the spotlight as analysts speculate about [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-29T20:38:11.000Z",
    "title": "Nexera ID and cheqd Partner to Redefine Digital Identity and Data Exchange",
    "url": "https://www.crypto-news-flash.com/nexera-id-and-cheqd-partner-to-redefine-digital-identity-and-data-exchange/?utm_source=rss&utm_medium=rss&utm_campaign=nexera-id-and-cheqd-partner-to-redefine-digital-identity-and-data-exchange",
    "description": "<img width=\"1200\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-29T233652.426.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-29T233652.426.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-29T233652.426-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-29T233652.426-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-29T233652.426-150x84.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-29T233652.426-450x253.png 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Two blockchain startups Nexera ID and cheqd have formed a strategic partnership The goal of the partnership is to advance digital data management in a secure manner. Nexera ID, an identity issuance and verification platform, and cheqd, a privacy-preserving payment and credential network have joined forces to redefine the way businesses approach digital identity and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-29T20:06:48.000Z",
    "title": "Scaramucci Predicts Post-Halving Bitcoin Value Boom and Bets on the Future",
    "url": "https://www.crypto-news-flash.com/scaramucci-predicts-post-halving-bitcoin-value-boom-and-bets-on-the-future/?utm_source=rss&utm_medium=rss&utm_campaign=scaramucci-predicts-post-halving-bitcoin-value-boom-and-bets-on-the-future",
    "description": "<img width=\"1800\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Three-Bitcoin-BTC-coins-on-motherboard.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Three-Bitcoin-BTC-coins-on-motherboard.jpg 1800w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Three-Bitcoin-BTC-coins-on-motherboard-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Three-Bitcoin-BTC-coins-on-motherboard-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Three-Bitcoin-BTC-coins-on-motherboard-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Three-Bitcoin-BTC-coins-on-motherboard-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Three-Bitcoin-BTC-coins-on-motherboard-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Three-Bitcoin-BTC-coins-on-motherboard-450x300.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Three-Bitcoin-BTC-coins-on-motherboard-1200x800.jpg 1200w\" sizes=\"(max-width: 1800px) 100vw, 1800px\" />Scaramucci predicts Bitcoin will reach $200,000 after halving, based on previous cycles and conservative projections. Bitcoin could equal half the market value of gold, raising its price to $400,000, according to Scaramucci. In a recent podcast with Scott Melker, Anthony Scaramucci, founder of Skybridge Capital, shared his optimism towards the future of bitcoin, projecting significant [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-29T21:00:40.000Z",
    "title": "On-Chain Indicator Suggesting Bitcoin Holders Very Reluctant To Sell Coins Despite Post-ETF Correction: Glassnode Analyst",
    "url": "https://dailyhodl.com/2024/01/29/on-chain-indicator-suggesting-bitcoin-holders-very-reluctant-to-sell-coins-despite-post-etf-correction-glassnode-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Now-in-Promising-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Now-in-Promising-.jpg 1748w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Now-in-Promising-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Now-in-Promising-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Now-in-Promising-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Now-in-Promising-.jpg?resize=1536,900 1536w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Now-in-Promising-.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Now-in-Promising-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An on-chain Bitcoin metric is suggesting that holders of BTC currently have very strong hands and are hesitant to let go of their coins, according to a Glassnode analyst. In a new video update posted to the social media platform X, Glassnode&#8217;s lead on-chain analyst, who goes pseudonymously as Checkmatey, takes a look at the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/29/on-chain-indicator-suggesting-bitcoin-holders-very-reluctant-to-sell-coins-despite-post-etf-correction-glassnode-analyst/\">On-Chain Indicator Suggesting Bitcoin Holders Very Reluctant To Sell Coins Despite Post-ETF Correction: Glassnode Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-29T20:55:03.000Z",
    "title": "Altcoins May Be Gearing Up for Q1 Hype Cycle, Says Crypto Trader – Here’s What He Means",
    "url": "https://dailyhodl.com/2024/01/29/altcoins-may-be-gearing-up-for-q1-hype-cycle-says-crypto-trader-heres-what-he-means/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/12/four-altcoins-on-ethereum.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/12/four-altcoins-on-ethereum.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/12/four-altcoins-on-ethereum.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/12/four-altcoins-on-ethereum.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/12/four-altcoins-on-ethereum.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/12/four-altcoins-on-ethereum.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/12/four-altcoins-on-ethereum.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto analyst says that altcoins could be entering into what he describes as a &#8220;hype cycle&#8221; phase to start the new year. Pseudonymous analyst Rekt Capital shares with his 392,000 followers on the social media platform X a chart suggesting that altcoins go through cycles of hype that peak roughly every three [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/29/altcoins-may-be-gearing-up-for-q1-hype-cycle-says-crypto-trader-heres-what-he-means/\">Altcoins May Be Gearing Up for Q1 Hype Cycle, Says Crypto Trader – Here’s What He Means</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-29T19:45:54.000Z",
    "title": "FTX Estate Selling Crypto, Hoarding Cash To Pay Out Customer Claims: Report",
    "url": "https://dailyhodl.com/2024/01/29/ftx-estate-selling-crypto-hoarding-cash-to-pay-out-customer-claims-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/ftx-in-Crypto-Projects.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/ftx-in-Crypto-Projects.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-in-Crypto-Projects.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-in-Crypto-Projects.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-in-Crypto-Projects.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-in-Crypto-Projects.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-in-Crypto-Projects.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The bankruptcy estate of former crypto exchange FTX is reportedly selling off billions of dollars worth of crypto assets and hoarding cash to pay out customers it owes money to. According to a new report by Bloomberg, FTX has begun selling digital assets as a means of repaying customers who had their accounts frozen during [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/29/ftx-estate-selling-crypto-hoarding-cash-to-pay-out-customer-claims-report/\">FTX Estate Selling Crypto, Hoarding Cash To Pay Out Customer Claims: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-29T19:41:20.000Z",
    "title": "Grayscale Bitcoin Sell-Offs Slowing Down After Sending Over $5,000,000,000 in BTC to Coinbase: Arkham",
    "url": "https://dailyhodl.com/2024/01/29/grayscale-bitcoin-sell-offs-slowing-down-after-sending-over-5000000000-in-btc-to-coinbase-arkham/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/Could-Send-Bitcoin-Flying.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/Could-Send-Bitcoin-Flying.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/Could-Send-Bitcoin-Flying.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/Could-Send-Bitcoin-Flying.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/Could-Send-Bitcoin-Flying.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/Could-Send-Bitcoin-Flying.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/Could-Send-Bitcoin-Flying.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Grayscale&#8217;s BTC sell-offs are in the beginning stages of slowing down after the financial giant sent over $5 billion worth of Bitcoin to the top US crypto exchange Coinbase. Lookonchain says that on Friday, Grayscale deposited $410.9 million in BTC to Coinbase Prime, the crypto exchange’s platform that caters to institutional clients. The deposit added to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/29/grayscale-bitcoin-sell-offs-slowing-down-after-sending-over-5000000000-in-btc-to-coinbase-arkham/\">Grayscale Bitcoin Sell-Offs Slowing Down After Sending Over $5,000,000,000 in BTC to Coinbase: Arkham</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]