[
  {
    "source": "NewsBTC",
    "date": "2024-02-21T02:00:26.000Z",
    "title": "Starknet Trading Debut Sees Initial Excitement Fade As STRK Plummets Over 50%",
    "url": "https://www.newsbtc.com/news/starknet-trading-debut-sees-initial-excitement-fade-as-strk-plummets-over-50/",
    "description": "In a highly anticipated move, Starknet (STRK), an Ethereum (ETH) roll-up protocol, commenced trading on prominent cryptocurrency exchanges including Binance, Bybit, Bitfinex, and OKX on Tuesday.  The token&#8217;s launch was accompanied by an airdrop, distributing a staggering 728 million tokens to over one million addresses, making it one of the largest airdrops of the year. However, the initial excitement was dampened as the token experienced a significant retracement of 53.8%, plummeting to a current price of $2.04. However, to better grasp the protocol&#8217;s capabilities and assess its potential future price actions, it is crucial to delve into the underlying technology and the buzz surrounding this player within the top 60 cryptocurrencies, boasting a substantial market capitalization of $1.4 billion. Unveiling Starknet Starknet operates as a Layer 2 solution, offering scalability and Ethereum-level security by generating STARK proofs off-chain, which are relayed on-chain.  Developed by StarkWare Industries, a blockchain firm based in Israel, Starknet was specifically designed to address Ethereum&#8217;s scalability concerns. The protocol was fully launched in February 2022 as a permissionless Layer 2 network, allowing developers worldwide to build decentralized applications on its infrastructure.  StarkWare also developed another platform called StarkEx, which has been live since June 2020. However, StarkEx is a permissioned network tailored to specific decentralized app (Dapp) requirements. Related Reading: Cardano Poised For Massive Rally As Key Indicators Signal Bullish Reversal, ADA Surges 14% Founded in 2018, StarkWare has garnered support from renowned investors such as Sequoia Capital, Paradigm, and Coatue, solidifying its position within the industry. In a Series D funding round held in May 2022, the company raised $100 million, valuing StarkWare at an impressive $8 billion.  StarkWare has raised $261 million in funding, demonstrating strong investor confidence in its vision and technology. With that noted, a prominent decentralized finance (DeFi) researcher who goes by the pseudonym &#8220;DeFi Ignas&#8221; has identified three key catalysts that could fuel the long-term growth of Starknet.  STRK Airdrop And DeFi Incentives  The researcher highlights Starknet&#8217;s utilization of STARKs, a cryptographic proof system, to validate transactions on the Ethereum network. In contrast to other zero-knowledge rollup solutions that employ SNARKs, STARKs offer quantum resilience and the potential for numerous scalability improvements.  In addition, DeFi Ignas believes that the use of the Cairo Development Language ensures that the protocol is resistant to &#8220;lazy copy-paste forks,&#8221; thereby increasing its &#8220;technical robustness.&#8221; Ignas suggests that Starknet&#8217;s differentiators, such as &#8220;Quantum Resilience&#8221; and the comparison between SNARKs and STARKs, present an intriguing potential that is yet to be fully realized. By effectively communicating these distinctive features, Ignas suggests that Starknet can capture the imagination of the wider audience, generating increased interest and adoption. Furthermore, Ignas identifies several factors that could contribute to the growth of the Starknet ecosystem. Firstly, the airdrop of STRK tokens is believed to create a “wealth effect,” attracting capital into the ecosystem.  Additionally, Starknet plans to allocate 50 million STRK tokens to incentivize DeFi protocols, which, in turn, will drive growth in Total Value Locked (TVL). Protocols operating on Starknet are expected to distribute new tokens to users through airdrops.  Related Reading: Crypto Analyst Predicts 10X Move For Filecoin (FIL) To $70, But Can It Reach ATH? On top of that, the STRK token has a “robust” utility model for Ignas, serving as a means to pay gas fees, distribute voting power through delegates, and facilitate native staking for governance and security.  The initial staking Annual Percentage Yield (APY) is set at 12%, incentivizing users to stake their tokens rather than sell them. While some individuals expressed dissatisfaction with not receiving the airdrop, Ignas notes that 27% of survey respondents (3.4k people) received STRK tokens, indicating potential for growth within the Starknet ecosystem but not necessarily for the STRK token itself. Featured image from Shutterstock, chart from TradingView.com"
  }
]