[
  {
    "source": "CoinDesk",
    "date": "2023-08-11T07:42:07.000Z",
    "title": "Shiba Inu Bucks Bitcoin Snoozefest Ahead of Shibarium Deployment",
    "url": "https://www.coindesk.com/markets/2023/08/11/shiba-inu-bucks-crypto-market-lull-ahead-of-shibarium-deployment/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The tokens were up as much as 5% in the past 24 hours, bucking a market-wide trend."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-11T07:47:46.000Z",
    "title": "Bitcoin ETF momentum runs out as crypto market enters summer slump: Report ",
    "url": "https://cointelegraph.com/news/bitcoin-etf-momentum-crypto-market-summer-decline",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/8479df02-c0dc-484b-892d-9f0e570192bb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>DeFi and NFTs remain deep in the bear market while crypto stocks see an upside. </p>\n                    <p><p>After June gave Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) a boost with BlackRock’s application for spot Bitcoin exchange-traded fund (ETF), July sent its price into a summer slump. Only some altcoins managed to perform well in response to <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">Ripple Labs’ partial victory</a> against the United States Securities and Exchange Commission. XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>), the most obvious beneficiary, posted a monthly close of +49%.</p><p>The overall response of markets to the result of the lawsuit was much more muted than many anticipated, as a ruling on XRP’s sales does not easily generalize to other coins and tokens. The SEC is now firmly expected to appeal, and market activity has been generally waning over the summer months.</p><p>Exploring how the various sectors of the digital asset space have performed in this environment, Cointelegraph Research’s “Investor Insights Report” offers a concise monthly round-up of everything going on in crypto. It dives into venture capital, derivatives, <a href=\"https://cointelegraph.com/defi-101/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a>, regulation, mining and much more.</p><p class=\"post-content__accent post-content__accent_small\"><a href=\"https://research.cointelegraph.com/reports/detail/investor-insights-report-etf-filings-revitalize-the-industry-in-june\"><em>The report is available for free on the Cointelegraph Research Terminal.</em></a></p><h2>NFTs and DeFi take a hit</h2><p>Nonfungible tokens (NFTs) have suffered throughout the bear market. However, in July, interest in NFTs waned so much that even classic collections fell to price levels as low as before the craze of 2021. The floor price of <a href=\"https://cointelegraph.com/news/ethereum-nft-royalties-hit-two-year-low-as-bored-ape-floor-price-falls-below-30-eth\">Bored Ape Yacht Club</a> fell below 30 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), and the top five NFT collections in terms of lifetime earnings <a href=\"https://defillama.com/nfts/earnings\" target=\"_blank\" rel=\"noopener nofollow\">collected</a> only $800,000 in monthly royalties.</p><p>The weak numbers were accompanied by <a href=\"https://cointelegraph.com/news/azukidao-proposal-eth-refund-from-founder-zagabond\">negative news surrounding Azuki</a>, a well-known blue-chip NFT project. The AzukiDAO filed a proposal to sue Azuki’s founder and win back 20,000 ETH lost to alleged rug pulls.</p><p>The DeFi sector has been plagued by similar woes, with an unprecedented security vulnerability discovered and exploited. Vulnerabilities in DeFi typically stem from poorly implemented smart contracts, but this time, the Vyper programming language — an alternative to Solidity — was subject to a vulnerability that resulted in <a href=\"https://cointelegraph.com/news/curve-vyper-exploit-whole-story-so-far\">Curve Finance being exploited for over $61 million</a> in a reentrancy hack.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3fe2aa0c-e2ce-4a0f-aaf6-ddd8c2cedbf4.jpg\"  /></figure><p>With the Curve liquidity pools compromised, the price of CRV crashed. The exploited funds were returned several days later, with the hacker accepting a 10% bounty. These and other developments, such as recent news surrounding ZK-rollups, can be found in the DeFi section of Cointelegraph Research’s monthly trends report.</p><h2>Crypto stocks retain strength</h2><p>Crypto stocks have shown unusual strength in recent months, most notably the top mining stocks, which have consistently outperformed BTC. The Cointelegraph Research Investor Insights Report has been tracking the performance of these stocks since their rally started earlier this year.</p><p>In July, too, the market prices for tokens and coins lagged behind the performance of crypto stocks. Publicly traded crypto companies gained an average of 23.9% in their stock price by month-end. Coinbase shares skyrocketed in mid-July in response to the outcome of the Ripple lawsuit and stayed above $100 per share for a week, closing out the month at +32.19%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/ff80cd6d-4abc-4bec-aea3-dfbf75265cdf.jpg\"  /></figure><p>MicroStrategy posted a similarly bullish monthly close at +27.25%. However, mining companies once again stood out as the top performers, with Stronghold Digital Mining shares increasing almost 75% while TeraWulf and Riot Platforms saw gains of over 50% from their early July levels.</p><h2>The Cointelegraph Research team</h2><p>Cointelegraph’s Research department comprises some of the best talents in the blockchain industry. Bringing together academic rigor and filtered through practical, hard-won experience, the researchers on the team are committed to bringing the most accurate, insightful content available on the market.</p><p>With decades of combined experience in traditional finance, business, engineering, technology and research, the <a href=\"https://research.cointelegraph.com/\">Cointelegraph Research team</a> is perfectly positioned to put its combined talents to proper use with the latest Investor Insights Report. </p><p class=\"post-content__disclaimer\">The opinions expressed in this article are for general informational purposes only and are not intended to provide specific advice or recommendations for any individual or on any specific security or investment product.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-11T07:44:39.000Z",
    "title": "The changing landscape of Bitcoin futures and options markets",
    "url": "https://cryptoslate.com/the-changing-landscape-of-bitcoin-futures-and-options-markets/",
    "description": "<p>The current state of Bitcoin&#8217;s options and futures markets is witnessing a notable shift, reflecting a broader transformation in the crypto trading landscape. Over the last 12 months, Bitcoin options markets have seen a significant uptick in growth, with open interest more than doubling. This growth in options trading indicates an increased interest in strategic [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/the-changing-landscape-of-bitcoin-futures-and-options-markets/\">The changing landscape of Bitcoin futures and options markets</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-11T07:50:00.000Z",
    "title": "MakerDAO Announces Airdrop For Spark Protocol Governance Token",
    "url": "https://cryptodaily.co.uk/2023/08/makerdao-announces-airdrop-for-spark-protocol-governance-token",
    "description": "<p>The MakerDAO founder, Rune Christensen, has announced an airdrop for the Spark Protocol&rsquo;s native SPK token.&nbsp;</p>\n<p>According to the proposal, the tokens will be released gradually, with the proposal outlining the distribution of two billion SPK tokens over the next ten years.&nbsp;</p>\nThe SPK Token Airdrop&nbsp;\n<p>The proposal is aimed at promoting long-term engagement with the platform and outlines the eventual distribution of two billion SPK tokens over ten years in an effort to incentivize the continued usage of the Spark Protocol. The SPK token will also act as a governance token for SparkDAO.&nbsp;</p>\n\n<p>&ldquo;The goal of the SPK pre-farming airdrop is to give users and borrow-arbers a reason to keep using Spark Protocol if the EDSR proposal to increase stability fees to 5% goes through.&rdquo;</p>\n\n<p>According to Rune, the proposal would be an avenue for the community to secure SPK tokens before the launch of the SubDAO, with Rune stating on X,</p>\n\n<p>&ldquo;I posted an overview of the potential SparkDAO SPK pre-farming airdrop for early users of http://sparkprotocol.io borrowing: This would be a way to secure early SPK tokens before the SubDAOs launch (Farming not available to US and VPN users)&rdquo;</p>\n\nSpark Expected To Become SubDAO&nbsp;\n<p>Spark Protocol is a lending protocol that has been introduced by MakerDAO. The protocol provides DeFi loans, sourcing liquidity directly from Maker. As collateral, the protocol accepts several assets, such as DAI, ETH, and Staked ETH. Spark Protocol eventually aims to become a SubDAO, which marks a significant step in Maker&rsquo;s Endgame Plan. As a subDAO, Spark will be an entirely independent, decentralized autonomous organization within MakerDAO. The Endgame plan envisions the creation of several subDAOs similar to Spark, each governed by its own distinct community and token.&nbsp;</p>\nA Way To Incentivize Usage&nbsp;\n<p>The SubDAO tokens will be allocated to Spark borrowers and will utilize several assets as collateral, distributed proportionately towards the amount and duration of borrowing. According to Christensen, the aim is to bootstrap a community of users and DAO participants whose goals are aligned with SparkDAO.&nbsp;</p>\n\n<p>&ldquo;We want to bootstrap a community of users and DAO participants that are aligned with the mission and potential of SparkDAO.&rdquo;</p>\n\n<p>The eventual goal is to incentivize the Spark token&rsquo;s active usage, despite it offering a 5% yield on DAI deposits, also called Enhanced DAI Savings Rate. The EDSR on Spark climbed to 8% earlier in the week, resulting in a significant inflow of capital as users rushed to leverage borrowing arbitrage opportunities. This saw users borrow DAI at lower rates and then deploy it for higher yields in EDSR.&nbsp;</p>\n<p>Maker&rsquo;s new Spark Protocol has courted controversy following its launch after it emerged that the protocol&rsquo;s terms of service actively prevented users from accessing the platform through virtual private networks (VPNs). By limiting VPN access, MakerDAO appeared to be restricting US-based users from accessing the platform.&nbsp;</p>\nMaker&rsquo;s Endgame Plan&nbsp;\n<p>MakerDAO&rsquo;s Endgame is a significant update planned to enhance the protocol&rsquo;s efficiency, resilience, and participation. It aims to do this by creating a strong governance equilibrium that would act as the bedrock for SubDAOs, helping parallelize growth and innovation in a community-driven ecosystem. In the short term, Endgame hopes to enhance the supply of DAI to over 100 billion within three years.&nbsp;</p>\n<p>It also aims to ensure that the Maker ecosystem is anchored in a vibrant and independent DAO economy that could grow at an accelerating rate. At the same time, it would also maintain governance equilibrium, ensuring it could scale to any size.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T08:06:50.000Z",
    "title": "Canada’s CBDC is struggling, and incentives won’t work on Canadians",
    "url": "https://www.cryptopolitan.com/canadas-cbdc-struggles-incentives-wont-work/",
    "description": "According to a new Bank of Canada paper, the average Canadian has little reason to adopt a central bank-issued digital currency, which could hinder its widespread acceptance. In the staff discussion paper released on August 10, the central bank examined a hypothetical scenario in which currency was virtually eliminated to determine the potential role of ... <a title=\"Canada&#8217;s CBDC is struggling, and incentives won&#8217;t work on Canadians\" class=\"read-more\" href=\"https://www.cryptopolitan.com/canadas-cbdc-struggles-incentives-wont-work/\" aria-label=\"More on Canada&#8217;s CBDC is struggling, and incentives won&#8217;t work on Canadians\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T07:57:49.000Z",
    "title": "Gemini Expands Its Horizons: Welcomes XRP Ledger to Its Platform",
    "url": "https://www.cryptopolitan.com/gemini-expands-horizons-welcomes-xrp-ledger/",
    "description": "In a significant move that underscores the ever-evolving landscape of the cryptocurrency world, Gemini, one of the leading cryptocurrency exchanges, has announced its support for the XRP Ledger. This addition broadens the platform&#8217;s offerings and aligns with its mission to pave the way for the next wave of financial, personal, and creative freedom. Gemini&#8217;s Growing ... <a title=\"Gemini Expands Its Horizons: Welcomes XRP Ledger to Its Platform\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gemini-expands-horizons-welcomes-xrp-ledger/\" aria-label=\"More on Gemini Expands Its Horizons: Welcomes XRP Ledger to Its Platform\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T07:49:50.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 How much is MATIC worth? The current price of Polygon is $0.6859. Over the past 24 hours, it has seen a trading volume of $1.16 billion. With a market capitalization of $6.15 billion, Polygon holds a market dominance of 0.51%. However, the MATIC price has experienced an increase of 0.18% in ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-11T08:00:59.000Z",
    "title": "Bracing for 2023: Chainlink’s Emerging Competitor QUBE Eyes Crypto Top 50 in 2023",
    "url": "https://www.crypto-news-flash.com/bracing-for-2023-chainlinks-emerging-competitor-qube-eyes-crypto-top-50-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=bracing-for-2023-chainlinks-emerging-competitor-qube-eyes-crypto-top-50-in-2023",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-6.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-6.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-6-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto landscape is a dynamic space where emerging projects aren’t scared of challenging established players. In this case, InQubeta (QUBE) has risen as a strong competitor to Chainlink (LINK), setting its sights on becoming a top 50 crypto in 2023. Bursting with ambitions to rival Chainlink, InQubeta represents a unique blend of AI and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-11T07:42:14.000Z",
    "title": "Lendvest Adopts Chainlink CCIP to Enhance Cross-Chain Credit Score System on Avalanche and Ethereum",
    "url": "https://www.crypto-news-flash.com/lendvest-adopts-chainlink-ccip-to-enhance-cross-chain-credit-score-system-on-avalanche-and-ethereum/?utm_source=rss&utm_medium=rss&utm_campaign=lendvest-adopts-chainlink-ccip-to-enhance-cross-chain-credit-score-system-on-avalanche-and-ethereum",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink X SWIFT\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-300x158.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-1024x538.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-768x403.jpeg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-351x185.jpeg 351w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-24x13.jpeg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-36x19.jpeg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-48x25.jpeg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Lendvest integrates Chainlink CCIP to build a cross-chain credit score system for DeFi across Avalanche and Ethereum. Chainlink’s CCIP ensures top-notch security and reliability in cross-chain operations, backed by the Risk Management Network. In a recent Medium article, Lendvest announced their thrilling partnership with Chainlink, highlighting their use of the Chainlink CCIP to amplify the [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-11T07:58:14.000Z",
    "title": "Bittrex Settles SEC Lawsuit for $24 Million: SEC Receives Criticism",
    "url": "https://coinedition.com/bittrex-settles-sec-lawsuit-for-24-million-sec-receives-criticism/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Hey_SECEnfDirector_you_pat_yourself_on_the_back_for_this_settlement-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>John E Deaton, an XRP lawyer and founder of the crypto regulatory news platform CryptoLaw, shared a thread on X earlier today, lambasting the Securities and Exchange Commission (SEC) for the recent settlement of the SEC-Bittrex lawsuit. Following the announcement of the settlement, the attorney took to X to challenge the regulator’s handling of the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bittrex-settles-sec-lawsuit-for-24-million-sec-receives-criticism/\">Bittrex Settles SEC Lawsuit for $24 Million: SEC Receives Criticism</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]