[
  {
    "source": "Decrypt",
    "date": "2023-07-06T09:30:12.000Z",
    "title": "CFTC Mulls Filing Fresh Case Against Celsius Network, Former CEO Mashinsky: Report",
    "url": "https://decrypt.co/147487/cftc-mulls-filing-fresh-cash-against-celsius-network-former-ceo-mashinsky-report",
    "description": "Celsius' former CEO Alex Mashinsky reportedly misled investors before the crypto lender's spectacular collapse last year. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T09:20:38.000Z",
    "title": "Bitcoin hits new yearly highs as BTC price rebounds to $31.5K",
    "url": "https://cointelegraph.com/news/bitcoin-hits-new-yearly-highs-btc-price-rebounds",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/b578c14d-3df9-40e1-843e-33acf0b0068b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin bulls are stampeding past the top of the range, but there is already a risk that BTC price is forming a \"predatory range.\"</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) reached new 2023 highs on July 6 as a fresh bounce off key support buoyed bulls.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/af056f83-1f35-42c8-9559-afd37fa46707.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day chart. Source: TradingView</em></figcaption></figure><h2>Bitcoin analyst warns of \"predatory range\"</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed BTC price action surging through the top of its recent trading range.</p><p>Analysts had previously reckoned on the largest cryptocurrency dropping further, <a href=\"https://cointelegraph.com/news/bitcoin-traders-hope-buy-dip-btc-price-toward-30k\">potentially reaching $28,000</a> to offer a classic “buy the dip” opportunity.</p><p>With momentum headed back upward, Michaël van de Poppe, founder and CEO of trading firm Eight, was optimistic.</p><p>“I hope your long entries are filled on Bitcoin. Looks quite decent here, and I think we'll slowly continue grinding to the upside,” he <a href=\"https://twitter.com/CryptoMichNL/status/1676855751178944513\" target=\"_blank\" rel=\"noopener nofollow\">told</a> Twitter followers.</p><blockquote>“- Breaking &amp; Flipping $30.8K shall result into fast upwards momentum. - Retesting $30.3K would be equal for longs again.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/03bfdd4e-f504-4ed9-8196-92c942a2d677.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Michaël van de Poppe/Twitter</em></figcaption></figure><p>The uptick came several hours after Larry Fink, CEO of largest global asset manager BlackRock, called Bitcoin an \"international asset\" and listed several advantages <a href=\"https://cointelegraph.com/news/bitcoin-international-asset-black-rock-ceo-bullish-remarks\">during a live interview</a>.</p><p>BlackRock's application to launch the United States' first Bitcoin spot-price exchange-traded fund (ETF) was <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner\">refiled with regulators this week</a>.</p><p>Continuing the analysis, financial commentator Tedtalksmacro was more cautious, warning that derivatives traders could yet influence short-term market direction.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">After longs were flushed yesterday, decent spot bid thus far... but perps chasing up here.<br><br>Predatory range vibes. <a href=\"https://t.co/T7T2iHkeJC\">https://t.co/T7T2iHkeJC</a> <a href=\"https://t.co/0UrmWaWgrj\">pic.twitter.com/0UrmWaWgrj</a></p>&mdash; tedtalksmacro (@tedtalksmacro) <a href=\"https://twitter.com/tedtalksmacro/status/1676873862334537728?ref_src=twsrc%5Etfw\">July 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>\"Nothing but bullish consolidation\"</h2><p>Zooming out, popular trader John Wick said that there was nothing to fear about Bitcoin's extended consolidation near yearly highs.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-analysis-btc-price-stall-35k\">Bitcoin analysis agrees BTC price may stall at $35K</a></em></strong></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/BTC?src=hash&amp;ref_src=twsrc%5Etfw\">#BTC</a>   Weekly<br><br>Nothing but bullish consolidation below the supply zone.<br><br>Green Dots &amp; green bars above the Track line suggest supply zone most likely going to be overcome.<br> <a href=\"https://t.co/kvWRoIjfUM\">pic.twitter.com/kvWRoIjfUM</a></p>&mdash; Wick (@ZeroHedge_) <a href=\"https://twitter.com/ZeroHedge_/status/1676613301105508352?ref_src=twsrc%5Etfw\">July 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Analytics account PlanC was equally hopeful that the current phase would end in bulls' favor. Bitcoin's 2-year exponential moving average (EMA), currently at $28,500, was in focus.</p><p>\"Bitcoin is battling to stay above the 2-Year EMA; historically, when it does, this is a bullish sign,\" its latest tweet <a href=\"https://twitter.com/TheRealPlanC/status/1676756616652234755\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> on the day. </p><blockquote>\"All previous cycle lows occurred when BTC was 45% to 55% below the 2-year EMA, which has already happened.\"</blockquote><p>An accompanying chart showed the so-called 2-Year EMA Multiplier, depecting BTC price behavior around its trend lines in years past.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/149c4a3f-e23c-4bb3-a01b-4e2c77d44933.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 2-Year EMA Multiplier chart. Source: PlanC/Twitter</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\">How smart people invest in dumb memecoins: 3-point plan for success</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T09:10:00.000Z",
    "title": "UAE emerges as a pro-Bitcoin mining destination in the Middle East",
    "url": "https://cointelegraph.com/news/uae-emerges-as-a-pro-bitcoin-mining-destination-in-the-middle-east",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/27094cd8-6962-4bb7-839b-9a84c38a193b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The United Arab Emirates’ combined Bitcoin mining capacity is estimated to be around 400 megawatts or 4% of Bitcon’s global hash rate.</p>\n                    <p><p>The United Arab Emirates (UAE) is gradually solidifying its status as a go-to Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) mining destination in the Middle East. The country has established itself as a pro-Web3 destination for crypto-focused companies with over 30 free trade zones and a growing contribution to the Bitcoin mining hash rate.</p><p>The UAE’s mining journey began with Bitcoin miner Marathon Digital partnering with Zero Two — the digital asset arm of Abu Dhabi’s sovereign wealth fund — in May. The joint venture <a href=\"https://cointelegraph.com/news/marathon-digital-announces-immersion-crypto-mining-operations-in-abu-dhabi\">established two mining sites</a> with a combined 250-megawatt (MW) capacity in Abu Dhabi. </p><p>Abu Dhabi has become a hub for all kinds of crypto mining activity in the UAE due to its energy efficiency and status as the center of trade in the country.</p><p><a href=\"https://hashrateindex.com/blog/bitcoin-mining-around-the-world-united-arab-emirates/\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to data from Hashrate Index, UAE’s combined Bitcoin mining capacity is likely around 400 MW — or 4% of Bitcon’s global hash rate. While the likes of the United States, China, Russia and Kazakhstan are the top four countries with the largest share of Bitcoin’s global hash rate, the UAE could gradually climb the ladder due to its available resources.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/25165566-895f-45aa-b8ea-d87301768e59.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>UAE Bitcoin mining overview. Source: Hashrate Index</em></figcaption></figure><p>As a global player in the energy market, the UAE has shifted its focus from its oil and gas reserves toward solar and nuclear energy. Historically, the country’s electricity was generated by natural gas, but in the recent past, shares of nuclear and solar are growing rapidly.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/12118fbb-cc37-43e4-940a-3d9561872dbc.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>The UAE’s estimated share of electricity production. Source: Hashrate Index</em></figcaption></figure><p>UAE’s electricity demands fluctuate significantly between the hottest and coolest months, leading to a heavy loss of generated electricity. For example, in 2021, the UAE’s combined power and desalination plants wasted 20 terawatt hours, equal to approximately $600 million. This gap and wastage of electricity could be filled by Bitcoin miners.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/dubai-to-abu-dhabi-how-nfts-are-used-in-the-uae\"><strong>Dubai to Abu Dhabi: How NFTs are used in the UAE</strong></a></em></p><p>With Bitcoin mining focused on using clean energy sources, the UAE could see a significant chunk of its energy coming from nuclear and renewable sources in the next decade. Thus, the surplus from these sources could be utilized by miners in the country. Among other advantages for miners is the country's zero-tax policy.</p><p>This means Bitcoin miners can register in one of the country’s over 30 free trade zones and avoid corporate tax, value-added tax and import duties — a significant advantage over operating in Western countries.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-city-guide-to-dubai/\"><strong><em>Crypto City: Guide to Dubai</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-06T09:18:09.000Z",
    "title": "Binance users withdraw assets in June amid global regulatory pressure",
    "url": "https://cryptoslate.com/binance-users-withdraw-assets-in-june-amid-global-regulatory-pressure/",
    "description": "<p>Binance&#8217;s regulatory challenges in various jurisdictions in June appear to have resulted in a significant decline in users&#8217; crypto assets. Binance users withdraw assets. The exchange&#8217;s latest proof of reserve snapshot, taken on July 1, showed that users&#8217; Bitcoin deposits fell by 3.5% to 592,450 BTC from 614.800 recorded on June 1. This meant that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-users-withdraw-assets-in-june-amid-global-regulatory-pressure/\">Binance users withdraw assets in June amid global regulatory pressure</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-06T09:13:05.000Z",
    "title": "Whale outflow from Huobi sees Bitcoin over $31K",
    "url": "https://cryptoslate.com/insights/whale-outflow-from-huobi-sees-bitcoin-over-31k/",
    "description": "<p>Quick Take Bitcoin jumps to over $31,200, up almost 3% on the day A whale outflow from Huobi saw almost 7,500 Bitcoin leave the exchange. Huobi now has less than 20,000 Bitcoin on the exchange; this comes after a report by Willy Woo of Huobi collateral continuing to be drained.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/whale-outflow-from-huobi-sees-bitcoin-over-31k/\">Whale outflow from Huobi sees Bitcoin over $31K</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-06T09:14:20.000Z",
    "title": "Veloce Media Group announces major investment commitment of $50 million from GEM Digital Limited",
    "url": "https://cryptodaily.co.uk/2023/07/veloce-media-group-announces-major-investment-commitment-of-50-million-from-gem-digital-limited",
    "description": "<p>London, United Kingdom, July 6th, 2023, Chainwire</p><ul><li class=\"ql-align-justify\">Veloce Media Group announces major investment commitment of $50 million from GEM Digital Limited&nbsp;Significant investment to fuel Veloce Media Group&rsquo;s growth&nbsp;</li><li class=\"ql-align-justify\">Gem Digital Ltd a global leading digital asset investment firm&nbsp;</li></ul><p class=\"ql-align-justify\">Following the announcement of Veloce Media Group&rsquo;s evolution to Web3, with the launch of its new blockchain utility and governance token, VEXT, it was today announced that GEM Digital Ltd will invest up to $50 million, through a structured token subscription agreement, into the organisation.&nbsp;</p><p></p><p>Veloce, comprising of industry-leading gaming and racing platform Veloce Esports, and race-winning Extreme E outfit Veloce Racing, has attracted over 35 million subscribers, nearly one billion monthly views, across multiple digital platforms including YouTube and Twitch, and millions of social media followers to become the world&rsquo;s largest racing gaming media network.&nbsp;</p><p>The London-based organisation also operates esports and gaming teams and brands for some of the industry&rsquo;s most influential names, including Mercedes AMG, Ferrari, McLaren, Yas Heat, whilst also establishing a successful joint venture sub-brand with Lando Norris &ndash; Quadrant &ndash; and continually competing and winning with Veloce Elites.&nbsp;</p><p class=\"ql-align-justify\">The introduction of VEXT in the coming weeks will position Veloce as a leading decentralised gaming and sports media organisations; providing token holders with real utility through a variety of games integrating VEXT and tangible influence, benefits and rewards across all of the Veloce Media Group assets.&nbsp;</p><p class=\"ql-align-justify\"></p><p>The partnership with GEM Digital has all the signs of being a perfect &lsquo;meeting of minds&rsquo;, as the investment firm moves to increase its stake in this fast-moving world of sourcing, structuring, and investing in utility tokens in relevant and growing industries.&nbsp;</p>&ldquo;This is a very exciting transaction ,&rdquo;&nbsp;said Daniel Bailey, Chief Commercial Officer Veloce and CEO Veloce Racing, &ldquo;It comes very soon after the announcement of VEXT and our plans to evolve our media and sports group into this truly innovative space; validating Veloce&rsquo;s position as a pioneer in the industry.&ldquo;The GEM commitment will allow us to focus on growth and expansion, through acquisition of more gaming and real-life racing properties, ultimately giving our vast community further VEXT utility and influence.&rdquo;&nbsp;<p>For GEM Digital, the investment has found a natural home that reflects its ambitions to work with a diverse set of organisations whilst promoting businesses in the emerging markets, supporting sustainable and inclusive ambitions through business. The investment promises to herald mutual long-term opportunities.</p><p></p><p class=\"ql-align-center\">Website&nbsp;|&nbsp;Telegram&nbsp;|&nbsp;Twitter&nbsp;|&nbsp;Discord&nbsp;|&nbsp;Instagram&nbsp;|&nbsp;YouTube&nbsp;|&nbsp;Linkedin&nbsp;|&nbsp;TikTok</p><p>About Veloce Media Group</p><p>Founded in 2018, Veloce is a multi-pillared gaming and sports media group&#8239;operating across some of the most innovative, fast-growing, and future-focused sectors in the UK.&nbsp;</p><p>Headquartered in London, the Veloce brand comprises of the industry-leading gaming and racing platform, Veloce Esports, and race-winning outfit, Veloce Racing, currently competing in the renowned Extreme E championship.&nbsp;</p><p>As the world&rsquo;s largest digital racing media network, Veloce has so far attracted over 35 million subscribers and nearly one billion monthly views with a focus on esports, gaming, purpose-driven motorsport, and Web3.&nbsp;</p><p>Veloce is partnered with a number of high-profile teams from across the globe, running multiple gaming and esports team operations, including Mercedes AMG, Ferrari, and Yas Heat. Well established JV sub-brands, including Lando Norris&rsquo; gaming and lifestyle brand Quadrant, make up another key aspect of&#8239;Veloce&rsquo;s vast global network.&nbsp;</p><p>To learn more, please visit:&nbsp;https://www.velocemediagroup.com/&nbsp;</p><p>About GEM Digital Limited</p><p>GEM Digital Limited is a digital asset investment firm. Based in The Bahamas, the firm actively sources, structures and invests in utility tokens listed on over 30 CEXs and DEXs globally.&nbsp;</p><p>Global Emerging Markets (\"GEM\") is a $3.4 billion, alternative investment group with offices in Paris, New York, and Bahamas. GEM manages a diverse set of investment vehicles focused on emerging markets and has completed over 530 transactions in 72 countries. Each investment vehicle has a different degree of operational control, risk-adjusted return, and liquidity profile. The family of funds and investment vehicles provide GEM and its partners with exposure to: Small-Mid Cap Management Buyouts, Private Investments in Public Equities and select venture investments.&nbsp;</p><p></p>ContactsCEORupert Svendsen-CookVeloce Media Grouprupert@veloce.ggHead Of Digital MarketingLouis BroomfieldVeloce Media Grouplouis@veloce.gg"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-06T09:30:02.000Z",
    "title": "Report: Namibian Parliament Passes Crypto Regulation Bill",
    "url": "https://news.bitcoin.com/report-namibian-parliament-passes-crypto-regulation-bill/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/ddc500000-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: Namibian Parliament Passes Crypto Regulation Bill\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/ddc500000-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ddc500000-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ddc500000-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ddc500000-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ddc500000-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ddc500000-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/ddc500000.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Namibian parliament recently passed a bill that aims to establish a regulatory regime for cryptocurrencies. According to the Namibian Finance Minister, safeguarding the interests of consumers and combating market abuse are some of the reasons why parliament has taken this step. Mitigating Money Laundering Risks The Namibian parliament is reported to have passed a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T09:21:51.000Z",
    "title": "UK Government Releases AI Whitepaper with 5 Key Principles for AI Responsible Use",
    "url": "https://www.cryptopolitan.com/uk-government-releases-ai-whitepaper-5-key/",
    "description": "The UK Government has taken a significant step towards governing the use of Artificial Intelligence (AI) with the release of its AI whitepaper. The document outlines five key principles to ensure responsible and innovative use of AI technology. By implementing these principles, the UK aims to boost consumer confidence, provide businesses with clarity for investment ... <a title=\"UK Government Releases AI Whitepaper with 5 Key Principles for AI Responsible Use\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-government-releases-ai-whitepaper-5-key/\" aria-label=\"More on UK Government Releases AI Whitepaper with 5 Key Principles for AI Responsible Use\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T09:16:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. Crypto prices have fallen and the entire crypto market cap has dropped by 18% since April 18, 2023. What does the future hold for Binance Coin? ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-06T09:30:55.000Z",
    "title": "Bitcoin Exchange Balance Hits Lowest Value Since 2018: Implications",
    "url": "https://nulltx.com/bitcoin-exchange-balance-hits-lowest-value-since-2018-implications/",
    "description": "The decline in the Bitcoin balance held on exchange addresses, reaching a value of 2.26 million BTC, represents a significant shift in the dynamics of the cryptocurrency market. This balance is the lowest recorded since March 14, 2018, marking a span of 1,939 days. Such a trend indicates a gradual migration of Bitcoin away from [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T09:36:28.000Z",
    "title": "Bullish Outlook for XRP as Ripple Class Action Receives Certification: Can Price Hit $1 by the End of July? Details",
    "url": "https://www.crypto-news-flash.com/bullish-outlook-for-xrp-as-ripple-class-action-receives-certification-can-price-hit-1-by-the-end-of-july-details/?utm_source=rss&utm_medium=rss&utm_campaign=bullish-outlook-for-xrp-as-ripple-class-action-receives-certification-can-price-hit-1-by-the-end-of-july-details",
    "description": "<img width=\"1024\" height=\"538\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/11/xrpl-nft-1024x538-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/11/xrpl-nft-1024x538-1.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/xrpl-nft-1024x538-1-300x158.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/xrpl-nft-1024x538-1-768x404.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/xrpl-nft-1024x538-1-351x185.jpg 351w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />Ripple victory in the SEC case could undermine the class-action lawsuit. Certification of the class-action lawsuit only applies to US investors, not affecting XRP holders in other jurisdictions. Ripple Victory in SEC Case Could Undermine Class-Action Lawsuit Ripple Labs, along with its CEO Brad Garlinghouse and subsidiary XRP II, is currently facing a class-action lawsuit. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T09:32:41.000Z",
    "title": "TRON (TRX) Price Prediction: Experts Forecast A New Rival Token Will Deliver 100x Better Gains",
    "url": "https://www.crypto-news-flash.com/tron-trx-price-prediction-experts-forecast-a-new-rival-token-will-deliver-100x-better-gains/?utm_source=rss&utm_medium=rss&utm_campaign=tron-trx-price-prediction-experts-forecast-a-new-rival-token-will-deliver-100x-better-gains",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-06T121621.630.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-06T121621.630.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-06T121621.630-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-06T121621.630-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Tron is undoubtedly a revolutionary crypto with unique utility focused on decentralized content sharing and entertainment. This spectacular use-case has caused the blockchain-powered platform to receive significant attention both in and out of the crypto industry.   While Tron may be a leading crypto in the industry, the price of its token has been struggling to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T09:23:23.000Z",
    "title": "TON Blockchain Unveils On-Chain Encrypted Messaging: A New Era of Secure Communication",
    "url": "https://www.crypto-news-flash.com/ton-blockchain-unveils-on-chain-encrypted-messaging-a-new-era-of-secure-communication/?utm_source=rss&utm_medium=rss&utm_campaign=ton-blockchain-unveils-on-chain-encrypted-messaging-a-new-era-of-secure-communication",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/09/blockchain-3866139_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/09/blockchain-3866139_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/09/blockchain-3866139_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/09/blockchain-3866139_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/09/blockchain-3866139_1920-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/09/blockchain-3866139_1920-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/09/blockchain-3866139_1920-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/09/blockchain-3866139_1920-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/09/blockchain-3866139_1920-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/09/blockchain-3866139_1920-48x32.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />TON launches a new messaging feature to upgrade the existing one to more private and encrypted exchanges.  This comes after the TON community proposed a deflationary mechanism in June to burn 50 percent of all transaction fees.  The Open Network (TON) is reported to have introduced a messaging feature that enables users to send transaction [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T09:23:15.000Z",
    "title": "Winacoin: The Community-Driven Crypto Gaming Experience with an Exciting Giveaway Opportunity",
    "url": "https://www.crypto-news-flash.com/winacoin-the-community-driven-crypto-gaming-experience-with-an-exciting-giveaway-opportunity/?utm_source=rss&utm_medium=rss&utm_campaign=winacoin-the-community-driven-crypto-gaming-experience-with-an-exciting-giveaway-opportunity",
    "description": "<img width=\"600\" height=\"400\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Winacoin-Featured-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Winacoin-Featured-1.png 600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Winacoin-Featured-1-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Winacoin-Featured-1-104x69.png 104w\" sizes=\"(max-width: 600px) 100vw, 600px\" />Winacoin, the revolutionary project merging the worlds of cryptocurrency and gaming, is poised to redefine the gaming industry with its unique offering. Founded by Joe and Jack Dalton, two seasoned veterans with a passion for poker and an interest in crypto and NFTs, Winacoin aims to introduce a community-oriented approach that benefits every participant. By [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-06T09:31:25.000Z",
    "title": "Why Blackrock is Promoting Bitcoin? 3 Possible Reasons",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/why-blackrock-is-promoting-bitcoin-3-possible-reasons/",
    "description": "<p>The CEO of BlackRock made statements encouraging people to invest in Bitcoin. This shift in stance from a traditionally conservative and risk-averse firm raises several questions. In this article, we analyze three potential explanations for BlackRock&#8217;s CEO embracing Bitcoin. Acknowledging Growing Market Demand One plausible reason behind BlackRock&#8217;s CEO advocating for Bitcoin is the recognition [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/why-blackrock-is-promoting-bitcoin-3-possible-reasons/\">Why Blackrock is Promoting Bitcoin? 3 Possible Reasons</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-06T09:15:00.000Z",
    "title": "Willy Woo Says On-Chain Data Suggests Bitcoin (BTC) Now in Early Stages of Price Squeeze",
    "url": "https://dailyhodl.com/2023/07/06/willy-woo-says-on-chain-data-suggests-bitcoin-btc-now-in-early-stages-of-price-squeeze/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Willy-Woo-Says-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Willy-Woo-Says-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Willy-Woo-Says-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Willy-Woo-Says-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Willy-Woo-Says-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Willy-Woo-Says-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Willy-Woo-Says-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Popular crypto analyst Willy Woo thinks on-chain data suggests Bitcoin (BTC) could be in the early stages of a price squeeze. Woo says a short squeeze, which happens when large numbers of traders who shorted an asset decide to cut their losses in response to an unexpected price bump, triggering additional rallies, could be in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/06/willy-woo-says-on-chain-data-suggests-bitcoin-btc-now-in-early-stages-of-price-squeeze/\">Willy Woo Says On-Chain Data Suggests Bitcoin (BTC) Now in Early Stages of Price Squeeze</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]