[
  {
    "source": "CryptoGlobe",
    "date": "2023-11-12T11:21:54.000Z",
    "title": "Crypto Analyst Who Said in July That His Long-Term Target for XRP Is $8-10 Explains Why He Just Spent 8 Bitcoins to Buy His Latest Watch",
    "url": "https://www.cryptoglobe.com/latest/2023/11/crypto-analyst-who-said-in-july-that-his-long-term-target-for-xrp-is-8-10-explains-why-he-just-spent-8-bitcoins-to-buy-his-latest-watch/",
    "description": "There are several points of intersection and similarities between the cryptocurrency market and the luxury watch market: Alternative Investment Class: Both cryptocurrencies and luxury watches can be considered alternative investments outside of traditional assets like stocks, bonds, or real estate. Investors often look to these alternatives for diversification, potential high returns, or as a hedge […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-12T11:30:20.000Z",
    "title": "Onecoin ‘Compliance’ Head Pleads Guilty to Wire Fraud and Money Laundering Charges",
    "url": "https://news.bitcoin.com/onecoin-compliance-head-pleads-guilty-to-wire-fraud-and-money-laundering-charges/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2056414442-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Onecoin &#039;Compliance&#039; Head Pleads Guilty to Wire Fraud and Money Laundering Charges\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2056414442-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2056414442-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2056414442-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2056414442-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2056414442-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2056414442-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2056414442.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Irina Dilkinska, the head of legal and compliance at Onecoin, has pleaded guilty to &#8220;wire fraud and money laundering charges.&#8221; The charges against Dilkinska relate to her role in organizing the transfer of $110 million in fraudulently obtained funds to a Cayman Islands entity. The $110 Million Transfer to a Cayman Islands Entity Irina Dilkinska, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-12T11:31:52.000Z",
    "title": "Argentina’s Bitcoin Advocates push for balanced Crypto Regulation",
    "url": "https://www.cryptopolitan.com/argentina-bitcoin-advocate-crypto-regulation/",
    "description": "In a significant shift from its previous stance, Bitcoin Argentina, a prominent non-government organization, has presented a draft bill aimed at regulating the cryptocurrency market while preserving its core principles of decentralization. The move was announced at LABITCONF 2023 in Buenos Aires, marks a pivotal moment for the crypto industry in Argentina. Embracing regulation to ... <a title=\"Argentina&#8217;s Bitcoin Advocates push for balanced Crypto Regulation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/argentina-bitcoin-advocate-crypto-regulation/\" aria-label=\"More on Argentina&#8217;s Bitcoin Advocates push for balanced Crypto Regulation\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-12T11:30:12.000Z",
    "title": "Avalanche Shines With A 31% Rally – Can AVAX Bulls Maintain Push To $22?",
    "url": "https://www.newsbtc.com/avalanche/avalanche-shines-with-a-31-rally-can-avax-bulls-maintain-push-to-22/",
    "description": "Avalanche (AVAX) has had a relatively quiet second half of 2023 regarding price performance and ecosystem advancements. However, the token experienced a mesmerized turnaround towards the end of October, which has seen its value rise almost vertically in the past few weeks. Avalanche’s positive run coincides with an optimistic climate in the general crypto market, as investors appear to be more interested in various digital assets. While Bitcoin, the premier cryptocurrency, continues to hold its own above the $37,000 mark, most altcoins seem ready to take advantage of changing market sentiment. Avalanche Displays Strength With 31% Rally &#8211; Price Overview The Avalanche price reached a yearly low of $8.78 in late September, forming the bottom for a trend reversal. The cryptocurrency’s price has been on a bullish run since then while looking to reclaim the highs achieved at the beginning of 2023. As of this writing, the AVAX token is valued at $18.58, reflecting a massive 31% price increase in the past 24 hours. Meanwhile, the price of the altcoin has swelled by more than 48% in the weekly timeframe. Related Reading: Boom! Cronos Unleashes 57% Weekend Explosion, Beating All In The Top 100 Crypto Ranking A broader look at the Avalanche price chart further highlights the token’s strength and attractiveness over the past few weeks. According to CoinGecko data, the value of AVAX has more than doubled in the past month. Avalanche’s positive price action &#8211; in such a short timeframe &#8211; further emphasizes the favorable sentiment currently brewing in the general crypto market. Investors have also seen other altcoins, like Solana, Ethereum, and Chainlink, go on an upward trajectory in the past weeks. Based on data from CoinMarketCap, AVAX has witnessed more than an 85% increase in its daily trading volume. Meanwhile, the token’s current market cap of roughly $6.68 billion reflects a 31% jump in the past day.  Can AVAX Maintain Bullish Momentum To $22? Many investors would be watching to see how far the Avalanche token can keep up with its red-hot momentum. And this makes sense, considering that the cryptocurrency was one of the best performers in the last bull market, rallying to a peak of $145. Related Reading: Ethereum Price Propels To 52-Weeks High, Here’s What Behind It In the short term, price action data suggests AVAX might be able to break above the psychological $20 level without much resistance. Nevertheless, investors should watch out for the $22 threshold, as it has proven to be a significant resistance zone in the past. If Avalanche manages to breach and close above the $22 price mark, the token’s price could experience a parabolic run to $60. On the flip side, if the resistance level holds strong, the AVAX price could fall to find support at around $15.  Avalanche price continues upward trajectory on the daily timeframe &#124; Source: AVAXUSDT chart on the TradingView Featured image from IQ.wiki, chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-12T11:33:00.000Z",
    "title": "Lawyer Faults The SEC Over “Inconsistent” Crypto Regulation",
    "url": "https://coinedition.com/lawyer-faults-the-sec-over-inconsistent-crypto-regulation/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/SEC-usa.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SEC-usa\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/SEC-usa.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/SEC-usa-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/SEC-usa-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/SEC-usa-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/SEC-usa-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/SEC-usa-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Steven Neyaroff, an attorney and blockchain pioneer, Ether qualifies as a security based on the classification by Gary Gensler, the SEC chair, and the actions of Joseph Lubin, the co-founder of Ethereum.  Neyaroff used logical analysis of statements made by Lubin and Gensler at separate events to deduce a curious conclusion. According to [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/lawyer-faults-the-sec-over-inconsistent-crypto-regulation/\">Lawyer Faults The SEC Over “Inconsistent” Crypto Regulation</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]