[
  {
    "source": "Cointelegraph",
    "date": "2024-03-24T10:34:00.000Z",
    "title": " Does the Bitcoin halving impact cross-chain interoperability solutions? ",
    "url": "https://cointelegraph.com/explained/does-the-bitcoin-halving-impact-cross-chain-interoperability-solutions",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8wYWUyZmM2ZTU4MTFjZDQzNjUxNDdjM2VmY2RiYzBhNS5qcGc=.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Learn how Bitcoin halving impacts the crypto ecosystem far beyond its blockchain, shaping the future of cross-chain interoperability.</p>\n                    <p><p data-ct-widget=\"explained-block-content\">                </p><p><em>The Bitcoin protocol reduces the supply of new Bitcoin by 50% via the quadrennial <a href=\"https://cointelegraph.com/learn/bitcoin-halving-how-does-the-halving-cycle-work-and-why-does-it-matter\">Bitcoin halving</a>. This translates into a 50% reduction in revenue (in BTC terms) for Bitcoin miners and poses indirect implications for cross-chain interoperability. </em></p><p>Bitcoin halving events, occurring approximately every four years, reduce block rewards for Bitcoin miners. The halving process is hard-coded into the <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-a-beginners-guide-to-blockchain-technology\">Bitcoin protocol</a> by its <a href=\"https://cointelegraph.com/learn/who-is-satoshi-nakamoto-the-creator-of-bitcoin\">elusive creator, Satoshi Nakamoto</a>, as is the finite supply of 21 million Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>).</p><p><a href=\"https://cointelegraph.com/explained/does-the-bitcoin-halving-impact-cross-chain-interoperability-solutions\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-24T10:32:13.000Z",
    "title": " Nigerian crypto fee hike spurs VC interest amid P2P regulatory hurdles ",
    "url": "https://cointelegraph.com/news/nigerian-crypto-fee-hike-spurs-vc-interest-amid-p2p-regulatory-hurdles",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOGRmMmE0NDgtY2I4Yi00ZmUzLWIyMTgtOTQzYWIwZTFhMjJhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ray Youssef, former Paxful co-founder, remains optimistic about Nigeria’s chance of maintaining its position in the ecosystem despite the recent regulation challenges.</p>\n                    <p><p>Many venture capitalists perceive potential in Nigeria following the suggested increased crypto registration fees. However, the services they can provide may struggle to gain momentum due to government restrictions on peer-to-peer (P2P) platforms aimed at curbing free market promotion, according to Youssef, CEO of Noones, a financial communication and P2P app.</p><p>This comes after a report of Nigeria’s Securities and Exchange Commission (SEC) proposing an amendment to the rules guiding platforms offering crypto services, <a href=\"https://cointelegraph.com/news/nigerian-sec-seeks-to-raise-crypto-exchange-registration-fee\">suggesting a hike in the registration fee for crypto exchanges</a> from 30 million naira ($18,620) to 150 million naira ($93,000). </p><p>Speaking with Cointelegraph, Youssef said the increase is an invitation for the crypto ‘big boys’ only like Coinbase and other companies, to operate in the Nigerian market. He emphasized that the government aims to restrict P2P services to address FX challenges, and exchanges willing to forgo P2P support may operate smoothly in Nigeria. </p><p><a href=\"https://cointelegraph.com/news/nigerian-crypto-fee-hike-spurs-vc-interest-amid-p2p-regulatory-hurdles\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-24T10:30:49.000Z",
    "title": "EU Anti-Money Laundering Laws Ban Provision of Services for Anonymous Cryptocurrency Accounts",
    "url": "https://news.bitcoin.com/eu-anti-money-laundering-laws-ban-provision-of-services-for-anonymous-cryptocurrency-accounts/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/d8cc7a73-9677-4e1f-ba96-7b32eb2284e5-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"EU Anti Money Laundering Laws Ban Provision of Services for Anonymous Cryptocurrency Accounts\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/d8cc7a73-9677-4e1f-ba96-7b32eb2284e5-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/d8cc7a73-9677-4e1f-ba96-7b32eb2284e5-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/d8cc7a73-9677-4e1f-ba96-7b32eb2284e5-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/d8cc7a73-9677-4e1f-ba96-7b32eb2284e5-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/d8cc7a73-9677-4e1f-ba96-7b32eb2284e5-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/d8cc7a73-9677-4e1f-ba96-7b32eb2284e5-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/d8cc7a73-9677-4e1f-ba96-7b32eb2284e5.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A new set of anti-money laundering laws passed by the EU has banned crypto asset service providers from servicing and providing custody to anonymous cryptocurrency accounts. The approved proposal for the &#8220;prevention of the use of the financial system for the purposes of money laundering or terrorist financing&#8221; alleges these assets present &#8220;risks of misuse [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-24T10:30:19.000Z",
    "title": "Bitcoin Addresses Add $1.6 Billion In BTC In A Single Day – Price Recovery Soon?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-addresses-add-1-6-billion-in-btc-in-a-single-day-price-recovery-soon/",
    "description": "The price performance of Bitcoin over the past week has been a source of concern for the majority of the crypto community. This has pretty much been the case for other cryptocurrencies in the market, with several large-cap tokens reversing their recently-accrued profits. However, some investors are treating the recent price decline as a rare opportunity in the bull market as they continue to load their bags with assets of their choice. Specifically, the latest on-chain data shows significant buying activity amongst a certain class of investors.  25,000 BTC Flow Into Accumulation Addresses In One Day Prominent crypto pundit Ali Martinez revealed, via a post on X, that more than 25,000 BTC (valued at approximately $1.6 billion) was moved to accumulation addresses on Friday, March 22. This figure represents the highest amount transferred to these wallets in a single day so far in 2023. Related Reading: Ethereum Drops Below The 100-Day Moving Average – What’s Next? The metric of interest here is the Inflow to Accumulation Addresses on the Bitcoin blockchain. For context, a Bitcoin accumulation address refers to an address that has zero outgoing transactions and maintains a balance of at least 10 BTC. A chart showing the inflows to Bitcoin accumulation addresses &#124; Source: Ali_charts/X This classification, however, excludes digital wallets linked to centralized exchanges and miners and has less than 2 non-dust incoming transfers. Also, it doesn&#8217;t include addresses that have not seen any activity in more than seven years. The increased flow of coins into this class of wallet addresses is evidence of substantial BTC accumulation by entities who view the crypto as a long-term investment. It signals that certain big-money players are amassing Bitcoin in anticipation of potential value appreciation. What&#8217;s more, this significant acquisition by long-term investors emphasizes the increasing adoption of Bitcoin as a store of value. Meanwhile, it might be an indicator of bullish price movement in the short term.  Bitcoin Price Overview As of this writing, Bitcoin is valued at $64,636, reflecting a mere 1% price increase in the past 24 hours. This price change is somewhat negligible, considering the deep retracement of the premier cryptocurrency earlier in the week. According to data from CoinGecko, the price of BTC is down by 2.4% over the past week. Meanwhile, the market leader is currently about 13% from its record high of $73,798. Related Reading: March Sees Nearly $1 Billion In Ethereum Netflow To Centralized Exchanges – What’s Happening? However, it has been an overall positive performance for the Bitcoin price in March, having surpassed this previous all-time high of $69,000 a little over a week ago. And, with a market cap of $1.26 trillion, BTC retains its position as the largest cryptocurrency in the sector. The price of Bitcoin struggles to hold above $64,000 on the daily timeframe &#124; Source: BTCUSDT chart on TradingView Featured image from iStock, chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-24T10:25:00.000Z",
    "title": "Grayscale Will Exhaust in Bitcoin Holdings in 96 Days, Says Arkham",
    "url": "https://coinedition.com/bitcoin-exhaustion-in-grayscale-amidst-increasing-btc-transfers/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Grayscale-Introduces-Funding-Project-to-Manage-Financial-Products.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Grayscale\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Grayscale-Introduces-Funding-Project-to-Manage-Financial-Products.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Grayscale-Introduces-Funding-Project-to-Manage-Financial-Products-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Grayscale-Introduces-Funding-Project-to-Manage-Financial-Products-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Grayscale-Introduces-Funding-Project-to-Manage-Financial-Products-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Grayscale-Introduces-Funding-Project-to-Manage-Financial-Products-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Grayscale-Introduces-Funding-Project-to-Manage-Financial-Products-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Grayscale has reportedly moved 266,470 Bitcoins out of their wallets for GBTC redemptions since January 11. According to Arkham Intelligence, GBTC’s BTC holdings will exhaust in 96 days at the current rate of redemptions. Colin Wu states that Grayscale is considering lowering fees and launching mini ETFs. In a recent turn of events, Arkham Intelligence [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bitcoin-exhaustion-in-grayscale-amidst-increasing-btc-transfers/\">Grayscale Will Exhaust in Bitcoin Holdings in 96 Days, Says Arkham</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]