[
  {
    "source": "Cointelegraph",
    "date": "2024-01-23T09:54:22.000Z",
    "title": " BIS announces CBDC, tokenization projects for 2024 ",
    "url": "https://cointelegraph.com/news/bis-cbdc-tokenization-projects-2024",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNGNhYmRjNzgtYzhiYS00M2MwLTllMmQtNmZiNGFkN2I1Yzg2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The BIS program for this year features six new projects, exploring the issues of cyber security, fighting financial crime, CBDCs, and green finance.</p>\n                    <p><p>The Bank for International Settlements (BIS) Innovation Hub will proceed to the second phase of its central bank digital currencies (CBDCs) privacy testing and launch the blockchain-based tokenization project in 2024. </p><p>On January 23, the BIS announced its work program for this year. It features six new projects, exploring the issues of cyber security, fighting financial crime, CBDCs, and green finance. As Cecilia Skingsley, head of the BIS Innovation Hub, specified in the announcement, another critical area is tokenization, where the new project, Promissa, will be followed by “more initiatives.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/basel-committee-suggests-introducing-maturity-limits-stablecoin-reserve-assets\"><strong><em>Basel Committee suggests introducing maturity limits for stablecoin reserve assets</em></strong></a></p><p><a href=\"https://cointelegraph.com/news/bis-cbdc-tokenization-projects-2024\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-23T10:06:32.000Z",
    "title": "Bitcoin tumbles under $39,000 triggering $115M liquidation in 1 hour",
    "url": "https://cryptoslate.com/bitcoin-tumbles-under-39000-triggering-115m-liquidation-in-1-hour/",
    "description": "<p>Bitcoin&#8217;s (BTC) dip below the $39,000 mark resulted in significant liquidations totaling approximately $115 million across the cryptocurrency market during the past hour. Red market In the last 24 hours, BTC experienced a 4% decline, trading at $38,915 as of press time, according to data from CryptoSlate. This downturn reduced its market capitalization by around [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-tumbles-under-39000-triggering-115m-liquidation-in-1-hour/\">Bitcoin tumbles under $39,000 triggering $115M liquidation in 1 hour</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T10:03:58.000Z",
    "title": "BIS Reveals 2024 Vision: Quantum Security and AI in Finance Take Center Stage",
    "url": "https://www.cryptopolitan.com/bis-reveals-2024-vision-quantum-security-and-ai-in-finance-take-center-stage/",
    "description": "The Bank for International Settlements (BIS) has unveiled its ambitious agenda for 2024, with a focus on emerging financial technologies. The BIS Innovation Hub, in collaboration with central banks and international organizations, is set to embark on six groundbreaking projects aimed at addressing critical challenges in the financial sector. These initiatives encompass quantum security, artificial [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T09:56:15.000Z",
    "title": "Sevilla FC Partners with IBM’s AI for Player Scouting",
    "url": "https://www.cryptopolitan.com/sevilla-fc-partners-with-ibms-ai-for-player-scouting/",
    "description": "Sevilla, Spain – In a bid to enhance their player scouting capabilities, Spanish La Liga club Sevilla FC has joined forces with IBM to leverage the power of generative AI. The team, currently positioned in 17th place in La Liga, just one point above the relegation zone after enduring a series of four consecutive defeats, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T09:48:55.000Z",
    "title": "Will AI Save Japan’s Birth Rate? One Dating Simulator’s Ambitious Mission",
    "url": "https://www.cryptopolitan.com/will-ai-save-japans-birth-rate-one-dating-simulators-ambitious-mission/",
    "description": "Across the globe, something seems to be shifting in the realm of love. Marriage rates are plummeting, cohabitation is rising, and romantic relationships are becoming increasingly short-lived. Birth rates follow a similar trend, hinting at a shift away from traditional family structures. From Cafe Chats to App Taps While factors like changing societal norms and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T09:47:10.000Z",
    "title": "AI Technology Battles Surging Overdose Deaths from Counterfeit Drugs",
    "url": "https://www.cryptopolitan.com/ai-battles-deaths-from-counterfeit-drugs/",
    "description": "In recent years, counterfeit drugs have posed an escalating threat to public health, leading to a surge in overdose deaths across the United States.&#160; The Centers for Disease Control and Prevention (CDC) reports that the number of overdose deaths resulting from counterfeit prescription drugs more than doubled from mid-2019 through the end of 2021.&#160; As [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-23T09:56:33.000Z",
    "title": "Bitcoin mining stocks rise as S&P 500 and Dow Jones hit all-time high",
    "url": "https://crypto.news/bitcoin-mining-stocks-rise-as-sp-500-and-dow-jones-hit-all-time-high/",
    "description": "Marathon Digital, Riot Blockchain, and other public Bitcoin mining companies witnessed positive returns on Monday as Wall Street reached new milestones. The top five largest Bitcoin mining firms by market capitalization saw gains ranging from 2.98% to 6.25% on Monday&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-23T09:54:59.000Z",
    "title": "Shiba Inu’s burn rate up by 6,000%; Cardano and Borroe Finance are firm",
    "url": "https://crypto.news/shiba-inus-burn-rate-up-by-6000-cardano-and-borroe-finance-are-firm/",
    "description": "Shiba Inu’s burn rate is up by 6,000%. Meanwhile, Borroe Finance (ROE) and Cardano (ADA) are on bullish paths"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-23T09:54:27.000Z",
    "title": "Kaspersky warns of new MacOS malware aiming at crypto wallets",
    "url": "https://crypto.news/kaspersky-warns-of-new-macos-malware-aiming-at-crypto-wallets/",
    "description": "Kaspersky urges MacOS users to be cautious, steer clear of dubious websites, and employ reliable cybersecurity measures in response to a new malware targeting MacOS versions 13.6 and higher. The malware, discovered by the cybersecurity firm, is particularly dangerous as&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-23T10:00:29.000Z",
    "title": "JP Morgan Reveals Likelihood Of Spot Ethereum ETFs Getting Approved",
    "url": "https://www.newsbtc.com/news/ethereum/jp-morgan-spot-ethereum-etfs/",
    "description": "Now that Spot Bitcoin ETFs have been approved by the United States Securities and Exchange Commission (SEC), the crypto space anticipates more ETFs to enter the market, particularly Spot Ethereum ETFs.  Despite this, analysts at JP Morgan, an American multinational financial service firm, have revealed a less than optimistic outlook for the potential approval of Ethereum Spot ETFs.  Ethereum Spot ETF Approval Prospects In a note to clients issued on Thursday, January 18, JP Morgan analysts led by Nikolaos Panigirtzoglou, the Managing Director at the financial service firm, expressed their reservations regarding the anticipated approval of Spot Ethereum ETFs by the SEC. Related Reading: Crypto Analyst Predicts Cardano Price Will Climb 2,000% To Reach $11 The analysts cited regulatory and judicial reasons as the basis for their prediction, asserting that the likelihood of Ethereum Spot ETF approval is no higher than 50%.  “While we are sympathetic to the above arguments, we are skeptical that the SEC will classify ether as a commodity as soon as May,” analysts at JP Morgan stated.  Just last week, the SEC delayed the approval of Fidelity’s Ethereum Spot ETF. The regulator postponed its decision date to March 5, 2024, stating it needed more time to evaluate Fidelity’s application. Additionally, the deadline for the SEC’s final decision on the Spot Ethereum ETF applications extends from late January to August 2024.  The most decisive date that would give the crypto space a better outlook on the potential launch of these ETFs is January 25, the deadline for Grayscale’s Ethereum Spot ETF application.  Earlier in June 2022, Grayscale took legal action against the SEC for its rejection of its Spot Bitcoin ETF. In August 2023, the asset management company emerged victorious in its lawsuit, after the US Columbia Court of Appeal ruled that the SEC was wrong to reject Grayscale’s Bitcoin ETF application.  With the SEC’s recent approval of Spot Bitcoin ETF after months of legal and regulatory challenges, many crypto enthusiasts anticipate a lengthy regulatory process before the potential approval of Spot Ethereum ETFs. If Ethereum Spot ETFs are accepted by the SEC, then it would offer investors an unprecedented opportunity to gain exposure to the cryptocurrency without the need to own it.  ETH bulls lose control to bears &#124; Source: ETHUSD on Tradingview.com Why ETH Spot ETF Approval Hovers At 50% Presently, the regulatory framework surrounding cryptocurrencies in the United States is still shrouded in uncertainty. This includes XRP, which suffered a lawsuit from the SEC after the regulator labeled it a security in 2020. Additionally, there have been many other cryptocurrencies the SEC has identified as a security.  The potential approval of Ethereum Spot ETFs generally hinges on the SEC’s classification of the digital asset, whether it is a commodity or a security. In January 2024, the regulatory agency approved Ethereum futures ETFs, ‘implicitly’ accepting Ethereum as a commodity.  Related Reading: Hold On For Four Months: Analyst Predicts When Bitcoin Price Will Reach New ATH If the SEC identifies Ethereum as a commodity, then the potential approval of an ETF application may be in sight. However, as JP Morgan analysts have stated, it may take a considerable amount of time before the SEC makes that decision. The regulatory agency has continually taken an aggressive approach in its regulation of cryptocurrencies in the US. Following the approval of Spot Bitcoin ETFs, SEC Chairman Gary Gensler publicly declared that the agency still does not approve or endorse Bitcoin, labeling all cryptocurrencies as investment contracts subject to federal securities laws. Featured image from Forbes, chart from Tradingview.com"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-23T09:45:38.000Z",
    "title": "Celsius Dump Triggers Ethereum Dive: $35 Million Sell-Off Sends ETH Price Crashing",
    "url": "https://www.newsbtc.com/news/celsius-dump-triggers-ethereum-dive-35-million-sell-off-sends-eth-price-crashing/",
    "description": "Celsius Networks, currently undergoing bankruptcy proceedings, has engaged in significant Ethereum transactions that are causing ripples within the digital currency landscape. In the past 10 hours, on-chain analysts at LookonChain detected noteworthy transfers, including a 13,000 ETH deposit ($30 million) on Coinbase and an additional 2,200 ETH ($5 million) on FalconX. These transactions suggest a proactive stance by Celsius in addressing its ongoing financial challenges. Related Reading: XRP Crash Fears Mount As Whale Dumps 26 Million Tokens – Details Celsius Sells $125M ETH, Maintains $1.3B Reserve According to Arkham Intelligence, Celsius sold more than $125 million worth of Ethereum (ETH) coins between January 8 and January 12. The primary goal of this auction is to pay off creditors. Dune Analytics also revealed a more widespread pattern of redemptions, with over $1.6 billion of staked Ethereum being redeemed during the same period. Since the Shanghai update last year, the amount of redemptions recorded is the highest. The #Celsius wallet deposited 13K $ETH($30.34M) to #Coinbase and 2,200 $ETH($5.13M) to #FalconX again in the past 10 hours. Currently, 2 staking wallets of #Celsius still hold 557,081 $ETH($1.3B). Address:https://t.co/3gGOucC9gYhttps://t.co/zodN4gzVHKhttps://t.co/Jjt9fCN2Ej pic.twitter.com/E9DIZ9KDAH — Lookonchain (@lookonchain) January 23, 2024 Despite facing financial constraints imposed by the court, Celsius still holds a substantial Ethereum reserve. This reserve amounts to over 557,000 coins in two staking wallets, with a total valuation of approximately $1.3 billion. The size of this reserve adds a layer of complexity to Celsius&#8217; current financial situation and underscores the evolving narrative within the crypto space. Source: LookOnChain As part of its obligations to creditors, Celsius has been actively liquidating its Ethereum holdings. These auctions, aimed at paying off outstanding debts, are integral to Celsius&#8217; bankruptcy proceedings. Source: LookOnChain The market has responded to these Ethereum transactions, resulting in a 4% decline in the price of ETH. The cryptocurrency slipped below the $2,350 mark, raising concerns among analysts, especially as ETH now wavers below its crucial demand zone ranging from $2,380 to $2,461. Analysts predict that a failure to maintain this level could lead to a potential retreat towards the $2,000 mark. Ethereum currently trading at $2,307.2 on the daily chart: TradingView.com Wealthy Investors Trigger Ethereum Profit-Taking Santiment&#8217;s historical data reveals that significant transactions by wealthy investors, commonly known as whales, often trigger profit-taking activities among regular ETH holders. This phenomenon intensifies selling pressure and contributes to price declines. Related Reading: From Highs To Lows: Solana’s Price Journey – Can It Recover From FOMO Fumble? Meanwhile, decreasing funding rates suggest an underlying optimism in the market, hinting at a possible cooldown in previously overheated perpetual markets. This situation leaves room for ETH to rebound once the selling pressure subsides. As the bankruptcy drama of Celsius unfolds, the scrutiny on its Ethereum transactions and the resulting market dynamics will persist. Investors and observers are closely monitoring the situation, eagerly awaiting further developments and anticipating the broader implications for both Celsius and the crypto ecosystem. Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-23T10:05:19.000Z",
    "title": "Shiba Inu’s Massive 551% Rally Fueled by Whale Activity: Analysts See a Rosy Path Ahead for Tron and Rebel Satoshi ($RBLZ)",
    "url": "https://www.crypto-news-flash.com/shiba-inus-massive-551-rally-fueled-by-whale-activity-analysts-see-a-rosy-path-ahead-for-tron-and-rebel-satoshi-rblz/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-massive-551-rally-fueled-by-whale-activity-analysts-see-a-rosy-path-ahead-for-tron-and-rebel-satoshi-rblz",
    "description": "<img width=\"512\" height=\"321\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-23T082825.706.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-23T082825.706.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-23T082825.706-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-23T082825.706-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-23T082825.706-450x282.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Shiba Inu (SHIB), which is experiencing an extraordinary surge thanks to a significant increase in whale activity, is making headlines in the dynamic world of cryptocurrencies. The meme-inspired token has experienced a whopping 551.43% spike in the volume of large transactions, indicative of significant trades involving sums exceeding $100,000. This surge in whale activity sheds [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-23T10:00:56.000Z",
    "title": "Bitcoin ETF Approval Triggers $7K Drop; Injective and InQubeta Seen as Leading Picks for 2024",
    "url": "https://www.crypto-news-flash.com/bitcoin-etf-approval-triggers-7k-drop-injective-and-inqubeta-seen-as-leading-picks-for-2024/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-etf-approval-triggers-7k-drop-injective-and-inqubeta-seen-as-leading-picks-for-2024",
    "description": "<img width=\"512\" height=\"344\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-23T081059.584.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-23T081059.584.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-23T081059.584-300x202.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-23T081059.584-150x101.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-23T081059.584-450x302.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The long-standing efforts for a Bitcoin (BTC) spot ETF made it one of the most anticipated developments in the crypto space for a decade. Recently, it became a reality when the SEC&#8217;s decision on Bitcoin ETF greenlighted numerous spot Bitcoin ETFs. Due to this victory, BTC faced serious volatility, including a surprising dump of over [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-23T09:48:35.000Z",
    "title": "Top 9 Avalanche Projects to Watch in 2024 — Part 2",
    "url": "https://www.altcoinbuzz.io/product-release/top-9-avalanche-projects-to-watch-in-2024-part-2/",
    "description": "<p>This is Part 2 of a 2-part series about top Avalanche projects. We cover another 4 up-and-coming projects in this article. Various blockchain verticals are in this article. So, without further ado, let&#8217;s see what&#8217;s cooking in the Avalanche ecosystem. 1) NATIX Network With NATIX Network, we move into the DePin (Decentralised Physical Infrastructure Network [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/product-release/top-9-avalanche-projects-to-watch-in-2024-part-2/\">Top 9 Avalanche Projects to Watch in 2024 — Part 2</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]