[
  {
    "source": "Cointelegraph",
    "date": "2023-10-31T01:52:16.000Z",
    "title": "Twitter is now worth half of the $44B Elon Musk paid for it: Report",
    "url": "http://cointelegraph.com/news/elon-musk-twitter-x-worth-half-since-44b-acquisition",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/36a42107-e2d3-4f29-adaa-35430e16c055.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to an internal memo reportedly circulating within X, the company is now valued at just $19 billion.</p>\n                    <p><p>Elon Musk’s social media platform, X (formerly Twitter), is worth less than half of what the tech billionaire bought it for in October last year, an internal memo has reportedly revealed.</p><p>According to an Oct. 30 <a href=\"https://www.bloomberg.com/news/articles/2023-10-30/musk-s-x-valued-at-less-than-half-of-price-he-paid-for-twitter\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from Bloomberg, the internal memo and sources familiar with the matter said that restricted stock units recently paid to employees of the company were valued at $45 a share, which puts the company’s value at around $19 billion, less than half of the $44 billion that Musk paid for the company on Oct. 27, 2022. </p><p>Musk has made a series of controversial moves since taking over the platform, <a href=\"https://cointelegraph.com/news/twitter-rebrand-to-x-elon-musk-everything-app\">including rebranding it to X</a>, <a href=\"https://cointelegraph.com/news/twitter-down-elon-musk-rate-limit-exceeded\">changing many of its content rules</a> and <a href=\"https://cointelegraph.com/news/elon-musk-faces-class-action-suit-over-mass-twitter-layoffs\">laying off approximately 80%</a> of the company’s workforce.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/60ba604a-106d-4076-a6f3-316faabd7895.png\"  /><figcaption style=\"text-align: center;\"><em>X's daily active user count has declined nearly 20% since Musk's takeover. Source: WSJ</em></figcaption></figure><p>Musk’s drastic changes, along with his outspoken presence on the platform also appears to have made his company less popular with advertisers, with Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-01-18/elon-musk-has-more-to-lose-if-he-tries-to-skip-twitter-debt-payment\" target=\"_blank\" rel=\"noopener nofollow\">estimating</a> that X has now lost at least half of its total advertising revenue. </p><p>Meanwhile, the significant drop in revenue has made the servicing of Musk’s debt worrisome for the firm as a whole. As of the time of publication, X reportedly owes around $1.2 billion in interest payments on its roughly $13 billion in total debt. </p><p>Musk has made it clear that he wants to rely more heavily on paid user subscriptions, but as of right now, less than 1% of the platform's total user base has <a href=\"https://github.com/travisbrown/blue\" target=\"_blank\" rel=\"noopener nofollow\">decided</a> to fork over money for a premium subscription — which equates to less than $120 million in annual revenue.</p><p>Cointelegraph contacted X for comment but did not receive an immediate response.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/elon-musk-demonetize-posts-corrected-community-notes\"><strong><em>Elon Musk says posts busted by Community Notes won’t earn revenue share</em></strong></a></p><p>On the other hand, some have seen benefits to Elon Musk’s tenure at the company. </p><p>One of the popular additions to the platform under Musk has been <a href=\"https://cointelegraph.com/news/x-ad-revenue-sharing-crypto-payments-on-the-horizon\">paying individual creators</a> for their engagement by way of revenue-sharing payments.</p><p>Recently, Musk announced that any posts corrected by the Community Notes feature would become “ineligible for revenue share” — a move that seeks to prioritize accurate information over the purely viral, and potentially inaccurate content.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Making a slight change to creator monetization: <br><br>Any posts that are corrected by <a href=\"https://twitter.com/CommunityNotes?ref_src=twsrc%5Etfw\">@CommunityNotes</a> become ineligible for revenue share.<br><br>The idea is to maximize the incentive for accuracy over sensationalism.</p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1718676793165750564?ref_src=twsrc%5Etfw\">October 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Meanwhile,Musk has repeated on numerous occasions that he means to <a href=\"https://cointelegraph.com/learn/what-is-elon-musks-x-the-everything-app\">turn X into an “everything app</a>” — largely inspired by the super apps popular in Asia such as WeChat — which would see the social media platform expand to include a range of financial services, video calls and other lifestyle use cases. </p><p>There are also hopes that X would <a href=\"https://cointelegraph.com/news/elon-musk-wants-twitter-payments-system-built-with-crypto-in-mind\">integrate cryptocurrency</a> in some way in the future.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethereum-restaking-blockchain-dangerous/\"><strong><em>Ethereum restaking — Blockchain innovation or dangerous house of cards?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-31T02:00:39.000Z",
    "title": "Crypto Halloween Nightmare: MEME, MEMEPAD, And TITANX Tokens Collapse, Traders Lose 100%",
    "url": "https://www.newsbtc.com/news/crypto-halloween-nightmare-meme-memepad-and-titanx-tokens-collapse-traders-lose-100/",
    "description": "In a chilling development on Halloween Day, the crypto community was hit with disturbing news as PeckShield, a renowned blockchain security company, revealed a series of rug pulls over the past few hours. Rug pulls, a form of cryptocurrency scam, involve sudden and deliberate value drops in specific tokens, accompanied by the perpetrators swapping the native tokens for Ethereum (ETH). The meme coins affected by the rug pulls were identified as MEME, MEMEPAD, and TITANX. Multiple Rug Pulls Shake Crypto Market On Halloween According to PeckShield&#8217;s X (formerly Twitter) post, the MEME token on the Ethereum blockchain experienced a jaw-dropping 100% drop in value. The address 0xBd72&#8230;5871 was responsible for swapping a staggering 4,854,740,126,240,000 MEME tokens for approximately 43.68 ETH.  It is important to note that the rug pull token shared the same name as the legitimate MEME token, adding to the confusion. Related Reading: This Chart Makes It Clear: Bitcoin Is Bullish Similarly, the MEMEPAD token on Ethereum suffered an identical 100% value drop. The address 0xBd72&#8230;5871 conducted a swap of 4,854,740,126,240,000 MEMEPAD tokens for around 44.84 ETH.  Once again, the fraudulent crypto rug pull shared the same name as the genuine MEMEPAD token, compounding the deceitful nature of the scam. Additionally, the TITANX token launched two days ago, October 28, on Ethereum experienced a staggering 100% value decline.  The address 0xBd72&#8230;5871 executed a swap of 4,854,740,126,240,000 TITANX tokens for approximately 46 ETH. Mirroring the previous instances, the rug pull token masqueraded under the same name as the legitimate TITANX crypto token. Fantom Foundation Funds Vanish In alarming events, the Fantom (FTM) Foundation finds itself entangled in a harrowing tale of fund drains and swift token swaps. PeckShield has reported two significant incidents involving the Fantom Foundation&#8217;s finances, leaving the organization with substantial losses. The first incident occurred on October 17, 2023, when wallets associated with the Fantom Foundation were drained of approximately $7 million worth of cryptocurrencies, equivalent to around 4,500 ETH. Related Reading: RSI Records Major Golden Cross: XRP Predicted To Cross The $1 Mark In 16 Days Additionally, on October 26, the Fantom Foundation faced another devastating event. An unidentified entity, the &#8220;Fantom Foundation Drainer,&#8221; executed a bold move by swapping a staggering 8,087,377.97 DAI for 4,560.52 ETH.  The gravity of the situation intensified when the Fantom Foundation Drainer swiftly executed another swap on October 30, converting the 4,560.52 ETH back into approximately 8.3 million DAI within a mere 30 minutes.  The Fantom Foundation is now faced with the daunting task of investigating the breaches, identifying the culprits, and fortifying its security infrastructure to prevent future incidents.  Despite recent developments, the native token of the Fantom protocol, FTM, is trading at $0.2388, reflecting a 1% increase in the past 24 hours.  Notably, the token has experienced a substantial surge across various time frames. Presently, it has maintained an upward trend, with gains of over 6% and 30% in the seven-day and fourteen-day periods, respectively.  Over the year-to-date period, the token has recorded a 5% increase. These figures indicate the token&#8217;s positive performance and growth trajectory. Featured image from Shutterstock, chart from TradingView.com "
  }
]