[
  {
    "source": "Decrypt",
    "date": "2023-06-30T15:57:45.000Z",
    "title": "OKX Expands Manchester City Soccer Sponsorship With $70 Million Deal",
    "url": "https://decrypt.co/146878/okx-expands-manchester-city-soccer-sponsorship-70-million-deal",
    "description": "Leading soccer club Manchester City is sticking with OKX, inking a three-year deal to make the crypto exchange its official sleeve sponsor."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-30T15:54:52.000Z",
    "title": "Do AI Sex Robots Require Consent Too?",
    "url": "https://decrypt.co/146868/ai-sex-robots-require-consent",
    "description": "From robot brothels to AI girlfriends, should sex robots require consent? Experts weigh in on this emerging moral dilemma."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-30T16:00:06.000Z",
    "title": "Stablecoin buying power on exchanges increases as BTC and ETH see outflows",
    "url": "https://cryptoslate.com/stablecoin-buying-power-on-exchanges-increases-as-btc-and-eth-see-outflows/",
    "description": "<p>In June, the surge in stablecoin volume flowing into exchanges has been a clear indicator of the market&#8217;s changing dynamics. This is particularly evident when analyzing exchange buying power, a metric that measures the 30-day change in stablecoin buying power on exchanges. The exchange buying power metric is calculated by tracking the 30-day change in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/stablecoin-buying-power-on-exchanges-increases-as-btc-and-eth-see-outflows/\">Stablecoin buying power on exchanges increases as BTC and ETH see outflows</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-30T15:45:09.000Z",
    "title": "Trezor study shows nearly 75% of participants have concerns over digital pound",
    "url": "https://cryptoslate.com/trezor-study-shows-nearly-75-of-participants-have-concerns-over-digital-pound/",
    "description": "<p>In a recent survey conducted by Trezor, nearly 75% of respondents expressed concerns over the potential control the U.K. government could have over access to funds via its proposed Central Bank Digital Currency (CBDC). Further responses suggested a strong degree of public concern about their implementation, including worries about imposing time limits on holdings. Trezor [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/trezor-study-shows-nearly-75-of-participants-have-concerns-over-digital-pound/\">Trezor study shows nearly 75% of participants have concerns over digital pound</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T16:02:00.000Z",
    "title": "SEC deems Bitcoin ETF filings inadequate",
    "url": "https://www.cryptopolitan.com/sec-deems-bitcoin-etf-filings-inadequate/",
    "description": "The United States Securities and Exchange Commission has found a slew of applications submitted by asset management firms, with intentions to establish spot bitcoin exchange-traded funds (ETFs), lacking in clarity and comprehensiveness. This news, first reported by the Wall Street Journal, has signaled an impending halt to the development of these funds and sent ripples ... <a title=\"SEC deems Bitcoin ETF filings inadequate\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-deems-bitcoin-etf-filings-inadequate/\" aria-label=\"More on SEC deems Bitcoin ETF filings inadequate\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T15:45:26.000Z",
    "title": "Javier Milei declares he can dollarize Argentina",
    "url": "https://www.cryptopolitan.com/javier-milei-says-he-can-dollarize-argentina/",
    "description": "Presidential candidate Javier Milei of Argentina boldly revealed a plan to implement dollarization of Argentina&#8217;s economy at the current market rates. With a strategic campaign plan aimed at eradicating inflation, Milei believes the nation has the necessary resources for this ambitious move. Confidential agreements with undisclosed parties are already in place to provide the liquidity ... <a title=\"Javier Milei declares he can dollarize Argentina\" class=\"read-more\" href=\"https://www.cryptopolitan.com/javier-milei-says-he-can-dollarize-argentina/\" aria-label=\"More on Javier Milei declares he can dollarize Argentina\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T16:00:13.000Z",
    "title": "OKX Liquid Marketplace Records Over $3 Billion In Institutional Trade Volume",
    "url": "https://www.newsbtc.com/crypto/okx-liquid-marketplace-records-3-billion-in-trade-volume/",
    "description": "Institutional trade volume on the OKX Liquid Marketplace has surpassed $3 billion, the second-largest crypto exchange by trading volume announced on Friday. The Liquid Marketplace is an on-demand liquidity network for professional and institutional traders. This platform allows traders to send requests for quotes (RFQs) to market makers for large digital asset transactions.  OKX Liquid Marketplace Experiences Rapid Growth In Q2 In a press release on Friday, OKX announced that its Liquid Marketplace has now exceeded $3 billion. “This milestone is a testament to the Liquid Marketplace&#8217;s success in providing institutional traders with deep liquidity and reliable execution,” the press statement read. Related Reading: Whales Dive Into XRP, Accumulating $170 Million Worth: What’s Their Game Plan? In April 2023, OKX revealed that the institutional Liquid Marketplace recorded over $1 billion in trading volume in the first quarter of 2023. As of now &#8211; the end of June and 2023 Q2, this figure has more than tripled, surpassing the $3 billion mark. Furthermore, the Liquid Marketplace has been advancing in innovation and product development lately. A few days ago, OKX disclosed the launch of the “Nitro Spreads” feature on the institutional trading platform. Nitro Spreads allows professional and institutional traders to make complex basis trades in a single click. Basis trading refers to trading the difference between an asset’s price on two distinct markets, such as spot vs futures, to generate profits.  This type of trading can be cumbersome, as it usually requires both legs of the trade to be executed simultaneously. However, Nitro Spreads automates this process by executing the two legs of the trade via a central orderbook. On the Liquid Marketplace, traders can use the feature across any combination of the spot, perpetual, and futures markets. OKB Price Slows Down, Makes No Significant Movement In The Past Week While the OKX ecosystem has been surrounded by positivity in recent days, this has not been reflected in the price of OKB, the exchange’s native token. The coin has not registered any loss or gain in the past seven days, according to CoinGecko data. That said, the OKB token appears to be losing the momentum that pushed its price by nearly 13% in the previous week. The cryptocurrency has also not made any significant price movement since then. Related Reading: Bitcoin Price Stalls Below $31,000, Is The Best Time To Buy Next Monday? Price data reveals that OKB has been in a ranging market in the past few months, trading between the $55 and $40 price points. Since reaching a yearly high of $57.98, the cryptocurrency’s price has decreased by roughly 23%. As of this writing, the OKB token changes hands at $44.53, representing a 2.6% price increase in the last 24 hours. Meanwhile, the coin has a 24-hour trading volume of more than $6 million, with a 33.7% increase in the last day. OKBUSD trading at $44.391 &#124; Source: OKBUSD chart from TradingView Featured image from OKX, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T16:00:26.000Z",
    "title": "Meme Coin News: DigiToads (TOADS) Trends Above Pepe Coin (PEPE) Following Stellar Performance During Presale",
    "url": "https://www.crypto-news-flash.com/meme-coin-news-digitoads-toads-trends-above-pepe-coin-pepe-following-stellar-performance-during-presale/?utm_source=rss&utm_medium=rss&utm_campaign=meme-coin-news-digitoads-toads-trends-above-pepe-coin-pepe-following-stellar-performance-during-presale",
    "description": "In the world of meme coins, there&#8217;s a new amphibian taking the stage and stealing the spotlight from the famous Pepe Coin (PEPE). DigiToads (TOADS) has made a grand entrance, captivating investors with its unique vision and promising features. With a successful presale that raised over $5.7 million, DigiToads is making waves in the cryptocurrency [...]"
  }
]