[
  {
    "source": "CoinDesk",
    "date": "2023-07-13T22:42:41.000Z",
    "title": "Ripple Labs Ruling Throws U.S. Crypto-Token Regulation into Disarray",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/13/ripple-labs-ruling-throws-us-crypto-token-regulation-into-disarray/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The only thing this ruling guarantees is continued uncertainty in the cryptocurrency markets – uncertainty only Congress can correct, says Preston Byrne."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-13T22:28:51.000Z",
    "title": "'More and More' Game Publishers Will Embrace NFTs: Mythical Games CEO",
    "url": "https://decrypt.co/videos/interviews/wBWogSkl/more-and-more-game-publishers-will-embrace-nfts-mythical-games-ceo",
    "description": "In the wake of EA Sports and Fortnite creator Epic Games embracing Nike's NFT platform, Mythical Games CEO John Linden tells Decrypt's Andrew Hayward how quickly he expects to see more major traditional game publishers enter the blockchain space and how quickly the industry will scale."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-13T22:48:19.000Z",
    "title": "Demand is driving the price of Bitcoin to $130K",
    "url": "https://cointelegraph.com/news/demand-driving-bitcoin-price-to-130k",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/df8a49ea-405b-4f6f-844f-778a13f1ae96.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>My data accurately predicted when Bitcoin would decline in 2021. Today, it’s indicating that Bitcoin will climb to $130,000 — and possibly higher.</p>\n                    <p><p>In any market, whether it is fruit and vegetables or financial assets, prices are determined by the intersection of <a href=\"https://cointelegraph.com/explained/how-supply-affects-cryptos-value-explained\">supply and demand</a>.</p><p>If tomatoes are scarce due to a flood, with the same demand, the price in the supermarket will inevitably be higher — just as it will be higher if, with the same supply, twice as many people want to buy tomatoes.</p><p>In the financial market, if supply is unlimited, the price is not changed by demand, as in the case, for example, of a mutual fund.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-etf-isnt-bullish-for-bitcoin\"><strong><em>Don’t be naive — BlackRock’s ETF won’t be bullish for Bitcoin</em></strong></a></p><p>If more subscribers want to buy this fund, more shares are simply issued at something called net asset value (NAV) — that is, the correct value of the fund’s assets.</p><p>For example, let’s suppose a fund has a capitalization of $100 million, made up of 10 million units at a value of $10. If an investor wants to invest $10 million, 1 million units are issued at a value of $10, and the capitalization of the fund becomes $110 million.</p><p>It would be a different story if the shares available were limited to 10 million, so anyone who wanted to buy the shares would have to find someone willing to sell them. In that case, the price might no longer be $10, but it would depend on how much the buyer was willing to pay and how much the seller wanted to earn. It would create a situation in which the price fluctuated according to uneven supply and demand. If an asset was in high demand, obviously, the price could go much higher than the correct price.</p><p>But how can you estimate the correct price?</p><p>In 2021, I published data that attempted to <a href=\"https://cointelegraph.com/news/forecasting-bitcoin-price-using-quantitative-models-part-3\">estimate the fair value price of Bitcoin</a>, illustrated in the graph below. It suggested that in June of that year, we had reached a relative maximum for Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). (I hoped at the time it would not prove true, but it did.) How had I estimated this value?</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/cacdef7c-d08c-4a20-803c-7fe7950da660.jpg\"  /></figure><p>The previous fund example helps us understand the logic behind this estimation.</p><p>If the capitalization of a fund is given by the number of units outstanding multiplied by the NAV, or the price, it is also true that it could also be estimated as the number of investors in the fund per average amount held by each investor.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/293c0885-9281-4530-b5e5-b855b81afa26.jpg\"  /></figure><p>So, in the case of Bitcoin, if I would be able to estimate the average amount held in each wallet by</p><p>the number of wallets in circulation, I can also estimate the capitalization of the Bitcoin and, consequently, by dividing by the number of Bitcoin in circulation, derive its price.</p><p>Luckily for us, the transparency offered by the blockchain allows us to collect much of this information with a high degree of reliability. For example, the number of Bitcoin addresses with a balance different than zero can be easily tracked just by running a network node.</p><p>As can be seen from the graph, the average amount (United States dollars) in wallets fluctuates due to supply and demand (many wallets hold Bitcoin without ever moving it), so if we take the 90th percentile and the 10th percentile, we can find a range that can lead us to subsequently estimate the price of Bitcoin.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/9926a063-a768-41ee-909d-04b00b7a646f.jpg\"  /></figure><p>Now, once the growth curve (on a logarithmic scale) of the wallets in circulation has been estimated, it is possible to estimate a range within which the price of Bitcoin should move.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/202b0581-5372-4971-b153-e0bc0aa56940.jpg\"  /></figure><p>This model is simple, but the simplicity is its strength: we do not know if a user owns different addresses or if a single address is “owned” by multiple users — as in the case of the cold wallet of an exchange — but we can rely on these relationships especially when compared in terms of large numbers and on a time horizon of a complete price cycle.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-etfs-even-worse-for-crypto-than-central-exchanges\"><strong><em>Bitcoin ETFs: Even worse for crypto than central exchanges</em></strong></a></p><p>For example, in the last days of a crypto winter — like in recent months — typically, we can detect an increase in withdrawals from crypto exchanges and a reduction in balances held in these centralized platforms. Since keeping crypto assets in third-party custody is usually considered more dangerous, this signal is considered bullish since it shows the preference for investors to hold a long Bitcoin position in the long term rather than holding it in a trading account to take advantage of short-term speculative opportunities.</p><p>This phenomenon is therefore accompanied by an increase of addresses (withdrawal from a few cumulative cold wallets to fill many single addresses controlled by individual persons) and lays the foundations for a cyclical price appreciation also based on the model described in this article.</p><p>Data from this graph and this model indicate the price of Bitcoin could reach its next ceiling in autumn 2025 at $130,000 — and possibly higher.</p><p>As always, it is important to note that this forecast is not financial advice. It can only be taken as an expected value based on some assumption with a certain degree of confidence. But similar price growth estimates also emerge from other predictive models. The recent surge of interest in this asset class among institutional players like BlackRock — the largest asset manager in the world, which is seeking approval for a spot Bitcoin exchange-traded fund — may indicate that they place some faith in these models.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Daniele Bernardi</strong> is the founder of Diaman, a group dedicated to the development of profitable investment strategies. He is also the chairman of Investors’ Magazine Italia SRL and Diaman Tech SRL, and is the CEO of asset management firm Diaman Partners. In addition, he is the manager of a crypto hedge fund. He is the author of <em>The Genesis of Crypto Assets</em>, a book about crypto assets. He was recognized as an “inventor” by the European Patent Office for his European and Russian patents related to the mobile payments field.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-13T21:55:00.000Z",
    "title": "Texas Blockchain Council director announces run for State House",
    "url": "https://cointelegraph.com/news/blockchain-council-director-run-texas-house",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/0dfafe04-01ef-4044-9fa6-c2f247dc5d8e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The director of Bitcoin mining analytics at the TBC said he was opposed to the Fed’s exploration of a central bank digital currency and planned to push for “digital freedom.”</p>\n                    <p><p>Steven Kinard, director of Bitcoin mining analytics at the Texas Blockchain Council, a crypto advocacy group, has announced that he will run for a seat in the Texas House of Representatives.</p><p>In a July 11 announcement, Kinard <a href=\"https://twitter.com/KinardForTX/status/1678846416213401601\" target=\"_blank\" rel=\"noopener nofollow\">said</a> he planned to seek the Republican Party nomination for Texas House District 70 in the Dallas-Fort Worth area, where he would serve a two-year term starting in 2025 if elected. The candidate has worked at the Texas Blockchain Council since March 2022 following roughly three years at BOK Financial. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It's official! <a href=\"https://twitter.com/hashtag/HD70?src=hash&ref_src=twsrc%5Etfw\">#HD70</a> <a href=\"https://twitter.com/hashtag/txlege?src=hash&ref_src=twsrc%5Etfw\">#txlege</a> <a href=\"https://t.co/yNBvEwFbCq\">pic.twitter.com/yNBvEwFbCq</a></p>— Steve Kinard (@KinardForTX) <a href=\"https://twitter.com/KinardForTX/status/1678846416213401601?ref_src=twsrc%5Etfw\">July 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Kinard said he planned to push for “digital freedom” as well as advocate for “strategic technology investments” in his campaign. Should he win the Republican primary for the district, he will likely face off against incumbent Democratic Rep. Mihaela Plesa, who has been serving in the Texas House since 2023. </p><p>The candidate criticized the Federal Reserve for “recklessly” attempting to launch a central bank digital currency (CBDC), a statement <a href=\"https://cointelegraph.com/news/ron-desantis-protect-bitcoin-us-presidential-bid\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ron-desantis-protect-bitcoin-us-presidential-bid/amp\">echoed by some other Republican lawmakers</a>, including Florida governor and 2024 presidential candidate Ron DeSantis. According to Kinard’s campaign website, he planned to “resist and stop any research” into CBDCs.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/texas-legislative-session-winds-down-with-crypto-bills-still-in-limbo\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/texas-legislative-session-winds-down-with-crypto-bills-still-in-limbo/amp\"><strong><em>Texas legislative session winds down with crypto bills still in limbo</em></strong></a></p><p>Texas, as well as the capital city of Austin in particular, has been a major source of cryptocurrency mining activity for the ecosystem, a situation that only improved following the exodus of many miners from China. Though a bill aimed at limiting incentives for crypto miners <a href=\"https://cointelegraph.com/news/bill-limiting-incentives-for-crypto-miners-passes-texas-senate-moves-to-house\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bill-limiting-incentives-for-crypto-miners-passes-texas-senate-moves-to-house/amp\">passed the Texas State Senate</a> in April, the government has also <a href=\"https://cointelegraph.com/news/texas-bill-of-rights-crypto-digital-currency-voting\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/texas-bill-of-rights-crypto-digital-currency-voting/amp\">voted in favor</a> of adding crypto to the state’s Bill of Rights, and Gov. Greg Abbott has referred to himself as a “crypto law proposal supporter.”</p><p>Primaries for the 2024 elections in the United States are approaching in the coming months, with crypto and blockchain a major issue for many voters. Coinbase CEO Brian Armstrong has <a href=\"https://cointelegraph.com/news/coinbase-ceo-calls-for-action-in-electing-pro-crypto-lawmakers-following-sec-wells-notice\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinbase-ceo-calls-for-action-in-electing-pro-crypto-lawmakers-following-sec-wells-notice/amp\">called on crypto users</a> to “elect pro-crypto candidates” in all 435 U.S. congressional districts as lawmakers put forward proposals on legislation to regulate digital assets.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-city-guide-to-austin/\"><strong><em>Crypto City: Guide to Austin</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-13T22:27:00.000Z",
    "title": "Shiba Inu Whale With Over 100 Trillion $SHIB Wakes Up After Months of Dormancy",
    "url": "https://www.cryptoglobe.com/latest/2023/07/shiba-inu-whale-with-over-100-trillion-shib-wakes-up-after-months-of-dormancy/",
    "description": "A massive Shiba Inu ($SHIB) whale that has seemingly been dormant for nearly half a year has recently reawakened and resumed its trading activity, moving over 4 trillion SHIB to a number of different addresses out of its over 100 trillion war chest. According to blockchain analytics platform SpotOnChain, the SHIB whale, which was identified […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-13T22:33:29.000Z",
    "title": "Coinbase, Other Crypto Exchanges Relist XRP Following Ruling in SEC v Ripple Case",
    "url": "https://news.bitcoin.com/coinbase-other-crypto-exchanges-relist-xrp-following-ruling-in-sec-v-ripple-case/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/coinbase-and-other-exchanges-relisting-xrp-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Coinbase, Other Crypto Exchanges Begin Relisting XRP Following Ruling in SEC v Ripple Case\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/coinbase-and-other-exchanges-relisting-xrp-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/coinbase-and-other-exchanges-relisting-xrp-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/coinbase-and-other-exchanges-relisting-xrp-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/coinbase-and-other-exchanges-relisting-xrp-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/coinbase-and-other-exchanges-relisting-xrp-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/coinbase-and-other-exchanges-relisting-xrp-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/coinbase-and-other-exchanges-relisting-xrp.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Nasdaq-listed cryptocurrency exchange Coinbase has relisted XRP following a landmark ruling in the U.S. Securities and Exchange Commission (SEC) v. Ripple Labs case. Several other crypto exchanges have also resumed trading of XRP. Crypto Exchanges Bring Back XRP Trading Following the landmark ruling in the U.S. Securities and Exchange Commission (SEC) v. Ripple Labs [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-13T22:07:00.000Z",
    "title": "KuCoin thrives amidst volatile crypto market, surpassing 29 million users",
    "url": "https://www.cryptopolitan.com/kucoin-thrives-amidst-volatile-crypto-market-surpassing-29-million-users/",
    "description": "KuCoin, a prominent cryptocurrency exchange, continues to thrive despite challenging market conditions, demonstrating an exceptional first-half performance in 2023. Despite the cryptocurrency market&#8217;s volatility, KuCoin has achieved significant growth, boasting a 26% year-over-year increase in its user base. The exchange now proudly serves over 29 million registered users, with the Latin American (LATAM) region driving ... <a title=\"KuCoin thrives amidst volatile crypto market, surpassing 29 million users\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kucoin-thrives-amidst-volatile-crypto-market-surpassing-29-million-users/\" aria-label=\"More on KuCoin thrives amidst volatile crypto market, surpassing 29 million users\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-13T22:59:27.000Z",
    "title": "Avorak AI’s “AVA” Begins Deep Learn Analysis of Digitoads Upcoming P2E Game",
    "url": "https://nulltx.com/avorak-ais-ava-begins-deep-learn-analysis-of-digitoads-upcoming-p2e-game/",
    "description": "The technological realm is covered with a wide space of innovations from blockchain towards artificial intelligence (current trend). Satoshi Nakamoto innovated blockchain technology to bring about decentralization in financial technology. As a result, several meme coins, such as Digitoads, where users get to partake in play-to-earn games or stake-to-earn have risen. Gamers have already flocked [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-13T22:56:45.000Z",
    "title": "Cardano’s SNEK vs. Ethereum’s DigiToads: Who is the NFT King?",
    "url": "https://nulltx.com/cardanos-snek-vs-ethereums-digitoads-who-is-the-nft-king/",
    "description": "In a fierce battle for NFT supremacy, Cardano&#8217;s Snek (SNEK) confronts Ethereum&#8217;s DigiToads (TOADS). These two blockchain titans have emerged as formidable contenders, each vying for the coveted title of the NFT King. With their distinct features, innovative capabilities, and passionate communities, SNEK and DigiToads have captivated attention in the crypto market. SNEK is a [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-13T22:53:47.000Z",
    "title": "Golteum Set For Long-Term Success After Fireblocks Integration",
    "url": "https://nulltx.com/golteum-set-for-long-term-success-after-fireblocks-integration/",
    "description": "A new project is changing the face of the crypto market. Armed with a riveting presale success, this new token, Golteum (GLTM), is giving the big fries a run for their money.  The Golteum (GLTM) multi-asset project offers users a transparent and accessible platform for trading and ownership of precious metals and cryptocurrencies. With a [&#8230;]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-13T22:01:06.000Z",
    "title": "Founder of Bankrupt Crypto Lender Celsius Network Alex Mashinsky Arrested and Charged With Fraud",
    "url": "https://dailyhodl.com/2023/07/13/founder-of-bankrupt-crypto-lender-celsius-network-alex-mashinsky-arrested-and-charged-with-fraud/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/torubled-celcius-undergoing.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/torubled-celcius-undergoing.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/torubled-celcius-undergoing.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/torubled-celcius-undergoing.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/torubled-celcius-undergoing.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/torubled-celcius-undergoing.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/torubled-celcius-undergoing.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Alex Machinsky, the founder of bankrupt crypto lender Celsius, has been arrested and charged with multiple counts of fraud. In a new court document filed on July 11, Mashinksy, alongside Celsius’s chief revenue officer Roni Cohen-Pavon and other employees of the firm, are accused of perpetrating two schemes involving CEL, the native asset of the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/13/founder-of-bankrupt-crypto-lender-celsius-network-alex-mashinsky-arrested-and-charged-with-fraud/\">Founder of Bankrupt Crypto Lender Celsius Network Alex Mashinsky Arrested and Charged With Fraud</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]