[
  {
    "source": "Decrypt",
    "date": "2023-07-18T10:41:04.000Z",
    "title": "Coinbase CEO to Meet House Democrats, Discuss Crypto: Report",
    "url": "https://decrypt.co/148971/coinbase-ceo-to-meet-house-democrats-discuss-crypto-report",
    "description": "As part of the exchange’s bid for regulatory clarity, Brian Armstrong reportedly plans to meet the New Democrat Coalition."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-18T10:58:20.000Z",
    "title": "Internet Computer will be a key alternative to AWS-like services - Dfinity exec ",
    "url": "https://cointelegraph.com/news/internet-computer-as-key-alternative-to-aws-services",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/42302558-072f-4cab-a5c7-b033f62e1754.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Dfintiy chief said that Internet Computer would prove to be a boon for the blockchain industry which is currently dependent on centralized ecosystems like AWS. </p>\n                    <p><p>The Web 3.0 ecosystem is built on the principles of decentralization, however, most of the aspects of the ecosystems are quite centralized. Be it <a href=\"https://cointelegraph.com/learn/what-is-metaverse-in-blockchain\">metaverse </a>servers, or <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a>, even several blockchain ecosystems are entirely based on centralized servers like Amazon. </p><p>Thus, these ecosystems face several vulnerabilities that come along with the centralization. However, Dominic Williams, founder of Dfinity, believes Internet Computer can change that for good. </p><p>In a conversation with Cointelegraph journalist Zhiyuan Sun during the Ethereum Community Conference (EthCC), Williams explained that with the use of smart contracts, Internet computers will remove any human backdoors making the next generation of Internet Computer (ICP) truly autonomous and decentralized.</p><p>ICP is a set of protocols that allow independent data centers around the world to band together and offer a decentralized alternative to the current centralized internet cloud providers. </p><p>Williams noted that Internet computers will be key to replacing centralized servers such Amazon Web Services (AWS) and said,</p><blockquote>“We want people to replace that centralized systems with canister smart contracts on the internet computer. It's like an evolution of Dao technology, so the whole thing is secured, secure, decentralised and autonomous. We want to see this centralised stuff Amazon Web Services replaced by the internet computer.”</blockquote><p>Williams went onto discuss the possibilities that ICP can open for the blockchain world. He noted that small countries and projects won’t have to build wallets and simply can integrated internet computer with bitcoin network to start transactions. He explained that internet “computer smart contracts can create Bitcoin addresses, receive and send Bitcoin while complexities of UTX owes is hidden”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/web3-usernames-may-see-greater-adoption-due-to-recent-advancements\"><strong><em>Web3 usernames may see greater adoption due to recent advancements</em></strong></a></p><p>While discussing the aspects of internet computers and how it would differ from the traditional architecture, William noted that smart contracts have the potential to “eat software,” suggesting that the computer smart contracts have the potential to replace things like web servers, Kubernetes, databases, and many other traditional IT stack today. </p><p>DFINITY Foundation is a not-for-profit science and technology organization and a major contributor to the Internet Computer blockchain. The foundation recently <a href=\"https://www.prnewswire.com/news-releases/dfinity-foundation-launches-5-million-grant-to-support-decentralized-ai-on-the-internet-computer-blockchain-301877065.html#:~:text=The%20%245%20million%20DeAI%20grant,benefit%20from%20the%20DeAI%20funds\" target=\"_blank\" rel=\"noopener nofollow\">announced </a>the $5 million decentralized artificial intelligence (DeAI) grant to support projects leveraging AI on ICP.</p><p><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/web3-gamer-apple-gaming-sec-hates-metaverse-tokens-logan-paul-trolled-on-steam/\"><strong>Web3 Gamer: Apple to fix gaming? SEC hates metaverse, Logan Paul trolled on Steam</strong></a>.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-18T10:42:39.000Z",
    "title": "Bitcoin realized prices by cohort indicate DCA strategies in progress",
    "url": "https://cryptoslate.com/insights/bitcoin-realized-prices-by-cohort-indicate-dca-strategies-in-progress/",
    "description": "<p>Quick Take Bitcoin&#8217;s consolidation at the $30,000 mark does not put many investor cohorts in a loss situation, as the dollar-cost averaging (DCA) strategy continues to be implemented. Dollar-cost averaging is the concept of purchasing an asset on a regular basis without prejudice to the market value at the time of the trade. Dollar-cost average [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-realized-prices-by-cohort-indicate-dca-strategies-in-progress/\">Bitcoin realized prices by cohort indicate DCA strategies in progress</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-18T10:41:37.000Z",
    "title": "ATPBot Launches the Easiest Automated Crypto Trading Bot for Investors",
    "url": "https://www.cryptoglobe.com/latest/2023/07/atpbot-launches-the-easiest-automated-crypto-trading-bot-for-investors/",
    "description": "Disclaimer: This article is sponsored content and should not be considered as financial or investment advice. Always do your own research before making any financial decisions. The opinions expressed in this article are those of the author and do not necessarily reflect the views of CryptoGlobe. ATPBot has launched an easy-to-use auto trading bot. With […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T11:04:37.000Z",
    "title": "Tech stock frenzy forces US funds to hit limits",
    "url": "https://www.cryptopolitan.com/tech-stock-frenzy-forces-us-funds-hit-limits/",
    "description": "An unexpected surge in tech stocks is causing prominent US investment funds to collide with regulations that ensure asset diversification. Tech stock domination in prominent indices has taken these funds to their regulatory maximums, indicating that the ongoing tech rally is not without its hurdles for investors and index providers. A lofty rally with complications ... <a title=\"Tech stock frenzy forces US funds to hit limits\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tech-stock-frenzy-forces-us-funds-hit-limits/\" aria-label=\"More on Tech stock frenzy forces US funds to hit limits\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T11:04:35.000Z",
    "title": "Celsius network files petition for relief in GK8 proceeds distribution amidst legal turmoil",
    "url": "https://www.cryptopolitan.com/celsius-network-files-petition-for-relief-in-gk8-proceeds-distribution-amidst-legal-turmoil/",
    "description": "Celsius Network, a bankrupt cryptocurrency lending company, has approached the court for relief concerning the distribution of proceeds from the sale of the self-custody platform GK8. Significantly, on July 17th, the company&#8217;s unsecured creditors filed a document. It announced that the Series B investors of the company had agreed to a settlement. This agreement would ... <a title=\"Celsius network files petition for relief in GK8 proceeds distribution amidst legal turmoil\" class=\"read-more\" href=\"https://www.cryptopolitan.com/celsius-network-files-petition-for-relief-in-gk8-proceeds-distribution-amidst-legal-turmoil/\" aria-label=\"More on Celsius network files petition for relief in GK8 proceeds distribution amidst legal turmoil\">Read more</a>"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-18T10:48:37.000Z",
    "title": "What is the Future of XRP After SEC Win?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/what-is-the-future-of-xrp-after-sec-win/",
    "description": "<p>Ripple’s partial victory over the US Securities and Exchange Commission has created a new buzz around the XRP token. Several exchanges have relisted the token.  As a result, the injective community recently voted to pass a proposal to include an XRP/USDT perpetual pair. Let&#8217;s discover more about this important partnership. XRP on Injective? The move [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/what-is-the-future-of-xrp-after-sec-win/\">What is the Future of XRP After SEC Win?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]