[
  {
    "source": "Decrypt",
    "date": "2023-12-02T15:01:02.000Z",
    "title": "'Data Painter' Refik Anadol Reflects on Historic MoMA AI Art Acquisition",
    "url": "https://decrypt.co/208340/data-painter-refik-anadol-reflects-historic-moma-ai-art-acquisition",
    "description": "Leading AI artist Refik Anadol speaks with SCENE about MoMA's acquisition of his towering work—and what it means for the art world."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-02T15:00:53.000Z",
    "title": "Bitcoin mining: A catalyst for energy sustainability",
    "url": "https://cryptoslate.com/market-reports/bitcoin-mining-a-catalyst-for-energy-sustainability/",
    "description": "<p>The post <a href=\"https://cryptoslate.com/market-reports/bitcoin-mining-a-catalyst-for-energy-sustainability/\">Bitcoin mining: A catalyst for energy sustainability</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-02T15:00:43.000Z",
    "title": "NFT Sales Boom in November — Bitcoin Dethrones Ethereum in Market Surge",
    "url": "https://news.bitcoin.com/nft-sales-boom-in-november-bitcoin-dethrones-ethereum-in-market-surge/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftssssss-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftssssss-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftssssss-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftssssss-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftssssss-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftssssss-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftssssss-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftssssss.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Sales of non-fungible tokens (NFTs) experienced a notable surge in November, with a 129.01% increase in sales volume compared to October. Additionally, NFTs created on the Bitcoin blockchain surpassed those on Ethereum in terms of sales this past month. This shift can be attributed to a marked rise in Ordinal inscription minting and trading activities [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-02T14:49:37.000Z",
    "title": "IBM Partners with Boehringer Ingelheim to Leverage AI in Antibody Discovery",
    "url": "https://www.cryptopolitan.com/ibm-partners-with-boehringer-ingelheim-ai/",
    "description": "IBM has recently announced a groundbreaking collaboration with the global research company Boehringer Ingelheim to harness the power of artificial intelligence (AI) foundation models in the quest for new antibody treatments. Antibody treatments are a potent weapon against many serious diseases, offering fewer side effects than traditional treatments. The partnership aims to develop a foundational ... <a title=\"IBM Partners with Boehringer Ingelheim to Leverage AI in Antibody Discovery\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ibm-partners-with-boehringer-ingelheim-ai/\" aria-label=\"More on IBM Partners with Boehringer Ingelheim to Leverage AI in Antibody Discovery\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-02T14:47:08.000Z",
    "title": "CD Projekt Red Announces Major Changes in Cyberpunk 2077 2.1 Patch",
    "url": "https://www.cryptopolitan.com/changes-in-cyberpunk-2077-2-1-patch/",
    "description": "CD Projekt Red, the developer behind the highly-anticipated but initially troubled game, Cyberpunk 2077, has unveiled a significant update, known as the 2.1 patch, during their recent livestream on December 1st. Scheduled for release on December 5th, this patch promises to bring substantial improvements and new features to the game, further enhancing the player experience. ... <a title=\"CD Projekt Red Announces Major Changes in Cyberpunk 2077 2.1 Patch\" class=\"read-more\" href=\"https://www.cryptopolitan.com/changes-in-cyberpunk-2077-2-1-patch/\" aria-label=\"More on CD Projekt Red Announces Major Changes in Cyberpunk 2077 2.1 Patch\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-02T14:40:07.000Z",
    "title": "What Are Altcoins? Guide: How To Spot Altcoin Season And How To Buy",
    "url": "https://www.newsbtc.com/crypto/what-are-altcoins-season-how-to-buy/",
    "description": "Altcoins, or alternative cryptocurrencies, have become a buzzword in the digital currency landscape, offering a world beyond Bitcoin (BTC). This guide explores the essence of altcoins, answering the pivotal question: What are altcoins? From the historical rise of altcoins to the exciting phenomenon of altcoin season, we delve into the intricacies that define this dynamic market. What Are Altcoins? Understanding The Basics Altcoins, short for &#8220;alternative coins,&#8221; encompass a diverse range of cryptocurrencies that have emerged following the success of Bitcoin. They are not simply imitations of Bitcoin but represent a broad spectrum of digital currencies with unique attributes, purposes, and technological innovations. Characteristics Of Altcoins Each altcoin is distinguished by its unique blockchain technology and consensus mechanism. For instance, Ethereum, one of the most prominent altcoins, utilizes a Proof-of-Stake (PoS) consensus mechanism, which is less energy-intensive compared to Bitcoin&#8217;s Proof-of-Work (PoW) system. XRP operates on a consensus protocol known as the Ripple Protocol Consensus Algorithm, designed for high-speed and energy-efficient transactions. Cardano employs the Ouroboros PoS algorithm, acclaimed for its security and scalability. These varying consensus mechanisms reflect the diverse goals and technological advancements of altcoins, ranging from enhancing transaction efficiency to ensuring greater security and sustainability. Altcoins also vary significantly in their market capitalization, liquidity, community support, and real-world applications. For example, Litecoin, often referred to as the silver to Bitcoin&#8217;s gold, offers faster transaction confirmation times, making it suitable for smaller, everyday transactions. Meanwhile, Binance Coin (BNB) is intricately linked to the Binance exchange ecosystem, providing utility within that specific platform. Differences Between Altcoins And Bitcoin One of the stark contrasts between Bitcoin and many altcoins is their development and governance structure. Bitcoin, created by the pseudonymous Satoshi Nakamoto, who has since left the project in December 2010, operates in a decentralized and open-source manner without a central authority. In contrast, many altcoins have identifiable founding teams or organizations overseeing their development. For example, Ethereum is backed by the Ethereum Foundation, Solana is developed by Solana Labs, and Cardano is spearheaded by IOG (Input Output Global). Another key difference lies in their transaction speeds and capabilities. Bitcoin, primarily designed as a digital store of value and medium of exchange, processes transactions approximately every 10 minutes. In contrast, altcoins like Ripple&#8217;s XRP have a much-shorter block time and can process transactions in seconds, making it a preferred choice for cross-border money transfers. Ethereum, with its smart contract functionality, enables a wide range of decentralized applications (dapps) beyond simple monetary transactions. Furthermore, while Bitcoin&#8217;s maximum supply is capped at 21 million coins, altcoins have varied approaches to supply. For example, Ethereum initially had no cap. With the introduction of EIP-1559, Ethereum developers have introduced a mechanism that burns a portion of the supply with each transaction, potentially making its supply deflationary over time. XRP &#8211; like many other altcoins &#8211; was premined and has a capped total supply of 100 billion XRP. The Rise Of Altcoins: A History The history of altcoins is a captivating narrative of innovation, market dynamics, and the continuous pursuit of refining digital currency technology. Since the inception of Bitcoin, the first decentralized cryptocurrency, there has been a surge in the creation of alternative cryptocurrencies, each seeking to address perceived limitations of Bitcoin or to introduce new features and use cases. The First Altcoins Gaining Traction The journey of altcoins began soon after the establishment of Bitcoin, with the creation of Namecoin in April 2011. Namecoin aimed to decentralize domain-name registration, making internet censorship more difficult. Following Namecoin, Litecoin was launched in October 2011, envisioned as the &#8220;silver&#8221; to Bitcoin&#8217;s &#8220;gold.&#8221; Litecoin offered faster transaction confirmation times and a different hashing algorithm (Scrypt). Following these, another notable early altcoin included Peercoin, introduced in 2012, which was the first to implement a Proof-of-Stake/Proof-of-Work hybrid system. Another significant early player was XRP which was created in 2012. The XRP Ledger was launched in June 2012 by the founders of Ripple Labs, including Chris Larsen and Jed McCaleb. Shortly after that, Dogecoin was launched in December 2013, initially created as a light-hearted take on cryptocurrency. Remarkably, not all early altcoins sustained their momentum. Many, like Feathercoin and Terracoin, which gained attention initially, saw their influence wane over the years. These coins, while innovative in their time, couldn&#8217;t keep up with the rapidly evolving cryptocurrency market or build a lasting community and development ecosystem. Evolution Of The Altcoin Market The altcoin market has evolved significantly over the years, expanding beyond simple variations of Bitcoin&#8217;s technology. The introduction of Ethereum in 2015 was a watershed moment. Ethereum&#8217;s innovation was not just in creating a new cryptocurrency but in introducing a platform for decentralized applications (dApps) through smart contracts. This breakthrough opened the doors for a new era of blockchain technology, where altcoins could serve various purposes beyond mere currency, from powering decentralized finance (DeFi) to non-fungible tokens (NFTs). The market saw an influx of diverse altcoins based on Ethereum, each catering to specific niches and use cases. Key Milestones In Altcoin History Several key milestones mark the history of altcoins. The Initial Coin Offering (ICO) boom in 2017 was one such significant event. ICOs became a popular method for new cryptocurrency projects to raise funds, leading to the launch of thousands of new altcoins. However, this period also saw increased regulatory scrutiny and instances of fraud, leading to a more cautious market approach. Another major development was the rise of DeFi in 2020, where altcoins played a central role in enabling decentralized lending, borrowing, and trading, independent of traditional financial institutions. This era also witnessed the surge in popularity of NFTs, with altcoins like Ethereum being at the forefront of this new digital asset class. These milestones highlight the dynamic nature of the altcoin market, continuously shaped by technological advancements and shifting market sentiments. Top Altcoins To Watch As the crypto market continues to evolve, a number of altcoins have risen to prominence, each offering unique advantages and innovations. This section highlights some of the top altcoins that have captured the market&#8217;s attention due to their technological advancements, community support, and potential for future growth. Overview of Top Altcoins Ethereum (ETH): Often regarded as the leading altcoin, Ethereum is renowned for its smart contract functionality, which has paved the way for decentralized applications (dApps) and decentralized finance (DeFi) ecosystems. Solana (SOL): Solana has gained popularity for its incredibly fast and low-cost transactions, leveraging a unique combination of proof-of-history (PoH) and proof-of-stake (PoS) consensus mechanisms. XRP: Despite legal challenges in the United States, Ripple has established itself and the XRP token as a significant player, primarily for its use in fast and efficient cross-border money transfers. Binance Coin (BNB): Originally created as a utility token for the Binance cryptocurrency exchange, BNB has expanded its use cases to include transaction fee discounts, token sales, and more within the Binance ecosystem. Cardano (ADA): Known for its strong focus on sustainability and scientific philosophy, Cardano offers a third-generation blockchain that promises more scalability and security through its unique Ouroboros proof-of-stake algorithm. Polkadot (DOT): Polkadot stands out for its interoperability, enabling different blockchains to transfer messages and value in a trust-free fashion; it&#8217;s also scalable and customizable. These are just a few examples of the numerous altcoins in the market, each contributing to the diverse landscape of cryptocurrency in their unique ways. Features That Make Altcoins Stand Out Altcoins distinguish themselves through various features that cater to specific needs and use cases: Smart Contract Capabilities: Ethereum&#8217;s introduction of smart contracts revolutionized the blockchain space, enabling the creation of complex, programmable transactions and applications. Scalability And Speed: Altcoins like Solana and Cardano have focused on solving scalability issues, offering faster transaction speeds and lower fees compared to older blockchain networks like Bitcoin and Ethereum. Interoperability: Projects like Polkadot and Cosmos address the issue of blockchain interoperability, allowing different networks to communicate and exchange information seamlessly. Niche Applications: Some altcoins target specific sectors or use cases, such as Chainlink’s focus on providing real-world data to blockchain networks through oracles, or Monero’s emphasis on privacy and anonymity. What Is Altcoin Season? Altcoin season or “altseason” is a term that describes a period in the crypto market when altcoins significantly outperform Bitcoin. It&#8217;s a phase where investors&#8217; appetite for riskier assets grows, and capital flows from Bitcoin into altcoins, often resulting in substantial price surges for these alternative coins. Understanding when an altcoin season is on the horizon can be crucial for cryptocurrency traders and investors looking to capitalize on market trends. Indicators Of An Upcoming Altcoin Season A key indicator of an impending altcoin season can be the Bitcoin Dominance (BTC.D) chart, which tracks the percentage of the total cryptocurrency market capitalization contributed by Bitcoin. Technical analysts scrutinize this chart for signs of decreasing dominance, which may suggest that altcoins are starting to take up a larger share of the market. Support and resistance levels on this chart can indicate potential shifts in market dynamics. For instance, a sustained fall below a major support level could signal the beginning of altcoin season. Remarkably, the market often moves in cycles which can be broken down into four distinct phases, as illustrated in the image provided by crypto analyst Ted (@tedtalksmacro): Phase 1: Bitcoin &#8211; The cycle often starts with Bitcoin&#8217;s price surging as money flows into Bitcoin, causing significant price increases. Phase 2: Ethereum &#8211; Money begins to flow into Ethereum, which might struggle to keep up initially but then starts to outperform Bitcoin, leading to discussions about &#8216;the flippening&#8217; (where Ethereum&#8217;s market cap could surpass Bitcoin&#8217;s). Phase 3: Large Caps &#8211; As Ethereum starts outperforming Bitcoin, investors begin to venture into large-cap altcoins, which then start to see large buy-ups and price increases. Phase 4: &#8220;Altseason&#8221; &#8211; In this final phase, enthusiasm spreads across the market; large caps have gone full vertical, and attention turns to mid and small-cap altcoins. All categories, regardless of fundamentals, tend to pump around the same time, leading to a parabolic increase in altcoin prices. This phase is marked by high levels of excitement and media attention. How to Buy Altcoins: A Step-by-Step Guide Purchasing altcoins can seem daunting for newcomers to the cryptocurrency space, but by following a clear step-by-step process, it can be straightforward and secure. Here&#8217;s a simplified guide to help you through the process: Research: Before anything else, conduct thorough research to determine which altcoins align with your investment goals and risk tolerance. Choose A Wallet: Select a digital wallet that supports the altcoin you wish to purchase. Wallets can be software-based (like mobile or desktop applications) or hardware-based for added security. Select A Cryptocurrency Exchange: Choose an altcoin exchange that lists the altcoin you&#8217;re interested in and is known for its reliability, security, and ease of use. Register And Secure Your Account: Create an account on the chosen exchange and set up strong authentication measures, including two-factor authentication (2FA). Fund Your Account: Deposit funds into your exchange account. This can often be done via bank transfer, credit card, or by depositing other cryptocurrencies. Place An Order: Navigate to the market or trading pair for your chosen altcoin and place a buy order. You can opt for a market order for an immediate purchase at current prices or a limit order to specify a price at which you&#8217;re willing to buy. Store Your Altcoins Securely: After the purchase, transfer your altcoins to your personal wallet for safekeeping, especially if you&#8217;re planning on holding them for the long term. Where to Buy Altcoins You can purchase altcoins on a variety of platforms, each offering its own set of features, fees, and security measures. Here are some of the most common places where you can buy altcoins: Centralized Exchanges: These are the most common platforms for buying altcoins and include well-known exchanges like Binance, Coinbase, and Kraken. They offer a wide range of altcoins and are typically user-friendly. Decentralized Exchanges (DEXs): DEXs like Uniswap and SushiSwap allow for peer-to-peer transactions without the need for an intermediary. They offer a higher degree of privacy and direct wallet-to-wallet trades. Cryptocurrency Brokers: Platforms like eToro and Robinhood act as brokers, offering an easy entry point for buying cryptocurrencies. However, they may have a more limited selection of altcoins compared to dedicated exchanges. Peer-to-Peer (P2P) Platforms: Websites like OKX P2P or Remitano connect buyers and sellers directly. While they offer flexibility in payment methods, they require a higher degree of trust between parties. When choosing where to buy altcoins, consider factors such as security, fees, the variety of available altcoins, and the user experience of the platform. Always ensure that the platform you choose complies with the regulatory standards in your jurisdiction. Are Altcoins A Good Investment? The question of whether altcoins are a good investment depends on various factors, including market conditions, the specific altcoin&#8217;s potential for growth, and the investor&#8217;s risk tolerance and investment strategy. Pros Of Investing In Altcoins: High Growth Potential: Some altcoins have shown the capacity for high returns on investment, outperforming traditional assets in their best periods. Diversification: Altcoins can diversify an investment portfolio, potentially reducing risk by spreading exposure across different asset classes. Innovation: Investing in altcoins can be a way to support and be part of innovative blockchain projects that may transform various industries. Cons Of Investing In Altcoins: Volatility: Altcoins can be highly volatile, with the potential for significant price swings that can lead to substantial gains or losses. Market Maturity: Compared to more established markets, the cryptocurrency market is relatively young and can be unpredictable. Regulatory Uncertainty: Altcoins face regulatory challenges that can impact their value and legality. Investors considering altcoins should conduct thorough research, understand the risks involved, and consider speaking with a financial advisor. Investment decisions should be based on an individual’s financial situation, investment objectives, and risk tolerance. Are Altcoins Dead Or Thriving? The altcoin market is a diverse ecosystem with a wide range of projects boasting various levels of innovation, utility, and community support. Similar to the early days of the internet which led to the Dot-Com bubble, the cryptocurrency space is experiencing its own form of natural selection where not all projects will survive in the long term. The Reality Of Altcoin Longevity: Oversaturation: The market has seen an explosion of altcoins, with thousands currently in existence. Many of these coins serve similar functions or aim to solve the same problems, leading to an oversaturated market where only the strongest or most unique can survive. User And Company Adoption: For an altcoin to thrive, it must gain widespread adoption among users and businesses. However, with so many options available, not every altcoin will achieve the necessary adoption rate to sustain its network. Innovation And Continuous Development: The technology underlying altcoins is rapidly evolving. Projects that fail to innovate or adapt to new advancements are likely to fall behind and eventually become obsolete. Survival Of The Fittest: The &#8216;Amazon&#8217; Of Altcoins: There will be altcoins that manage to carve out a niche for themselves and become integral to the crypto economy, much like Amazon did for e-commerce. These projects typically have strong fundamentals, clear use cases, active development teams, and robust community support. The &#8216;Pets.com&#8217; Of Altcoins: Conversely, some altcoins will fade into obscurity, similar to the fate of Pets.com and other failed Dot-Com ventures. Reasons for this include poor management, lack of clear use cases, failure to deliver on promises, or simply the inability to compete with more successful projects. Market Dynamics And Speculation: Speculative Bubbles: The altcoin market is not immune to hype and speculation, which can lead to bubbles. Projects that rise rapidly on speculation rather than solid fundamentals are at risk of crashing just as quickly. Regulatory Challenges: Authorities are still defining the regulatory landscape for cryptocurrencies. Altcoins that fall foul of future regulations or fail to navigate the complex legal environment may face challenges that could impede their growth or lead to their demise. In conclusion, while the altcoin market as a whole shows signs of thriving, with continuous innovation and increasing integration into the broader financial system, it&#8217;s clear that not every altcoin will survive the test of time. Investors should be discerning, focusing on projects with solid fundamentals, active development, and real-world utility to identify those with the potential to succeed in the long term. FAQ What Are Altcoins? Altcoins, short for &#8220;alternative coins,&#8221; are cryptocurrencies other than Bitcoin. Who Is Altcoin Daily? Twin brothers Aaron and Austin Arnold founded Altcoin Daily, a prominent cryptocurrency YouTube channel. With over 1.34 million followers, it covers daily updates on Bitcoin, altcoins, NFTs, and more. What Is Altcoin Alert? Altcoin Alert refers to a software and service that tracks and analyzes sentiment on a large scale in the cryptocurrency market. It predicts coin prices based on extensive data. How Many Altcoins Are There? The number of altcoins constantly changes with the creation of new ones and the obsolescence of others. As of the last known count, there are ten thousands of altcoins, each with its own value proposition and community, but also a lot of scam projects. Are Altcoins Worth Investing In? Altcoins can be worth investing in, but they carry their own sets of risks and potential rewards. Their worth as an investment will depend on individual risk tolerance, market research, and investment goals. Can You Short Altcoins? Yes, it is possible to short altcoins on many cryptocurrency exchanges. In short selling, an investor borrows a cryptocurrency and sells it on the market, anticipating a decrease in its price. How Do Altcoins Work? Altcoins work using blockchain technology, which is a decentralized ledger that records all transactions across a network of computers. Many alternative cryptocurrencies have different features and operate on various consensus mechanisms, such as Proof of Work, Proof of Stake, or others. How Are Altcoins Created? Creating altcoins often involves forking from an existing blockchain or developing a new blockchain and its underlying technology from scratch. The process includes designing the coin&#8217;s protocol, creating its blockchain, and launching it for public use. What Is An Altcoin? An altcoin is any cryptocurrency other than Bitcoin. The term &#8220;altcoin&#8221; encompasses a broad range of cryptocurrencies with various functions and underlying technologies. Featured image from Shutterstock"
  }
]