[
  {
    "source": "Crypto Daily",
    "date": "2023-06-02T03:56:07.000Z",
    "title": "XRP: Public Awaits The Release Of The Hinman Documents",
    "url": "https://cryptodaily.co.uk/2023/06/xrp-public-awaits-the-release-of-the-hinman-documents",
    "description": "<p>Ripple executives and the broader crypto industry eagerly await the Hinman documents&rsquo; public release. </p>\nHinman Documents Expected to Be Unsealed by June 13\n<p>The highly anticipated public release of the Hinman speech documents and emails is reportedly set for June 13, 2023. Before these documents can be unsealed, one of Ripple&rsquo;s most notable executives, Susan Friedman, Ripple&rsquo;s head of policy, is focusing on a crucial hearing linked to the crypto industry ahead of the public release of the Hinman documents.</p>\n\n<p dir=\"ltr\" lang=\"en\">While the upcoming June 13 HFSC hearing is an important one for crypto, the one being held next week by @HouseAgGOP is equally so. @CongressmanGT has been a steadfast supporter of the call for clarity in this space. https://t.co/DLLUjDzhQr</p>\n&mdash; Susan Friedman (@ss_friedman) June 1, 2023\n<p>\n\n</p>\n<p>The crypto industry and Ripple executives such as Susan Friedman eagerly await June 6 hearing that the House Committee on Agriculture is organizing. The hearing entitled &ldquo;The Future of Digital Assets: Providing Clarity for Digital Asset Spot Markets&rdquo; will delve into the nuances of crypto markets and provide some much-needed clarity for the crypto spot market.</p>\nJune 6 Hearing is Crucial Before The Hinman Documents Can Be Unsealed\n<p>Key to note here is that the Commodity Futures Trading Commission (CFTC) falls under the jurisdiction of the House Agriculture Committee. The CFTC and the SEC have been the two leading agencies actively cracking down on the crypto industry and pushing regulatory charges around digital assets-linked firms.</p>\n<p>The SEC, in particular, have been accused of not providing clear rules for the market. It was recently sued by crypto exchange Coinbase for allegedly ignoring its petition for clear crypto guidance.</p>\n<p>The June 6 hearing by the House Committee on Agriculture comes as a crucial time, just a month before the highly anticipated release of the Hinman speech and emails.</p>\n<p>The Hinman documents also include unredacted versions of cross-motions for summary judgement and accompanying exhibits in the XRP lawsuit, Coingape reports.</p>\nThe Hinman Documents &ndash; What do they entail?\n<p>Ripple gained a small victory in October in its ongoing case with the SEC, when the latter was forced to give up the Hinman documents, which could help Ripple prove in its case that XRP is, in fact, not a security.</p>\n<p>The documents include discovery material proving that the former Director of Corporation Finance, Willian Hinman, delivered a speech in which he clearly stated that neither Bitcoin (BTC) nor Ether (ETH) is securities.</p>\n<p>Video evidence of Hinman claiming that neither tokens are a security emerged. In the recording, Hinman states:</p>\n\n<p>Based on my understanding of the present state of Ether, the Ethereum network and its decentralized structure, current offers and sales of Ether are not securities transactions.</p>\n\nRipple CEO, Brad Garlinghouse, Remains Confident - Market Reacted Well\n<p>Ripple&rsquo;s chief executive Brad Garlinghouse told Forbes he predicts the case, dragging on since 2020, will conclude in &ldquo;weeks, not months.&rdquo;</p>\n<p>Garlinghouse&rsquo;s statement shot XRP&rsquo;s price up by over 10% over last week, and it currently trades at $0.51, according to data by CoinMarketCap.</p>\n<p>XRP has tested the critical resistance at $0.5, but many wonders if the rally will continue.</p>\n<p>Technical analysis from news agency CryptoPotato indicates that XRP has shown a consistent upward trend after being rejected from its 200-day moving average at around $0.4. XRP also managed to surpass its 50-day moving average of approximately $0.45 and seems to target its resistance zone at $0.6 in the short term. &nbsp;</p>\n<p>If XRP successfully breaks through the $0.6 level, it would likely spur a bullish phase, with prices potentially reaching highs of $0.9 mid-term.</p>\n<p>Investors should, however, be cautious as the Relative Strength Index (RSI) indicates we are in an overbought market, suggesting a pullback or a period of consolidation may be seen in the next few days.</p>\n<p>Garlinghouse further told Tai Panich, the chief executive of SCB 10x, in a YouTube interview:</p>\n\n<p>I feel very confident that we&rsquo;ll see a decision from the courts this year.</p>\n\n<p>Adding:</p>\n\n<p>In fact, I think I would guess that it will be in weeks, not months.</p>\n\n<p>The Ripple CEO also commented on the decision for the Hinman documents to be made public.&nbsp;</p>\n\n<p dir=\"ltr\" lang=\"en\">Another win for transparency! Unredacted Hinman emails to be publicly available soon - stay tuned as the lawyers work through the mechanics to make that happen. https://t.co/o6puPypRHd https://t.co/qmaLVeQaP8</p>\n&mdash; Brad Garlinghouse (@bgarlinghouse) May 16, 2023\n<p>\n\n</p>\n<p>He told Forbes:</p>\n\n<p>The court just ruled last week that the notes in the emails associated with that are going to be made public, and should be public around June 13. So I think that&rsquo;s a huge win for transparency. But what it really calls out is, there really hasn&rsquo;t been clarity, despite calls and demands from leaders across the crypto industry.</p>\n\n<p>Forbes further reports that while crypto exchange Kraken and crypto lenders such as BlockFi chose to settle with the SEC, Ripple decided to fight it and go to court.</p>\n<p>Garlinghouse said:</p>\n\n<p>Ripple decided to lean in and fight this fight, both for Ripple and the whole industry. We&rsquo;ve spent a lot of money defending it. And I think what we&rsquo;ve called out is the government in the United States, and the SEC particularly, is putting politics ahead of smart policy.</p>\n\nThings Are Looking Up for Ripple\n<p>A recent Messari report revealed that XRP surged by over 55% in Q1 2023, outperforming the overall crypto market. The report further shows that XRP&rsquo;s market cap increased from $17.4 billion on January 1 to an impressive $27.4 billion on March 31, representing a Q1 surge of 59.9%.</p>\n<p>Ripple further announced it made a&nbsp;$250 million acquisition of Metaco&nbsp;&ndash; a well-known crypto custodian. Seen as a positive sign for the future of both Ripple and Metaco, the move sees Ripple take on sole responsibility at Metaco while still allowing current CEO Adrien Traccani to manage operations independently.</p>\n\n<p dir=\"ltr\" lang=\"en\">Today, we are proud to announce Ripple has acquired @metaco_sa, becoming the sole shareholder of the Swiss-based provider of digital asset custody and tokenization technology.Learn more: https://t.co/GrI3u13iDT</p>\n&mdash; Ripple (@Ripple) May 17, 2023\n<p>\n\n</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-02T03:48:26.000Z",
    "title": "XRP Price Prediction: Bulls Aim Big After Recent Surge Above $0.5",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-prediction-0-5-6/",
    "description": "Ripple’s token price is climbing above the $0.50 resistance against the US Dollar. XRP price is signaling more upsides toward $0.55 or $0.565. Ripple’s token price started a decent increase above the $0.500 resistance against the US dollar. The price is now trading above $0.505 and the 100 simple moving average (4 hours). There is a major bullish trend line forming with support near $0.5050 on the 4-hour chart of the XRP/USD pair (data source from Kraken). The pair might continue to rise toward the $0.545 and $0.550 resistance levels. Ripple Price Forms Bullish Trend In the past few days, Ripple’s XRP gained bullish momentum above the $0.45 resistance against the US Dollar. It outperformed Bitcoin and Ethereum to start a steady bullish trend above $0.465. There was a clear move above the $0.480 and $0.488 resistance levels. Finally, the bulls were able to push the price above $0.500. A high is formed near $0.5286 and the price recently saw a minor downside correction. There was a move below the 23.6% Fib retracement level of the upward wave from the $0.4432 swing low to the $0.5286 high. XRP price is still trading above $0.505 and the 100 simple moving average (4 hours). Besides, there is a major bullish trend line forming with support near $0.5050 on the 4-hour chart of the XRP/USD pair. Source: XRPUSD on TradingView.com Initial resistance on the upside is near the $0.5250 zone. The first major resistance is near the $0.532 level. A successful break above the $0.532 resistance level might send the price toward the $0.550 resistance. Any more gains might call for a test of the $0.565 resistance. Are Dips Supported in XRP? If ripple fails to clear the $0.525 resistance zone, it could start a downside correction. Initial support on the downside is near the $0.505 zone and the trend line. The next major support is near $0.500. If there is a downside break and a close below the $0.50 level, XRP’s price could extend losses. In the stated case, the price could test the $0.486 support zone or the 50% Fib retracement level of the upward wave from the $0.4432 swing low to the $0.5286 high. Technical Indicators 4-Hours MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for XRP/USD is now in the overbought zone. Major Support Levels – $0.505, $0.500, and $0.486. Major Resistance Levels – $0.525, $0.532, and $0.550."
  }
]