[
  {
    "source": "Cointelegraph",
    "date": "2024-03-18T16:01:38.000Z",
    "title": " Ether ETF is less likely than Bitcoin ETF was: Recharge Capital founder  ",
    "url": "https://cointelegraph.com/news/ether-etf-less-likely-bitcoin-etf-recharge-capital-founder",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZjNmOWI0ZTAtOGRkMC00M2ZhLWEyMWQtZDgxMTkzNGUyZTNkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The SEC could bring more regulatory scrutiny towards Ether ETF applications, despite the prior approval of spot Bitcoin ETFs, according to Recharge Capital’s John Lo.</p>\n                    <p><p>The approval of a spot Ether exchange-traded fund is less certain than the previous approval of the spot Bitcoin ETFs in the United States, John Lo, the founder of Recharge Capital, told Cointelegraph in an exclusive interview.</p><p>Lo expects the Securities and Exchange Commission (SEC) to put increased scrutiny on all upcoming crypto-based ETFs, especially Ether ETFs:</p><p>Companies vying for an Ether ETF include BlackRock, Grayscale, Fidelity, Invesco Galaxy, VanEck, Hashdex, and Franklin Templeton. </p><p><a href=\"https://cointelegraph.com/news/ether-etf-less-likely-bitcoin-etf-recharge-capital-founder\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-18T15:59:39.000Z",
    "title": "Why Standard Chartered reviewed its Bitcoin price forecast to $150,000",
    "url": "https://cryptoslate.com/why-standard-chartered-reviewed-its-bitcoin-price-forecast-to-150000/",
    "description": "<p>Global financial giant Standard Chartered has revised its forecast for Bitcoin&#8217;s price, now foreseeing the flagship digital asset soaring to $150,000 by year-end, citing favorable market conditions. Earlier in the year, the bank&#8217;s head of crypto research, Geoffrey Kendrick, predicted that the BTC price would climb to $100,000 by the end of the year and [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/why-standard-chartered-reviewed-its-bitcoin-price-forecast-to-150000/\">Why Standard Chartered reviewed its Bitcoin price forecast to $150,000</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-18T15:53:53.000Z",
    "title": "$ADA: EMURGO Invests in NMKR to Drive Adoption of Cardano’s Web3 Ecosystem",
    "url": "https://www.cryptoglobe.com/latest/2024/03/ada-emurgo-invests-in-nmkr-to-drive-adoption-of-cardanos-web3-ecosystem/",
    "description": "EMURGO has strategically invested in NMKR, aiming to accelerate the adoption of Cardano’s Web3 ecosystem, as announced in a recent press release. This move is anticipated to support NMKR in its endeavors to scale its business operations, including the development of a new tokenization launchpad and enhancement of its tokenization tools. EMURGO is a global […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-18T15:52:27.000Z",
    "title": "Telos Launches Tekika Airdrop Campaign Ahead of Gaming Sidechain Launch",
    "url": "https://www.cryptopolitan.com/telos-launches-tekika-airdrop-campaign-ahead-of-gaming-sidechain-launch/",
    "description": "LONDON, ENGLAND, March 18th, 2024, Chainwire Telos today announces the official launch of Tekika, a rewarding and comprehensive airdrop campaign involving more than a dozen ecosystem partners. By participating in Tekika, whitelisted users will gain access to mint a free NFT collection designed by Peruvian digital artist MUTE that is dynamic and evolves with story [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-18T15:44:31.000Z",
    "title": "Voicify Faces Lawsuit Threats for Allegedly Misusing AI to Steal Artists’ Sounds",
    "url": "https://www.cryptopolitan.com/voicify-lawsuit-threats-for-misusing-ai/",
    "description": "The British Phonographic Industry (BPI), the UK&#8217;s record industry trade group, reportedly threatens to sue Voicify, a UK-based company offering an AI-powered platform for creating vocal covers.&#160; The BPI accuses Voicify of copyright infringement, alleging that its technology infringes on the sound recording copyrights of its members. BPI Says Voicify is Misusing AI The BPI [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-18T15:59:32.000Z",
    "title": "Investor Who Made $1.2 Million in Shiba Inu Now Backs This DeFi Project As His Next Big Bet",
    "url": "https://nulltx.com/investor-who-made-1-2-million-in-shiba-inu-now-backs-this-defi-project-as-his-next-big-bet/",
    "description": "In the world of cryptocurrencies, one investor&#8217;s journey from Shiba Inu to a new DeFi project sheds light on emerging opportunities. With Shiba Inu making waves as a decentralized, community-led currency, attention now shifts to a promising DeFi venture backed by an astute investor. Let&#8217;s delve into the details. Shiba [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-18T15:50:31.000Z",
    "title": "Top 10 Crypto Presales – BlockDAG Ranks First with 10,000x Potential, Outshines Aptos and Shiba Inu Predictions",
    "url": "https://nulltx.com/top-10-crypto-presales-blockdag-ranks-first-with-10000x-potential-outshines-aptos-and-shiba-inu-predictions/",
    "description": "The cryptocurrency market has seen the rise of new trends in cryptos, with tokens like Shiba Inu (SHIB) and Aptos making headlines, and new entrants like BlockDAG (BDAG) gaining rapid momentum with its potential to yield 10,000x gains. This article delves into the recent Shiba Inu predictions, and the latest [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-18T16:10:17.000Z",
    "title": "Binance’s user asset holdings exceed $100b",
    "url": "https://crypto.news/binances-user-asset-holdings/",
    "description": "Cryptocurrency exchange Binance reported the total value of user assets crossed the $100 billion mark in the first week of March."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-18T15:55:20.000Z",
    "title": "Base’s transaction volume skyrockets after Dencun update",
    "url": "https://crypto.news/base-transaction-volume-dencun/",
    "description": "Base's daily transaction volume skyrocketed to 2 million on March 16, following the Dencun launch."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-18T15:49:45.000Z",
    "title": "Binance ordered to surrender Nigerian user data",
    "url": "https://crypto.news/binance-surrender-nigeria-data/",
    "description": "An ex-parte motion in Nigeria’s crackdown on Binance looks set to expose internal platform information to regulatory scrutiny. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-18T16:00:17.000Z",
    "title": "Shiba Inu Open Interest Suffers 40% Crash, What Does This Mean For Price?",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-open-interest-40-crash/",
    "description": "The Shiba Inu open interest has hit a snag after a particularly good run. The open interest had risen quickly alongside the price of the meme coin, which climbed close to its previous all-time high earlier in March. However, the cryptocurrency has been unable to maintain this uptrend, leading to a significant drop in the open interest. Shiba Inu Open Interest Sees Over 40% Decline According to data from Coinglass, the Shiba Inu open interest had hit a new two-year high on March 6 when its price crossed over the $0.000032 threshold. Since then, however, it has been on a decline, seeing a near-constant decline each day since. Related Reading: Bernstein Analysts Convinced Bitcoin Is Headed For $150,000, Here’s Why By Monday, March 18, the Shiba Inu open interest had dropped from its $135 million all-time high to just $80 million. This decline translates to an over 40% decrease in the space of two weeks. At the same time, the price of the meme coin has followed the same trend and has dropped from its yearly highs above $0.00004 to $0.000028 at the time of writing. Now, the open interest for any cryptocurrency is important because it serves as a measure of the total interest in that asset at any given time. It basically shows the total number of all futures and/or options contracts for a particular asset. So in this case, it shows the amount of money invested in SHIB derivative products at any time. Given this, an increase in the open interest can be bullish for a cryptocurrency such as Shiba Inu, while a decrease can be bearish. This is because, the lower the open interest, the less money is being put into that particular asset, thereby decreasing the demand. So this could negatively affect the price. Will SHIB Price Continue To Decline? As seen historically, a decline in open interest has often coincided with a decline in price. As such, the present decline being experienced by Shiba Inu could spell bad news for its price going forward. The effect is already being felt with the price of SHIB dropping significantly over the weekend, although it has started to recover as the new week opens up. Related Reading: Crypto Pundit Says God Candle Is Imminent For This Solana-Based Meme Coin To get an idea of where the price might be headed next, we can take a look at the last time that the Shiba Inu open interest was this high, back in 2021. The open interest had reached its current all-time high in October 2021, but after peaking, both the open interest and the SHIB price would suffer tremendously. Over the course of the next few months, the SHIB price would fall more than 50%, following the same trend as the open interest. If this trend were to continue this time around, then the SHIB price may be headed for a price crash. However, 2021 marked the end of the bull market, while the current bull cycle is only in the beginning stages. In this case, there is more demand, which would mean there is more of a cushion to mitigate a price crash. SHIB price drops to $0.00002783 &#124; Source: SHIBUSDT on Tradingview.com Featured image from Bitcoin News, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-18T16:00:42.000Z",
    "title": "Price Predictions For Avalanche And Toncoin: Doubters Turn Into Investors As $RBLZ Show Signs Of Massive Price Surge",
    "url": "https://www.crypto-news-flash.com/price-predictions-for-avalanche-and-toncoin-doubters-turn-into-investors-as-rblz-show-signs-of-massive-price-surge/?utm_source=rss&utm_medium=rss&utm_campaign=price-predictions-for-avalanche-and-toncoin-doubters-turn-into-investors-as-rblz-show-signs-of-massive-price-surge",
    "description": "<img width=\"1200\" height=\"752\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-18T090748.083.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-18T090748.083.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-18T090748.083-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-18T090748.083-768x481.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-18T090748.083-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-18T090748.083-450x282.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Avalanche surges 21% in a week, and experts foresee more growth. Toncoin climbs 45% in a week, and more gains are in the pipeline.  Rebel Satoshi’s $RBLZ poised to generate significant gains after Uniswap listing. Top altcoins like Avalanche (AVAX) and Toncoin (TON) have continued pumping as the broader crypto market consolidates. Naturally, these gains [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-18T15:53:52.000Z",
    "title": "XRP Trading Launches on Exchange Registered with U.S. Treasury Department Ahead of Key Deadline This Week: XRP ETF on The Horizon",
    "url": "https://www.crypto-news-flash.com/xrp-trading-launches-on-exchange-registered-with-u-s-treasury-department-ahead-of-key-deadline-this-week-xrp-etf-on-the-horizon/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-trading-launches-on-exchange-registered-with-u-s-treasury-department-ahead-of-key-deadline-this-week-xrp-etf-on-the-horizon",
    "description": "<img width=\"1876\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-on-mobile.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRPL\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-on-mobile.jpg 1876w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-on-mobile-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-on-mobile-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-on-mobile-768x491.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-on-mobile-1536x983.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-on-mobile-150x96.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-on-mobile-450x288.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-on-mobile-1200x768.jpg 1200w\" sizes=\"(max-width: 1876px) 100vw, 1876px\" />The XRP community has celebrated the commencement of trading on Atlantis Exchange, an exchange that is registered with the U.S. Treasury Department. This could be the first sign that the ongoing SEC v. Ripple lawsuit is approaching a conclusion ahead of a key deadline this week. Since the courts ruled that XRP is not a [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-18T15:55:03.000Z",
    "title": "El Salvador Enhances Bitcoin Security, Gains Ordinals Support",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/el-salvador-enhances-bitcoin-security-gains-ordinals-support/",
    "description": "<p>Some days ago, President Nayib Bukele announced on X the transfer part of El Salvador&#8217;s Bitcoin to a secure cold wallet in a national vault. Now, its Bitcoin wallet received widespread support from ordinals. This innovative step not only strengthens the security of El Salvador&#8217;s Bitcoin holdings but also signals a deeper dive into the [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/el-salvador-enhances-bitcoin-security-gains-ordinals-support/\">El Salvador Enhances Bitcoin Security, Gains Ordinals Support</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]