[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-22T03:30:04.000Z",
    "title": "HSBC, Mastercard File More Crypto-Related Trademark Applications",
    "url": "https://news.bitcoin.com/hsbc-mastercard-file-more-crypto-related-trademark-applications/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"HSBC, Mastercard File More Crypto-Related Trademark Applications\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />HSBC and Mastercard, two major players in the banking and payment industries, have submitted additional trademark applications related to cryptocurrencies with the United States Patent and Trademark Office (USPTO). Mastercard&#8217;s filing focuses on crypto and blockchain transactions while HSBC&#8217;s application focuses on metaverse banking and services related to non-fungible tokens (NFTs). HSBC and Mastercard Expand [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-22T03:19:43.000Z",
    "title": "Ethereum Price Follows Bitcoin and $2,000 Seems Imminent",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-follows-bitcoin-2000/",
    "description": "Ethereum price is rallying above $1,850 against the US Dollar. ETH is clearly following Bitcoin’s rally and might soon test the $2,000 resistance zone. Ethereum is moving higher above the $1,850 and $1,880 resistance levels. The price is trading above $1,850 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support near $1,890 on the hourly chart of ETH/USD (data feed via Kraken). The pair could rise further above the $1,930 and $1,950 resistance levels. Ethereum Price Surges Over 6% Ethereum’s price started a steady increase above the $1,720 resistance zone. Recently, Bitcoin saw a major increase and helped ETH to clear the $1,850 resistance. The price is up over 6% and there was a move above the $1,900 level. A high is formed near $1,930 and the price is now consolidating gains. It is trading well above the 23.6% Fib retracement level of the recent rally from the $1,715 swing low to the $1,930 high. Ether is also well above $1,850 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support near $1,890 on the hourly chart of ETH/USD. Source: ETHUSD on TradingView.com Immediate resistance is near the $1,930 level. The next major resistance is near the $1,950 level. A successful move above the $1,930 and $1,950 resistance levels might send the price further higher. The next resistance sits near $2,000, above which Ethereum could rise toward the $2,050 level. Any more gains above the $2,050 resistance zone might send the price toward the $2,120 resistance. Are Dips Supported in ETH? If Ethereum fails to clear the $1,950 resistance, it could start a downside correction. Initial support on the downside is near the $1,900 level. The next major support is near the $1,880 level or the recent low. If there is a break and close below the $1,880 support, the price could drop toward the $1,820 support or the 50% Fib retracement level of the recent rally from the $1,715 swing low to the $1,930 high. Any more losses may perhaps send the price toward the $1,780 zone or the 100-hourly Simple Moving Average. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is in the overbought zone. Major Support Level – $1,780 Major Resistance Level – $1,950"
  }
]