[
  {
    "source": "Crypto Daily",
    "date": "2023-08-05T18:45:00.000Z",
    "title": "$SHIT Announces Groundbreaking Initiatives: A Literal Sewer and University on the Eve of IDO on Blooprint",
    "url": "https://cryptodaily.co.uk/2023/08/shit-announces-groundbreaking-initiatives-a-literal-sewer-and-university-on-the-eve-of-ido-on-blooprint",
    "description": "<p>In an unprecedented move in the crypto world, the team behind the new memecoin $SHIT is taking their token to the next level. On the eve of their Initial DEX Offering (IDO) on Blooprint, they announced two groundbreaking initiatives: the construction of an actual sewer system and the establishment of a real-world SHIT University.</p>\n<p>The sewer, a first in the crypto world, is not just a metaphorical nod to the token's name. The $SHIT team is literally investing in infrastructure, planning to build a state-of-the-art sewer system. This initiative, while unconventional, symbolizes $SHIT's commitment to utility and practical value in the crypto space. The team believes that every great project starts from the ground up, and in this case, even further below.</p>\n<p>In addition to the literal sewer, $SHIT is also proud to announce the establishment of SHIT University. Unlike typical crypto education platforms, SHIT University will be a physical institution, complete with lecture halls, dormitories, and a dedicated faculty. The university aims to offer a curriculum that covers everything from the basics of blockchain technology to the philosophy of memecoins. The goal is to create a new generation of crypto enthusiasts who can appreciate the beauty of $SHIT and other memecoins.</p>\n<p>These initiatives are set to launch in conjunction with the IDO of $SHIT on Blooprint. The IDO, scheduled to start on 31 July 2023, is a highly anticipated event in the crypto space. With a total supply of 420,690,000,000,001 tokens, $SHIT promises to offer a unique, straightforward, and fun investment opportunity.</p>\n<p>The interest in $SHIT from leading venture capital firms such as a16z, Shima Capital, and Coinbase Ventures has already put this memecoin in the spotlight. With the announcement of the literal sewer and SHIT University, $SHIT is set to further disrupt the memecoin market and establish itself as a leader in community engagement and education.</p>\n<p>For more information about $SHIT, the upcoming IDO, and the strategic initiatives, visit shitmeme.social.</p>\nAbout $SHIT\n<p>$SHIT is a new memecoin that has caught the attention of leading venture capital firms a16z, Shima Capital, and Coinbase Ventures. With its unique approach and commitment to community engagement and education, $SHIT is set to disrupt the memecoin market.</p>\n<p>Press Contact:</p>\n<p>Website:</p>\n<p>https://shitmeme.social</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T19:03:36.000Z",
    "title": "Worldcoin Price Prediction 2023 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, ... <a title=\"Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldcoin-price-prediction/\" aria-label=\"More on Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T18:54:06.000Z",
    "title": "HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?",
    "url": "https://www.cryptopolitan.com/hbar-price-prediction/",
    "description": "HBAR Price Prediction 2023-2032 Hedera Hashgraph is a trending cryptocurrency focused on providing a sustainable, enterprise-grade blockchain.&#160; The asset has been performing extremely well recently, prompting investors everywhere to search for a Hedera Hashgraph price prediction. So that is a heads-up in crypto winter despite the doom which tends to pull everyone else connected to ... <a title=\"HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hbar-price-prediction/\" aria-label=\"More on HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T18:53:26.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T18:46:37.000Z",
    "title": "Tether emerges as a key Bitcoin holder fueling market speculation",
    "url": "https://www.cryptopolitan.com/tether-emerge-btc-holder-fueling-speculation/",
    "description": "In a significant development, Tether, a prominent stablecoin issuer, has quietly risen to become the 11th largest holder of Bitcoin globally. This revelation has ignited curiosity and speculation within the cryptocurrency market regarding the potential impact the firm could wield. While Tether has refrained from officially disclosing its Bitcoin addresses, Tom Wan, a research analyst ... <a title=\"Tether emerges as a key Bitcoin holder fueling market speculation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tether-emerge-btc-holder-fueling-speculation/\" aria-label=\"More on Tether emerges as a key Bitcoin holder fueling market speculation\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-05T19:05:21.000Z",
    "title": "Crypto Analyst Points To Bitcoin Price History Repeating Itself – Are The Signs Bullish?",
    "url": "https://www.newsbtc.com/bitcoin-news/crypto-analyst-points-to-bitcoin-price-history-repeating-itself-are-the-signs-bullish/",
    "description": "The general crypto market has recorded a slight decline in the last week, with the market leader Bitcoin losing 0.78% of its value over the last seven days.   This price loss amplifies BTC’s negative monthly performance, pushing its total loss in the last 30 days to around 5.38%, according to data from CoinMarketCap. At the time of writing, the premier cryptocurrency is trading at around $29,022, with its daily trading volume valued at $10.746 billion, having gone down 12.54%.  However, amidst Bitcoin&#8217;s current downtrend, it appears the token&#8217;s larger performance could be indicating a bullish market in the coming months. Related Reading: These Are The Factors That Could Lead To Another Bitcoin Rally: ARK Invest Bitcoin Could Be Repeating Historic Bullish Price Cycle &#8211; What Does This Mean?  On Aug. 4, crypto analyst Ali Martinez on social media platform X posted that Bitcoin is likely repeating a popular bullish cycle of its price history.   According to Ali, the token current’s price trajectory since attaining its all-time high in November 2021 is identical to its price movement between 2013 and 2017 based on data from Glassnode.   Bitcoin price performance since cycle ATH &#124; Source: Glassnode If this analysis proves correct, with Bitcoin mirroring its 2013-2017 price cycle, it means Bitcoin is expected to show little price movement in August 2023 and September 2023, perhaps recording some slight gains along the way.  However, Glassnode data shows BTC could experience a price upswing in October 2023, maintaining a bullish momentum all through this month. Thereafter, the token is expected to undergo a major re-correction finding support in the first week of November 2023.  Based on the reference price cycle, Bitcoin could then experience a significant price drop in the last month of 2023 but close the year in a strong consolidation zone. Source: Glassnode Beyond 2023, the BTC market could also be set for huge profits in 2024 and 2025 if Bitcoin is indeed repeating the 2013-2017 price cycle during which the market leader famously gained by over 1600%. However, all investors are reminded that predictions are not guaranteed and should not be considered as investment advice.  Rising Optimism In The BTC Market In other news, it appears there is a rising positive sentiment around Bitcoin, with a significant increase in its accumulation by key holders. According to a report by on-chain analytics firm Santiment, BTC whales and sharks are currently swapping their BUSD and DAI for more BTC.  Santiment noted the situation was quite the opposite back in July, with the BTC heavyweights shedding some of their holdings. However, the analytics firm reports that if the current trend is maintained, we could see BTC trade above $30,000 again.  Related Reading: Bitcoin NVT Shows Bearish Crossover, Price Drop Incoming? In the last few weeks, Bitcoin has remained among the headlines, with much discussion on the ongoing Bitcoin ETF race in the US.  On Aug. 2, Bloomberg ETF analysts James Seyffart and Eric Balchunas rated the approval chances of the first spot Bitcoin ETF at 65%. This is an impressive upgrade from 50% some weeks ago and 1% a couple months ago.  BTC trading at $28,979 on the weekly chart &#124; Source: BTCUSD chart on Tradingview.com Featured image from Forbes, chart from Tradingview."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-05T19:00:04.000Z",
    "title": "SNX Peels Back Weekly Gains; More TOADS Analysts Shouting “Buy”: Here’s Why",
    "url": "https://www.crypto-news-flash.com/snx-peels-back-weekly-gains-more-toads-analysts-shouting-buy-heres-why/?utm_source=rss&utm_medium=rss&utm_campaign=snx-peels-back-weekly-gains-more-toads-analysts-shouting-buy-heres-why",
    "description": "<img width=\"512\" height=\"384\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T153853.060.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T153853.060.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T153853.060-300x225.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As the crypto market continues to experience volatility, the last few days have been unfavorable for the Synthetix (SNX) project. Synthetix has lost its weekly gains after experiencing a significant decline that affected its investors. DigiToads (TOADS) is on a monumental trajectory as it concludes its last stage of the presale rally with almost $7 [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-05T18:45:05.000Z",
    "title": "US Ethereum Futures ETF Has a 75% Chance of Approval in 2023 After Recent Flood of Applications, Analysts Estimate",
    "url": "https://dailyhodl.com/2023/08/05/us-ethereum-futures-etf-has-a-75-chance-of-approval-in-2023-after-recent-flood-of-applications-analysts-estimate/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/futures-etf-after-flood.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/futures-etf-after-flood.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/futures-etf-after-flood.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/futures-etf-after-flood.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/futures-etf-after-flood.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/futures-etf-after-flood.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/futures-etf-after-flood.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A pair of Bloomberg exchange-traded fund (ETF) analysts think there&#8217;s a 75% chance an Ethereum (ETH) futures ETF gets approved in the US this year. James Seyffart and Eric Balchunas say the odds of approval spiked amid a flood of Ethereum futures ETF application submissions to the U.S. Securities and Exchange Commission (SEC). &#8220;The odds [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/05/us-ethereum-futures-etf-has-a-75-chance-of-approval-in-2023-after-recent-flood-of-applications-analysts-estimate/\">US Ethereum Futures ETF Has a 75% Chance of Approval in 2023 After Recent Flood of Applications, Analysts Estimate</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]