[
  {
    "source": "CryptoSlate",
    "date": "2023-06-20T09:06:33.000Z",
    "title": "Bitcoin dominance crosses 50% for first time since April 2021",
    "url": "https://cryptoslate.com/bitcoin-dominance-crosses-50-for-first-time-since-april-2021/",
    "description": "<p>Bitcoin now accounts for half of the total crypto market cap &#8211; crossing 50% dominance for the first time since April 2021. The chart below shows Bitcoin dominance finding a local bottom at 39.9% around November 2021 &#8211; when FTX, and its native FTT token, collapsed, triggering narratives around worthless altcoins and Ponzinomics. Since then, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-dominance-crosses-50-for-first-time-since-april-2021/\">Bitcoin dominance crosses 50% for first time since April 2021</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-20T08:50:14.000Z",
    "title": "Cardano (ADA) Price Analysis Report – 20 June 2023",
    "url": "https://www.cryptoglobe.com/latest/2023/06/cardano-ada-price-analysis-report-20-june-2023/",
    "description": "Introduction This report provides a comprehensive analysis of Cardano (ADA) based on the latest data as of 20 June 2023. The analysis includes a review of the current price, technical indicators, and moving averages. Price and Volume Overview As of 7:51 a.m. UTC on 20 June 2023, Cardano (ADA) is trading at $0.2588, down by […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-20T08:43:00.000Z",
    "title": "BOB Drops After Elon Musk Callout, Crypto Daily TV 20/6/2023",
    "url": "https://cryptodaily.co.uk/2023/06/bob-drops-after-elon-musk-callout-crypto-daily-tv-20-6-2023",
    "description": "In Todays Headline TV CryptoDaily News:\n<p></p>\n<p>UK crypto, stablecoin laws approved by Parliament</p>\n<p>UK parliamentarians have voted through a new bill that could recognize crypto as a regulated activity in the country. The approval of the Financial Services and Markets Bill by Parliament&rsquo;s upper chamber, the House of Lords, means the bill is going to enter the final stages before it is put into law.</p>\n<p>BOB coin prices slide</p>\n<p>Prices of meme coin BOB slid as much as 45% as its popular automated Twitter bot was suspended after the social media giant's owner Elon Musk called the account a &ldquo;scam.\"</p>\n<p>Binance UK subsidiary cancels unused FCA permissions</p>\n<p>The UK subsidiary of the world&rsquo;s largest crypto exchange has canceled its registration with the Financial Conduct Authority. Binance&rsquo;s deregistration with the FCA did not have an operational impact, as it had never done business in the United Kingdom, the firm said.</p>\nBTC/USD skyrocketed 1.4% in the last session.\n<p>The Bitcoin-Dollar pair skyrocketed 1.4% in the last session. The CCI is giving a positive signal. Support is at 26035.3333 and resistance at 26873.3333.</p>\n<p>The CCI is currently in the positive zone.</p>\n<p></p>\nETH/USD gained 0.5% in the last session.\n<p>The Ethereum-Dollar pair gained 0.5% in the last session after rising as much as 1.6% during the session. The CCI is giving a positive signal. Support is at 1697.3267 and resistance at 1758.1467.</p>\n<p>The CCI is giving a positive signal.</p>\n<p></p>\nXRP/USD skyrocketed 1.4% in the last session.\n<p>The Ripple-Dollar pair skyrocketed 1.4% in the last session. The Ultimate Oscillator is giving a negative signal. Support is at 0.4644 and resistance at 0.5087.</p>\n<p>The Ultimate Oscillator is currently in the negative zone.</p>\n<p></p>\nLTC/USD rose 0.3% in the last session.\n<p>The Litecoin-Dollar pair gained 0.3% in the last session. The MACD is giving a negative signal. Support is at 75.31 and resistance at 79.41.</p>\n<p>The MACD is currently in the negative zone.</p>\n<p></p>\nDaily Economic Calendar:\n<p>AU RBA Meeting Minutes</p>\n<p>The minutes of the Reserve Bank of Australia meetings give a full account of the policy discussion, including differences of view. They also record the votes of the individual members of the Committee. Australia's RBA Meeting Minutes will be released at 01:30 GMT, Finland's Unemployment Rate at 06:00 GMT, and Japan's Capacity Utilization at 04:30 GMT.</p>\n<p>FI Unemployment Rate</p>\n<p>The Unemployment Rate measures the percentage of unemployed people in the country. A high percentage indicates weakness in the labor market.</p>\n<p>JP Capacity Utilization</p>\n<p>Capacity Utilization is the percentage of production capacity that is actually used over a short time period. It is indicative of overall growth and demand.</p>\n<p>DE Producer Price Index</p>\n<p>The Producer Price Index measures the average changes in prices in primary markets by producers of commodities in all states of processing. Germany's Producer Price Index will be released at 06:00 GMT, the US Housing Starts at 12:30 GMT, and the US Redbook Index at 12:55 GMT.</p>\n<p>US Housing Starts</p>\n<p>The Housing Starts captures how many new single-family homes or buildings were constructed. It is a key indicator of the housing market.</p>\n<p>US Redbook Index</p>\n<p>The Johnson Redbook Index measures the year-over-year same-store sales growth from a sample of large general merchandise retailers.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T09:01:16.000Z",
    "title": "Global Crypto Community Convenes at Dubai’s Blockchain Economy Summit, Uniting Industry Leaders for a Groundbreaking Event on October 4-5, 2023",
    "url": "https://www.cryptopolitan.com/global-crypto-community-convenes-at-dubais-blockchain-economy-summit-uniting-industry-leaders-for-a-groundbreaking-event-on-october-4-5-2023/",
    "description": "Dubai, UAE – The Blockchain Economy Summit, recognized as the world&#8217;s largest blockchain conference network, is set to redefine the future of finance by bringing together key players and experts from the crypto industry. The highly anticipated 8th edition of the summit will take place over two days in Dubai on October 4-5, 2023, in ... <a title=\"Global Crypto Community Convenes at Dubai&#8217;s Blockchain Economy Summit, Uniting Industry Leaders for a Groundbreaking Event on October 4-5, 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/global-crypto-community-convenes-at-dubais-blockchain-economy-summit-uniting-industry-leaders-for-a-groundbreaking-event-on-october-4-5-2023/\" aria-label=\"More on Global Crypto Community Convenes at Dubai&#8217;s Blockchain Economy Summit, Uniting Industry Leaders for a Groundbreaking Event on October 4-5, 2023\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-20T08:46:02.000Z",
    "title": "Galactic Overlord of Crypto, TMS Network (TMSN) Dominating Cardano (ADA) and Uniswap (UNI)",
    "url": "https://nulltx.com/galactic-overlord-of-crypto-tms-network-tmsn-dominating-cardano-ada-and-uniswap-uni/",
    "description": "TMS Network (TMSN) has emerged as a major player in the rapidly developing cryptocurrency market, exerting outsized influence on formerly dominating cryptocurrencies like Cardano (ADA) and Uniswap (UNI). Crypto fans all around the world have taken notice of TMS Network (TMSN) due to its innovative technology and forward-thinking approach. Come with us as we investigate [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-20T08:40:58.000Z",
    "title": "Why Is The Bitcoin Price Up Today?",
    "url": "https://www.newsbtc.com/news/bitcoin/why-is-bitcoin-price-up-today/",
    "description": "After the Bitcoin price reached a three-month low of $24.835 last week, the bulls currently seem to be gaining the upper hand again. The BTC price has continued its upward trend in the last 24 hours and has risen by 1.6% to currently $26,795. At one point, BTC had already hit $27,203 before a corrective move took place. Why Is Bitcoin Up Today? As always, one can only speculate about the reasons why the Bitcoin price is rising. But thanks to the filing by BlackRock, the world&#8217;s largest asset manager, for a Bitcoin Spot ETF in the US, bullish sentiment has returned to the market. A Bitcoin Spot ETF is predicted to open the flood gates for institutional investors. As NewsBTC reported, the history of the first gold ETF in the US in 2004 could be an indicator of the bullish impact that the approval of a spot ETF could have. The gold ETF has been instrumental in the adoption of gold by institutions. Within eight years of the first ETF, the price of gold more than quadrupled. Related Reading: Bitcoin Recovers Above Critical Level, Why Bulls Could Be Ready To Charge Basically, the US Securities and Exchange Commission has 240 days (about eight months) to decide on the application. However, David Attley, CEO of Bitcoin Magazine, asserted yesterday that he had heard a compelling argument that the BlackRock Bitcoin ETF could be approved shortly (&#8220;days to weeks&#8221;). This news may have had as positive an impact on the market as yesterday&#8217;s news that Fidelity may also soon apply for a Bitcoin Spot ETF along the lines of BlackRock. Obviously, crypto Twitter has become much more bullish as a result of the BlackRock news. Related Reading: What Happens To Bitcoin Price If Spot ETF Is Approved? Gold ETF Story Reveals And large investors in BTC, so-called whales, have also turned bullish on the leading cryptocurrency for quite some time. As reported by on-chain data analytics service Santiment, whales have been busy over the past two months as the crowd watched the price fall. &#8220;Now back above $27k once again, it&#8217;s far from coincidence that wallets holding 1K to 10K $BTC have accumulated a combined $3.5B since the first week of April,&#8221; Santiment states. Intraday trader @52Skew makes a similar observation with regard to BTC perp CVD buckets &#38; delta orders: &#8220;Whales mostly driving price still, longs aped on this bounce, shorts still twaping on every bounce.&#8221; Moreover, the trader observed in the last few hours that there was a lot of demand in the spot market on Binance, the largest crypto exchange. According to him, spot buying is a sign of a sustained rally, so ideally spot buying needs to persist. In terms of the Binance open interest and funding, Skew states that many shorts are chasing the price after the longs were squeezed earlier. Outlook For H2 2023 Another bullish impact on the market could be the technical chart outlook for the second half of the year. As Aksel Kibar, Chartered Market Technician (CMT), writes via Twitter, BTC could be on the verge of a breakout from the correction that has been taking place since mid-April: Looks like we have a valid downward sloping channel on $BTCUSD with the upper boundary acting as short-term resistance at 27K. Breakout from the channel can complete the existing pullback to the larger scale H&#38;S bottom reversal. At press time, the Bitcoin price saw a slight correctional move and was trading at $26,795. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T09:00:29.000Z",
    "title": "Altcoin Season Is Back: VC Spectra (SPCT) and Sui (SUI) Take the Lead",
    "url": "https://www.crypto-news-flash.com/altcoin-season-is-back-vc-spectra-spct-and-sui-sui-take-the-lead/?utm_source=rss&utm_medium=rss&utm_campaign=altcoin-season-is-back-vc-spectra-spct-and-sui-sui-take-the-lead",
    "description": "Altcoin season is an exciting time for investors enabling them to get ahead and seize the opportunities that arise. It&#8217;s the time when the focus shifts from Bitcoin and toward new cryptocurrencies that show high growth and profit potential.  As altcoin season unfolds, VC Spectra (SPCT) and Sui (SUI) have emerged as notable leaders in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T08:49:45.000Z",
    "title": "Cathie Wood Doubles Down on Coinbase and Predicts Bitcoin to Hit $1 Million ",
    "url": "https://www.crypto-news-flash.com/cathie-wood-doubles-down-on-coinbase-and-predicts-bitcoin-to-hit-1-million/?utm_source=rss&utm_medium=rss&utm_campaign=cathie-wood-doubles-down-on-coinbase-and-predicts-bitcoin-to-hit-1-million",
    "description": "Ark Invest is bullish on the Coinbase shares as Cathie Wood expects the exchange to win its case against SEC. Cathie Wood also doubled down on her $1 million price prediction for Bitcoin, expecting the asset to be heavily embraced as a hedge against inflation. The US Securities and Exchange Commission recently sued Coinbase competitor, [...]"
  }
]