[
  {
    "source": "Cointelegraph",
    "date": "2023-08-08T04:50:33.000Z",
    "title": "Circle CEO: 70% of USDC adoption comes from outside the US ",
    "url": "https://cointelegraph.com/news/circle-ceo-usdc-adoption-emerging-developing-markets",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/244d18c9-c1b7-4aaa-a528-99fbd5a06e1b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Major stablecoin issuers Tether and Circle are focusing on non-U.S. markets where adoption is growing. </p>\n                    <p><p>Circle CEO Jeremy Allaire estimates as much as 70% of USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) adoption comes from countries outside of the United States.</p><p>On Aug. 8 tweet to his 131,300 followers on X (Twitter), Allaire said the high rate of non-U.S. adoption was “despite the hype that we're all about the US,” adding:</p><blockquote>“We estimate that 70% of USDC adoption is non-US, and some of the fastest growing areas are emerging and developing markets.” </blockquote><p>He <a href=\"https://twitter.com/jerallaire/status/1688672056898928640\" target=\"_blank\" rel=\"noopener nofollow\">added</a> that strong progress was happening across Asia, Latin America (LATAM), and Africa. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Despite the hype that we&#39;re all about the US, we estimate that 70% of USDC adoption is non-US, and some of the fastest growing areas are emerging and developing markets.  Strong progress happening across Asia, LATAM and Africa.  Demand for safe, transparent digital dollars is…</p>&mdash; Jeremy Allaire (@jerallaire) <a href=\"https://twitter.com/jerallaire/status/1688672056898928640?ref_src=twsrc%5Etfw\">August 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Paolo Ardoino, CTO of rival stablecoin issuer Tether, echoed a similar non-U.S. focus for his firm and stablecoin. In February, he <a href=\"https://twitter.com/paoloardoino/status/1623644473652551680\" target=\"_blank\" rel=\"noopener nofollow\">said</a> that USDT can be “considered a safe tool for emerging markets and developing countries.” </p><p>Cointelegraph reached out to Circle for further details on non-U.S. expansion but had not received a response at the time of publication. </p><p>Allaire's comments came amid an announcement from PayPal tha it is launching its own USD-pegged stablecoin, PayPal USD (PYUSD), where he congratulated the firm and Paxos, adding:</p><blockquote>\"It's incredibly exciting to see such a significant internet and payments company entering the stablecoin space. This is what happens when we start to get regulatory clarity.\"</blockquote><p>His comments also come amid a decline in USDC supply since the beginning of 2023, due to dwindling demand and an increase in redemptions. As a result, its stablecoin market share has shrunk to just 21% with a total circulation of $26.1 billion.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/circle-to-launch-official-version-of-usdc-natively-on-arbitrum\"><strong><em>Circle to launch ‘official version’ of USDC natively on Arbitrum</em></strong></a></p><p>On Aug. 8, Allaire also commented on concerns over USDC liquidity, confirming that redemptions were outpacing issuance stating, “Over the past month, we've issued $5B USDC, and have redeemed $6.6B USDC.”</p><p>Allaire added that Circle’s global banking and liquidity network was expanding and the firm was working with “exceptional and high-quality banks in major regions around the world.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">USDC Liquidity.  Over the past month, we&#39;ve issued $5B USDC, and have redeemed $6.6B USDC.  <br><br>USDC banking is public and transparent, with 24/7/365 mint/burn, and wire settlement with nearly 90 countries.<br><br>USDC reserves are attested by Deloitte every month, and all of our T-bill…</p>&mdash; Jeremy Allaire (@jerallaire) <a href=\"https://twitter.com/jerallaire/status/1688667728737959937?ref_src=twsrc%5Etfw\">August 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In a transparency <a href=\"https://www.circle.com/en/transparency#transparency\" target=\"_blank\" rel=\"noopener nofollow\">report</a> released on Aug. 3, the firm stated that its Circle Reserve Fund held a 93% portfolio of short-dated US Treasuries, overnight US Treasury repurchase agreements, and cash. The remaining 7% is cash reserves at banks, according to Circle. </p><p>In early June, Circle <a href=\"https://cointelegraph.com/news/circle-is-latest-recipient-of-major-payment-institution-license-in-singapore\">announced</a> that it had received a Major Payment Institution (MPI) license from the Monetary Authority of Singapore (MAS).</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/yuan-stablecoin-team-arrested-wechats-new-bitcoin-prices-hk-crypto-rules-asia-express/\"><strong><em>Yuan stablecoin team arrested, WeChat’s new Bitcoin prices, HK crypto rules: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]