[
  {
    "source": "CoinDesk",
    "date": "2023-10-27T09:02:05.000Z",
    "title": "Floki Pounces on Trillion Dollar RWA Narrative With New TokenFi Platform",
    "url": "https://www.coindesk.com/tech/2023/10/27/floki-pounces-on-trillion-dollar-rwa-narrative-with-new-tokenfi-platform/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "“The tokenization industry is projected to be a $16 trillion industry by the year 2030,” Floki lead developer ‘B’ told CoinDesk in a Telegram message"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-27T08:56:22.000Z",
    "title": "Taiwan introduces crypto bill to Parliament ",
    "url": "http://cointelegraph.com/news/taiwan-introduces-crypto-bill-parliament",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/332e02df-a85f-4753-8b21-1a882b48cc8a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Virtual Asset Management Bill aims to provide “better protection” for the customers and “properly supervise” the industry. </p>\n                    <p><p>On Oct. 25, Taiwanese legislators introduced the Virtual Asset Management Bill to the unicameral parliament, the Legislative Yuan. The bill aims to provide “better protection” for the customers and “properly supervise” the industry. </p><p>The 30-page bill appears moderate in its demands for the industry. It suggests some common sense obligations for the virtual asset service providers (VASPs), such as separating customer funds from the company’s reserve funds, establishing an internal control and audit system, and joining the local trade association. </p><p>However, at this point, it doesn’t require stablecoin issuers to hold a 1:1 ratio of reserve funds, and it doesn't mention algorithmic stablecoins. As to marketing activities, the rules for advertising are to be determined by the “competent authority.”</p><p>The bill suggests fines for VASPs operating without a license — no less than two million Taiwanese dollars (around $60,000) and no more than twenty million ($600,000). The companies already operating in the Taiwan market will get six months to obtain a license after the bill comes into force. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/circle-points-to-crypto-program-taiwan-convenience-store\"><strong><em>Circle launches ‘points-to-crypto’ program with Taiwan convenience store chain</em></strong></a></p><p>In September 2023, Taiwan’s Financial Supervisory Commission (FSC) also released <a href=\"https://cointelegraph.com/news/taiwan-bans-operation-unregistered-foreign-crypto-exchanges\">industry guidelines for VASPs</a>. The FSC prohibits foreign VASPs from providing their services in Taiwan without obtaining necessary approvals from the regulator.</p><p>The rules were created as major cryptocurrency exchanges in Taiwan have <a href=\"https://cointelegraph.com/news/taiwan-major-crypto-exchanges-form-association\">formed a self-regulatory association</a>. On September 26, local exchanges like Maicoin, BitstreetX, Hoya Bit, Bitgin, Rybit, Xrex, and Shangbito joined forces to create the Taiwan Virtual Asset Platform and Transaction Business Association. They aim to support the crypto industry and work with regulators.</p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/ethereum-restaking-blockchain-dangerous/\"><strong><em>Ethereum restaking. Blockchain innovation or dangerous house of cards?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-27T08:56:19.000Z",
    "title": "Fireblocks, UniPass wallet tackle Ethereum ERC-4337 account abstraction vulnerability ",
    "url": "http://cointelegraph.com/news/fireblocks-identifies-ethereum-erc-4337-account-abstraction-vulnerability",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/66aafc70-4d82-4260-b25a-588b974ce826.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Fireblocks assists smart contract wallet UniPass to address ERC-4337 account abstraction vulnerability. </p>\n                    <p><p>Cryptocurrency infrastructure firm Fireblocks has identified and assisted in tackling what it describes as the first account abstraction vulnerability within the Ethereum ecosystem.</p><p>An announcement on Oct. 26 unpacked the discovery of an ERC-4337 account abstraction vulnerability in the smart contract wallet UniPass. The two firms worked together to address the vulnerability, which was reportedly found in hundreds of mainnet wallets during a ‘whitehat’ hacking operation.</p><p>According to Fireblocks, the vulnerability would allow a potential attacker to carry out a full account takeover of UniPass wallet by manipulating Ethereum's account abstraction process. </p><p>As per Ethereum’s developer <a href=\"https://eips.ethereum.org/EIPS/eip-4337\" target=\"_blank\" rel=\"noopener nofollow\">documentation</a> on ERC-4337, account abstraction allows for a shift in the way transactions and smart contracts are processed by the blockchain to provide flexibility and efficiency.</p><p><a href=\"https://cointelegraph.com/news/eth-smart-accounts-drive-billion-asia-users-consensys-exec\"><strong><em>Related: Account abstraction will drive a billion users from Asia to Web3: ConsenSys exec</em></strong></a></p><p>Conventional Ethereum transactions involve two types of accounts, externally owned accounts (EOAs) and contract accounts. EOAs are controlled by private keys and can initiate transactions, while contract accounts are controlled by the code of a smart contract. When an EOA sends a transaction to a contract account, it triggers the execution of the contract's code.</p><p>Account abstraction introduces the idea of a meta-transaction or more generalized abstracted accounts. Abstracted accounts are not tied to a specific private key and are able to initiate transactions and interact with smart contracts just like an EOA.</p><p>As Fireblocks explains, when an ERC-4337-compliant account executes an action, it relies on the Entrypoint contract to make sure only signed transactions get executed. These accounts typically trust an audited single EntryPoint contract to ensure that it receives permission from the account before executing a command:</p><blockquote>“It’s important to note that a malicious or buggy entrypoint could, in theory, skip the call to “validateUserOp” and just call the execution function directly, as the only restriction it has is that it’s called from the trusted EntryPoint.”</blockquote><p>According to Fireblocks, the vulnerability allowed an attacker to gain control of UniPass wallets by replacing the trusted EntryPoint of the wallet. Once the account takeover was complete, an attacker would be able to access the wallet and drain its funds.</p><p>Several hundred users that had the ERC-4337 module activated in their wallets were vulnerable to the attack which could be performed by any actor on the blockchain. The wallets in question only held small amounts of funds and the issue has been mitigated at an early stage.</p><p>Having ascertained that the vulnerability could be exploited, Fireblocks’ research team managed to carry out a whitehat operation to patch the existing vulnerabilities. This involved actually exploiting the vulnerability:</p><blockquote>“We shared this idea with the UniPass team, who took it upon themselves to implement and run the whitehat operation.”</blockquote><p>Ethereum co-founder Vitalik Buterin <a href=\"https://cointelegraph.com/news/vitalik-buterin-ethereum-ethcc-paris-account-abstraction-ethereum\">previously outlined</a> challenges in expediting the proliferation of account abstraction functionality, which includes the need for an Ethereum Improvement Proposal (EIP) to upgrade EOAs into smart contracts and ensuring the protocol works on layer-2 solutions.</p><p><a href=\"https://cointelegraph.com/magazine/ethereum-restaking-blockchain-dangerous/\"><strong><em>Magazine: Ethereum restaking: Blockchain innovation or dangerous house of cards?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-27T08:58:29.000Z",
    "title": "Binance leverage ratio hits YTD low while Deribit reaches all-time high",
    "url": "https://cryptoslate.com/insights/binance-leverage-ratio-hits-ytd-low-while-deribit-reaches-all-time-high/",
    "description": "<p>Quick Take The Estimated Leverage Ratio is a crucial metric that provides a window into the leverage activity within the futures market of a particular exchange, where a higher ratio signals a higher risk due to the market&#8217;s susceptibility to significant losses (or gains) from minor market movements. Analyses of two major exchanges, Binance and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/binance-leverage-ratio-hits-ytd-low-while-deribit-reaches-all-time-high/\">Binance leverage ratio hits YTD low while Deribit reaches all-time high</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-27T08:59:34.000Z",
    "title": "Solana (SOL) Price Analysis: SOL On The Rise As Solana Launches Incubator",
    "url": "https://cryptodaily.co.uk/2023/10/solana-sol-price-analysis-sol-on-the-rise-as-solana-launches-incubator",
    "description": "In a bid to expand its ecosystem and attract founders to its blockchain, Solana Labs has launched its first startup incubator."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-27T09:00:26.000Z",
    "title": "Binance CEO reportedly lost $12b amid regulatory problems",
    "url": "https://crypto.news/binance-ceo-reportedly-lost-12b-amid-regulatory-problems/",
    "description": "The fortune of the founder and head of the largest crypto exchange, Binance, Changpeng Zhao, decreased by $12 billion amid problems with the trading platform. The Bloomberg Billionaires Index cut its earnings estimate for the Binance cryptocurrency exchange by 38%&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-27T08:49:14.000Z",
    "title": "Only 7% happy with U.S. financial system, Coinbase reports",
    "url": "https://crypto.news/only-7-happy-with-u-s-financial-system-coinbase-reports/",
    "description": "New research by Coinbase shows only a tiny percent of U.S. citizens still believe the American Dream is achievable in the current financial environment. Less than 10% of Americans are happy with the nation&#8217;s financial system as younger generations become&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-27T09:09:00.000Z",
    "title": "Matrixport Predicts Bitcoin to Skyrocket to $125,000: Fifth Bull Market Is Here",
    "url": "https://www.crypto-news-flash.com/matrixport-predicts-bitcoin-to-skyrocket-to-125000-fifth-bull-market-is-here/?utm_source=rss&utm_medium=rss&utm_campaign=matrixport-predicts-bitcoin-to-skyrocket-to-125000-fifth-bull-market-is-here",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876-2048x1152.jpg 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />A top crypto trading platform predicts that Bitcoin will rise to $125,000, nearly doubling from its previous all-time high. Matrixport believes that the fifth bull market has already begun and will culminate in a new all-time high by December 2024. Top crypto trading firm Matrixport has shared insights into the prices of Bitcoin (BTC) in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-27T08:51:06.000Z",
    "title": "JPMorgan Forecasts SEC Approval of 8-10 Bitcoin Spot ETFs as Trillion-Dollar Giants Threaten Lawsuits if Denied",
    "url": "https://www.crypto-news-flash.com/jpmorgan-forecasts-sec-approval-of-8-10-bitcoin-spot-etfs-as-trillion-dollar-giants-threaten-lawsuits-if-denied/?utm_source=rss&utm_medium=rss&utm_campaign=jpmorgan-forecasts-sec-approval-of-8-10-bitcoin-spot-etfs-as-trillion-dollar-giants-threaten-lawsuits-if-denied",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Bjorn-Bakstad-JP-Morgan.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"JPMorgan\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Bjorn-Bakstad-JP-Morgan.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Bjorn-Bakstad-JP-Morgan-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Bjorn-Bakstad-JP-Morgan-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Bjorn-Bakstad-JP-Morgan-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The U.S. SEC has 8-10 bitcoin spot ETF filings under review, with the financial world eagerly awaiting their decision. JPMorgan predicts a strong likelihood of SEC approval to avoid potential lawsuits from trillion-dollar financial giants. JPMorgan’s recent forecast places the U.S. Securities and Exchange Commission (SEC) at a crucial juncture, predicting the approval of 8-10 [...]"
  }
]