[
  {
    "source": "Cointelegraph",
    "date": "2023-08-03T18:30:00.000Z",
    "title": "Base launches mainnet bridge UI for end-users, sets Aug. 9 for official launch",
    "url": "https://cointelegraph.com/news/coinbase-base-launches-mainnet-bridge-ui-end-users-sets-august-9-official-launch",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/6a0797b7-3660-4cb8-9652-e9733e47bea7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Coinbase's Base network began onboarding end-users through a bridge UI, and the team announced Aug. 9 as the platform's official launch date.</p>\n                    <p><p>Coinbase’s Base network has released a user interface (UI) for its official bridge, allowing end-users to onboard for the first time without relying on developer tools, according to an Aug. 3 announcement. The team has <a href=\"https://base.mirror.xyz/h028XVTdP7QtZZfWAHuJ9OYmMNs0Fyi4e4fJZH_5ik4\" target=\"_blank\" rel=\"noopener nofollow\">set</a> Aug. 9 as Base’s “official” release date. They will award over 100 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), worth approximately $184,000, in grants to developers and content creators as part of a month-long launch event called the “Onchain Summer.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Base is now open for bridging<br><br>Base opens for everything on August 9<br><br>We’re helping throw an onchain festival to celebrate<br><br>ɪᴛ&#39;ꜱ ᴏɴᴄʜᴀɪɴ ꜱᴜᴍᴍᴇʀ <a href=\"https://t.co/p8KTcnkbbx\">https://t.co/p8KTcnkbbx</a></p>&mdash; Base ️ (@BuildOnBase) <a href=\"https://twitter.com/BuildOnBase/status/1687088084704509952?ref_src=twsrc%5Etfw\">August 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The Base mainnet <a href=\"https://cointelegraph.com/news/coinbase-base-launches-mainnet-for-builders-will-onboard-users-august\">launched for builders</a> on July 13, but it lacked a functioning UI for its bridge from Ethereum. At the time, the only way to use the network was to employ command-line developer tools to bridge ETH from Ethereum’s layer-1.</p><p>In the Aug. 3 announcement, the team said the bridge UI is now running. End-users can start using the network immediately without waiting for the official launch; however, some of Base’s initial Web3 apps may not be available until the official launch on Aug. 9.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/30749cad-d4b4-465e-a510-8b71101bbc0c.png\"  /><figcaption style=\"text-align: center;\"><em>The user interface for Base network’s Ethereum bridge. Source: Base</em></figcaption></figure><p>The team also announced a month-long “Onchain Summer” celebration. Each day, builders will “be bringing you something fun to do onchain, highlighting art, music, gaming, advocacy, and more,” the announcement stated. The team will award ETH grants to individuals or groups that create Base-related websites, art and videos or who deploy new protocols to the network between Aug. 9 and Sept. 13. The team will hand out Base-related nonfungible tokens and ETH to users who bridge to the network or complete educational “quests.”</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/bald-token-developer-denies-rug-pull-price-falls-post-launch\"><strong>Base’s largest DEX, LeetSwap, halts trading amid exploit concerns</strong></a></em></p><p>Some investors lost millions of dollars worth of crypto on Base while trying to use it when it was “launched for builders” and not publicly available. The Pond0X memecoin was launched for Base on July 28, and tech-savvy investors who knew how to bridge without a UI poured over $2 million into the project, only to have the token <a href=\"https://cointelegraph.com/news/pond0x-token-launch-snafu-leads-millions-dollars-losses\">collapse to near zero in price</a> as a bug in its transfer function was found. Another Base memecoin, “Bald,” resulted in losses of approximately $1.9 million when the developer <a href=\"https://cointelegraph.com/news/bald-token-developer-denies-rug-pull-price-falls-post-launch\">pulled liquidity from the exchange</a> it was trading on.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-03T18:28:14.000Z",
    "title": "Worldcoin: Should you let Sam Altman scan your eyeballs for WLD?",
    "url": "https://cointelegraph.com/news/worldcoin-sam-altman-scan-your-eyeballs-wld",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/50a205b2-fe77-4425-bc1c-f20f0118e7a0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sam Altman believes his product ChatGPT will disrupt the world. As a “solution” to the consequences, he’s asking you to scan your eyeballs with his new Orb.</p>\n                    <p><p>OpenAI founder Sam Altman <a href=\"https://cointelegraph.com/news/worldcoin-launch-sparks-debate-over-data-privacy-and-future-of-ai\">launched Worldcoin in July</a>, a cryptocurrency token offered to people willing to share their biometric data by scanning their eyeballs with an Orb, seeking to link real-world identity with decentralized blockchain identity. Many aspects of the project embody the dystopian nightmare that the cypherpunks created Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and other cryptocurrencies in order to avoid.</p><p>The tokenomics for Worldcoin’s WLD token are such that only 1% of the total value is floating right now. That kind of overhang is unprecedented, even in the wild world of crypto distributions. The token won’t long hold its value unless the entire world puts their eyeballs into the Orb. Unlike Bitcoin or Ethereum — which grew organically through user adoption and utility — the project is all or nothing. Either it is the only solution for on-chain identity or it will be worthless.</p><p>Altman’s recent testimony advocating for a regulatory moat for artificial intelligence (AI) to protect OpenAI’s dominance is suggestive of his business ethics. The change in business entity form for his organization from nonprofit to for-profit is also suggestive of the stickiness of his public promises.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/worldcoin-makes-reality-stranger-fiction\"><strong><em>Worldcoin is making reality look a lot like Black Mirror</em></strong></a></p><p>Claims that privacy and biometrics are protected by Worldcoin are unsubstantiated assertions, and they cannot be trusted until Worldcoin — along with its mysterious Orb — become free and open source. This is not Altman’s approach to development and would probably threaten the integrity of Orb identity verification anyway.</p><p><a href=\"https://cointelegraph.com/explained/what-is-an-eclipse-attack\">Sybil attacks and spam</a> are a problem in crypto, and they can lead to market manipulation. Altman’s AI revolution, as impressive and useful as it is, will make that worse. But this is not the answer. Crypto privacy should overcome the urge to ape into the next token.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">HERE WE GO FOLKS: Hundreds of youth voluntarily line-up to have their eyeballs scanned with a Worldcoin orb to get their new digital ID with “free money” Worldcoins in their new digital wallet. This is exactly how <a href=\"https://twitter.com/hashtag/CBDC?src=hash&amp;ref_src=twsrc%5Etfw\">#CBDC</a> will be rolled out globally…<br> <a href=\"https://t.co/whWgxdg7lm\">pic.twitter.com/whWgxdg7lm</a></p>&mdash; Patrick Henningsen (@21WIRE) <a href=\"https://twitter.com/21WIRE/status/1684326398280826881?ref_src=twsrc%5Etfw\">July 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Worldcoin is partly a response to Altman’s vision for AI. He anticipates his AI project will cause massive disruption and allow AI tools to pose as humans, so his response is to scan the eyeballs of everyone in the world. Altman asks us to trust him with that biometric information, and he will give us a few WLD tokens — which currently don’t actually do anything, so it’s the biometric equivalent of buying our identity registration with an on-chain version of the beads used to buy Manhattan.</p><p>Imagine the ego needed to assert that you will change the world with AI but warn your AI revolution will wreak havoc — yet, don’t worry, the whole world just needs to also scan their eyeballs into his secret Orb to fix it. This depth of hubris would make Soviet-era commissars blush.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/time-for-the-sec-to-settle-with-coinbase-ripple\"><strong><em>It’s time for the SEC to settle with Coinbase and Ripple</em></strong></a></p><p>We are told not to worry because Worldcoin will decentralize. We were also told OpenAI was a nonprofit research organization, but we know how that promise changed when the lure of Microsoft’s $10 billion came calling. And even if Worldcoin decentralized tomorrow, remember that Worldcoin is built on the Optimism layer 2, and that isn’t decentralized either.</p><p>In fairness, some of the top minds in zero-knowledge proof cryptography are working on the project. I don’t doubt their commitment or their tech, and we can appreciate the search for identification solutions within cryptocurrency to build on-chain identity while preserving privacy. That doesn’t mean buying into a solution from Altman — for a problem he’s creating with OpenAI — that works by giving his centralized project control over my identity.</p><p>Ethereum founder <a href=\"https://cointelegraph.com/news/worldcoin-token-launch-sparks-response-from-vitalik-buterin\">Vitalik Buterin recently opined on Worldcoin</a>, and he was mostly right about the trade-offs — from advantages to worst-case scenarios. But the one area he missed was the economics of wealth. Like some other crypto developers, he buys into an overestimated bias of wealth effects on the economy.</p><p>That’s an understandable bias for an Ethereum developer who is already wealthy. However, for the rest of us, the market’s regular pricing system is more trustworthy than Altman’s dystopian eyeball scanner. There are easier solutions to Sybil attacks and other identity challenges to the extent they are a legitimate problem. I’d rather pay for access, or be fooled into interacting with bots, than scan my eyeballs into Altman’s Orb.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>J.W. Verret</strong> is an associate professor at George Mason University’s Antonin Scalia Law School. He is a practicing crypto forensic accountant and also practices securities law at Lawrence Law LLC. He is a member of the Financial Accounting Standards Board’s Advisory Council and a former member of the SEC Investor Advisory Committee. He also leads the Crypto Freedom Lab, a think tank fighting for policy change to preserve freedom and privacy for crypto developers and users.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.3</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-03T18:15:00.000Z",
    "title": "The Sandbox implements KYC measures for protocol staking",
    "url": "https://cointelegraph.com/news/the-sandbox-implements-kyc-measures-protocol-staking",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/5c589584-771d-4804-96d1-7a0a07c70569.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Unverified users can still withdraw staked SAND but will be unable to make further deposits. </p>\n                    <p><p>Metaverse platform The Sandbox will require Know Your Customer (KYC) verification for its staking processes, according to an Aug. 3 announcement. </p><p>The announcement stated that only verified users could deposit The Sandbox (<a href=\"https://cointelegraph.com/the-sandbox-sand-price-index\">SAND</a>) tokens, which are native to the platform, and claim staking rewards, while non-verified users will be placed into withdraw-only mode. Data from blockchain analytics firm Messari <a href=\"https://messari.io/report/state-of-the-sandbox-q2-2023\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> that 123 million SAND, or 6.7% of the token’s circulating supply, is currently staked by users. The Sandbox developers wrote:</p><blockquote>“To enhance user security and compliance, we have implemented KYC verification for our staking process. Our goal is to ensure that our users’ accounts are verified before they can participate in staking or claim their earnings.\"</blockquote><p>On June 6, Cointelegraph reported that SAND was <a href=\"https://cointelegraph.com/news/sec-labels-61-cryptocurrencies-securities-after-binance-suit\">one of 68 cryptocurrencies</a> the United States Securities and Exchange Commission (SEC) deemed to be a security in its latest lawsuits against Binance and Coinbase. SAND was deployed on the Ethereum blockchain in 2012 by San Francisco gaming firm Pixowl. In 2018, Hong Kong-based Animoca Brands acquired Pixowl via its subsidiary TSB Gaming, intending to build a 3D metaverse utilizing blockchain technology. </p><p>Citing various initial exchange offerings and private sales conducted by developers over the years, the SEC <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.599908/gov.uscourts.nysd.599908.1.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">alleges</a>:</p><blockquote>\"The information TSB publicly disseminated has led SAND holders, including those who have purchased SAND since May 2022, reasonably to view SAND as an investment in and to expect to profit from TSB's efforts to grow the Sandbox protocol, which, in turn, would increase the demand for and the value of SAND.\"</blockquote><p>Since the publication of the Coinbase lawsuit, Animoca Brands co-founder Yat Siu has <a href=\"https://cointelegraph.com/news/web-3-crypto-u-s-regulatory-uncertainty-could-be-hong-kong-s-gain-yat-siu\">criticized the lack</a> of “consistency\" regarding SEC regulations and praised Hong Kong’s shifting attitude toward blockchain. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> To enhance user security and compliance, we have implemented KYC verification for our staking process. Our goal is to ensure that our users&#39; accounts are verified before they can participate in staking or claim their earnings.<br><br>Unverified users can still withdraw their <a href=\"https://twitter.com/search?q=%24SAND&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$SAND</a>,…</p>&mdash; The Sandbox (@TheSandboxGame) <a href=\"https://twitter.com/TheSandboxGame/status/1687084587061501952?ref_src=twsrc%5Etfw\">August 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/elegant-and-ass-backward-jameson-lopps-first-impression-of-bitcoin/\">‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-03T18:30:00.000Z",
    "title": "‘Miners should maximize their returns’: Top-5 solutions from Leading Mining Pool emcd.",
    "url": "https://cryptodaily.co.uk/2023/08/miners-should-maximize-their-returns-top-5-solutions-from-leading-mining-pool-emcd",
    "description": "<p>One of the top-10 mining pools offers a comprehensive solution to crises that cryptocurrency miners face in 2023: emcd. Cyberbank &mdash; a cyberbank with a package of services that help miners make more without &lsquo;additional costs&rsquo;.</p>\n<p>Mining in 2023, with operational costs&rsquo; growth and a long cryptowinter, is becoming less and less profitable for miners. But one of the largest pools in the world has a solution: launching its own ecosystem aimed specifically at miners and other cryptocurrency users. The cyberbank from the leading pool offers users services from friendly commission-free withdrawal tools to investment tools with up to 12% per annum to raise mining profits.</p>\n\n&lsquo;Miners should make more money, and we know how to make it happen. We&rsquo;re launching a neobank where miners will be able to fully manage their assets in a single app, without additional commissions and other costs.&rsquo;\n\n<p>&nbsp;&mdash; emcd. team</p>\nTop-5 Solutions from emcd.\n<p>Mining on asics and videocards is no longer the &lsquo;wild west&rsquo; it was at the dawn of crypto. Without pools and growing ecosystems it&rsquo;s harder and harder for miners to manage assets and wait until investments and huge operational costs pay off.</p>\nWho are emcd.?\n<p>In 5 years, emcd. made the journey from a small startup to a major pool that made it to the top-10 BTC mining pools in the world. 270,000 miners from 120 countries already use the platform.</p>\n<p>emcd. decided to choose a comprehensive approach to miners&rsquo; issues, with a whole set of services for digital asset management. And even though mining always involves costs nobody can single-handedly control, emcd. is cutting additional operational costs that hit miners with 5 easy solutions.</p>\nOne of the lowest comissions on the market\n<p>How did a start-up make it to the top-10 BTC mining pools in the world? Easy &mdash; the service has a fixed commission rate of 5%. Hardly any pool in the world is ready to offer its miners to take away 98.5% of their rewards, but emcd. are playing the long game on the market (and so far, judging by volumes and users, they&rsquo;re making the right call).</p>\nSecure and user-friendly wallet\n<p>Everything a miner makes goes to an internal wallet that is actually easy to use. Without shelling out extra commissions for transfers, users can convert currencies and withdraw money directly to their cards directly in the emcd. app. Moreover, there&rsquo;s no minimal withdrawal amount, which is usually the case for platforms like this &mdash; if you want to withdraw each dollar one by one, nobody&rsquo;s stopping you.&nbsp;</p>\nA native P2P platform\n<p>One of the biggest headaches miners have is withdrawing their rewards to fiat. And P2P exchanges remain one of the most popular solutions &mdash; even people who still haven&rsquo;t heard of mining in 2023 know how to use them. emcd. Isn&rsquo;t asking miners to ditch their long-trusted tool in favor of the built-in withdrawal features in the wallet, instead, they offer their own P2P platform, once again helping miners bypass unnecessary transfer commissions.</p>\n12% per annum on your balance\n<p>Mining as a source of income is inevitably tied to issues in the rest of the economy, including unpredictable inflation, especially in regions where mining is an affordable additional income source. To make sure miners&rsquo; profits don&rsquo;t devalue because of economic fluctuations, emcd. offers its own investment tools with rates better than any bank &mdash; 12% per annum.&nbsp;</p>\nLive support\n<p>No bots &mdash; only actual humans who respond in approximately 15 minutes 24/7. Don&rsquo;t waste time searching for the code phrase that will finally get you to an operator, only to refresh the chat page for hours waiting for a response to urgent questions about your own assets.&nbsp;</p>\nWill there be mining in 2023?\n<p>And more importantly, is mining profitable in 2023, and what will happen with Bitcoin mining after Bitcoin halving? emcd. has answers for experts and newbies alike. The platform&rsquo;s official Telegram offers all the current updates and news, reviews, and even cryptocurrency mining guides for newbies. Following the project&rsquo;s progress!</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T18:34:54.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T18:33:14.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T18:31:31.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T18:29:38.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-03T18:34:27.000Z",
    "title": "Bitcoin Ready For Price Bounce As Address Activity Surges",
    "url": "https://nulltx.com/bitcoin-ready-for-price-bounce-as-address-activity-surges/",
    "description": "In August, Bitcoin&#8217;s address activity experienced a notable surge, reaching its highest level in 3.5 months, with approximately 1.07 million unique addresses integrating into the Bitcoin network. This influx of new addresses represents the most significant growth since April 17th. The increased utility on the network is a positive indicator for the cryptocurrency&#8217;s adoption and [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-03T18:37:10.000Z",
    "title": "Worldcoin plans to open-source design of iris-scanning orbs ",
    "url": "https://crypto.news/worldcoin-plans-to-open-source-design-of-iris-scanning-orbs/",
    "description": "Worldcoin is exploring a decentralized and incentivized approach to manufacturing its iris-scanning orbs"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-03T18:35:18.000Z",
    "title": "Bank of America CEO Forecasts US Recession in Early 2024 After Fed Hikes Rates to 22-Year High",
    "url": "https://dailyhodl.com/2023/08/03/bank-of-america-ceo-forecasts-us-recession-in-early-2024-after-fed-hikes-rates-to-22-year-high/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Panicked-Fed-Crashing-Banks.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Panicked-Fed-Crashing-Banks.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Panicked-Fed-Crashing-Banks.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Panicked-Fed-Crashing-Banks.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Panicked-Fed-Crashing-Banks.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Panicked-Fed-Crashing-Banks.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Panicked-Fed-Crashing-Banks.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The US will most likely head into a slight recession early next year, according to Bank of America Chairman and CEO Brian Moynihan. In a new FOX Business interview, Moynihan says that the Federal Reserve&#8217;s late start to fighting inflation and subsequent aggressive interest rate hikes will probably cause a recession by Q1 of next [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/03/bank-of-america-ceo-forecasts-us-recession-in-early-2024-after-fed-hikes-rates-to-22-year-high/\">Bank of America CEO Forecasts US Recession in Early 2024 After Fed Hikes Rates to 22-Year High</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]