[
  {
    "source": "CoinDesk",
    "date": "2023-06-01T08:30:55.000Z",
    "title": "Crypto.com Receives Digital Token License in Singapore",
    "url": "https://www.coindesk.com/policy/2023/06/01/cryptocom-receives-digital-token-license-in-singapore/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The exchange received in-principle approval in Singapore last June."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-01T08:14:57.000Z",
    "title": "Crypto Exchange Kraken’s Canada Customer Deposits Rose 25% After Binance Announced Departure",
    "url": "https://www.coindesk.com/business/2023/06/01/crypto-exchange-krakens-canada-customer-deposits-rose-25-after-binance-announced-departure/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Kraken also saw a fivefold increase in app downloads within a week of OKX saying it was leaving the country back in March."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T08:29:03.000Z",
    "title": "Germany's Deutsche Telekom plugs in as Polygon validator",
    "url": "https://cointelegraph.com/news/deutsche-telekom-becomes-polygon-validator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/34b8cf86-be76-44b7-8501-adfc1a328e59.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The German telecommunications firm looks to leverage its infrastructure in Web3, plugging in as a network validator for Ethereum scaling protocol Polygon. </p>\n                    <p><p>One of Europe’s largest telecommunications companies uses its infrastructure to explore new revenue streams and boost network security as a validator for blockchain protocols.</p><p>Germany’s Deutsche Telekom is set to become a validator for Ethereum layer-2 scaling platform Polygon, becoming one of 100 validators providing staking and validation services for the network and Polygon’s Supernets solution.</p><p>Polygon <a href=\"https://cointelegraph.com/news/soaring-growth-of-ethereum-layer-2-networks-set-to-continue-in-2023\">has become an important layer 2</a> within the Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) ecosystem, offering developers a range of scaling solutions, including zero-knowledge rollups, sidechains and data availability protocols.</p><p><a href=\"https://cointelegraph.com/news/polygon-s-holy-grail-ethereum-scaling-zkevm-beta-hits-mainnet\"><strong><em>Related: Polygon’s ‘holy grail’ Ethereum-scaling zkEVM beta hits mainnet</em></strong></a></p><p>Deutsche Telekom MMS, which provides consulting and software development services, will operate as a Polygon validator for its parent company. This is expected to secure Polygon’s proof-of-stake sidechain and Supernets chain, improving security, governance, and decentralization of the protocols.</p><p>The firm will run a full node, produce blocks, validate and participate in consensus of the network as well as commit checkpoints to the Ethereum mainnet.</p><p>Dirk Röde, Deutsche Telekom’s Blockchain Solutions Center head, told Cointelegraph supporting the Polygon network as a validator is a big milestone in its aim to be an important player in Web3 infrastructure:</p><blockquote>“Deutsche Telekom is not only a renowned infrastructure provider for mobile and internet services but is also making significant commitments to expand its presence and reliability as an infrastructure provider in the web3 domain.”</blockquote><p>Deutsche Telekom is also a validator for Q, Flow, Celo, Chainlink, and Ethereum blockchains and Röde said the company aims to serve institutional clients as a reliable enterprise-grade staking provider.</p><p>Röde added that leveraging the company’s infrastructure as a validator while monetizing the native token of the underlying blockchain network provides Deutsche Telekom with a ‘dependable, novel and scalable source of income.’</p><p>The potential for more mainstream telecommunications companies moving into Web3 could also serve as a catalyst for greater decentralization of various proof-of-stake blockchains that are operated by validators:</p><blockquote>“Other telecommunications companies are also exploring opportunities in this domain. In a decentralized ecosystem it should be the goal to have a diverse and reliable validator set.</blockquote><p>A statement from Polygon Labs CEO Michael Blank reiterated this point, highlighting his belief that the partnership could pave the way for more mainstream businesses to embrace blockchain technology.</p><p>Polygon<a href=\"https://cointelegraph.com/news/google-cloud-to-optimize-polygon-zkevm-scaling-performance\"> recently announced</a> a multi-year partnership with Google Cloud to drive the development of the Ethereum scaling protocol’s zkEVM, zero-knowledge proof scaling solution. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ethereums-layer-2-zk-rollups-can-become-interoperable/\">Here’s how Ethereum’s ZK-rollups can become interoperable</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-01T08:30:27.000Z",
    "title": "Lula Proposes to Revitalize South America Union USAN; Reinforces Need of Shifting Away From US Dollar",
    "url": "https://news.bitcoin.com/lula-proposes-to-revitalize-south-america-union-usan-reinforces-need-of-shifting-away-from-us-dollar/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/raf03672-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Lula Proposes to Revitalize South America Union USAN; Reinforces Need of Shifting Away From US Dollar\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/raf03672-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/raf03672-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/raf03672-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/raf03672-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/raf03672-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/raf03672-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/raf03672-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Luiz Inacio &#8220;Lula&#8221; Da Silva, President of Brazil, remarked on the need to retake South American integration mechanisms through the Union of South American Nations (USAN). Lula also proposed to shift away from the U.S. dollar by using a standard reference currency for bilateral settlements among countries in the region. Brazil&#8217;s Lula Proposes to Unite [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T08:19:52.000Z",
    "title": "Gemini expands into UAE, pursuing crypto license amid positive regulator engagement",
    "url": "https://www.cryptopolitan.com/gemini-expands-into-uae/",
    "description": "Gemini, the cryptocurrency exchange founded by the Winklevoss twins, has made an exciting announcement regarding its expansion plans into the United Arab Emirates (UAE). In a blog post released on May 31, Gemini highlighted the increasing enthusiasm for cryptocurrencies among UAE citizens and the favorable conversations they have had with regulators in the country. These ... <a title=\"Gemini expands into UAE, pursuing crypto license amid positive regulator engagement\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gemini-expands-into-uae/\" aria-label=\"More on Gemini expands into UAE, pursuing crypto license amid positive regulator engagement\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T08:18:27.000Z",
    "title": "As Bittensor and SingularityNET Experience Steady Growth, New AI token InQubeta Surges in Popularity",
    "url": "https://www.crypto-news-flash.com/as-bittensor-and-singularitynet-experience-steady-growth-new-ai-token-inqubeta-surges-in-popularity/?utm_source=rss&utm_medium=rss&utm_campaign=as-bittensor-and-singularitynet-experience-steady-growth-new-ai-token-inqubeta-surges-in-popularity",
    "description": "<p>Cryptocurrencies have witnessed a significant resurgence in prices, primarily driven by the rapid growth of AI projects in 2023. Among the major beneficiaries of this trend are Bittensor and SingularityNET, two prominent platforms that have established themselves as key players in the AI industry.  Bittensor and SingularityNet Are Well Established Projects Bittensor has gained recognition [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/as-bittensor-and-singularitynet-experience-steady-growth-new-ai-token-inqubeta-surges-in-popularity/\">As Bittensor and SingularityNET Experience Steady Growth, New AI token InQubeta Surges in Popularity</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]