[
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T10:25:19.000Z",
    "title": "Bitcoin sails the seas: sailor paints giant 'B' on boat to promote crypto across the ocean",
    "url": "https://cointelegraph.com/news/bitcoin-sails-the-seas-sailor-paints-giant-b-on-boat",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/e5cf4bc7-3704-4a78-9ac4-d06bb0d73201.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A captain from Brussels took his passion for sailing and Bitcoin and set sail on his Sato Boat painting with a giant orange “B” to promote the cryptocurrency across the seas. </p>\n                    <p><p>There are some passions that are larger than life, some so expansive that they cover the seven seas. For Rémi, a captain from Brussels, this is the case. </p><p>Rémi discovered Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) in early 2021 and has been on a mission to combine this with his longtime love of sailing. Cointelegraph reporter Joe Hall met up with Rémi on his vessel which he calls the Sato Boat -short for Satoshi- to hear more about his nautical endeavors. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/4bac9749-0c72-4295-8e65-f0cfe6dcb5c3.png\"  /><figcaption style=\"text-align: center;\"><em>Sato Boat's sail with a massive Bitcoin logo painted on it. Source: Cointelegraph</em></figcaption></figure><p>He commented on his lifestyle by saying: </p><blockquote>“I am choosing to live out my two passions. One, the oldest one, is sailing, and the new one is Bitcoin. So I created this project by combining these two domains.”</blockquote><p>The Sato Boat captain explained that since spending an entire day painting a giant Bitcoin B on the sail of his boat, it has become a floating symbol for the cryptocurrency. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/ark-glassnode-propose-bitcoin-economic-analytics-framework-using-new-metric\"><strong><em>ARK, Glassnode propose Bitcoin economic analytics framework using new metric</em></strong></a></p><p>He told Cointelegraph that the B-adorned sail helps him promote Bitcoin adoption in boat races, on beaches and across the Atlantic Ocean, where he has sailed for the past 18 months. </p><blockquote>“The best thing about this project is meeting people everywhere: Portugal, Spain, France, UK and discussing Bitcoin, society or anything in their life.”</blockquote><p>According to his own estimates and from a lifetime estimate from Cointelegraph on the ground, thousands of people have been exposed to the giant “B” sailing across the seas. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/d4f21aa3-2d9e-4b4a-86e2-64e4024b0b41.png\"  /><figcaption style=\"text-align: center;\"><em>Cointelegraph reporter Joe Hall and Remi on board the Sato Boat. Source: Cointelegraph</em></figcaption></figure><p>Rémi remarked that in his opinion the best way to bring new people into the Bitcoin space is through art - even art that is flying from the mast of a ship. He also pointed out that this experience has helped him draw parallels between the ethos of Bitcoin and that of sailing. </p><blockquote>“It's a question of responsibility and independence. When you go sailing, you have to be autonomous, sometimes you encounter troubles and have to count on yourself. With Bitcoin, it's the same.”</blockquote><p>Around the world, Bitcoin enthusiasts have been finding innovative and intuitive ways to incorporate the currency into a way of life. In West Africa, <a href=\"https://cointelegraph.com/news/bitcoin-gains-traction-in-west-africa-with-educational-drive\">Bitcoin is gaining traction</a> with conferences, Bitcoin boutiques and more nodes coming online. </p><p>In the Cayman Islands, <a href=\"https://cointelegraph.com/news/bitcoin-backed-property-investment-becomes-new-avenue-for-cayman-islands-residency\">Bitcoin-backed property investment</a> has become a new avenue for long-term residency in the region. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/recursive-inscriptions-bitcoin-supercomputer-defi-aws-possible/\"><strong><em>Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T10:17:47.000Z",
    "title": "Tornado Cash developer Roman Storm released on bail, lawyer says",
    "url": "https://cointelegraph.com/news/tornado-cash-arrested-tornado-cash-developer-released-on-bail",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/bd2e97f8-60c4-497d-824e-03d6eb1ee501.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Roman Storm’s lawyer Brian Klein said the developer was released on bail on Aug. 24, the day after the U.S. DOJ announced the charges related to money-laundering and other alleged violations.</p>\n                    <p><p>Roman Storm, the co-founder of the cryptocurrency mixing service Tornado Cash who was arrested on money-laundering and other charges on Aug. 23,  was released on bail soon after he was detained by the United States’ Department of Justice (DOJ), his lawyer said.</p><p>Storm’s lawyer Brian Klein took to X (formerly Twitter) on Aug. 24 to <a href=\"https://twitter.com/brianeklein/status/1694779420731658700?s=20\" target=\"_blank\" rel=\"noopener nofollow\">announce</a> that Storm has been released on bail.</p><p>Klein noted that he still remains “very disappointed” about the fact that the prosecutors charged the developer just because he helped to develop software. He added:</p><blockquote>“Their novel legal theory has dangerous implications for all software developers.”</blockquote><p>The bail came the next day after the U.S. DOJ announced the arrest of Storm alongside the <a href=\"https://cointelegraph.com/news/tornado-cash-co-founders-charged-with-money-laundering-sanctions-violations-ofac\">charges against Tornado Cash founders</a>, Storm and Roman Semenov, on Aug. 23.</p><p>The U.S. authority specifically charged the developers with operating the Tornado Cash services and allegedly laundering more than $1 billion in “criminal proceeds.” Additional charges are related to “conspiracy to commit sanctions violations,” as well as “conspiracy to operate an unlicensed money transmitting business.”</p><p>Storm’s lawyer Klein did not immediately respond to Cointelegraph’s request for comment.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/tornado-cash-lawsuit-judge-sides-treasury-request-summary-judgement\"><strong><em>Tornado Cash lawsuit judge sides with US Treasury in motions for summary judgment</em></strong></a></p><p>The latest news comes roughly a year after the U.S. Treasury Department <a href=\"https://cointelegraph.com/news/us-treasury-sanctions-usdc-and-eth-addresses-connected-to-tornado-cash\">added Tornado Cash-related addresses to the list</a> of Specially Designated Nationals of the Office of Foreign Asset Control. Subsequently, authorities in the Netherlands arrested another Tornado Cash developer, <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/alexey-pertsev\">Alexey Pertsev</a>. The developer was <a href=\"https://cointelegraph.com/news/tornado-cash-dev-alex-pertsev-set-to-be-released-from-prison-under-surveillance\">released from jail</a> in April 2023, after spending nearly nine months in prison.</p><p>Pertsev and Storm are not the only prosecuted developers related to Tornado Cash, though. Another co-founder, Roman Semenov, was added in the OFAC’s list of Specially Designated Nationals and Blocked Persons on Aug. 23 as well. The developer remains at large.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-did-the-nsa-create-bitcoin/\"><strong><em>Big Questions: Did the NSA create Bitcoin?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-25T10:30:10.000Z",
    "title": "Palau’s Stablecoin Audit Process Advances",
    "url": "https://news.bitcoin.com/palaus-stablecoin-audit-process-advances/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1848946249-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Palau&#039;s Stablecoin Audit Process Advances\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1848946249-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1848946249-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1848946249-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1848946249-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1848946249-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1848946249-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1848946249.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Palau&#8217;s Ripple-backed stablecoin pilot audit process is advancing, with the Ministry of Finance collaborating with auditors and turning in more than 200 documents for review. Jay Hunter Anson, a Palau Ministry of Finance member, explained he was ready to show auditors that every transaction can be traced thanks to the public ledger tech. Palau&#8217;s Ministry [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T10:12:27.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-25T10:15:23.000Z",
    "title": "Prime Trust’s parent company reports $8m loss due to TerraUSD investments",
    "url": "https://crypto.news/prime-trusts-parent-company-reports-8m-loss-due-to-terrausd-investments/",
    "description": "Prime Core Technologies, the parent entity of crypto custodian Prime Trust, reports an $8 million shortfall from TerraUSD investments. The loss was disclosed in an Aug. 24 filing with the Bankruptcy Court for the District of Delaware in the United States. The&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T10:30:07.000Z",
    "title": "Cathie Wood’s ARK Invest Joins Ethereum Futures ETF Race After Spot Bitcoin ETF Delay",
    "url": "https://www.newsbtc.com/news/ethereum/ark-invest-ethereum-futures-etf/",
    "description": "The US Securities and Exchange Commission (SEC) had on August 11 moved to delay its decision on the ARK 21Shares Spot Bitcoin ETF application. Following this, Cathie Wood’s ARK Invest and 21 Shares has moved to apply for a separate Ethereum futures ETF in what many may consider a double-barreled approach for these firms.  ARK Invest Joins Ethereum Futures ETF Race According to a filing with the SEC on August 24, ARK Invest and 21 Shares will act as sub-adviser and sub-sub-adviser respectively, on two separate funds that seek to invest in Ethereum futures contracts. These include the ARK 21Shares Active Ethereum Futures ETF on the one hand and Bitcoin and Ethereum futures contracts ARK 21Shares Active Bitcoin Ethereum Strategy ETF on the other hand. Related Reading: Here’s Why Arthur Hayes Is Not In Support Of A BlackRock Spot Bitcoin ETF This won’t be the first time ARK Invest and 21 Shares are partnering together to offer an ETF, as they had on different occasions jointly applied to offer a Spot Bitcoin ETF, with the most recent application delayed by the SEC. If approved, the ARK 21Shares Active Ethereum Futures ETF (with ticker ARKZ) will invest in a “portfolio of ether futures contracts.” This will include futures contracts traded on regulated commodity exchanges like the Chicago Mercantile Exchange (CME).  The fund is focused on futures contracts and would not directly invest in Ether or have any direct exposure to the “spot” Ether. Futures ETFs are known only to track the underlying asset&#8217;s performance, while Spot ETFs involve direct investment in the asset. Furthermore, the document noted that the fund’s remaining assets would be put into short-term cash instruments like US Treasury securities, money market instruments, and repurchase agreements. These investments will serve as a way to shore up the fund’s liquidity and hedge against its investments in Ether futures. Meanwhile, ARK Invest and 21 Shares are also looking to offer the ARK 21Shares Active Bitcoin Ethereum Strategy ETF (with ticker ARKY). This fund will invest in both Bitcoin and Ethereum futures contracts. Interestingly, this is similar to what Valkyrie was trying to do when it applied to the SEC to include ETH futures contracts as part of its Valkyrie Bitcoin Strategy ETF (BTF). According to the filing, there will be an “Active Bitcoin Futures ETF” and “Active Ethereum Futures ETF” known together as the “Underlying ETFs” under the fund. That will suggest that this fund is a two-in-one approach whereby there will be a standalone investment in Bitcoin futures and another for Ethereum futures.  The remaining net assets of the fund will be allocated to cash or cash equivalents with a primary focus on US government securities. ETH price recovers amid high interest from institutional investors &#124; Source: ETHUSD on Tradingview.com Bullish Or Something Else? Several traditional finance institutions have filed to offer a crypto ETF (both futures and spot). Some of these firms, including ARK Invest and Grayscale, have filed to offer both futures and spot ETFs. As such, it raises questions about whether these firms are truly bullish on the crypto space or whether other factors are involved. Related Reading: The $20 Billion Delay: Appeal Court Pushes Back Decision On Grayscale Spot Bitcoin ETF Nate Geraci, the President of ETF Store, pointed out that the total BTC futures ETF market is valued at less than $1.5 billion in Assets Under Management (AuM). So, it might not be profitable, especially for those looking to enter the market.  However, if the market doesn’t provide many profits for these firms, why are they looking to gain crypto exposure at all costs?  Former BitMEX CEO Arthur Hayes, for one, stated that these firms are simply looking to become the “gatekeepers” of crypto in a bid to balance their deposit base. He doesn’t believe that these firms are bullish on the fundamentals of the crypto industry and are simply to make maximum profits when cryptocurrencies disrupt the economy. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-25T10:21:17.000Z",
    "title": "ICP, AXS May Experience Price Breakouts in the Next Few Weeks",
    "url": "https://coinedition.com/icp-axs-may-experience-price-breakouts-in-the-next-few-weeks/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Internet Computer (ICP), the leading metaverse token added to its lead over the rest of the cryptocurrencies in this sector during the past 24 hours. Technical indicators on the altcoin’s daily chart suggested that a bullish breakout may be on the cards for ICP within the coming two weeks, which will likely extend its lead [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/icp-axs-may-experience-price-breakouts-in-the-next-few-weeks/\">ICP, AXS May Experience Price Breakouts in the Next Few Weeks</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]