[
  {
    "source": "Cointelegraph",
    "date": "2023-12-07T18:02:20.000Z",
    "title": " SEC discussing ‘key technical details’ with spot crypto ETF applicants: Report ",
    "url": "https://cointelegraph.com/news/sec-technical-details-spot-crypto-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMDRhMTUzZTItYzFmNS00NDA1LTk2NTItMWMyYTE1NDYzNWYyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>In November, the commission separately met with representatives of BlackRock and Grayscale to discuss their spot crypto exchange-traded funds.</p>\n                    <p><p>Officials with the United States Securities and Exchange Commission are reportedly discussing aspects of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds, or ETFs, proposed by asset managers.</p><p>According to a Dec. 7 Reuters report, industry insiders <a href=\"https://www.reuters.com/technology/us-bitcoin-etf-issuer-talks-with-sec-have-advanced-key-details-sources-2023-12-07/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the SEC and certain asset managers were discussing “key technical details” related to U.S. exchanges listing shares of a spot Bitcoin ETF. To date, the commission has never given the green light to any spot cryptocurrency exchange-traded product, instead <a href=\"https://cointelegraph.com/news/sec-deadline-grayscale-spot-ethereum-etf\">postponing decisions on applications</a> for the maximum allowable time.</p><p>Memos released by the SEC in November showed the commission separately <a href=\"https://cointelegraph.com/news/blackrock-sec-spot-bitcoin-etf-discussion\">met with representatives of BlackRock</a> and Grayscale. Both asset managers and Hashdex, ARK 21Shares, Invesco Galaxy, VanEck and Fidelity have filed for spot BTC or Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) ETF listings.</p><p><a href=\"https://cointelegraph.com/news/sec-technical-details-spot-crypto-etf\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-07T17:44:58.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices to consider when investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-07T18:06:59.000Z",
    "title": "Crypto analyst sees XRP as a potential market driver",
    "url": "https://crypto.news/crypto-analyst-sees-xrp-as-a-potential-market-driver/",
    "description": "This analyst believes alternatives like Cardano and Polkadot are now far more ready for adoption than last cycle as congestion grows on Ethereum"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-07T17:52:13.000Z",
    "title": "BNB’s failure to capitalize the crypto rally reflects Binance’s troubles",
    "url": "https://crypto.news/bnbs-failure-to-capitalize-the-crypto-rally-reflects-binances-troubles/",
    "description": "Despite the significant rally across the crypto market, Binance's BNB is down by nearly 5% in a month. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-07T18:00:17.000Z",
    "title": "Cardano Could See 70% Rally To $0.75, Analyst Predicts When",
    "url": "https://www.newsbtc.com/news/cardano/cardano-rally-0-75-late-december-analyst-explains/",
    "description": "An analyst has explained how Cardano may be heading towards a rally to $0.75 soon if the historical pattern is anything to refer to. Cardano Could See A Rally Of Over 70% In The Near Future As explained by analyst Ali in a post on X, ADA currently appears to be mirroring the same pattern as that between 2018 and 2020. Below is the chart shared by the analyst, which points out this similarity. Looks like ADA might be heading towards a break &#124; Source: @ali_charts on X From the graph, it&#8217;s visible that ADA had been in a phase of consolidation inside a channel back between 2018 and 2020, and it would appear that the asset has been ranging in a similar fashion recently as well. There is one dissimilarity present between the two patterns, however, and that is the presence of the COVID-19 crash. This price plunge below the consolidation channel only happened because of the emergence of an anomaly in the form of the virus, though, so it might be safe to ignore it in the grand scheme of things. Related Reading: Is Bitcoin Overvalued Yet? What Historical Data Suggests Cardano has recently observed a rally towards the upper end of the channel and the cryptocurrency is now trying to break out of it. Back during the previous consolidation period, a similar break took place, and it ended up leading to a very significant uplift for the cryptocurrency. &#8220;If this pattern holds, we could see ADA punching through the $0.45 resistance soon,&#8221; notes Ali. As for what trajectory the asset would follow after this break, the analyst thinks that a rally towards the $0.75 level could potentially happen by &#8220;late December.&#8221; From the current spot price, such a surge would mean an increase of more than 70% for Cardano. If the previous instance of the trend is anything to refer to, though, the rally would perhaps not end at just these gains, as ADA in fact eventually ended up registering a total increase of almost 3000% in the bull run that followed then. The on-chain analytics firm Santiment also discussed about ADA yesterday, revealing a possible instigator behind the latest price uptrend in the asset. The relevant metric here is the total number of ADA addresses carrying some amount of balance. The below chart shows how this indicator&#8217;s value has changed over the last few months: The value of the indicator appears to have registered some drawdown recently &#124; Source: Santiment on X As displayed in the chart, the total number of Cardano wallets observed a sharp decrease last month and what occurred alongside it was a rally in the price. In recent days, another decline in the indicator has taken place, although the scale is much smaller this time around. Related Reading: Tether (USDT) Cap Approaches $90 Billion: Why This Affects Bitcoin &#8220;Typically, declining wallets is a sign of small holders capitulating &#38; selling to whales at a loss,&#8221; explains the analytics firm. ADA has observed an increase in the past few days, so it&#8217;s possible that this effect may be in action once more. ADA Price Cardano has again been rejected from the $0.45 resistance mark as its price has pulled back to $0.43 since the retest. ADA has been going up during the past few days &#124; Source: ADAUSD on TradingView Featured image from Traxer on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-07T18:00:10.000Z",
    "title": "Why Bitcoin’s Staggering 260% YTD Surge Could Be Just The Start",
    "url": "https://www.newsbtc.com/bitcoin-news/why-bitcoins-staggering-260-ytd-surge-could-be-just-the-start/",
    "description": "The price of Bitcoin slowed down its ascend following a week of smashing critical resistance levels. However, the rally is likely in its early stages, with BTC preparing to see further profits in the coming months. Related Reading: Bitcoin Shakeout Drives $190 Million In Losses For Over 81,000 Traders As of this writing, the cryptocurrency trades at $43,300, reclaiming levels last seen in 2022 before the crash to its yearly lows. In the weekly chart, BTC records a 15% rally, with Ethereum following the trend while other altcoins lagged behind the two most prominent cryptocurrencies. Spot Bitcoin Jumps 15% In December, Eyes On Potential SEC Approval The crypto market has witnessed another remarkable surge in Bitcoin (BTC), with a 15% increase in just the first week of December. According to QCP Capital&#8217;s latest market update, this growth takes BTC&#8217;s year-to-date (YTD) gain to 260%. This exponential rise is primarily attributed to the anticipation surrounding the approval of a spot Bitcoin Exchange-Traded Fund (ETF) by the U.S. Securities and Exchange Commission (SEC). On December 1st, the SEC announced that January 5th, 2024, will be the final deadline for rebuttal comments. This timeline sets the stage for probable approval in the week following. Although QCP Capital humorously notes that the significance of the 15th anniversary of Bitcoin&#8217;s Genesis block on January 3rd, 2024, might be lost on the SEC, the &#8220;market has certainly taken note.&#8221; As Bitcoin nears the $45,000 mark leading up to the expected announcement, investors are weighing how much of this news has already been priced. The post-ETF approval period will be critical, as the real impact depends on the actual flows from the ETF in its initial trading weeks. A &#8216;sell-the-news&#8217; event is possible next year if expectations don&#8217;t match reality. Asian Buyers Re-Enter Market, When Altcoin Season? The December 1st announcement has also spurred renewed interest from Asian buyers, who had been less active in the preceding month. Notably, most of the recent spot gains have occurred during U.S. trading hours as investors in the country take positions in preparation for the SEC announcement. As the market prepares for the launch of the spot ETF, investors won&#8217;t find themselves short of options. With 13 applications for spot ETFs and several others for leveraged and options-based ETFs in the pipeline, the traditional finance ecosystem surrounding BTC (and soon ETH) is poised for significant expansion. QCP Capital anticipates that in a market characterized by low costs and tight spreads, structured products might emerge as a key asset class for generating alpha, similar to other markets like gold. The trading desk noted: This means that should spot BTC top on launch day itself, it will not stop the Traditional Finance ecosystem boom around BTC, and soon ETH – the likes of which we have been writing about for years now. Related Reading: Apollo Crypto Predicts Bitcoin Price Of $200,000 This Cycle, Here’s Why A report from the Glassnode co-founders indicates that the altcoin sector is already trying to catch up with the current BTC price action. The current pullback could provide an opportunity for smaller coins waiting to benefit from the bullish momentum. How much longer will altcoins trail behind before making their move? 🚀🔮 📈 The Bitcoin narrative continues to steer the ship, but a closer look reveals the total altcoin market cap playing catch-up. 🚀 With Ethereum and BTC leading the way, we are potentially on the brink of… pic.twitter.com/KC1QdWmnlE — 𝗡𝗲𝗴𝗲𝗻𝘁𝗿𝗼𝗽𝗶𝗰 (@Negentropic_) December 7, 2023  Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-07T17:55:07.000Z",
    "title": "Coinbase Wallet Unveils Global USDC Transfers via WhatsApp, Telegram, Facebook and Other Social Media Apps",
    "url": "https://dailyhodl.com/2023/12/07/coinbase-wallet-unveils-global-usdc-transfers-via-whatsapp-telegram-facebook-and-other-social-media-apps/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/coinbase-wallet-global-usdc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/coinbase-wallet-global-usdc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/12/coinbase-wallet-global-usdc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/coinbase-wallet-global-usdc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/coinbase-wallet-global-usdc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/coinbase-wallet-global-usdc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/12/coinbase-wallet-global-usdc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Top US-based crypto exchange Coinbase is unveiling instant global transfers of the stablecoin USDC via social media apps. In a new blog post, Coinbase says that users of its crypto wallet can now instantly send money across the world without having to deal with the complexities of bank transfers. According to Coinbase, the money can [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/07/coinbase-wallet-unveils-global-usdc-transfers-via-whatsapp-telegram-facebook-and-other-social-media-apps/\">Coinbase Wallet Unveils Global USDC Transfers via WhatsApp, Telegram, Facebook and Other Social Media Apps</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]