[
  {
    "source": "CoinDesk",
    "date": "2023-09-29T13:10:20.000Z",
    "title": "First Mover Americas: Circle Argues Stablecoins Aren’t Securities in Response to SEC’s Binance Lawsuit  ",
    "url": "https://www.coindesk.com/markets/2023/09/29/first-mover-americas-circle-argues-stablecoins-arent-securities-in-response-to-secs-binance-lawsuit/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for Sept. 29, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-29T13:31:33.000Z",
    "title": "Get Paid to Train AI? There’s a New Cryptocurrency for That",
    "url": "https://decrypt.co/199332/get-paid-train-ai-theres-new-cryptocurrency-that",
    "description": "Ta-Da will soon offer a native token for data contributions, introducing a new model for training artificial intelligence."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-29T13:13:35.000Z",
    "title": "CoinShares says US not lagging in crypto adoption and regulation",
    "url": "https://cointelegraph.com/news/crypto-coinshares-united-states-not-lagging-adoption-regulation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/db1c6475-a986-42b1-bb7c-ec3a35688c86.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>CoinShares, a provider of crypto exchange-traded products in Europe, is optimistic about spot Bitcoin ETFs in the United States.</p>\n                    <p><p>European cryptocurrency investment firm CoinShares is optimistic about cryptocurrency regulation in the United States as the firm enters the new market.</p><p>On Sept. 22, CoinShares officially announced the launch of its new division, CoinShares Hedge Fund Solutions, marking the <a href=\"https://cointelegraph.com/news/crypto-investment-coinshares-us-investors\">first time the firm introduce its offerings</a> to qualified U.S. investors.</p><p>CoinShares’ entrance into the U.S. market comes at a time when many U.S. crypto firms are looking at expanding their businesses outside the country due to regulatory hurdles at home. One such firm, cryptocurrency exchange Coinbase, has been actively <a href=\"https://cointelegraph.com/news/coinbase-ceo-slams-chase-uk-for-totally-inappropriate-crypto-move\">pushing expansion in Europe and the United Kingdom</a> amid facing a lawsuit from the U.S. Securities and Exchange Commission over an alleged violation of securities laws.</p><p>Many crypto industry observers and participants have claimed that the U.S. government's approach to crypto regulation has been <a href=\"https://cointelegraph.com/news/bipartisan-support-crypto-regulation-attractive-to-firms-moodys\">making the country “less attractive” for crypto firms</a>.</p><p>But unlike many U.S. crypto regulation critics, CoinShares believes that the U.S. is a global leader in terms of digital asset development, a spokesperson for CoinShares told Cointelegraph, stating:</p><blockquote>“Contrary to the belief that the U.S. lags in crypto adoption and regulation, our perspective is shaped by the U.S. regulators' approach to treating digital assets akin to traditional asset classes. This stance, we believe, will encourage and expedite the fusion of the two industries.”</blockquote><p>CoinShares’ representative went on to say that the U.S. is home to 50% of globally managed assets and is a dominant financial market. “Our assertion on its leadership in the digital assets space is influenced by observable integrations between legacy and emerging financial players,” the spokesperson said, citing industry collaborations of BlackRock with Circle and Coinbase.</p><p>The expansion of CoinShares in the U.S. comes just a few months after CEO ​​Jean-Marie Mognetti in July 2023 <a href=\"https://www.cityam.com/heres-an-inconvenient-truth-for-europe-the-us-will-dominate-the-digital-asset-arena/\" target=\"_blank\" rel=\"noopener nofollow\">declared</a> that Europe’s approach to crypto has been “even more problematic when compared to the financial might of U.S. institutions.”</p><p>“These financial behemoths — such as BlackRock and Fidelity, who each announced recently the filing of a spot Bitcoin ETF — are well-positioned to provide widespread crypto exposure,” Mognetti wrote in an op-ed a few months ago.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-delays-spot-bitcoin-etfs-blackrock-bitwise-valkyrie-invesco\"><strong><em>SEC delays spot Bitcoin ETF decision for BlackRock, Invesco and Bitwise</em></strong></a></p><p>But while being specifically bullish about the crypto regulatory climate in the United States, CoinShares continues to be loyal to Europe. “CoinShares remains committed to Europe; our HFS is registered both in the U.S. and the United Kingdom,” the spokesperson for the firm told Cointelegraph, adding:</p><blockquote>“Our perspective stems from the observation that in the US, there is a more apparent merging of traditional finance — TradFi — and crypto, which isn't as pronounced in Europe where the two sectors aren't as interconnected.”</blockquote><p>One of the world’s largest crypto investment firms, CoinShares is a major provider of crypto exchange-traded products or ETPs. The firm debuted its first Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded product (ETP) in 2015. CoinShares is yet to disclose whether it plans to join the spot Bitcoin ETF race in the United States, though.</p><p>“We must adhere to strict regulations regarding the disclosure of forward-looking information. Therefore, we cannot provide specific details on CoinShares' future product launches,” CoinShares representative stated. CoinShares has been registered with the SEC as an exempt reporting adviser, with CoinShares Limited acting as general partner for the private investment funds created by CoinShares Hedge Fund Solutions.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Magazine: Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-29T13:32:32.000Z",
    "title": "Bitcoin Price Analysis:  Regaining Some Rapidly Lost Advances – 29 September 2023",
    "url": "https://cryptodaily.co.uk/2023/09/bitcoin-price-analysis-regaining-some-rapidly-lost-advances-29-september-2023",
    "description": "Bitcoin (BTC/USD) remained volatile early in the Asian session as the pair orbited the 26526 area during a recovery, a recent level where selling pressure intensified following downward activity around the 26731 area."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-29T13:30:04.000Z",
    "title": "Gold Hits Nine-Month Low as Bitcoin Climbs Amid Hawkish Fed Stance",
    "url": "https://news.bitcoin.com/gold-hits-nine-month-low-as-bitcoin-climbs-amid-hawkish-fed-stance/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/goldbtc-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Gold Hits Nine-Month Low as Bitcoin Climbs Amid Hawkish Fed Stance\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/goldbtc-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/goldbtc-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/goldbtc-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/goldbtc-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/goldbtc-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/goldbtc-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/goldbtc.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Gold prices are wrapping up the week by plummeting to a nine-month low, with the price per ounce descending to $1,858 on Thursday. Transitioning into Friday, gold is changing hands at $1,870 per ounce, marking a decline of 2.8% over the trailing five days. Concurrently, bitcoin (BTC) prices leaped on Thursday, and have ascended by [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T13:27:36.000Z",
    "title": "Gemini halts Dutch operations amid strict DNB regulations",
    "url": "https://www.cryptopolitan.com/gemini-halts-dutch-operations/",
    "description": "Gemini cryptocurrency exchange has recently decided to suspend operations in the Netherlands, effective November 17, 2023. This decision directly results from the stringent crypto regulations imposed by De Nederlandsche Bank (DNB), the Dutch central bank. This move follows a similar exit by Binance earlier this year, marking a trend of operational halts within the country’s ... <a title=\"Gemini halts Dutch operations amid strict DNB regulations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gemini-halts-dutch-operations/\" aria-label=\"More on Gemini halts Dutch operations amid strict DNB regulations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T13:10:09.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-29T13:18:53.000Z",
    "title": "Paris museum to mint Van Gogh’s NFTs on Tezos",
    "url": "https://crypto.news/paris-museum-to-mint-van-goghs-nfts-on-tezos/",
    "description": "A Paris art museum announced an NFT collection dedicated to Van Gogh to launch alongside the upcoming exhibition of the artist's artwork"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-29T13:16:26.000Z",
    "title": "SEC Delays Decision on Spot Bitcoin ETFs for BlackRock, Invesco, and Bitwise Amid Government Shutdown Uncertainty",
    "url": "https://www.crypto-news-flash.com/sec-delays-decision-on-spot-bitcoin-etfs-for-blackrock-invesco-and-bitwise-amid-government-shutdown-uncertainty/?utm_source=rss&utm_medium=rss&utm_campaign=sec-delays-decision-on-spot-bitcoin-etfs-for-blackrock-invesco-and-bitwise-amid-government-shutdown-uncertainty",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Mark-Van-Scyoc-SEC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Mark-Van-Scyoc-SEC.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Mark-Van-Scyoc-SEC-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Mark-Van-Scyoc-SEC-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Mark-Van-Scyoc-SEC-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The US SEC has delayed its decision on the Bitcoin ETF application from BlackRock, Invesco, others. With looming government shutdown, timeline for the approval is now prolonged. One more time, the United States Securities and Exchange Commission (SEC) has moved to delay a decision on the spot Bitcoin (BTC) Exchange Traded Fund (ETF) applications made [...]"
  }
]