[
  {
    "source": "CoinDesk",
    "date": "2023-07-07T00:54:04.000Z",
    "title": "Kraken Co-Founder Jesse Powell Under Federal Investigation on Claims of Hacking, Cyberstalking Non-Profit",
    "url": "https://www.coindesk.com/policy/2023/07/07/kraken-co-founder-jesse-powell-under-fbi-investigation-on-claims-of-hacking-cyberstalking-non-profit/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The agency searched the Los Angeles home of Jesse Powell as it probes whether he had interfered with computer accounts of the non-profit. A lawyer for Powell said he's done \"nothing wrong\" and that the matter does not touch on his crypto interests."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-07T01:00:22.000Z",
    "title": "Ripple vs SEC: No Money For Years, XRP Holders Lose If SEC Wins, Says John Deaton",
    "url": "https://www.newsbtc.com/analysis/xrp/ripple-vs-sec-no-money-for-years-xrp-holders-lose-if-sec-wins-says-john-deaton/",
    "description": "John Deaton, a pro-XRP lawyer, recently made some statements regarding the ongoing legal battle between Ripple and the U.S. Securities and Exchange Commission (SEC). Deaton believes that if Ripple loses to the SEC, no money may be collected for years, and only if Ripple loses on appeal.  However, he also believes that if the Supreme Court takes on the appeal, which he thinks they will if Congress hasn&#8217;t acted by then, Ripple will win hands down. Ripple Legal Troubles Could Linger For Years Deaton&#8217;s view is that if the SEC wins, Ripple will appeal, and the current status quo will continue for the next 2-5 years. Deaton emphasized: Assuming the SEC wins and the civil case lawyers get a win because the judge in California follows Judge Torres&#8217; ruling, Ripple will appeal that case as well, and there will be no money for years, if ever.  In such a scenario, if Ripple loses all the appeals, the SEC would collect the money, not the civil plaintiffs. The SEC would then offer a payback fund for XRP holders to sell their XRP, as in Veritaseum. The Veritaseum and the ongoing Ripple cases are similar in that they both involve allegations of unregistered securities offerings in the cryptocurrency industry.  Related Reading: Glassnode Co-Founder Predicts Bull Run For Bitcoin Amidst Sideways Trading In the Veritaseum case, the SEC alleged that Veritaseum and its founder, Reginald Middleton, conducted an unregistered initial coin offering (ICO) that raised approximately $14.8 million. Similarly, in the Ripple case, the SEC alleged that Ripple conducted an unregistered securities offering by selling XRP to investors. After the Veritaseum case was concluded, the SEC set up a Fair Fund to distribute the funds collected from the defendants to investors harmed by the unregistered securities offering. The Fair Fund enabled investors who participated in the Veritaseum ICO to apply for a refund of their investment. This development could serve as a precedent for how the SEC may proceed with the Ripple case if it successfully proves that XRP constitutes a security. In such a scenario, the SEC may similarly establish a Fair Fund to compensate investors who purchased XRP during the unregistered securities offering.  XRP Holders Can Continue To Believe Their Assets Are Not Securities Furthermore, Deaton argued that being on the “75K list”- a list of over 75,000 XRP holders named as potential &#8220;intervenors&#8221; &#8211; is a good thing because a massive putative class of XRP holders is easily identifiable.  By joining the class list he put out, no one waived anything whatsoever, and if there were ever any money for XRP holders from the civil case or the SEC case, he would likely be contacted because he has the list of the &#8220;75K.&#8221; The list&#8217;s purpose is to allow these XRP holders to potentially seek reimbursement or other relief if the SEC&#8217;s case against Ripple results in a judgment or settlement that impacts the value of XRP. By joining the list, these individuals are indicating that they believe XRP is not a security and that they should be allowed to participate in any proceedings related to the case. Additionally, Deaton advises ignoring the people who claim that joining the 75K list and arguing XRP isn&#8217;t a security is a bad thing if there is one day a monetary recovery for XRP holders.  Related Reading: Ethereum Whale Transfers Over 25,000 ETH To Exchange: Massive Dip On The Horizon? Overall, Deaton believes that the civil case may not lead to anything. If the SEC wins, it would collect the most money and offer the best option, “ironically.”  Also, if Ripple loses and Congress fixes this regulatory mess during the 5 years of appeals, it all “goes away anyway”, according to the pro-XRP Lawyer.  Featured image from Unsplash, chart from TradingView.com "
  }
]