[
  {
    "source": "Cointelegraph",
    "date": "2023-12-05T13:18:54.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p >A United States Securities and Exchange Commission (SEC) filing revealed that BlackRock received $100,000 in seed capital from an unnamed investor for its spot Bitcoin exchange-traded fund (ETF). </p><h2 >BlackRock received $100,000 in seed funds for Bitcoin ETF — SEC filing</h2><p >The world’s largest asset manager, BlackRock, <a href=\"https://cointelegraph.com/news/blackrock-100-k-seed-fund-for-bitcoin-etf-sec-filing\">received $100,000 in seed funding</a> from an unknown investor for its spot Bitcoin ETF in October 2023, a recent filing showed.</p><p >The SEC filing revealed that the investor agreed to purchase 4,000 shares for $100,000 on Oct. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This is so interesting in the nerdiest way.</p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1731853593995579736?ref_src=twsrc%5Etfw\">December 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p >The latest filing by BlackRock also revealed certain details on the asset manager’s plans to pay the sponsor’s fee, where it plans to borrow Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) or cash as trade credit from the trade credit lender on a short-term basis. </p><h3 >Coinbase, Marathon, Riot surge over 300% in 2023 as Bitcoin pumps</h3><p >Publicly traded crypto firms have <a href=\"https://cointelegraph.com/news/crypto-stocks-marathon-coinbase-riot-surge-as-bitcoin-passes-42000\">notched up to triple-digit percentage returns</a> in 2023 and closed in the green on Dec. </p><p >Crypto exchange Coinbase (COIN) closed the day at just over $141 with a 5.5% gain, up 320% from its price at the start of the year, per Google Finance data.</p><p >Bitcoin miners Marathon Digital (MARA) and Riot Platforms (RIOT) closed the day with over 8% gains, recording 337% and 345% year-to-date (YTD) gains, respectively.</p><figure ><img src=\"https://s3.cointelegraph.com/uploads/2023-12/a0be7e42-35d1-45bc-82e3-995ccb1bd21a.PNG\"  /><figcaption style=\"text-align: center;\"><em>A visual map of the one-day price of S&amp;P 500 stocks shows mixed results on Dec. 4 Source: Finviz</em></figcaption></figure><p >Crypto investment firm Galaxy Digital Holdings (GLXY) posted a daily gain of nearly 12% and is up 155% YTD and MicroStrategy (MSTR) — with the largest Bitcoin holdings of any public company valued at over $6.6 billion — saw a daily gain of over 6.5% and a YTD rise of 288%.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-05T13:25:20.000Z",
    "title": "Bitcoin miner Phoenix Group makes $2.47B trading debut in Abu Dhabi rising 50%",
    "url": "https://cryptoslate.com/bitcoin-miner-phoenix-group-makes-2-47b-trading-debut-in-abu-dhabi-rising-50/",
    "description": "<p>Middle East-based Bitcoin (BTC) miner Phoenix Group became the first crypto-related firm to go public on the Abu Dhabi Securities Exchange (ADX) today, Dec. 5, according to a post on social media platform X (formerly Twitter). The miner was initially scheduled to go public on Dec. 4 but shifted its debut to today after the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-miner-phoenix-group-makes-2-47b-trading-debut-in-abu-dhabi-rising-50/\">Bitcoin miner Phoenix Group makes $2.47B trading debut in Abu Dhabi rising 50%</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-12-05T13:11:05.000Z",
    "title": "Solana ($SOL) Co-Founder Anatoly Yakovenko Highlights DeFi as Crypto’s Most Significant Innovation",
    "url": "https://www.cryptoglobe.com/latest/2023/12/solana-sol-co-founder-anatoly-yakovenko-highlights-defi-as-cryptos-most-significant-innovation/",
    "description": "Introduction to DeFi’s Significance in Crypto Anatoly Yakovenko, a co-founder of Solana (SOL), has recently shed light on what he considers the most significant innovation in the cryptocurrency industry: decentralized finance (DeFi). In a conversation with macro analyst Raoul Pal, Yakovenko emphasized DeFi’s paramount importance, describing it as the pinnacle of crypto’s contributions to the […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-05T13:12:38.000Z",
    "title": "Bitcoin’s bull rally halts at $42K – But why?",
    "url": "https://www.cryptopolitan.com/bitcoins-bull-rally-halts-at-42k-but-why/",
    "description": "This week began on a high note, with the Bitcoin price surging beyond $42,000 on Monday, December 4. However, Bitcoin has entered a stage of consolidation and is currently trading at $41,639 with a $814 billion market cap. Bitcoin brushed off a global market decline during a rise to a more than 19-month high, indicating ... <a title=\"Bitcoin&#8217;s bull rally halts at $42K &#8211; But why?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoins-bull-rally-halts-at-42k-but-why/\" aria-label=\"More on Bitcoin&#8217;s bull rally halts at $42K &#8211; But why?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-05T13:30:17.000Z",
    "title": "Shiba Inu Set To Establish A New Era For Shibarium Burns",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-set-to-establish-a-new-era-for-shibarium-burns/",
    "description": "Popular blockchain project Shiba Inu has revealed a new era of token burns for its Ethereum-based layer 2 blockchain solution, Shibarium. Shiba Inu Unveils Latest Burning Mechanism On Monday, December 4, Shiba Inu announced a fresh set of burning techniques to increase the ecosystem token&#8217;s value. According to the announcement, the team described the new mechanism as a &#8220;transformative&#8221; move, crucial for the network&#8217;s economic model.  Related Reading: Shiba Inu Burn Rate Soars Over 3,000% – What’s The Impact On Price? The purpose of this technique is to intentionally reduce the token supply in order to increase the value of SHIB and its ecosystem. The announcement read: Shibarium is introducing a transformative token burning mechanism, crucial for the network&#8217;s economic model. This mechanism is designed to reduce token supply strategically, potentially increasing the token&#8217;s value and benefiting its ecosystem. The burn mechanism has been divided into two distinct phases. These include the Manual phase and the Automated Transition phase. The Manual phase will see the token burn managed by the official deployer wallet. This makes it possible to observe and adjust closely to ensure alignment with the network&#8217;s sustainability and health.  Several changes will be made during the Automated Transition phase to improve dependability and efficiency. According to the Shiba Inu team, the previous mechanism will transit into an automated system. The burn process for this phase will function according to predetermined guidelines, making it more transparent and efficient. However, this automated aspect is expected to begin in January next year. So far, the first-ever token burn performed by the Shiba Inu team saw about 8.2 billion SHIB tokens burned, valued at approximately $76,000. The team will keep burning tokens manually using its deployer wallet to represent user engagement on Shibarium. Shiba Inu&#8217;s latest Shibarium burn mechanism underscores a &#8220;major milestone&#8221; for the network&#8217;s development, according to the official blog post. Shibarium is establishing a standard in blockchain token economics by coordinating token burning with network utilization and constantly improving the procedure through updates. Shibarium&#8217;s Transactions Increases Significantly Lately, Shibarium has seen a surge in transactions and a sharp increase in gas fees by up to 1,000%. Due to this, the token burning has increased exponentially. This is because an increase in the network’s usage leads to more tokens getting burned. Related Reading: Shibarium Transactions Spike 288%, But Why Is Shiba Inu Price Down Today? Shibarium has grown purposefully to surpass its best since its introduction in early August. Several weeks ago, there were only a few thousand transactions each day, but today, there are on average 7 million.  According to data from Shibarium Explorer, that number is currently at 7.82 million. The total number of transactions has also increased lately, totaling 36,730,230 as of the time of writing. Featured image by iStock, chart by Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-05T13:29:00.000Z",
    "title": "Singapore’s DigiFT Secures Regulatory Approval from MAS Post-Sandbox",
    "url": "https://coinedition.com/singapores-digift-secures-regulatory-approval-from-mas-post-sandbox/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"MAS Injects SGD 150 Million to Revive Fintech Innovation in Singapore\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/MAS-Injects-SGD-150-Million-to-Revive-Fintech-Innovation-in-Singapore-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Digital assets exchange DigiFT proudly announced that it has been awarded the coveted Capital Markets Services (CMS) license and recognized as a Recognized Market Operator (RMO) by the Monetary Authority of Singapore (MAS). This comes after the Singapore-based exchange became the first and only platform for on-chain assets to enroll in the MAS FinTech Regulatory [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/singapores-digift-secures-regulatory-approval-from-mas-post-sandbox/\">Singapore&#8217;s DigiFT Secures Regulatory Approval from MAS Post-Sandbox</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]