[
  {
    "source": "CoinDesk",
    "date": "2023-09-18T20:33:47.000Z",
    "title": "Binance’s U.S. Exchange Bucks SEC’s Document Requests Amid Investigation",
    "url": "https://www.coindesk.com/policy/2023/09/18/binances-us-exchange-bucks-secs-document-requests-amid-investigation/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The crypto exchange is fighting to avoid handing over certain documents to the regulator, arguing the SEC’s requests are “overbroad.”"
  },
  {
    "source": "Decrypt",
    "date": "2023-09-18T20:19:28.000Z",
    "title": "Bitcoin Miner Hut 8 Inches Toward Merger With USBTC as Court Approves Deal",
    "url": "https://decrypt.co/197631/bitcoin-miner-hut-8-inches-toward-merger-with-usbtc-as-court-approves-deal",
    "description": "Hut 8 Corp stands to be one of the largest Bitcoin miners across the continent, but the deal isn't finalized yet."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-18T19:40:52.000Z",
    "title": "Exploring the 'Shared Vocabulary' of Generative Art's History",
    "url": "https://decrypt.co/156690/exploring-the-shared-vocabulary-of-generative-arts-history",
    "description": "A new exhibition in London highlights the connections between the early pioneers of generative art and their modern counterparts."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T19:58:55.000Z",
    "title": "Blockchain Capital closes funds totaling $580M for investments in crypto gaming, DeFi",
    "url": "https://cointelegraph.com/news/blockchain-capital-closes-funds-totaling-580-million-blockchain-investments-crypto-gaming-de-fi",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/cfd4b403-71b0-4b1c-bbc3-f864566b3544.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The funds include $380 million for early stage investments and a $200 million \"opportunity fund.\"</p>\n                    <p><p>Venture capital group Blockchain Capital <a href=\"https://www.blockchaincapital.com/blog/doubling-up-while-doubling-down-announcing-our-latest-funds\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> the closing of two new funds, totaling $580 million, for investment in infrastructure, gaming, DeFi, and consumer and social technologies.</p><p>The funds will operate as Blockchain Capital’s sixth early stage fund and its first “opportunity fund,” with the latter serving as an inroad to companies who’ve already secured major funding elsewhere.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We&#39;re thrilled to share the closing of 2 new funds – our 6th early stage fund and 1st opportunity fund.<br><br>Together, they total $580 million and serve to reinforce our commitment to leading the global transition to decentralized, blockchain-based systems. ↓<a href=\"https://t.co/Vr2uYnGlF7\">https://t.co/Vr2uYnGlF7</a></p>&mdash; Blockchain Capital (@blockchaincap) <a href=\"https://twitter.com/blockchaincap/status/1703788962538815709?ref_src=twsrc%5Etfw\">September 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to a press release from Blockchain Capital:</p><blockquote>“The end game is to elevate personal empowerment by granting individuals control over their digital and financial lives through innovative blockchain-enabled applications and services. It’s this vision of a democratized and distributed future that guides our passion and investment decisions.”</blockquote><p>The funds’ combined $580 million will be split, with $380 million <a href=\"https://www.bloomberg.com/news/articles/2023-09-18/crypto-vc-firm-blockchain-capital-raises-580-million-for-two-new-funds\" target=\"_blank\" rel=\"noopener nofollow\">reportedly</a> going to the early stage fund and the rest earmarked for the opportunity fund. It’s unclear at this time exactly what types of projects the investment fund will prioritize. </p><p>According to the press release, the company will continue its trend of investing in infrastructure, DeFi, gaming, and other finance, blockchain and cryptocurrency opportunities. </p><p>However, the press release also mentions that Blockchain Capital’s strategy “isn’t about sectors; it’s about harnessing blockchain technology to realign incentives, reestablish user trust and reengineer the social contract of our increasingly digital world.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-companies-form-texas-blockchain-group-advocate-clear-regulations\"><strong><em>Crypto companies form Texas blockchain group to advocate for clear regulations</em></strong></a></p><p>“Indeed, the crypto market’s volatility these past 20 months revealed the hazards of short-term thinking, exposing many who misjudged this nascent technology,” writes Blockchain Capital in the release, adding later that “over the past 20 months we’ve invested more capital into the next generation of innovators than any other time in our history.”</p><p>The latest funds closed are among the largest in cryptocurrency or blockchain history and the most ever accrued by Blockchain Capital. However, this shouldn’t be interpreted as a signal that the firm intends to continually increase fund sizes.</p><p>Speaking to TechCrunch, one of the firm’s partners, Spencer Bogart, <a href=\"https://techcrunch.com/2023/09/18/blockchain-capital-launches-two-new-funds-for-a-total-of-580m/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> that the firm had “no intent to expand and become an AI fund or hedge fund and trade tokens,” adding that he didn’t see future funds “becoming much larger than what you see here.”</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-18T20:20:30.000Z",
    "title": "SEC urges expedited discovery in Binance case; cites ‘mass exodus’ of US executives who may have key information",
    "url": "https://cryptoslate.com/sec-urges-expedited-discovery-in-binance-case-cites-mass-exodus-of-us-executives-who-may-have-key-information/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) acknowledged on Sept. 18 that multiple key Binance.US executives have left the company. In a court filing, the regulator wrote: &#8220;The accelerating mass exodus of BAM [ie. Binance.US] employees, now including its CEO and others who may possess crucial information regarding the custody, control, and availability of assets, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-urges-expedited-discovery-in-binance-case-cites-mass-exodus-of-us-executives-who-may-have-key-information/\">SEC urges expedited discovery in Binance case; cites &#8216;mass exodus&#8217; of US executives who may have key information</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-18T20:00:37.000Z",
    "title": "Short-term holders prove crucial to spotting Bitcoin market lows, recent analysis shows",
    "url": "https://cryptoslate.com/insights/short-term-holders-prove-crucial-to-spotting-bitcoin-market-lows-recent-analysis-shows/",
    "description": "<p>Quick Take Recent analysis has shed light on an intriguing aspect of the Bitcoin market cycle. d This cohort&#8217;s behavior appears to play a crucial role in signifying a local bottom within the Bitcoin market cycle, as evidenced by a comprehensive examination of the past five years. When this group holds a minimal profit – [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/short-term-holders-prove-crucial-to-spotting-bitcoin-market-lows-recent-analysis-shows/\">Short-term holders prove crucial to spotting Bitcoin market lows, recent analysis shows</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-18T19:58:54.000Z",
    "title": "Ethereum’s Staking Boom Risks Network Overload, Prompting Developer Interventions: Bloomberg",
    "url": "https://www.cryptoglobe.com/latest/2023/09/ethereums-staking-boom-risks-network-overload-prompting-developer-interventions-bloomberg/",
    "description": "According to a recent report by Olga Kharif for Bloomberg, one year after Ethereum’s significant software upgrade known as the Merge, the network is now facing challenges arising from its own success. The upgrade was a smooth transition to a more energy-efficient system, but the burgeoning popularity of its staking feature is raising concerns about […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-18T19:49:54.000Z",
    "title": "100% KYC-Free Debit Cards Will Soon be Available via AnonyCard’s Ongoing ICO",
    "url": "https://cryptodaily.co.uk/2023/09/100-kyc-free-debit-cards-will-soon-be-available-via-anonycards-ongoing-ico",
    "description": "In a remarkable stride towards safeguarding financial privacy, AnonyCard, a well-established Swiss company with roots in IT and financial data analysis dating back to 2004,"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-18T20:30:58.000Z",
    "title": "SEC’s Call for Full Disclosure: Court Asked to Order Inspection of Binance US",
    "url": "https://news.bitcoin.com/secs-call-for-full-disclosure-court-asked-to-order-inspection-of-binance-us/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/sec-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC&#039;s Call for Full Disclosure: Court Asked to Order Inspection of Binance US\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/sec-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/sec-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/sec-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/sec-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/sec-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/sec-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/sec.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Securities and Exchange Commission (SEC) filed a reply to support its motion to compel Binance Holdings Limited to comply with expedited discovery related to customer assets. The reply comes after months of alleged delays and incomplete responses from Binance as it fights a lawsuit alleging it violated federal securities laws. SEC Seeks Court-Ordered [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T20:23:15.000Z",
    "title": "Malta revamps crypto regulations in anticipation of EU’s MiCA laws",
    "url": "https://www.cryptopolitan.com/malta-revamps-crypto-regulations-in-anticipation-of-eus-mica-laws/",
    "description": "Malta&#8217;s Financial Services Authority (MFSA) has initiated significant amendments to its existing crypto guidelines to align with the European Union&#8217;s upcoming Markets in Crypto-Assets (MiCA) regulations. The changes, open for public consultation until September 29, aim to facilitate a smooth transition for Virtual Financial Assets (VFA) providers when MiCA takes effect in December 2024. Streamlining ... <a title=\"Malta revamps crypto regulations in anticipation of EU&#8217;s MiCA laws\" class=\"read-more\" href=\"https://www.cryptopolitan.com/malta-revamps-crypto-regulations-in-anticipation-of-eus-mica-laws/\" aria-label=\"More on Malta revamps crypto regulations in anticipation of EU&#8217;s MiCA laws\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T19:52:21.000Z",
    "title": "Citi unveils blockchain-based token services to revolutionize institutional finance",
    "url": "https://www.cryptopolitan.com/citi-unveils-blockchain-based-token-services/",
    "description": "Citi Treasury and Trade Solutions (TTS) has announced the launch of Citi Token Services, a blockchain-based platform designed to enhance cash management and trade finance for institutional clients. The new service leverages blockchain technology and smart contracts to integrate tokenized deposits into Citi&#8217;s global network, offering a more efficient alternative to traditional bank guarantees and ... <a title=\"Citi unveils blockchain-based token services to revolutionize institutional finance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/citi-unveils-blockchain-based-token-services/\" aria-label=\"More on Citi unveils blockchain-based token services to revolutionize institutional finance\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T19:52:44.000Z",
    "title": "Bitbuy enters partnership with Canada’s largest Bitcoin ATM Provider",
    "url": "https://crypto.news/bitbuy-enters-partnership-with-canadas-largest-bitcoin-atm-provider/",
    "description": "WonderFi has announced a strategic partnership between its subsidiary, Bitbuy Technologies Inc., and Localcoin, the largest Bitcoin ATM provider in Canada. Under this partnership, Bitbuy&#8217;s digital asset services will now cover up to half of the Bitcoin ATMs in the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-18T20:00:09.000Z",
    "title": "Incoming Milestone Could Be Very Bullish For XRP Price, Here’s Why",
    "url": "https://www.newsbtc.com/analysis/xrp/milestone-bullish-xrp-price/",
    "description": "Since Judge Analisa Torres’s ruling back in July that programmatic XRP sales do not qualify as securities, the token has been on an upward trajectory in terms of growth. This time around, the XRP Ledger is close to another enormous milestone, which could spell good news for the XRP price going forward. Accounts On XRP Ledger Near 5 Million Mark In an interesting turn of events, the number of accounts that are present on the XRP Ledger has been rising rapidly. This has seen the metric barrel toward the 5 million total accounts milestone as it is currently sitting at an impressive 4,781,844 million accounts, according to data from XPR Ledger Services. Related Reading: Ethereum Holesky Testnet Already Seeing Issues, What’s Wrong This Time? The site’s data also shows other impressive metrics about the blockchain such as only 1,116 accounts on the Ledger are carrying a 0 balance. This means that only 0.023% of the entire XRP holder base on the ledger is carrying a 0 balance. XRPL accounts near 5 million &#124; Source: XRP Ledger Services Of the 100 billion total XRP supply, 58,682,136,692 (58.6%) are currently sitting in holder accounts, with 41,306,191,412 (41.3%) still held in escrow. This amount held in escrow is released periodically and was designed that way to last until the total XRP supply is exhausted. Going further, a significant number of XRP tokens are also sitting as reserves (tokens in wallets that cannot be spent). The current Total Account Reserves came in at 47,818,440 and Total Owner Reserves is sitting at 13,608,012. How Will It Affect The XRP Price? The rapid rise in the number of accounts on the XRP Ledger points to an increase in interest from crypto investors. In this case, as interest rises, so will demand for the XRP token, which would, in turn, lead to a rise in the XRP price. Analysts have also been incredibly bullish on the XRP price. In one instance, a Wells Fargo Manager forecasted that the price of the altcoin could rise as high as $500, citing Ripple capturing the cross-border payments sector by 2027. Related Reading: Jordan Peterson Sparks Debate On How Bitcoin Can Solve Major Banking Problem Another interesting forecast put the XRP price at $10,000, once again, citing Ripple’s rising market share in the payments sector as a driver. A more conservative crypto analyst put the token’s price at $130 after it formed a rare triangle pattern on its chart. Despite these very bullish predictions, the XRP price continues to struggle at this point. It is still trading well below the $0.5 resistance which has become the important level to beat. At the time of writing, it’s sitting at $0.49, recording meager gains of 0.03% on the daily chart. Although there is a more significant 5.52% gain on the weekly chart. XRP flashes bullish as 5 million account milestone approaches &#124; Source: XRPUSD on Tradingview.com Featured image from XRP News, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T19:54:30.000Z",
    "title": "Shiba Inu (SHIB) Stages Remarkable Recovery, Surges Past 10% Profitability",
    "url": "https://www.crypto-news-flash.com/shiba-inu-shib-stages-remarkable-recovery-surges-past-10-profitability/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-shib-stages-remarkable-recovery-surges-past-10-profitability",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920-48x27.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />The fast growth of the Shibarium network which has registered more than 1.2 million wallet addresses and over 2.8 million transactions has helped in the overall recovery. Shiba Inu has ranged in the profitability range of between 7-9% but has since scaled to 10%, which could increase profit taking. The second largest meme coin and [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-18T20:00:07.000Z",
    "title": "Bitcoin (BTC) Gearing Up for Post-Halving Parabola, According to Crypto Analyst – But There’s a Catch",
    "url": "https://dailyhodl.com/2023/09/18/bitcoin-btc-gearing-up-for-post-halving-parabola-according-to-crypto-analyst-but-theres-a-catch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Blue-Chip-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Blue-Chip-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Blue-Chip-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Blue-Chip-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Blue-Chip-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Blue-Chip-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Blue-Chip-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto analyst says that Bitcoin (BTC) could witness another parabolic rally en route to a new all-time high after its 2024 halving. Pseudonymous analyst Rekt Capital tells his 352,200 followers on the social media platform X that Bitcoin could rally above $80,000 in the months following its next halving event. The halving, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/18/bitcoin-btc-gearing-up-for-post-halving-parabola-according-to-crypto-analyst-but-theres-a-catch/\">Bitcoin (BTC) Gearing Up for Post-Halving Parabola, According to Crypto Analyst – But There’s a Catch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-18T19:55:18.000Z",
    "title": "Anatoly Yakovenko Urges US Lawmakers To Regulate Crypto To Keep Innovation in America",
    "url": "https://dailyhodl.com/2023/09/18/anatoly-yakovenko-urges-us-lawmakers-to-regulate-crypto-to-keep-innovation-in-america/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Popular-Analyst-Says-Solana.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Popular-Analyst-Says-Solana.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/Popular-Analyst-Says-Solana.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Popular-Analyst-Says-Solana.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Popular-Analyst-Says-Solana.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Popular-Analyst-Says-Solana.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Popular-Analyst-Says-Solana.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Solana (SOL) co-creator Anatoly Yakovenko is urging lawmakers in the United States to bring regulatory clarity to the digital asset industry to keep the country’s innovative spirit flourishing. In a new op-ed published by Fortune, Yakovenko warns that the anti-crypto policies in the US are causing blockchain technology entrepreneurs to locate in other countries with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/18/anatoly-yakovenko-urges-us-lawmakers-to-regulate-crypto-to-keep-innovation-in-america/\">Anatoly Yakovenko Urges US Lawmakers To Regulate Crypto To Keep Innovation in America</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]