[
  {
    "source": "CoinDesk",
    "date": "2023-06-13T14:00:00.000Z",
    "title": "Guy Fieri and Sammy Hagar Launch Web3 Tequila Loyalty Program",
    "url": "https://www.coindesk.com/web3/2023/06/13/guy-fieri-and-sammy-hagar-launch-web3-tequila-loyalty-program/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Santo Spirits Club loyalty program will reward members with tiered perks, including an opportunity to win a virtual tequila tasting with Hagar and Fieri, as well as autographed guitars."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-13T13:42:49.000Z",
    "title": "Hinman Emails Reveal 2018 Speech on Ether Drew Input From Multiple SEC Officials",
    "url": "https://www.coindesk.com/policy/2023/06/13/hinman-emails-reveal-2018-speech-on-ether-drew-input-from-multiple-sec-officials/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A number of SEC officials deliberated about how clear the famous speech actually was about ETH’s status."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-13T14:00:39.000Z",
    "title": "Guy Fieri and Sammy Hagar's Tequila Brand Launches NFT Loyalty Program",
    "url": "https://decrypt.co/144378/guy-fieri-sammy-hagar-tequila-brand-launches-nft-loyalty-program",
    "description": "The celebrity stars’ Santo Spirits Club will reward users with “mystery” NFTs alongside real-world rewards."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-13T13:53:18.000Z",
    "title": "XRP Jumps After Unsealing of Highly-Anticipated Hinman Documents",
    "url": "https://decrypt.co/144375/xrp-jumps-unsealing-highly-anticipated-hinman-documents",
    "description": "As the Hinman documents, referring to a speech from a former director, are finally released, the price of the XRP token has soared."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T13:54:51.000Z",
    "title": "Unfazed by SEC tumult, top banks work to make blockchains interoperable ",
    "url": "https://cointelegraph.com/news/top-banks-work-to-make-blockchains-interoperable",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/16866a56-e031-45d7-8f52-9c42d65ec5a5.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Swift, the interbank payments network, has enlisted a dozen world-class institutions — and Chainlink — to fix blockchain’s interoperability deficit. </p>\n                    <p><p>Amid all the tumult in the crypto world, some of the world’s largest banks have been quietly reflecting on ways to bring digital assets to institutional customers. And last week, a plan emerged.</p><p>A collaboration, under the guidance of the Society for Worldwide Interbank Financial Telecommunication, better known as Swift — the global financial communication and payments network — will soon be testing ways for permissioned bank-owned blockchains to not only talk to each other, but also communicate with public blockchains like Ethereum.</p><p>Participants in this global experiment include more than a dozen financial heavyweights, including Citi, Lloyds Banking Group, BNP Paribas, BNY Mellon, and the Australia and New Zealand Banking Group. Chainlink, the decentralized oracle network, is developing the technology to “bridge” these sundry blockchains.</p><p>“Institutional investors increasingly are considering investments in tokenized assets,” <a href=\"https://www.swift.com/news-events/news/swift-explores-blockchain-interoperability-remove-friction-tokenised-asset-settlement\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> the Belgium-based Swift, which connects more than 11,000 financial institutions worldwide, in its June 6 blog. Its headline neatly summarized the task at hand: “Swift explores blockchain interoperability to remove friction from tokenized asset settlement.” </p><p>The problem is that digital assets today are tracked on a wide range of blockchain networks that are not interoperable, Swift further explained. Each chain has its own functionality and liquidity profile, and there’s a lot of technical “friction” when giant institutions try to interact with one another, let alone public blockchains like Ethereum or Polkadot.</p><p>This test phase will look at three specific use cases, according to Swift:</p><blockquote>“The first use case will involve the transfer of tokenized assets between two wallets on the same public blockchain network (Ethereum Sepolia testnet). The second involves the transfer of tokenized assets from a public blockchain (Ethereum) to a permissioned blockchain. And a third use case will test the transfer of tokenized assets from Ethereum to another public blockchain.” </blockquote><p>Chainlink, for its part, “will be used as an enterprise abstraction layer to securely connect the Swift network to the Ethereum Sepolia network, while Chainlink’s Cross-Chain Interoperability Protocol (CCIP) will enable complete interoperability between the source and destination blockchains,” Swift stated. </p><h2>Unfazed by SEC lawsuits</h2><p>In an interview with Cointelegraph last week following the news, Chainlink co-founder and CEO Sergey Nazarov was asked about the fact that the concurrent Swift/Chainlink announcements seemed to be overshadowed by news of the two United States Securities and Exchange Commission lawsuits against crypto exchanges Binance and Coinbase. </p><p>News about infrastructural advances sometimes appears to get lost. Or maybe the industry is evolving on parallel tracks now — the regulatory/markets track and the technical/infrastructural?</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ai-eye-is-ai-a-threat-why-ai-advance/\">AI Eye: Is AI a nuke-level threat? Why AI fields all advance at once, dumb pic puns</a></em></strong></p><p>“Yes, there’s these two parallel worlds,” answered Nazarov. “The cryptocurrency markets go up and down. Historically, what I’ve seen is that when the cryptocurrency markets contract, banks lose interest” in digital assets and blockchain technology. </p><p>“But I’m not seeing that this time,” he said, stating that the banks are holding fast, quietly working on infrastructure solutions, despite the enduring “crypto winter.”Meanwhile, Swift and its client banks don’t seem to think that the blockchain industry will be consolidating any time soon. “There’s unlikely to be a single prevailing blockchain network,” said Tom Zschach, chief innovation officer at Swift. </p><blockquote>“We would expect to see a multitude of different platforms emerging, each serving different customer segments with their own bespoke capabilities and requirements. In such a highly fragmented ecosystem, it would simply not be feasible for financial institutions to connect to each and every platform individually.” </blockquote><h2>‘It’s the main problem’</h2><p>Building “bridges” so private and public chains can share information won’t be easy. Historically, cross-blockchain bridges have been vulnerable to hacks, with some $2 billion stolen from bridges in 13 separate heists by mid-way through 2022, <a href=\"https://blog.chainalysis.com/reports/cross-chain-bridge-hacks-2022/\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a Chainalysis report. Is security still a challenge?</p><p>“I would say it’s the main problem,” answered Nazarov, “because the bridges that exist today haven’t been around for long.” Fortunately, those hacked in 2022 didn’t hold extraordinarily large amounts of value, he added. </p><p>But looking ahead, “we’re talking about bridges that can move around trillions of dollars of value.” </p><p>Transfers in the trillions will have to become <em>de rigeur, </em>or standard practice, if “the blockchain industry is to grow into what it should be — not $1 or $2 trillion” in market capitalization, but something on the order of $10, $20 or $50 trillion, said Nazarov. And so interoperability “is, in fact, the main infrastructure problem that our industry actually has to solve.”</p><p>He added that Chainlink has been working on interoperability issues for years, so why should one expect Chainlink to succeed where others have failed regarding cross-blockchain bridge security?</p><p>All the cross-blockchain bridges built to date are basically “dumb bridges” that do “whatever you tell them to do, even if that’s fraud,” said Nazarov. Chainlink, by comparison, has built an active risk management network, or ARM network, that “monitors that bridge, whether it’s for information or for value, or whether it’s misbehavior.” </p><p>Elsewhere, Nazarov compares the state of interoperability in the blockchain industry to that faced by internet developers several decades ago with email. It’s really about improving the user experience. </p><p>Today, “a bank doesn’t want to tell its customers to integrate with their chain,” said Nazarov, “because it takes too much time. Imagine you and I wanted to email each other, and I was on Gmail, and you were on Yahoo Mail. And in order for us to communicate, I told you, ‘Well, you have to get a Gmail account, then I can email you.’ It doesn’t make any sense. Right?” </p><p>The internet solved the problem with the Transmission Control Protocol/Internet Protocol and some email protocols that allowed email users on different platforms to communicate easily. “This is the same kind of dynamic here,” he added.</p><p>“This is about the ability for all chains to create value with each other. Because if you have a chain that can’t gain the value of all the other chains, then our industry is kind of like moving at half speed.”</p><h2>Progress still in a middle stage</h2><p>What about a timeline? When do Swift and Chainlink anticipate this will all be rolled out at scale?</p><p>It’s hard to say, said Nazarov. “It’ll be a gradual increase over time. As more and more banks begin to interface with the private chains of other banks and those private chains connect to public chains, you’ll see a gradual increase over time. Now we’re in the mid stages.”</p><p>A single large institution could lead the way, “then the rest of them will go in,” he speculated, citing the example of French bank Société Générale deploying its own euro-denominated stablecoin CoinVertible (EURCV) on Ethereum in April. It was the first institutional stablecoin to be <a href=\"https://www.sgforge.com/societe-generale-forge-launches-coinvertible-the-first-institutional-stablecoin-deployed-on-a-public-blockchain/\" target=\"_blank\" rel=\"noopener nofollow\">deployed</a> on a public blockchain. “That has never happened before,” said Nazarov. “I’m seeing more and more [people] talk about this.” </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/is-ron-desantis-good-for-crypto-republican-makes-bitcoin-part-of-campaign\">Is Ron DeSantis good for crypto? Republican makes Bitcoin part of campaign</a></em></strong></p><p>In addition to those previously mentioned, the financial institutions and financial market infrastructure firms participating in the Swift interoperability project include Clearstream, Euroclear, Six Digital Exchange and the Depository Trust and Clearing Corporation — among others.</p><p>All in all, overcoming this fragmentation among blockchain networks “will be key to the long-term scalability of the market,” said Swift, emphasizing the importance of “removing friction in international transactions” while pledging to work “with our community to explore a potential solution.” </p><p>The nuances in the global banking world are somewhat different, of course. Banks generally prefer to talk about “digital assets” rather than “crypto” or “cryptocurrencies,” Nazarov noted, but regardless of how one references it, the fact remains that “clients of the banks now consistently want to take part in that industry.” </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T13:54:28.000Z",
    "title": "Hinman docs unsealed: SEC concerned over ‘Ether is not a security’ statement",
    "url": "https://cointelegraph.com/news/hinman-docs-unsealed-sec-concerned-over-ether-not-security-statement",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/de20f1a8-bb55-4a3d-89d7-5863552f32d5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Hinman risked contradicting himself over the statement Ether isn’t a security, unsealed SEC internal discussion documents show.</p>\n                    <p><p>Newly released <a href=\"https://pacer.login.uscourts.gov/csologin/login.jsf?pscCourtId=NYSDC&amp;appurl=https://ecf.nysd.uscourts.gov/doc1/127133515096\" target=\"_blank\" rel=\"noopener nofollow\">documents</a> showing edits that were made to a 2018 speech given by former director of the Security and Exchange Commission’s (SEC) corporate finance division Bill Hinman suggest the editors were concerned his statement might undermine the idea that Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) is a security. </p><p>This could risk locking the agency into a position it would find hard to change at a later date, the SEC comments warn.</p><p>“Even with the caveats in the sentence, it seems that it would be difficult for the agency to take a different position on Ether in the future,” the edits to the documents read. “Further, the rest of the paragraph strongly implies that the thinking applies to Ether.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/21ff6292-5bfa-44c4-8bd9-ae33094e9cba.png\"  /></figure><p>The Hinman documents refer to internal SEC messages concerning a 2018 speech given by Hinman in which he said that while cryptocurrencies such as Bitcoin (BTC) and Ether may start off as securities, it’s possible for them to become something more akin to a commodity once they become sufficiently decentralized.</p><p>Ripple CEO <a href=\"https://cointelegraph.com/news/ripple-ceo-garlinghouse-hinman-docs-worth-the-wait\">Brad Garlinghouse said June 12</a> that the documents would prove to be “well worth the wait.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ripple-xrp-lawyer-outright-sec-victory-three-percent\"><strong><em>Ripple case: Pro-XRP lawyer tips outright SEC victory at ‘less than 3%’</em></strong></a></p><p>The unsealing of the documents comes amid an extremely turbulent time for the crypto industry. June 13 also sees the federal court hear the SEC’s motion to freeze the assets of Binance.US, following on from a spate of legal action against the exchange.</p><p>The SEC first took legal action against Ripple in December 2020, alleging that the sale of its native XRP (XRP) token represented an <a href=\"https://cointelegraph.com/news/ripple-vs-sec-could-newly-released-documents-tip-the-balance\">unregistered securities offering</a>. Since then, Ripple has denied XRP is a security, arguing it does not satisfy the Howey test.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\">Tornado Cash 2.0 — The race to build safe and legal coin mixers</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T13:41:39.000Z",
    "title": "Peter McCormack’s Real Bedford Football Club puts Bitcoin on the map",
    "url": "https://cointelegraph.com/magazine/real-bedford-soccer-team-puts-bitcoin-on-the-map/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/magazine-Bitcoin-FC-scaled.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Real Bedford is moving up in the leagues and gaining followers worldwide through owner Peter McCormack’s love of Bitcoin.</p>\n                    <p><p><strong>Buying a small-town soccer club with the aim to propel it into the Premier League  the worlds most popular football league  is a script suitable for a Netflix series.</strong></p><p>In fact, actor Ryan Reynolds bid to revitalize lower-league Welsh soccer team Wrexham FC has already caught the attention of Disney+ writers. </p><p>Its a quaint, quintessentially British underdog story of how an ultra-rich Hollywood actor can do something different with his wealth. However, Reynolds has no connection to Wrexham; he flies in for most games, and hes unlikely to live out the rest of his days building out the deprived historic mining town.</p><p>The story has netted mainstream media attention from the likes of the BBC, the Guardian and Sky News.<br><br>In the Bitcoin world, a similar story is unraveling. However, its spearheaded by a local boy whos using Bitcoin not only to boost the Real Bedford Football Club but his hometown as well.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image4.png\" alt=\"\" class=\"wp-image-20829\" width=\"489\" height=\"590\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image4.png 750w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image4-249x300.png 249w\" sizes=\"(max-width: 489px) 100vw, 489px\" /><figcaption class=\"wp-element-caption\"><em>McCormack holding a trophy.</em></figcaption></figure><p>In the Bitcoin world, Peter McCormack is a familiar face, hosting the most popular podcast <em>What Bitcoin Did</em>. According to the Guardian and the BBC, he is a<a href=\"https://www.theguardian.com/technology/2022/aug/06/another-court-case-fails-to-unlock-the-mystery-of-bitcoins-satoshi-nakamoto\" target=\"_blank\" rel=\"nofollow\" > blogger</a> and crypto<a href=\"https://open.spotify.com/episode/31pWfx6JHNOVxwZsDKuJy4?si=8acfd1fbdbe740a5\" target=\"_blank\" rel=\"nofollow\" > guru</a> invariably betting on Bitcoin </p><p>Over the past two years, he has strived to turn around the beleaguered Bedford FC by using Bitcoin. Real Bedford<a href=\"https://cointelegraph.com/news/bitcoin-soccer-club-real-bedford-fc-wins-the-league\" target=\"_blank\" rel=\"nofollow\" > reached promotion in May</a>, buoyed by new uniforms, new logos and, crucially, a new legion of fans. </p><p>However, Real Bedford is also what McCormack calls the Bitcoin football team. Not only does he achieve his boyhood dream of running a successful football team, but it also seeks to discretely encourage fans and onlookers to engage with the worlds largest digital currency, Bitcoin. </p><p>But does the club have the legs to make it into the Premier League? And whats the point of putting the Bitcoin logo on the shirt, hosting Bitcoin meet-ups before every game, and inviting key opinion leaders of the Bitcoin world to games? And what on earth must the locals think of the orange-pilled takeover?</p><p>McCormack bought <a href=\"https://cointelegraph.com/news/peter-mccormack-acquires-local-sports-club-bedford-fc-with-premier-league-ambitions\" target=\"_blank\" rel=\"nofollow\" >Bedford FC in 2021</a> during the heady highs of the bull run when BTC was comfortably above $40,00 and talk of the Bitcoin price hitting six figures dominated Cointelegraph headlines. Propelled by the high Bitcoin prices, the club secured half a million dollars in sponsorship for the first year. </p><h2 id=\"h-media-treatment\"><strong>Media treatment</strong></h2><p>Despite buying the club being a boyhood dream, most people thought McCormack was mad to take on the running of a football club with the fanbase garnered from a volatile digital currency: </p><blockquote class=\"wp-block-quote\"><p>I think this is one of these projects whereby I dont think anyone really understood at the start. Theyre like, Whatever doesnt make any sense.</p></blockquote><p>Local media thought McCormack was crazier still. The BBC and other British mainstream media caught wind of the story, characterizing it as the latest crypto bro to splash out on a self-indulgent purchase.</p><p>Jeff Booth, the author of the Bitcoin book <em>The Price of Tomorrow</em>, tells Magazine that even if it is a wealthy Bitcoin investor splurging on a passion, its a non-issue  particularly as Bitcoin is part of the project: </p><blockquote class=\"wp-block-quote\"><p>Through his interests, he infects others through so other people that like football. Other people that want to follow his interests to take this to a championship, Premier League and everything else, now have an impression that they can join the ride and be part of it.</p></blockquote><p>Ultimately, Booth explains, I couldnt care less what he wants to do […] Hes using this vehicle to be able to advance a whole bunch of other stuff, which is really cool.</p><p>Despite the critical treatment in the media, two years on, McCormack and his team are still wiping down tables in the clubhouse bar, traveling to away games, hosting Bitcoin meet-ups and even washing the Real Bedfords uniforms in his home  all while the price per BTC has crashed and Bitcoin continues to take a beating in popular media. Plus, the club will sport a womens <a href=\"https://www.bedfordindependent.co.uk/bedford-ladies-fc-officially-complete-real-bedford-merger/\" target=\"_blank\" rel=\"nofollow\" >team</a> with plans to expand into disabled and youth teams.</p><p>Real Bedford commentator Will Roberts compares McCormack to a pantomime villain […] who sort of comes in and radicalizes everything, changes everything, and everyone automatically goes against it. Its only natural that it ruffles a few feathers: </p><blockquote class=\"wp-block-quote\"><p>But the closer you get, the more you understand what a good person he is and what a good organization hes running because it is an organization  not just a football club. </p></blockquote><h2 id=\"h-bitcoin-branding\"><strong>Bitcoin branding</strong></h2><p>The clubs Bitcoin branding isnt very subtle. The strips are bright orange with the Bitcoin logo on the abdomen. The club was established during a block height as opposed to a date, and almost everything can be bought or paid for in satoshis (small amounts of Bitcoin). Why bother? Why go to great lengths to advertise a volatile digital currency thats understood by a select group of Brits? </p><p>McCormack is a marketer by profession, and Bitcoin is one of the most recognizable brands worldwide. There are now Real Bedford supporters clubs in Ghana, Tanzania and even Malaysia. The supporter base for Real Bedford rivals teams five divisions higher, and matches are live-streamed and enjoyed by Bitcoin advocates worldwide.</p><figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image5-1024x659.png\" alt=\"\" class=\"wp-image-20830\" width=\"628\" height=\"404\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image5-1024x659.png 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image5-300x193.png 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image5-770x495.png 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image5.png 1200w\" sizes=\"(max-width: 628px) 100vw, 628px\" /><figcaption class=\"wp-element-caption\"><em>Satoshis name and a nod to the maximum number of Bitcoin, 21 million, on the teams kit.</em></figcaption></figure><p>Gandalf (not his real name), who is part of the marketing team at Bitcoin mining company Braiins, tells Magazine:</p><blockquote class=\"wp-block-quote\"><p>If you just bought Bedford and called it Bedford and it was just the local team, we wouldnt all be here. Like, hes been very clever about making it a Bitcoin thing and then that gets new support and new attention into the club.</p></blockquote><p>A local elected councilor for the Liberal Democrats, Jake Simpson attends the last game of the season. He explains to Magazine that, thanks to the Bitcoin takeover, Bedford is gaining international attention, which is bringing international money. And you know, when your business and you accept cryptocurrencies, your customer base expands massively. </p><blockquote class=\"wp-block-quote\"><p>You know, youre attracting more people, which is why theres so many international people here already because theyre interested in cryptocurrency  theyre interested in Bitcoin, which is bringing them here to Bedford. </p></blockquote><p>Bitcoin puts places on the world map  from Bitcoin Beach in El Zonte to Bitcoin Lake in Guatemala or Bitcoin Jungle in Costa Rica. In doing so, it can raise up less economically advantaged communities and regions around the world. Thats the second part of the Real Bedford story, as McCormack says he wants to raise up his town.</p><h2 id=\"h-what-do-the-locals-think\"><strong>What do the locals think?</strong></h2><p>Over the course of 30 street interviews conducted in Bedford, the overarching sentiment toward Bitcoin is negative. One Christian preacher says that the surveillance element to digital currencies was unnerving  before realizing that he might be confusing CBDCs, or central bank digital currencies, and Bitcoin. </p><p>Theres a huge sentiment gap between the Bitcoin believers and the Bedford locals. One Bedfordian simply says, Avoid; others call it an outright scam and that they wouldnt want to lose their money in such a scheme. Some locals have heard of the Real Bedford takeover; others knew of McCormacks story. </p><p>Few locals can accurately explain what Bitcoin is or what it does  highlighting that some of the criticism could come from a position of ignorance or an unwillingness to engage with the currency frequently labeled a threat to the environment or a dark tool by mainstream media. </p><p>McCormack is aware of the negative views that cloak Bitcoin. There is no desire to force Bitcoin onto the people of the town  its about using the team as a Trojan horse for greater levels of Bitcoin adoption:</p><blockquote class=\"wp-block-quote\"><p>I dont want people buying it and losing money and dont force it on people who come to the ground. They can see it, they can come to our meetups, but its a soft touch.</p></blockquote><p>The Real Bedford website, for example, shows a statement saying, Why you shouldnt buy Bitcoin.</p><figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image2-1024x439.png\" alt=\"\" class=\"wp-image-20831\" width=\"746\" height=\"320\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image2-1024x439.png 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image2-300x129.png 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image2-770x330.png 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image2-1536x659.png 1536w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image2.png 1999w\" sizes=\"(max-width: 746px) 100vw, 746px\" /><figcaption class=\"wp-element-caption\"><em>Real Bedfords reasons not to buy Bitcoin.</em></figcaption></figure><p>Some of the locals are converts, however. Sampson says, Its great to see Bitcoin come into my town […] Its massive, and it just makes me feel really proud to be from Bedford and makes me really excited, to be honest.</p><p>I think theyve still got to be a lot of education around it. On how, you know, my mom or my dad can go to a coffee shop and buy Bitcoin. They wouldnt feel comfortable about doing that yet. But that sort of thing happening in the town can only boost an economy in a way.</p><h2 id=\"h-what-s-the-score-so-far\"><strong>Whats the score so far? </strong></h2><p>As opposed to bleating about Bitcoin to Bedfordians, McCormack has firmly stuck a flag in the ground and called Bitcoin advocates around the world to visit: </p><p>I dont talk about Bitcoin much here because Bedfords a deprived town, and I dont want people thinking, Oh my God, theres that guy whos made some money on Bitcoin.<br><br>However, that hasnt stopped fans  of Bitcoin or the team  from taking Bitcoin adoption into their own hands.</p><p>From the trunk of a car in the Real Bedford parking lot, Chris Gordon of Bitcoin payments service Bridge 2 Bitcoin shows a local Bedfordian how to accept Bitcoin. He tells Magazine:</p><blockquote class=\"wp-block-quote\"><p>So, it was a business owner whos interested in accepting Bitcoin payments, and its a completely new concept to him. So, it so happens that I happen to have a point-of-sale device in the back of the car.</p></blockquote><p>Gordon talks the local fan through the options in the hope that a few businesses in Bedfordshire start to accept Bitcoin soon. Bitcoin is already the payment of choice in the clubhouse, and for Real Bedford merchandise  and given that paying in Bitcoin looks different from paying with Visa or cash  it can raise some eyebrows. </p><p>Moreover, the mingling of both Bitcoin and soccer fans in a relaxed, pitchside environment is an opportunity for those unfamiliar with the cryptocurrency to ask questions. Matches can be long, drawn-out affairs of 0-0 draws lasting 90 minutes with a 15-minute break. Asking about the giant B on the players shirts or the fact that the club was founded at a block height  not on a date  could pass the time.</p><h2 id=\"h-crypto-own-goal\"><strong>Crypto own goal?</strong></h2><p>Bitcoins market cap is roughly half a trillion dollars. Crypto, however, has a far greater fanbase and is worth over $1 trillion.<br><br>Real Bedford, however, is a Bitcoin-only club. Its Twitter page is against fan tokens, NFTs and DAOs  the entirety of the crypto world outside Bitcoin.</p><p>Commentator Roberts, who knew nothing about Bitcoin prior to working at Real Bedford, explains that the people of Bedford are getting there.</p><p>A lot of people are made further aware of potentially the differences between not just grouping cryptocurrencies tougher  and that Bitcoin is definitely a separate entity to that.</p><p>The crypto distractions at the club are sponsors. Gemini, Casa and other crypto company logos are displayed on billboards around the stadium, which McCormack hopes to expand and renovate through Bitcoin sponsorship. Despite his devotion to Bitcoin, hes aware that taking advantage of the speculation in crypto could benefit the club:</p><blockquote class=\"wp-block-quote\"><p>If I did a shitcoin, I could raise a billion, and I would get this club in the Premier League in nine years because you have the money to do it. I could build a 200-million-pound stadium if I did a shitcoin. Its really tempting.</p></blockquote><p>Ultimately, Real Bedford is a Bitcoin-only club. McCormack only<a href=\"https://twitter.com/PeterMcCormack/status/1293470512392417281?s=20\" target=\"_blank\" rel=\"nofollow\" > holds</a> Bitcoin and is focused on building Bedford with Bitcoin in mind. However, getting Real Bedford into the Premier League is a long-term, perhaps lifelong commitment. With the first promotion out of the way, itll be the 2030s before Bedford has a team in the most prestigious football league.<br></p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"710\" height=\"610\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image3.png\" alt=\"\" class=\"wp-image-20934\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image3.png 710w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/image3-300x258.png 300w\" sizes=\"(max-width: 710px) 100vw, 710px\" /><figcaption class=\"wp-element-caption\">McCormack shares. a joke with Cointelegraph.</figcaption></figure><p>McCormacks undeterred, however. Im going to be here for the rest of my life here in Bedford at every game I can possibly be at trying to lift up my town. And the way to get this lower-league team into the Premier League? </p><p>It requires hard work, a bit of luck and for Bitcoiners to get behind it. </p></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-06-13T13:41:39.000Z",
    "title": "Peter McCormack’s Real Bedford Football Club puts Bitcoin on the map",
    "url": "https://cointelegraph.com/magazine/real-bedford-soccer-team-puts-bitcoin-on-the-map/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/magazine-Bitcoin-FC-scaled.jpg\"></p><p>Real Bedford is moving up in the leagues and gaining followers worldwide through owner Peter McCormack’s love of Bitcoin.</p>\n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T14:01:51.000Z",
    "title": "Binance.US challenges SEC’s proposed restraining order, citing potential closure",
    "url": "https://www.cryptopolitan.com/binance-us-challenges-secs-proposed-restraining-order/",
    "description": "Binance.US has filed a request with the U.S. District Court to deny the proposed temporary restraining order by the Securities and Exchange Commission (SEC). Binance.US argues that implementing the order would effectively lead to the closure of BAM Trading Services Inc., the entity behind Binance. US. The SEC&#8217;s emergency motion for the restraining order is ... <a title=\"Binance.US challenges SEC&#8217;s proposed restraining order, citing potential closure\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-us-challenges-secs-proposed-restraining-order/\" aria-label=\"More on Binance.US challenges SEC&#8217;s proposed restraining order, citing potential closure\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-13T14:00:05.000Z",
    "title": "AI Trade Algorithm Gives Strong Buy Signal for ADA, SOL and GMT",
    "url": "https://nulltx.com/ai-trade-algorithm-gives-strong-buy-signal-for-ada-sol-and-gmt/",
    "description": "Crypto investors operate through reliable indicators and strategies to help them navigate the complexities of the market. AI’s entry into the investment landscape advances as Avorak trading algorithms offers promising avenues for enhancing investment decisions. As such Avorak Trade algos pick ADA (Cardano), SOL (Solana), and GMT (STEPN). Let’s explore and shed light on the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-13T13:56:02.000Z",
    "title": "Lazarus group turns to Garantex to launder stolen assets",
    "url": "https://crypto.news/lazarus-group-turns-to-garantex-to-launder-stolen-assets/",
    "description": "The Lazarus Group, known for its cybercriminal activities, has shifted its focus to Garantex, an OFAC-sanctioned exchange, to trade stolen assets for bitcoin (BTC). "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-13T14:00:54.000Z",
    "title": "Binance.US Responds To Motion Seeking Fund Freeze, Asserts SEC’s Claims Are Invalid",
    "url": "https://www.newsbtc.com/binance/binance-us-responds-to-motion-seeking-fund-freeze-asserts-secs-claims-are-invalid/",
    "description": "Binance.US has submitted its defense before the June 13 hearing to determine the freezing of its funds. Binance.US criticized the Securities and Exchange Commission&#8217;s (SEC) motion for a temporary restraining order, describing it as draconian and unduly burdensome.  The exchange also voiced opposition, arguing that the proposed measures would place excessive restrictions and “effectively end” its business. Related Reading: XRP Could Be Set For A Breakout As Investment Inflows Continue Notably, the hearing on the restraining order will take place in the US District Court for the District of Columbia on June 13 before DCJ Amy Berman Jackson. Closure Of BAM Trading Services Inc. Would Harm Customers And Inhibit The Defense, Binance.US In a recent opposing motion, Binance.US expressed that implementing the restraining order would result in the closure of BAM Trading Services Inc., the entity responsible for providing crypto trading and exchange services for Binance.US. &#8220;The requested relief would primarily harm BAM’s customers, effectively put BAM out of business, and prevent BAM from defending itself in this litigation,&#8221; said the company. Binance believes operations would ‘quickly grind to a halt’ without the ability to pay its employees and professionals in the ordinary course of business, and BAM would be unable to even fund its ‘defense’ to this action. Binance.US notably criticized the regulator&#8217;s approach in pursuing legal action, asserting that the US SEC failed to identify any security trading on BAM&#8217;s platform, causing all of the SEC&#8217;s claims to fail. In addition, Binance.US stated that it had actively engaged in cooperation with an ongoing SEC investigation that commenced on December 20, 2020. The filing reveals that as a result of this investigation, Binance.US has provided over 700,000 individual communications and specific data related to its day-to-day operations. This statement suggests that the company has shown efforts to be transparent and responsive to the SEC&#8217;s inquiries. It also indicates a willingness to comply and provide the necessary information during the investigative process. SEC Accuses CZ Of Moving $12 Billion In Funds And Seeks Asset Freeze On June 5, the US SEC made a significant move by filing 13 charges against Binance entities and its founder, Changpeng Zhao. The charges were related to the operation of unregistered exchanges, broker-dealers, and clearing agencies, among others. The regulator also alleged that the crypto exchange allowed US customers to engage in such trading, further violating securities laws. In addition to the charges, the SEC claimed that Binance CEO had access to the exchange&#8217;s customer funds, alleging he orchestrated the movement of $12 Billion through a privately-controlled entity, Merit Peak. The following day, on June 6, the SEC filed an emergency motion for a temporary restraining order against Binance, further intensifying its efforts. The motion was intended to stop any transactions or movements of money on Binance.US. This legal action marked a pivotal moment in the popular cryptocurrency exchange&#8217;s regulatory scrutiny. Featured image from Pixabay and chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T13:43:46.000Z",
    "title": "Enhancing Network Security: Hedera Introduces HSCS Security Model v2 for Users and Developers",
    "url": "https://www.crypto-news-flash.com/enhancing-network-security-hedera-introduces-hscs-security-model-v2-for-users-and-developers/?utm_source=rss&utm_medium=rss&utm_campaign=enhancing-network-security-hedera-introduces-hscs-security-model-v2-for-users-and-developers",
    "description": "Hedera is enhancing its network security with the HSCS Security Model v2 for users and developers. The Hedera Smart Contract Service (HSCS) security model update will impact users in complexity but more than makes up for it with secure and scalable API solutions and enhanced security. The Hedera Smart Contract Service (HSCS) security model has [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-13T13:57:37.000Z",
    "title": "3 Reasons Crypto Will Survive the SEC Attack",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/3-reasons-crypto-will-survive-the-sec-attack/",
    "description": "<p>By now you’ve heard. SEC sues Binance. SEC sues Coinbase. 2 Huge funds dump their alts on Friday in response and almost all coins that are NOT Bitcoin or Ethereum went down 20% or more in a day. But this is not the end. No matter what the SEC does. In this article, I will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/3-reasons-crypto-will-survive-the-sec-attack/\">3 Reasons Crypto Will Survive the SEC Attack</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-13T13:55:00.000Z",
    "title": "USDT-Dominance Swings as Analyst Predicts Imminent Altseason",
    "url": "https://coinedition.com/usdt-dominance-swings-as-analyst-predicts-imminent-altseason/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/USDT-11-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/USDT-11-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/USDT-11-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/USDT-11.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In recent analyses, a trader with the Twitter handle @el_crypto_prof has identified two key indicators that have historically preceded an altcoin surge: the emergence of a head and shoulders pattern and a heavily overbought Stochastic Relative Strength Index (Stoch RSI). Over the past three years, this combination has paved the way for the altcoin season [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/usdt-dominance-swings-as-analyst-predicts-imminent-altseason/\">USDT-Dominance Swings as Analyst Predicts Imminent Altseason</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-06-13T14:00:00.000Z",
    "title": "Bitfinex hosts first ever live trading competition",
    "url": "https://blog.bitfinex.com/media-releases/bitfinex-hosts-first-ever-live-trading-competition/",
    "description": "<p>ROAD TOWN, British Virgin Islands – June 13, 2023&#160; Bitfinex (https://www.bitfinex.com/), a state-of-the-art digital asset trading platform, has just published the first of three high-octane episodes showcasing its first-ever Bitfinex Trade Masters Trading Competition which took place in Istanbul, Turkey to its official YouTube channel....</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/media-releases/bitfinex-hosts-first-ever-live-trading-competition/\">&lt;strong&gt;Bitfinex hosts first ever live trading competition&lt;/strong&gt;</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]