[
  {
    "source": "Decrypt",
    "date": "2023-11-09T17:47:06.000Z",
    "title": "OneCoin Legal Chief Pleads Guilty to Role in Cryptoqueen's $4 Billion Fraud",
    "url": "https://decrypt.co/205356/onecoin-legal-chief-pleads-guilty-to-role-in-cryptoqueens-4-billion-fraud",
    "description": "Irina Dilkinska admitted in Manhattan federal court to helping launder $110 million in illicit profits generated through OneCoin."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-09T17:45:13.000Z",
    "title": "MicroStrategy up $1.2B on its holdings as Bitcoin rallies",
    "url": "https://cryptoslate.com/microstrategy-up-1-2b-on-its-holdings-as-bitcoin-rallies/",
    "description": "<p>Bitcoin&#8217;s (BTC) recent rally to a yearly high of more than $37,000 has pushed MicroStrategy&#8216;s multibillion-dollar bet on the flagship digital asset into a whopping profit of more than $1 billion. The premier cryptocurrency climbed to nearly $38,000 on Thursday, marking its highest point since May 2022. At the time, the crypto market witnessed a [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/microstrategy-up-1-2b-on-its-holdings-as-bitcoin-rallies/\">MicroStrategy up $1.2B on its holdings as Bitcoin rallies</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-09T17:45:00.000Z",
    "title": "Ethereum Breaks $2,000 as BlackRock Signals Potential Spot $ETH ETF Filing",
    "url": "https://www.cryptoglobe.com/latest/2023/11/ethereum-breaks-2000-as-blackrock-signals-potential-spot-eth-etf-filing/",
    "description": "The price of the second-largest cryptocurrency by market capitalization Ethereum ($ETH) has over the last 24-hour period surged over 6.7% to surpass the $2,000 mark after BlackRock’s iShares signaled a potential upcoming Ethereum exchange-traded fund (ETF) filing. As first reported by a user Summers on the microblogging platform X (formerly known as Twitter), BlackRock recently […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T17:56:36.000Z",
    "title": "OneCoin’s Legal Head pleads guilty in landmark case for cryptocurrency fraud",
    "url": "https://www.cryptopolitan.com/onecoins-head-guilty-cryptocurrency-fraud/",
    "description": "In a groundbreaking development in the world of cryptocurrency fraud, Irina Dilkinska, the so-called &#8216;Head of Legal and Compliance&#8217; for OneCoin, a notorious cryptocurrency pyramid scheme, has admitted to her role in the multi-billion-dollar fraud. Her guilty plea, entered in a Manhattan federal court, marks a significant milestone in the ongoing battle against cryptocurrency scams. ... <a title=\"OneCoin&#8217;s Legal Head pleads guilty in landmark case for cryptocurrency fraud\" class=\"read-more\" href=\"https://www.cryptopolitan.com/onecoins-head-guilty-cryptocurrency-fraud/\" aria-label=\"More on OneCoin&#8217;s Legal Head pleads guilty in landmark case for cryptocurrency fraud\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T17:49:17.000Z",
    "title": "Nomura’s crypto subsidiary Laser Digital launches Ethereum Adoption Fund for institutional investors",
    "url": "https://www.cryptopolitan.com/nomuras-laser-digital-ethereum-adoption-fund/",
    "description": "Laser Digital, the digital asset arm of the prestigious Japanese investment bank Nomura, has launched an Ethereum Adoption Fund. The announcement made on Thursday marks a significant move targeting institutional investors seeking exposure to the second-largest cryptocurrency. This fund engages in long-only spot ether investments and adds a yield enhancement strategy by staking ETH. Fiona ... <a title=\"Nomura’s crypto subsidiary Laser Digital launches Ethereum Adoption Fund for institutional investors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nomuras-laser-digital-ethereum-adoption-fund/\" aria-label=\"More on Nomura’s crypto subsidiary Laser Digital launches Ethereum Adoption Fund for institutional investors\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T17:47:12.000Z",
    "title": "UK MPs unaware of facial recognition tech invading privacy",
    "url": "https://www.cryptopolitan.com/uk-mps-unaware-of-facial-recognition-tech/",
    "description": "In a recent survey conducted by Privacy International (PI) through YouGov, it has come to light that a significant number of UK Members of Parliament (MPs) are unaware of the extensive deployment of facial recognition technology (FRT) in the country. The survey, comprising a random sample of 114 MPs from various political parties, sheds light ... <a title=\"UK MPs unaware of facial recognition tech invading privacy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-mps-unaware-of-facial-recognition-tech/\" aria-label=\"More on UK MPs unaware of facial recognition tech invading privacy\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T18:00:07.000Z",
    "title": "A Chat With Paolo Ardoino: What’s Behind The Bitcoin Price Rally, New Role As CEO, And Adoption",
    "url": "https://www.newsbtc.com/bitcoin-news/a-chat-with-paolo-ardoino-whats-behind-the-bitcoin-price-rally-new-role-as-ceo-and-adoption/",
    "description": "A year ago, our team sat down with Paolo Ardoino, CTO at crypto exchange Bitfinex, to talk about the Bitcoin price and the events that, for many, triggered the long crypto winter: the FTX collapse, and the downfall of major companies in the space. Related Reading: Paolo Ardoino Talks FTX, Adoption And Self-Custody With NewsBTC Now, we sat down with Ardoino once again to talk about the underlying reasons fueling the current Bitcoin price rally, Bitfinex’s partnership with El Salvador, their ambition for the long term, and his new position as CEO at Tether, the company behind stablecoin USDT. Ardoino draw a parallel between Bitcoin adoption and the legacy financial market, saying that adoption happens “slowly” but much more in the traditional system. In addition, he claims to be unbothered by his new role to focus more on the work. This is what he told us: Q: What does your new position mean for you personally and for Bitfinex as a company? Will there be any changes for the users? Paolo: No changes at all. I mean, I think on the Bitfinex side, again, my role didn&#8217;t change, and so things are progressing at the same pace, with the same attention to our user base. Same excitement for Bitcoin adoption and building Bitcoin infrastructure. So, absolutely no changes on the side. And also on the other side, I&#8217;ve been involved in strategy decisions for the last few years. I have always been excited to not just do development but also work on the strategy and the business side. So, also no changes there (&#8230;) Given the fact that I&#8217;ve been, anyway, leading the strategy made sense to just adjust the title on the Tether side as well. For me. I mean, I&#8217;m the same guy that keeps working, keeps coding, keeps doing things that he likes all day long (&#8230;) So I like to think that for me, nothing changes. I&#8217;m not the type of guy that goes around with fanfare for title changes. I just like to work. I like the two companies that I&#8217;m working in. My passion is my work; it is my hobby. Q: Having celebrated two years since the Bitcoin Law made BTC legal tender in El Salvador, do you believe it has significantly impacted the population? Are more people using Bitcoin now compared to 2021? Paolo: So that&#8217;s a good question. So first of all, I am always carefully explaining that while we all want change, that is fast change can never be fast. People are historically by nature are reluctant to change. So I think it&#8217;s important that people keep that in mind because. I lived part of my time in Switzerland and I was talking to a few banks and local administrations in Switzerland and they were confirming that even for the credit cards and debit cards, it took 15 years to be widely used because people the first time they had the debit cards and credit cards in their pockets, and we are talking about Switzerland, that is basically the country of finance and banks, yet the adoption was so low because people didn&#8217;t trust that the piece of plastic that they have in their pockets. So with Bitcoin it&#8217;s the same, right? So it&#8217;s about earning trust over time. I don&#8217;t think Bitcoiners need to push Bitcoin down people&#8217;s throats. I think Bitcoiners have to be patient, to explain things in a way that is simple to understand. Sometimes we bitcoiners are a bit too hard to comprehend or too hard to follow just because we like to use big words and complex explanations but that is not what we should be doing. We should be crafting education that is good for a kindergarten teacher or a taxi driver, school bus driver who is selling groceries. That is the real adoption takes time to understand, to get this type of feedback and to adapt the educational processes for that. So I&#8217;m sure that the Bitcoin adoption will come. There is a lot of new companies that I&#8217;m meeting this, that are moving here in El Salvador to help with the process, to provide further infrastructure, to invest themselves in education. So it&#8217;s just a process that takes time and sometimes you have mainstream media trying to demonize the work, pace, and speed at which things are moving here. But again, they are always forgetting that in traditional finance things always move even slower than these. So, I would say that Bitcoin adoption in Salvador is a success and will be even more successful in the next years. Q: Could you share details about Bitfinex&#8217;s partnership with El Salvador? What initiatives are you currently working on, and what projects do you hope to develop in the coming years? Paolo: We partnered with two educational projects. One is called Torogoz Dev, which focuses on leveraging the expertise of developers here to instruct and teach other developers. And so to create a community of developers that understand really well Bitcoin, the importance of that is that we want El Salvador to be able to grow its internal knowledge and internal infrastructure and software development base. It&#8217;s fine to bootstrap it with people coming from that side, but it&#8217;s more and more important to have knowledge and a strong base of developers drawing from the inside. And then also Mi Primer Bitcoin is another partnership that we achieved for a location that is more suitable for the broader public. Then we obtained a securities license so that our goal there is to make sure that El Salvador will become the central financial hub for Central and South America. And I think it has all the chances to do that because the local administration, the president, the government are really forward looking. They seem to think things are on the right track to bring companies or have companies that can leverage securities here in El Salvador to raise capital for their companies, for their enterprises. And it&#8217;s quite unique because imagine the United States, if you are a small company that has around between $500,000 and $10 million of market cap, it&#8217;s almost impossible to get a loan or to raise capital publicly because then you would need to go to a bank. But the banks are extremely expensive and they will take huge fees and it would cost too much in lawyers for you. So people don&#8217;t do that, small companies don&#8217;t do that, but Bitfinex Securities aims to create a more democratic access for companies that want to raise capital through securities. Q: Turning to Bitcoin&#8217;s current market activity, there&#8217;s a widespread belief that the potential approval of a spot Bitcoin ETF has bolstered the rally. What is your perspective on this? Do you sense a shift in the market dynamics? Paolo: So I think that since 2022 after FTX, Bitcoin has been extremely oversold. So I think that slowly but steadily it has recovered over the last months. We don&#8217;t see much Bitcoin (supply) the sell side right now. Institutions are accumulating Bitcoin left and right. So that is also one of the reasons, in my opinion, why the price is going up. And even with the Bitcoin ETF even further, you can argue easily that that will drive Bitcoin adoption. So I think it&#8217;s normal to see the price moving also considering the Halving next year. I think people started to realize that there is a big difference between Bitcoin and everything else, every other token. So people are going for something that maybe doesn&#8217;t do 100x in a few days as some random tokens, but is a certainty, right? Is something that is stable, has a strong user base, has strong fundamentals, and that cannot be said for all the other tokens. So that&#8217;s why we are seeing this growing excitement around Bitcoin. Related Reading: Bitcoin Eyes $37,000: Bloomberg Analysts Give Timeline To Spot ETF Approval As of this writing, Bitcoin trades at $36,400 after cooling off during the day. The cryptocurrency reached a yearly high north of $38,000. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-09T18:07:13.000Z",
    "title": "U.S. SEC Engages Grayscale in Spot Bitcoin ETF Discussions- an Imminent Approval Driving BTC to New ATH",
    "url": "https://www.crypto-news-flash.com/u-s-sec-engages-grayscale-in-spot-bitcoin-etf-discussions-an-imminent-approval-driving-btc-to-new-ath/?utm_source=rss&utm_medium=rss&utm_campaign=u-s-sec-engages-grayscale-in-spot-bitcoin-etf-discussions-an-imminent-approval-driving-btc-to-new-ath",
    "description": "<img width=\"1000\" height=\"647\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin ETF\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF-300x194.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF-768x497.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Following a legal victory, Grayscale has been in active communication with the SEC&#8217;s Division of Trading and Markets and the Division of Corporation Finance. Grayscale&#8217;s GBTC discount dropped to its two-year low indicating growing investor confidence in the upcoming approval of the first-ever spot Bitcoin ETF. The U.S. Securities and Exchange Commission (SEC) is engaged [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-09T17:45:44.000Z",
    "title": "Deutsche Börse’s Crypto Ambitions: Regulated Exchange Coming in 2024",
    "url": "https://www.crypto-news-flash.com/deutsche-borses-crypto-ambitions-regulated-exchange-coming-in-2024/?utm_source=rss&utm_medium=rss&utm_campaign=deutsche-borses-crypto-ambitions-regulated-exchange-coming-in-2024",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-5.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-5-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-5-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Deutsche Börse AG plans to grow revenue by 10% annually until 2026, expanding through organic growth and acquisitions like SimCorp. The company will launch a regulated cryptocurrency exchange in 2024 and explore using stablecoins for digital securities settlements. Deutsche Börse AG has unveiled its strategic roadmap leading up to 2026, aiming to reshape its business [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-09T18:02:00.000Z",
    "title": "1Piece Surges 43+% Following Partnership With Popular Trader",
    "url": "https://coinedition.com/1piece-surges-43-following-partnership-with-popular-trader/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"1Piece Surges 43+% Following Partnership With Popular Trader\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License.jpg 696w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Wallet-Backpack-Launches-Exchange-Following-Dubai-License-355x200.jpg 355w\" sizes=\"(max-width: 696px) 100vw, 696px\" /><p>1Piece Surges 43+% Following Partnership With Popular Trader</p>\n<p>The post <a href=\"https://coinedition.com/1piece-surges-43-following-partnership-with-popular-trader/\">1Piece Surges 43+% Following Partnership With Popular Trader</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-09T17:58:38.000Z",
    "title": "Veloce Racing’s Unique Chrome Livery Chosen by VEXT Community for Extreme E Finale in Chile",
    "url": "https://dailyhodl.com/2023/11/09/veloce-racings-unique-chrome-livery-chosen-by-vext-community-for-extreme-e-finale-in-chile/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/NEW-Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/NEW-Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2023/10/NEW-Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/10/NEW-Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/10/NEW-Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2023/10/NEW-Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/NEW-Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/10/NEW-Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2023/10/NEW-Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2023/10/NEW-Veloce-Media-Group-Industry-Announcement-Featured-Image-Template.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>November 9, 2023 – London, United Kingdom Design chosen by VEXT community to appear at Extreme E season finale in Chile. Veloce Racing will be fighting for the Extreme E season three championship title in style with a special one-off VEXT chrome livery. As part of the recently launched VEXT, token holders were given a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/09/veloce-racings-unique-chrome-livery-chosen-by-vext-community-for-extreme-e-finale-in-chile/\">Veloce Racing’s Unique Chrome Livery Chosen by VEXT Community for Extreme E Finale in Chile</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-09T17:55:42.000Z",
    "title": "Ripple Strikes New Partnership To Enable Cross-Border Payments Between UK, Australia, Gulf Countries and Africa",
    "url": "https://dailyhodl.com/2023/11/09/ripple-strikes-new-partnership-to-enable-cross-border-payments-between-uk-australia-gulf-countries-and-africa/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/ripple-strikes-new-cross.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/ripple-strikes-new-cross.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/ripple-strikes-new-cross.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/ripple-strikes-new-cross.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/ripple-strikes-new-cross.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/ripple-strikes-new-cross.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/ripple-strikes-new-cross.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Payments company Ripple has launched a new partnership to help enable cross-border payments between Africa and a slew of other markets. Ripple says in a new press release that it is partnering with Onafriq, a fintech firm with a network spanning 40 African markets. Onafriq will use Ripple&#8217;s crypto-enabled payments technology to launch payment corridors [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/09/ripple-strikes-new-partnership-to-enable-cross-border-payments-between-uk-australia-gulf-countries-and-africa/\">Ripple Strikes New Partnership To Enable Cross-Border Payments Between UK, Australia, Gulf Countries and Africa</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]