[
  {
    "source": "CryptoGlobe",
    "date": "2023-09-30T09:14:25.000Z",
    "title": "Idris Elba Partners with Stellar Development Foundation Amidst Crypto’s Troubled Waters",
    "url": "https://www.cryptoglobe.com/latest/2023/09/idris-elba-partners-with-stellar-development-foundation-amidst-cryptos-troubled-waters/",
    "description": "British actor and filmmaker Idris Elba has reportedly been observing the crypto landscape closely. Idris Elba is a British actor, filmmaker, and musician, widely recognized for his versatile roles in both television and film. Born on 6 September 1972 in London, England, Elba gained international fame for his portrayal of Stringer Bell in the critically […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-30T09:10:11.000Z",
    "title": "Tron TVL Balloons To Over $15 Billion: DeFi Growth Evident?",
    "url": "https://www.newsbtc.com/news/tron-tvl-balloons-to-over-15-billion-defi-growth-evident/",
    "description": "The Tron (TRX) DeFi ecosystem has experienced a notable surge in activity, signaling a substantial period of growth and development. This expansion isn&#8217;t limited to the realm of decentralized finance alone; recent data underscores a correlated upward trajectory within Tron&#8217;s TRX token staking ecosystem. This trend suggests that both DeFi and staking on the Tron blockchain are witnessing increased interest and participation from users and investors, thereby fostering a more robust and dynamic Tron ecosystem. But, there&#8217;s more interesting side of the narrative that has provided Tron a major lift. In recent days, Tron has observed a notable uptick in its Total Value Locked (TVL) metric, signifying an increase in the value of assets participating in various activities within the Tron ecosystem. Related Reading: CRV Price Surges 16% – What’s The Next Move For Curve DAO Token? Tron TVL Swells To Over $15 Billion At press time, the TVL associated with TRX has surged to an impressive $15.8 billion, reflecting a substantial growth rate of more than 2% within the span of just 24 hours. Hey #TRONICS! Have you checked out @trondao&#8216;s #DeFi? TVL on the #TRONNetwork is $15.3b! 🚀 Let&#8217;s dive in and #BUIDL together! 💪 Source👇 https://t.co/YW3opVO3ZO pic.twitter.com/sr2uL66zB6 — TRON DAO (@trondao) September 28, 2023 This noteworthy upswing in TVL underscores a heightened level of engagement and confidence among users and investors in Tron&#8217;s blockchain and associated DeFi protocols. Total Value Locked is a crucial metric in DeFi, representing the total value of assets locked within a specific DeFi platform or protocol, typically measured in US dollars. It encompasses assets used as collateral, liquidity in trading pools, staked tokens for rewards, and governance participation. TVL is essential for assessing a DeFi project&#8217;s health, security, and attractiveness to users and investors, and it plays a vital role in risk evaluation and competition analysis within the DeFi ecosystem. TRON market cap currently at $7.8 billion. Chart: TradingView.com TRX Sustains 6% Climb In The Last Week At the time of writing, TRX is trading at $0.088, down a measly 0.1%, but notched a decent 6.0% gain in the last seven days. TRX maintained its remarkable rise on Friday due to an increase in demand for the coin. The token reached its highest point at $0.090 since July 22nd. It is one of the top performing major cryptocurrencies of the year, close to its all-time high of $0.094. Related Reading: Maker (MKR) Inks 20% Price Advance, Leads Top 50 Coins Today Tron stands out as the most active cryptocurrency in the industry, boasting stablecoins valued at over $44.5 billion and a user base exceeding 1.47 million, surpassing Ethereum and BNB Chain. The success of Tron is attributed to the strong performance of USDD, a stablecoin launched in 2022, which has maintained its peg through an over-collateralization strategy. The strong crypto market, with Bitcoin reaching $27,000 and XRP rising to $0.052, also helped TRX price surge. Source: TronScan Meanwhile, TRON&#8217;s blockchain has seen significant growth recently. The total number of addresses, based on TronScan data, on TRON reached almost 187 million, and the total transactions surpassed $6.4 billion. Additionally, TRON&#8217;s staking ecosystem has been thriving, with the staked amount of TRX reaching 46.8 billion, with 23.12% in Stake 2.0 and 76.88% in Stake 1.0. Stake 2.0&#8217;s increasing share indicates its rising popularity in the blockchain space. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-30T09:15:51.000Z",
    "title": "Coinbase CEO Brian Armstrong Says the US Needs Crypto Regulatory Clarity To Maintain the Dollar-Based Soft Power",
    "url": "https://dailyhodl.com/2023/09/30/coinbase-ceo-brian-armstrong-says-the-us-needs-crypto-regulatory-clarity-to-maintain-the-dollar-based-soft-power/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/US-Needs-Crypto-Regulatory.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/US-Needs-Crypto-Regulatory.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/US-Needs-Crypto-Regulatory.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/US-Needs-Crypto-Regulatory.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/US-Needs-Crypto-Regulatory.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/US-Needs-Crypto-Regulatory.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/US-Needs-Crypto-Regulatory.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Coinbase CEO Brian Armstrong says that it is “really imperative” for the US to have a regulatory framework for crypto assets. Armstrong says in a new CNBC interview that the US is an exception among other major economies with regard to achieving regulatory clarity for crypto. According to the Coinbase CEO, the US has a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/30/coinbase-ceo-brian-armstrong-says-the-us-needs-crypto-regulatory-clarity-to-maintain-the-dollar-based-soft-power/\">Coinbase CEO Brian Armstrong Says the US Needs Crypto Regulatory Clarity To Maintain the Dollar-Based Soft Power</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]