[
  {
    "source": "Cointelegraph",
    "date": "2023-12-26T05:06:15.000Z",
    "title": " Reports emerge suggesting Mt. Gox creditors are receiving repayments ",
    "url": "https://cointelegraph.com/news/mt-gox-creditors-repayments-received-social-media-reports",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNGQzNjYwMzgtYmVmOS00NGQ3LTk5OTItYzJjOTNjYWQ2MTMzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Mt. Gox creditors on Reddit claim they've begun receiving payments from the exchange, nearly 10 years after it first shut down. </p>\n                    <p><p>Creditors of the long-defunct Bitcoin exchange Mt. Gox have reportedly started to receive fiat repayments for their Bitcoin, which had been trapped on the exchange since February 2014, according to emerging reports on social media. </p><p>Several posts <a href=\"https://www.reddit.com/r/mtgoxinsolvency/\" target=\"_blank\" rel=\"noopener nofollow\">from</a> the Reddit page r/mtgoxinsolvency suggest that Mt. Gox has been sending Japanese Yen-denominated refunds to users via PayPal — nearly ten years after the funds had become locked on the exchange on Feb. 24, 2014. The reports are unconfirmed.</p><p>\"I just got paid,\" <a href=\"https://www.reddit.com/r/mtgoxinsolvency/comments/18qxw4z/i_just_got_paid/\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> Reddit user Free-end254, attaching a screenshot of the email that contained the PayPal receipt of payment. </p><p><a href=\"https://cointelegraph.com/news/mt-gox-creditors-repayments-received-social-media-reports\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-26T04:48:46.000Z",
    "title": "XRP Price Regains Strength As The Bulls Aim For 10% Surge",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-regains-strength-0-65/",
    "description": "XRP price is moving higher from the $0.578 support. The price seems to be setting up for a fresh surge toward the $0.680 and $0.700 levels. XRP is attempting a fresh increase from the $0.578 support level. The price is now trading above $0.620 and the 100 simple moving average (4 hours). There is a key rising channel forming with resistance near $0.650 on the 4-hour chart of the XRP/USD pair (data source from Kraken). The pair start a fresh rally if it clears the $0.650 and $0.655 resistance levels. XRP Price Could Surge To $0.70 After forming a base near the $0.578 zone, XRP price started a decent increase. There was a move above the $0.595 and $0.600 resistance levels. The price even cleared the $0.630 resistance. There was a spike above the 50% Fib retracement level of the downward move from the $0.700 swing high to the $0.578 swing low. The price is now up over 3%, outperforming Bitcoin and Ethereum. It is now facing resistance near the $0.650 zone. There is also a key rising channel forming with resistance near $0.650 on the 4-hour chart of the XRP/USD pair. The channel resistance is near the 61.8% Fib retracement level of the downward move from the $0.700 swing high to the $0.578 swing low. The price is now trading above $0.630 and the 100 simple moving average (4 hours). On the upside, immediate resistance is near the $0.650 zone. The next major resistance is near the $0.655 zone. A close above the $0.655 resistance zone could spark a strong increase. Source: XRPUSD on TradingView.com The next key resistance is near $0.684. If the bulls remain in action above the $0.684 resistance level, there could be a rally toward the $0.700 resistance. Any more gains might send the price toward the $0.720 resistance. Fresh Decline? If XRP fails to clear the $0.650 resistance zone, it could start a fresh decline. Initial support on the downside is near the $0.620 zone and the channel trend line. The next major support is at $0.606. If there is a downside break and a close below the $0.606 level, XRP price might accelerate lower. In the stated case, the price could retest the $0.578 support zone. Technical Indicators 4-Hours MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $0.620, $0.606, and $0.578. Major Resistance Levels – $0.650, $0.655, and $0.700."
  }
]