[
  {
    "source": "CoinDesk",
    "date": "2023-06-29T16:00:00.000Z",
    "title": "Stablecoin Wallet Rpay Secures License from OFAC to Continue Operating in Venezuela",
    "url": "https://www.coindesk.com/policy/2023/06/29/stablecoin-wallet-rpay-secures-license-from-ofac-to-continue-operating-in-venezuela/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The approval does not absolve Rpay of its compliance duties, but does eliminate the growing compliance risk, the company said."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-29T16:00:00.000Z",
    "title": "Polygon 2.0 Roadmap Calls for ‘Unified Liquidity,’ Restaking, New Chains on Demand ",
    "url": "https://www.coindesk.com/tech/2023/06/29/polygon-20-roadmap-calls-for-unified-liquidity-restaking-new-chains-on-demand/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The new Ethereum scaling solution’s architecture will include a shared bridge and a “coordination layer” that connects all of Polygon’s chains, including an emphasis on zero-knowledge technology that has become one of this year’s hottest blockchain trends."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-29T15:59:46.000Z",
    "title": "Solana's Cardinal shuts down citing economic conditions",
    "url": "https://cointelegraph.com/news/solana-cardinal-shuts-down-citing-economic-conditions",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/643699d2-c93b-4ccd-8388-38a471cf0247.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to the protocol's closing schedule, part of the operations will cease on July 19, while the withdrawal period ends on August 26.</p>\n                    <p><p>Solana's Cardinal protocol is winding down operations due to economic conditions, nearly a year after raising $4.4 million to improve nonfungible tokens (NFT) utility. According to an announcement on Twitter, withdrawals should be made by August 26. </p><p>Cardinal Labs was an infrastructure provider dedicated to supporting NFT use cases on the Solana network by offering protocols and software development kits (SDKs) for staking, rentals, subscriptions, royalties and trading. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hey Everyone, we have some unfortunate news to share <br><br>After a lot of reflection, we’ve decided to begin the process of winding down our protocols. Let&#39;s dive into it  ⬇️</p>&mdash; Cardinal (@cardinal_labs) <a href=\"https://twitter.com/cardinal_labs/status/1674092964124176387?ref_src=twsrc%5Etfw\">June 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Based on the closing schedule, part of the operations will be halted on July 19, including staking pool creations, token management, NFT rentals and rental extensions, social media handles and new deposits. Withdrawals must be completed by August 26, when the two-month notice period ends.</p><p>\"We’ve done our best to navigate this incredibly difficult macroeconomic environment since we began building 18 months ago, but like for many others, it has been challenging,\" said the Cardinal's team on Twitter, adding that while NFT-based products have seen some real traction, they remain \"stuck in the context of the crypto maximalist community.\"</p><p>In July of 2022, Cardinal<a href=\"https://www.crunchbase.com/funding_round/cardinal-335d-seed--90230997\" target=\"_blank\" rel=\"noopener nofollow\"> raised</a> $4.4 million in a seed funding round co-led by crypto venture firm Protagonist and Solana Ventures, along with Animoca Brands, Delphi Digital, CMS Holdings and Alameda Research — sister company of now bankrupted crypto exchange FTX. According to a spokesperson for Cardinal, Alameda's investment was \"a very small piece of the round\", not contributing to the protocol's financial difficulties. </p><p>Another $750,000 was raised from Neo Ventures in pre-seed funding in 2021. In total, Cardinal's secured $5.2 million in funding over the course of 18 months, with over 65,000 NFTs staked on the protocol as of July 2022. </p><p>Despite challenging times, the NFT market seems slowly maturing. <a href=\"https://dappradar.com/blog/dappradar-dapp-industry-report-q1-2023-defi-nft-crypto\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a recent report from DappsRadar, the NFT market had a good start to the year, with Q1 2023 being the best quarter since Q2 2022. Although March saw a decrease in trade volume, the overall performance remained strong due to intense competition between NFT marketplaces.</p><p><a href=\"https://cointelegraph.com/magazine/4-out-of-10-nft-sales-are-fake-learn-to-spot-the-signs-of-wash-trading/\"><strong><em>Magazine:</em></strong></a><strong><em> </em></strong><a href=\"https://cointelegraph.com/magazine/4-out-of-10-nft-sales-are-fake-learn-to-spot-the-signs-of-wash-trading/\"><strong><em>4 out of 10 NFT sales are fake: Learn to spot the signs of wash trading</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-29T15:40:38.000Z",
    "title": "The SEC is targeting Coinbase, Binance as proxies in its war on crypto",
    "url": "https://cointelegraph.com/news/sec-targeting-coinbase-binance-proxies-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/c30709c3-4404-45fc-9fd6-a919d7107114.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>SEC Chair Gary Gensler’s lawsuits against Coinbase and Binance are a turning point for crypto — and an opportunity to fight back. </p>\n                    <p><p>Imagine your daily commute to work, uninterrupted by traffic lights or stop signs, allowing you to sail smoothly. Suddenly, a new red stop sign disrupts your route, turning a main intersection into a four-way stop overnight. That evening, a letter from local law enforcement shocks you with a hefty retroactive fine for every time you passed the spot where the new sign stands today.</p><p>Absurd as it seems, this analogy encapsulates the United States Securities and Exchange Commission’s approach in its lawsuits against Coinbase and Binance.</p><h2>The SEC throws a one-two punch</h2><p>The SEC alleges in its lawsuits that the two companies operated “unregistered” exchanges and sold “unregistered” securities. Its case against Binance alleges misconduct such as internal wash trading and self-dealing to artificially inflate trading volumes, indicating a focus on appearance over ethical business practices.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/gary-gensler-hurting-little-guys-for-wall-street\"><strong><em>Gary Gensler is hurting the little guys for Wall Street</em></strong></a></p><p>It also questions Binance.US’ independence from its parent company, Binance International, suggesting the latter held significant control over its U.S. branch. The SEC is making that case because it could extend the agency’s jurisdiction to the broader Binance International organization. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today we charged Binance Holdings Ltd. (Binance); U.S.-based affiliate, BAM Trading Services Inc., which, together with Binance, operates <a href=\"https://t.co/swcxioZKVP\">https://t.co/swcxioZKVP</a>; and their founder, Changpeng Zhao, with a variety of securities law violations.<a href=\"https://t.co/H1wgGgR5ir\">https://t.co/H1wgGgR5ir</a> <a href=\"https://t.co/IWTb7Et86H\">pic.twitter.com/IWTb7Et86H</a></p>&mdash; U.S. Securities and Exchange Commission (@SECGov) <a href=\"https://twitter.com/SECGov/status/1665779371108335618?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The SEC also labels multiple products offered on the U.S. platform as securities, including Binance’s BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>), Binance USD (<a href=\"https://cointelegraph.com/binance-usd-busd-price-index\">BUSD</a>), BNB Vault and Simple Earn programs, and highlights the <a href=\"https://www.reuters.com/investigates/special-report/crypto-binance-money/\" target=\"_blank\" rel=\"noopener nofollow\">alleged</a> commingling and diversion of customer funds. The SEC’s action against Binance, given these allegations, suggests a company playing fast and loose with regulations and customer funds.</p><h2>Coinbase: The rule follower?</h2><p>On the other side of the coin (pun intended), we have Coinbase. Coinbase, unlike Binance, has largely adhered to regulations, even becoming a publicly listed, regulated U.S. exchange. Yet, the SEC’s lawsuit alleges Coinbase operates as an unregistered exchange, broker and clearing agency. The SEC claims certain tokens and staking programs Coinbase offers are unregistered securities. Interestingly, the SEC also asserts that Coinbase’s noncustodial digital wallet equates to providing a brokerage service.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/706c377c-f1ea-4566-9fd3-2d65deaa6b3f.jpg\"  /><figcaption style=\"text-align: center;\"><em>Coinbase CEO Brian Armstrong responds to the SEC’s suit. Source: Twitter</em></figcaption></figure><p>The SEC’s decision to label specific tokens as securities suggests an evolving stance to view almost all cryptocurrencies, excluding Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and possibly Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), as securities. Despite these allegations, Coinbase, known for its regulatory compliance and transparency, plans to contest these allegations in court.</p><h2>The road ahead</h2><p>The SEC’s lawsuits against Coinbase and Binance raise critical questions about the SEC’s intentions and the future of crypto. Despite this, some believe the SEC is unlikely to win the suit against Coinbase due to a fatal flaw: SEC Chair Gary Gensler’s admission that the SEC lacks congressional authority to regulate crypto exchanges.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/  If the SEC follows through on its threat to sue <a href=\"https://twitter.com/coinbase?ref_src=twsrc%5Etfw\">@Coinbase</a>, I believe the SEC will lose.<br><br>The SEC&#39;s case has a fatal flaw.<br><br>And the problem is entirely of <a href=\"https://twitter.com/GaryGensler?ref_src=twsrc%5Etfw\">@GaryGensler</a>&#39;s own making.<br><br>Let me explain...</p>&mdash; MetaLawMan (@MetaLawMan) <a href=\"https://twitter.com/MetaLawMan/status/1653821211544092672?ref_src=twsrc%5Etfw\">May 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Coinbase’s CEO, Brian Armstrong, confidently predicts a win for Coinbase, arguing that the SEC’s action is unfair given Coinbase’s efforts to seek regulatory clarity. In a recent Wall Street Journal interview, he said:</p><p>“This is not a good fact pattern for them [the SEC] that a jury or a judge would look at [and] say, ‘Look, this company was formally petitioning you for clarity. They met with you 30 times. They developed their own internal framework working with the best lawyers in the world, and you never gave them any feedback on it. And then you hit them with this enforcement action. That’s not fair, and that’s not good for America.’”</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/ZjLGyWsgbTA\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>This legal battle could take years to resolve. Ideally, Congress would provide clear laws for digital asset markets. Recently, Representatives Patrick McHenry and Glenn Thompson <a href=\"https://financialservices.house.gov/news/documentsingle.aspx?DocumentID=408838\" target=\"_blank\" rel=\"noopener nofollow\">introduced</a> a digital asset market structure proposal aiming to provide regulatory clarity, foster innovation and protect consumers. This development could be a game changer.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-wrong-to-target-gary-gensler\"><strong><em>Crypto enthusiasts are wrong to target Gary Gensler</em></strong></a></p><p>The SEC’s actions could drive crypto companies away from the U.S. and weaken domestic consumer confidence in crypto. This could create opportunities for other jurisdictions such as Hong Kong, Dubai, Singapore and the United Kingdom to attract crypto innovation and capital. </p><p>In the short term, there could be a downturn in crypto stocks, altcoins and U.S.-based crypto startups. Investors may divest toward Bitcoin or stablecoins. In the long term, exchanges may be cautious when dealing with U.S. customers and providing access to what the SEC claims to be securities. For instance, Robinhood announced it would delist tokens for Solana, Cardano and Polygon after the SEC suit named them as securities.</p><h2>Crypto fights back</h2><p>Crypto investors and companies can fight back against these charges and advocate for a more crypto-friendly regulatory environment. Support can be given to advocacy groups like Coin Center, Coinbase and the Digital Freedom Alliance, which are pushing for policies that foster innovation and protect investors.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The <a href=\"https://twitter.com/hashtag/SECStabilizationAct?src=hash&amp;ref_src=twsrc%5Etfw\">#SECStabilizationAct</a> explained ⤵️<br><br>❌ Fires Chair <a href=\"https://twitter.com/GaryGensler?ref_src=twsrc%5Etfw\">@GaryGensler</a> <br><br>✅ All rulemaking, enforcement, &amp; investigations conducted by 6 commissioners <br><br>➕ Creates ED Role for day-to-day operations <br><br>Thank you, <a href=\"https://twitter.com/GOPMajorityWhip?ref_src=twsrc%5Etfw\">@GOPMajorityWhip</a> for helping lead this legislation. <a href=\"https://t.co/QFEHePJh1h\">pic.twitter.com/QFEHePJh1h</a></p>&mdash; Warren Davidson  (@WarrenDavidson) <a href=\"https://twitter.com/WarrenDavidson/status/1668316484198596627?ref_src=twsrc%5Etfw\">June 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Advocacy also involves contacting local congressional leaders to express concerns about the current anti-crypto regulatory climate.</p><p>Some representatives, like Ohio Congressman Warren Davidson, are already advocating for crypto, with Davidson filing the SEC Stabilization Act and the #FireGaryGensler campaign gaining traction on Twitter.</p><p>While the SEC’s lawsuits against Coinbase and Binance are a significant turning point, they also present an opportunity for the crypto community to advocate for its rights and shape the future of crypto in the U.S. Let’s seize it.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Trevor Ward</strong> is the director of content marketing at Bitwave. A graduate of Brigham Young University, he previously co-founded and served as the CEO of Multisig Media.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-29T16:00:38.000Z",
    "title": "Miners sent 260% of their daily revenue to exchanges",
    "url": "https://cryptoslate.com/miners-sent-260-percent-of-their-daily-revenue-to-exchanges/",
    "description": "<p>Bitcoin&#8217;s recent price surge has triggered a massive sell-off among miners, with on-chain data revealing that miners sent an equivalent of 260% of their daily mining revenue to exchanges on June 27. Understanding the behavior of Bitcoin miners and their Bitcoin balances is crucial as miners play a pivotal role in the Bitcoin ecosystem, and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/miners-sent-260-percent-of-their-daily-revenue-to-exchanges/\">Miners sent 260% of their daily revenue to exchanges</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-29T15:45:22.000Z",
    "title": "Biden extols economic progress in Chicago speech, again criticizing “loopholes for crypto traders” in U.S. tax code",
    "url": "https://cryptoslate.com/biden-extols-economic-progress-in-chicago-speech-again-criticizing-loopholes-for-crypto-traders-in-u-s-tax-code/",
    "description": "<p>President Joe Biden has once again commented on the need to close crypto &#8220;loopholes&#8221; while touting his economic policies. Speaking in Chicago, President Biden shared his economic vision for America in what he claimed had been dubbed by legacy media outlets, &#8220;Bidenomics.&#8221; During the speech, he addressed the failures of the trickle-down approach and emphasized [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/biden-extols-economic-progress-in-chicago-speech-again-criticizing-loopholes-for-crypto-traders-in-u-s-tax-code/\">Biden extols economic progress in Chicago speech, again criticizing &#8220;loopholes for crypto traders&#8221; in U.S. tax code</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-06-29T16:03:48.000Z",
    "title": "Coinbase Argues ‘Abuse of Process;’ Seeks to Dismiss SEC Case",
    "url": "https://cryptobriefing.com/coinbase-seeks-dismiss-sec-case/?utm_source=feed&utm_medium=rss",
    "description": "In a bold move against the U.S. Securities and Exchange Commission (SEC), Coinbase has filed a motion to dismiss its SEC&#8217;s lawsuit. The motion, filed on June 29 in the..."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-29T16:00:06.000Z",
    "title": "Biggest Movers: SOL Gains 10%, BCH Hits Fresh 1-Year High",
    "url": "https://news.bitcoin.com/biggest-movers-sol-gains-10-bch-hits-fresh-1-year-high/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2133334627-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SOL 10% Higher, as BCH Hits Fresh 1-Year High\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2133334627-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2133334627-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2133334627-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2133334627-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2133334627-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2133334627-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2133334627.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Solana surged 10% on June 29, after it was confirmed that a new cross-chain bridge will allow users easier access to other blockchains. The update from Debridge will reportedly enable solana users to access ethereum&#x2019;s virtual machine for the first time. Bitcoin cash extended its own gains on Thursday. Solana (SOL) Solana (SOL) was a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T15:59:44.000Z",
    "title": "AI Will Revolutionize Software Development, Enabling Faster and Higher-Quality Code, Says MongoDB CTO",
    "url": "https://www.cryptopolitan.com/ai-will-revolutionize-software-development/",
    "description": "Artificial intelligence (AI) is poised to transform the landscape of software development, empowering developers to write code with unprecedented speed, quality, and completeness. Mark Porter, the Chief Technologist of MongoDB, a leading document database maker, asserts that AI, particularly generative AI like OpenAI&#8217;s ChatGPT, will provide a significant advantage to developers, revolutionizing their productivity and ... <a title=\"AI Will Revolutionize Software Development, Enabling Faster and Higher-Quality Code, Says MongoDB CTO\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-will-revolutionize-software-development/\" aria-label=\"More on AI Will Revolutionize Software Development, Enabling Faster and Higher-Quality Code, Says MongoDB CTO\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T15:58:28.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T15:47:59.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-29T16:00:37.000Z",
    "title": "Crypto News: Polygon drop 3.9% in 24hrs, Community rely on Alex The Doge (ALEX) to gain better positioning",
    "url": "https://nulltx.com/crypto-news-polygon-drop-3-9-in-24hrs-community-rely-on-alex-the-doge-alex-to-gain-better-positioning/",
    "description": "In the fast-paced world of cryptocurrencies, new developments are constant. Recent reports indicate a 3.9% decrease in Polygon&#8217;s (MATIC) value over a 24-hour period. Meanwhile, Alex The Doge (ALEX), a new player on the blockchain, seeks to secure a better positioning in the crypto space. &#62;&#62;&#62;&#62;BUY $ALEX PRESALE NOW&#60;&#60;&#60;&#60; Polygon&#8217;s (MATIC) Value Experiences A Dip [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-29T16:00:37.000Z",
    "title": "Bitcoin Bulls Battle Against Miners’ $128 Million Move: Is The Bull Run In Danger?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bulls-battle-against-miners-128-million-move-is-the-bull-run-in-danger/",
    "description": "Bitcoin&#8217;s (BTC) recent performance has been a source of concern for its investors, as the world&#8217;s largest cryptocurrency struggles to maintain its upward trajectory. While the currency recently recorded a 12-month high slightly above $31,000, it is now facing potential profit-taking as miners signal a massive $128 Million move. Bitcoin Bulls Brace For Impact According to Yan Allemann, co-founder of Glassnode, the miner&#8217;s transfer could lead to significant sell-off pressure in the market. This could cause friction in the current bull run, which has already seen Bitcoin struggle to hold steady at the crucial $30,000 support line. Adding to the uncertainty is that Bollinger Bands, a technical analysis tool used to measure volatility, remains tight despite the low volatility. This has been shown to lead to abrupt market moves in the past, which could cause further complications for Bitcoin bulls. Related Reading: Altcoin Whales Show Highly Active Day, Volatility Incoming? The support at $30,000 is crucial for the revival of the uptrend, and investors are now anxiously watching to see how the market reacts to the miner&#8217;s move. While Bitcoin has faced similar challenges in the past and managed to overcome them, the current situation is causing some concern among market observers. Furthermore, Bitcoin&#8217;s current price stagnation is reflected in its Average Directional Index (ADX) on the daily chart, which is set to spike downward.  This ADX movement suggests that Bitcoin&#8217;s trend for the next 10 days could be to the downside. This development raises the possibility that Bitcoin might either consolidate for the next week-and-a-half, revisit the $29,600 support line, or even drop further to the $28,300 level if the downside movement persists. Either way, it has been a common price action for Bitcoin for the majority of the year to experience periods of correction or consolidation before taking another uptrend. The current ADX movement and potential downside trend are no exception to this pattern, as seen in the chart above. As Bitcoin corrects or consolidates, the liquidity of late-long positions taken from these levels is likely to be absorbed. This is a natural part of market cycles, and it is not unusual for Bitcoin to experience this type of price action. Once the correction or consolidation phase passes and the late longs liquidity is taken from these levels, Bitcoin may be poised to begin another uptrend. This could potentially result in a 6,000-point uptrend, which has been seen in previous cycles. BTC Faces Further Decline Yan Allemann also pointed out other technical indicators that suggest a short-term reversal in Bitcoin&#8217;s price. The Relative Strength Index (RSI) peaked at 72.92 over the weekend, which is within the limit of overbought territory. The RSI has since remained in the upper and lower levels, which indicates a possible decrease in buying pressure. Furthermore, the double-top pattern and the Moving Average Convergence Divergence (MACD) also suggest that a short-term reversal in Bitcoin&#8217;s price may be imminent. The MACD being overbought, along with the RSI at the top level, adds to this likelihood. Related Reading: Compound (COMP) Surges Nearly 10% In The Past Day, Here’s Why However, there are also positive indicators for Bitcoin&#8217;s price. The funding rates remain positive, reflecting bullish sentiment among investors. Additionally, Bitcoin mining stocks have been moving higher, suggesting the potential catalyst for the next major move in Bitcoin&#8217;s price. As of now, BTC trades at $30,500, slightly up by 0.5% in the last 24 hours but failing to conquer the $31,000 mark.  Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-29T16:00:19.000Z",
    "title": "Golteum (GLTM) Joins Chainlink BUILD To Unlock the Potential of Web3 Trading",
    "url": "https://www.crypto-news-flash.com/golteum-gltm-joins-chainlink-build-to-unlock-the-potential-of-web3-trading/?utm_source=rss&utm_medium=rss&utm_campaign=golteum-gltm-joins-chainlink-build-to-unlock-the-potential-of-web3-trading",
    "description": "In an exciting development for the digital asset ecosystem, Golteum has announced that it joined the Chainlink BUILD program, a strategic move to unlock the full potential of Web3 trading.  This move combines Chainlink&#8217;s cutting-edge technology and industry-leading oracle services with Golteum&#8217;s innovative platform, creating a robust infrastructure for secure and efficient trading.  &#62;&#62;&#62; BUY [...]"
  }
]