[
  {
    "source": "Crypto Briefing",
    "date": "2024-03-20T20:43:04.000Z",
    "title": "Exploiters breach Dolomite’s security and drain $1.8 million",
    "url": "https://cryptobriefing.com/dolomite-security-exploit-theft/",
    "description": "Hackers exploited a Dolomite exchange contract, stealing $1.8 million by manipulating user approvals and converting USDC to ETH."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-20T20:48:59.000Z",
    "title": "Cryptopunk #7,804 Sells for $16.38 Million, Second Most Expensive Sold in the Collection",
    "url": "https://news.bitcoin.com/cryptopunk-7804-sells-for-16-38-million-second-most-expensive-sold-in-the-collection/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/10_news_bytes-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Cryptopunk #7,804 Sells for $16.38 Million, Second Most Expensive Sold in the Collection\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/10_news_bytes-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/10_news_bytes-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/10_news_bytes-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/10_news_bytes-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/10_news_bytes-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/10_news_bytes-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/10_news_bytes.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Wednesday, March 20, 2024, Cryptopunk #7,804 exchanged hands for a sum of 4,850 ethereum (ETH), equivalent to $16,382,444. This transaction marked it as the collection&#x2019;s second highest-priced non-fungible token (NFT) sale. It surpassed the transaction of Cryptopunk #3,100, which was clinched 16 days earlier for 4,500 ETH or $16,010,724. The record for the priciest [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-20T20:55:09.000Z",
    "title": "Coinbase’s Base network struggles with surge in traffic and rising fees",
    "url": "https://www.cryptopolitan.com/coinbases-base-network-struggles-with-surge-in-traffic-and-rising-fees/",
    "description": "Coinbase&#8217;s layer-2 blockchain, Base, designed to facilitate lower-fee transactions on the Ethereum network, is currently grappling with a surge in network activity. The increased demand has led to heightened traffic and rising transaction fees, causing disruptions for some users. An official statement on the Coinbase status page revealed that the Base Mainnet is dealing with [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-20T21:00:55.000Z",
    "title": "Bitcoin Pre-Halving Dip Expected: Will BTC Rally Before US Fed Decision?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-pre-halving-btc-rally-us-fed-decision/",
    "description": "Bitcoin remains under pressure when writing and is within a bearish formation following sharp losses on March 19. While prices tank, one analyst on X thinks this retracement aligns with historical performance, especially as the network prepares to slash miner rewards in April 2024.  Bitcoin Retracement Similar To Pre-Halving Cool-Off Of 2020 Based on the analyst&#8217;s assessment, BTC is currently down roughly 18% from its recent swing high. This retracement is at the same level as the ballpark 19% decline observed before the previous halving event in 2020.  It&#8217;s worth noting that Bitcoin has historically corrected lower after posting fresh highs before halving. Afterward, the coin rallies to fresh all-time highs following halving, driven by a decrease in supply. In this cycle, BTC soared to a new all-time high of $73,800 in the first two weeks of March before cooling off to spot rate, a deviation from the usual trend. Related Reading: Analyst Bullish On Polkadot (DOT), Predicts $17 Price Target Before April As the Bitcoin network gears up for the halving event in mid-April 2024, it&#8217;s crucial to note the potential market implications. Some market observers speculate that the current drop could offer entries for investors looking to accumulate at a lower price in anticipation of future price gains.  From the Bitcoin candlestick arrangement in the daily chart, the least resistance path appears southwards. Specifically, following the dip on March 19, the coin remains in a bearish breakout pattern, finding strong rejections from the middle Bollinger Band (BB) or the 20-day moving average. The BB is a technical indicator for gauging volatility. Will The Federal Reserve Revive BTC Demand? Currently, Bitcoin is steady. Even so, only time will tell whether prices will recover, breaking above the $70,000 level in the days leading up to the halving event in less than a month. Further losses from spot rates mean the dip before halving and after the pre-halving rally was much sharper than in 2020. As history clearly shows, halving is an important event in Bitcoin. It has repeatedly proven to be a major price catalyst for Bitcoin, as seen in the last bull cycle when prices rose to roughly $70,000.  Related Reading: Bitcoin Supply On Exchanges Hit 4-Year Low, But Why Is Price Crashing? Accordingly, the coming days will shape how Bitcoin prices evolve in the medium to long term. One key driver of crypto and BTC valuation will be fundamental events, especially pronouncements from the United States Federal Reserve (Fed). The central bank will relay its decision on interest rates on March 20. Earlier in 2022, when interest rates were hiked, prices tanked. Feature image from DALLE, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-20T20:42:02.000Z",
    "title": "Mamram Alumni Association launches first blockchain incubator in Israel, targeting early-stage Web3 startups to boost innovation",
    "url": "https://www.crypto-news-flash.com/mamram-alumni-association-launches-first-blockchain-incubator-in-israel-targeting-early-stage-web3-startups-to-boost-innovation/?utm_source=rss&utm_medium=rss&utm_campaign=mamram-alumni-association-launches-first-blockchain-incubator-in-israel-targeting-early-stage-web3-startups-to-boost-innovation",
    "description": "<img width=\"1200\" height=\"525\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-20T165217.007.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-20T165217.007.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-20T165217.007-300x131.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-20T165217.007-768x336.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-20T165217.007-150x66.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-20T165217.007-450x197.png 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Partnerships with industry leaders like StarkWare and FireBlocks offer startups unparalleled mentorship and access to blockchain expertise. The programme is designed for startups at the ideation phase, aiming to transform ideas into viable blockchain ventures. The Mamram Alumni Association, known for its affiliation with the Israeli Defense Force&#8217;s Centre of Computing and Information Systems, is [...]"
  }
]