[
  {
    "source": "CoinDesk",
    "date": "2023-08-02T20:51:04.000Z",
    "title": "Towards a Web3 Without Wallets",
    "url": "https://www.coindesk.com/consensus-magazine/2023/08/02/towards-a-web3-without-wallets/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "For Web3 to go mainstream, wallets should be as invisible to the users as databases are in Web2, says Ben Turtel, of Kazm."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-02T20:47:59.000Z",
    "title": "TradFi Giant Direxion Joins Crypto ETF Race by Filing for Combined Bitcoin and Ether Futures Fund",
    "url": "https://www.coindesk.com/policy/2023/08/02/tradfi-giant-direxion-joins-crypto-etf-race-by-filing-for-combined-bitcoin-and-ether-futures-fund/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The move comes the same week that six other companies filed to launch ether futures ETFs."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T21:00:00.000Z",
    "title": "Protocol to identify ‘systemically important’ blockchain banks could help prevent a market crash: Study",
    "url": "https://cointelegraph.com/news/protocol-to-identify-systemically-important-blockchain-banks-could-help-prevent-a-market-crash-study",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/20835e9d-49d3-4b0f-adbf-69f9362f5c8d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>After the collapse of Terra, the digital assets sector needed a way to identify critical nodes in the global DeFi community. </p>\n                    <p><p>Kanis Saengchote, a researcher at Chulalongkorn University in Thailand, recently developed a framework for identifying and measuring systemic risk in decentralized finance (DeFi) institutions. </p><p>The new protocol is called the Global Systematically Important Protocol (G-SIP), and it’s based on a similar endeavor instituted in the traditional banking industry.</p><p>After the global banking crisis of 2008, the traditional finance sector collaborated to come up with a protocol for identifying critical banking structures in order to implement strategies for the prevention of future collapses. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ubs-group-doubles-offer-and-acquires-credit-suisse-for-2b\"><strong><em>UBS Group agrees to $3.25B ‘emergency rescue’ of Credit Suisse</em></strong></a></p><p>What they came up with is a system to identify and measure “global systemically important banks” (G-SIBs). This <a href=\"https://www.bis.org/fsi/fsisummaries/g-sib_framework.htm\" target=\"_blank\" rel=\"noopener nofollow\">allowed</a> the Bank for International Settlements to identify weaknesses and establish standards resulting in better protection against losses. </p><p>Saengchote’s research paper <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4526574\" target=\"_blank\" rel=\"noopener nofollow\">details</a> a method by which a similar standard could be applied to what the paper refers to as “blockchain banks,” essentially any DeFi protocol running on a blockchain.</p><p>Per the research paper: </p><blockquote>“Identifying systemic risk and creating contingencies to handle emergencies are important because of the self-reinforcing nature of financial interactions and fire sale-induced deleveraging.”</blockquote><p>Due to the algorithmic nature of DeFi, deleveraging can occur relatively quickly. This was <a href=\"https://cointelegraph.com/news/terra-luna-crash-anniversary-community-reflects-on-the-lessons-learned\">evident in the Terra collapse</a>. According to Saengchote, this can create a destabilizing loop that sends protocols into a “death spiral.” </p><p>The resulting fire sale — a period where asset holders across multiple institutions sell en masse for below market value — could cause rippling illiquidity throughout the connected ecosystem.</p><p>G-SIP measures how the various DeFi protocols interact and identifies which nodes in the network have outsized influence. To define the protocol’s parameters, Saengchote studied four separate protocols representing 88% of the “blockchain banks” on the Ethereum blockchain (Aave, Compound, Liquity and MakerDAO).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/1e0bde2c-bf15-4799-bc9a-f62a2533bed4.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>G-SIB to G-SIP adaptation. Source: Saengchote, 2023</em></figcaption></figure><p>Upon analysis, MakerDAO scored the highest across the G-SIP categories. According to Saengchote, this is “due to its complexity and interconnectedness.” MakerDAO received a score of 37 on the G-SIP rating scale. It was followed by Aave (31.56), Compound (28) and Liquity (4.57). </p><p>The researcher notes, “Because of its small size, Liquity’s score is the lowest among all categories. Nevertheless, as of July 2023, it is the 14th largest protocol in Ethereum.”</p><p>In context, this means that MakerDAO has a potentially higher risk profile than the three other protocols and would thus have higher capital requirements to properly mitigate those risks.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/protocol-to-identify-systemically-important-blockchain-banks-could-help-prevent-a-market-crash-study&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T21:00:56.000Z",
    "title": "Binance faces potential fraud charges from U.S.",
    "url": "https://www.cryptopolitan.com/binance-face-potential-fraud-charges-from-us/",
    "description": "In a daunting turn of events that could reshape the landscape of the cryptocurrency industry, Binance, the world&#8217;s largest crypto exchange, finds itself under the stern eye of U.S. authorities, as it faces potential fraud charges. The U.S. Department of Justice&#8217;s contemplation of charges is tainted with apprehension over the detrimental fallout to consumers and ... <a title=\"Binance faces potential fraud charges from U.S.\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-face-potential-fraud-charges-from-us/\" aria-label=\"More on Binance faces potential fraud charges from U.S.\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T20:40:44.000Z",
    "title": "FTX-listed altcoins surge due to Twitter and Elon Musk",
    "url": "https://www.cryptopolitan.com/ftx-listed-alts-surge-due-to-twitter-musk/",
    "description": "The cryptocurrency market has never been short of drama, but the recent link between one of the world&#8217;s largest social media platform, now known as X Corp, and FTX&#8217;s altcoins goes beyond anything we&#8217;ve seen before. It&#8217;s a tale of tweets, bots, and influence, where a single online gesture from a billionaire entrepreneur can cause ... <a title=\"FTX-listed altcoins surge due to Twitter and Elon Musk\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ftx-listed-alts-surge-due-to-twitter-musk/\" aria-label=\"More on FTX-listed altcoins surge due to Twitter and Elon Musk\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-02T21:00:04.000Z",
    "title": "BNB Nears $250 Level As Market Suffers Volatility; What’s Driving It?",
    "url": "https://www.newsbtc.com/news/binance-coin/bnb-nears-250-level-as-market-suffers-volatility-whats-driving-it/",
    "description": "Binance’s utility coin BNB has posted significant gains, surprising investors as the broader crypto market slumps. Bitcoin and Ethereum, including most altcoins, have gone on recess while BNB surges amid rapid expansion plans on the Binance ecosystem. BNB’s spike on Tuesday, August 1, hinged on Binance&#8217;s announcement about the asset&#8217;s debut in the Japanese market through its newly launched subsidiary, Binance Japan. BNB jumped dramatically from $236.8555 to $246.0655, a nearly 4% increase, immediately after the news circulated the market.  BNB Price Bullish Amid Japanese Debut It is noteworthy that BNB is launching on Binance Japan for the first time since the history of Binance. Moreover, Binance Japan is the only Japanese exchange offering the token on its platform. Therefore, venturing into a new market is like achieving a major milestone for BNB and could guarantee a wider user base and increased daily transactions for the token. Alongside the announcement for the launch of Binance Japan, Binance is offering spot and leverage crypto trading on 34 cryptocurrencies. This vast list potentially entails more transactions on Binance, leading to more BNB spending as the platform&#8217;s utility token. Related Reading: Sell The News? Litecoin Traders Capitulate Ahead Of Today’s Halving But surprisingly, the price increase is not reflected in BNB&#8217;s trading volume, down over 47% in a 24-hour period. CoinMarketCap data shows BNB recorded over $1 billion in trading volume toward the close of Monday’s trading session.  The token saw an over 253% surge in trading volume on July 31, which didn&#8217;t reflect its nearly 1% price decline during the same period. After the sudden surge in trading activity and price, BNB&#8217;s movement has stalled as 24-hour trading volume stands at $734 million, with a 0.6% price increase in the last 24 hours. As of the time of writing, BNB trades at $242.9, inching closer to the $250 level as traders accumulate the token in anticipation of major rallies as it trades live on Binance Japan in the coming days.  BNB Vies For More Rallies As It Prepares To Conquer Key Resistance Levels Binance Coin (BNB) trades above three key support levels: $240.4, $242.0, and $243.3. The bulls found strength at $242.0 and $243.3 price levels, facilitating the sharp spike to $246.065 in the early hours of August 1. The chart demonstrates heated strife between the bulls and the bears as they struggle to prevail over the market. However, the stiff resistance at the $246.5 price level allowed the sellers to trigger a trend reversal. The bears have formed bearish candle sticks above the $243.3 price level and are striving to press the token further below. Related Reading: Weeks of Prosperity: MKR Holders See Wealth Grow By Over 100% Amidst Price Boom BNB is in a critical conjecture as the next few hours determine whether a move to the $250 target is possible. A break above the $246.5 level will facilitate more rallies. Conversely, if the bulls relent, BNB could retrace to the $241.3 level, allowing the bears an opportunity to soar. Featured image from Pixabay and chart from TradingView.com"
  }
]