[
  {
    "source": "CoinDesk",
    "date": "2023-11-28T16:02:05.000Z",
    "title": "Protocol Village: Cube.Exchange Emerges From Private Beta to Early Access",
    "url": "https://www.coindesk.com/tech/2023/11/27/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Nov. 23-29, with live updates throughout."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-28T16:00:26.000Z",
    "title": "dYdX Chain completes mainnet migration, rolls out $20 million in DYDX token rewards",
    "url": "https://cryptoslate.com/dydx-chain-completes-mainnet-migration-rolls-out-20-million-in-dydx-token-rewards/",
    "description": "<p>The decentralized trading platform dYdX Chain has achieved a significant milestone, transitioning from its &#8216;Beta Stage&#8217; to &#8216;Full Trading&#8217; as of Nov. 28. The initiation on the dYdX Chain was activated following a dYdX governance vote, showcasing the platform&#8217;s focus on decentralized decision-making and community-driven development. Major markets such as BTC-USD, ETH-USD, SOL-USD, and LINK-USD [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/dydx-chain-completes-mainnet-migration-rolls-out-20-million-in-dydx-token-rewards/\">dYdX Chain completes mainnet migration, rolls out $20 million in DYDX token rewards</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-28T16:05:50.000Z",
    "title": "Bitcoin Bucharest: Pioneering Crypto-Real Estate Investments at CEE Fintech Event",
    "url": "https://cryptodaily.co.uk/2023/11/bitcoin-bucharest-pioneering-crypto-real-estate-investments-at-cee-fintech-event",
    "description": "Bitcoin Bucharest: Pioneering Crypto-Real Estate Investments at CEE Fintech Event"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-28T15:45:25.000Z",
    "title": "Grow Protocol Raises Over $15k In First Hours Of ICO Start",
    "url": "https://cryptodaily.co.uk/2023/11/grow-protocol-raises-over-15k-in-first-hours-of-ico-start",
    "description": "Coinscribble - November 28th, 2023 / In a pioneering development in the Web3 realm, GROW Protocol announces its debut as the “world’s first real blockchain passive income coin”."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-28T16:05:39.000Z",
    "title": "Bitcoin Bucharest: Pioneering Crypto-Real Estate Investments at CEE Fintech Event",
    "url": "https://www.cryptopolitan.com/bitcoin-bucharest-pioneering-crypto-real-estate-investments-at-cee-fintech-event/",
    "description": "Bucharest, Romania, November 28th, 2023, Chainwire The excitement surrounding Bitcoin Bucharest&#8217;s second edition intensifies as the conference emerges as the hallmark event of the CEE Fintech &#38; Blockchain Week Autumn edition. This bi-annual extravaganza is not only a convergence of free minds in crypto, blockchain, web 3.0, metaverse, and NFT but also a gateway to ... <a title=\"Bitcoin Bucharest: Pioneering Crypto-Real Estate Investments at CEE Fintech Event\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-bucharest-pioneering-crypto-real-estate-investments-at-cee-fintech-event/\" aria-label=\"More on Bitcoin Bucharest: Pioneering Crypto-Real Estate Investments at CEE Fintech Event\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-28T15:46:49.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-28T15:44:58.000Z",
    "title": "Binance Futures Introduces New ETHW Perpetual Contract",
    "url": "https://www.cryptopolitan.com/binance-futures-new-ethw-perpetual-contract/",
    "description": "In a development for the cryptocurrency trading community, Binance Futures, the futures trading platform of the renowned global cryptocurrency exchange Binance, has announced the introduction of a new trading instrument that is set to revolutionize the market. The platform is gearing up to launch the USDⓈ-M ETHW Perpetual Contract. The move underscores Binance&#8217;s commitment to ... <a title=\"Binance Futures Introduces New ETHW Perpetual Contract\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-futures-new-ethw-perpetual-contract/\" aria-label=\"More on Binance Futures Introduces New ETHW Perpetual Contract\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-28T15:48:43.000Z",
    "title": "Analyst bullish on Cardano, new token likely to surge",
    "url": "https://crypto.news/analyst-bullish-on-cardano-new-token-likely-to-surge/",
    "description": "As the market recovers, Cardano and Bitcoin Minetrix are on focus. Analysts expect these coins to edge higher"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-28T15:41:28.000Z",
    "title": "Canaan’s Q3 Bitcoin mining revenue declines by nearly 80%",
    "url": "https://crypto.news/canaans-q3-bitcoin-mining-revenue-declines-by-nearly-80/",
    "description": "Canaan reports significant mining loss in Q3 2023 but reflects a resilient year-on-year performance."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-28T16:00:31.000Z",
    "title": "Shiba Inu Burn Rate Skyrockets Close To 500,000% in 24 Hours",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-burn-rate-skyrockets-close-to-500000-in-24-hours/",
    "description": "Shiba Inu (SHIB), an Ethereum-based altcoin has recently garnered the attention of the cryptocurrency community and investors as the token&#8217;s burn rate experienced a massive surge. Shiba Inu Burn Rate Increases Significant The Shiba Inu burn rate recently increased significantly by 499,416% in a 24-hour period between Sunday and Monday. Data from Shibburn &#8211; the platform that tracks SHIB token burns, shows this marks a new record for the token&#8217;s burn initiative. It also highlights the renewed strength of the community&#8217;s attempts to manage its token total supply. Related Reading: Shiba Inu Community Project Calls Out Founders For Refusing To Burn 103 Trillion SHIB Furthermore, the data also shows that over 264.20 million SHIB tokens were burned on the same day. The recent uptick in the SHIB burn rate can be traced back to several burn transactions. However, a single transaction that was carried out by an unknown wallet address is believed to have buttressed the surge. According to the data available, the unknown wallet address transferred approximately 261.4 million SHIB tokens to a burn wallet on Monday. An important turning point in the SHIB burn initiative was reached with this transaction alone. This is because the transaction made up about 98% of all the tokens burned during this time. Another transaction also garnered significant attention in the community. The wallet transferred approximately 21.52 million SHIB tokens to a burning wallet. These kind of transactions are significant because it reduces the total supply of SHIB tokens in circulation. Over 410.66 trillion SHIB tokens have been burned from its total supply in circulation. Currently, the total supply of SHIB tokens in circulation is sitting at approximately 589.35 trillion tokens, according to CoinMarketCap. The Importance Of SHIB Revealed A Shiba Inu community member has recently revealed the importance of the SHIB tokens in the Shiba Inu ecosystem. The member suggests that people need to read the Shibpaper to know the role of the token. Related Reading: Shiba Inu Marketing Lead Reveals The Important Role Of SHIB In The Shibarium Ecosystem They took to X (formerly Twitter) to share a screenshot of the project&#8217;s whitepaper on the role of the SHIB token. According to the screenshot, the tokens serve as the ecosystem&#8217;s legislative instrument as it states that SHIB tokens &#8220;propels legislative machinery.&#8221; It also grants every Shibizen an equitable voice in molding the project&#8217;s journey. The screenshot read: The Shib token allows for symbolically propels our legislative machinery. Embodying our democratic fabric, it grants every Shibizen an equitable voice in molding our shared journey. From council elections to legislative votes, the Shib token guarantees transparency and participative democracy. The recent spike in burn rate has provided the SHIB community with a newfound hope, even though the road to a significant price gain appears long. With over 500 trillion SHIB tokens still in circulation, the community is still positive about potential price gains ahead. Featured image from iStock, chart by Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-28T16:00:25.000Z",
    "title": "DOGE Mania: 5 Million Strong – Dogecoin Holders Break Records",
    "url": "https://www.crypto-news-flash.com/doge-mania-5-million-strong-dogecoin-holders-break-records/?utm_source=rss&utm_medium=rss&utm_campaign=doge-mania-5-million-strong-dogecoin-holders-break-records",
    "description": "<img width=\"1200\" height=\"700\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Dogecoin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Data from Whale Alert indicates that an extremely old dogecoin address has suddenly shown signs of activity within the last 24 hours.\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Dogecoin.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Dogecoin-300x175.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Dogecoin-1024x597.jpg 1024w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Dogecoin has broken a new record with 5 million address counts. DOGE  has extended its influence as the top memecoin in the crypto world. Dogecoin (DOGE), a popular memecoin created as a joke, has extended its growth strides per insights gleaned from its on-chain data. According to reports, the number of DOGE holders surpassed an [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-28T15:50:17.000Z",
    "title": "Shiba Inu Expands Reach and Shares Insights in Fourth Edition of Shiba Inu Magazine",
    "url": "https://www.crypto-news-flash.com/shiba-inu-expands-reach-and-shares-insights-in-fourth-edition-of-shiba-inu-magazine/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-expands-reach-and-shares-insights-in-fourth-edition-of-shiba-inu-magazine",
    "description": "<img width=\"512\" height=\"290\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/shiba-inu-shib-coins.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Layer 2 shibarium testnet launch, Shiba Inu\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/shiba-inu-shib-coins.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/shiba-inu-shib-coins-300x170.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Shiba Inu Reveals Trends and Achievements in Fourth Edition. CoinMerge Reinforces Support: Moves Operations to Shibarium Solution. Shiba Inu, the blockchain project known for its Shiba token, has unveiled the fourth edition of its weekly Shib Magazine, accompanied by a generous giveaway of NFT 7,000. The team behind Shiba Inu, in a recent tweet, announced [...]"
  }
]