[
  {
    "source": "Cointelegraph",
    "date": "2024-03-01T09:21:28.000Z",
    "title": " State attorneys general argue SEC overstepped in Kraken lawsuit  ",
    "url": "https://cointelegraph.com/news/attorneys-general-sec-overstepped-kraken-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMzRmMDgxZGMtMmQxYS00Zjk0LWE4ZjItZDFhZjhkZDI1MGYxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Attorneys general from numerous states filed a brief that calls out the SEC for its enforcement action against the Kraken crypto exchange, saying it used “undelegated authority.” </p>\n                    <p><p data-ct-non-breakable=\"true\">Eight state attorneys general in the United States filed a joint amicus brief which argues that the Securities and Exchange Commission (SEC) has overstepped its delegated power in the lawsuit against the cryptocurrency exchange Kraken. </p><p>The brief was filed on Feb. 29 by officials from Arkansas, Iowa, Mississippi, Montana, Nebraska, Ohio, South Dakota and Texas, along with other participants including industry lobbyists. </p><p>According to the filing, state officials said that it is not in support of either of the parties, rather it “opposes the SEC’s regulation of crypto assets absent an investment contract because Congress has not delegated this authority to the SEC.”</p><p><a href=\"https://cointelegraph.com/news/attorneys-general-sec-overstepped-kraken-lawsuit\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-01T09:20:04.000Z",
    "title": "‘ADA Whale’ Says Cardano Continues To Defy Critics: “The Fundamental Story of Cardano Is Still Not Going Away”",
    "url": "https://www.cryptoglobe.com/latest/2024/03/ada-whale-says-cardano-continues-to-defy-critics-the-fundamental-story-of-cardano-is-still-not-going-away/",
    "description": "On February 29, pseudonymous Cardano (ADA) analyst, educator, and investor “ADA whale” shared their thoughts on the price performance of Cardano’s ADA token on social media platform X. ADA Whale says their journey with Cardano has been long and varied, with involvement at price points ranging from $0.02 to $3.10 and many in between. They […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-01T09:15:22.000Z",
    "title": "World’s First Bitcoin DEX – SatoshiDEX Announced $SDEX Pre-Sale",
    "url": "https://cryptodaily.co.uk/2024/03/worlds-first-bitcoin-dex-satoshidex-announced-sdex-pre-sale",
    "description": "World’s First Bitcoin DEX – SatoshiDEX Announced $SDEX Pre-Sale"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-01T09:27:38.000Z",
    "title": "Elon Musk Sues OpenAI Over Alleged Betrayal of Non-Profit Values",
    "url": "https://www.cryptopolitan.com/elon-musk-sues-openai-over-alleged-betrayal/",
    "description": "Elon Musk has initiated legal action against OpenAI, along with its CEO Sam Altman and president Greg Brockman, accusing them of breaching their founding principles. The lawsuit, filed in the Superior Court of California, County of San Francisco, alleges that OpenAI&#8217;s transition from a non-profit organization to a for-profit entity, particularly its affiliation with tech [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-01T09:15:25.000Z",
    "title": "World’s First Bitcoin DEX – SatoshiDEX Announced $SDEX Pre-Sale",
    "url": "https://www.cryptopolitan.com/worlds-first-bitcoin-dex-satoshidex-announced-sdex-pre-sale/",
    "description": "London, UK, March 1st, 2024, Chainwire SatoshiDEX.ai, a pioneering Bitcoin DeFi platform, has announced the start of a 2nd Round of $SDEX Pre-Sale. After successfully raising $700,000 in Stage 1, now the Stage 2 is live and open to the community! SatoshiDex is led by a team committed to reshaping decentralized finance. While focuses on [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-01T09:20:46.000Z",
    "title": "Bitcoin OTC Desks ‘Dried Up To 40 BTC’: What This Means",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-otc-desks-dried-up-to-40-btc/",
    "description": "The availability of Bitcoin (BTC) on Over-the-Counter (OTC) desks has sharply decreased, with reports suggesting that at one point, only about 40 BTC were available for sale. This news has significant implications for the market and could herald a new era in BTC trading dynamics. OTC Desks Had 40 Bitcoin Available On Wednesday Caitlin Long, the CEO and founder of Custodia Bank, provided an eye-opening account of the current state of the OTC Bitcoin market. Through a series of posts on X (formerly Twitter), Long noted, &#8220;The #HODLgang has mostly held…I spent time in NYC over the past couple of days and it’s clear why the Bitcoin price spiked this week: there was almost no BTC available for sale on the big OTC desks.&#8221; Related Reading: JPMorgan Analysts Predict Bitcoin Crash To $42,000 Post-Halving – What You Need To Know Echoing Long&#8217;s observations, Samuel Andrew, a noted figure in the crypto space, added, &#8220;OTC desks are nearly dried up. Very little Bitcoin available that&#8217;s easily accessible to meet demand. BlackRock and Fidelity are moving size in ways crypto has never seen before.&#8221; Long added: Only ~40 BTC were available for sale at any price at one point on Wednesday, I was told by a credible source… This scarcity of BTC on OTC desks is not an isolated incident but part of a broader trend indicating a significant shift in the market. Glassnode, a leading blockchain data and analytics firm, reported that Bitcoins held by OTC desks are at their lowest level in five years. Although Glassnode tracks only a portion of the OTC market, the data points to a clear trend of dwindling BTC availability. What This Means For BTC Price The implications of this trend are manifold. Firstly, it suggests a potential supply shock in the Bitcoin market, driven by increased demand from institutional investors and large corporations looking to add Bitcoin to their portfolios, as well as the introduction of spot Bitcoin ETFs. This supply shock could lead to a shift in price discovery from OTC desks to public exchanges, where the real market price of Bitcoin will be determined more transparently. Related Reading: Where Are We In This Bitcoin Cycle? Galaxy Lead Researcher Answers The shortage of Bitcoin on OTC desks also means that large investors and ETFs like BlackRock and Fidelity, who traditionally bought Bitcoin in bulk at a discount through these desks, may no longer have this option. This could further drive demand on public exchanges, potentially leading to significant price movements. Analysts are already speculating on the possible outcomes of this situation. Alessandro Ottaviani, a prominent analyst, suggested, &#8220;After today, god candles ($10k in the daily), before the halving are possible and realistic.&#8221; This sentiment was echoed by Francis Pouliot, CEO of Bull Bitcoin, who remarked on the self-correcting nature of the market: &#8220;OTC desks like http://BULLBITCOIN.COM never run out of Bitcoin. The price goes up, and people sell. If people don&#8217;t sell, the price goes up more.&#8221; Adam Back, a Bitcoin OG and cypherpunk, provided a bullish outlook, stating, &#8220;$100k by halving day. People starting to believe. Bears, leveraged shorts rekt, scared-off, profit take limit orders moved upwards or just deleted to wait-and-see; OTC desks out of coins, daily $500m / 10k BTC ETF buy walls. This can gap upwards fast. 51 days to go [until Halving].&#8221; In conclusion, the depletion of BTC supply on OTC desks marks a pivotal moment for the market. With the upcoming halving event in April and institutional interest at an all-time high, the stage is set for potentially unprecedented movements in the Bitcoin market. At press time, BTC traded at $61,903. Featured image created with DALLE, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-01T09:30:35.000Z",
    "title": "BlackRock Expands Reach with Spot Bitcoin ETF in Brazil: Introducing IBIT",
    "url": "https://www.crypto-news-flash.com/blackrock-expands-reach-with-spot-bitcoin-etf-in-brazil-introducing-ibit/?utm_source=rss&utm_medium=rss&utm_campaign=blackrock-expands-reach-with-spot-bitcoin-etf-in-brazil-introducing-ibit",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BlackRock\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />BlackRock&#8217;s Bitcoin ETF expansion to Brazil signifies growing global cryptocurrency acceptance. Lark Davis&#8217;s tweet highlights the untapped potential of the bullish cryptocurrency market. BlackRock, the world&#8217;s leading investment asset management firm, is setting its sights on Brazil for the launch of its flagship Bitcoin ETF, named IBIT. This strategic expansion comes shortly after the firm&#8217;s [...]"
  }
]