[
  {
    "source": "CoinDesk",
    "date": "2023-07-20T12:00:00.000Z",
    "title": "Sam Bankman-Fried and FTX Get Spoofed in New Animated Comedy Starring T.J. Miller",
    "url": "https://www.coindesk.com/web3/2023/07/20/sam-bankman-fried-and-ftx-get-spoofed-in-new-animated-comedy-starring-tj-miller/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "An upstart Web3 studio satirizes the FTX saga in a new “interactive” series called \"FORTUN3,\" debuting this fall."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-20T11:55:12.000Z",
    "title": "UK Financial Regulator to Introduce Digital Sandbox",
    "url": "https://www.coindesk.com/policy/2023/07/20/uk-financial-regulator-to-introduce-digital-sandbox/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "During a pilot phase, the environment was used to test the eco-friendliness of decentralized ledgers."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-20T11:42:29.000Z",
    "title": "UK government rejects lawmakers call to treat crypto like gambling ",
    "url": "https://cointelegraph.com/news/crypto-uk-rejects-regulating-crypto-gambling",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/d8cd52e0-9e1c-421e-9030-e1c4df0deb4a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The government added that they are already working on regulating the crypto market and a proposed regulatory legislation was laid before parliament and debated last month.</p>\n                    <p><p>The United Kingdom government has <a href=\"https://committees.parliament.uk/publications/40999/documents/199652/default/\" target=\"_blank\" rel=\"noopener nofollow\">rejected </a>a proposal made by the U.K. Treasury Committee to regulate crypto retail trading in the same way it oversees gambling, stressing that it \"firmly disagrees\" with the Committee's stance. </p><p>A panel of British lawmakers <a href=\"https://cointelegraph.com/news/crypto-regulated-as-gambling-uk-treasury\">called for regulating the crypto market in the country similar to gambling</a> in a May 17 House of Commons Committee <a href=\"https://committees.parliament.uk/publications/39945/documents/194832/default/\" target=\"_blank\" rel=\"noopener nofollow\">report</a>. The Treasury Committee said that the crypto investment activity is consistent with the principle of “same risk, same regulatory outcome.”</p><p>U.K financial services minister Andrew Griffith, in a response on July 20 to the committee, rejected the proposal and said that the HM Treasury firmly disagrees with the “Committee’s recommendation to regulate retail trading and investment activity in unbacked cryptoassets as gambling rather than as a financial service”.</p><p>In the U.K. all forms of gambling are governed under the Gaming Act of 2005. Businesses including bingo halls, lotteries, betting shops, online bookmakers, and casinos are under scrutiny in an effort to curb compulsive gambling and implement anti-money laundering measures. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/uk-treasury-drops-plans-for-royal-mint-nft\"><strong><em>UK Treasury drops plans for Royal Mint NFT</em></strong></a></p><p>The government response noted that such an approach has the potential to completely counter the globally agreed recommendations from international organisations and standard-setting bodies. The British government belive the committee’s recommendations can potentially create unclear and overlapping mandates between financial regulators and the Gambling Commission.</p><p>The government added that they are already working on regulating the crypto market and a proposed regulatory legislation was laid before parliament and debated last month. Talking about setting standards for the crypto industry and crypt firms, the government noted: </p><blockquote>“HM Treasury and the FCA will work with the industry to ensure crypto firms are made fully aware of the standards required for approval at the FSMA gateway. Further communications will be provided in due course to ensure standards for approval are clearly available to crypto firms operating in the UK. \"</blockquote><p>The government also said that this legislation may come into force by late 2023 while stressing that the committee’s recommendations were also taken into consideration.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/crypto-kuwait-bans-crypto-and-virtual-assets-transactions&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><em><strong>Magazine: </strong></em><strong><em><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\">Unstablecoins: Depegging, bank runs and other risks loom</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-20T12:05:52.000Z",
    "title": "Terraform Labs Names Former COO Chris Amani as CEO: WSJ",
    "url": "https://cryptobriefing.com/terraform-labs-names-former-coo-chris-amani-as-ceo-wsj/?utm_source=feed&utm_medium=rss",
    "description": "Terraform Labs, the blockchain company which collapsed in May 2022, has been appointment of former chief operating officer (COO) Chris Amani as its new interim Chief Executive Officer (CEO), according..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-20T12:00:00.000Z",
    "title": "Tesla BTC Holdings Unchanged In 2023 Q2",
    "url": "https://cryptodaily.co.uk/2023/07/tesla-btc-holdings-unchanged-in-2023-q2",
    "description": "<p>Elon Musk&rsquo;s company has continued to hodl its BTC reserves for the fourth consecutive quarter after it was forced to divest 75% of its reserves back in 2022 Q2.&nbsp;</p>\nTesla Holding On To Its BTC\n<p>The electric car company, Tesla, helmed by billionaire inventor Elon Musk recently announced that it had held on to its BTC reserves for the second quarter of 2023. Tesla (TSLA) remained inactive in the Bitcoin market, refraining from any purchases or sales of the cryptocurrency for the fourth consecutive quarter. The company's earnings release, issued after the market's closing on Wednesday, confirmed this trend.</p>\nTesla&rsquo;s Digital Assets\n<p>The value of Tesla's digital assets at the end of the quarter held steady at $184 million, the same figure reported for the past three quarters. During Q2, the price of Bitcoin experienced a slight increase, rising from approximately $28,500 at the end of Q1 to around $30,400.</p>\n<p>However, accounting regulations restricted Tesla from adjusting the valuation of its digital assets upwards in response to rising BTC prices unless the assets were sold. Nonetheless, the valuation could be reduced in the event of price declines, even before any sales occurred.</p>\nTesla&rsquo;s BTC Investment\n<p>Tesla initially acquired $1.5 billion worth of BTC in early 2021, which significantly boosted the crypto&rsquo;s demand and price tag. CEO Elon Musk had also simultaneously made the announcement back then that the company would accept BTC payments for the Tesla cars, spurring even further interest in the crypto, which soon hit its all-time highest. However, Musk soon rescinded this proposal, declaring that BTC needed to be more environmentally friendly for this to happen.&nbsp;</p>\nSelling Off 75% BTC\n<p>Tesla, however, had to divest a significant portion of its BTC reserves in the second quarter of 2022 over liquidity concerns. The Tesla Gigafactory in Shanghai had been shut down for over 2 months due to the Covid-19 pandemic, resulting in a serious liquidity crisis for the company. It had to sell off over 30,000 BTCs, which amounted to about 75% of its holdings at the point, raking in a whopping $936 million, leaving around 9720 BTCs in its reserves.&nbsp;</p>\n<p>In its latest report, the company revealed that since then, it had not engaged in any BTC transactions, neither selling nor buying. Even during the significant market upheaval of January 2023, the company continued to hodl its BTC, despite amassing a loss of $140 million on its net Bitcoin holdings in 2022.&nbsp;</p>\nTesla&rsquo;s Reported Earnings\n<p>Regarding its financial performance, Tesla reported adjusted earnings per share of $0.91 for the second quarter. This result surpassed the consensus analyst estimate of $0.80, as reported by FactSet. Moreover, the company's revenue for the quarter amounted to $24.9 billion, exceeding analyst estimates of $24.2 billion.</p>\n<p>Throughout Q2 2023, Tesla's bitcoin holdings remained constant, showcasing the company's decision to remain on the sidelines of the volatile cryptocurrency market. Despite this, Tesla's financial performance and stock price continue to exhibit strength and resilience. As the electric car industry continues to evolve, investors and analysts keep a close eye on Tesla's movements in both the traditional markets and the ever-changing world of digital assets.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T11:56:58.000Z",
    "title": "How Can ERC-6551 Transform NFTs and Gaming?",
    "url": "https://www.cryptopolitan.com/how-can-erc-6551-transform-nfts-and-gaming/",
    "description": "ERC-6551, the “Transformable NFT” standard, has emerged as a groundbreaking development in non-fungible tokens (NFTs) and gaming. With its unique capabilities, ERC-6551 holds the potential to revolutionize the way NFTs are utilized in the gaming industry, opening up new realms of interactivity and user engagement. Traditionally, NFTs have been static digital assets, representing ownership of ... <a title=\"How Can ERC-6551 Transform NFTs and Gaming?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-can-erc-6551-transform-nfts-and-gaming/\" aria-label=\"More on How Can ERC-6551 Transform NFTs and Gaming?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T11:54:05.000Z",
    "title": "French experts weigh in on SEC’s stumbling crypto litigation approach",
    "url": "https://www.cryptopolitan.com/french-experts-on-secs-crypto-regulation/",
    "description": "Bonjour!! According to recent reports, French officials have taken pride in their crypto-ready legislation, which contrasts with the SEC&#8217;s halting enforcement campaign. In addition, French officials are interested in the next iteration of Web3 gaming regulations. In the rapidly evolving crypto landscape, legal matters surrounding digital assets have become a pressing concern for regulatory authorities ... <a title=\"French experts weigh in on SEC&#8217;s stumbling crypto litigation approach\" class=\"read-more\" href=\"https://www.cryptopolitan.com/french-experts-on-secs-crypto-regulation/\" aria-label=\"More on French experts weigh in on SEC&#8217;s stumbling crypto litigation approach\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T11:53:31.000Z",
    "title": "UK government’s shocking rejection of crypto regulation sparks controversy",
    "url": "https://www.cryptopolitan.com/uk-shocking-rejection-of-crypto-regulation/",
    "description": "The UK government has rejected a proposal from lawmakers to regulate cryptocurrencies in a manner similar to gambling, arguing that its existing plans are better suited to address the risks associated with events like the collapse of FTX, a prominent crypto exchange. The rejection was outlined in a document published on Thursday, which responded to ... <a title=\"UK government&#8217;s shocking rejection of crypto regulation sparks controversy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-shocking-rejection-of-crypto-regulation/\" aria-label=\"More on UK government&#8217;s shocking rejection of crypto regulation sparks controversy\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T11:42:30.000Z",
    "title": "How is EIP-1153 a game-changer for the EVM ecosystem?",
    "url": "https://www.cryptopolitan.com/eip-1153-game-changer-evm-ecosystem/",
    "description": "In the ever-evolving landscape of blockchain technology, the Ethereum Virtual Machine (EVM) has remained a prominent platform, enabling the creation and execution of decentralized applications (dApps) and smart contracts. As the demand for more efficient and interactive dApps grows, the need for significant advancements within the EVM ecosystem becomes increasingly crucial. Enter Ethereum Improvement Proposal ... <a title=\"How is EIP-1153 a game-changer for the EVM ecosystem?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eip-1153-game-changer-evm-ecosystem/\" aria-label=\"More on How is EIP-1153 a game-changer for the EVM ecosystem?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-20T12:04:35.000Z",
    "title": "Stellar Makes Surprise 70% Rally – Start Of Something Big For XLM?",
    "url": "https://www.newsbtc.com/news/stellar-makes-surprise-70-rally-start-of-something-big-for-xlm/",
    "description": "Stellar (XLM) has registered a surprise surge, catapulting itself into the forefront of the crypto market frenzy. Beginning July 18, this surge has taken the digital asset on a solid price rally, propelling its value to new heights. Currently, XLM is trading at $0.1617, representing a 22.1% increase over the past 24 hours. Even more remarkable is its exceptional performance over the previous week, which has soared by 68.8%, and dominating the top 100 roster of cryptocurrencies. Source: Coingecko Now, the question on everyone&#8217;s mind is: What is driving this surge? XLM Makes Waves: Catalysts For Price Surge XLM&#8217;s remarkable ascent is primarily attributed to a significant development in the crypto space – Ripple Labs&#8217;s legal victory against the US Securities and Exchange Commission (SEC) &#8211; and the solid performance of XRP, which has likewise registered an impressive 72.3% climb at the time of writing. Related Reading: Solana (SOL) Continues To Shine With Over 20% Surge – What’s Next? A judge ruled that Ripple did not violate securities regulations when it sold its XRP token on public exchanges. This verdict sent XRP prices soaring and created a ripple effect (no pun intended), propelling other altcoins, including XLM and even Bitcoin (BTC), to surge in value. XLM market cap currently at $4.5 billion on the daily chart: TradingView.com Related Reading: BNB Chain Unveils Beacon Update – What’s Its Bearing On Price? Meanwhile, crypto exchange Coinbase has fully embraced the Stellar network, enabling seamless deposits and withdrawals of USD Coin (USDC). This integration bolstered Stellar&#8217;s status and expanded its reach, attracting more interest and investment to the platform. XLM seven-day price action. Source: CoinMarketCap Despite the initial upswing following US judge Torres&#8217; favorable verdict for the Ripple coin, XLM has unable to retest its previous week&#8217;s highs at $0.20. But it looks like the bulls are still in charge, as XLM trade volumes are relatively high. CoinGecko reports that within the past 24 hours, almost $700 million worth of XLM has traded hands on key exchanges. What Lies Ahead For Stellar XLM? As the crypto market continues to evolve, all eyes are on XLM to see if it can sustain its current momentum. With the legal challenges surrounding Ripple and its XRP token seeing full closure, investors may view Stellar as a more stable alternative for their digital assets portfolio. Traders should closely monitor the price movement and whether XLM can break past the significant resistance level at $0.20. 350 million people in Africa don&#8217;t have access to bank accounts, and only 20% of families have formal bank accounts.@fonbnk1 provides a real-world solution to this problem by turning 8 billion active prepaid SIM cards globally into virtual debit cards with Stellar. (1/3) — Stellar (@StellarOrg) July 18, 2023 In related news, Stellar has just announced a partnership with Fonbnk to convert 8 billion active prepaid SIM cards into virtual debit cards. This development is anticipated to have a positive impact on XRP&#8217;s price over the coming weeks. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Pxfuel"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-20T12:00:16.000Z",
    "title": "Chainlink (LINK) Bulls Reclaim Dominance With 16% Rally, Here’s Why",
    "url": "https://www.newsbtc.com/news/chainlink/chainlink-link-bulls-reclaim-dominance-with-16-rally-heres-why/",
    "description": "Chainlink (LINK) is currently on an uptrend, with the bulls showing much dominance in today’s market. According to data from CoinMarketCap, LINK is up by 16.94% in the last 24 hours, emerging as one of the biggest daily gainers in the crypto market. What&#8217;s Driving LINK’s Price Today? According to the on-chain analytics platform Lookonchain, LINK’s price gain appears to have been triggered by some recent whale activity.  Lookonchain reports that two whale addresses, “0xc212” and “0x86bd,&#8221; which they suspect belong to the same person, purchased $6 million worth of LINK in the early hours of Thursday. 2 whales (probably the same person) bought a total of 788,877 $LINK ($6 million) for $7.62 just now. The whale swapped all 3,074 $stETH ($5.87M) and 71 $ETH ($136K) for 788,877 $LINK. This purchase increased the price of $LINK by 6.5%. pic.twitter.com/ajLBP8Vesz &#8212; Lookonchain (@lookonchain) July 20, 2023 &#160; The transaction was made by both whale addresses swapping a total of 3,074 stETH, valued at $5.87 million, and 71 ETH, valued at $136,000, for 788,877 LINK tokens. Related Reading: Solana (SOL) Continues To Shine With Over 20% Surge – What’s Next? Lookonchain noted that this whale movement immediately boosted LINK’s price by 6.5%, and the token appears to have been on an uptrend since then. Interestingly, Lookonchain has also reported two more whale transactions on the Chainlink network in the last hour.  The analytics platform notes that the whales with the wallet address “0x0fAC” and “0x67c8” have just purchased a total of 227,281 LINK tokens valued at $1.82 million. 2 more whales also bought a total of 227,281 $LINK ($1.82M) in the past hour. Whale&#8221;0x0fAC&#8221; swapped 500 $rETH ($1.03M) and 151.6 $stETH ($290K) for 161,558 $LINK just now. Whale&#8221;0x67c8&#8243; borrowed 500K $USDC from#Aave and bought 65,723 $LINK 1 hour ago.https://t.co/pRCcK2tQAa pic.twitter.com/fyK3U6pH9U — Lookonchain (@lookonchain) July 20, 2023 For now, there is no clear motive behind these whale transactions. However, LINK investors are advised to monitor the next move of these whales due to the possible effects on the market. Chainlink has been one of the major blockchain projects in the news this week following the launch of its Cross-Chain Interoperability Protocol (CCIP) on July 17.   According to a blog post by the project&#8217;s management team, the CCIP protocol is expected to be accessible to developers on various testnets starting from July 20. These testnets include Arbitrim Goerli, Avalanche Fuji, Ethereum Sepolia, Optimism Goerli, and Polygon Mumbai. LINK Price Analysis And Prediction Analyzing the daily LINK chart, the Relative Strength Index shows the token has entered the overbought zone and is likely to reverse soon.  This prediction is further backed by the token’s price movement, which shows that LINK is approaching a significant resistance at the $9.1 zone, which has not been broken in the last 14 months. Related Reading: Chainlink CCIP Goes Live On Mainnet, LINK Jumps By Nearly 10% If the resistance level holds strong again, LINK is likely to decline, retesting at the $5.3 price zone, which has also served as a strong support level since last year. At the time of writing, LINK is trading at $8.02, with a 1.67% increase in the last hour. The token’s daily trading volume is also up by 62.19% and is sitting at $497.4 million. With a market cap of $4.3 billion, LINK ranks as the 21st-largest cryptocurrency.  LINK Trading At $8.058 On The Daily Chart &#124; Source: LINKUSD Chart On Tradingview.com Featured Image From Chainlink, Chart From Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T12:00:15.000Z",
    "title": "CoinDepo: What is The Best Way to Earn Passive Income in Crypto?",
    "url": "https://www.crypto-news-flash.com/coindepo-what-is-the-best-way-to-earn-passive-income-in-crypto/?utm_source=rss&utm_medium=rss&utm_campaign=coindepo-what-is-the-best-way-to-earn-passive-income-in-crypto",
    "description": "Passive income is a way of earning money by collecting profits over time without seemingly doing much to attain said funds. CoinDepo offers several ways to earn passive income with crypto – either through depositing cryptocurrencies and stablecoins in Compound Interest Accounts, or through small, simple, and secure loans that require no collateral account. Earning [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T11:53:10.000Z",
    "title": "Shiba Inu Whales On Major Move, Is Tradecurve The Next Destination?",
    "url": "https://www.crypto-news-flash.com/shiba-inu-whales-on-major-move-is-tradecurve-the-next-destination/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-whales-on-major-move-is-tradecurve-the-next-destination",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T143911.369.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T143911.369.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T143911.369-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T143911.369-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency market is no stranger to whale movements. As Shiba Inu (SHIB) whales make notable moves, some investors wonder if Tradecurve (TCRV) could be their next destination.  &#62;&#62;Register For The Tradecurve Presale&#60;&#60; Shiba Inu (SHIB): Whales on the Move  Shiba Inu (SHIB), a cryptocurrency inspired by the popular Dogecoin, has attracted a considerable following. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T11:49:01.000Z",
    "title": "IOTA and Confidential Computing Revolutionize Edge Computing: Exploring the BUILD.5 Approach",
    "url": "https://www.crypto-news-flash.com/iota-and-confidential-computing-revolutionize-edge-computing-exploring-the-build-5-approach/?utm_source=rss&utm_medium=rss&utm_campaign=iota-and-confidential-computing-revolutionize-edge-computing-exploring-the-build-5-approach",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-1-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"IOTA\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-1-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-1-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-1-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-1-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-1-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-1-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-1-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-1-48x32.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />BUILD.5 talks about implementing different use cases using Confidential computing and implementing privacy-driven cloud computing solutions. BUILD.5&#8217;s integration of IOTA and L1 Smart Contracts can also help implement a secure trusted execution layer that can be established across edge devices. Last month, some of the biggest users of IOTA technology came together to a new [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-20T12:07:08.000Z",
    "title": "Top 3 Binance Coins in Q3-2023.",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-binance-coins-in-q3-2023/",
    "description": "<p>Three notable projects, PancakeSwap, Venus Protocol, and Coinwind, have emerged as key players in the DeFi landscape. Each project addresses unique aspects of the DeFi ecosystem. It offers distinct types of use and driving significant attention in the blockchain community. In this article, we will explore the fundamentals of these binance coins, their latest developments, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-binance-coins-in-q3-2023/\">Top 3 Binance Coins in Q3-2023.</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-20T11:45:55.000Z",
    "title": "‘Very Bullish’ On-Chain Metric Shows Bitcoin Set for Much Higher Prices, According to Crypto Analyst",
    "url": "https://dailyhodl.com/2023/07/20/very-bullish-on-chain-metric-shows-bitcoin-set-for-much-higher-prices-according-to-crypto-analyst/",
    "description": "<img width=\"1024\" height=\"574\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Set-for-Much-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Set-for-Much-.jpg 1456w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Set-for-Much-.jpg?resize=300,168 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Set-for-Much-.jpg?resize=768,430 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Set-for-Much-.jpg?resize=1024,574 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Set-for-Much-.jpg?resize=750,420 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Set-for-Much-.jpg?resize=1140,639 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto analyst thinks one particular on-chain metric bodes well for Bitcoin&#8217;s (BTC) future price action. In a new YouTube video, the anonymous host of InvestAnswers looks at Bitcoin&#8217;s yearly absorption rate on exchanges. The analyst looks at an absorption chart from the crypto analytics firm Glassnode, which defines the metric as a comparison [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/20/very-bullish-on-chain-metric-shows-bitcoin-set-for-much-higher-prices-according-to-crypto-analyst/\">‘Very Bullish’ On-Chain Metric Shows Bitcoin Set for Much Higher Prices, According to Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]