[
  {
    "source": "CoinDesk",
    "date": "2024-03-22T14:42:38.000Z",
    "title": "Do Kwon’s Extradition to South Korea Postponed by Montenegrin Supreme Court",
    "url": "https://www.coindesk.com/policy/2024/03/22/do-kwons-extradition-to-south-korea-postponed-by-montenegrin-supreme-court/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Montenegro’s Supreme Court placed a pause on Terra founder Do Kwon’s pending extradition from the Balkan country, issuing an order on Friday that overturns earlier decisions from two lower courts to extradite Kwon to his native South Korea."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-22T14:41:43.000Z",
    "title": "U.S. SEC Asking for More Millions, Dozens of Lawyers to Beef Up Crypto Oversight",
    "url": "https://www.coindesk.com/policy/2024/03/22/us-sec-asking-for-more-millions-dozens-of-lawyers-to-beef-up-crypto-oversight/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Gary Gensler wants 33 more people in the enforcement division of the U.S. Securities and Exchange Commission (SEC) to deal with \"new and emerging issues,\" according to the regulator's annual budget pitch. Much of that office's recent, emerging workload has come from the agency's pursuit of cryptocurrency businesses, such as Coinbase Inc., Kraken and Binance."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-22T14:57:18.000Z",
    "title": "Protocol Village: Entangle, Powered by 'Liquid Vaults,' Gets Strategic Investment From Consensys",
    "url": "https://www.coindesk.com/tech/2024/03/20/protocol-village/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of March 21-26."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-22T15:07:33.000Z",
    "title": " Montenegrin court postpones Do Kwon’s extradition to South Korea ",
    "url": "https://cointelegraph.com/news/montenegro-do-kwon-extradition-south-korea",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYzMxYzcwMmMtN2QyNC00OTc4LWEzNjItMjgzZWZiMmIxMzUyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Do Kwon faces fraud charges in the United States and South Korea as authorities compete to extradite the Terraform Labs co-founder. </p>\n                    <p><p>The Supreme Court of Montenegro has ordered that the extradition of Terraform Labs co-founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/do-kwon\">Do Kwon</a> to his native South Korea be postponed until it can decide on a request from prosecutors.</p><p>In a March 22 notice, Montenegro’s Council of the Supreme Court <a href=\"https://sudovi.me/vrhs/sadrzaj/ONBM\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it would decide on a request for a protection of legality for a lower court decision that would have <a href=\"https://cointelegraph.com/news/do-kwon-extradition-montenegro-supreme-court\">allowed Kwon’s extradition</a> to South Korea. Prosecutors argued in the request that an appellate court violated procedure in <a href=\"https://cointelegraph.com/news/montenegro-court-do-kwon-extradition-south-korea\">rejecting an appeal</a> from Kwon’s legal team, claiming only Montenegro’s Supreme Court had the authority to adopt a legal decision.</p><p>Kwon, a South Korean national, has seemingly preferred extradition to his native country rather than the United States. He faces criminal charges in both countries but has been in Montenegrin custody since his arrest in the country in March 2023 for using falsified travel documents. Authorities are weighing competing extradition requests.</p><p><a href=\"https://cointelegraph.com/news/montenegro-do-kwon-extradition-south-korea\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-22T14:45:05.000Z",
    "title": "Crypto Economy Dips by 4.38% Amidst Mixed Fortunes for Top Coins",
    "url": "https://news.bitcoin.com/crypto-economy-dips-by-4-38-amidst-mixed-fortunes-for-top-coins/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/bear-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Economy Dips by 4.38% Amidst Mixed Fortunes for Top Coins\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/bear-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bear-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bear-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bear-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bear-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bear-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bear.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />As the weekend approaches, the crypto economy experienced a downturn, declining 4.38% in the past 24 hours to a total value of $2.42 trillion. Bitcoin saw a decrease of 5.5% against the U.S. dollar during this period, while ethereum&#x2019;s value dropped by 5.3%. In contrast, fantom (FTM) enjoyed a 12% increase, and aptos (APT) rose [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-22T15:00:00.000Z",
    "title": "Pepecoin Faces Meme Coin Battle With New PEPE Rival After Major Price Surge",
    "url": "https://www.cryptopolitan.com/pepecoin-faces-meme-coin-battle-with-new-pepe-rival-after-major-price-surge/",
    "description": "Pepecoin (PEPE) finds itself engaged in a heated battle with its latest contender, Shiba Budz (BUDZ). This clash comes hot on the heels of a substantial price surge experienced by Shiba Budz (BUDZ), intensifying competition within the meme coin ecosystem and prompting investors to reassess their strategies. Let&#8217;s delve into the intricacies of this rivalry [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-22T15:00:00.000Z",
    "title": "March 2024 Smart Money – Why Investors are Choosing ‘Black Account’ Exchange Token Over Shiba Inu and Dogecoin",
    "url": "https://www.cryptopolitan.com/march-2024-smart-money-why-investors-are-choosing-black-account-exchange-token-over-shiba-inu-and-dogecoin/",
    "description": "As we step into March 2024, a noticeable shift in investment strategies within the cryptocurrency domain is becoming apparent. Smart money, the term often used to describe investments made by those with comprehensive knowledge of the market or insider information, is increasingly moving towards the &#8216;Black Account&#8217; feature offered by Option2Trade (O2T), diverging from traditional [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-22T14:50:31.000Z",
    "title": "Chinese Tech Giants’ AI Models Compete to Surpass ChatGPT",
    "url": "https://www.cryptopolitan.com/chinese-tech-ai-models-to-surpass-chatgpt/",
    "description": "Chinese tech companies are rapidly advancing in the field of artificial intelligence (AI), posing a formidable challenge to their Western counterparts. Among the latest developments is the emergence of Chinese Large Language Models (LLMs) that are poised to compete with the likes of ChatGPT by OpenAI. Kuaishou&#8217;s KwaiYii in&#160; a contender for chatGPT Kuaishou, known [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-22T14:43:37.000Z",
    "title": "ESMA’s resource constraints hinder the EU’s crypto regulation efforts",
    "url": "https://www.cryptopolitan.com/esmas-resource-hinder-eus-crypto-regulation/",
    "description": "The European Union (EU) faces a significant hurdle in establishing a robust regulatory framework for cryptocurrencies as the European Securities and Markets Authority (ESMA) grapples with resource constraints. This obstacle potentially puts the EU at risk of lagging behind other global markets in adopting cryptocurrencies and blockchain technology. ESMA&#8217;s resource challenges ESMA, the Union&#8217;s premier [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-22T14:41:00.000Z",
    "title": "BlockDAG Coin Hits $6.8 Million In Batch 3 Amid Bitcoin & SEI’s Market Turbulence",
    "url": "https://www.cryptopolitan.com/blockdag-coin-hits-6-8-million-in-batch-3-amid-bitcoin-seis-market-turbulence/",
    "description": "BlockDAG Network&#8216;s $6.8 million presale success story unfolds, offering a fresh perspective on cryptocurrency investments. This article examines the contrasting paths of these digital currencies, spotlighting BlockDAG&#8217;s promising journey against the backdrop of Bitcoin&#8217;s challenges and SEI&#8217;s evolving market predictions. Bitcoin&#8217;s Price Dynamics: Navigating the Downturn Bitcoin&#8217;s latest market performance has seen a notable downturn, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-22T14:52:37.000Z",
    "title": "Worldcoin enhances privacy measures via personal custody plan",
    "url": "https://crypto.news/worldcoin-privacy-personal-custody/",
    "description": "Sam Altman's Worldcoin unveiled a new personal data custody feature and made the core software of its iris-scanning Orb open source."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-22T14:47:55.000Z",
    "title": "Bonk’s value drops, investors eye Rebel Satoshi’s new token, RECQ",
    "url": "https://crypto.news/bonks-value-drops-investors-eye-rebel-satoshis-new-token-recq/",
    "description": "Amidst bearish market sentiments, Bonk's price decline prompts investor attention toward Rebel Satoshi's RECQ, projecting a 525% growth in its presale. #partnercontent"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-22T15:00:21.000Z",
    "title": "Fantom (FTM) Jumps 180% In 4 Weeks: Just The Beginning?",
    "url": "https://www.newsbtc.com/news/fantom-ftm-jumps-180-4-weeks-just-the-beginning/",
    "description": "Over the past 24 hours, Fantom (FTM) has emerged as the standout performer among the top 100 cryptocurrencies by market capitalization, registering a remarkable 13.5% gain. This surge is part of a broader rally that has seen the FTM price soar by 180% over the last four weeks, propelling it from $0.42 to $1.20. This upward trajectory has significantly boosted Fantom&#8217;s market capitalization to $3.3 billion, positioning it as the 41st largest digital asset worldwide. Here&#8217;s why this might be just the beginning: #1 Sonic Upgrade: The Catalyst for Fantom&#8217;s Rally The anticipated Sonic upgrade is central to Fantom&#8217;s recent success. Designed to enhance the Fantom technology stack, Sonic introduces major scalability improvements without necessitating a disruptive hard fork. Key components of the Sonic upgrade include: Fantom Virtual Machine (FVM): Aims to significantly boost transaction throughput. Carmen Database: Promises to reduce storage requirements by up to 90%. Optimized Lachesis Consensus: Improves upon the existing consensus mechanism for enhanced performance. With these enhancements, Fantom targets a throughput of over 2,000 transactions per second (TPS), marking a substantial leap in scalability. Importantly, the upgrade ensures that existing Fantom Opera smart contracts and tools remain fully compatible with the Sonic mainnet, which is scheduled to launch in Spring 2024. Related Reading: Fantom (FTM) Bull Run: Can FTM Hit $2 After 20% Price Spike? Recent testnets have demonstrated Sonic&#8217;s potential. The closed testnet, focused on ERC-20 swaps, achieved an impressive ~4,000 TPS with ~1.3-second finality. Furthermore, a reconfiguration to process only ERC-20 transfers led to a groundbreaking ~10,000 TPS at ~1.6-second finality, showcasing the capabilities of next-generation decentralized exchanges (DEXs) and wallets. 10k tps achieved. Publicly verifiable. Can test for yourself, on public infrastructure. No need for &#34;trust me bro&#34;. Available today, no need to wait. And we havent even started with the parallel execution meme. https://t.co/q2QRKM9WXe &#8212; Andre Cronje (@AndreCronjeTech) March 15, 2024 Reflecting on Sonic&#8217;s impact, Reflexivity Research highlighted, &#8220;Fantom Sonic unlocks new possibilities for the Fantom ecosystem, particularly in decentralized finance (DeFi) platforms, blockchain games, high-frequency applications, and the Internet of Things (IoT).&#8221; The research firm added that another cornerstone for Fantom is its exemplary 99.9% uptime. “Fantom&#8217;s novel solutions position it as a frontrunner in the development of decentralized networks,” Reflexivity Research stated. #2 Andre Cronje: The Innovator&#8217;s Promise Andre Cronje, the founder of Fantom and one of the brightest minds in the crypto industry, has been instrumental in driving innovation within the ecosystem. Cronje recently underscored his commitment to advancing the crypto space, stating, &#8220;The number 1 dex on Base, and the number 1 dex on Optimism are both built with code I wrote and pioneered. Stick to where the innovators are, post Sonic I will be adding some new primitives to crypto.&#8221; Related Reading: Fantom Launches Recovery Plan For Funds Lost In Multichain’s $200M Exploit, FTM Soars #3 Coinbase Announcement: A New Milestone Another factor driving today’s price rally is probably today’s Coinbase International announcement that it will launch Fantom perpetual futures on Coinbase International Exchange and Coinbase Advanced, set to commence on or after 9:30am UTC on March 28, 2024. This move by Coinbase is expected to further enhance Fantom&#8217;s liquidity and accessibility, contributing to its growing appeal among investors. @CoinbaseIntExch will add support for Fantom and THORChain perpetual futures on Coinbase International Exchange and Coinbase Advanced. The opening of our FTM-PERP and RUNE-PERP markets will begin on or after 9:30am UTC on 28 MAR 2024. pic.twitter.com/CHBVF58ISc &#8212; Coinbase International Exchange 🛡️ (@CoinbaseIntExch) March 21, 2024 #4 Technical Analysis: FTM/USD The bullish momentum of Fantom price is apparent in the weekly FTM/USD chart on Binance, signified by the latest candlestick closure above the key exponential moving averages (EMAs) of 20, 50, 100, and 200 periods. This week&#8217;s candlestick represents a notable increase of approximately 50% from the intra-week low. Fantom&#8217;s ascent has propelled its value beyond the 0.382 Fibonacci retracement level, situated at $0.9176. This bullish breakout suggests the market may target subsequent Fibonacci levels, with $1.38 (0.382 Fib) acting as an intermediate psychological and technical resistance, followed by $1.76 (05 Fib), and potentially extending towards the golden ratio at $2.13, which corresponds with the 0.618 Fibonacci level. On the flip side of this bullish scenario, should a correction occur across the broader crypto market, immediate support for FTM can be anticipated at the $0.92 level. Stability at or above this threshold could reaffirm bullish market control. Conversely, a downward breach could intensify selling pressure, possibly leading to a retest of support around the $0.56 mark. Featured image from Kraken Blog, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-22T14:45:00.000Z",
    "title": "DOGE is Setting Up For A New Upward Rally Following Recent Rebound",
    "url": "https://coinedition.com/doge-is-setting-up-for-a-new-upward-rally-following-recent-rebound/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/doge1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/doge1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/doge1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/doge1-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Rekt Capital, a crypto analyst on X, has spotted a developing uptrend on Dogecoin amid the current market conditions. In a recent post, the renowned analyst highlighted that DOGE has tagged the macro downtrend for a successful retest, rebounding 24%. Explaining his analysis, Rekt Capital showed a reversal candle that formed on the DOGE/USDT weekly [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/doge-is-setting-up-for-a-new-upward-rally-following-recent-rebound/\">DOGE is Setting Up For A New Upward Rally Following Recent Rebound</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2024-03-22T14:43:23.000Z",
    "title": "Anatomy of the Halving Part 3: Battle of the Miners: Independent vs. Corporate Mining Dynamics",
    "url": "https://blog.bitfinex.com/education/anatomy-of-the-halving-part-3-battle-of-the-miners-independent-vs-corporate-mining-dynamics/",
    "description": "<p>The act of mining Bitcoin has evolved from a small group of obscure hobbyists with a uniquely shared interest into a massive industry complete with publicly traded industrial-scale Bitcoin mining operations worldwide. Will the advent of “Big Bitcoin Mining” put pressure on independent competitors? “Only...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/education/anatomy-of-the-halving-part-3-battle-of-the-miners-independent-vs-corporate-mining-dynamics/\">Anatomy of the Halving Part 3: Battle of the Miners: Independent vs. Corporate Mining Dynamics</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]