[
  {
    "source": "CoinDesk",
    "date": "2024-01-03T20:00:31.000Z",
    "title": "What Caused Bitcoin's 10% Crash: Matrixport, Jim Cramer, Leverage?",
    "url": "https://www.coindesk.com/markets/2024/01/03/what-caused-bitcoins-10-crash-matrixport-cramer-leverage/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin cratered almost 10% below $41,000 early Wednesday around the time Matrixport's report about warning of a spot BTC ETF decline, but it was more likely due to a leverage flush as the market overheated, a K33 analyst said in an interview."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-03T20:00:00.000Z",
    "title": " Donald Trump cashes out $2.4M profit from NFTs, copyright-expired version of Mickey tops OpenSea: Nifty Newsletter ",
    "url": "https://cointelegraph.com/news/donald-trump-mickey-mouse-nft-lawyer-copyright-newsletter",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMjZmMzNmMWYtZTM4Yy00OGUzLTkwMmItMzcxMGFmY2E1MzQ5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>NFT collections featuring the version of Mickey Mouse depicted in the 1928 film “Steamboat Willie” have topped the charts on OpenSea.</p>\n                    <p><p>In this week’s newsletter, read about how NFTs using the 1928 depiction of Mickey Mouse topped the trending list on OpenSea. Following this, a lawyer warned the community about the limitations of using the character, whose copyright recently expired. In other news, find out how Web3 professionals feel about the challenges NFTs will face in 2024 in one of Cointelegraph’s New Year specials. And don’t forget this week’s Nifty News, featuring former U.S. President Donald Trump cashing out his NFT profits. </p><p>The copyright on the 1928 depiction of Mickey Mouse in the short film <em>Steamboat Willie</em> expired and became available to the public on Jan 1. The following day, several <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> collections related to <em>Steamboat Willie</em> appeared at the top of NFT marketplace OpenSea’s 24-hour trending list.</p><p>One collection titled “Steamboat Willie Public Domain 2024” had a 24-hour trading volume of around $1.2 million. This put the collection on OpenSea’s “top” list, joining prominent collections like Bored Ape Yacht Club and Pudgy Penguins. </p><p><a href=\"https://cointelegraph.com/news/donald-trump-mickey-mouse-nft-lawyer-copyright-newsletter\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-03T19:40:00.000Z",
    "title": " Price analysis 1/3: BTC, ETH, BNB, SOL, XRP, ADA, AVAX, DOGE, DOT, MATIC ",
    "url": "https://cointelegraph.com/news/price-analysis-1-3-btc-eth-bnb-sol-xrp-ada-avax-doge-dot-matic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMmM4NDRjZGUtOTI1Ni00ZTFjLTlhMTUtYTYyNTA0MDFiMTljLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin’s sharp fall on Jan. 3 suggests that market participants are nervous ahead of the SEC's long-awaited decision on the spot Bitcoin ETF applications.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) led the cryptocurrency markets lower on Jan. 3, indicating the market’s nervousness about the fate of the spot Bitcoin exchange-traded funds (ETFs) applications. One of the reasons being talked about is the Bitcoin ETF denial report by the crypto financial services platform Matrixport.</p><p>However, it is prudent to note that the report <a href=\"https://cointelegraph.com/news/bitcoin-etf-denial-report-did-not-cause-btc-price-crash-analysis\">fails to provide hard evidence</a> on why the ETFs will be rejected. In contrast, Bloomberg ETF analyst James Seyffart <a href=\"https://cointelegraph.com/news/bitcoin-spot-etf-rejected-possibility-bloomberg-etf-analyst\">maintained a 90% approval odds</a> of the ETFs by Jan. 10.</p><p>Although the fall cools down the bullish sentiment in the short term, it does not alter the prevailing trend. Market observers will keep a close eye on the regulator, and any positive news on the approvals of the Bitcoin ETFs could cause a sharp reversal to the upside.</p><p><a href=\"https://cointelegraph.com/news/price-analysis-1-3-btc-eth-bnb-sol-xrp-ada-avax-doge-dot-matic\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-03T20:00:11.000Z",
    "title": "ENS token surges 35% to defy market trend after Vitalik calls the platform ‘super important’",
    "url": "https://cryptoslate.com/ens-token-surges-35-to-defy-market-trend-after-vitalik-calls-the-platform-super-important/",
    "description": "<p>Ethereum Name Service&#8217;s native token ENS surged over 40% on Jan. 3 after Ethereum co-founder Vitalik Buterin spoke positively about the platform and said it was &#8220;super important&#8221; for the ETH ecosystem. As of press time, ENS was trading at approximately $13.94, up 40.38% over the last 24 hours. The token has a market cap [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ens-token-surges-35-to-defy-market-trend-after-vitalik-calls-the-platform-super-important/\">ENS token surges 35% to defy market trend after Vitalik calls the platform ‘super important’</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-03T19:50:51.000Z",
    "title": "Bitcoin Dives 9% Amid Matrixport Report Fury, Jihan Wu’s Defense, and BTC Funding Rates Debate",
    "url": "https://www.cryptoglobe.com/latest/2024/01/bitcoin-dives-9-amid-matrixport-report-fury-jihan-wus-defense-and-btc-funding-rates-debate/",
    "description": "Matrixport is a financial services platform specializing in cryptocurrency. Founded in 2019 by Jihan Wu and John Ge, who were also co-founders of Bitmain, a leading maker of cryptocurrency mining hardware, Matrixport offers a range of services. These include cryptocurrency trading, custody, lending, and structured products. The platform aims to make digital asset management and […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T20:01:56.000Z",
    "title": "South Korea sets crypto tax precedent with wallet exemption",
    "url": "https://www.cryptopolitan.com/south-korea-sets-crypto-tax-precedent/",
    "description": "South Korea&#8216;s National Tax Service (NTS) has announced that individuals with virtual assets in non-custodial, decentralized wallets, including cold wallets, are exempt from overseas financial account reporting. This announcement, made on October 30, 2024, clarifies the position of the NTS following its June 2023 decision to include virtual assets in overseas financial account reporting for [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T19:58:11.000Z",
    "title": "Americans’ crypto ownership rises by 10%, driven by anticipation of Bitcoin ETF approval: Report",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-interest-american-investors/",
    "description": "A recent report by cybersecurity research team Security.org highlights a significant uptick in cryptocurrency adoption among Americans. The poll, involving 1,500 participants, reveals that 40% now own cryptocurrency, marking a 10% increase from the previous year. Notably, the anticipation of a spot Bitcoin ETF (Exchange-Traded Fund) approval is driving this surge. Among those not currently [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T19:52:28.000Z",
    "title": "Solana Price Prediction 2024-2033: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? The live Solana price today is $97.30 USD with a 24-hour trading volume of $5,212,471,771 USD. We update our SOL to USD price in real-time. Solana is down 9.82% in the last 24 hours. The current CoinMarketCap ranking is #5, with a live market cap of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-03T20:00:54.000Z",
    "title": "Bitcoin Plunges Below Support As Price Crashes To $42,500",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-push-49000-support-holds-analyst/",
    "description": "Bitcoin appeared to have been securely floating above support just earlier, but today, the picture has changed as the price has suddenly crashed to $42,500. Bitcoin Has Crashed More Than 6% During Past 24 Hours Bitcoin had kicked off 2024 with some sharp bullish momentum as the market had been looking toward the potential ETF approvals with hopeful eyes. The asset had only been at the $45,000 level not seen since April 2022 for just a couple of days before the price suddenly crashed. Related Reading: $3,830 &#38; $5,100 Next Major Ethereum Targets According To This Model The chart below shows how cryptocurrency has performed during the past few days. Looks like the coin's price has plummeted during the last 24 hours &#124; Source: BTCUSD on TradingView During this plunge, Bitcoin had briefly hit a low under $41,500, but the cryptocurrency has since seen a bit of a rebound as its price is now trading around the $42,500 level. As is usually the case, the rest of the sector has also plunged alongside the original digital asset, with most coins registering drawdowns of even greater degrees. Just before this crash, Bitcoin had been floating above a critical support line and appeared set to continue its recent bullish momentum. Bitcoin Had Broken Above An Ascending Triangle Pattern With Recent Rally In a post on X before the crash, analyst Ali had discussed where the Bitcoin price might be heading after its break above the $45,000 level based on technical analysis data. Below is the chart that the analyst shared in the post. The pattern that had formed in the 4-hour price of the cryptocurrency &#124; Source: @ali_charts on X In the graph, Ali highlighted an Ascending Triangle pattern that Bitcoin appeared to have successfully broken out of with the price surge. An &#8220;Ascending Triangle&#8221; refers to a continuation pattern of two trendlines forming a triangular shape. One of the trendlines is a horizontal level made by connecting highs in the asset, while the other is a diagonal line that joins together higher lows. The pattern is &#8220;ascending&#8221; in its name as the overall consolidation between these two trendlines narrows towards the upside. Generally, when the price retests the horizontal level, it could likely feel some resistance and form a local top. If the resistance is broken through, it could be a sign that the asset would now display some continued upward momentum. Similarly, the diagonal line is usually a point of support for the asset, and sustained breaks below could be to watch out for, as they can signal that a bearish trend is taking over. Related Reading: Bitcoin’s Road To Record Heights: Analysts Forecast Post-Halving Surge From the chart, it&#8217;s visible that Bitcoin had gained some distance over the triangle above earlier and had appeared to be finding support at the 0.786 Fibonacci ratio, which is situated at around $44,900 for the asset. Ali had noted that if sustained buying would continue at this support, Bitcoin might be able to push towards the $49,000 level. But as it has turned out, the market had other plans for the cryptocurrency, as its price has plunged far below this support level. Featured image from Kanchanara on Unsplash.com, charts from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-03T19:45:19.000Z",
    "title": "Chinese State Media Warns Corrupt Officials May Be Using Cold Storage Crypto To Avoid Investigation: Report",
    "url": "https://dailyhodl.com/2024/01/03/chinese-state-media-warns-corrupt-officials-may-be-using-cold-storage-crypto-to-avoid-investigation-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/state-media-cold-storage.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/state-media-cold-storage.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/state-media-cold-storage.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/state-media-cold-storage.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/state-media-cold-storage.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/state-media-cold-storage.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/state-media-cold-storage.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A Chinese state-owned newspaper has warned that corrupt officials could be funneling crypto into cold storage to avoid investigations. Legal Daily, a media outlet directly under the control of the Chinese Communist Party (CCP), notes in a new report that experts at the China Integrity and Legal Research Association&#8217;s 2023 annual meeting drew attention to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/03/chinese-state-media-warns-corrupt-officials-may-be-using-cold-storage-crypto-to-avoid-investigation-report/\">Chinese State Media Warns Corrupt Officials May Be Using Cold Storage Crypto To Avoid Investigation: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-03T19:41:28.000Z",
    "title": "Ethereum-Based Altcoin Explodes As Vitalik Buterin Says Project Is ‘Super Important’",
    "url": "https://dailyhodl.com/2024/01/03/ethereum-based-altcoin-explodes-as-vitalik-buterin-says-project-is-super-important/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/02/neutral-vitalik-ukraine.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/02/neutral-vitalik-ukraine.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/02/neutral-vitalik-ukraine.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/02/neutral-vitalik-ukraine.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/02/neutral-vitalik-ukraine.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/02/neutral-vitalik-ukraine.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/02/neutral-vitalik-ukraine.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An Ethereum (ETH)-based altcoin is exploding in value after ETH founder Vitalik Buterin said the project is vital to the crypto ecosystem. Buterin tells his five million followers on the social media platform X that all layer-2 (L2) projects should integrate with Ethereum Name Service (ENS), a platform that lets users buy a &#8220;domain name&#8221; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/03/ethereum-based-altcoin-explodes-as-vitalik-buterin-says-project-is-super-important/\">Ethereum-Based Altcoin Explodes As Vitalik Buterin Says Project Is ‘Super Important’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]