[
  {
    "source": "Decrypt",
    "date": "2024-03-24T15:34:57.000Z",
    "title": "This Week in Crypto Games: 'Crypto Valleys' Blasts Off, Immutable and Polygon Plot $100M Fund",
    "url": "https://decrypt.co/223194/this-week-crypto-games-crypto-valleys-immutable-polygon-100m-fund",
    "description": "Catch up on this week’s biggest crypto and NFT gaming news and find some weekend reads in our latest roundup."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-24T15:22:05.000Z",
    "title": "RollerCoaster Tycoon: A Timeless Favorite Among Gamers",
    "url": "https://www.cryptopolitan.com/rollercoaster-tycoon-a-timeless-among-gamers/",
    "description": "RollerCoaster Tycoon, the iconic amusement park simulation game released in 1999, continues to captivate gamers even 25 years later. Developed by Chris Sawyer, the game revolutionized the genre with its attention to detail and addictive gameplay. Despite its simple graphics and solo development, RollerCoaster Tycoon became the bestselling PC game of 1999, grossing a staggering [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-24T15:16:54.000Z",
    "title": "The impending impact of AI on workplaces: Insights and concerns",
    "url": "https://www.cryptopolitan.com/the-impending-impact-of-ai-on-workplaces/",
    "description": "As society increasingly integrates artificial intelligence (AI) into daily life, concerns about its potential ramifications, particularly in the workplace, are mounting. The late Professor Stephen Hawking, the renowned physicist, had forewarned about the perils of unchecked AI development, highlighting the possibility of AI surpassing human intelligence and potentially leading to dire consequences. The workplace landscape [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-24T15:30:58.000Z",
    "title": "Bitcoin ETFs Bleed For One Week Straight – Can Price Recover To $73,000?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-etfs-bleed-for-one-week-straight-can-price-recover-to-73000/",
    "description": "Last week was rough for Spot Bitcoin ETFs as they failed to attract strong inflows day after day. As a result, these Spot Bitcoin ETFs witnessed consecutive daily outflows every day last week, indicating the bullish sentiment among institutional traders might actually be waning. This seems to have been reflected in the price of Bitcoin, as the cryptocurrency fell to as low as $61,370 during the week.  Related Reading: Fantom (FTM) Bull Run: Can FTM Hit $2 After 20% Price Spike? Bitcoin ETFs See Sustained Outflows Investor interest in Spot bitcoin ETFs skyrocketed throughout February and early March amid Bitcoin&#8217;s bull run, pushing its price to an all-time high of $73,737. This maximum investor interest saw the ETFs setting new trading records for exchange-traded funds in the US. However, these ETFs have now set a negative record of five consecutive days of outflows to beat a four-day outflow streak set in January. According to data from BitMEX Research, these ETFs witnessed five days of consecutive outflows of $154.4 million, $326.2 million, $261.6 million, $93.1 million, and $51.6 million. At the same time, Grayscale&#8217;s GBTC set a new record for the most daily outflow. BitMEX also reveals that the world&#8217;s largest crypto asset manager saw redemptions of 9,539.7 BTC worth over $642.5 million on Monday, the largest single-day outflow in GBTC&#8217;s history. [1/4] Bitcoin ETF Flow &#8211; 22 March 2024 All data in. 5th day of net outflows. $52m total net outflow for the day. Blackrock with a record low inflow of $18.9m pic.twitter.com/63u297xh8d — BitMEX Research (@BitMEXResearch) March 23, 2024 Grayscale&#8217;s outflow wasn&#8217;t particularly surprising, considering that the fund has witnessed consistent daily outflow since its launch. The surprise came from very weak inflow into other Spot ETFs like BlackRock (IBIT) and Fidelity (FBTC), whose huge inflows have always offset outflows from GBTC.  Particularly noteworthy is the fact that Blackrock (IBIT), which has consistently been the target of the majority of inflow, established a new inflow low of $18.9 million on Friday, March 22. Fidelity, on the other hand, also saw its inflow fall to as low as $5.9 million on Monday, March 18. Bitcoin is now trading at $65.122. Chart: TradingView Can Bitcoin Price Recover? The big question now is whether Bitcoin can stage a strong recovery and reclaim its recent all-time high above $73,000. A continuation of outflows from Spot Bitcoin ETFs could further weigh on Bitcoin price.  Interestingly, the weak inflow hasn&#8217;t really related to low trading activity, as trading volume remained significant throughout the week. Data shows that the cumulative trading volume of the 10 ETFs is now at $164 billion after witnessing $22.71 billion in trading volume last week. Related Reading: Top Analyst’s Bold Prediction: XRP Set To Skyrocket 1,500% After a week of deep outflows, the coming days will be crucial in determining the next major move in the price of Bitcoin. Despite the rough week, Bitcoin still has a chance to rebound back to $73,000 or higher, especially with the approach of the next Bitcoin halving event.  Featured image from Pexels, chart from TradingView"
  }
]