[
  {
    "source": "CryptoSlate",
    "date": "2023-08-31T23:00:52.000Z",
    "title": "Bitcoin whales make waves by snapping up more coins despite summer price stabilization",
    "url": "https://cryptoslate.com/insights/bitcoin-whales-make-waves-by-snapping-up-more-coins-despite-summer-price-stabilization/",
    "description": "<p>Quick Take Bitcoin&#8217;s ecosystem has witnessed an intriguing trend as the number of unique entities, alternatively known as &#8216;whales&#8217; in the crypto world, holding a minimum of 1,000 Bitcoin has reached a year-to-date (YTD) high. An estimated 1,611 entities now hold 1,000 or more Bitcoin, a figure that has risen by approximately 500 since June. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-whales-make-waves-by-snapping-up-more-coins-despite-summer-price-stabilization/\">Bitcoin whales make waves by snapping up more coins despite summer price stabilization</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-31T23:00:44.000Z",
    "title": "Bitcoin Cash Traders Move Into Profit, But Can The Rally Continue?",
    "url": "https://www.newsbtc.com/news/bitcoin-cash/bitcoin-cash-rally/",
    "description": "As the price of Bitcoin and the general crypto market has rallied, leading to a much-needed increase in price, Bitcoin Cash (BCH) investors are once again on a profitable path. The majority of investors are now in the green following its double-digit surge in the last week. But now the question posed is, will the price of BCH continue to maintain this surge? Bitcoin Cash Short And Long-Term Holders Enjoy Profits In a Thursday post, on-chain data tracking platform Santiment revealed that both short and long-term holders of Bitcoin Cash are doing quite well right now. The chart shared by the tracker showed that the average returns for 30-day and 365-day holders have risen above their average cost price. Related Reading: Grayscale Victory Sends Bitcoin Open Interest Surging After Hitting One-Year Lows This means that investors who got into the digital asset in the last month, as well as those who have been holding for a year, are the ones doing well right now. It is also the first time in 10 weeks that this cohort of BCH investors is seeing profit. Short and long term BCH traders move into profit &#124; Source: Santiment on X The data from Santiment is also backed up by that from another on-chain tracker IntoTheBlock. According to the latter’s data on its website, 59% of all BCH investors are seeing green compared to 38% sitting in the red and 3% in neutral territory. Furthermore, IntoTheBlock shows that 96% of holders have held for more than one year, with 3% holding between 1-12 months, and 1% holding for less than one month. Combining the data from both trackers tells us that there are more long-term investors in profit compared to short-term investors. This fact reinforces the long-standing belief that buying and holding is usually the best way to invest in cryptocurrencies. But Can BCH Hold Its Gains? The fact that so many short and long-term holders are currently in profit can be attributed to the digital asset’s spike in the last week. Following the Grayscale ruling that saw the market surge, BCH’s price rose over 14%, bringing its value to the $220 level before the retracement. Most of these gains have been sustained so far, as evidenced by the high percentage of holders in profit. Related Reading: Is Vitalik Buterin Selling His ETH Stash? Let’s Take A Look At His Transactions However, Santiment points out in its report that for Bitcoin Cash to continue to rise, it would be up to the whales. This is because, during the price spike, there was an increase in whale activity in relation to the BCH token. So they likely played a part in the asset’s rise. If the whales continue to be active and put buying pressure on the coin, then the price of BCH could continue to appreciate. However, a turn from buy to sell among these large holders would quickly crash the price, especially since the market is already feeling the euphoria felt earlier this week start to recede. Presently, data from Coinmarketcap shows that Bitcoin Cash is trading at $219, a 14.57% increase in the last week. BCH price reclaims $220 &#124; Source: BCHUSD on Tradingview.com Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from WallPaper, chart from TradingView.com"
  }
]