[
  {
    "source": "Cointelegraph",
    "date": "2023-10-06T08:55:00.000Z",
    "title": "European regulator publishes second consultation on MiCA",
    "url": "https://cointelegraph.com/news/european-regulator-publishes-second-consultation-on-mica",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/51315917d9bc0e5a57106237be41cfa3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The regulator will publish a final report based on feedback received and submit the draft technical standards to the European Commission by June 2024.</p>\n                    <p><p>The European Securities and Markets Authority (ESMA), the European Union’s markets regulator, <a href=\"https://www.esma.europa.eu/press-news/esma-news/esma-publishes-second-consultation-crypto-market-rules\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">released</a> a second consultative paper on Markets in Crypto-Assets (MiCA) mandates on Oct. 5. </p><p>In the 307-page <a href=\"https://www.esma.europa.eu/sites/default/files/2023-10/ESMA75-453128700-438_MiCA_Consultation_Paper_2nd_package.pdf\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">document</a>, the ESMA seeks stakeholders’ input on five areas of MiCA, including sustainability indicators for distributed ledgers, disclosures of inside information, technical requirements for white papers, trade transparency measures and record-keeping for crypto-asset service providers (CASPs).</p><p>Among the sustainability indicators, the Authority counts quantitative metrics on the consumption of energy, greenhouse gas emissions and the production of waste, together with a qualitative statement on the impact of the use of equipment by blockchain network nodes on natural resources.</p><p>As for post-trade transparency, the ESMA proposes requiring CASPs to report trading and publication date and time, identification of the crypto-asset, pricing information, quantity, venue of execution and transaction ID. </p><p><em><strong>Related: <a data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/european-banking-authority-calls-for-early-adoption-of-stablecoin-standards/amp\" href=\"https://cointelegraph.com/news/european-banking-authority-calls-for-early-adoption-of-stablecoin-standards\">European Banking Authority calls for early adoption of stablecoin standards</a></strong></em></p><p>The ESMA also suggests allowing CASPs to store transaction data in “the format they consider most appropriate,” provided they are able to convert it into a specified format should the authorities request it. </p><p>The regulator will publish a final report based on feedback received and submit the draft technical standards to the European Commission by June 30 2024. However, before that, it will also publish a third consultation package in Q1 2024.</p><p>The ESMA released the previous consultation paper <a data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/esma-european-regulator-releases-consultative-paper-mica-standards-for-crypto-asset-service-providers/amp\" href=\"https://cointelegraph.com/news/esma-european-regulator-releases-consultative-paper-mica-standards-for-crypto-asset-service-providers\">in July</a>. In it, the ESMA proposed to require the crypto companies, who would be registered under MiCA, to still provide additional information in the form of notifications to the national competent authorities (NCAs) of the country they would be registered in.</p>\n</p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-06T08:45:46.000Z",
    "title": "Bitcoin and altcoins pushing higher",
    "url": "https://cryptodaily.co.uk/2023/10/bitcoin-and-altcoins-pushing-higher",
    "description": "Friday has dawned brightly for the crypto sector and a push to the upside is taking place."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-06T09:00:45.000Z",
    "title": "‘Trading Through Gamification Can Represent the Future’ Says Banksters’ Alexandru Carbunariu",
    "url": "https://news.bitcoin.com/trading-through-gamification-can-represent-the-future-says-banksters-alexandru-carbunariu/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/banksters-768x432.jpeg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"&#039;Trading Through Gamification Can Represent the Future&#039; Says Banksters&#039; Alexandru Carbunariu\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/banksters-300x169.jpeg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/banksters-1024x576.jpeg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/banksters-768x432.jpeg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/banksters-190x107.jpeg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/banksters-380x214.jpeg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/banksters-760x428.jpeg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/banksters.jpeg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />While centralized exchanges (cexs) are instrumental in helping new users grasp all things crypto, they nevertheless do not go &#x201C;the extra mile in educating their audience properly,&#x201D; Alexandru Carbunariu, the CMO at the edutech simulator Banksters, has asserted. According to Carbunariu, a Web3 advisor, properly educating newbies includes making the experience more interactive and fun. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-06T08:41:44.000Z",
    "title": "Are AI Bot Brokers Ready to Manage Your Investments?",
    "url": "https://www.cryptopolitan.com/ai-brokers-ready-to-manage-your-investments/",
    "description": "Over a decade ago, robo-investing services emerged with the promise of using algorithms to make and monitor investments. These robo-advisors were touted as a hassle-free alternative to traditional human advisors, offering the convenience of 24/7 service. However, the landscape is rapidly changing, thanks to the rise of generative AI. This new breed of AI can ... <a title=\"Are AI Bot Brokers Ready to Manage Your Investments?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-brokers-ready-to-manage-your-investments/\" aria-label=\"More on Are AI Bot Brokers Ready to Manage Your Investments?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-06T09:10:56.000Z",
    "title": "Ex-FTX founder Sam Bankman-Fried’s trial day 3: recap",
    "url": "https://crypto.news/ex-ftx-founder-sam-bankman-frieds-trial-day-3-recap/",
    "description": "Ex-FTX founder Sam Bankman-Fried's trial reached its third day on Oct. 5 in New York, where the prosecutor questioned Adam Yedidia"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-06T09:04:50.000Z",
    "title": "Circle’s USDC to become primary currency on XION blockchain",
    "url": "https://crypto.news/circles-usdc-to-become-primary-currency-on-xion-blockchain/",
    "description": "As part of the strategic agreement with Circle Ventures, XION will use USDC as its primary transactional currency"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-06T08:58:50.000Z",
    "title": "Canadian regulator unveils clear guidelines for stablecoins",
    "url": "https://crypto.news/canadian-regulator-unveils-clear-guidelines-for-stablecoins/",
    "description": "The Canadian Securities Administrators (CSA) has issued new guidelines clarifying the treatment of stablecoins in the country, acknowledging their importance"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-06T09:00:19.000Z",
    "title": "Bitcoin And Crypto Under The Lens As Bond Market Recalls 2008 Crash",
    "url": "https://www.newsbtc.com/news/bitcoin-crypto-bond-market-recalls-2008-crash/",
    "description": "As the global financial landscape witnesses a seismic shift, reminiscent of the 2008 financial crisis and the dot-com bubble burst, alarm bells are ringing in the bond market, alerting the Bitcoin and crypto market as well. Is A Crash Like 2008 Looming? Renowned Chartered Financial Analyst (CFA), Genevieve Roch-Decter, highlighted the striking parallels in a recent tweet, stating, &#8220;I can&#8217;t believe I am saying this but the slump in 10-year and 30-year bonds is approaching the epic drops we saw in stocks during the 2008 financial crisis and the dot-com bubble bust.&#8221; Bloomberg Surveillance&#8217;s Lisa Abramowicz reinforces this grim narrative, pointing out that &#8220;bonds maturing in 10 years or more have slumped 46% since peaking in March 2020, just shy of the 49% plunge in US stocks in the aftermath of the dot-com bust. The route in 30-year bonds has been even worse, tumbling 53%.&#8221; Onramp, a Bitcoin asset management platform, adds further context by emphasizing the historic nature of the trend. This decline, particularly in bonds with maturities exceeding a decade, harkens back to market downturns like the dot-com bubble collapse. The Federal Reserve&#8217;s resolute stance on inflation and a fragile fiscal environment have disrupted the traditional appeal of long-maturity debt, raising questions about the possibility of a debt spiral. The situation is further complicated by the behavior of the yield curve. Historically, an inverted yield curve has foreshadowed recessions. However, the recent correction has seen a rare &#8220;bear steepener,&#8221; marked by rising long-term yields. This phenomenon, seen in the past before recessions, raises concerns of an impending economic downturn. Related Reading: This Trader Thinks Bitcoin Is Undervalued Below $30,000: Time To Buy More BTC? “While some question the yield curve&#8217;s reliability as a recession indicator, the current bear steepening suggests that an economic downturn could be imminent. This is particularly concerning given the Fed&#8217;s ongoing commitment to restrictive monetary policy, making the situation ripe for potential market volatility and economic uncertainty, “ Dylan LeClair from Onramp notes. Meanwhile, Barclays&#8217; analyst Ajay Rajadhyaksha suggests that only a stock market crash could halt the bond market&#8217;s decline. Unlike previous cycles, traditional bond backstops are dwindling, with the Fed shifting from a net buyer to a net seller, and foreign institutional buying slowing. This highlights the stark disconnect between equity valuations and long-end bond rates, with stocks having significant room for devaluation before bonds stabilize. And if stocks crash, Bitcoin and crypto could be just as affected. Impact On Bitcoin And Crypto The turmoil in the bond market has far-reaching implications, including its impact on Bitcoin and crypto. Remarkably, the crypto market has never experienced such a situation, but there are general observations of how risk assets have reacted in such environments in the past. First, rising treasury yields make risk-free returns more attractive, potentially prompting some investors to reallocate capital from risk assets like Bitcoin and crypto to treasury bills. This shift could decrease demand, putting downward pressure on their prices. Related Reading: Arthur Hayes Predicts Bitcoin Price To Hit $750,000, Here’s When Moreover, a sharp rise in 10-year Treasury yields can signal a tighter monetary policy, weighing on risk assets. Higher yields also mean higher borrowing costs, which can impact crypto. When interest rates rise, non-interest-bearing assets like Bitcoin may seem less attractive compared to yield-bearing assets. A significant increase in Treasury yields can also lead to reduced liquidity in other financial markets, such as the Bitcoin and crypto space. Institutional investors facing liquidity constraints may liquidate more liquid assets like BTC and altcoins causing potential price declines. Lastly, sharp yield increases can create volatility across various asset classes as investors seek to reduce risk or cover losses elsewhere. Bitcoin and crypto are highly influenced by market sentiment and speculative behavior. The market&#8217;s interpretation of rising yields can sway investor behavior, impacting crypto prices. Accordingly, Charles Edwards, founder of Capriole Investments, recently predicted: The 10YR is up another 10% since! [&#8230;] The Fed wants more unemployment. The job market is still too strong. They&#8217;ve raised the expected 2024 rates as a result and the 10YR has broken out to new decade highs. As long as the 10YR is breaking upwards like this, risk assets are going to see further headwinds. At press time, BTC traded at $27,576. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-06T09:08:23.000Z",
    "title": "Latest Report Shows That Pikamoon, Sandbox, and Elon are Among the Top Coins to Watch Out For",
    "url": "https://www.crypto-news-flash.com/latest-report-shows-that-pikamoon-sandbox-and-elon-are-among-the-top-coins-to-watch-out-for/?utm_source=rss&utm_medium=rss&utm_campaign=latest-report-shows-that-pikamoon-sandbox-and-elon-are-among-the-top-coins-to-watch-out-for",
    "description": "Indeed, it&#8217;s not been the best of times for even the biggest projects in the crypto market. And as an investor, you&#8217;ll agree that making a move doesn&#8217;t get trickier than it is presently. Thankfully, the latest report from expert crypto analysts presents a ray of hope for investors as they identify Pikamoon, Sandbox, and [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-06T09:05:32.000Z",
    "title": "10 Hot Coins for October 2023 – Part 1",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/10-hot-coins-for-october-2023-part-1/",
    "description": "<p>October also goes by the name of Uptober in the crypto space. During the past 13 years, October only saw twice a red month. This is in contrast to September, which only saw 3 green months during the past 14 years.  So, here are 10 coins for Uptober to keep an eye out on. We [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/10-hot-coins-for-october-2023-part-1/\">10 Hot Coins for October 2023 – Part 1</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]