[
  {
    "source": "Cointelegraph",
    "date": "2023-10-25T08:19:12.000Z",
    "title": "85% of crypto rug pulls in Q3 didn’t report audits: Hacken",
    "url": "https://cointelegraph.com/news/rug-pulls-audits-report-hacken",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/c9c713f1-1f2a-45ec-affb-7454876b6a8c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A cryptocurrency rug pull is one of the simplest scams to prevent, according to blockchain security auditor Hacken.</p>\n                    <p><p>Cryptocurrency rug pulls are not too difficult to spot by investors, as the majority of such scams usually share distinct and visible features, according to a new report.</p><p>Blockchain security auditor Hacken released its latest security insights report on Oct. 25, aiming to spot the trends in Q3 crypto hacks and evaluate how affected projects approached security.</p><p>The report paid specific attention to <a href=\"https://cointelegraph.com/explained/crypto-rug-pulls-what-is-a-rug-pull-in-crypto-and-6-ways-to-spot-it\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/crypto-rug-pulls-what-is-a-rug-pull-in-crypto-and-6-ways-to-spot-it/amp\">rug pulls</a>, which are a type of exit scam occurring when a team pumps their project’s token before the sudden withdrawal of liquidity. According to Hacken, crypto rug pulls made up the largest amount of exploits in crypto, accounting for more than 65% of all hacks in Q3 2023.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/d0eb58e2-40f4-4989-9599-64813d94a8c3.png\"><figcaption style=\"text-align: center;\"><em>Cryptocurrency hacks by type in Q3 2023. Source: Hacken</em></figcaption></figure><p>The reason there are so many rug pulls on the market is that it’s easy to create such schemes. “Serial scammers use token factories that exhibit the same behavior to produce fraudulent tokens on a mass scale,” the report notes.</p><p>Despite their high prevalence, cryptocurrency rug pulls are “one of the simplest scams to prevent,” Hacken said, providing some tips about such scams based on its Q3 observations.</p><p>One of the most crucial ways to assess a project is to check for an independent third-party audit, according to Hacken. Of the 78 Q3 rug pulls examined by Hacken, only 12 reported having completed “any kind of audit.”</p><p>But even when a crypto project provides an audit, users should be vigilant to properly check them, as an audit alone doesn’t always guarantee protection from scams, Hacken noted, stating:</p><blockquote>“The project can undergo an audit and have an audit report, but with a poor score. Yet, users overlook this and consider the mere fact that the project was audited as sufficient.”</blockquote><p>According to Hacken co-founder and CEO Dyma Budorin, investors often ignore red flags like the absence of audits and other issues due to factors like the fear of missing out (FOMO). The industry has seen success stories with memecoins such as Pepe (<a href=\"https://cointelegraph.com/pepe-price-index\">PEPE</a>) and Shiba Inu (<a href=\"https://cointelegraph.com/shiba-inu-price-index\">SHIB</a>), where $100 out of curiosity led to significant profits, so people tend to hope for this history to repeat, the executive noted.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/safereum-suspected-rug-pull-exit-scam-certik\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/safereum-suspected-rug-pull-exit-scam-certik/amp\"><strong><em>Rug pull feared as Safereum devs reportedly unlock and dump native token</em></strong></a></p><p>“This desire for substantial returns in a short timeframe often causes individuals to overlook red flags and impulsively dive into investments,” Budorin said, adding:</p><blockquote>“Scammers are well aware of this, and they are very good at mimicking successful projects. [...] Scammers frequently refer to thriving projects, intensifying the FOMO on the next big opportunity.”</blockquote><p>Hacken’s CEO also stressed that the process of investing in cryptocurrency is a “no-brainer for many users,” requiring “only a few clicks.” According to the executive, this fact can also lead to impulsive decision-making.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-25T08:30:48.000Z",
    "title": "Lightspark Open Sources Email-Like Protocol UMA; Raises Debate on Compliance",
    "url": "https://news.bitcoin.com/lightspark-open-sources-email-like-protocol-uma-raises-debate-on-compliance/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/505c8dae-ff25-4305-9e22-98a450d9895d-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Lightspark Open Sources Email-Like Protocol UMA; Raises Debate on Compliance\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/505c8dae-ff25-4305-9e22-98a450d9895d-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/505c8dae-ff25-4305-9e22-98a450d9895d-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/505c8dae-ff25-4305-9e22-98a450d9895d-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/505c8dae-ff25-4305-9e22-98a450d9895d-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/505c8dae-ff25-4305-9e22-98a450d9895d-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/505c8dae-ff25-4305-9e22-98a450d9895d-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/505c8dae-ff25-4305-9e22-98a450d9895d.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Lightspark, a Lightning Network (LN) financial services company, has announced it has open-sourced Universal Money Address (UMA), a protocol similar to email, but for money. The protocol will be interoperable, allowing platforms to exercise due compliance on the transactions facilitated, an inclusion criticized by the Bitcoin community on social media. Lightspark Opens UMA Protocol Lightspark, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-25T08:15:01.000Z",
    "title": "XRP Price Balloons 13%, Triumphs Over Resistance: The Start Of A Bigger Story?",
    "url": "https://www.newsbtc.com/news/xrp-price-balloons-13-triumphs-over-resistance-the-start-of-a-bigger-story/",
    "description": "In the past few days, XRP has achieved a significant breakthrough of notable resistance levels, offering a hint of impending substantial price movements. This development has been closely watched by the cryptocurrency community, who have observed a notable degree of volatility in XRP&#8217;s price dynamics in recent times. The cryptocurrency&#8217;s ability to surmount these substantial resistance barriers signals a possible shift in market dynamics and has generated considerable interest among traders and investors. Related Reading: Dogecoin Aggressive 12% Leap: Fear/Greed Index Uncovers Bullish Sentiment Secrets XRP&#8217;s Legal Victory Sets The Stage For A Promising Future Ripple&#8217;s native token, XRP, has emerged as a standout performer in the cryptocurrency space following a significant legal victory against the US Securities and Exchange Commission in mid-July. At that pivotal moment, a federal judge ruled that Ripple&#8217;s structured XRP sales did not fall under the classification of investment contracts. Since this ruling effectively established that XRP&#8217;s status as a digital asset was distinct from being deemed a security, it delivered a much-needed boost of confidence to the cryptocurrency and blockchain communities. It was a watershed moment for Ripple and its digital currency, highlighting the company&#8217;s potential for growth inside the industry&#8217;s shifting legal structure. The verdict in this case has rekindled hope and set XRP&#8217;s future on a promising course. At the time of writing, XRP was trading at $0.55, up 1.6% in the last 24 hours and registering a decent 13% increase in the last seven days, data from crypto market tracker Coingecko shows. XRP seven-day price action. Source: Coingecko In the context of the cryptocurrency market, where trends can change rapidly, the observation that XRP has not only crossed but exceeded both the 200-day and 50-day Exponential Moving Averages carries considerable weight. EMAs are widely recognized as crucial technical tools, serving as essential guides for traders and analysts to evaluate an asset&#8217;s price movement over specific timescales. Related Reading: Solana Barrels Close To $32: Critical Levels Traders Should Watch XRP market cap currently at $29.414 billion. Chart: TradingView.com XRP&#8217;s Price Action And Key Resistance When XRP&#8217;s price action consistently rises above these key EMAs, it is taken as a bullish sign that the cryptocurrency may be headed for new highs. Given the current climate of the cryptocurrency market, where rising prices tend to coincide with rising confidence and investor interest, this event takes on greater significance. The altcoin has exhibited a commendable weekly performance, thereby approaching a critical level of $0.56. This particular price point has consistently served as a resistance level since the middle of August. The Relative Strength Index (RSI) indicates a prolonged bullish trend as it remains above the neutral line at 50.0. This suggests the possibility of a breakthrough at the price level of $0.54, maybe resulting in an upward movement of the XRP price towards $0.60. Meanwhile, the euphoric feeling surrounding Bitcoin&#8217;s ascent to $35,000, which frequently serves as a benchmark for the rest of the crypto market, can be partially ascribed to the present momentum being enjoyed by XRP. Is this the commencement of a larger narrative? (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Protos"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-25T08:33:27.000Z",
    "title": "FTX in High-Stakes Talks with Bidders: Restart Decision Looms",
    "url": "https://www.crypto-news-flash.com/ftx-in-high-stakes-talks-with-bidders-restart-decision-looms/?utm_source=rss&utm_medium=rss&utm_campaign=ftx-in-high-stakes-talks-with-bidders-restart-decision-looms",
    "description": "<img width=\"1000\" height=\"623\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-300x187.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-768x478.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-163x102.png 163w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-24x15.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-36x22.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-48x30.png 48w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />FTX is in talks with three top bidders as it considers a proposal to restart in 2024. In a court hearing, the company&#8217;s investment banker revealed that the exchange would make a final decision in December. Speculation of FTX restarting next year has now been confirmed in a court hearing on Tuesday. FTX Trading Ltd. [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-25T08:33:08.000Z",
    "title": "Binance’s Market Q3-2023 Report",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/binances-market-q3-2023-report/",
    "description": "<p>In crypto, time passes really fast! In the blink of an eye, we&#8217;re already in 2023&#8217;s last quarter. But, before we end the year, let&#8217;s review the events and lessons from Q3-2023. To do this, we&#8217;ll be summarizing key points from Binance&#8217;s Market Q3-2023 Report. Our latest State of Crypto Report summarises all the key [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/binances-market-q3-2023-report/\">Binance’s Market Q3-2023 Report</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-25T08:32:00.000Z",
    "title": "Maker (MKR) Loses Key Support After Its Steep Correction",
    "url": "https://coinedition.com/maker-mkr-loses-key-support-after-its-steep-correction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/MakerDAO_is_planning_to_become_as_resilient_as_possible_with_their-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Maker DAO Community Votes to Implement EDSR Via GOV12.1.2\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/MakerDAO_is_planning_to_become_as_resilient_as_possible_with_their-1.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/MakerDAO_is_planning_to_become_as_resilient_as_possible_with_their-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/MakerDAO_is_planning_to_become_as_resilient_as_possible_with_their-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/MakerDAO_is_planning_to_become_as_resilient_as_possible_with_their-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/MakerDAO_is_planning_to_become_as_resilient_as_possible_with_their-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The price of Maker (MKR) underwent a strong correction over the past 24 hours according to data from the cryptocurrency market tracking website CoinMarketCap. At press time, the altcoin was down 7.45% and was changing hands at $1,448.66 as a result. MKR’s price had been in a consolidation phase between $1,385 and $1,488 over the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/maker-mkr-loses-key-support-after-its-steep-correction/\">Maker (MKR) Loses Key Support After Its Steep Correction</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-25T08:14:00.000Z",
    "title": "TRB Surges Amidst Massive Withdrawals Nearing 50% of Total Supply",
    "url": "https://coinedition.com/trb-surges-amidst-massive-withdrawals-nearing-50-of-total-supply/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Price-analysis-9-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Upon Finding Support at $0.3746, GMT Bulls Pounce, Propelling Prices by 2.52%\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Price-analysis-9-1.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Price-analysis-9-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Price-analysis-9-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Price-analysis-9-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Price-analysis-9-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Price-analysis-9-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Tellor’s TRB token has drawn attention recently as whales continue to move it around in massive transactions. Lookonchain, a leading web3 analysis platform, recently revealed that newly created wallets have accumulated and withdrawn an enormous amount of TRB from Binance and other exchanges. According to the data, a total of 22 fresh wallets have accumulated [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/trb-surges-amidst-massive-withdrawals-nearing-50-of-total-supply/\">TRB Surges Amidst Massive Withdrawals Nearing 50% of Total Supply</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]