[
  {
    "source": "Decrypt",
    "date": "2023-08-31T20:54:58.000Z",
    "title": "Google's Generative AI Tools Now Turn Text Into Online Worlds",
    "url": "https://decrypt.co/154510/google-generative-ai-tools-turn-text-online-worlds",
    "description": "Hiber3D has integrated Google's AI tools to give creators the ability to type what they want to see—and generate an immersive world."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-31T20:45:15.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>The United States Securities and Exchange Commission has delayed rulings on five spot Bitcoin ETF applications. Analysts had tipped the chances of a spot Bitcoin ETF by year's end to 75% after a recent victory by Grayscale against the SEC. Meanwhile, a New York District judge has dismissed a class-action lawsuit against Uniswap.</p><h3>SEC delays ruling on five spot Bitcoin ETFs</h3><p>Predictably, the United States Securities and Exchange Commission has kicked the can down the road on <a href=\"https://cointelegraph.com/news/sec-delays-decision-on-wisdomtree-s-spot-bitcoin-etf\">five spot Bitcoin ETF applications</a>.</p><p>Applications submitted by WisdomTree, Valkyrie, VanEck, Fidelity and Invesco Galaxy were all postponed by the securities regulator, according to an Aug. 31 SEC filing. By postponing the decisions, the SEC has another 45 days to contemplate a proposed rule change that would pave the way for the first spot Bitcoin ETF approval.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">JUST IN: SEC is opting to delay (as expected) on spot bitcoin ETF deadlines <a href=\"https://t.co/W4JjOji6L2\">pic.twitter.com/W4JjOji6L2</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1697328538670473484?ref_src=twsrc%5Etfw\">August 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The move came mere days after the <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">SEC lost a crucial lawsuit</a> brought by crypto asset manager Grayscale. Many in the crypto community took the decision to mean that the odds of a spot ETF approval had significantly increased. </p><p>In addition to the aforementioned applicants, several firms are vying for a spot Bitcoin ETF listing. Chief among them are BlackRock, ARK Invest and Bitwise Asset Management. </p><h3>Bitcoin ETFs now have a 75% chance of approval, say analysts</h3><p>Bloomberg analysts have <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-chance-raised-after-grayscale-victory-bloomberg\">raised the probability</a> for an approved spot Bitcoin exchange-traded fund (ETF) by the end of 2023 to a whopping 75% — following a recent Grayscale victory against the federal securities regulator.</p><p>In a Aug. 30 post on X (Twitter), Bloomberg senior ETF analyst Eric Balchunas said they have raised the chances to 75% from an earlier 65% — due to the unanimity and decisiveness at which the United States Court of Appeals Circuit reached its decision in the recent case.</p><p>Fellow ETF analyst James Seyffart added that spot Bitcoin ETF approvals will likely be a “done deal” by Q4 2024, estimating the approval odds amounts to 95% for then. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">NEW: <a href=\"https://twitter.com/JSeyff?ref_src=twsrc%5Etfw\">@JSeyff</a> &amp; I are upping our odds to 75% of spot bitcoin ETFs launching this yr (95% by end of &#39;24). While we factored Grayscale win into our prev 65% odds, the unanimity &amp; decisiveness of ruling was beyond expectations and leaves SEC w &quot;very little wiggle room&quot; via <a href=\"https://twitter.com/NYCStein?ref_src=twsrc%5Etfw\">@NYCStein</a> <a href=\"https://t.co/IyEGmWjuHa\">pic.twitter.com/IyEGmWjuHa</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1696887691122548798?ref_src=twsrc%5Etfw\">August 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Balchunas added that given the recent legal and public relations loss, a denial by the SEC will be “politically untennable.”</p><p>Meanwhile, Republican presidential candidate Vivek Ramaswamy as lauded Grayscale’s recent victory over the federal securities regulator, arguing the decision will help keep <a href=\"https://cointelegraph.com/news/vivek-ramaswamy-grayscale-win-path-for-bitcoin-innovation\">Bitcoin and blockchain innovation from going overseas</a>.</p><p>Ramaswamy is one of three presidential candidates still in the running who has shown outward support for the crypto industry, along with Robert Kennedy Jr. and Ron DeSantis.</p><h3>Judge dismisses class-action lawsuit against Uniswap</h3><p>Decentralized exchange Uniswap was <a href=\"https://cointelegraph.com/news/judge-dismisses-class-action-suit-against-uniswap-over-token-scam-losses\">vindicated from a class-action lawsuit</a> after a judge showed rare understanding of the DeFi marketplace and how it operated. </p><p>Judge Katherine Polk Failla of the Southern District of New York dismissed claims of fraud brought forward by six plaintiffs. </p><p>The lawsuit was filed in April 2022 on behalf of a “nationwide class of users.” Plaintiffs claimed that Uniswap Labs controlled liquidity pools, including those created by scammers who launched fake tokens on the DEX. The judge claimed that neither the plaintiffs nor the defendants knew the <a href=\"https://cointelegraph.com/news/cz-binance-ceo-warns-of-phishing-scams-as-uniswap-founder-gets-hacked\">identities of the scammers</a>. Instead of suing the scammers, the plaintiffs were suing the defendants over statements made on social media.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Big Lesson for crypto policymakers and financial regulators (and the administrative state at large):<br><br>If you choose to avoid the legal process, if you do not want to engage in good faith rulemaking, the courts will not bail you out. <a href=\"https://t.co/r5RATmiwwq\">https://t.co/r5RATmiwwq</a></p>&mdash; Mike Wawszczak (@mikewawszczak) <a href=\"https://twitter.com/mikewawszczak/status/1696912680173674971?ref_src=twsrc%5Etfw\">August 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“The Court declines to stretch the federal securities laws to cover the conduct alleged, and concludes that Plaintiffs’ concerns are better addressed to Congress than to this Court,” Failla’s order read.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-31T21:05:06.000Z",
    "title": "SEC delays decision on five spot Bitcoin ETFs",
    "url": "https://cryptoslate.com/sec-delays-decision-on-five-spot-bitcoin-etfs/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) postponed decisions regarding proposed rule changes related to spot Bitcoin ETFs on Aug. 31. The SEC&#8217;s latest round of notices pushes back decisions on proposed rule changes from Fidelity (Wise Origin), VanEck, WisdomTree, and Invesco, all of which intend to offer a spot Bitcoin ETF via Cboe BZX [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-delays-decision-on-five-spot-bitcoin-etfs/\">SEC delays decision on five spot Bitcoin ETFs</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T20:52:53.000Z",
    "title": "Brazillian football legend Ronaldinho denies involvement in alleged cryptocurrency scheme during legislative hearing",
    "url": "https://www.cryptopolitan.com/ronaldinho-denies-alleged-cryptocurrency-scheme-legislative-hearing/",
    "description": "Brazilian football legend Ronaldo de Assis Moreira, commonly known as Ronaldinho, appeared before a legislative commission to refute allegations of his involvement in a cryptocurrency scam named &#8220;18k Ronaldinho.&#8221;&#160; The scheme had promised investors returns of up to 400% in less than a year. Ronaldinho asserted that he had not authorized the use of his ... <a title=\"Brazillian football legend Ronaldinho denies involvement in alleged cryptocurrency scheme during legislative hearing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ronaldinho-denies-alleged-cryptocurrency-scheme-legislative-hearing/\" aria-label=\"More on Brazillian football legend Ronaldinho denies involvement in alleged cryptocurrency scheme during legislative hearing\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-31T21:02:33.000Z",
    "title": "Swift concludes trial on blockchain interoperability and asset transfer",
    "url": "https://crypto.news/swift-concludes-trial-on-blockchain-interoperability-and-asset-transfer/",
    "description": "Swift has shared key findings from its recent experiments on blockchain compatibility"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-31T20:46:55.000Z",
    "title": "Kaiko: USDT has been depegging throughout August",
    "url": "https://crypto.news/kaiko-usdt-has-been-depegging-throughout-august/",
    "description": "Kaiko, crypto analytics platform, claims that the largest stablecoin by market cap, USDT, has been depegging in August"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-31T21:00:46.000Z",
    "title": "Bitcoin Rollercoaster: Analyst Forecasts $8,000 Dip Before Skyrocketing To $200,000",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-rollercoaster-analyst-forecasts-dip-before-skyrocketing/",
    "description": "In his recent interview, Mike McGlone, Bloomberg Intelligence&#8217;s Senior Commodity Strategist, predicted Bitcoin&#8217;s potential fall amid the ongoing market downturn. However, it wasn&#8217;t all gloom from the seasoned analyst, as he also touched upon the longer-term prospects of the flagship cryptocurrency. Will Bitcoin Touch $8,000? It is worth noting that Bitcoin has undergone a fair share of price fluctuations since its inception. In the interview, McGlone compared Bitcoin&#8217;s volatile nature to the days of the stock market. His predictions, grounded in his analytical observations, also prompted apprehension and agreement. Related Reading: Long-Term Bitcoin Holders Keep The Faith: 40% Supply Remains Untouched For Over 3 Years Mike McGlone&#8217;s interview was rife with insights into the cryptocurrency market, but one statement stood out: his belief that Bitcoin could plunge to a low of $8,000 in the current bear market. McGlone emphasized that despite the potential for such a drastic drop. Bitcoin remains the world&#8217;s top-performing asset.  McGlone stated that Bitcoin hasn’t exhibited deflationary characteristics like Treasury bills and gold. Instead, he pointed out that macroeconomic elements, particularly the Federal Reserve’s ongoing tightening policies, continue to have a pronounced effect on Bitcoin’s price. Institutional Influence: Not the Immediate Boost Many Anticipate? Another popular belief within the crypto community is that spot ETF approvals, and an influx of institutional investors would catapult Bitcoin&#8217;s price to new heights. McGlone, however, expressed skepticism regarding this sentiment. In his view, while a spot ETF approval may sway market sentiment, it might not substantially impact Bitcoin&#8217;s price trajectory. McGlone suggested that the earliest spot ETF might not see daylight until next year. On which spot ETF could potentially make the first move, McGlone&#8217;s bet is on BlackRock. Citing the institution&#8217;s commanding presence in the market and its reputation as the world&#8217;s leading asset manager, he believes BlackRock might lead the pack in the spot ETF space. McGlone maintained confidence in Bitcoin&#8217;s long-term bullish prospects despite these short-term projections. He reaffirmed his vision of the crypto giant eventually reaching a value of $200,000. Related Reading: XRP Lawyer Reacts: Grayscale’s Triumph Paves Way For Bitcoin’s Next Big Thing Meanwhile, following the announcement of Grayscale&#8217;s legal victory against the US Securities Exchange and Commission (SEC), Bitcoin has retraced noticeably from its Tuesday peak of $27,974, dropping to $26,885 at the time of writing. Bitcoin&#8217;s daily trading volume has also dipped along with its price, dropping from last Thursday&#8217;s peak of $12 billion to $10 billion in the past 24 hours. Notably, Bitcoin&#8217;s market cap currently sits at $523 billion when writing. Featured image from Unsplash, Chart from TradingView"
  }
]