[
  {
    "source": "Cointelegraph",
    "date": "2023-09-03T06:23:25.000Z",
    "title": "Binance CEO CZ forecasts DeFi outgrowing CeFi in the next bull run  ",
    "url": "https://cointelegraph.com/news/binance-ceo-cz-de-fi-ce-fi-bull-run",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/fe44540f-08d3-499a-ac1d-62ec6f0dbe63.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance CEO Changpeng “CZ” Zhao declares that the cryptocurrency industry will only become better as it becomes more decentralized.</p>\n                    <p><p>Binance CEO Changpeng “CZ” Zhao predicts that decentralized finance (DeFi) has the potential to surpass centralized finance (CeFi) in the next bull run.</p><p>In an Sept 1 live X <a href=\"https://twitter.com/cz_binance/status/1697574830156177816\" target=\"_blank\" rel=\"noopener nofollow\">Spaces</a> (formerly Twitter Spaces), titled <em>CZ AMA</em>, CZ stated his predictions for the future of DeFi. “I think the more decentralized the industry becomes the better,” he declares, adding that it might not be long before it takes the top spot:</p><blockquote>“Defi is the future, the volume is somewhere between 5% to 10% of CeFi volumes, which is not small right [...] the next bull run may very well make DeFi bigger than CeFi.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Live now.<a href=\"https://t.co/e4bVfhKwRB\">https://t.co/e4bVfhKwRB</a></p>&mdash; CZ  Binance (@cz_binance) <a href=\"https://twitter.com/cz_binance/status/1697574830156177816?ref_src=twsrc%5Etfw\">September 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On June 9, Cointelegraph reported that following the United States Securities and Exchange Commission (SEC) legal action against centralized exchanges Coinbase and Binance, the median trading volume <a href=\"https://cointelegraph.com/news/defi-volumes-surge-after-binance-coinbase-lawsuits-finance-redefined\">on the top three</a> decentralized exchanges (DEX) surged by 444% within a 48-hour span. At the time of <a href=\"https://www.coingecko.com/en/exchanges/decentralized\" target=\"_blank\" rel=\"noopener nofollow\">publication</a>, the 24-hour trading volume on DEX's is $722,776,226.</p><p>CZ also shared his perspective on the recent dismissal of the lawsuit against the decentralized protocol Uniswap. “I agree with the uniswap thing was extremely positive, extremely reasonable and logical and clear. That is very good,\" he declared.</p><p>On Aug. 30, a US federal court dismissed a class action lawsuit against Uniswap, and its CEO, foundation and venture capital backers, <a href=\"https://cointelegraph.com/news/judge-dismisses-class-action-suit-against-uniswap-over-token-scam-losses\">brought by plaintiffs</a> who claimed they lost money due to scam tokens on <a href=\"https://cointelegraph.com/news/uniswap-class-action-suit-judge-says-ether-is-commodity\">the decentralized</a> cryptocurrency exchange.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/balancer-protocol-exploited-for-900k-as-defi-hacks-mount-finance-redefined\">Balancer protocol exploited for $900K as DeFi hacks mount: Finance Redefined</a></em></strong></p><p>The judge rejected the case because neither side could identify the scammers. Instead of suing the scammers for illegal solicitation, the plaintiffs were suing the defendants for what they said on social media.</p><p>During the Spaces, someone recalled the judge's decision that developers cannot be liable for misuse of their platform which he believes is positive news for DeFi builders in the industry, CZ was quick to again praise the ruling.</p><p>“Developer writing code, code is free speech, that development is really good,\" CZ stated.</p><p>He also talked about how cryptocurrency should be used by every country, with some needing it more urgently than others.</p><blockquote>“Every country needs crypto, some countries need it more urgently than others. Developed countries there may be less of a need, but ten they are letting the other guys catch up. So if they want to maintain the lead in terms of financial innovation, then they’ll need to adopt it.”</blockquote><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\">How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]