[
  {
    "source": "CryptoGlobe",
    "date": "2023-09-04T21:50:50.000Z",
    "title": "Bybit Unveils TradeGPT: AI Mentor Leveraging Bybit’s Market Data for Helping Crypto Traders",
    "url": "https://www.cryptoglobe.com/latest/2023/09/bybit-unveils-tradegpt-ai-mentor-leveraging-bybits-market-data-for-helping-crypto-traders/",
    "description": "Bybit, a popular cryptocurrency exchange, has launched TradeGPT, an AI-based educational tool. This new addition is part of Bybit’s initiative to serve as a “Crypto Ark,” aiming to be a resource center in the cryptocurrency sector. In a blog post published earlier today, Bybit said that TradeGPT is designed to utilize Bybit’s existing market data, […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-04T22:01:52.000Z",
    "title": "Europe wins the inflation pageant, beating U.S.",
    "url": "https://www.cryptopolitan.com/europe-wins-the-inflation-pageant-beating-us/",
    "description": "While many nations rally to celebrate their achievements, Europe finds itself in the limelight for a rather unwelcome reason. Their persistence with inflation stands out, and not in a way that invites applause. In a contest no country wants to win, Europe seems to be taking the lead, standing out starkly against the U.S. The ... <a title=\"Europe wins the inflation pageant, beating U.S.\" class=\"read-more\" href=\"https://www.cryptopolitan.com/europe-wins-the-inflation-pageant-beating-us/\" aria-label=\"More on Europe wins the inflation pageant, beating U.S.\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-04T21:56:01.000Z",
    "title": "China’s president is focusing on all the wrong things",
    "url": "https://www.cryptopolitan.com/china-president-focusing-on-the-wrong-things/",
    "description": "Amidst the rumbling waves of China&#8217;s economic challenges, President Xi Jinping is seemingly turning a blind eye to pressing issues. While the world watches in suspense, China&#8217;s leader appears to be engrossed elsewhere, letting serious economic matters slide. Economic Woes Fall on Deaf Ears From property sector unrest to rising local debt and floundering consumer ... <a title=\"China’s president is focusing on all the wrong things\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-president-focusing-on-the-wrong-things/\" aria-label=\"More on China’s president is focusing on all the wrong things\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-04T21:45:59.000Z",
    "title": "China is criticizing US’s strategies harshly – The details",
    "url": "https://www.cryptopolitan.com/china-criticizing-us-strategies-harshly/",
    "description": "Recent maneuvers from the US, with its blend of diplomacy and containment, are drawing the ire of China&#8217;s formidable intelligence arm. The looming question now is whether this brewing tension jeopardizes the anticipated November summit between the two superpowers. Veiled Threats and Impending Summits Amid the backdrop of alleged US attempts to warm bilateral ties, ... <a title=\"China is criticizing US’s strategies harshly &#8211; The details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-criticizing-us-strategies-harshly/\" aria-label=\"More on China is criticizing US’s strategies harshly &#8211; The details\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-04T22:00:33.000Z",
    "title": "No Vitalik, No Problem: Whale Sells Ethereum (ETH) For Maker (MKR)",
    "url": "https://www.newsbtc.com/news/defi/no-vitalik-no-problem-whale-sells-ethereum-for-maker/",
    "description": "Less than a week after Vitalik Buterin, one of the co-founders of Ethereum, sold his Maker (MKR) stash for ETH, one crypto whale has done the opposite. On-chain data on September 4 shows that one Ethereum holder sold 694 ETH, worth roughly $1.13 million when writing, for 1,010 MKR. At the time of the swap, MKR was changing hands at $1,122.  Whale Swaps ETH For MKR As of September 4, the address, “0x3737,” had over $20.37 million worth of assets. While the whale trades against Vitalik and doubles down on MKR, zooming in on the address’s portfolio shows that the largest holding is ETH.  The address holds 10,000 ETH worth $16.3 million at spot rates, representing over 75% of the total portfolio. Meanwhile, some of his other major holdings include Arbitrum (ARB), worth $2.9 million, and MKR, worth $1.1 million.  Related Reading: XRP Summer Showdown: Trading Hype Versus Price Reality, What Lies Ahead? MKR, the token issued by MakerDAO, the decentralized autonomous organization (DAO) that controls the minting of DAI, a stablecoin on Ethereum, has been ripping higher in the last few months.  MKR plays a key role in stabilizing DAO and is used as a last resort. Holders participate in governance, voting on proposals that best stabilize the algorithmic stablecoin, deciding collateral types accepted, stability fee adjustments, and others. From June, MKR has more than doubled, rising 125% to peak at around $1,300 in early August. It is now trading at over $1,100, up 13% from August lows. Maker Presents Endgame The token’s surge has been attributed to multiple factors, specifically the release of the “Endgame” roadmap. Under this plan, MakerDAO plans to, among other things, release their blockchain, rebrand, and introduce two more tokens.  This move is significant because MakerDAO is among the first decentralized finance (DeFi) protocols. According to DeFiLlama data, the protocol has a total value locked (TVL) of over $5 billion. It is the largest decentralized money market in the world.  Meanwhile, DAI, its algorithmic yield-earning stablecoin, has been stable recently and is the largest in Ethereum. At press time, DAI had a market cap of $5.3 billion, perched at 12th on the leaderboard. At this pace, DAI is the third-largest stablecoin after USDT and USDC. Related Reading: Shiba Inu Whales Begin Accumulation As Shibarium Grows Vitalik Buterin, despite the stellar performance of MKR relative to the broader crypto market, liquidated $580,000 worth of MKR after MakerDAO’s co-founder, Rune Christensen, said it was considering launching a new blockchain bridging to Ethereum that’s based on Solana’s code. The new blockchain, dubbed NewChain, is part of MakerDAO’s roadmap, “Endgame”. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-04T22:01:10.000Z",
    "title": "This Ethereum Rival Is the ‘Most Loved Altcoin’ by Institutional Investors This Year, According to CoinShares",
    "url": "https://dailyhodl.com/2023/09/04/this-ethereum-rival-is-the-most-loved-altcoin-by-institutional-investors-this-year-according-to-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/solana-updates-outlook.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/solana-updates-outlook.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/solana-updates-outlook.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/solana-updates-outlook.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/solana-updates-outlook.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/solana-updates-outlook.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/solana-updates-outlook.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says that one top Ethereum (ETH) rival is being cherished over all other altcoins this year. In its latest Digital Asset Fund Flows Weekly Report, CoinShares finds that while the overall digital asset markets suffered minor outflows last week, Solana (SOL) saw minor inflows for the ninth consecutive week. &#8220;While Solana saw [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/04/this-ethereum-rival-is-the-most-loved-altcoin-by-institutional-investors-this-year-according-to-coinshares/\">This Ethereum Rival Is the ‘Most Loved Altcoin’ by Institutional Investors This Year, According to CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]