[
  {
    "source": "CryptoSlate",
    "date": "2024-01-09T05:00:51.000Z",
    "title": "OpenAI claims New York Times was in partnership talks prior to lawsuit",
    "url": "https://cryptoslate.com/openai-claims-new-york-times-was-in-partnership-talks-prior-to-lawsuit/",
    "description": "<p>OpenAI published a blog post on Jan. 8 in which it responded to an ongoing lawsuit previously initiated by The New York Times. On Dec. 27, the newspaper alleged in a lawsuit that OpenAI violated copyright law and used millions of its articles to train automated chatbots. OpenAI, however, claims that The New York Times [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/openai-claims-new-york-times-was-in-partnership-talks-prior-to-lawsuit/\">OpenAI claims New York Times was in partnership talks prior to lawsuit</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-09T05:00:51.000Z",
    "title": "Bank of Spain Announces Partners for Wholesale CBDC Trials",
    "url": "https://news.bitcoin.com/bank-of-spain-announces-partners-for-wholesale-cbdc-trials/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/f5ce9d2d-5d46-4349-ada2-75418bea3d1e-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bank of Spain Announces Partners for Wholesale CBDC Trials\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/f5ce9d2d-5d46-4349-ada2-75418bea3d1e-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/f5ce9d2d-5d46-4349-ada2-75418bea3d1e-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/f5ce9d2d-5d46-4349-ada2-75418bea3d1e-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/f5ce9d2d-5d46-4349-ada2-75418bea3d1e-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/f5ce9d2d-5d46-4349-ada2-75418bea3d1e-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/f5ce9d2d-5d46-4349-ada2-75418bea3d1e-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/f5ce9d2d-5d46-4349-ada2-75418bea3d1e.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Bank of Spain has announced that Adhara, a treasury and transactions payment platform, and a consortium formed by Cecabank and Abanca, two private banks, will be its partners in the development of several upcoming wholesale central bank digital currency (CBDC) trials, which will be complete outside of the ongoing digital euro process. Bank of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-09T04:44:09.000Z",
    "title": "Ethereum Price Avoids Trend Reversal But Key Hurdle Still Intact",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-hurdle-2350/",
    "description": "Ethereum price managed to stay above $2,170 and recovered losses. ETH consolidating and still facing many hurdles near $2,350 and $2,400. Ethereum is attempting a fresh increase above the $2,300 resistance level. The price is trading above $2,250 and the 100-hourly Simple Moving Average. There was a break above a connecting bearish trend line with resistance near $2,245 on the hourly chart of ETH/USD (data feed via Kraken). The pair could gain bullish momentum if there is a close above the $2,350 level. Ethereum Price Regains Strength Ethereum price extended its decline below the $2,200 level. However, ETH remained stable near the $2,180 and $2,170 levels. A low was formed near $2,170 and the price started a fresh increase, like Bitcoin. There was a decent increase above the $2,240 level. There was also a break above a connecting bearish trend line with resistance near $2,245 on the hourly chart of ETH/USD. The pair climbed above the $2,320 resistance, but the bears were active near $2,350. A high was formed near $2,358 and the price is now correcting gains. There was a minor decline below the $2,320 level. The price moved below the 23.6% Fib retracement level of the upward move from the $2,170 swing low to the $2,358 high. ETH is now trading above $2,250 and the 100-hourly Simple Moving Average. If there is a fresh increase, the price might face resistance near the $2,350 level. The next major resistance is now near $2,400. Source: ETHUSD on TradingView.com The main uptrend hurdle sits at $2,450. A close above the $2,450 resistance could start a decent upward move. The next key resistance is near $2,540. If the bulls push Ethereum above $2,540, there could be a rally toward $2,720. Any more gains might send the price toward the $2,800 zone. Another Decline in ETH? If Ethereum fails to clear the $2,350 resistance, it could start a fresh decline. Initial support on the downside is near the $2,280 level. The first key support could be the $2,260 zone or the 50% Fib retracement level of the upward move from the $2,170 swing low to the $2,358 high. A downside break and a close below $2,260 might send the price further lower. In the stated case, Ether could test the $2,170 support. Any more losses might send the price toward the $2,050 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $2,260 Major Resistance Level – $2,350"
  }
]