[
  {
    "source": "Decrypt",
    "date": "2023-12-16T14:01:02.000Z",
    "title": "The Biggest Games Coming Out in 2024",
    "url": "https://decrypt.co/210052/biggest-games-coming-out-nintendo-playstation-xbox-pc",
    "description": "From Final Fantasy VII Rebirth to Star Wars Outlaws and plenty in between, these are our most anticipated games of 2024."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T14:05:42.000Z",
    "title": "Hidden Feature in Windows 11 Suggests Potential Ability to Uninstall AI Components",
    "url": "https://www.cryptopolitan.com/hidden-feature-in-windows-11-suggests-potential-ability-to-uninstall-ai-components/",
    "description": "In a recent development, Windows 11 appears to be working on a feature that could allow users to uninstall AI components from the operating system. The discovery was made by PhantomOfEarth, a known leaker, who found a hidden Settings page for AI components in Windows 11 preview build 26016, part of the Canary channel. While [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T13:58:32.000Z",
    "title": "Artificial Intelligence Outsmarts Humans in Puzzles, Marks a Milestone Discovery",
    "url": "https://www.cryptopolitan.com/ai-outsmarts-humans-in-puzzles/",
    "description": "In a groundbreaking development, researchers at DeepMind, the artificial intelligence (AI) powerhouse behind Google, claim that AI has surpassed human intelligence in solving complex puzzles. The achievement, rooted in language models akin to those driving chatbots like ChatGPT, signals a potential shift in the balance of intellectual prowess between humans and machines. Unveiling fun search [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-16T14:00:24.000Z",
    "title": "Bitwise Reveals Two Major Triggers That Will Send Bitcoin Price To $80,000",
    "url": "https://www.newsbtc.com/news/bitcoin/bitwise-reveals-two-major-triggers-that-will-send-bitcoin-price-to-80000/",
    "description": "Bitwise, a crypto index fund manager, has forecasted a bullish price for Bitcoin that would take it past its current all-time high. Bitcoin is currently in a bullish sentiment, and the price has doubled this year. But according to this fund manager, this sentiment will continue into next year. In a recently released report, Bitwise predicted BTC will hit $80,000 in 2024, identifying two major catalysts that will send the crypto soaring. Related Reading: Osmosis Rally Intensifies With 77% Increase – Will OSMO Hit $2 This Month? Bitwise Predicts $80,000 Bitcoin In its report, Bitwise laid out 10 things to look out for in the crypto industry in 2024, one of which included the crypto&#8217;s price trajectory. The world&#8217;s largest crypto has outperformed other asset classes in terms of price performance this year. Data shows Bitcoin is currently up more than 125% this year, and many analysts think this growth isn&#8217;t stopping soon. For comparison, the S&#38;P 500 returned 21% this year. 2023 was a great year for crypto. But we see even brighter things ahead. In this must-read report, the Bitwise research team lays out ten bold predictions for 2024. https://t.co/d8Pa4NkzJU — Bitwise (@BitwiseInvest) December 13, 2023 In its first prediction, Bitwise predicted Bitcoin would trade above $80,000 in 2024, setting a new all-time high. A major catalyst for this growth is the highly anticipated launch of spot Bitcoin ETFs in the US. A spot ETF would allow mainstream investors to gain direct exposure to the coin through traditional investment companies.  Bitcoin has mostly reacted positively to various news surrounding spot ETFs this year. The launch is poised to be the most successful ETF launch, with many analysts estimating that a spot ETF could push Bitcoin over $100,000 in its first year. Bitcoin slightly above the $42K level today. Chart: TradingView.com The other potential catalyst is the next bitcoin halving, one of the most anticipated events in the crypto industry. The next Bitcoin halving is set for April 2024, reducing mining rewards from its current 6.25 BTC to 3.175 BTC per block. According to Bitwise, at the current price of Bitcoin, the next halving will lead to a $6.2 billion reduction in new Bitcoins entering the market every year until another halving.  The halving, coupled with the anticipated frenzy after spot Bitcoin ETFs are approved, is expected to significantly tip the balance between supply and demand. We could even see the price of Bitcoin surge as the halving approaches, as investors buy in hoping to get ahead of a price rally. Other Predictions By Bitwise Related Reading: Why BONK Keeps On Rising, Price Explodes 124% Today – Here’s The Scoop Other predictions in the Bitwise report paint a picture of a prosperous year for the crypto industry in 2024, mainstream acceptance, and increased institutional interest. A particular bullish prediction is the growth of stablecoins, with Bitwise estimating more payments in stablecoins than Visa. Other predictions include JP Morgan, the world&#8217;s largest bank, launching a tokenized fund using blockchain technology, Ethereum&#8217;s annual revenue doubling as transactions increase, and crypto becoming the native currency of the internet. Featured image from Shutterstock"
  }
]