[
  {
    "source": "CoinDesk",
    "date": "2023-07-19T13:00:00.000Z",
    "title": "Blockchain Capital Leads $40M Round for Crypto Firm RISC Zero",
    "url": "https://www.coindesk.com/business/2023/07/19/blockchain-capital-leads-40m-round-for-crypto-firm-risc-zero/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The startup creates developer tooling that helps build zero-proof software for improved security and computational power."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-19T13:01:02.000Z",
    "title": "ZK Virtual Machine Developer RISC Zero Raises $40M in Series A",
    "url": "https://decrypt.co/149121/zk-virtual-machine-developer-risc-zero-raises-40m-in-series-a",
    "description": "Thanks to the new funding, the Seattle-based startup is getting closer to the launch of its computing platform."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-19T12:59:02.000Z",
    "title": "P0x Labs Raises $25 Million for Zero-Knowledge Ecosystem Manta Network",
    "url": "https://decrypt.co/149128/zero-knowledge-ecosystem-manta-network-raises-25-million-from-polychain-qiming",
    "description": "The funding round for p0x labs — which has delivered a valuation of $500 million — was led by Polychain Capital and Qiming Venture Partners."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-19T13:01:00.000Z",
    "title": "Russian CBDC by 2025? What’s happening with the digital ruble ",
    "url": "https://cointelegraph.com/news/russian-cbdc-by-2025-what-s-happening-with-the-digital-ruble",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/6158499c-eff0-433d-9df3-4e98ddd1f835.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>2025–2027 might still seem far away, but the Central Bank of Russia is preparing its CBDC for mass adoption by then. </p>\n                    <p><p>The Central Bank of the Russian Federation’s (CBR) central bank digital currency (CBDC) project has been developing rapidly. The first news about the initiative appeared in 2020, and a regulatory bill was introduced in 2022, which has now <a href=\"https://cointelegraph.com/news/digital-rouble-russian-parliament-passes-a-digital-rouble-bill\">passed through its final reading</a> in the parliament’s lower chamber, the Duma.</p><p>However, the final rollout of the “digital ruble” among the general public will not happen until 2025–2027, as CBR First Deputy Governor Olga Skorobogatova recently <a href=\"https://digital.gov.ru/ru/events/45564/\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a>.</p><p>The timeline still looks optimistic in the global context. According to a recent PwC report, <a href=\"https://cointelegraph.com/news/research-there-could-be-24-cbdcs-live-by-2030\">only about 24 CBDCs</a> may be live by 2030. But for a country actively seeking ways to trade internationally under heavy financial sanctions, such timing may feel relatively slow. </p><h2>Ups and downs of the digital ruble</h2><p>In 2017, the CBR announced its interest in exploring the idea of a digital currency. At the time, Skorobogatova emphasized that developing a CBDC was a priority and that the CBR would investigate soon. However, the bank’s governor, Elvira Nabiullina, didn’t <a href=\"https://cointelegraph.com/news/cryptoruble-how-stable-could-russian-national-stablecoin-be\">consider it a top priority</a> and regarded it as something to be explored in the medium to long term.</p><p>In 2022, the CBR revealed it planned to introduce the digital ruble <a href=\"https://cointelegraph.com/news/russia-plans-to-roll-out-digital-ruble-across-all-banks-in-2024\">across all banks</a> in the country by 2024. It explained that the implementation would be done in stages and involve extensive testing and infrastructure development. According to the central bank, the digital ruble would coexist with traditional cash and non-cash payment systems, giving consumers more flexibility in their transactions.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/b39cc04c-251f-415f-af7e-562670b53c18.jpeg\"  /><figcaption style=\"text-align: center;\"><em>CBR governor Elvira Nabiullina in an interview. Source: MarketWatch.</em></figcaption></figure><p>In February 2023, Skorobogatova made a public announcement regarding the <a href=\"https://cointelegraph.com/news/russia-to-roll-out-cbdc-pilot-with-real-consumers-in-april\">first consumer pilot</a> of the digital ruble, scheduled to commence on April 1, 2023. The trial would include the participation of 13 local banks, numerous merchants and real consumers.</p><p>That same month, Gazprombank, a banking subsidiary of state-owned energy corporation Gazprom and one of the pilot’s participants, publicly proposed <a href=\"https://cointelegraph.com/news/russia-s-gazprombank-recommends-slow-cbdc-rollout-fearing-loss-of-income\">giving banks more time</a> before implementing the CBDC.</p><p>Indeed, the bank’s concerns were understandable, as one report from auditing firm McKinsey estimates that Russian banks could <a href=\"https://www.rbc.ru/crypto/news/63d958e59a7947a09ac6d71c\" target=\"_blank\" rel=\"noopener nofollow\">lose</a> $3.5 billion in commissions and fees in five years to a CBDC.</p><p>The <a href=\"https://cointelegraph.com/news/russia-delays-digital-ruble-launch-testing-due-to-lawmaking-process\">pilot’s launch was eventually delayed</a> along with the passage of the digital ruble bill in the Duma. </p><p>The amended bill establishes key legal definitions such as “platform,” “participants” and “users,” while also outlining general guidelines for the CBDC ecosystem. </p><p>Under the current framework, the CBR assumes the role of the primary operator for the digital ruble infrastructure and holds the responsibility for safeguarding all the stored assets. </p><p>As the primary objective of the CBDC is to serve as a payment and transfer method, users of the digital ruble will not have the option to open savings accounts. Individual customers will enjoy free payments and transfers, while corporate clients will incur a fee of 0.3% of the payment amount.</p><h2>Waiting for 2025?</h2><p>On July 6, CBR’s Skorobogatova said every citizen would be able to open the wallet, receive digital rubles and use them “on the horizon of 2025–27.” </p><p>Skorobogatova specified that a lot depends on banks and their readiness to adopt the necessary infrastructure, as private banks would facilitate digital ruble transactions within their standard apps, with the whole process of the central bank’s mediation more or less invisible to the final customer. Skorobogatova emphasized, “The digital ruble is not a cryptocurrency or a stablecoin, where there’s often no emitter or you don’t know one.” </p><p>Aleksandr Podobnykh, head of the Saint Petersburg branch of the Association of Chief Information Security Officers — a cybersecurity consulting firm involved in CBDC legislation — believes the 2025–2027 deadline is realistic and that test infrastructure is ready to pilot the digital ruble:</p><blockquote>“Now about 30 legal entities are involved in testing — these are banks, retail and individual entrepreneurs. Until 2027, up to 1,500 subjects (including individuals) will take part. Upon completion of the testing, recommendations for scaling will be developed.” </blockquote><p>Podobnykh also mentioned the upcoming updates to Federal Law 115, regulating Anti-Money Laundering and Counter-Terrorist Financing procedures. The proposed amendments would take into account new forms of exchange to help financial monitoring agencies analyze CBDC transactions.</p><p>Elena Klyuchareva, senior associate at Russian law firm KKMP, also sees no anomalies in the 2025–2027 deadline.</p><p>“The delay in digital ruble implementation may be connected mainly to technical aspects,” she told Cointelegraph. “The infrastructure envisaged by the CBR concept is complicated and shall facilitate not only online but also offline transactions and ensure a high level of cybersecurity.” And, Klyuchareva added, such infrastructure will be based mainly on domestic software solutions due to international sanctions:</p><blockquote>“According to prior comments of the CBR, they do not want to intentionally speed up the process but wish to ensure that the digital ruble platform functions properly and is safe and secure.”</blockquote><p>The decision to postpone the implementation of the Russian digital currency shouldn’t be seen as a failure of the project, but as an attempt to develop a stable, well-balanced solution, Klyuchareva concluded. </p><p>Given that only four CBDCs are currently in circulation, Russia will probably be among the first adopters — even if the digital ruble doesn’t launch until 2027.</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-19T13:00:00.000Z",
    "title": "CoinMarketCap’s H1 2023 report says Q2 was a 'lost quarter'",
    "url": "https://cointelegraph.com/news/coinmarketcap-s-h1-2023-report-says-q2-was-a-lost-quarter",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/4c0fc465-f4c9-48ba-9e7c-e38ef791d59b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sectors like virtual reality and augmented reality soared 704% in year-to-date (YTD) growth while artificial intelligence and big data showed YTD expansion of 323%.  </p>\n                    <p><p>Crypto data aggregator CoinMarketCap has released its Crypto Market Analysis report for the first half of the year. Within the report, the coin information website described the second quarter of 2023 as a “lost quarter” as a result of several factors, including the lack of a strong market narrative compared to the first quarter of the year. A few areas, however, experienced strong growth and resilience, the report notes.</p><p>According to the report, Q1 <a href=\"https://coinmarketcap.com/alexandria/article/according-to-cmc-crypto-market-analysis-h1-2023\" target=\"_blank\" rel=\"noopener nofollow\">showed</a> more positive developments such as Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) doubling in price and the rise of layer-2 solutions such as Arbitrum and ZK. In addition, the first quarter of 2023 also showed a strong <a href=\"https://cointelegraph.com/learn/nonfungible-tokens-how-to-get-started-using-nfts\">nonfungible token (NFT)</a> market that was driven by product updates and the issuance of NFT marketplace Blur’s token. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/84a6778d-7d5c-4534-96c0-95d1db78a3e0.png\"  /><figcaption style=\"text-align: center;\"><em>Top 5 active sectors in the first half of 2023. Source: CoinMarketCap</em></figcaption></figure><p>The data aggregator also noted that the second quarter “failed to produce” groundbreaking developments. Notwithstanding trends that showed Q2 to be a memecoin season and the popularity of the new BRC-20 token standard, CoinMarketCap argued that Q2 simply did not generate the level of excitement that the first quarter showed. </p><p>Despite this, the data company said some positive events did occur during the the second quarter. This includes the Crypto Fear and Greed Index, a metric that aims to illustrate an overall crypto market sentiment, showing a score of 52 which is considered “neutral.” This result is much better compared to its score of 32 at the start of the year, which indicated “fear.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-dominance-in-q2-2023-bled-altcoins-coingecko\"><strong><em>Altcoins ‘bled’ as Bitcoin gained dominance in Q2: CoinGecko</em></strong></a></p><p>Even though the market was very challenging, CoinMarketCap also noted that specific sectors showed resilience and growth in their year-to-date (YTD) market capitalizations. These include virtual reality and augmented reality showing a 704% growth, and artificial intelligence and big data showing a 323% growth. </p><p>Meanwhile, <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> projects and infrastructure have also started to make a comeback. According to the data, lending and borrowing increased by 149%, derivatives increased by 75%, storage increased by 86% and interoperability increased by 58%. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/coinmarketcap-s-h1-2023-report-says-q2-was-a-lost-quarter&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\"><strong><em>Should you ‘orange pill’ children? The case for Bitcoin kids books</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-19T13:00:00.000Z",
    "title": "Manta Network Developer Raises $25M in Series A, launches layer 2 for ZK apps",
    "url": "https://cointelegraph.com/news/manta-network-developer-raises-25m-in-series-a-launches-layer-2-for-zk-apps",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/c72a542e-39d5-41ae-ba41-00372865566e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The raised funds will be utilized to expand the network, attract more users and explore diverse use cases for Manta Pacific.</p>\n                    <p><p>P0x Labs, the cryptographic development team behind Manta Network, has announced that it raised $25 million in a Series A funding round, with leading contributions from Polychain Capital and Qiming Venture Partners in a company statement. This funding has resulted in a valuation of $500 million for the company.</p><p>Additionally, Manta Network has introduced the testnet of its Layer 2 infrastructure, Manta Pacific, within its comprehensive ecosystem for<a href=\"https://cointelegraph.com/explained/zero-knowledge-proofs-explained\"> zero-knowledge (ZK) applications</a>, according to a company statement. The raised funds will be utilized to expand the network, attract more users and explore diverse use cases for Manta Pacific.</p><p>In an interview with Cointelegraph, Kenny Li, the CEO of Mantra Network, highlighted the primary goal of Manta Pacific, which is to streamline the development of features and applications, ensuring user-friendliness. Li said that while ZK has garnered attention as a valuable proposition, it primarily serves as a feature set that facilitates various use cases for applications.</p><p>However, the challenge arises from the fact that developers specializing in decentralized app development may lack expertise in <a href=\"https://cointelegraph.com/tags/cryptography\">cryptography </a>or prefer to avoid a steep learning curve. In Li's words:</p><blockquote>\"The hurdle is overcome by Manta Pacific's ZK application layer which utilizes pre-compiled circuits, which can be seamlessly integrated into applications with minimal code.\"</blockquote><p>According to Li, implementing ZK applications for patient data is an ultimate goal, which includes achieving self-sovereignty and ownership of one's medical information.  However, Li said this goal is still years away due to the challenges associated with accessing and aggregating fragmented data from hospitals, which are not motivated to manage it effectively or adopt blockchain technology shortly.</p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/ethereum-benefits-from-zkevm-competition\"><strong>Healthy competition welcome — Polygon </strong><strong><em>zk</em></strong><strong>EVM lead</strong></a></p><p>According to Li, Manta Network identified a use case in finance where staked tokens are issued to users based on their holdings on platforms like Binance. He stated that privacy concerns arise when users are reluctant to verify their identity due to the exposure of their entire wallet. </p><p>To address this, Li mentioned that a privacy layer through ZK-enhanced staked tokens was introduced, similar to the <a href=\"https://cointelegraph.com/news/first-binance-soulbound-token-bab-targets-kyc-user-credentials\">Binance account-bound token</a>, resulting in approximately 58,000 verified user mints. This enhances the usability of staked tokens for identity purposes while prioritizing user privacy.</p><p>Manta Pacific’s testnet currently features various zkApps for users to start accessing including zkHoldEm, a fully on-chain and private Texas Hold’em game; zkMe, a protocol for private and verified credentials; and zkPass, a privacy-preserving protocol for data verification. </p><p>Manta Atlantic’s flagship NPO platform launched earlier this year in April 2023 and has since minted over 300,000 zero-knowledge <a href=\"https://cointelegraph.com/news/what-are-soulbound-tokens-sbts-and-how-do-they-work\">soulbond tokens</a> (zkSBTs) across key ecosystem partners including Arbitrum, Galxe, Linea and CyberConnect. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/soulbound-cryptocurrency-tokens-social-credit-system-spark-next-bull-run/\"><strong><em>Soulbound Tokens: Social credit system or spark for global adoption?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-19T12:47:30.000Z",
    "title": "Unlocking the Power of $LEASH in the Shiba Inu Ecosystem",
    "url": "https://www.cryptoglobe.com/latest/2023/07/unlocking-the-power-of-leash-in-the-shiba-inu-ecosystem/",
    "description": "In the Shiba Inu community, a recent announcement has sparked a wave of excitement. Lucie, a key figure in Shiba Inu’s marketing team, has brought to light some crucial information for those who hold the Doge Killer ($LEASH) token. The Shiba Inu cryptocurrency project, rooted in the popular Shiba Inu dog meme, presents itself as […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T12:58:52.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.126, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 0.71% increase. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T12:55:13.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the series of delisting fuelled by the ongoing United States SEC crackdown on major crypto platforms. Basically, it&#8217;s crypto winter in the summer as it stands. How do Cardano Price Prediction analysts steer in this turbulent crypto weather? ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T12:55:04.000Z",
    "title": "Marc Andreessen Warns Against Catastrophic Mistake in AI Regulation",
    "url": "https://www.cryptopolitan.com/marc-andreessen-warns-against-ai-regulation/",
    "description": "Prominent venture capitalist Marc Andreessen has weighed in on the ongoing debate surrounding AI regulation, emphasizing the potentially catastrophic consequences of repeating the mistakes made in the proliferation of nuclear power. Speaking at the University of Austin&#8217;s 2023 Forbidden Courses program, Andreessen highlighted the dangers of applying the same regulatory approach used for nuclear technology ... <a title=\"Marc Andreessen Warns Against Catastrophic Mistake in AI Regulation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/marc-andreessen-warns-against-ai-regulation/\" aria-label=\"More on Marc Andreessen Warns Against Catastrophic Mistake in AI Regulation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T12:52:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T13:00:36.000Z",
    "title": "Litecoin Whales Purchase $59 Million Worth of LTC As Halving Event Approaches",
    "url": "https://www.newsbtc.com/analysis/ltc/litecoin-whales-purchase-59-million-worth-of-ltc-as-halving-event-approaches/",
    "description": "In the latest development today, Litecoin whales appear to be accumulating huge amounts of LTC, which could be quite positive for the network, especially as its halving event approaches. In a tweet shared yesterday, July 18, by a crypto analyst with the Twitter handle @ali_charts, he confirmed this trend using data from on-chain analytics firm Santiment.  According to @ali_charts, Litecoin whales holding 100,000-1,000,000 LTC  have acquired over 590,000 LTC, worth $59 million, in the last two days.  #Litecoin whales have bought over 590,000 $LTC in the last 48 hours, worth around $59 million! pic.twitter.com/RtHpuzSkFt &#8212; Ali (@ali_charts) July 18, 2023 LTC Price Shows No Reaction To Whale Movement As earlier stated, these recent whale transactions spell a positive undertone for the Litecoin network, as it indicates growing confidence in the LTC asset. However, it is worth noting that LTC’s market price has shown minimal reaction to this massive buying spree. Related Reading: Litecoin Whales Deposit Big To Exchanges, Bearish Sign? For context, LTC is up by only 1.44% in the last day, according to data from CoinMarketCap. Meanwhile, the token is down by 4.37% on the weekly chart and is marked as one of the top weekly losers.  LTC’s price movement has been quite bearish since the start of July. The “Digital Silver” &#8211; as it is called &#8211; ended last month on a high note, gaining over 26% on June 30 to trade above $100 for the first time since April. This positive price movement was followed by some little extra gains before LTC’s value started falling, declining by over 17% between July 3 and now. At the time of writing, LTC is exchanging hands at $92.98, with a 0.27% gain in the last hour.  Meanwhile, the token’s trading volume is down 17.08% and is now valued at $482 million. With a market cap of $6.82 billion, LTC ranks as the 12th biggest cryptocurrency in the market. LTC Trading At $93.08 On The 4-Hour Chart &#124; Source: LTCUSD Chart On Tradingview.com More Positives For Litecoin As Investors Anticipate Halving Event Asides from the recent whale activity, the Litecoin network has also recorded other positive news that indicates a growing level of adoption. On July 15, the network reached a historic milestone, having processed over 170 million transactions since its inception, with over 10 million transactions added in the last 7 weeks. Furthermore, on July 18, the blockchain announced that LTC ranked as the leading crypto for payment on the BitPay platform. According to a chart shared by BitPay, LTC accounted for 34.9% of all crypto payments on its platform in June. Related Reading: Litecoin Becomes 10th-Largest Cryptocurrency, But Is There Still Room To Run? That said, Litecoin’s recent growth in engagement is likely driven by its upcoming halving event, which is scheduled for August 2, 2023.  Litecoin’s halving represents a programmed blockchain event in which mining rewards are reduced by half. It serves as a deflationary tool that helps maintain the scarcity of LTC in circulation, thereby increasing demand, which could potentially drive up the token’s price.  The halving event occurs every four years, with the first two being in 2015 and 2019. Currently, LTC mining rewards stand at 12.5 LTC and will reduce to 6.25 LTC post-halving.  Featured Image From CMC Markets, Chart From Tradingview."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-19T13:01:23.000Z",
    "title": "Esports Outfit Moxy Launched Three Key Products on July 15 for Esport Game Lovers",
    "url": "https://www.crypto-news-flash.com/esports-outfit-moxy-launched-three-key-products-on-july-15-for-esport-game-lovers/?utm_source=rss&utm_medium=rss&utm_campaign=esports-outfit-moxy-launched-three-key-products-on-july-15-for-esport-game-lovers",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/rocket-launch-67723_1920-48x32.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Esports platform MOXY triple launched its token, its platform and a influencer-based competition. The gaming outfit seeks to build on its impressive start as a Web3.0 e-sport pioneer. In a bid to solidify and push its innovation to a whole new pedestal, Moxy.io has launched three key products including its native token sale, Battle of [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-19T12:48:47.000Z",
    "title": "Why Has Fantom’s TVL Decreased So Much? – Part 2",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-has-fantoms-tvl-decreased-so-much-part-2/",
    "description": "<p>This is the second part of the article. You can read the first part here. Let&#8217;s continue explaining with Fantom&#8217;s TVL had such an important turnover. Reaction from Fantom Andre Cronje, the co-founder of Fantom, said Multichain’s recent debacle was a “big blow” to the smart contract platform. He lamented that assurances of decentralization, geolocation [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-has-fantoms-tvl-decreased-so-much-part-2/\">Why Has Fantom’s TVL Decreased So Much? – Part 2</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]