[
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T09:39:57.000Z",
    "title": "Casa launches multi-signature Ethereum self-custody vault",
    "url": "https://cointelegraph.com/news/casa-launches-multi-signature-ethereum-self-custody-vault",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/4ce69648-e2fb-47cd-9f2b-0f054d63916f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Casa has added Etheruem support to its self-custody storage solutions, providing multi-signature security for BTC and ETH.</p>\n                    <p><p>Since its inception in 2016, Casa promoted multi-signature self-custody of BTC in the industry with its flagship Bitcoin vault allowing users to store the cryptocurrency using up to five keys for more distributed security.</p><p>Casa's service originally catered to Bitcoin 'whales' that were willing to spend $10,000 a year on custody, before opening its service to a broader base of Bitcoin users. The company has now added an Ethereum vault to its platform, with ETH holders also able to use up to five keys to secure their holdings. </p><p>According to Casa CEO Nick Neuman, the fact that Bitcoin and Ethereum operate as completely different protocols, the industry had not yet built a security solution that accommodates both on the same platform aside from various hardware wallet models.</p><p>The firm is also engaging with users over the potential of adding self-custody support for various ETH-related assets including nonfungible tokens (NFTs), stablecoins and ERC-20 tokens.</p><p>As <a href=\"https://cointelegraph.com/news/ethereum-users-are-increasingly-demanding-self-custody-casa-cto\">previously reported</a> by Cointelegraph, Casa co-founder and chief technical officer Jameson Lopp highlighted increasing calls for a multi-signature ETH self-custody from its users and the wider cryptocurrency community. </p><p>Driven by a number of high profile collapses of major exchanges like FTX, Casa <a href=\"https://blog.keys.casa/announcing-ethereum-private-key-management/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> its intent to launch ETH storage solution given that many users not only lost access to ETH but their Ethereum-based stablecoins and other ERC tokens.</p><p><a href=\"https://cointelegraph.com/news/ledger-ceo-says-crypto-key-recovery-service-makes-self-custody-easier\"><strong><em>Related: Ledger CEO says crypto key recovery service makes self-custody easier</em></strong></a></p><p>Hackers wrought havoc <a href=\"https://cointelegraph.com/news/defi-exploits-and-access-control-hacks-cost-crypto-investors-billions-in-2022-report\">within the web3 space in 2022</a>, with billions of dollars stolen through decentralized finance bridge hacks and smart contract exploits. It’s a point that Neuman highlighted when Casa announced its plans for ETH storage on its platform, with a multitude of hacks across the ‘web3/crypto space due to poor private key management.’</p><p>Cryptocurrency self-custody platform Casa has rolled out support for Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) storage, touting its support for multi-signature Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and ETH self-storage as a first in the industry.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-self-custody-advocate-explains-why-on-ramps-are-key-to-adoption\">In an interview</a> with Cointelegraph journalist Joe Hall, Lopp stressed the importance of making self-custody solutions more accessible and easier to use to give users full control of their assets and peace of mind managing the associated responsibilities.</p><p>Industry experts have<a href=\"https://cointelegraph.com/news/self-custody-bitcoin-amount-unmeasurable-santiment-exec\"> also suggested</a> that its difficult to estimate the amount of BTC currently held in self-custody wallets.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ordinals-turned-bitcoin-into-a-worse-version-of-ethereum-can-we-fix-it/\">Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T10:02:34.000Z",
    "title": "XDC Price Prediction 2023-2032: Is XinFin a Good Investment?",
    "url": "https://www.cryptopolitan.com/xdc-price-prediction/",
    "description": "XDC Price Prediction 2023- 2032 Have you heard it said, &#8220;Not every utility is as resistant as $XDC. You can&#8217;t compare XDC to others.&#8221; The XDC token is the underlying utility token of the XinFin hybrid blockchain. XinFin, an EVM-compatible, Proof-of-Stake powered smart contract blockchain, is one of the platforms leading the charge on high-efficiency ... <a title=\"XDC Price Prediction 2023-2032: Is XinFin a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xdc-price-prediction/\" aria-label=\"More on XDC Price Prediction 2023-2032: Is XinFin a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T10:02:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. Crypto prices have fallen and the entire crypto market cap has dropped by 18% since April 18, 2023. What does the future hold for Binance Coin? ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-23T10:07:06.000Z",
    "title": "CFTC charges New York Man for defrauding users, including crypto holders, of over $21 million",
    "url": "https://crypto.news/cftc-charges-new-york-man-for-defrauding-users-including-crypto-holders-of-over-21-million/",
    "description": "CFTC is charging a NY resident, for defrauding around 100 users, including crypto asset holders, of more than $21 million"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-23T09:59:19.000Z",
    "title": "Trust Wallet Token and Tradecurve coins surge over 20% in 7 days, SHIB is green",
    "url": "https://crypto.news/trust-wallet-token-tradecurve-surge-shib-is-green/",
    "description": "Trust Wallet Token, Tradecurve, and SHIB are edging higher with TCRV rising 20% in the past few trading days. Tradecurve presale is ongoing"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T10:00:48.000Z",
    "title": "Crypto Passive Income With Caged Beasts’ Can Earn You $100 A Day In BNB And Eclipse Shiba Inu And Dogecoin",
    "url": "https://www.crypto-news-flash.com/crypto-passive-income-with-caged-beasts-can-earn-you-100-a-day-in-bnb-and-eclipse-shiba-inu-and-dogecoin/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-passive-income-with-caged-beasts-can-earn-you-100-a-day-in-bnb-and-eclipse-shiba-inu-and-dogecoin",
    "description": "A key ingredient to being successful in cryptocurrency is understanding how to make crypto passive income work for you. For a lot of people, this has often involved staking, but the meme coin Caged Beasts (BEASTS) has unsheathed an innovative referral programme feature that could help it grow its platform, grow an individual’s earnings, and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T09:57:06.000Z",
    "title": "BlackRock and Financial Giants See Profit Potential: Spot Bitcoin ETFs Spark Interest Amidst Crypto Volatility",
    "url": "https://www.crypto-news-flash.com/blackrock-and-financial-giants-see-profit-potential-spot-bitcoin-etfs-spark-interest-amidst-crypto-volatility/?utm_source=rss&utm_medium=rss&utm_campaign=blackrock-and-financial-giants-see-profit-potential-spot-bitcoin-etfs-spark-interest-amidst-crypto-volatility",
    "description": "BlackRock (BLK) recently submitted an application for a bitcoin exchange-traded fund (ETF).  Since Tuesday, when U.S. markets resumed trading after an extended holiday weekend, BTC has experienced a growth of over 12%. Financial institutions are showing renewed interest in cryptocurrencies and eagerly entering the market. BlackRock (BLK) recently submitted an application for a bitcoin exchange-traded [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-23T09:53:57.000Z",
    "title": "Unmarshal Releases AI-Powered Chatbot to Help Navigate Web3",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/unmarshal-releases-ai-powered-chatbot-to-help-navigate-web3/",
    "description": "<p>Leading Web3 data network, Unmarshal, has launched a new AI-powered chatbot. It&#8217;s called Unmarshal Sakhi. This product will redefine how people engage with the blockchain. This AI tool was created with the best possible user experience in mind with a smooth and user-friendly interface. Let&#8217;s see more about Unmarshal Sakhi. What is Unmarshal Sakhi? Unmarshal [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/unmarshal-releases-ai-powered-chatbot-to-help-navigate-web3/\">Unmarshal Releases AI-Powered Chatbot to Help Navigate Web3</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]