[
  {
    "source": "CoinDesk",
    "date": "2023-07-21T18:15:41.000Z",
    "title": "DeFi Project Parrot Puts Fate of Over $70M Treasury, PRT Token, to Vote",
    "url": "https://www.coindesk.com/markets/2023/07/21/defi-project-parrot-puts-fate-of-over-70m-treasury-prt-token-to-vote/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Polly wants a bailout?"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-21T18:32:46.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting the Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>The alleged money launderers in the massive 2016 Bitfinex hack have taken a plea deal with United States prosecutors. Indonesia has launched its national cryptocurrency exchange, which will be the only space in the country where the legal exchange of digital assets is allowed. Meanwhile, the team in charge of FTX has sued Sam Bankman-Fried and other former executives to try to claw back more than $1 billion. </p><h2>Bitfinex hackers take plea deal with US prosecutors</h2><p>Ilya Lichtenstein and Heather Morgan, the couple who allegedly laundered billions of dollars worth of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) following the 2016 Bitfinex hack, have <a href=\"https://cointelegraph.com/news/couple-bitfinex-money-laundering-scheme-reach-plea-deal-prosecutors\">reached a plea deal</a> with United States prosecutors. </p><p>Records filed with the District Court in Columbia on July 21 revealed that the couple is scheduled to appear for an arraignment and hearing on Aug. 3. Although the details of the plea deal weren’t disclosed, the couple was charged with money laundering conspiracy and conspiracy to defraud the United States — charges that could have landed each a maximum 25-year prison sentence. </p><p>Bitfinex was hacked in 2016 for 119,854 BTC — worth roughly $3.6 billion today — and most of it was laundered by Lichtenstein and Morgan “in a series of small, complex transactions across multiple accounts and platforms.” When the couple was arrested, the laundered BTC was the largest financial seizure by the Justice Department. </p><h3>Indonesia launches its crypto exchange and clearing house</h3><p>The national cryptocurrency exchange announced by the Indonesian government a week ago has begun to function, according to a statement from the country’s Commodity Futures Trading Supervisory Agency, known as Bappebti. The platform will be the only space in the country where the legal exchange of digital assets is allowed. </p><p>Bappebti confirmed the opening of the exchange on July 20. In addition, the agency has established a futures clearing house along with the exchange. A clearing house mediates between a buyer and seller, ensuring the transaction goes smoothly.</p><p>Previously it was reported that Bappebti would restrict cryptocurrency sales to local transactions while keeping them in line with international market developments. Licensed traders will have one month to join the exchange.</p><p>The project has been in the works since at least December 2021. In September 2022, Pang Hue Kai, CEO of Tokokrypto — one of 25 licensed crypto exchanges in Indonesia, partly owned by Binance — called the project “a catalyst for the Indonesian crypto ecosystem.”</p><p>The launch, planned for the end of 2022, was delayed to June 2023 due to the process of reviewing potential participants of the exchange. At the time, the country’s Trade Minister Zulkifli Hasan announced that all active crypto exchanges with a national registration could join the exchange.</p><p>In 2022, the deputy minister of Indonesia’s Ministry of Trade, Jerry Sambuaga, suggested several policy changes in response to the “interesting year for the development of physical trading of crypto assets”. Among them was a requirement for two-thirds of directors and commissioners at crypto firms to be Indonesian citizens.</p><p>The country remains an attractive market for the crypto industry, according to Bappebti data. In 2021, roughly 4% of the country’s population or just under 11 million people, had invested in crypto.</p><h3>FTX sues SBF and other former execs to recoup over $1B </h3><p>The restructuring team in charge of the bankrupt FTX has <a href=\"https://cointelegraph.com/news/ftx-sues-sam-bankman-fried-other-execs-recoup-one-billion\">sued former executives</a> from the crypto exchange and its sister trading firm Alameda Research to recover over $1 billion in allegedly misappropriated funds.</p><p>In a July 20 court filing former Alameda Research CEO Caroline Ellison, former FTX engineering director Nishad Singh and FTX co-founders Sam Bankman-Fried and Zixiao “Gary” Wang were named as defendants. </p><p>The 84-page complaint claimed the group misappropriated customer funds to buy luxury condominiums, donate to political or charitable causes and fund \"speculative investments and other pet projects.”</p><p>The former executives issued more than $725 million worth of equity to themselves and Bankman-Fried and Wang used $546 million in alleged misappropriated funds to purchase a stake in <a href=\"https://cointelegraph.com/explained/what-is-robinhood-and-how-does-it-work\">Robinhood</a>, FTX claimed.</p><p>The alleged fraudulent transfers happened when FTX was insolvent — which the group was aware of, the complaint assets. Bankman-Fried allegedly directed a modification to the exchange’s code to allow Alameda's account to carry a negative balance.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T18:33:51.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T18:32:58.000Z",
    "title": "Algeria officially asks to be a part of the BRICS",
    "url": "https://www.cryptopolitan.com/algeria-asks-to-be-a-part-of-the-brics/",
    "description": "Algeria has formally petitioned to be incorporated into the influential BRICS coalition, comprising Brazil, Russia, India, China, and South Africa. The move, confirmed by Algerian President Abdelmadjid Tebboune, is a strategic effort to foster new economic opportunities and diversify Algeria&#8217;s economy, traditionally reliant on its rich oil and gas resources. Seeking greater economic opportunities President ... <a title=\"Algeria officially asks to be a part of the BRICS\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algeria-asks-to-be-a-part-of-the-brics/\" aria-label=\"More on Algeria officially asks to be a part of the BRICS\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T18:24:37.000Z",
    "title": "French central bank explores wholesale CBDC models to enhance cross-border payments: Details",
    "url": "https://www.cryptopolitan.com/french-central-bank-explores-wholesale-cbdc-models/",
    "description": "In a significant move towards digital currency innovation, the Banque de France has published its second paper on wholesale Central Bank Digital Currency (CBDC), following a series of experiments. The French central bank has identified two primary use cases for an interbank CBDC: securities settlement on Distributed Ledger Technology (DLT) systems and cross-border payments. Three ... <a title=\"French central bank explores wholesale CBDC models to enhance cross-border payments: Details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/french-central-bank-explores-wholesale-cbdc-models/\" aria-label=\"More on French central bank explores wholesale CBDC models to enhance cross-border payments: Details\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T18:22:40.000Z",
    "title": "Crypto venture capital funding plummets amid market uncertainty",
    "url": "https://www.cryptopolitan.com/crypto-vc-funding-plummets-uncertainty/",
    "description": "Venture capital funding within the cryptocurrency sphere is undergoing a significant downturn as market ambiguities intensify. June witnessed a sharp fall of almost 30%, securing only $779.32 million across 62 distinct deals, according to Cointelegraph Research Venture Capital Database. This decline correlates with a larger context of global economic ambiguity, featuring uncertainties such as geopolitical ... <a title=\"Crypto venture capital funding plummets amid market uncertainty\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-vc-funding-plummets-uncertainty/\" aria-label=\"More on Crypto venture capital funding plummets amid market uncertainty\">Read more</a>"
  }
]