[
  {
    "source": "Cointelegraph",
    "date": "2023-12-13T13:00:00.000Z",
    "title": " 40% of crypto game devs are banking on trad gaming in 2024 ",
    "url": "https://cointelegraph.com/news/crypto-game-developers-web2-gaming-studio-adoption-2024",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYzA0MjZmYTItYmU4Mi00YWRhLWFlMDItZTg2MmI4NDc4OTg3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>More than a third of survey respondents believed the blockchain gaming industry benefited most from traditional game studios adopting Web3 tech in 2023.</p>\n                    <p><p data-ct-non-breakable=\"true\">Nearly 40% of blockchain game developers believe that traditional gaming studios will be one of the biggest positive driving forces for the Web3 gaming sector in 2024. </p><p>In its “2023 State of the Industry Report,” released on Dec. 12, the Blockchain Gaming Alliance (BGA) <a href=\"https://www.blockchaingamealliance.org/bga-2023-industry-report/\" target=\"_blank\" rel=\"noopener nofollow\">found</a> that 37.8% of respondents believed Web2 studios launching new <a href=\"https://cointelegraph.com/explained/what-are-web3-games-how-do-they-work\" >games in Web3</a> or applying blockchain elements to existing titles would help push the industry forward in 2024. </p><p>When asked to identify the biggest positive driver in 2023, 19.8% of respondents cited traditional game studios launching nonfungible token games, while 15.2% pointed to the same studios transitioning into Web3.</p><p><a href=\"https://cointelegraph.com/news/crypto-game-developers-web2-gaming-studio-adoption-2024\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-13T12:50:08.000Z",
    "title": " Microsoft in pact with U.S. labor organization to foster worker-focused AI development ",
    "url": "https://cointelegraph.com/news/microsoft-pact-us-labor-organization-foster-worker-focused-ai-development",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMjhjOTViOGUtMWRlZi00Mzg3LWJjMzgtODI1OGYwZDk4NmUxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The partnership will prioritize workers’ rights and incorporate input from labor leaders in technology development.</p>\n                    <p><p>Tech giant Microsoft and the American Federation of Labor and Congress of Industrial Organizations (AFL-CIO) have announced a new partnership to discuss how artificial intelligence (AI) can anticipate the needs of workers and include their voices in its development and implementation. </p><p>According to the AFL-CIO, the agreement’s goals <a href=\"https://aflcio.org/press/releases/afl-cio-and-microsoft-announce-new-tech-labor-partnership-ai-and-future-workforce\" target=\"_blank\" rel=\"noopener nofollow\">include</a> information sharing among labor leaders and workers on AI trends, incorporating worker perspectives and expertise in the development of AI, and helping shape public policy that supports the technology skills and needs of frontline workers.</p><p>Microsoft president Brad Smith said the agreement involves a collaborative effort with labor leaders to ensure AI benefits workers. AFL-CIO President Liz Shuler sees Microsoft’s neutrality framework and acknowledgment of workers’ expertise as a signal that the AI era can foster productive labor-management partnerships.</p><p><a href=\"https://cointelegraph.com/news/microsoft-pact-us-labor-organization-foster-worker-focused-ai-development\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-13T12:44:51.000Z",
    "title": " Crypto hacking losses plunge by nearly 50% in 2023 – Research ",
    "url": "https://cointelegraph.com/news/crypto-hacking-losses-plunge-nearly-50-2023-research",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYjUxMDU0MzAtMDA2Yy00ZWJjLWIzMTQtZjcxNmRiNjFlZDAyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Blockchain intelligence firm TRM Labs credits this decline to several critical factors, including enhanced security measures, law enforcement and industry coordination.</p>\n                    <p><p>Blockchain intelligence firm TRM Labs says losses from cryptocurrency hacking in 2023 have dropped by more than 50% compared with 2022, and credits the decline to improvements in industry security.</p><p>TRM Labs' report published on Dec. 13 cites its research into the key factors behind the significant drop in cyber theft. It reveals that losses from hacking in crypto projects fell to about $1.7 billion in 2023, less than half the $4 billion stolen from internet protocols in 2022.</p><p>The report recorded 160 hacking attempts, while losses have <a href=\"https://www.trmlabs.com/post/hack-hauls-halve-from-2022\" target=\"_blank\" rel=\"noopener nofollow\">decreased</a> by over 50%. TRM Labs said the decline is due to enhanced security measures, which have seen the cryptocurrency industry has incorporated real-time transaction monitoring and anomaly detection systems. These advancements strengthen digital wallets and exchange platforms, establishing strong defenses against possible breaches.</p><p><a href=\"https://cointelegraph.com/news/crypto-hacking-losses-plunge-nearly-50-2023-research\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-13T12:49:19.000Z",
    "title": "KuCoin to leave New York pays $22 million settlement",
    "url": "https://cryptobriefing.com/kucoin-to-leave-new-york-pays-22-million-settlement/?utm_source=feed&utm_medium=rss",
    "description": "KuCoin's settlement with New York Attorney sends a strong message to the crypto industry about the importance of regulatory compliance."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-13T12:59:52.000Z",
    "title": "Get Rewarded: Winz.io Introduces WinzUp Loyalty Program",
    "url": "https://cryptodaily.co.uk/2023/12/get-rewarded-winzio-introduces-winzup-loyalty-program",
    "description": "Winz.io Redefines Player Rewards with the Launch of WinzUp Loyalty Program"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T13:03:27.000Z",
    "title": "Unlocking Leadership Success: The Power of Temporal Decision-Making",
    "url": "https://www.cryptopolitan.com/leadership-success-the-power-of-decision/",
    "description": "In the ever-evolving landscape of leadership, executives and decision-makers are faced with a crucial choice – to invest in cutting-edge technology or tread cautiously with traditional approaches. This decision presents a complex strategic dilemma akin to the choice of adopting an electric car for a household. While integrating the latest technology into business operations offers [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T13:00:09.000Z",
    "title": "PDP Guitar Controllers May Support Fortnite",
    "url": "https://www.cryptopolitan.com/pdp-guitar-controllers-may-support-fortnite/",
    "description": "Peripheral Dynamics Plus (PDP), a renowned manufacturer in the gaming accessory market, has recently announced its plans to reintroduce its PDP guitar controllers for music games. This move comes as a response to the growing demand in the gaming community and the inflated prices in the secondary market following PDP&#8217;s cessation of production years ago. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T12:46:12.000Z",
    "title": "AI’s Impact on Coders and Software Developers: Augmentation, Not Replacement",
    "url": "https://www.cryptopolitan.com/ais-impact-on-coders-and-software-developers/",
    "description": "The rise of artificial intelligence (AI) has prompted discussions and concerns about its potential to replace jobs, including those of coders and software developers. However, a closer examination reveals that AI is not here to replace programmers but to empower them. AI&#8217;s integration into software development: A current reality Contrary to the notion that AI [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-13T12:45:09.000Z",
    "title": "OKX DEX Loses Over $400,000 To Hackers – What Happens To Customer Funds?",
    "url": "https://www.newsbtc.com/news/okx-dex-loses-over-400000-to-hackers-what-happens-to-customer-funds/",
    "description": "According to blockchain security company SlowMist, OKX DEX, a decentralized exchange aggregator platform, lost cryptocurrency valued at over $400,000. An attacker was able to transfer tokens that users had not allowed by compromising the management privileges of a market maker contract, according to the explanation for the vulnerability. On the OKX DEX aggregator platform, a deprecated proxy contract was the subject of a recent vulnerability that allowed a hacker to obtain administration access to the contract without authorization. Related Reading: Immutable Momentum: IMX Rockets To $2.21, Scaling Heights Unseen Since 2022 OKX DEX: Deprecated Contract Raises Concerns When a protocol stops actively using a contract to carry out user transactions, it is considered deprecated. It appears that OKX has updated the contract but hasn&#8217;t entirely stopped using it. 🚨SlowMist Security Alert: OKX DEX Proxy Admin Owner&#8217;s Private Key Suspected to be Leaked🚨 According to information from SlowMist Zone, the OKX DEX contract appears to have encountered an issue. After SlowMist&#8217;s analysis, it was found that when users exchange, they authorize… — SlowMist (@SlowMist_Team) December 13, 2023 The claimTokens function of the OKX DEX smart contract experienced a problem, according to blockchain security firm SlowMist. The TokenApprove contract, which required user authorization, invokes the ability to send cash to a trustworthy DEX Proxy. On December 12, the SlowMist team reported that the OKX DEX Proxy Admin Owner upgraded the DEX Proxy contract with a new implementation. The purpose of this new implementation was to invoke the claimTokens function straight from the DEX contract. Total crypto market cap at $1.51 trillion on the daily chart: TradingView.com The exchange said that 18 of the approved addresses for the contract had been compromised, and linked the event to the management rights of a cancelled OKX DEX market maker contract being compromised. Additionally, the exchange pledged to pay back all impacted users. It would also carry out a comprehensive security examination in order to stop something similar from happening again. We regret to inform you that a deprecated smart contract on OKX Dex has been compromised. We have taken immediate action to secure all user funds and revoke the contract permissions. We are working with relevant agencies to locate the stolen funds and will reimburse affected… pic.twitter.com/zDIjhb3ETz — OKX Web3 (Wallet &#124; DeFi &#124; NFT) (@okxweb3) December 13, 2023 OKX Hack: Actual Damages Unknown According to PeckShield, another researcher specializing in blockchain security, this vulnerability has cost over $2.76 million. In the last 30 days, OKX DEX is thought to have had over 50,000 active user wallets; however, it is unknown how many users were impacted by the most recent hack. Related Reading: Injective (INJ) Trains Guns On $30 After Hitting An All-Time High Of $27 – Details Users should employ caution while communicating with DeFi protocols, especially those supported by well-known firms in the industry, as highlighted by the OKX DEX breach. Featured image from Shutterstock"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-13T12:50:56.000Z",
    "title": "Serenity Shield Provides a Way to Pass Your Crypto Inheritance",
    "url": "https://www.altcoinbuzz.io/spotlight/serenity-shield-provides-a-way-to-pass-your-crypto-inheritance/",
    "description": "<p>The emergence of multiple projects is one of the signs that we are entering a bull run. Projects building during the bear market see the bull market as the best time to get more engagement and customers for their services. However, not all new, emerging projects have sustainable value. Some are simply overhyped projects. One [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/spotlight/serenity-shield-provides-a-way-to-pass-your-crypto-inheritance/\">Serenity Shield Provides a Way to Pass Your Crypto Inheritance</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-13T12:44:00.000Z",
    "title": "XRP Would Be a Top Performer in the Next Bull Cycle: Ben Armstrong",
    "url": "https://coinedition.com/xrp-would-be-a-top-performer-in-the-next-bull-cycle-ben-armstrong/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Internal-XRP-analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Internal - XRP analysis\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Internal-XRP-analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Internal-XRP-analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Internal-XRP-analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Internal-XRP-analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Internal-XRP-analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Internal-XRP-analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Ben Armstrong, a renowned cryptocurrency influencer, believes XRP would be among the top performers in the next bull cycle, considering the token’s properties, the power of its community, and its tendency to attract developers and investors. The blockchain analyst started by debunking rumors that XRP is centralized. Citing the XRPL, the community-based blockchain protocol behind [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xrp-would-be-a-top-performer-in-the-next-bull-cycle-ben-armstrong/\">XRP Would Be a Top Performer in the Next Bull Cycle: Ben Armstrong</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-13T12:45:28.000Z",
    "title": "Second Wave of the Bear Market About To Begin, Says Analyst Who Nailed 2022 Crypto Collapse – Here’s His Outlook",
    "url": "https://dailyhodl.com/2023/12/13/second-wave-of-the-bear-market-about-to-begin-says-analyst-who-nailed-2022-crypto-collapse-heres-his-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/Wave-of-the-Bear.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/Wave-of-the-Bear.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/12/Wave-of-the-Bear.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/Wave-of-the-Bear.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/Wave-of-the-Bear.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/Wave-of-the-Bear.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/12/Wave-of-the-Bear.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An analyst who has remained bearish on the crypto after accurately calling the 2022 collapse thinks the markets are set to see much lower prices. Pseudonymous analyst Capo tells his 81,200 Telegram subscribers that he believes Bitcoin (BTC) and the rest of the crypto markets are about to witness to resumption of the bear market. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/13/second-wave-of-the-bear-market-about-to-begin-says-analyst-who-nailed-2022-crypto-collapse-heres-his-outlook/\">Second Wave of the Bear Market About To Begin, Says Analyst Who Nailed 2022 Crypto Collapse – Here&#8217;s His Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]