[
  {
    "source": "Decrypt",
    "date": "2024-01-03T20:47:01.000Z",
    "title": "Fidelity Bitcoin ETF Set to Trade on CBOE—But No Word From SEC",
    "url": "https://decrypt.co/211702/fidelity-bitcoin-etf-set-to-trade-on-cboe-but-no-word-from-sec",
    "description": "The Fidelity Wise Origin Bitcoin Trust got the ok to trade on the CBOE under the FBTC ticker, but there's still no word from the SEC."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-03T21:07:05.000Z",
    "title": " Cboe approves registration for listing Fidelity spot Bitcoin ETF — no SEC approval yet ",
    "url": "https://cointelegraph.com/news/cboe-registration-fidelity-spot-bitcoin-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMTZjZGVhNjAtNzU3Zi00ZDA5LThiM2ItNjc5NWQyZmRlMzcyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Fidelity Wise Origin Bitcoin Fund filed Form 8-A to report approval of registering its shares as securities on the Cboe BZX Exchange.</p>\n                    <p><p>The United States-based exchange Cboe accepted the registration for listing shares of a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund proposed by Fidelity Investments. </p><p>In a Jan. 3 filing with the U.S. Securities and Exchange Commission (SEC), the Fidelity Wise Origin Bitcoin Fund <a href=\"https://www.sec.gov/Archives/edgar/data/1852317/000119312524001377/d582196d8a12b.htm\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it intended to register its shares as securities listed on the Cboe BZX Exchange. The Form 8-A filing, while part of the process of registering an ETF with the SEC, did not necessarily suggest the commission would approve the investment vehicle.</p><p>“My understanding here is that this is just a securities registration,” <a href=\"https://twitter.com/JSeyff/status/1742640909873770534\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Bloomberg ETF analyst James Seyffart on X (formerly Twitter). “In order to list the ETF still needs a 19b-4 approval and they need an effective/approved/completed S-1 document. No 19b-4 yet [...] I’m still looking towards next week.”</p><p><a href=\"https://cointelegraph.com/news/cboe-registration-fidelity-spot-bitcoin-etf\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-03T20:45:00.000Z",
    "title": " VC roundup: blockchain storage, rollups, and Bitcoin rewards draw investors  ",
    "url": "https://cointelegraph.com/news/vc-roundup-blockchain-storage-rollups-bitcoin-rewards-investors",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNmVkOTg1NjgtOWQyMS00NGVmLThlYjktYTI4MDhlN2Y0ZmM1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Lolli, NodeKit, and Cumulus Encrypted Storage System are among the latest startups to receive venture capital funding. </p>\n                    <p><p data-ct-non-breakable=\"true\">The crypto fundraising space keeps showing consistent and gradual recovery, with millions injected into startups’ rounds of all sizes in December. Among the month’s highlights, venture capital firm Foresight Ventures <a href=\"https://cointelegraph.com/news/foresight-ventures-launches-third-10-million-crypto-accelerator-following-the-block-deal\">disclosed a third $10 million</a> accelerator dedicated to companies exploring artificial intelligence, Bitcoin Ordinals and direct-to-consumer protocols, while Hong Kong-based GBA Capital also <a href=\"https://cointelegraph.com/news/chinese-web3-vc-launch-10-billion-accelerator-fund-report\">pledged $10 billion</a> to establish a Web3 fund.</p><p data-ct-non-breakable=\"true\">In Asia's biggest blockchain series funding round, South Korean nonfungible token (NFT) developer Line Next <a href=\"https://cointelegraph.com/magazine/asian-crypto-firm-raises-140m-ai-market-china-sinohope-huobi-asia-express/\">raised $140 million from a consortium</a> spearheaded by Crescendo Equity Partners, a private equity firm backed by Peter Thiel.</p><p data-ct-non-breakable=\"true\"><a href=\"https://messari.io/report/q4-fundraising-brief\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to data from Messari, there was an impressive 81% surge in the total deal volume in the last quarter of 2023, reaching $3.83 billion. Among the key investment rounds over the past three months were Blockaid securing $33 million, Ritual raising $25 million, Drift with a $23.5 million round, Blast at $20 million, and Privy closing a deal at $18 million.</p><p><a href=\"https://cointelegraph.com/news/vc-roundup-blockchain-storage-rollups-bitcoin-rewards-investors\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-03T20:40:32.000Z",
    "title": " Crypto traders remain bullish on Celestia (TIA) even after 480% rally — Here&#039;s why  ",
    "url": "https://cointelegraph.com/news/crypto-traders-remain-bullish-on-celestia-tia-even-after-480-rally-here-s-why",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNTdjNWE5ZjAtYzI3ZS00N2E2LTg0MTktMDJkM2QxYTNlNzJmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>TIA price defied the typical trajectory of airdropped tokens by rallying 480%. Cointelegraph explores why traders remain bullish on Celestia. </p>\n                    <p><p>Modular blockchain Celestia has posted amazing growth since its launch on Oct. 31, 2023, when TIA tokens were airdropped to 580,000 users and the mainnet went live. Since launching, TIA has risen more than 460% from its debut price of $2.10 to the current value of $13.</p><p>The altcoin had a slow start in terms of on-chain activity, initially facilitating only 510,000 transactions in the first two days, according to data from MintScan.</p><p>However, as traders' appetite grew, TIA price followed and ultimately, <a href=\"https://cointelegraph.com/learn/on-chain-volume-vs-trading-volume-differences-explained\">on-chain activity</a> grew as well. MintScan data shows that the network has so far facilitated 6,649,287 transactions since its debut on Oct. 31, 2023.</p><p><a href=\"https://cointelegraph.com/news/crypto-traders-remain-bullish-on-celestia-tia-even-after-480-rally-here-s-why\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-03T21:00:43.000Z",
    "title": "BlackRock and Grayscale could add Goldman Sachs as authorized ETF participant",
    "url": "https://cryptoslate.com/blackrock-and-grayscale-could-add-goldman-sachs-as-authorized-etf-participant/",
    "description": "<p>Two leading spot Bitcoin exchange-trade fund (ETF) applicants could add Goldman Sachs in a key role, CoinDesk reported on Jan. 3. The crypto news site said that Grayscale and BlackRock could both add Goldman Sachs as an authorized participant. That role would see Goldman Sachs create and redeem shares for each spot Bitcoin ETF based [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/blackrock-and-grayscale-could-add-goldman-sachs-as-authorized-etf-participant/\">BlackRock and Grayscale could add Goldman Sachs as authorized ETF participant</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T21:03:35.000Z",
    "title": "Crypto.com adds SHIB/CORGIAI pair for enhanced trading options",
    "url": "https://www.cryptopolitan.com/cryptocom-adds-shib-corgiai/",
    "description": "Crypto.com has announced the addition of a new trading pair, SHIB/CORGIAI, to its platform. This strategic expansion is part of the exchange&#8217;s efforts to capture a larger market share amidst the resurging trading volume of Shiba Inu (SHIB) and other meme coins. Trading flexibility boosted with SHIB/CORGIAI on Crypto.com Crypto.com users who trade Shiba Inu [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-03T21:00:07.000Z",
    "title": "Crypto Pundit Says Cardano Rivals XRP Community, But Why Is ADA Price Struggling?",
    "url": "https://www.newsbtc.com/news/cardano/cardano-rivals-xrp-community/",
    "description": "Cardano has consistently remained one of the largest cryptocurrencies in the industry with the price of its native ADA coin following the crypto market rally. However, it has not performed as well as other cryptocurrencies despite its marked popularity among investors. Given this, crypto pundit Ben Armstrong, popularly known as BitBoy, has shared his views on why the network is struggling. Cardano Struggles Through Misinformation One of the problems that the crypto analyst mentioned that Cardano has run into over the years is the fact that there has been misinformation. A lot of times, Cardano has been subject to FUD (Fear, Uncertainty, and Doubt) especially when it comes to its decentralized finance (DeFi) capabilities. Related Reading: Top 5 Events That Shook Up The Crypto Industry In 2023 The network is really playing catch-up when it comes to DeFi as the likes of Ethereum and Solana enabled this ability years before Cardano. However, the network has seen significant growth since it first announced smart contract capabilities back in 2021. Armstrong explains that a lot of FUD have also been directed at the founder Charles Hoskinson whose involvement with Ethereum as one of the co-founders in the early days is often called into question. But contrary to popular belief, the analyst believes that Hoskinson’s involvement with Ethereum actually helps to boost the credibility of the Cardano network. Hoskinson has also been subject to allegations of being a scammer, as well as the Cardano network being “finished,” among other interesting allegations, as well as its native ADA token being referred to as a stablecoin. The last part takes a jab at the fact that the ADA price has not moved much in the last year. However, Armstrong explains that Cardano boasts one of the most decentralized token distributions in the entire crypto industry. “Currently, over 60% of the supply is staked and during the bull market, the number was well over 70% on a regular basis,” he stated. This makes the coin an attractive choice for investors. ADA price at $0.61 &#124; Source: ADAUSD on Tradingview.com ADA Community Similar To XRP Community Armstrong has been vocal about his support for the XRP community which he believes is the strongest community in crypto. Then coming up behind the XRP community, the crypto analyst believes that the Cardano community is the second-strongest in the industry. Related Reading: Dogecoin Is Bullish? Crypto Analyst Gives Reasons Why Investors Should Pay Attention In addition to this, Armstrong calls ADA “one of the most consistent performing coins in the history of crypto.” ADA, on its own, has managed to perform incredibly well in each bull market since its inception. During the 2020-2021 bull market, the ADA price would go from around $0.02 to over $3 before correcting back downward. Presently, the ADA price is trending at $0.61, rising approximately 143% in the last year alone. With a market cap of $21.7 billion, it is currently the eighth-largest cryptocurrency by market cap. Featured image from Crypto News, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-03T21:00:00.000Z",
    "title": "2024 Could Be Wild Run for Bitcoin (BTC) and Crypto if History Is Any Indication: Analyst Jason Pizzino",
    "url": "https://dailyhodl.com/2024/01/03/2024-could-be-wild-run-for-bitcoin-btc-and-crypto-if-history-is-any-indication-analyst-jason-pizzino/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/could-be-wild-run.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/could-be-wild-run.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/could-be-wild-run.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/could-be-wild-run.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/could-be-wild-run.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/could-be-wild-run.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/could-be-wild-run.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Popular crypto analyst Jason Pizzino is updating his 2024 outlook for Bitcoin (BTC) and the broader crypto market. In a new YouTube strategy session, Pizzino tells his 303,000 subscribers that the history Bitcoin’s four-year cycles indicates this year could bring sizeable gains. Pizzino notes that 2024 is a US election year, which he says has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/03/2024-could-be-wild-run-for-bitcoin-btc-and-crypto-if-history-is-any-indication-analyst-jason-pizzino/\">2024 Could Be Wild Run for Bitcoin (BTC) and Crypto if History Is Any Indication: Analyst Jason Pizzino</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-03T20:55:46.000Z",
    "title": "‘Gigantic Bubble Cycle’ Could Be in Play for Crypto Markets, According to Ex-Goldman Sachs Executive",
    "url": "https://dailyhodl.com/2024/01/03/gigantic-bubble-cycle-could-be-in-play-for-crypto-markets-according-to-ex-goldman-sachs-executive/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/03/supercycle.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/03/supercycle.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/03/supercycle.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/03/supercycle.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/03/supercycle.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/03/supercycle.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/03/supercycle.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ex-Goldman Sachs executive Raoul Pal says that a massive bubble cycle could be on the horizon for crypto markets. In a new interview with crypto influencer Scott Melker, the macro guru and Real Vision chief executive says that while he believes the current market cycle is probably a normal one, there’s also a 20% chance [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/03/gigantic-bubble-cycle-could-be-in-play-for-crypto-markets-according-to-ex-goldman-sachs-executive/\">‘Gigantic Bubble Cycle’ Could Be in Play for Crypto Markets, According to Ex-Goldman Sachs Executive</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]