[
  {
    "source": "Cointelegraph",
    "date": "2023-12-13T09:19:42.000Z",
    "title": " Dfinity founder says blockchain can bolster efforts to fight climate change  ",
    "url": "https://cointelegraph.com/news/dfinity-founder-blockchain-recycling-waste-management",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNDNiODAxNDMtN2QyYS00NDIwLTlmZDctNDFhMTRiNWRlNzdjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Dfinity founder and chief scientist Dominic Williams told Cointelegraph that blockchain networks can support the creation of trustless infrastructure that incentivizes climate positive action.</p>\n                    <p><p>Dominic Williams, founder and chief scientist at Dfinity, says blockchain technology and its decentralized and trustless nature, gives it a unique ability to assist in the fight against climate change. </p><p>Williams told Cointelegraph there are three ways in which blockchain can address climate challenges. Blockchain networks can support the creation of trustless infrastructure that offers incentives for climate action, increases efficiency and provides an alternative to traditional information technology, which has a “huge carbon footprint.” </p><p>According to Williams, blockchain networks like the ICP provide trustless infrastructure that eliminates third parties and allows for secure and transparent data verification. “This can be leveraged to ensure proper recycling and handling of waste materials by tracking them from origin to destination,” he added. </p><p><a href=\"https://cointelegraph.com/news/dfinity-founder-blockchain-recycling-waste-management\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-13T09:10:18.000Z",
    "title": " SEC wants Binance guilt admission added to own case ",
    "url": "https://cointelegraph.com/news/sec-wants-binance-guilt-admission-added-to-own-case",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMzcyYTMxNWYtYzc4MS00YmNkLTllMjgtM2YzNDRjZThjNzg4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Binance said the SEC hasn’t demonstrated that the resolutions reached with the DOJ are pertinent to the regulator’s “faulty claims” against Binance Holdings and former CEO Changpeng Zhao.</p>\n                    <p><p>Binance Holdings and its former CEO Changpeng Zhao have reacted to a move by the U.S. Securities and Exchange Commission (SEC). The SEC has filed to include Binance's admission of guilt to the Department of Justice (DOJ) in its own legal proceedings.</p><p>In the filing <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.256060/gov.uscourts.dcd.256060.189.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">submitted</a> to the U.S. District Court for the District of Columbia, Binance insisted the SEC’s attempt to include the $4.3 billion guilty plea and settlement agreement with the DOJ in the continuing case was procedurally incorrect and should not be allowed.</p><p>The ongoing Binance-SEC legal case began on June 5, 2023, when the agency <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">accused the company of 13</a> securities law violations, including that Zhao and Binance managed customer assets on Binance.US and mixed or redirected customer assets, as outlined in the charges.</p><p><a href=\"https://cointelegraph.com/news/sec-wants-binance-guilt-admission-added-to-own-case\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-13T09:33:18.000Z",
    "title": "Goldman Sachs revises rate cut forecast, signaling potential boost for Bitcoin amidst monetary policy shift.",
    "url": "https://cryptoslate.com/goldman-sachs-revises-rate-cut-forecast-signaling-potential-boost-for-bitcoin-amidst-monetary-policy-shift/",
    "description": "<p>Goldman Sachs now anticipates two interest rate cuts by the U.S. Federal Reserve in the upcoming year, revising its initial forecast to include a reduction as early as the third quarter due to subsiding inflation, according to Reuters. This shift in monetary policy could significantly impact Bitcoin, known for its resilience against economic fluctuations. In [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/goldman-sachs-revises-rate-cut-forecast-signaling-potential-boost-for-bitcoin-amidst-monetary-policy-shift/\">Goldman Sachs revises rate cut forecast, signaling potential boost for Bitcoin amidst monetary policy shift.</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-13T09:30:14.000Z",
    "title": "World’s Largest Oil Company Saudi Aramco Partners With SBI Holdings to Potentially Invest in Digital Assets",
    "url": "https://news.bitcoin.com/worlds-largest-oil-company-saudi-aramco-partners-with-sbi-holdings-to-potentially-invest-in-digital-assets/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/22d4a4f5-c7e5-4e78-a1cc-8ad0a1b65758-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"World Largest Oil Company Saudi Aramco Partners With SBI Holdings to Potentially Invest in Digital Assets\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/22d4a4f5-c7e5-4e78-a1cc-8ad0a1b65758-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/22d4a4f5-c7e5-4e78-a1cc-8ad0a1b65758-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/22d4a4f5-c7e5-4e78-a1cc-8ad0a1b65758-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/22d4a4f5-c7e5-4e78-a1cc-8ad0a1b65758-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/22d4a4f5-c7e5-4e78-a1cc-8ad0a1b65758-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/22d4a4f5-c7e5-4e78-a1cc-8ad0a1b65758-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/22d4a4f5-c7e5-4e78-a1cc-8ad0a1b65758.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Saudi Aramco, the largest oil and gas company by market cap, has partnered with SBI Holdings, a financial services group in Japan, to explore a potential collaboration for investing in digital assets. SBI also contemplates the launch of a subsidiary in the Middle East to expand its influence in the region. Oil Colossus Saudi Aramco [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T09:22:49.000Z",
    "title": "Snapchat+ Introduces AI-Powered Image Enhancement and Generation Features",
    "url": "https://www.cryptopolitan.com/snapchat-ai-powered-image-enhancement/",
    "description": "Snapchat+, the popular social media app, has unveiled a series of innovative AI-powered features for its subscribers. With this latest update, Snapchat+ users can now effortlessly enhance and generate images using the power of Artificial Intelligence (AI). These additions to the app&#8217;s &#8220;My AI&#8221; suite aim to provide users with more practical and creative tools [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-13T09:36:48.000Z",
    "title": "Considering Solana? Experts Recommend These Cryptos Too: AVAX, LINK, and a Rising Star",
    "url": "https://nulltx.com/considering-solana-experts-recommend-these-cryptos-too-avax-link-and-a-rising-star/",
    "description": "TLDR Solana (SOL) shines in Q4, 2023, with a 200% profit surge, driven by a 60% monthly rise. A noteworthy event on December 5 saw a whale moving two million SOL to Binance, hinting at a potential cash-out post-rally. Avalanche (AVAX) stages a remarkable comeback, with over 76.6% of wallets [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-13T09:34:18.000Z",
    "title": "Analyst Psyclops Forecasts Cardano To Rise 1,591% to $10, Everlodge Price Up 170%",
    "url": "https://nulltx.com/analyst-psyclops-forecasts-cardano-to-rise-1591-to-10-everlodge-price-up-170/",
    "description": "Crypto analyst Psyclops has predicted that the value of Cardano is ready to increase to the $10 milestone. Meanwhile, a new coin,  Everlodge, has risen with attractive features for crypto and real estate enthusiasts. Read on to learn more about this project. Cardano (ADA) Ready To Hit $10 In a [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-13T09:23:23.000Z",
    "title": "Former BitMEX CEO to head euro stablecoin issue",
    "url": "https://crypto.news/former-bitmex-ceo-to-head-euro-stablecoin-issue/",
    "description": "The former head of the BitMEX cryptocurrency exchange, Alexander Höptner, will head a new company to issue a stablecoin pegged to the euro. The European Union&#8217;s new regime for crypto assets, which includes rules for stablecoins, offers a clearer path&#8230;"
  }
]