[
  {
    "source": "CoinDesk",
    "date": "2023-10-10T16:50:43.000Z",
    "title": "Israeli Crypto Firms Scramble to Deal With War, in Between the Sirens",
    "url": "https://www.coindesk.com/tech/2023/10/10/israeli-crypto-firms-scramble-to-deal-with-war-in-between-the-sirens/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Few operational disruptions were reported, but some crypto employees were getting called up for reserve duty. Executives and developers coped with the stress of attending funerals, responding to security warnings and encountering supermarket shortages."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-10T16:46:27.000Z",
    "title": "LIVE: Caroline Ellison, Ex-Alameda CEO and SBF's Ex, Takes the Stand ",
    "url": "https://www.coindesk.com/policy/2023/10/10/live-caroline-ellison-ex-alameda-ceo-and-sbfs-ex-takes-the-stand/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Caroline Ellison, the former CEO of crypto hedge fund Alameda Research, is the government's star witness in its prosecution of alleged crypto fraudster Sam Bankman-Fried."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-10T17:01:03.000Z",
    "title": "Ethereum DeFi Exchange AirSwap Rolls Out NFT Marketplace",
    "url": "https://decrypt.co/200764/ethereum-defi-exchange-airswap-rolls-out-nft-marketplace",
    "description": "The DEX is marking its sixth anniversary with upgrades across its peer-to-peer crypto platform."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-10T16:54:26.000Z",
    "title": "Caroline Ellison blames Sam Bankman-Fried for misuse of FTX user funds at trial",
    "url": "https://cointelegraph.com/news/caroline-ellison-testifies-sam-bankman-fried-trial",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/4c136d4e-3bcc-4d50-b728-9fbe1e8e2b33.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Reports have suggested the former CEO of Alameda Research and SBF had largely been out of contact following the collapse of FTX in November 2022.</p>\n                    <p><p>Former FTX CEO Sam “SBF” Bankman-Fried watched from the defense table as his former business associate and girlfriend Caroline Ellison testified at his criminal trial.</p><p>According to reports from the courtroom on Oct. 10, Ellison <a href=\"https://twitter.com/innercitypress/status/1711783159031853093\" target=\"_blank\" rel=\"noopener nofollow\">admitted</a> to fraud during her time at Alameda at Bankman-Fried’s direction. The former Alameda CEO reportedly placed the blame for misuse of FTX user funds directly on SBF, claiming he “set up the systems” leading to Alameda taking roughly $14 billion from the exchange.</p><p>“Alameda took several billions of dollars from FTX customers and used it for investments,” said Ellison according to reports. “I sent balance sheets that made Alameda look less risky than it was.”</p><p>Ellison met Bankman-Fried through their jobs at Jane Street Capital, with SBF convincing her to leave the investment firm and join his crypto-focused endeavors. Reports have suggested the two had largely been out of contact following the collapse of FTX in November 2022. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Sam Bankman-Fried included this photo with Caroline Ellison in a document he sent me, noting that she “was wicked smart,” but “deeply insecure.” CAROLINE TESTIFIES AGAINST SBF IN COURT THIS WEEK. <a href=\"https://t.co/n9WXyBXfd1\">pic.twitter.com/n9WXyBXfd1</a></p>&mdash; Tiffany Fong (@TiffanyFong_) <a href=\"https://twitter.com/TiffanyFong_/status/1711574134855983109?ref_src=twsrc%5Etfw\">October 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ellison’s relationship with SBF is one of the issues central to the allegations facing the former CEO, as he was in charge of the crypto exchange while she led the team at Alameda. Bankman-Fried’s fraud charges are based on him directing Alameda to essentially have access to FTX user funds without customers’ consent, which he used for purchases including property and donations to political campaigns. </p><p>FTX co-founder and former chief technology officer Gary Wang took the stand starting on Oct. 5 as one of the first witnesses for prosecutors, <a href=\"https://cointelegraph.com/news/alameda-research-withdraw-unlimited-funds-gary-wang\">claiming he committed crimes</a> with Ellison as well as former engineering director Nishad Singh. On cross examination of Wang, SBF’s attorneys seemed to be attempting to shift some of the blame on the exchange’s collapse to Ellison, questioning the former CTO on her role and in their opening arguments claiming she ignored Bankman-Fried’s request to put a hedge on Alameda investments.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sbf-lawyers-to-probe-ftx-lawyers-involvement-in-alameda-loans\"><strong><em>SBF seeks to probe FTX lawyers’ roles in $200M Alameda loans</em></strong></a></p><p>Ellison and Wang were some of the first FTX and Alameda <a href=\"https://cointelegraph.com/news/caroline-ellison-gary-wang-plead-guilty-to-fraud-charges\">insiders to plead guilty</a> as part of an agreement with U.S. authorities for her testimony. It’s unclear whether Bankman-Fried will take the stand as part of his defense strategy.</p><p>The former Alameda Research CEO’s testimony <a href=\"https://cointelegraph.com/news/sbf-trial-alameda-ceo-caroline-ellison-sam-bankman-fried\">marked the fifth day</a> of SBF’s criminal trial, where he faces 7 charges related to fraud. He has pleaded not guilty to all charges, and is expected to appear in a second criminal trial starting in March 2024.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-10T17:07:51.000Z",
    "title": "Ethereum Gas Price Hits All-Time Low",
    "url": "https://cryptobriefing.com/ethereum-gas-price-hits-all-time-low/?utm_source=feed&utm_medium=rss",
    "description": "Ethereum gas fees hit all-time lows as network usage sank 20% and layer two TVL doubled over the past year."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-10T16:59:49.000Z",
    "title": "Inactive Bitcoin Wallet Springs to Life After Six Years, Transfers Over 2,995 Bitcoins Worth Around $82 Million",
    "url": "https://www.cryptoglobe.com/latest/2023/10/inactive-bitcoin-wallet-springs-to-life-after-six-years-transfers-over-2995-bitcoins-worth-around-82-million/",
    "description": "A Bitcoin wallet that had been inactive for close to six years recently sprang into action, transferring a staggering 2,995 BTC, valued at around $82.3 million, to two newly established addresses. According to blockchain data, the wallet initially received 3,200 BTC on 7 May 2016 when Bitcoin’s spot price was just $459, making the assets […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-10T16:49:06.000Z",
    "title": "Israeli Authorities Freeze Hamas-Linked Cryptocurrency Accounts With Binance’s Help Amid Escalating Conflict",
    "url": "https://www.cryptoglobe.com/latest/2023/10/israeli-authorities-freeze-hamas-linked-cryptocurrency-accounts-with-binances-help-amid-escalating-conflict/",
    "description": "Israeli police have frozen cryptocurrency accounts belonging to Hamas, the Palestinian militant group responsible for a recent multi-pronged attack on the country, which escalated into a full-scale war that is currently ongoing and has claimed the lives of thousands. After the attack, the defense minister of Israel ordered a total blockade of Gaza, the Palestinian […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-10T17:00:29.000Z",
    "title": "Simplex Accelerates VERSE Token and Wider Cryptocurrency Adoption",
    "url": "https://news.bitcoin.com/simplex-accelerates-verse-token-and-wider-cryptocurrency-adoption/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/unnamed-2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/unnamed-2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/unnamed-2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/unnamed-2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/unnamed-2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/unnamed-2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/unnamed-2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/unnamed-2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Since 2016, Simplex&#x2019;s bond with Bitcoin.com has continued strengthening, aimed at streamlining access to cryptocurrencies and increasing adoption globally. As part of Nuvei, a NASDAQ listed company with over 20 years in payments, Simplex combines convenience, reliability and security for Bitcoin.com&#x2019;s global userbase. What makes this long-term collaboration unique and how do users benefit &#x2013; [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-10T17:07:57.000Z",
    "title": "XRP Healthcare to expand in Africa over Coinstore listing",
    "url": "https://crypto.news/xrp-healthcare-to-expand-in-africa-over-coinstore-listing/",
    "description": "XRP Healthcare, a pioneering Web3 Healthcare company, announces its expansion in Africa over Coinstore listing."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-10T17:04:24.000Z",
    "title": "Coinbase Ventures emerges as most active crypto VC firm with 372 deals",
    "url": "https://crypto.news/coinbase-ventures-emerges-as-most-active-crypto-vc-firm-with-372-deals/",
    "description": "CoinGecko, the crypto data aggregator, released a study on Oct. 10 about the most active cryptocurrency firms, in which Coinbase Ventures emerged as number 1."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-10T16:58:29.000Z",
    "title": "Flare integrates Subsquid over open-source data access expansion",
    "url": "https://crypto.news/flare-integrates-subsquid-over-open-source-data-access-expansion/",
    "description": "Dubai-based blockchain platform Flare announced the integration of the blockchain indexing solution network Subsquid. The Flare and Subsquid integration aims to provide better access and usability of blockchain data for Web3 developers. The Flare and Subsquid integration aims to achieve&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-10T16:54:10.000Z",
    "title": "Circle incorporates USDC on Polygon",
    "url": "https://crypto.news/circle-incorporates-usdc-on-polygon/",
    "description": "Circle has initiated the minting of its stablecoin, USDC, directly on Ethereum's layer-2 solution, Polygon, aiming to enhance transaction speed and reduce fees."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-10T16:45:02.000Z",
    "title": "OKX to replace Okcoin brand in comprehensive rebranding effort",
    "url": "https://crypto.news/okx-to-replace-okcoin-brand-in-comprehensive-rebranding-effort/",
    "description": "OK Group COO and OKX President Hong Fang announced that Okcoin will undergo a rebranding to OKX in the coming months."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-10T17:00:07.000Z",
    "title": "Bitcoin Price Could Flip Bullish In November As It Mirrors Previous Cycles, Analyst",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-could-flip-bullish-in-november-as-it-mirrors-previous-cycles-analyst/",
    "description": "Bitcoin analysts eagerly scrutinize the charts as November approaches, hoping to gain insights from past cycles. Historically, November has always been significant for the cryptocurrency market, as BTC usually gains value, affecting other coins.  According to crypto analyst Miles Deutscher, November promises to be a pivotal month for Bitcoin enthusiasts and investors. Related Reading: What’s Behind XRP Price Retreat? Assessing Some Eye-Opening Metrics Bitcoin’s Ongoing Sideways Trend Hints At Potential Bullish Shift In November Market experts suggest that Bitcoin&#8217;s stagnant price movement might transition to a bullish trend in November. According to them, this could occur if it behaves similarly to past cycles before a halving event.  For instance, on October 10, cryptocurrency analyst Miles Deutscher referenced a chart from CryptoCon. In the X post, Miles highlighted the parallels between Bitcoin&#8217;s recent patterns and those observed in earlier cycles. #Bitcoin&#8217;s recent price action is still mirroring the last 2 cycles. This is typical sideways price action that occurs from Q2-Q4 in pre-halving years. November 21st has historically been the key pivot point for a bullish shift. Will be interesting to see how $BTC responds. pic.twitter.com/zP9vlG31Qc — Miles Deutscher (@milesdeutscher) October 10, 2023 He added that around November 21, the price of Bitcoin usually starts going up a lot, getting ready for the next halving event. This date holds significance as a turning point in Bitcoin&#8217;s price trajectory. For instance, in 2015, when Bitcoin’s price was ranging for about six months, it began to go up in November. Similarly, in 2019, the price of Bitcoin didn&#8217;t change much for most of the year, but then it started to increase towards the end of the year. Other Crypto Analyst Predicts Similar Price Projections Another prominent crypto trader and analyst, Mags, noticed something interesting in Bitcoin’s chart. According to the analyst, Bitcoin&#8217;s price is about 60% lower than the highest price it ever reached. This happened around 200 days before its previous halving, just like in 2015 and 2019. The analyst wrote: In 2016, BTC was -65% below its ATH. In 2019, BTC was -60% below its ATH. In 2023, BTC is currently -60% below its ATH. So, even if it seems like Bitcoin&#8217;s price isn&#8217;t moving much, it&#8217;s following a similar pattern to previous cycles. Another crypto analyst, Galaxy Trading, posited a similar prediction for Bitcoin’s price move. The analyst drew attention to 2018-2019 when Bitcoin&#8217;s price hit a significant bottom. He noted that Bitcoin could dump or bottom around Nov 10-15 this year if we see a similar price move. Additionally, lead researcher at Matrixport, Markus Thielen, said that Bitcoin’s price might go up massively by the end of 2024. However, he thinks it will happen for different reasons than what we&#8217;re seeing now. He drew attention to some critical areas in August 2012, December 2015, May 2019, and August 2020. According to him, the bullish market commenced within 12 to 18 months in each case. However, the Bitcoin halving is around six months away and might occur in late April or May, depending on your countdown timer. Related Reading: XRP Price Prediction – A Plunge To $0.45 On The Horizon, Here’s Why The analysis from different observers is signaling a positive outlook for the price of Bitcoin before the next BTC halving. Meanwhile, today, October 10, BTC trades at $27,568, indicating a slight gain in 24 hours with a volume of $12,189,678,605. Featured image from Pixaby and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-10T16:40:45.000Z",
    "title": "BRICS Alliance Grows Stronger: Gazprom Neft Ceases US Dollar Transactions – When Will the Switch to Bitcoin (BTC) Happen?",
    "url": "https://www.crypto-news-flash.com/brics-alliance-grows-stronger-gazprom-neft-ceases-us-dollar-transactions-when-will-the-switch-to-bitcoin-btc-happen/?utm_source=rss&utm_medium=rss&utm_campaign=brics-alliance-grows-stronger-gazprom-neft-ceases-us-dollar-transactions-when-will-the-switch-to-bitcoin-btc-happen",
    "description": "<img width=\"940\" height=\"530\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BRICS\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS.png 940w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS-768x433.png 768w\" sizes=\"(max-width: 940px) 100vw, 940px\" />Gazprom Neft, the largest Russian oil producer and refiner, highlighted that it has successfully ditched the United States dollar for the Russian ruble and Chinese Yuan to enable seamless trade with the BRICS nations and other countries. The Russian vs Ukraine and Israel vs Gaza wars have seen the crude oil prices spike by more [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-10T17:01:00.000Z",
    "title": "Altcoins May Be Doomed for the Rest of the Year, Here’s Why",
    "url": "https://coinedition.com/altcoins-may-be-doomed-for-the-rest-of-the-year-heres-why/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/10/11.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/11.png 730w, https://coinedition.com/wp-content/uploads/2023/10/11-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/10/11-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/10/11-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/10/11-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/10/11-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/10/11-313x175.png 313w, https://coinedition.com/wp-content/uploads/2023/10/11-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/10/11-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/10/11-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/10/11-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/10/11-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/10/11-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/10/11-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/10/11-129x73.png 129w, https://coinedition.com/wp-content/uploads/2023/10/11-355x200.png 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The much-anticipated altcoin season may not happen again as 2023 nears its end. This was the opinion of pseudonymous trader Altstreet Bets. According to him, many altcoins may lose as much as 20% to 30% of their current value before the year runs to a close. No Altcoin Season This Year? For the unaccustomed, an [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/altcoins-may-be-doomed-for-the-rest-of-the-year-heres-why/\">Altcoins May Be Doomed for the Rest of the Year, Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-10T16:55:37.000Z",
    "title": "New Solana (SOL) Update Brings ‘Confidential Transfers’ for Increased User Privacy",
    "url": "https://dailyhodl.com/2023/10/10/new-solana-sol-update-brings-confidential-transfers-for-increased-user-privacy/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/solana-two-biggest-projects.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/solana-two-biggest-projects.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/solana-two-biggest-projects.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/solana-two-biggest-projects.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/solana-two-biggest-projects.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/solana-two-biggest-projects.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/solana-two-biggest-projects.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A new update to Ethereum (ETH) competitor Solana (SOL) has enabled confidential transfers for the project&#8217;s token standard. Solana&#8217;s network of validators was able to reach a supermajority, approving the adoption of Solana&#8217;s v1.16 update after nearly 10 months of development and testing. The update includes the rollout of confidential transfers for SPL tokens, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/10/new-solana-sol-update-brings-confidential-transfers-for-increased-user-privacy/\">New Solana (SOL) Update Brings ‘Confidential Transfers’ for Increased User Privacy</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]