[
  {
    "source": "CoinDesk",
    "date": "2024-03-01T00:48:28.000Z",
    "title": "SEC in ‘Enforcement-Only Mode’ for Crypto, Commissioner Peirce Says at ETHDenver",
    "url": "https://www.coindesk.com/policy/2024/03/01/sec-in-enforcement-only-mode-for-crypto-commissioner-peirce-says-at-ethdenver/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "“What I reflect is the fact that you all are spending part of your brainpower” wondering how to avoid getting sued, she said during a panel at EthDenver."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-01T01:00:12.000Z",
    "title": "Bank of America Merrill Lynch and Wells Fargo Begin Offering Spot Bitcoin ETFs to Clients, Report",
    "url": "https://news.bitcoin.com/bank-of-america-merrill-lynch-and-wells-fargo-begin-offering-spot-bitcoin-etfs-to-clients-report/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/blackrock-bitcoin-etf-record-day1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Blackrock Bitcoin ETF Shatters Inflow and Trading Records — Holdings Exceed 141K BTC\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/blackrock-bitcoin-etf-record-day1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/blackrock-bitcoin-etf-record-day1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/blackrock-bitcoin-etf-record-day1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/blackrock-bitcoin-etf-record-day1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/blackrock-bitcoin-etf-record-day1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/blackrock-bitcoin-etf-record-day1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/blackrock-bitcoin-etf-record-day1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bank of America’s Merrill Lynch and Wells Fargo&#8217;s wealth management arm have reportedly begun offering some clients access to spot bitcoin exchange-traded funds (ETFs). Other investment platforms that offer some clients access to spot bitcoin ETFs include Fidelity, Charles Schwab, Robinhood Markets, and UBS. Major Banks Embrace Bitcoin ETFs Bank of America’s investment arm, Merrill [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-01T00:45:45.000Z",
    "title": "$7.2t asset manager Vanguard continues to shun Bitcoin ETFs as CEO announces retirement",
    "url": "https://www.cryptopolitan.com/vanguard-shun-btc-etfs-ceo-announces-retirement/",
    "description": "Vanguard CEO Tim Buckley is set to retire at the end of the year, the company announced, sparking discussions on whether this might influence the firm&#8217;s cautious stance on cryptocurrency products, including spot Bitcoin ETFs.&#160; Vanguard has distinguished itself from other major U.S. financial institutions by not embracing the recently approved Bitcoin ETFs, a decision [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-01T01:00:34.000Z",
    "title": "JPMorgan Analysts Predict Bitcoin Crash To $42,000 Post-Halving – What You Need To Know",
    "url": "https://www.newsbtc.com/bitcoin-news/jpmorgan-analysts-predict-bitcoin-crash-post-halving/",
    "description": "Bitcoin, the world&#8217;s largest cryptocurrency, faces a potential downturn in its price following the anticipated halving event scheduled for April, according to analysts at JPMorgan led by Nikolaos Panigirtzoglou. This event occurs approximately every four years and is expected to slash miner rewards from 6.25 BTC per block to 3.125 BTC. As a result, JPMorgan analysts have warned that the Bitcoin price could drop toward $42,000 post-halving. Related Reading: Bitwise CEO Says Bitcoin At $250,000 Is Closer Than You Think Reason Behind The Potential Crash To $42,000 The analysts attribute this potential decline to the reduced profitability for miners and the subsequent increase in BTC production costs. The analysts disclosed that the Bitcoin production cost has historically served as a &#8220;lower bound&#8221; for its prices, with the estimated range doubling post-halving to around $53,000. Nonetheless, a potential 20% reduction in the BTC network&#8217;s hashrate looms is primarily attributed to the departure of less efficient mining rigs from the operational landscape. Consequently, this scenario may drive the estimated production cost range to $42,000, calculated under an average electricity cost of $0.05 per kilowatt-hour (kWh). According to the analyst, Bitcoin miners with &#8220;below-average electricity costs&#8221; and &#8220;more efficient equipment&#8221; are expected to fare better following the halving event. In contrast, those with &#8220;higher production costs&#8221; may struggle to remain profitable. Consequently, analysts anticipate an increased concentration within the Bitcoin mining industry, with publicly listed miners likely to hold a higher share. Moreover, there is the prospect of &#8220;horizontal integration&#8221; via &#8220;mergers and acquisitions&#8221; among miners spanning different regions, aiming to leverage &#8220;synergies and minimize&#8221; collective operational expenses. Related Reading: Bitcoin Sees Massive Sell-Off From Miners, As Price Holds Steady Bitcoin Market Sentiments And Potential Surge Meanwhile, as JPMorgan analysts suggest a potential drop in Bitcoin&#8217;s price post-halving, Hunter Horsley, CEO of Bitwise, remains optimistic about Bitcoin&#8217;s long-term outlook. Horsley predicts that the cryptocurrency will surge to $250,000 sooner than anticipated. Bitcoin is going to eat into gold&#8217;s TAM faster than people expect. $250k Bitcoin could happen much sooner than most who&#8217;ve followed the space for years would imagine. Why? For 15 years, Bitcoin proved it&#8217;s merits but was only accessible to some. Bitcoin ETFs were Bitcoin&#8217;s… — Hunter Horsley (@HHorsley) February 28, 2024 Meanwhile, many metrics within the BTC market signal a potential surge for Bitcoin. On-chain data reveals that the Bitcoin MVRV ratio has reached levels reminiscent of the parabolic bull run experienced in 2020, suggesting a forthcoming surge may be imminent. MVRV hit 2.5, indicating a +150% average profit for all #Bitcoin wallets. In Nov 2020, MVRV was 2.5 at $18K, preceding the all-time high and parabolic bull run.https://t.co/cx8nYhNeeI pic.twitter.com/PgRLietkkz — Ki Young Ju (@ki_young_ju) 2 Amid these varying forecasts and market sentiments, BTC trades at $63,391, marking a slight retracement from its recent peak above $64,000 &#8211; the highest level traded in the past two years. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-01T01:00:08.000Z",
    "title": "Man Behind $4,500,000,000 Bitfinex Hack Turns Into Federal Witness in Money Laundering Trial",
    "url": "https://dailyhodl.com/2024/02/29/man-behind-4500000000-bitfinex-hack-turns-into-federal-witness-in-money-laundering-trial/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/Hack-Turns-Into-Federal-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/Hack-Turns-Into-Federal-.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2024/02/Hack-Turns-Into-Federal-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/Hack-Turns-Into-Federal-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/Hack-Turns-Into-Federal-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/Hack-Turns-Into-Federal-.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/02/Hack-Turns-Into-Federal-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The infamous hacker who orchestrated the massive 2016 exploit of the crypto exchange Bitfinex has reportedly turned into a government witness. In 2022, Ilya Lichtenstein and Heather Morgan – known as the &#8220;crypto couple&#8221; – were arrested for conspiring to launder $4.5 billion worth of stolen crypto assets from the Bitfinex hack. They pled guilty [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/29/man-behind-4500000000-bitfinex-hack-turns-into-federal-witness-in-money-laundering-trial/\">Man Behind $4,500,000,000 Bitfinex Hack Turns Into Federal Witness in Money Laundering Trial</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]