[
  {
    "source": "Decrypt",
    "date": "2023-07-17T12:53:40.000Z",
    "title": "Crypto Products See Largest Consecutive Inflows Since 2021",
    "url": "https://decrypt.co/148862/crypto-products-see-largest-consecutive-inflows-since-2021",
    "description": "With institutional investor interest picking up, Bitcoin continues to dominate activity, according to the latest CoinShares report."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-17T12:40:53.000Z",
    "title": "What Is Gnosis? How Decentralized Prediction Markets Work",
    "url": "https://decrypt.co/resources/what-is-gnosis-learn-article",
    "description": "While Gnosis itself serves as an open framework, prediction markets are realized in third-party dApps built on top the Gnosis Chain, such as Azuro, Omen, and Reality Card."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-17T13:05:39.000Z",
    "title": "BitDAO backed Mantle Network launches mainnet at EthCC",
    "url": "https://cryptoslate.com/bitdao-backed-mantle-network-launches-mainnet-at-ethcc/",
    "description": "<p>Mantle Network, the modular Ethereum Layer-2 (L2) blockchain, disclosed the launch of its mainnet at the Ethereum Community Conference (EthCC) in Paris. This announcement comes on the heels of a significant merger with BitDAO, the world&#8217;s largest DAO by treasury value, creating a unified DAO-led web3 ecosystem known as the Mantle Ecosystem. The merger, sanctioned [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitdao-backed-mantle-network-launches-mainnet-at-ethcc/\">BitDAO backed Mantle Network launches mainnet at EthCC</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-17T12:51:26.000Z",
    "title": "Aave Companies Upgrades Web3 Social Media with Lens Protocol V2",
    "url": "https://cryptobriefing.com/aave-companies-upgreades-web3-social-networking/?utm_source=feed&utm_medium=rss",
    "description": "Lens Protocol, a social media platform built on blockchain technology by Aave Companies, has launched v2, its latest update, offering a variety of crypto-centric features and expanding the functionality of..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-17T12:49:40.000Z",
    "title": "NEAR APAC Showcases “Unlimited Future” at Vietnam's Premier Blockchain Conference",
    "url": "https://cryptodaily.co.uk/2023/07/near-apac-showcases-unlimited-future-at-vietnams-premier-blockchain-conference",
    "description": "<p>Ho Chi Minh City, Vietnam, July 17th, 2023, Chainwire</p><p>NEAR APAC, Vietnam's largest blockchain conference, is set to take place on September 9th-10th, 2023, at Thiskyhall Sala Convention Center in Ho Chi Minh City. The event promises to be a global gathering, bringing together leading blockchain experts, developers, students, enterprises, and startups from the Asia-Pacific (APAC) region and beyond.</p><p>Themed \"Unlimited Future,\" NEAR APAC will serve as a platform for exploring the latest advancements in blockchain technology and multi-chain decentralized applications within the APAC region. The conference will offer a diverse range of activities designed to engage and inspire participants beyond traditional panel discussions and keynote presentations.</p><p>Participants can immerse themselves in a virtual reality playground, explore the Web3 Dating zone tailored for startups and venture capitalists, witness cutting-edge technology demonstrations, and partake in thrilling NFT and gaming activities. NEAR APAC aims to provide a dynamic and interactive environment that fosters networking, collaboration, and the exploration of emerging technologies.</p><p>With over 8,000 expected attendees, NEAR APAC is set to attract a wide array of participants, including 100+ global blockchain leaders as speakers, 1,000+ developers, students from 10+ universities, 300+ projects and startups, and representatives from 100+ enterprises. Register now at and secure your place at the forefront of the blockchain revolution.</p><p class=\"ql-align-justify\">The world&rsquo;s leading web3 PR and marketing agency, MarketAcross&mdash;known for their work in the region with companies like Polygon and Hashed Emergent&mdash;will be joining the event as a media partner. This follows multiple web3 events where MarketAcross serves as the official media partner like Korea Blockchain Week, WebX, Paris Blockchain Week and IVS Kyoto.</p><p>The conference offers unique opportunities for each target audience:</p><p>Builders: NEAR APAC will host a Web3 Hackfest, Web3 Code Challenge, and Builder stage, providing developers with a platform to showcase their skills and engage in collaborative coding sessions. The conference will also feature a dedicated hacking area for participants to further explore their ideas. Learn more at https://web3hackfest.org/.</p><p>VCs and Start-ups: The Greenhouse Program at NEAR APAC brings venture capitalists on board as speakers, partners, and judges for the Hackathon. Start-ups can benefit from the guidance and support of experienced investors. Visit https://nearapac.org/the-greenhouse/ for more information.</p><p>Blockchain Community, IT Students, and Start-ups: NEAR APAC hosts the Web2 &amp; Web3 Career Fair in collaboration with TOP CV, Vietnam's largest recruitment platform. This unique opportunity allows start-ups and projects to connect with talented individuals and find suitable candidates for their companies.</p><p>NEAR APAC is further elevating the event experience with additional attractions designed to captivate and engage attendees. A Web2 technology show will feature fascinating displays such as robot beer servers, holograms, and flying motorcycles. A travel game with a substantial prize pool will incentivize participants to explore every booth, maximizing the benefits for booth sponsors. By completing tasks and collecting NFTs, participants will have a chance to share in the $15,000 prize pool. These activities aim to drive user engagement and provide booth sponsors with maximum marketing exposure during the event.</p><p>Register now and secure your place at the forefront of the blockchain revolution.</p><p>About NEAR APAC:</p><p>NEAR APAC is Vietnam's largest blockchain/crypto conference entity, focused on showcasing the latest advancements in blockchain technology and multi-chain decentralized applications within the APAC region. With its \"Unlimited Future\" theme, NEAR APAC aims to foster networking, collaboration, and the exploration of emerging technologies in an interactive environment. For more information, visit https://nearapac.org/.</p><p></p><p></p>ContactNear APACnearapac@near.foundation"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T12:58:00.000Z",
    "title": "Binance announces the integration of the Bitcoin lightning network",
    "url": "https://www.cryptopolitan.com/binance-announces-bitcoin-lightning-network/",
    "description": "In a significant move for the cryptocurrency community, Binance, one of the leading cryptocurrency exchanges, has recently completed the integration of the Bitcoin Lightning Network onto its platform for BTC withdrawals and deposits. This development, confirmed through a blog post on July 17, marks a substantial milestone in enhancing the efficiency and cost-effectiveness of Bitcoin ... <a title=\"Binance announces the integration of the Bitcoin lightning network\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-announces-bitcoin-lightning-network/\" aria-label=\"More on Binance announces the integration of the Bitcoin lightning network\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T12:45:22.000Z",
    "title": "Ethscriptions protocol suffers smart contract exploit",
    "url": "https://www.cryptopolitan.com/ethscriptions-protocol-contract-exploit/",
    "description": "The Ethsubscriptions protocol, a groundbreaking initiative allowing users to create and share digital objects on the Ethereum blockchain, has encountered a significant setback due to a recent hack on its main marketplace. Launched just last month by Tom Lehman, co-founder and former CEO of Genius.com, Ethscriptions is a novel concept that leverages transaction “calldata” to ... <a title=\"Ethscriptions protocol suffers smart contract exploit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethscriptions-protocol-contract-exploit/\" aria-label=\"More on Ethscriptions protocol suffers smart contract exploit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T12:43:42.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T12:41:38.000Z",
    "title": "Dogecoin price goes on a wild ride after Elon Musk’s cryptic tweet",
    "url": "https://www.cryptopolitan.com/dogecoin-price-goes-on-a-wild-ride/",
    "description": "In a surprising turn of events, Dogecoin (DOGE) experienced a sudden and dramatic price surge of 3% within a span of just one minute. The catalyst behind this rapid rise was none other than Elon Musk, the charismatic billionaire and prominent figure behind companies like Tesla, SpaceX, and Twitter. Known for his playful interactions with ... <a title=\"Dogecoin price goes on a wild ride after Elon Musk&#8217;s cryptic tweet\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dogecoin-price-goes-on-a-wild-ride/\" aria-label=\"More on Dogecoin price goes on a wild ride after Elon Musk&#8217;s cryptic tweet\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T13:07:33.000Z",
    "title": "Top Memecoin To Watch in July 2023: Dogecoin (DOGE) and Anarchy (ANA) Expected to Deliver Massive Profit",
    "url": "https://www.crypto-news-flash.com/top-memecoin-to-watch-in-july-2023-dogecoin-doge-and-anarchy-ana-expected-to-deliver-massive-profit/?utm_source=rss&utm_medium=rss&utm_campaign=top-memecoin-to-watch-in-july-2023-dogecoin-doge-and-anarchy-ana-expected-to-deliver-massive-profit",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T160711.171.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T160711.171.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T160711.171-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T160711.171-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Meme coins are often despised as appropriate investment options since social media movements massively influence them. However, in light of the latest clampdown on crypto altcoins, many crypto investors need to be more knowledgeable about which platforms will give returns, and attention is back on the meme coin sector. With that in mind, we present [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T12:51:41.000Z",
    "title": "Breaking: Celo Blockchain Set to Join Ethereum Ecosystem with Transition to Layer-2 Technology ",
    "url": "https://www.crypto-news-flash.com/breaking-celo-blockchain-set-to-join-ethereum-ecosystem-with-transition-to-layer-2-technology/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-celo-blockchain-set-to-join-ethereum-ecosystem-with-transition-to-layer-2-technology",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7108003_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"the quantity of Ethereum that has been staked has reached a new milestone, surpassing an all-time high (ATH) of 25.8 million ETH.\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7108003_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7108003_1920-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7108003_1920-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7108003_1920-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/ethereum-7108003_1920-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Celo Blockchain announces that it is transitioning from Layer-1 to the Ethereum Layer-2 blockchain. Some of the advantages include a material change in gas fee as well as enhanced compatibility.  The organization responsible for building the Celo blockchain, CLabs, has disclosed its decision to return to the Ethereum ecosystem. This means it would move from [...]"
  }
]