[
  {
    "source": "Decrypt",
    "date": "2024-01-04T18:46:55.000Z",
    "title": "Grayscale, VanEck and ARK Bitcoin ETFs Register to Trade on Exchanges",
    "url": "https://decrypt.co/211735/grayscale-and-vaneck-bitcoin-etfs-register-to-trade-on-exchanges",
    "description": "Two more Bitcoin ETF applicants have gotten the green light to have their funds listed on exchanges—but it's all pending SEC approval."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-04T18:44:55.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">VanEck and Grayscale have become the latest asset managers to file registrations to list shares of spot Bitcoin exchange-traded funds (ETFs). Meanwhile, South Korea is considering a ban on using credit cards to buy virtual assets, such as cryptocurrencies. Elsewhere, the founder of Matrixport has clarified that his firm’s controversial report on spot Bitcoin ETFs wasn't intended for mass circulation.</p><p><a href=\"https://cointelegraph.com/news/grayscale-vaneck-register-spot-bitcoin-etf\">Grayscale and VanEck</a> have become the latest asset managers to file registrations to list shares of spot Bitcoin exchange-traded funds.</p><p>According to separate filings with the United States Securities and Exchange Commission (SEC), the VanEck Bitcoin Trust and Grayscale Bitcoin Trust registered their shares via Form 8-A. The proposed shares would be listed on Cboe BZX Exchange in the case of VanEck and New York Stock Exchange Arca for Grayscale. As Cointelegraph reported, Fidelity submitted <a href=\"https://cointelegraph.com/news/cboe-registration-fidelity-spot-bitcoin-etf\">a similar registration</a> for its Wise Origin Bitcoin Fund this week. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-04T19:07:02.000Z",
    "title": "Marathon sets new record after mining 1,853 Bitcoin in December",
    "url": "https://cryptoslate.com/marathon-sets-new-record-after-mining-1853-bitcoin-in-december/",
    "description": "<p>Marathon Digital achieved a record-breaking production of 1,853 Bitcoin (BTC) in December 2023, marking the highest monthly total ever recorded by a public BTC mining company. The growth represents a significant 290% year-over-year increase and a 56% rise from the previous month. Marathon chairman and CEO Fred Thiel attributed the achievement to the company&#8217;s strategic expansion [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/marathon-sets-new-record-after-mining-1853-bitcoin-in-december/\">Marathon sets new record after mining 1,853 Bitcoin in December</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-04T19:00:16.000Z",
    "title": "Bitcoin’s Obituary Bounce — Decline in ‘Death Calls’ Signals Resilient 2023",
    "url": "https://news.bitcoin.com/bitcoins-obituary-bounce-decline-in-death-calls-signals-resilient-2023/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/stay-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin&#039;s Obituary Bounce — Decline in &#039;Death Calls&#039; Signals Resilient 2023\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/stay-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/stay-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/stay-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/stay-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/stay-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/stay-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/stay.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Following numerous proclamations of bitcoin&#x2019;s demise in 2021 and 2022, totaling 47 and 27 on the Bitcoin Obituaries list respectively, a mere eight declarations were noted in 2023. The final one emerged at the year&#x2019;s end, attributed to crypto advocate Arthur Hayes, who warned that if exchange-traded funds (ETFs) achieve excessive success, &#x201C;they will completely [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T19:08:54.000Z",
    "title": "Mystery Bitcoin wallet leaps to Top 10 amid Bitcoin’s rise",
    "url": "https://www.cryptopolitan.com/mystery-bitcoin-wallet-top-10-amid-btc-rise/",
    "description": "The mysterious ascent of a Bitcoin wallet, believed to be linked to Tether, has caught the attention of the crypto community as it now stands as the tenth-largest holder of Bitcoin. This notable rise occurred following the accumulation of 8,888 bitcoins from Bitfinex as the year came to a close. Presently, the wallet holds approximately [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T18:56:36.000Z",
    "title": "Cipher Mining buys 16,700 new miners ahead of Bitcoin halving",
    "url": "https://www.cryptopolitan.com/cipher-16700-miners-ahead-of-bitcoin-halving/",
    "description": "Cipher Mining has strategically positioned itself for significant growth with the recent acquisition of 16,700 new Bitcoin miners from Canaan. The delivery of these miners is slated for the second quarter, aligning with the anticipated Bitcoin halving event expected in April. The miners, belonging to the latest generation Avalon A1466 series, will find homes in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T18:50:41.000Z",
    "title": "Sleepless AI’s $2.5 Million Investment to Secure $AI Token’s Future",
    "url": "https://www.cryptopolitan.com/sleepless-ais-2-5-million-investment-to-secure-ai-tokens-future/",
    "description": "Following the successful launch of its $AI token, Sleepless AI has announced a significant financial strategy, the $AI Together Plan. The initiative involves channeling an estimated $2.5 million, accrued from the company&#8217;s NFT auction revenues, into securing the long-term price performance of the $AI token. Amidst the market&#8217;s mixed reactions, ranging from congratulations to skepticism, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-04T18:51:50.000Z",
    "title": "Ex-Citigroup execs to launch alternative Bitcoin security amid ETF uncertainty",
    "url": "https://crypto.news/ex-citigroup-execs-to-launch-alternative-bitcoin-security-amid-etf-uncertainty/",
    "description": "In the face of ongoing uncertainty regarding the approval of spot Bitcoin ETFs, a new strategy has emerged from a group of former Citigroup executives. "
  },
  {
    "source": "BTCManager",
    "date": "2024-01-04T18:44:05.000Z",
    "title": "Moody’s rates first fund on Standard Chartered tokenization platform",
    "url": "https://crypto.news/moodys-rates-first-fund-on-standard-chartered-tokenization-platform/",
    "description": "Moody's has recently issued an AA rating to the SGD Delta Fund, the first fund utilizing Standard Chartered's SC Ventures' Libeara tokenization platform."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-04T19:00:31.000Z",
    "title": "XRP Price Set To Spike As Ripple Enters Another $1.5 Trillion Industry",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-ripple-1-5-trillion/",
    "description": "Global crypto payments provider Ripple is poised to venture into a substantial $1.5 trillion industry, signaling a potential surge for XRP. The company is strategically positioning itself to provide solutions to the financial complexities within this industry. Ripple’s Strategic Expansion In a recent Wednesday report published on X (formerly Twitter), Ripple, a blockchain-based digital payments network, revealed its latest expansion target to be the $1.5 trillion IT industry. The crypto network has envisioned a transformative role for Ripple in the IT industry where difficulties with cross-border payments and other financial challenges have long persisted.  Related Reading: Solana Has Flipped Ethereum In Yet Another Metric In Its Bid To Reach $200 “97% of payments leaders believe blockchain and digital assets will have a significant role in enabling faster payments within the next three years. In our latest payments guide, discover how to accelerate global payments for an IT services business,” Ripple stated.  While Ripple expressed its ambition to extend into this thriving industry, the crypto payments provider also outlined several ways IT service providers can utilize blockchain-based payments to overcome their financial problems.  According to Ripple, by using blockchain technology, many IT services can easily streamline payments to suppliers overseas. Additionally, blockchain-based payments can effectively solve issues like slow and expensive international wire transfers, high transaction fees, restrictive banking hours, and a lack of transparency.  While Ripple anticipates the IT industry to hit $1.5 trillion by 2024, the crypto payments provider has also expanded its focus to other sectors. In November 2023, Ripple announced its intention to dominate the $300 trillion payments sector. This strategic expansion aligns with the company’s vision to revolutionize the traditional finance system and could serve as a catalyst to trigger a long-awaited surge in XRP prices.  Token price declines to $0.57 &#124; Source: XRPUSD On Tradingview.com What’s Next For XRP &#8211; Potential Surge? Ripple’s possible entry into a trillion-dollar industry comes as a ray of hope for XRP ‘hodlers’ who have been waiting years to see a significant shift in the price of XRP. If Ripple’s advanced payment technology successfully becomes integrated into the vast IT industry, demand for its native token, XRP may rise. Related Reading: Crypto Pundit Says Cardano Rivals XRP Community, But Why Is ADA Price Struggling? Since 2023 till date, XRP has been unable to break resistance to reach the $1 price mark. However, Ripple’s move into a multi-trillion dollar market could lead to broader adoption of the cryptocurrency, potentially pushing XRP’s price to values predicted by various crypto analysts in the industry.  At the time of writing, XRP is trading at 0.5771 according to CoinMarketCap. The cryptocurrency is still trading miles below its all-time high of $3.84 in 2018.  Featured image from Zipmex, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-04T19:05:38.000Z",
    "title": "Crypto Trader Says New All-Time Highs for Two Altcoins Incoming, Issues Warning on Solana",
    "url": "https://dailyhodl.com/2024/01/04/crypto-trader-says-new-all-time-highs-for-two-altcoins-incoming-issues-warning-on-solana/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/two-based-more-this.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/two-based-more-this.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/two-based-more-this.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/two-based-more-this.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/two-based-more-this.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/two-based-more-this.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/two-based-more-this.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Popular crypto analyst Altcoin Sherpa names two altcoins he believes will soon soar to values last reached in 2022. The pseudonymous analyst tells his 204,300 followers on the social media platform X that Stacks (STX) could soon soar beyond its recent high of $1.73, a level it hasn’t traded above in nearly two years. &#8220;STX: [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/04/crypto-trader-says-new-all-time-highs-for-two-altcoins-incoming-issues-warning-on-solana/\">Crypto Trader Says New All-Time Highs for Two Altcoins Incoming, Issues Warning on Solana</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]