[
  {
    "source": "CoinDesk",
    "date": "2023-12-18T20:45:44.000Z",
    "title": "Helium Mobile Cracks Down on MOBILE Token Farmers",
    "url": "https://www.coindesk.com/business/2023/12/18/helium-mobile-cracks-down-on-mobile-token-farmers/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "New users are pouring into Helium's low-cost phone plan. Some are more interested in the MOBILE token rewards than the cell service."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-18T20:04:16.000Z",
    "title": "The Next BONK? Solana Meme Coin Dogwifhat Pumps 2,000X in a Month",
    "url": "https://decrypt.co/210151/next-bonk-solana-meme-coin-dogwifhat-pumps-2000x-month",
    "description": "It’s a dog. With a hat. And the Solana token based on the dogwifhat meme is the latest to surge in value after BONK's boom."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-18T19:16:33.000Z",
    "title": "Bitcoin Funds See 'Profit-Taking' Dip, But Investors Still Like Solana",
    "url": "https://decrypt.co/210155/bitcoin-funds-see-profit-taking-dip-but-investors-still-like-solana",
    "description": "Solana and other altcoin funds saw $21 million deposited last week."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-18T20:55:00.000Z",
    "title": " UK plan on digital securities sandbox laid before Parliament ",
    "url": "https://cointelegraph.com/news/uk-digital-securities-sandbox-before-parliament",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZWJmYjhmNGUtMDVkZi00OTBiLTkxZWYtNGE2MWUyZjA1ZjQ2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The regulations will take effect on Jan. 8, with the Bank of England and U.K. Financial Conduct Authority operating the sandbox.</p>\n                    <p><p>The United Kingdom Financial Services and Markets Act’s provisions on a digital securities sandbox are scheduled to come into force in January 2024 after being presented to Parliament.</p><p>In a Dec. 18 publication, the U.K. government <a href=\"https://www.legislation.gov.uk/uksi/2023/1398/made\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> the Digital Securities Sandbox (DSS) regulations of the 2023 Financial Services and Markets Act, which were laid before Parliament, paving the way for crypto firms to test products and services in the country. According to the government, the regulations will take effect on Jan. 8, with the Bank of England and the U.K. Financial Conduct Authority operating the sandbox.</p><p>“The DSS will allow firms and the regulators to test the use of new technology across our financial markets,” <a href=\"https://www.legislation.gov.uk/uksi/2023/1398/pdfs/uksiem_20231398_en_001.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a> a memo explaining the bill. “In particular, this will involve trialling the use of developing technology (such as distributed ledger technology, or in general technology that facilitates what are commonly referred to as ‘digital assets’) to perform the activities of a central securities depository (specifically notary, settlement and maintenance), and operating a trading venue.”</p><p><a href=\"https://cointelegraph.com/news/uk-digital-securities-sandbox-before-parliament\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-18T20:32:52.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Lido DAO is the center of a class action lawsuit claiming the decentralized autonomous organization duped the public into investing in an unregistered securities offering. Meanwhile, spot Bitcoin ETFs could trigger unwanted consequences for crypto exchanges like Coinbase due to lower transaction fees, ETF analysts have said, and crypto exchange FTX paid $118.1 million in fees to bankruptcy lawyers and advisers between August and October.</p><p>A former Lido investor has <a href=\"https://cointelegraph.com/news/former-lido-holder-files-class-action-lawsuit-against-lido-dao-crypto-losses\">filed a class action lawsuit</a> against the Lido decentralized autonomous organization (DAO) over allegations that it operates an unregistered security and is liable for plaintiffs' losses during crypto winter.</p><p>The lawsuit, which was filed in a San Francisco District Court on Dec. 17, blames Lido DAO for dumping tokens on unsuspecting investors during the depths of the bear market. Per the filing, Lido DAO began as a \"general partnership\" comprised of institutional investors, before deciding to capitalize on a \"potential 'exit' opportunity\" by selling Lido tokens to the public. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-18T20:00:00.000Z",
    "title": " The Pope and US regulators warn about AI risks: Law Decoded  ",
    "url": "https://cointelegraph.com/news/the-pope-and-us-regulators-warn-about-ai-risks-law-decoded-dec-11-18",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYzhjNzQ2YzYtM2NmYS00YmFlLWJmYzctYmFmMDE3Nzc0MDg0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The head of the Catholic Church warned humanity of AI’s potential dangers and explained what needs to be done to control it.</p>\n                    <p><p data-ct-non-breakable=\"true\">Nowadays, everyone has an opinion on artificial intelligence (AI) and its potential risks. Even Pope Francis — the head of the Catholic Church — warned humanity of AI’s potential dangers and explained what needs to be done to control it. The Pope wants to <a href=\"https://cointelegraph.com/news/pope-vatican-releases-letter-warning-dangers-of-ai\">see an international treaty</a> to regulate AI to ensure it is developed and used ethically. Otherwise, he says, we risk falling into the spiral of a “technological dictatorship.” <a href=\"https://cointelegraph.com/news/tom-hanks-mrbeast-gayle-king-ai-deep-fakes-scams\">The threat of AI arises</a> when developers have a “desire for profit or thirst for power” that dominates the wish to exist freely and peacefully, he added. </p><p>The same feeling was expressed by the Financial Stability Oversight Council (FSOC), which is comprised of top financial regulators and chaired by United States Treasury Secretary Janet Yellen. In its annual report, the organization emphasized that <a href=\"https://cointelegraph.com/news/us-financial-regulators-warn-ai-risks\">AI carries specific risks</a>, such as cybersecurity and model risks. It suggested that companies and regulators enhance their knowledge and capabilities to monitor AI innovation and usage and identify emerging risks. According to the report, specific AI tools are highly technical and complex, posing challenges for institutions to explain or monitor them effectively. The report warns that companies and regulators may overlook biased or inaccurate results without a comprehensive understanding.</p><p>Even judges in the United Kingdom are ruminating on the risks of using AI in their work. Four senior judges in the U.K. <a href=\"https://cointelegraph.com/news/ai-guidance-judges-in-england-wales-warns-risks\">have issued judicial guidance</a> for AI, which deals with AI’s “responsible use” in courts and tribunals. The guidance points out potentially useful instances of AI usage, primarily in administrative aspects such as summarizing texts, writing presentations and composing emails. However, most of the guidance cautions judges to avoid consuming false information produced through AI searches and summaries and to be vigilant about anything false being produced by AI in their name. Particularly not recommended is the use of AI for legal research and analysis.</p><p><a href=\"https://cointelegraph.com/news/the-pope-and-us-regulators-warn-about-ai-risks-law-decoded-dec-11-18\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-18T19:43:27.000Z",
    "title": " Revolut Business reportedly cuts crypto services ahead of new rules ",
    "url": "https://cointelegraph.com/news/revolut-business-reportedly-cuts-crypto-services-ahead-new-rules",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNmY4Njg0MDEtZTFjNi00MGI3LTkxMzgtNWU2YzA3MzNlNWZjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The neobank will halt crypto purchases by businesses while it sorts out new ad requirements. </p>\n                    <p><p>Neobank Revolut will temporarily halt cryptocurrency purchases on its business platform in the United Kingdom at the beginning of the new year, according to a media <a href=\"https://www.cityam.com/revolut-to-suspend-crypto-trading-for-uk-business-customers-as-city-regulator-prepares-new-rules/\" target=\"_blank\" rel=\"noopener nofollow\">report</a>. An email informing customers of the decision mentioned only purchasing, implying holding crypto and selling it could go on uninterrupted. </p><p>Revolut said the pause was needed to give it more time to comply with new Financial Conduct Authority (FCA) rules on promoting crypto that come into force on Jan. 8, 2024. Revolut Business will halt crypto purchases on Jan. 3, it said. In a message <a href=\"https://twitter.com/JasonADeane/status/1736720432084943227\" target=\"_blank\" rel=\"noopener nofollow\">reproduced</a> in an X (formerly Twitter) post,  Revolut Business told customers: </p><p>Revolut is the latest of several firms that have been impacted by the FCA rules, which the regulator itself described as “tough.” The rules <a href=\"https://cointelegraph.com/news/crypto-ads-face-stricter-rules-including-a-referral-bonus-ban-by-fca\">were announced in June</a> and were intended to bring crypto advertising into line with other high-risk investment products. </p><p><a href=\"https://cointelegraph.com/news/revolut-business-reportedly-cuts-crypto-services-ahead-new-rules\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-18T20:10:54.000Z",
    "title": "Galaxy Digital eyeing assets held by distressed crypto firms: FT",
    "url": "https://cryptoslate.com/galaxy-digital-eyeing-assets-held-by-distressed-crypto-firms-ft/",
    "description": "<p>After reporting exponential asset growth following its deal to liquidate FTX&#8216;s holdings, Galaxy Digital is looking to acquire assets from other distressed digital asset companies. According to reporting from the Financial Times, Galaxy Digital tripled its assets under management from $1.7 billion last year to over $5 billion. This surge came after the company was chosen [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/galaxy-digital-eyeing-assets-held-by-distressed-crypto-firms-ft/\">Galaxy Digital eyeing assets held by distressed crypto firms: FT</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-18T19:20:04.000Z",
    "title": "Crypto stocks rally as Bitcoin stalls",
    "url": "https://cryptoslate.com/crypto-stocks-rally-as-bitcoin-stalls/",
    "description": "<p>The shares of major crypto-focused companies begin the week better than Bitcoin&#8217;s tepid price performance during Asian trading hours. Coinbase, the largest US-based exchange, COIN stock rose by a meager 0.43% at the beginning of the market to $153, representing a reversal of its 1.61% pre-market decline. COIN is one of the best-performing crypto stocks [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/crypto-stocks-rally-as-bitcoin-stalls/\">Crypto stocks rally as Bitcoin stalls</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-18T20:53:24.000Z",
    "title": "Veles Unleashed: A Comprehensive Review of the Ultimate Trading Bot Platform",
    "url": "https://cryptodaily.co.uk/2023/12/veles-unleashed-a-comprehensive-review-of-the-ultimate-trading-bot-platform",
    "description": "Veles is a trading bot platform that allows users to save their time. You can set up automated trading on all popular exchanges such as Binance, Bybit, OKX, Gate.io, HTX, KuCoin, etc."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-18T20:29:45.000Z",
    "title": "Discover 3 Best Emerging Cryptos in December 2023",
    "url": "https://cryptodaily.co.uk/2023/12/discover-3-best-emerging-cryptos-in-december-2023",
    "description": "Explore the top 3 emerging cryptocurrencies in December 2023 that are set to revolutionize the digital currency landscape. Learn about their unique features, market potential, and why they are the ones to watch in the dynamic world of crypto investments."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-18T20:01:11.000Z",
    "title": "Collab.Land Launches First SocialFi Bot, Telefrens, to Empower Crypto Trading on Telegram",
    "url": "https://cryptodaily.co.uk/2023/12/collabland-launches-first-socialfi-bot-telefrens-to-empower-crypto-trading-on-telegram",
    "description": "Collab.Land Launches First SocialFi Bot, Telefrens, to Empower Crypto Trading on Telegram"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-18T20:30:18.000Z",
    "title": "Grayscale Clarifies Investor Tax Implications of a Cash-Created Spot Bitcoin ETF",
    "url": "https://news.bitcoin.com/grayscale-clarifies-investor-tax-implications-of-a-cash-created-spot-bitcoin-etf/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/fa344ff3-4ce3-41d2-b894-244fe0ffbc5a-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Grayscale Clarifies Investor Tax Implications of a Cash Created Spot Bitcoin ETF\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/fa344ff3-4ce3-41d2-b894-244fe0ffbc5a-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/fa344ff3-4ce3-41d2-b894-244fe0ffbc5a-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/fa344ff3-4ce3-41d2-b894-244fe0ffbc5a-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/fa344ff3-4ce3-41d2-b894-244fe0ffbc5a-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/fa344ff3-4ce3-41d2-b894-244fe0ffbc5a-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/fa344ff3-4ce3-41d2-b894-244fe0ffbc5a-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/fa344ff3-4ce3-41d2-b894-244fe0ffbc5a.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Grayscale, one of the biggest cryptocurrency asset management firms, has addressed the issue of taxation regarding the adoption of a cash creation model in an upcoming spot bitcoin exchange-traded fund (ETF). The firm clarified that &#8220;no spot Bitcoin ETF that qualifies as a grantor trust would be at a disadvantage in relation to any other [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T21:05:32.000Z",
    "title": "Why is EU coming after Elon Musk and his X?",
    "url": "https://www.cryptopolitan.com/why-is-eu-coming-after-elon-musk-and-his-x/",
    "description": "The European Union&#8217;s decision to launch an investigation into Elon Musk&#8217;s social media platform, X, formerly known as Twitter, marks a significant chapter in the ongoing narrative of digital governance and regulatory oversight. This move by the EU, instigated under the newly implemented Digital Services Act (DSA), throws a spotlight on the challenges and complexities [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T21:00:42.000Z",
    "title": "Bitwise drops commercial for its spot Bitcoin ETF",
    "url": "https://www.cryptopolitan.com/bitwise-commercial-for-its-spot-bitcoin-etf/",
    "description": "In a bold and strategically-timed move, Bitwise, a San Francisco-based asset manager, has unveiled its latest endeavor to capture the burgeoning cryptocurrency market: a commercial for its spot Bitcoin ETF. This move, signifying a confident step forward in their ongoing application process with the US Securities and Exchange Commission (SEC), marks a pivotal moment in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T20:51:33.000Z",
    "title": "Crypto giants pour $80m into pro-crypto US election committee",
    "url": "https://www.cryptopolitan.com/crypto-giants-pro-crypto-election-committee/",
    "description": "In a bold move marking a significant intersection between politics and the evolving world of cryptocurrencies, key players in the crypto industry have committed a staggering $78 million to a political action committee (PAC) named Fairshake. This initiative, spearheaded by Ripple CEO Brad Garlinghouse, signals a concerted effort by the crypto community to influence the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T20:45:12.000Z",
    "title": "Is Joe Biden’s economic agenda already doomed?",
    "url": "https://www.cryptopolitan.com/is-joe-bidens-economic-agenda-already-doomed/",
    "description": "The American economic scene under President Joe Biden is a complex tapestry, woven with ambitious policies and fraught with challenges. While I personally find merit in many of Biden&#8217;s economic strategies, the question looms: are they resonating with the American public? The reality, as echoed by Democratic pollster Stanley Greenberg, is that despite job growth [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T20:41:33.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 Aptos Price Prediction 2023 – up to $8.25 Aptos Price Prediction 2026 – up to $30.38 Aptos Price Prediction 2029 – up to $94.60 Aptos Price Prediction 2032 – up to $293.92 As we venture into 2023 to 2032, the next decade promises to be a critical period for Aptos as [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T20:38:22.000Z",
    "title": "Markets are racing ahead of Federal Reserve on rate cuts",
    "url": "https://www.cryptopolitan.com/markets-racing-ahead-of-fed-on-rate-cuts/",
    "description": "The financial industry is witnessing an intriguing race, with markets sprinting ahead, seemingly outbidding the Federal Reserve in the anticipation of interest rate cuts. This scenario unfolds against a backdrop where top Fed officials, including those from the Cleveland and New York Feds, have expressed caution, suggesting markets may be jumping the gun in expecting [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T20:33:40.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: ARB breaks key barrier",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the blockchain world anticipates developments, a third alternative has emerged: scaling solutions. These innovative applications operate on top of a blockchain’s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T20:32:40.000Z",
    "title": "Spot Bitcoin ETF predicted to challenge crypto exchanges",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-predicted-to-challenge-exchanges/",
    "description": "The cryptocurrency community is bracing for a significant shift as a spot Bitcoin ETF (BTC) exchange-traded fund (ETF) looms in the United States. This anticipated development, coupled with Bitcoin&#8217;s expected block reward halving in April 2024, is projected to considerably impact the market. Industry experts, including Blockstream CEO Adam Back, foresee a potential surge in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T20:28:48.000Z",
    "title": "Galaxy Digital’s appetite for crypto bankruptcy assets is growing",
    "url": "https://www.cryptopolitan.com/galaxy-digital-crypto-bankruptcy-assets/",
    "description": "Galaxy Digital, the renowned cryptocurrency group led by U.S. billionaire Mike Novogratz, is making waves in the digital assets landscape. With its recent success in managing and selling coins held by the defunct crypto exchange FTX, Galaxy Digital has seen a significant boost in its funds under management, climbing from $1.7 billion to a staggering [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T20:23:06.000Z",
    "title": "Federal Reserve faces mounting pressure for leniency",
    "url": "https://www.cryptopolitan.com/fed-faces-mounting-pressure-for-leniency/",
    "description": "The Federal Reserve is currently facing escalating demands for a more lenient approach to monetary policy. This pressure comes amidst a notable decline in U.S. CPI inflation, which has decreased from a peak of 9.1% in June 2022 to 3.1% in November. However, this data has led to a resurgence of the narrative that inflation [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-18T20:09:14.000Z",
    "title": "Multibit Faces Sharp Over 20% Price Drop After Whales Sell Off Some Holdings",
    "url": "https://nulltx.com/multibit-faces-sharp-over-20-price-drop-after-whales-sell-off-some-holdings/",
    "description": "Multibit ($MUBI) experienced a significant setback after a robust week that saw its value surge by an impressive 230% in the last seven days. Despite this bullish run, the token faced a sudden downturn, plummeting by over 20% within the past 24 hours. One of the early investors of $MUBI [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-18T19:21:58.000Z",
    "title": "ARBITRUM PRICE ANALYSIS & PREDICTION (December 17) – ARB Suspends Bullish Amid Latest Drawdown, Drops 1% Today",
    "url": "https://nulltx.com/arbitrum-price-analysis-prediction-december-17-arb-suspends-bullish-amid-latest-drawdown-drops-1-today/",
    "description": "As the entire crypto market took a break in buying, ARB&#8217;s price pulled back and lost 3% in a week. It remains bullish on the daily but slowly losing momentum on the hourly alongside other top altcoins.  Layer 2 token like ARB has shown a strong reaction to the latest [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T21:08:09.000Z",
    "title": "UK publishes FCA regulations for digital securities sandbox",
    "url": "https://crypto.news/uk-publishes-fca-regulations-for-digital-securities-sandbox/",
    "description": "The U.K. introduced regulation that enables the Financial Conduct Authority and the Bank of England to oversee a Digital Securities Sandbox for testing tokenized securities and distributed ledger technology."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T20:53:11.000Z",
    "title": "Binance completes audit to demonstrate robust security ",
    "url": "https://crypto.news/binance-completes-audit-to-demonstrate-robust-security/",
    "description": "Binance has successfully completed the rigorous SOC 2 Type II compliance audit to demonstrate the highest security benchmarks in the industry."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T20:45:41.000Z",
    "title": "Revolut pauses UK crypto trading for business clients amid regulatory changes",
    "url": "https://crypto.news/revolut-pauses-uk-crypto-trading-for-business-clients-amid-regulatory-changes/",
    "description": "In response to new regulations from the FCA, digital bank Revolut has announced the temporary suspension of specific crypto services for its U.K. business clients, effective Jan. 3."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T20:08:49.000Z",
    "title": "Analyst claims Bitcoin is about to dump, rally is over",
    "url": "https://crypto.news/analyst-claims-bitcoin-is-about-to-dump-rally-is-over/",
    "description": "The analyst expects Bitcoin to enter a new cycle with fresh narratives that will attract new investors after a healthy correction."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T19:55:20.000Z",
    "title": "Investor files lawsuit against Lido DAO, claims unfair token control",
    "url": "https://crypto.news/investor-files-lawsuit-against-lido-dao-claims-unfair-token-control/",
    "description": "A former investor has filed a class action lawsuit against Lido DAO in a District Court of San Francisco."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T19:54:34.000Z",
    "title": "Best altcoins for users looking to diversify crypto portfolios in 2023",
    "url": "https://crypto.news/best-altcoins-for-users-looking-to-diversify-crypto-portfolios-in-2023/",
    "description": "While established players like Ethereum (ETH) and Dogecoin (DOGE) continue to hold their ground, emerging contenders like ApeMax and Cardano are also attracting attention"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T19:51:03.000Z",
    "title": "Grayscale CEO confident in 2024 Bitcoin market",
    "url": "https://crypto.news/grayscale-ceo-confident-in-2024-bitcoin-market/",
    "description": "Grayscale CEO eyes spot Bitcoin ETF, unlocking $30 trillion for institutional investors, signaling broader crypto access and a bullish market."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T19:34:56.000Z",
    "title": "Upland partners with AI studio Kaedim to accelerate metaverse asset production",
    "url": "https://crypto.news/upland-partners-with-ai-studio-kaedim-to-accelerate-metaverse-asset-production/",
    "description": "Upland's experimental collaboration with the artificial intelligence (AI) startup Kaedim has seen a 70% increase in 3D asset production speeds"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T19:18:08.000Z",
    "title": "Market insights: investors examining RBLZ, TIA, and OP",
    "url": "https://crypto.news/market-insights-investors-examining-rblz-tia-and-op/",
    "description": "Investors are looking at Celestia (TIA), Rebel Satoshi (RBLZ), and Optimism (OP) following key developments in their respective ecosystems"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-18T21:00:37.000Z",
    "title": "Crypto Founder Predicts XRP Price Will Hit $22, Here’s When",
    "url": "https://www.newsbtc.com/analysis/xrp/crypto-founder-xrp-price-22/",
    "description": "A crypto founder recently gave his opinion on the future trajectory of the XRP price, and XRP holders will like this one as he predicts that the crypto token will hit $22. He also gave a timeline of when it will hit this price level. When XRP Price Will Hit $22 In a YouTube interview with Zach Rector, Patrick Riley, the founder of Reaper Financial, mentioned that XRP will hit $22 at the peak of the next bull run. He further stated that the crypto token will hold above $10 in the next bear market after that bull run. The next bull run has been projected by many to occur in 2024, meaning that XRP could hit $22 next year.  Related Reading: Changelly Releases Updated Predictions For XRP Price, When Will It Cross $10? Riley sounded so optimistic about the future of XRP. This isn’t surprising, considering that Reaper Financial is built on the XRP Ledger. The $22 price prediction isn’t the only bold assertion that the crypto founder made. He also foresees XRP surpassing Bitcoin at some point, although he didn’t give a particular timeline for that. When that happens, he believes that will see XRP materialize as the global reserve currency.  He alluded to the dollar failing and many possibly looking to cryptocurrencies for succor. There is a general belief that cryptocurrencies, especially Bitcoin, can act as a hedge against inflation. However, going by Riley’s prediction, XRP instead of Bitcoin will be the go-to token.  Talks about Inflation and the declining value of the US dollar have been discussed much of late. Renowned economist Peter Schiff recently warned that the fall of the US dollar was imminent and that the country’s economy is going to take a hard hit. Many believe that this could be a great avenue for cryptocurrencies to swoop in and save the day.  XRP falls below $0.6 &#124; Source: XRPUSD on Tradingview.com Making A Case For XRP In a more recent video on his YouTube channel, Zach Rector made a case for XRP instead of Bitcoin as the future of finance. He hinted at how the transaction fees on the Bitcoin network affect its utility, as many are unable even to afford to transact on the network. Therefore, he believes that XRP is in a “better to change the world” and possibly the global financial structure. Related Reading: Polygon (MATIC) Price Faces Crucial Turning Point That Could Trigger 50% Rally, Analyst Says Indeed, many believe that XRP is in a better position because of the transaction speed and fee of the network. The XRP ledger is said to be able to process 1,500 transactions per second and settle them in three to five seconds. Transaction cost on the network also stands at 0.00001 XRP, which is way below the average gas fee on the Bitcoin network.  At the time of writing, XRP is trading at around $0.6, down over 3% in the last 24 hours, according to data from CoinMarketCap.  Featured image from YouTube, chart from Tradingview.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-18T19:30:13.000Z",
    "title": "Bitcoin Bull Run In Jeopardy? Analyst Finds Market Top Signals With BTC At $40,000",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bull-run-in-jeopardy-analyst-finds-market-top-signals-with-btc-at-40000/",
    "description": "Bitcoin is walking back on some of its gains over the past few days. The number one cryptocurrency by market cap might be on the verge of a more significant retracement, which could push it back to the $30,000 zone. Related Reading: Internet Computer Loses Grip On $10, But Still Inks 82% Rally – Details As of this writing, Bitcoin (BTC) trades at $40,950 with a 2% loss in the past 24 hours. On the weekly chart, the cryptocurrency records a 3% loss, with all tokens in the top 10 by market recording a similar performance, except for Avalanche (AVAX). Bitcoin Hits Local Top? Bull Run Slows Down Over the weekend, Bitcoin was rejected from the critical resistance level at $43,500. According to a pseudonym analyst, as the BTC price dropped to its current levels, a significant player placed a “substantial resistance block.” The chart below shows that the selling order is 1,562 BTC, or around $7 million. It also shows thick support for BTC as the bullish momentum fades. In other words, Bitcoin might slow down, but the area around $40,000 could provide critical support for a potential bounce. The analyst stated on the increasing selling orders appearing on the books: Massive resistance added on BTC Binance Spot. This is what a top looks like. A substantial resistance block of 1562 BTC has just arrived in the order books. BTC Whales On The Move While many believe that the market can absorb the spike in selling pressure, crypto analytics firm Material Indicators showed that Bitcoin is losing the support of major players. Over the weekend, players selling orders above $1 million “dumped” their positions. The firm has been warning traders about this possibility by arguing that the recent bullish price action was a strategy to suck in liquidity from retail investors. Once this smaller player jumped in, whales began to “distribute” or sell their coins into the rally. Related Reading: Solana Threatens To Unseat Ethereum In Trade Volume With $1 Billion In Single Day In that sense, the firm set a potential local top for BTC at $45,000. Keith Alan, one of Material Indicators senior analysts, stated the following on the current price action: The good news is, at some point the market does flip to accumulation, and prices moving lower will get us to that point. As bad as it looks for bulls right now, I&#8217;m not expecting a straight line down. Time to exercise some patience and see how things develop from here. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-18T21:05:57.000Z",
    "title": "Crypto in Crisis: SEC’s Bitcoin ETF Decision Could Trigger Massive Market Turbulence",
    "url": "https://www.crypto-news-flash.com/crypto-in-crisis-secs-bitcoin-etf-decision-could-trigger-massive-market-turbulence/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-in-crisis-secs-bitcoin-etf-decision-could-trigger-massive-market-turbulence",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-3134829_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-3134829_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-3134829_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-3134829_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-3134829_1920-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />One analyst believes that if the SEC refuses to approve a Bitcoin spot ETF in January, we could see the biggest rug pull in crypto history, and Bitcoin could make a historic dump. However, he believes there&#8217;s almost no chance that Gary Gensler will throw out the ETF applications this time, with the Grayscale lawsuit [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-18T20:04:52.000Z",
    "title": "Chainlink’s CCIP Expanding Beyond DeFi to Transform Global Industries",
    "url": "https://www.crypto-news-flash.com/chainlinks-ccip-expanding-beyond-defi-to-transform-global-industries/?utm_source=rss&utm_medium=rss&utm_campaign=chainlinks-ccip-expanding-beyond-defi-to-transform-global-industries",
    "description": "<img width=\"1038\" height=\"612\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"chainlink\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-300x177.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-1024x604.png 1024w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />Chainlink co-founder Sergey Nazarov is optimistic that blockchain technology, smart contracts, and Oracle networks will be used in every aspect of value digitization amid the mass adoption of the web3 industry. Chainlink’s CCIP has been tapped by several institutions seeking to transfer real-world assets tokens securely between different blockchains including leading Australia’s bank ANZ. Chainlink [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-18T19:28:17.000Z",
    "title": "IOTA’s Tech Marvel: Transforming East African Trade with SPS Documents",
    "url": "https://www.crypto-news-flash.com/iotas-tech-marvel-transforming-east-african-trade-with-sps-documents/?utm_source=rss&utm_medium=rss&utm_campaign=iotas-tech-marvel-transforming-east-african-trade-with-sps-documents",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/IOTA-42pixels-1-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"IOTA\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/IOTA-42pixels-1-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/IOTA-42pixels-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/IOTA-42pixels-1-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/IOTA-42pixels-1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/IOTA-42pixels-1-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/IOTA-42pixels-1-2048x1366.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/IOTA-42pixels-1-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/IOTA-42pixels-1-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/IOTA-42pixels-1-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/IOTA-42pixels-1-48x32.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Trademark Africa and EAC SPS agencies collaborate using IOTA to digitize the exchange of trade documents, improving efficiency and security in East African trade. The workshop in Rwanda marked a breakthrough in the creation of a digital SPS platform, promising a revolution in regional trade with a focus on transparency and unification of food safety [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-18T21:00:38.000Z",
    "title": "One Catalyst Could Send Bitcoin Flying to New All-Time High in Four Months, According to Quant Analyst PlanB",
    "url": "https://dailyhodl.com/2023/12/18/one-catalyst-could-send-bitcoin-flying-to-new-all-time-high-in-four-months-according-to-quant-analyst-planb/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/Says-BTC-Could-Dip-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/Says-BTC-Could-Dip-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/Says-BTC-Could-Dip-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/Says-BTC-Could-Dip-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/Says-BTC-Could-Dip-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/Says-BTC-Could-Dip-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/Says-BTC-Could-Dip-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>On-chain analyst PlanB says that one event could push Bitcoin (BTC) to a new all-time high in as little as four months. In a new ask-me-anything (AMA) session, the quantitative analyst tells his 82,400 YouTube subscribers that the approval of spot market Bitcoin exchange-traded funds (ETFs) could cause the crypto king to surge to new [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/18/one-catalyst-could-send-bitcoin-flying-to-new-all-time-high-in-four-months-according-to-quant-analyst-planb/\">One Catalyst Could Send Bitcoin Flying to New All-Time High in Four Months, According to Quant Analyst PlanB</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-18T20:55:59.000Z",
    "title": "Crypto Analyst Nicholas Merten Says Altcoin Cycle ‘Likely To Come Soon’ – But There’s a Catch",
    "url": "https://dailyhodl.com/2023/12/18/crypto-analyst-nicholas-merten-says-altcoin-cycle-likely-to-come-soon-but-theres-a-catch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Three-Scenarios-for-Crypto-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Three-Scenarios-for-Crypto-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Three-Scenarios-for-Crypto-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Three-Scenarios-for-Crypto-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Three-Scenarios-for-Crypto-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Three-Scenarios-for-Crypto-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Three-Scenarios-for-Crypto-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says the next altcoin cycle is likely around the corner but notes that there may be a pullback first. In a new strategy session, Nicholas Merten, the host of DataDash, tells his 511,000 YouTube subscribers that key indicators suggest the total market cap of all crypto assets sans the top [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/18/crypto-analyst-nicholas-merten-says-altcoin-cycle-likely-to-come-soon-but-theres-a-catch/\">Crypto Analyst Nicholas Merten Says Altcoin Cycle ‘Likely To Come Soon’ – But There’s a Catch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-18T20:08:06.000Z",
    "title": "Fuse Network To Launch ZK-Powered Layer-Two Using Polygon CDK",
    "url": "https://dailyhodl.com/2023/12/18/fuse-network-to-launch-zk-powered-layer-two-using-polygon-cdk/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-Fuse-Network-Industry-Announcement-Featured-Image-Template.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-Fuse-Network-Industry-Announcement-Featured-Image-Template.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-Fuse-Network-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-Fuse-Network-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-Fuse-Network-Industry-Announcement-Featured-Image-Template.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-Fuse-Network-Industry-Announcement-Featured-Image-Template.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-Fuse-Network-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-Fuse-Network-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-Fuse-Network-Industry-Announcement-Featured-Image-Template.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-Fuse-Network-Industry-Announcement-Featured-Image-Template.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Tel Aviv, Israel In a groundbreaking collaboration, Fuse Network, a leading layer-one blockchain player specializing in scaling Web 3.0 payments, has teamed up with Polygon Labs, a globally acclaimed blockchain technology firm. Fuse embarks on an ambitious journey to create an innovative Ethereum-based ZK (zero-knowledge) layer-two network, utilizing the formidable capabilities of the Polygon CSK [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/18/fuse-network-to-launch-zk-powered-layer-two-using-polygon-cdk/\">Fuse Network To Launch ZK-Powered Layer-Two Using Polygon CDK</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-18T19:45:46.000Z",
    "title": "Lead Shiba Inu Developer Teases New ‘Partnershib,’ Outlines Plan for SHIB To Be Adopted Worldwide Perpetually",
    "url": "https://dailyhodl.com/2023/12/18/lead-shiba-inu-developer-teases-new-partnershib-outlines-plan-for-shib-to-be-adopted-worldwide-perpetually/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Vanishes-in-Just-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Vanishes-in-Just-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Vanishes-in-Just-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Vanishes-in-Just-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Vanishes-in-Just-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Vanishes-in-Just-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Vanishes-in-Just-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Pseudonymous Shiba Inu (SHIB) lead developer Shytoshi Kusama is proposing a strategy to onboard more people into the dog-inspired crypto asset as billions of the memecoin’s tokens are burned. In a series of tweets on social media platform X, Shytoshi Kusama lays out a plan to spur the perpetual global adoption of Shiba Inu. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/18/lead-shiba-inu-developer-teases-new-partnershib-outlines-plan-for-shib-to-be-adopted-worldwide-perpetually/\">Lead Shiba Inu Developer Teases New ‘Partnershib,’ Outlines Plan for SHIB To Be Adopted Worldwide Perpetually</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-18T19:41:09.000Z",
    "title": "Coinbase Says Crypto Industry Super PAC Has Raised Over $78,000,000 To Help Elect Friendly Candidates in the US",
    "url": "https://dailyhodl.com/2023/12/18/coinbase-says-crypto-industry-super-pac-has-raised-over-78000000-to-help-elect-friendly-candidates-in-the-us/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/coinbase-will-happily-staking.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/coinbase-will-happily-staking.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/coinbase-will-happily-staking.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/coinbase-will-happily-staking.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/coinbase-will-happily-staking.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/coinbase-will-happily-staking.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/coinbase-will-happily-staking.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The largest US-based crypto exchange by trading volume says a crypto-funded and focused Super PAC (political action committee) is raising millions to support crypto-friendly politicians. According to a new company blog post, Coinbase says that the crypto industry has raised $78 million in the fourth quarter of this year to support &#8220;pro-innovation&#8221; candidates in the upcoming [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/18/coinbase-says-crypto-industry-super-pac-has-raised-over-78000000-to-help-elect-friendly-candidates-in-the-us/\">Coinbase Says Crypto Industry Super PAC Has Raised Over $78,000,000 To Help Elect Friendly Candidates in the US</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]