[
  {
    "source": "CoinDesk",
    "date": "2023-10-02T07:47:26.000Z",
    "title": "FTX 'Hacker' Moved 15K ETH This Weekend",
    "url": "https://www.coindesk.com/tech/2023/10/02/ftx-hacker-moved-15k-eth-this-weekend/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "More than 15,000 ether (ETH) worth close to $26 million left a wallet associated with last year's attack on FTX this weekend."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-02T07:57:09.000Z",
    "title": "FTX hacker moves $38M in ETH just days before SBF trial start",
    "url": "https://cryptoslate.com/ftx-hacker-moves-38m-in-eth-just-days-before-sbf-trial-start/",
    "description": "<p>A wallet associated with the hack of the bankrupt FTX exchange moved about $38 million in Ethereum (ETH) since it became active during the weekend, with Sam Bankman-Fried&#8217;s trial about to commence. On-chain data shows that the attacker came to live on Sept. 30 when it first transferred 6,250 ETH, worth $10.46 million, in three [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ftx-hacker-moves-38m-in-eth-just-days-before-sbf-trial-start/\">FTX hacker moves $38M in ETH just days before SBF trial start</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-02T07:54:15.000Z",
    "title": "FTX Hacker Abruptly Begins Moving Millions Worth Of Stolen ETH",
    "url": "https://cryptodaily.co.uk/2023/10/ftx-hacker-abruptly-begins-moving-millions-worth-of-stolen-eth",
    "description": "FTX was hacked in November 2022, hours after it declared bankruptcy, and founder Sam Bankman-Fried stepped down from his position as CEO."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-02T08:00:35.000Z",
    "title": "Bitcoin Price Skyrockets Past $28,000, Here’s Why",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-skyrockets-past-28000-heres-why/",
    "description": "The Bitcoin price trajectory has once again taken a sharp upward turn, marking its ascent past the $28,000 landmark for the first time since its notable surge on August 29. This prior leap had been attributed to Grayscale&#8217;s triumph over the US Securities and Exchange Commission (SEC) in their legal battle regarding the Bitcoin Trust (GBTC) conversion to a spot ETF. In a striking demonstration of Bitcoin&#8217;s infamous volatility, the BTC experienced a price escalation of over $800 within a minuscule 5-minute window on Sunday evening, rocketing from $27,250 to a peak of $28,053 between 6:15 and 6:20 pm ET. Why Is Bitcoin Price Up Today? One primary catalyst behind this dramatic price movement, as pinpointed by the esteemed crypto analyst Byzantine General, is the phenomenon known as a &#8220;short squeeze.&#8221; In the realm of futures trading, a short squeeze is characterized by a rapid price increase, forcing traders who had bet against the asset&#8217;s price (short sellers) to buy it to prevent further losses. This reactive buying can intensify the asset&#8217;s price jump. Related Reading: Bitcoin Price To Reach $170,000 in 2025 – Mathematical Model Predicts During yesterday&#8217;s surge, a staggering $392 million in Bitcoin short positions, or about 7.7% of the total open interest in the market, were swiftly liquidated. Byzantine General further elaborated on the market&#8217;s resilience, observing that the Bitcoin open interest bounced back swiftly with an increment of $350 million, humorously suggesting the market&#8217;s willingness to embrace such a volatile maneuver again: &#8220;The whole market was actually like ‘I&#8217;ll fucking do it again.&#8221; Crypto analyst Fabian D. deepened the analysis by pointing out the intricate interplay between short sellers being ousted and the potential for further Bitcoin appreciation. He indicated that the upward trajectory of Bitcoin from this point hinges on two primary factors: the entry of spot buyers driven by the fear of missing out (FOMO) and whether short sellers decide to re-establish their positions. Fabian also alluded to the absence of institutional buying activity in the week preceding this surge but underscored the importance of monitoring premium rates on platforms like Coinbase and CME upon market opening today. Adding to the complexity of the market landscape, Fabian flagged two impending events: the anticipation surrounding the Ethereum Future ETF inflows, and the court hearing concerning the Celsius platform, which might potentially refocus attention on its creditor distributions. Drawing insights from on-chain data, analyst Maartunn introduced another layer of optimism, noting that &#8220;Net Taker Volume has crossed into the green zone, indicating that buyers are in control. The last time was four months ago.&#8221; Diving into granular analytics, quant trader Skew shed light on the dynamics at play on platforms like Binance and Bybit. He emphasized that the recent price upswing wasn&#8217;t entirely unforeseen, particularly given the noticeable shift away from short positions and the robust perpetual bid leading up to the spike. Related Reading: Bitcoin News: BTC Price Drops To $2,700 On Binance, CZ Explains Why Looking at the Bitcoin aggregate CVDs &#38; delta, he further noted: &#8220;Mostly seeing sell pressure just in perps for now. Price decline with Perp CVD decline &#38; Perp sell delta picking up. Next move that decides the fate of this entire move is spot.&#8221; Highlighting the evolving market dynamics, Skew pointed out that the BTC Binance Spot exhibited a notably broad order book with a significant amount of available and resting liquidity. He inferred that such a setup could lead to more pronounced price reactions. Highlighting the evolving market dynamics, Skew remarked that the BTC Binance spot market exhibits a notably broad order book with a significant amount of available and resting liquidity. He inferred that such a setup could lead to another pronounced price reaction. &#8220;Increasing ask liquidity on spot order books; implies greater volume needed by spot takers to clear $28K &#8211; $29K (Market structure shift),&#8221; he warned. It is also interesting to note that the price movement was already evident in the 1-day chart. As explained in the last Bitcoin price analyses, the price broke through the (black) downtrend line established in mid-July last Thursday. While the successful re-test of the trendline took place on Friday and Saturday, confirming the bullish momentum, the expected bounce occurred yesterday. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-02T08:00:05.000Z",
    "title": "Time to Get Bullish on Solana? An In-Depth Analysis",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/time-to-get-bullish-on-solana-an-in-depth-analysis/",
    "description": "<p>The current bear market has affected many projects. In particular, Solana had a rough time. For example, they had regular platform outages. However, what almost did them completely in, was the FTX collapse. From an ATH of $259 in November 2021. SOL nosedived to under $10 in December 2022. Their TVL plummeted by 96%. However, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/time-to-get-bullish-on-solana-an-in-depth-analysis/\">Time to Get Bullish on Solana? An In-Depth Analysis</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-02T07:40:44.000Z",
    "title": "FTX Wasn’t a Ponzi Scheme but a Real Business: Said American Author",
    "url": "https://coinedition.com/ftx-wasnt-a-ponzi-scheme-but-a-real-business-said-american-author/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Former-SSS-Agent-Warns-FTX-Client.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX Takes Legal Action: Sues Ex-Clinton Aide Firm K5 Global for $700M\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Former-SSS-Agent-Warns-FTX-Client.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Former-SSS-Agent-Warns-FTX-Client-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Former-SSS-Agent-Warns-FTX-Client-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Former-SSS-Agent-Warns-FTX-Client-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Former-SSS-Agent-Warns-FTX-Client-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Former-SSS-Agent-Warns-FTX-Client-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bankrupt crypto exchange FTX wasn’t a Ponzi scheme and had great real business, according to best-selling American author Michael Lewis. In an interview with CBS News, Lewis shared his stories of meeting FTX’s former CEO, Sam Bankman-Fried, and claimed that people were “misreading him.” Lewis stated that FTX’s fall was a “financial collapse” and said, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ftx-wasnt-a-ponzi-scheme-but-a-real-business-said-american-author/\">FTX Wasn’t a Ponzi Scheme but a Real Business: Said American Author</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]