[
  {
    "source": "Decrypt",
    "date": "2023-09-12T13:01:02.000Z",
    "title": "Unicorn Avatar Startup Genies Reveals $500K Digital Fashion Fund",
    "url": "https://decrypt.co/155948/unicorn-avatar-startup-genies-reveals-500k-digital-fashion-fund",
    "description": "Genies will give digital fashion creators a chance to earn cash while potentially co-creating with artists like Khalid and Banks."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-12T13:01:00.000Z",
    "title": "Are NFT markets in a death spiral or ready for a resurgence?",
    "url": "https://cointelegraph.com/news/are-nft-markets-in-a-death-spiral-or-ready-for-a-resurgence",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/9a3818df-41f3-4eda-9367-29f850870ef2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>NFTs have taken a massive hit since the 2021 bull market, but some experts say they could make a comeback.  </p>\n                    <p><p>Nonfungible tokens (NFTs) saw a massive surge in popularity in 2021, accompanied by sky-high prices, but the market has since <a href=\"https://cointelegraph.com/news/nft-markets-are-out-of-balance-with-sellers-dominating\">come crashing back to earth</a>, and it’s unclear whether there will be a resurgence. </p><p>NFTs are unique digital tokens recorded on a blockchain to certify ownership and authenticity. They can’t be copied or substituted but can be transferred and sold by their owner. </p><p>According to analytics platform NFTGo, the NFT market cap valued in Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) is <a href=\"https://nftgo.io/analytics/market-overview\" target=\"_blank\" rel=\"noopener nofollow\">down</a> 40.59% over the past year at the time of writing, with trading volume down 40.81%. </p><p>The market cap in U.S. dollars is down 41.16%, and its volume has dropped 66.77%. At the same time, market sentiment is ranked 13 out of 100, with an overall rating of “cold.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/6711ba5f-d7cc-42a5-9aa5-7deee29ec87b.jpg\"  /><figcaption style=\"text-align: center;\">The NFT market has fallen even further in the latter half of 2023. Source: NFTGo</figcaption></figure><p><a href=\"https://cointelegraph.com/news/hashing-it-out-podcast-what-does-the-future-hold-for-bnb-chain\">Arno Bauer</a>, senior solution architect at BNB Chain, told Cointelegraph that from a utility perspective, NFT projects are increasingly adding value and that this growth in functionality is where the future of NFTs likely lies. </p><p>Bauer said the NFT market is showing “promising signs of innovation and creativity,” which holds great potential for the growth and evolution of the tech.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/nft-sec-says-nfts-are-securities-triggers-community-feedback\"><strong><em>Crypto lawyer about SEC: ‘Problematic to imply all NFTs are securities’</em></strong></a></p><p>“Market sentiment, cultural shifts towards digital ownership, and the potential for NFTs to be integrated into various aspects of our lives also contribute to a positive outlook for the future of NFTs,” he said.</p><p>“While current market conditions might seem subdued, the ongoing innovation and potential for integration with both digital and physical worlds suggest that NFTs have not had their day and that their continued relevance and growth are highly probable,” Bauer added.</p><h2>NFTs in the long term</h2><p>As for long-term use cases, Bauer said NFTs will “likely evolve” over time and become increasingly linked to real-world assets, such as property ownership or unique physical goods.</p><p>Currently, NFTs have been most successful in <a href=\"https://cointelegraph.com/innovation-circle/fueled-by-artistic-passion-nfts-have-found-a-permanent-home-in-the-art-world\">the art world</a>, with some selling for tens of millions of dollars.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/a43e4a43-a60e-41f0-8bfe-a341edb868b5.png\"  /></figure><p>Digital artist Pak <a href=\"https://cointelegraph.com/news/top-secret-julian-assange-and-pak-nft-collaboration-is-wikileaked\">sold an NFT project</a> titled “The Merge” for $91.8 million on Nifty Gateway in 2021, while Mike Winkelmann, also known as Beeple, sold “Everydays: The First 5000 Days” <a href=\"https://cointelegraph.com/news/beeple-nft-auction-closes-at-record-setting-69-3m\">for $69.3 million via Christie’s</a> auction house the same year. </p><p>Blockchain games also use NFTs to represent in-game items such as weapons and armor, and there is speculation <a href=\"https://cointelegraph.com/news/are-nfts-coming-soon-to-your-favorite-video-games\">the tech will make the jump</a> to mainstream games. <a href=\"https://cointelegraph.com/news/music-nfts-are-helping-independent-creators-monetize-and-build-a-fanbase\">Various types of music assets</a> are also being sold as one-of-a-kind NFTs.</p><p>Bauer thinks that as more robust technology provides enhanced use cases and ownership security, NFTs will likely become more attractive to mainstream markets.</p><p>He speculated that NFTs could link to financial instruments, representing shares in companies or investment funds, and social achievements, where they could symbolize badges of accomplishment in various fields.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/8bb4ded4-60a4-4d85-aad6-4bf4b508a3d7.jpg\"  /></figure><p>“Beyond art, the ability to tokenize unique assets and provide verifiable ownership will create numerous applications across various domains,” Bauer said.</p><blockquote>“Collaborations with traditional industries, technological advancements, clear regulatory frameworks and educational efforts can significantly boost NFT utility and adoption.”</blockquote><p>“Addressing sustainability concerns could make them more appealing to a broader audience,” he added.</p><h2>NFTs have the potential to make a comeback </h2><p>Jason Bailey, co-founder and CEO of NFT tool and self-custody solution ClubNFT, told Cointelegraph he thinks “NFTs will come back and go mainstream” because crypto and NFTs rebound cyclically, just like previous tech crashes. </p><p>According to data gathering platform Statista, the NFT market is <a href=\"https://www.statista.com/outlook/dmo/fintech/digital-assets/nft/worldwide\" target=\"_blank\" rel=\"noopener nofollow\">projected</a> to continue growing in <a href=\"https://cointelegraph.com/news/nft-market-well-positioned-to-grow-35-into-a-13-6b-industry-by-2027\">revenue, users and market capitalization</a>. </p><p>As of 2023, there are 13.95 million NFT users, but that’s expected to hit 19.31 million users by 2027.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/613283e4-e0a2-4592-812b-bb680886d86c.jpg\"  /></figure><p>However, Bailey believes NFTs currently have some issues, most of which were amplified by rampant market speculation, that need to be solved before NFTs can go mainstream. </p><p>He said NFTs and the ecosystem around them are so complex that almost everyone is still vulnerable to many risks they may not even know about. </p><p>“Many of us have been trying to educate and onboard people into the space thoughtfully so they can be safe, but the truth is that NFTs won’t go mainstream until the complexity is replaced with a safe-by-default easy path,” Bailey said. </p><blockquote>“For example, the vast majority of people don’t realize that an NFT is almost always at risk in a sense, except for fully on-chain NFTs, which are a truly tiny fraction.”</blockquote><p>“The steps needed to protect the art from disappearing, and prevent the NFT from breaking, are complicated, time-consuming and error-prone,” he added.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ai-based-tools-bring-security-and-transparency-to-the-nft-market\"><strong><em>AI-based tools bring security and transparency to the NFT market</em></strong></a></p><p>Bailey believes that in the long term, NFTs or similar tech could prove invaluable in validating digital documents such as marriage certificates, diplomas and licenses.</p><p>Overall, he thinks NFTs solve too many of the current problems associated with digital ownership — including scarcity, authentication, provenance and provable ownership — to be ignored. </p><p>“We need to build infrastructure now, during the bear market, for smoother onboarding and to protect NFT adopters from malicious actors in the next NFT bull market,” he said. </p><blockquote>“Once these issues are solved, NFTs will absolutely go mainstream because the train of digital ownership left the station decades ago, and there is no stopping it.”</blockquote><h2>Meaningful projects could be a game changer for NFTs </h2><p>Speaking to Cointelegraph, Andy Ku, founder and CEO of digital content Web3 ecosystem Altava Group, said he thinks the previous highs in the NFT market were based on a hype cycle, so it’ll be hard for an individual NFT to reach such lofty heights again.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">asked google bard to write me some tweets about NFT market right now...  <br><br>mf really went for the throat on these...  <a href=\"https://t.co/aLjUbwH3gT\">pic.twitter.com/aLjUbwH3gT</a></p>&mdash; beeple (@beeple) <a href=\"https://twitter.com/beeple/status/1694060761176265038?ref_src=twsrc%5Etfw\">August 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to CoinGecko, many of the top NFT collections have seen significant drops in value over the past year. </p><p>At the time of writing, <a href=\"https://www.coingecko.com/en/nft/bored-ape-yacht-club\" target=\"_blank\" rel=\"noopener nofollow\">Bored Ape Yacht Club</a> has fallen by 67.1%, <a href=\"https://www.coingecko.com/en/nft/cryptopunks\" target=\"_blank\" rel=\"noopener nofollow\">CryptoPunks</a> by 33.2%, <a href=\"https://www.coingecko.com/en/nft/mutant-ape-yacht-club\" target=\"_blank\" rel=\"noopener nofollow\">Mutant Ape Yacht Club</a> by 59.2% and <a href=\"https://www.coingecko.com/en/nft/azuki\" target=\"_blank\" rel=\"noopener nofollow\">Azuki</a> by 49.3%.</p><p>Ku believes that if we can see more meaningful NFT projects on the market offering tangible benefits to more people, then it’s possible to have the combined volume bring the overall market value up.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/innovation-circle/whats-next-for-nfts-and-web3-in-the-age-of-the-creator-economy\"><strong><em>What’s next for NFTs and Web3 in the age of the creator economy?</em></strong></a></p><p>“NFTs should offer value and utility beyond just a digital art or PFP. The two areas I particularly believe in are asset-backed NFTs and a membership NFT,” he said. </p><blockquote>“NFT’s core value of being an immutable representation of something is a great fit for assets and membership.”</blockquote><p>NFTs for subscription, membership-based models and loyalty programs are starting to gain traction, with examples in <a href=\"https://cointelegraph.com/news/gym-owners-aim-to-bring-nft-memberships-to-wellness-clubs\">hospitality venues and gyms</a> already on the market.</p><p>“In terms of asset-backed NFTs, master artworks, real estate and precious metals like gold are all good examples of assets in which people believe,” Ku said. </p><p>“NFTs would make a great proof-of-ownership for these assets as well as being extremely portable,” he added.</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-12T13:00:00.000Z",
    "title": "Manta Network's L2 hits mainnet to drive ZK-enabled DApp development",
    "url": "https://cointelegraph.com/news/manta-network-zk-layer2-hits-mainnet",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/6db1b850-3684-4927-8c71-7071aa516170.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Manta Network has launched its zero-knowledge proof layer 2 scaling network which promises lower fees and higher throughput for developers looking to deploy decentralized applications. </p>\n                    <p><p>The ecosystem of layer 2 blockchain solutions powered by zero-knowledge proofs welcomes a new player as Manta Network takes its ZK-as-a-service platform live.</p><p>Manta Pacific is a modular L2 aimed at powering EVM-native decentralized applications (DApps) using ZK-proof technology. The platform offers a software development kit and ZK library that is touted to provide plug-and-play functionality for developers. </p><p>Being EVM-native means that apps deployed on Ethereum can be deployed on Manta Pacific and vice versa, while being ZK-enabled provides low gas fees and scalability. Users can also bridge Ethereum to Manta to begin exploring its development environment. </p><p>Related: Manta Network developer raises $25M in Series A, launches layer 2 for ZK apps</p><p>With industry peers including the likes of Consensys’ Linea zkEVM, Polygon zkEVM, Starknet, Coinbase’s Base and zkSync Era, there are a number of ZK-proof L2 solution options available to Web3 developers. </p><p>Speaking to Cointelegraph following the mainnet launch, Manta Network core contributor Kenny Li said that the different ZK-rollip L2s offer different value propositions that aim to solve significant problems being faced by developers.</p><blockquote>“We think that in the mid to long term, the market will converge to a small number of available solutions that are focused on making it as easy as possible for developers to build and deploy ZK-enabled applications.”</blockquote><p>Li added that the Web2 world of technology followed a similar evolution with the success of software-as-a-service models where a plug-and-play approach was taken:</p><blockquote>“This is crucial when zero knowledge is involved whereby developers do not have to worry about the infrastructure as the complexity of cryptography can be abstracted away.”</blockquote><p>According to the Manta Network core contributor, Manta Pacific has been in development for nine months while its testnet launch in July 2023 has seen the creation of 150,000 wallets and over 3.5 million transactions.</p><p>Manta raised $25 million from investors in July 2023 aimed at scaling the project’s network and use cases with an eye on driving adoption in the Asian market.</p><p><a href=\"https://cointelegraph.com/magazine/ethereums-layer-2-zk-rollups-can-become-interoperable/\"><em>Magazine: Here’s how Ethereum’s ZK-rollups can become interoperable</em></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-12T12:47:22.000Z",
    "title": "Why is Ethereum (ETH) price up today?",
    "url": "https://cointelegraph.com/news/why-is-ethereum-eth-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-01/62a9e911-43a2-4cc4-92a1-f4819d8f0db5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ethereum price is up today, recovering entirely from yesterday's selloff amid waning FTX liquidation concerns.</p>\n                    <p><p>Ethereum's native token, Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), gained over 4.5% to reach $1,622 on Sep. 12 despite falling to its lowest level in six months the day before.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/e826674d-c9eb-4320-8a6a-d978757ff9a9.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USD daily price chart. Source: TradingView</em></figcaption></figure><p>The ETH price recovery on Sep. 12 occurred as worries about a <a href=\"https://cointelegraph.com/news/solana-price-down-amid-ftx-liquidation-fears\">potential FTX liquidation</a> receded. </p><h2>Ethereum market can absorb potential FTX dump </h2><p>New <a href=\"https://restructuring.ra.kroll.com/FTX/Home-DownloadPDF?id1=MjUxODI3OA==&amp;id2=-1\" target=\"_blank\" rel=\"noopener nofollow\">FTX court filings</a> on Sep. 11 showed that it holds $3.4 billion worth of cryptocurrencies, including $1.16 billion in Solana (SOL), $560 million in Bitcoin (BTC), and $192 million in Ether. The defunct crypto exchange has requested a New York court to sell its crypto holdings to refund creditors.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/a45c3629-136f-4dd5-9126-1bb136cc1ac5.jpeg\"  /><figcaption style=\"text-align: center;\"><em>FTX Digital Asset A Holdings screenshot. Source: FTX</em></figcaption></figure><p>The court will respond to the request on Sep. 12 as some <a href=\"https://cointelegraph.com/news/solana-price-down-amid-ftx-liquidation-fears\">believe</a> that the approval to sell $3.4 billion worth of crypto assets could spark a market crash. </p><p>However, researchers at crypto analytics platform Messari <a href=\"https://messari.io/report/ftx-liquidations-update?referrer=research-reports\" target=\"_blank\" rel=\"noopener nofollow\">argue</a> that FTX will not negatively impact the crypto market, noting that their holdings comprise mostly illiquid and locked assets. For example, only $9.2 million worth of SOL gets unlocked per month, which is absorbable by the market.</p><p>Also, as Messari explained, FTX's $353 million BTC holdings are roughly 1% of the coin's weekly traded volume. That means the market will likely absorb much of the Bitcoin and Ether sell-pressure</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/682bc603-406c-4319-8c6e-d39449242d52.png\"  /><figcaption style=\"text-align: center;\"><em>FTX crypto holdings and their weekly trading volumes. Source: Messari</em></figcaption></figure><p>That perhaps explains why, as of Sep. 12, Ether price has recovered the entire losses it suffered a day before.</p><h2>Short liquidations overpower longs</h2><p>The Ethereum market gains on Sep. 12 coincide with a run-up in the short liquidations across Ether-linked derivatives.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/4f06ead1-3f74-4808-a96e-8ab3ac212036.png\"  /><figcaption style=\"text-align: center;\"><em>ETH total liquidations chart. Source: CoinGlass</em></figcaption></figure><p>Notably, Ether has liquidated $8.37 million worth of short positions versus $1.66 million in long positions on Sep. 12. Short sellers liquidate their positions by buying the underlying asset. Therefore, the combination to new buyers and short liquidations have pushed up the price of ETH. </p><h2>Oversold bounce</h2><p>Ether's daily relative strength index (RSI) dropped below 30 on Sep. 11, which traditional analysts view as an \"oversold\" zone.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/172b9808-39c7-49dd-8ed7-88a19282f0ff.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USD daily price chart. Source: TradingView</em></figcaption></figure><p>In addition, ETH price bounce has originated from an important locsupport level of $1,545. </p><h2>Ethereum technical analysis for September 2023</h2><p>Ethereum's latest bounce has brought its price closer to testing its falling wedge's upper trendline for a potential breakout.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-price-must-take-26k-says-trader-after-textbook-short-squeeze\">Bitcoin price must take $26K, trader says after ‘textbook short squeeze’</a></em></strong></p><p><a href=\"https://cointelegraph.com/news/falling-wedge-pattern-points-to-eventual-ethereum-price-reversal-but-traders-expect-more-pain-first\">Falling Wedges</a> are bearish reversal patterns characterized by the price consolidating  between two descending, converging trendlines. They typically resolve after the price breaks above the upper trendline and rises by as much as the wedge's maximum height. </p><p>As a result of this technical setup, Ether's decisive close above the upper trendline may lead to $1,740 in September, up over 8% from current price levels. What's more, the level coincides with ETH's 50-day exponential moving average (50-day EMA; the red wave in the chart below).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/be6c4cf5-daba-4fb7-987d-a419b3ce63fc.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USD daily price chart. Source: TradingView</em></figcaption></figure><p>Conversely, a pullback from the falling wedge's upper trendline risks dropping the ETH price near the lower trendline around $1,500 for a potenti 8% decline in September.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-12T13:00:26.000Z",
    "title": "Class action case against Bitfinex gets dismissed, marking another legal win",
    "url": "https://cryptoslate.com/class-action-case-against-bitfinex-gets-dismissed-marking-another-legal-win/",
    "description": "<p>Crypto exchange Bitfinex has secured another significant legal victory, as a class action lawsuit against it was dismissed by Chief Judge Laura Taylor Swain of the U.S. District Court for the Southern District of New York, according to a statement from the Bitfinex blog on Sept 12. The lawsuit filed by Shawn Dolifka, a plaintiff [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/class-action-case-against-bitfinex-gets-dismissed-marking-another-legal-win/\">Class action case against Bitfinex gets dismissed, marking another legal win</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-12T13:05:54.000Z",
    "title": "Vitalik confirms X hack as a sim swap",
    "url": "https://cryptodaily.co.uk/2023/09/vitalik-confirms-x-hack-as-a-sim-swap",
    "description": "After recovering his X (Twitter) account, Ethereum co-founder Vitalik Buterin let it be known that the hack of his account was achieved by way of a sim swap."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-12T12:59:57.000Z",
    "title": "New Crypto Project ETH20 Launches Presale with Stake-to-Earn Rewards, Plans to Repeat Ethereum Bull Run",
    "url": "https://cryptodaily.co.uk/2023/09/new-crypto-project-eth20-launches-presale-with-stake-to-earn-rewards-plans-to-repeat-ethereum-bull-run",
    "description": "We stand on the precipice of a monumental leap in cryptocurrency innovation as we announce the impending presale of the ETH20 token. No mere newcomer, ETH20 is a heartening homage to Ethereum's roots and a testament to its remarkable trajectory to date!"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-12T12:40:44.000Z",
    "title": "MixMarvel and Yeeha Games Announce Trailblazing Partnership at Exclusive TOKEN2049 Side Event",
    "url": "https://cryptodaily.co.uk/2023/09/mixmarvel-and-yeeha-games-announce-trailblazing-partnership-at-exclusive-token2049-side-event-3",
    "description": "MixMarvel and Yeeha Games Announce Trailblazing Partnership at Exclusive TOKEN2049 Side Event"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-12T12:55:44.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-12T12:54:05.000Z",
    "title": "The Rollercoaster Ride of Crypto Gaming Tokens: From Highs to Lows in a Billion-Dollar Industry",
    "url": "https://www.cryptopolitan.com/the-rollercoaster-ride-of-crypto-gaming/",
    "description": "In recent years, the world of crypto gaming tokens has experienced a rollercoaster ride marked by both exhilarating highs and disheartening lows. However, as of late, the crypto gaming market has been facing some challenging times due to sluggish market conditions. According to data sourced from CoinMarketCap, the collective valuation of tokens within this space ... <a title=\"The Rollercoaster Ride of Crypto Gaming Tokens: From Highs to Lows in a Billion-Dollar Industry\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-rollercoaster-ride-of-crypto-gaming/\" aria-label=\"More on The Rollercoaster Ride of Crypto Gaming Tokens: From Highs to Lows in a Billion-Dollar Industry\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-12T12:50:35.000Z",
    "title": "AI Innovation Soars in Medical Technology Sector, Report Reveals",
    "url": "https://www.cryptopolitan.com/ai-innovation-soars-in-medical-technology/",
    "description": "Artificial Intelligence (AI) is rapidly transforming industries worldwide, but recent findings published by intellectual property firm Marks &#38; Clerk underscore that the medical technology (medtech) sector is emerging as a leader in AI innovation. The report highlights a remarkable surge in AI-based patent applications filed by the medtech sector, nearly quadrupling since 2018 to reach ... <a title=\"AI Innovation Soars in Medical Technology Sector, Report Reveals\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-innovation-soars-in-medical-technology/\" aria-label=\"More on AI Innovation Soars in Medical Technology Sector, Report Reveals\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-12T13:09:10.000Z",
    "title": "Meta announces new metaverse program with US universities",
    "url": "https://crypto.news/meta-announces-new-metaverse-program-with-us-universities/",
    "description": "The social media giant launches a new teaching program in the US, anticipating growing momentum for VR education tools in Europe. Meta, the parent company of Facebook and Instagram, is launching a new program for teachers in the US to&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-12T13:03:21.000Z",
    "title": "Chainalysis: Central, Southern Asia and Oceania dominate crypto adoption",
    "url": "https://crypto.news/chainalysis-central-southern-asia-and-oceania-dominate-crypto-adoption/",
    "description": "Central &#38; Southern Asia and Oceania (CSAO) lead the crypto adoption index, contributing six countries on the top ten list of Chainalysis&#8217; latest index. Chainalysis has shared its recent report with crypto.news. As in previous cases, the paper evaluates the&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-12T12:59:53.000Z",
    "title": "Ethereum price can drop to $1,000 over FTX, analyst warns",
    "url": "https://crypto.news/ethereum-price-can-drop-to-1000-over-ftx-analyst-warns/",
    "description": "A Matrixport analyst envisions a scenario, where Ethereum price can &#8220;materially drop lower&#8221; by the end of the year. Ethereum (ETH) price can go down to the $1,000 mark should the cryptocurrency decline below $1,500 amid a possible sell-off initiated&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-12T12:48:27.000Z",
    "title": "Alex Mashinsky seeks to drop FTC’s complaint entirely",
    "url": "https://crypto.news/alex-mashinsky-seeks-to-drop-ftcs-complaint-entirely/",
    "description": "Celsius Network CEO has asked the court to dismiss the complaints by the US Federal Trade Commission (FTC) against him, claiming that he did not violate any law.  Co-founder and former CEO of bankrupt crypto lending platform Celsius Network Alex&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-12T13:00:33.000Z",
    "title": "Cryptos in the Spotlight: Domini’s Surge, Ethereum’s Mastery & Litecoin’s Radiance!",
    "url": "https://www.crypto-news-flash.com/cryptos-in-the-spotlight-dominis-surge-ethereums-mastery-litecoins-radiance/?utm_source=rss&utm_medium=rss&utm_campaign=cryptos-in-the-spotlight-dominis-surge-ethereums-mastery-litecoins-radiance",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-5-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-5-1.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-5-1-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The global financial landscape is profoundly transforming, with digital assets at the forefront of this evolution. In this landscape,  three standout players have captured the spotlight: Domini.art ($DOMI), Ethereum ($ETH), and Litecoin ($LTC). These digital assets have made significant strides in their respective niches, revolutionizing how we view investments, art ownership, and decentralized finance.  BUY [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-12T13:00:21.000Z",
    "title": "Ripple’s Fortress Trust Hacked: What Lies Beneath the Crypto Breach?",
    "url": "https://www.crypto-news-flash.com/ripples-fortress-trust-hacked-what-lies-beneath-the-crypto-breach/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-fortress-trust-hacked-what-lies-beneath-the-crypto-breach",
    "description": "<img width=\"1280\" height=\"819\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-768x491.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Fortress Trust, recently purchased by Ripple, experiences a security breach; Ripple confirms while Fortress remains silent. BitGo&#8217;s CEO, Mike Belshe, clarifies that BitGo was not involved in the security lapse, emphasizing the importance of decentralization. BitGo&#8217;s CEO Unravels Fortress Trust&#8217;s Security Dilemma In a recent turn of events, Mike Belshe, the esteemed CEO of BitGo, [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-12T12:58:48.000Z",
    "title": "This is How Vitalik Butherin’s Twitter account was Hacked.",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/this-is-how-vitalik-butherins-twitter-account-was-hacked/",
    "description": "<p>In a surprising turn of events, his Twitter account was hacked, leading to a series of tweets that left the crypto community in shock. Buterin, known for his deep understanding of blockchain security, claimed ignorance of Twitter&#8217;s OTP (One-Time Password) authentication, adding an ironic twist to the incident. Let&#8217;s discover more about this curious case. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/this-is-how-vitalik-butherins-twitter-account-was-hacked/\">This is How Vitalik Butherin&#8217;s Twitter account was Hacked.</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-12T13:01:00.000Z",
    "title": "Uniswap Becomes Top DEX on Polygon as Whale Transactions Heighten",
    "url": "https://coinedition.com/uniswap-becomes-top-dex-on-polygon-as-whale-transactions-heighten/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Uniswap_labs_announced_that_theyve_raised_165_million.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Uniswap_labs_announced_that_theyve_raised_165_million.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Uniswap_labs_announced_that_theyve_raised_165_million-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Uniswap_labs_announced_that_theyve_raised_165_million-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Uniswap_labs_announced_that_theyve_raised_165_million-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Uniswap_labs_announced_that_theyve_raised_165_million-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Uniswap_labs_announced_that_theyve_raised_165_million-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Uniswap (UNI) grabbed 42% of all the DEX volume on Polygon (MATIC), making it the top Automated Market Maker (AMM) operating on Polygon. The landmark was shared by Uniswap Labs on X (formerly Twitter). According to the post, Uniswap’s DEX volume was as high as $213 million in the last seven days. Uniswap Leads One [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/uniswap-becomes-top-dex-on-polygon-as-whale-transactions-heighten/\">Uniswap Becomes Top DEX on Polygon as Whale Transactions Heighten</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]