[
  {
    "source": "CryptoSlate",
    "date": "2023-08-30T12:45:25.000Z",
    "title": "Kenya clamps down on Worldcoin over national security and tax evasion concerns",
    "url": "https://cryptoslate.com/kenya-clamps-down-on-worldcoin-over-national-security-and-tax-evasion-concerns/",
    "description": "<p>Kenya&#8217;s National Computer Cybercrimes Coordination Committee (NC4) warned that Worldcoin activities pose national and economic security challenges to the African country, local media outlet Standard Media reported. Threats posed by Worldcoin Colonel James Kimuyu, the director of NC4, presenting before a parliamentary committee, outlined the risks associated with the Sam Altman-backed project. Kimuyu expressed concerns [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/kenya-clamps-down-on-worldcoin-over-national-security-and-tax-evasion-concerns/\">Kenya clamps down on Worldcoin over national security and tax evasion concerns</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-30T12:49:00.000Z",
    "title": "\n                        Leading Edtech Firm TinyTap Launches AI-Generated Games And Content\n                    ",
    "url": "https://cryptodaily.co.uk/2023/08/leading-edtech-firm-tinytap-launches-ai-generated-games-and-content",
    "description": "\n                        <p dir=\"ltr\">World&rsquo;s leading library for interactive educational games, TinyTap launches AI-based content generation and deepens its strategic partnerships with Web 3 firm Open Campus.</p>\n<p dir=\"ltr\">Following a ten-year spell as one of the leading edtech platforms, TinyTap, a subsidiary of Animoca Brands, is entering a new technological development stage, introducing novel AI features to enhance educational content creation on its platform. According to a release this Wednesday, TinyTap has launched the &lsquo;prompt to game&rsquo; AI beta today and is expected to launch its &lsquo;prompt to text/image&rsquo; AI generator later next month. Moreover, users and creators on the platform can leverage the &lsquo;Practice Anywhere&rsquo; AI, which allows creators to turn any form of media into educational games and courses.&nbsp;</p>\n<p dir=\"ltr\">In addition, TinyTap, one of the launch partners of Open Campus, announced the strengthening of the two firms&rsquo; partnership in the future and the integration of Publisher NFTs and $EDU tokens on TinyTap.&nbsp;</p>\n<p dir=\"ltr\">&ldquo;We are excited to unveil our AI roadmap, which will redefine how teachers and parents create engaging and interactive educational content for children,&rdquo; Yogev Shelly, CEO of TinyTap, said. &ldquo;With its new AI-powered functions, TinyTap will make content creation faster and more accessible, enabling teachers and parents to provide a personalized learning experience for each child.\"</p>\nTinyTap&rsquo;s Roadmap for AI Integration\n<p dir=\"ltr\">TinyTap is an online edtech platform that allows millions of users to generate educational courses and interactive games on a no-code platform. Since its launch in 2012, TinyTap has grown into the most prominent educational library for games, with companies such as Sesame Street and Oxford University Press creating their own games. With the integration of AI technology, TinyTap will empower even more creators to generate educational content and games more efficiently and quickly.&nbsp;</p>\n<p dir=\"ltr\">According to the team statement, the decision to pivot to AI comes in light of the recent developments in the industry (just check Chat GPT&rsquo;s rise) and its mission to provide a better user experience. To kick off the AI revolution on the platform, TinyTap is launching the &ldquo;Prompt to Game&rdquo; beta feature, allowing anyone to enter a topic prompt in a search box, and TinyTap&rsquo;s AI creates a complete game from the topic provided, as this live demo shows.&nbsp;</p>\n\n<p dir=\"ltr\">&nbsp;&ldquo;As in various other fields, AI presents some terrific opportunities for edtech. Integrating AI into TinyTap allows us to scale up educational opportunities with customised programs tailored for each learner,&rdquo; Yat Siu, co-founder and executive chairman of Animoca Brands, said.&nbsp;</p>\n\n<p dir=\"ltr\">Additionally, the &ldquo;Prompt to Text/Image&rdquo; is set to launch this September. The team states that this feature aims to allow creators, educators and teachers to generate graphics, texts, and images from simple topic prompts. This will gradually enhance their courses and help them create more interesting lessons as the AI learns and adapts.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;More efficiently produced content means a larger education library, which will also help teachers earn more on TinyTap,&rdquo; Siu added.</p>\n\n<p dir=\"ltr\">If the beta phase of TinyTap&rsquo;s AI engines is successful, the development team will also launch the &ldquo;Practice Anywhere&rdquo; tools to enable creators to learn more about creating content using AI content generators. In addition, these tools can be used to &ldquo;turn existing media into learning material&rdquo;. For example, users paste the URL link of an educational video into the tool, and the AI transcribes the video, creates a lesson, and produces real-time TinyTap games.&nbsp;</p>\nTinyTap integrates $EDU tokens and Publisher NFTs\n<p dir=\"ltr\">Apart from AI, TinyTap is also shifting its attention towards Web 3.0, strengthening its relationship with Open Campus. According to the statement, starting next quarter, holders of Open Campus NFTs and its native, $EDU token will be able to spend their digital assets to create TinyTap games and courses.&nbsp;</p>\n<p dir=\"ltr\">These games can then be converted or minted into Publisher NFTs, which can be sold on the Open Campus marketplace. This gives the creator an opportunity to raise money from &ldquo;co-publishers&rdquo; who can purchase the NFT in return for a share of the revenue the content generates. By introducing Publisher NFTs, creators on TinyTap will receive a fair share of earnings generated by their content while injecting new liquidity into the edtech sector.&nbsp;</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T12:55:15.000Z",
    "title": "Nigerian crypto exchange Patricia unveils tokenomics white paper amid customer repayment concerns",
    "url": "https://www.cryptopolitan.com/nigerian-crypto-exchange-patricia-unveils-tokenomics-white-paper/",
    "description": "Patricia, a Nigerian cryptocurrency exchange, recently released its tokenomics white paper, aiming to clarify the utility and value proposition of its native token: Patricia Token (PTK). The company announced its PTK tokens&#8217; launch following a security breach in May 2023, resulting in fund losses. Although the company confirmed that customer funds remained safe, platform users ... <a title=\"Nigerian crypto exchange Patricia unveils tokenomics white paper amid customer repayment concerns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nigerian-crypto-exchange-patricia-unveils-tokenomics-white-paper/\" aria-label=\"More on Nigerian crypto exchange Patricia unveils tokenomics white paper amid customer repayment concerns\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-30T13:06:22.000Z",
    "title": "BitBoy shares drug test results, alleges coup at his company",
    "url": "https://crypto.news/bitboy-shares-drug-test-results-alleges-coup-at-his-company/",
    "description": "BitBoy Ben Armstrong hits back at allegations of drug misuse, deeming them 'diabolical.' He presents negative drug test results, claiming a plot to oust him  from the company."
  },
  {
    "source": "BTCManager",
    "date": "2023-08-30T12:55:36.000Z",
    "title": "US government challenges validity of SBF’s legal defense",
    "url": "https://crypto.news/us-government-challenges-validity-of-sbfs-legal-defense/",
    "description": "The US Department of Justice (DOJ) has expressed reservations over the validity of FTX founder Sam Bankman-Fried's legal strategy."
  },
  {
    "source": "BTCManager",
    "date": "2023-08-30T12:50:59.000Z",
    "title": "US congressman urges Gensler’s SEC exit amid Grayscale ruling",
    "url": "https://crypto.news/us-congressman-urges-genslers-sec-exit-amid-grayscale-ruling/",
    "description": "US Congressman Warren Davidson renews calls for SEC Chair Gary Gensler's removal following a Tuesday court ruling in favor of Grayscale."
  },
  {
    "source": "BTCManager",
    "date": "2023-08-30T12:47:36.000Z",
    "title": "Peter Schiff calls Grayscale’s legal win bearish for Bitcoin",
    "url": "https://crypto.news/peter-schiff-calls-grayscales-legal-win-bearish-for-bitcoin/",
    "description": "Bitcoin critic Peter Schiff warns that Grayscale&#8217;s recent legal victory in converting its GBTC to a spot Bitcoin ETF could be bearish for the cryptocurrency. Schiff wrote in an Aug. 29 tweet, &#8220;GBTC becoming a spot ETF is actually bearish&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-30T12:45:35.000Z",
    "title": "Bitcoin Insider Trading Suspicions Take Root Following Grayscale Win, What’s Happening?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-insider-trading-grayscale/",
    "description": "Crypto asset manager Grayscale recently won against the Securities and Exchange Commission (SEC) in court, propelling gains in the price of Bitcoin in the past 24 hours. According to the case details, a US appeals court ruled on Tuesday, August 292r, that the SEC was wrong to reject an application from Grayscale to convert the Grayscale Bitcoin Trust into a spot Bitcoin ETF. In the hours following the decision, Bitcoin jumped from $26,500 to test the $28,000 resistance zone. On-chain data has shown that the amount of BTC available for trading on crypto exchanges increased noticeably just before the verdict. This has sparked some rumors of insider trading, hinting that some investors knew about the Grayscale win beforehand and looked to capitalize on the oncoming Bitcoin price spike. A Surge In Bitcoin Supply On Exchanges Crypto trading expert Ali Martinez took to social media platform X to share a Santiment chart data detailing the spike in exchange supply. According to on-chain data, around 30,000 BTC was sent to crypto exchanges in the hours before the ruling, raising questions of market manipulation. This would take the exchange supply of BTC at the time from 1.13 million to 1.16 million. Related Reading: Renowned Economist Explains Why Grayscale’s Win Is Not Good For Bitcoin Price Signs of #Bitcoin manipulation? Check this out! Just before #Grayscale legal victory against @SECGov, around 30,000 #BTC were sent to #crypto exchanges — boosting exchange supply from 1.13 million to 1.16 million $BTC. pic.twitter.com/j8xgoAzLrs — Ali (@ali_charts) August 29, 2023 While the flurry in exchange supply could have been from a few traders who knew before the ruling beforehand, it could also be from many investors, as the entire crypto community has been awaiting the Court’s decision.  According to Santiment, 14,596 BTC worth $388.3 million were added to wallets holding around 10-10,000 BTC the day before news of the court&#8217;s decision.   🐳 Whales &#38; sharks may have known a thing or two about the outcome of the #Grayscale and #SEC lawsuit, with 10-10K $BTC wallets accumulating a collective $388.3M in $BTC the day leading up to the news. They were handsomely rewarded with a +6% price jump. https://t.co/j28CwVYKS6 pic.twitter.com/cx5rRuS6IV — Santiment (@santimentfeed) August 30, 2023 Reactions From The Crypto Market The price of Bitcoin spiked in the hours following the news, with Bitcoin briefly crossing over $28,000. The cryptocurrency has, however, since retraced and is now trading at $27,415.  As expected, altcoins have followed Bitcoin&#8217;s price movement and spiked in price. Ethereum and Bitcoin Cash have led the altcoin market in gains, up by 4.37% and 15.01%, respectively in the past 24 hours.  Related Reading: Party In The USA: Ripple Gets Ready To Properly Celebrate Triumph Over SEC A large number of short positions have also been liquidated, with BTC experiencing short liquidations of $50.86 million in the past 24 hours. Grayscale has also reacted positively to the news, as the company&#8217;s stock price is up by over 17% in the past 24 hours. The Grayscale discount, which is the gap between the market value of Grayscale&#8217;s Bitcoin Trust shares and the value of underlying Bitcoin, has also dipped below 20% for the first time since 2022.  BTC bulls hold $27,300 &#124; Source: BTCUSD on Tradingview.com Featured image from Unsplash, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-30T13:00:09.000Z",
    "title": "Shiba Inu Price Prediction: SHIB Eyes $0.001 with Shibarium Relaunch; AI Crypto Rakes in $2M+ in Presale",
    "url": "https://www.crypto-news-flash.com/shiba-inu-price-prediction-shib-eyes-0-001-with-shibarium-relaunch-ai-crypto-rakes-in-2m-in-presale/",
    "description": "<img width=\"512\" height=\"287\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-108.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-108.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-108-300x168.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Readers are invited to embark on an exhilarating journey through the captivating realm of the best cryptocurrency options like Shiba Inu, and its ever-changing price dynamics. The narrative guides individuals as they explore the palpable excitement that envelops the highly anticipated and transformative launch of Shibarium. Throughout this expedition, the narrative delves into InQubeta&#8217;s groundbreaking [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-30T12:47:31.000Z",
    "title": "Ripple (XRP) and Solana (SOL) Prices Slide, Everlodge (ELDG) Aims for 33% Upswing",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-and-solana-sol-prices-slide-everlodge-eldg-aims-for-33-upswing/",
    "description": "<img width=\"512\" height=\"329\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-166.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-166.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-166-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Recent shifts in the prices of Ripple (XRP) and Solana (SOL) have grabbed the attention of investors and analysts. Amidst these fluctuations, Everlodge is making waves with an ambitious goal on the horizon. Let&#8217;s delve into the updates and developments that are shaping these crypto narratives. Join the Everlodge presale and win a luxury holiday [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-30T12:41:51.000Z",
    "title": "VeChain Partners with EasyA and Harvard to Scale Up Innovative Ecosystem and Development, Aiming to Lead the Blockchain Sector",
    "url": "https://www.crypto-news-flash.com/vechain-partners-with-easya-and-harvard-to-scale-up-innovative-ecosystem-and-development-aiming-to-lead-the-blockchain-sector/",
    "description": "<img width=\"1201\" height=\"768\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"VeChain VET\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock.jpg 1201w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock-768x491.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock-24x15.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock-36x23.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock-48x31.jpg 48w\" sizes=\"(max-width: 1201px) 100vw, 1201px\" />Over 3,500 blockchain developers have started the VeChain course, thus earning VET while obtaining crucial knowledge about VeChain’s ecosystem. VET price gained approximately 4.18 percent in the last 24 hours to trade around $0.016.  Leading enterprise-focused layer one blockchain, VeChain (VET), has continued to build its ecosystem during the cryptocurrency bear market in preparation for [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-30T13:00:11.000Z",
    "title": "Akropolis (AKRO) Price Prediction 2023-2030: Will AKRO Price Hit $ 0.085 Soon?",
    "url": "https://coinedition.com/akropolis-akro-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Akropolis (AKRO) Price Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Akropolis-AKRO-Price-Prediction-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>What is Akropolis (AKRO)? Akropolis is an Ethereum-based decentralized finance protocol. Akropolis aims to provide an autonomous financial ecosystem that could be used for saving and growing wealth, including through borrowing and lending.&#160; In aid of this, the platform offers a series of products including AkropolisOS, a framework for developing for-profit decentralized autonomous organizations. Further, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/akropolis-akro-price-prediction/\">Akropolis (AKRO) Price Prediction 2023-2030: Will AKRO Price Hit $ 0.085 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-30T12:58:00.000Z",
    "title": "Tether Relies on Britannia Bank While Other US Banks Part Ways",
    "url": "https://coinedition.com/tether-relies-on-britannia-bank-while-other-us-banks-part-ways/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/usdt-7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/usdt-7.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/usdt-7-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to recent reports, the Bahamas-based&#160; Britannia Bank &#38; Trust has been added by stablecoin issuer Tether to handle dollar transfers. Britannia Financial Group is an up-and-coming financial services company headquartered in London. Tether has not publicly disclosed the extent of its relationship with the banking firm nor has it responded when asked about the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/tether-relies-on-britannia-bank-while-other-us-banks-part-ways/\">Tether Relies on Britannia Bank While Other US Banks Part Ways</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]