[
  {
    "source": "Bitcoin.com",
    "date": "2023-08-19T14:30:03.000Z",
    "title": "Worldcoin’s Turbulent Debut: Down 53% From Peak With 85% WLD Held in Just 6 Wallets",
    "url": "https://news.bitcoin.com/worldcoins-turbulent-debut-down-53-from-peak-with-85-wld-held-in-just-6-wallets/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld567899990000-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Worldcoin&#039;s Turbulent Debut: Down 53% From Peak With 85% WLD Held in Just 6 Wallets\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld567899990000-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld567899990000-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld567899990000-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld567899990000-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld567899990000-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld567899990000-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/wld567899990000.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In just over 25 days since its listing debut on July 24, 2023, the cryptocurrency known as worldcoin (WLD) has experienced a notable decline of 29% when measured against the U.S. dollar. Notably, within the last week alone, it saw a decrease of more than 11%. Interestingly, within the past 24 hours, WLD showcased a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-19T14:18:51.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-19T14:16:17.000Z",
    "title": "Ordinals Sales In Freefall: 97% Decrease Sparks Worries About Bitcoin NFT’s Extinction",
    "url": "https://www.newsbtc.com/news/ordinals-sales-in-freefall-97-decrease-sparks-worries-about-bitcoin-nfts-extinction/",
    "description": "Bitcoin Ordinals, once the shining star of the NFT world, is experiencing a significant downturn in both sales volume and transactions, igniting discussions about the lasting appeal of these digital collectibles.  According to a recent report from DappRadar, the fervor that propelled Bitcoin Ordinals to record-breaking heights earlier this year has dwindled, with sales volume plummeting by over 97% from its peak in May 2023. Ordinals trading and sales volume. Source: DappRadar. Related Reading: Litecoin Price Plunges To Sub-$70 Territory – What Traders Should Expect Ordinals: A Rapid Descent In Three Months The meteoric rise of Bitcoin Ordinals, which saw its sales volume soar to a staggering $452 million in May, has taken a sharp nosedive. This once-flourishing market has seen its sales volume dwindle to a mere $3 million in mid-August, marking a jaw-dropping 97% decline within a span of just three months.  The data paints a stark picture: June witnessed a 76.5% plunge, with sales volume hitting $100 million, while July followed suit with a 66.9% drop, settling at $35 million. As August unfolds, a bleak 91.4% drop to $3 million in sales volume underscores the challenges facing Bitcoin Ordinals. Beyond The Numbers: Transaction Count And Its Implications While fluctuations in sales volume could be attributed to the ebbs and flows of the market, the report highlights another concerning trend: a consistent reduction in transaction count. Transactions have dwindled by a staggering 88.1% in August, sinking to a mere 20,571 compared to the robust 832,648 transactions witnessed just three months prior.  This sharp decline in transactions suggests that the interest in trading Bitcoin Ordinals is diminishing, casting a shadow of doubt on its long-term viability and relevance within the competitive NFT landscape. Bitcoin (BTC) is currently trading at $25.934. Chart: TradingView.com Looking Ahead: A Temporary Setback Or Systemic Issue? The coming months are poised to be pivotal in determining whether this downward spiral is merely a temporary setback or indicative of more profound challenges for Bitcoin Ordinals and NFTs tied to the cryptocurrency. As the NFT ecosystem continues to evolve, the fate of Bitcoin Ordinals hangs in the balance. While its spectacular rise showcased the potential of NFTs within the world of digital art and collectibles, the current slump urges stakeholders to reevaluate strategies and adapt to the shifting dynamics of the market. Related Reading: Solo Climber: The Lone Crypto Surging 11% In Top 100 Roster On A Weekend The waning sales volume and transaction counts of Bitcoin Ordinals have raised pertinent questions about the enduring allure of NFTs tied to the cryptocurrency. As the NFT landscape navigates through these challenges, the industry watches closely, eager to discern whether this decline signifies a fleeting setback or signals a more profound reckoning. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Kyodo News/Getty"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-19T14:30:38.000Z",
    "title": "Here’s When Bitcoin (BTC) Could Bottom Out After Crypto Market Downturn, According to Glassnode Co-Founders",
    "url": "https://dailyhodl.com/2023/08/19/heres-when-bitcoin-btc-could-bottom-out-after-crypto-market-downturn-according-to-glassnode-co-founders/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Market-Downturn-after-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Market-Downturn-after-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Market-Downturn-after-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Market-Downturn-after-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Market-Downturn-after-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Market-Downturn-after-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Market-Downturn-after-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The co-founders of the crypto analytics firm Glassnode believe that a Bitcoin (BTC) bottom could form after one of two things occur following the market downturn. Glassnode co-founders Jan Happel and Yann Allemann, who share the Negentropic handle, tell their 56,000 X followers that they are looking at two scenarios where Bitcoin could carve a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/19/heres-when-bitcoin-btc-could-bottom-out-after-crypto-market-downturn-according-to-glassnode-co-founders/\">Here’s When Bitcoin (BTC) Could Bottom Out After Crypto Market Downturn, According to Glassnode Co-Founders</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]