[
  {
    "source": "CryptoSlate",
    "date": "2023-07-22T13:38:40.000Z",
    "title": "Celsius reaches settlement that will enable users to receive assets by year-end",
    "url": "https://cryptoslate.com/celsius-reaches-settlement-that-will-enable-users-to-receive-assets-by-year-end/",
    "description": "<p>Celsius has reached settlements that will allow it to return user assets by the end of 2023, the Wall Street Journal reported. Celsius&#8217; reorganization plan involves returning only part of the crypto users deposited on the platform. Celsius will compensate users with shares in a new company to compensate for the remaining. Celsius will emerge [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/celsius-reaches-settlement-that-will-enable-users-to-receive-assets-by-year-end/\">Celsius reaches settlement that will enable users to receive assets by year-end</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-22T13:22:21.000Z",
    "title": "Sweaty Robot Helps Researchers Understand the Impact of Soaring Heat",
    "url": "https://www.cryptopolitan.com/sweaty-robot-helps-understand-soaring-heat/",
    "description": "In the midst of a record-breaking heatwave in Phoenix, Arizona, researchers are utilizing a groundbreaking tool to study the impact of soaring temperatures on the human body and explore ways to protect ourselves on a warming planet. ANDI (Advanced Newton Dynamic Instrument), a humanoid, sweaty robot developed at Arizona State University, is equipped with advanced ... <a title=\"Sweaty Robot Helps Researchers Understand the Impact of Soaring Heat\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sweaty-robot-helps-understand-soaring-heat/\" aria-label=\"More on Sweaty Robot Helps Researchers Understand the Impact of Soaring Heat\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-22T13:15:45.000Z",
    "title": "From Polygon NFT Wins To MATIC Gains: Understanding The Connection",
    "url": "https://www.newsbtc.com/news/from-polygon-nft-wins-to-matic-gains-understanding-the-connection/",
    "description": "Polygon has recently witnessed a remarkable surge in its non-fungible tokens (NFTs) sales volume and the influx of sellers participating in this burgeoning market. This growth in the NFT sector has sparked considerable interest and speculation among investors, prompting many to ponder the potential impact it may have on the price of MATIC, the native cryptocurrency of the Polygon network.  However, despite the impressive surge in NFT sales volume and seller participation, a closer examination reveals that not everything works in Polygon&#8217;s favor.  While the NFT market on the platform may be flourishing, other factors could impact the overall sentiment and performance of MATIC. Polygon NFT sales are trending up. Polygon NFT summer? pic.twitter.com/9Jh2ENkyjj — Narb (@NarbTrading) July 20, 2023 MATIC Price Movement In Response To Metric Movement The recent MATIC price report indicates a remarkable surge in Polygon NFT sellers, recording a staggering increase of over 480% within the last 30 days.  Related Reading: Dogecoin Sees Positive Price Movement, Bulls Set Crosshair At $0.075 Meanwhile, MATIC&#8217;s current price stands at $0.772874 according to Coingecko, experiencing a 1.6% rally in the last 24 hours but also facing a 4.3% decline. Several factors could explain this lackluster price performance.  Source: Cryptoslam For one, market sentiment plays a crucial role in shaping cryptocurrency prices, and during this period, overall opinion towards cryptocurrencies, including MATIC, might not have been favorable. Source: Coingecko Regulatory uncertainties, macroeconomic events, and broader market trends could have overshadowed the positive impact of the NFT growth on Polygon. However, price movements in the cryptocurrency market may only sometimes reflect immediate developments. There could be a time lag between the surge in NFT volume and its direct impact on MATIC&#8217;s price. Market reactions can be delayed, and sustained growth in NFT activity may be required to affect the token&#8217;s value significantly. Rising Competition Poses Challenge For Polygon  A recent report also highlights the increasing competition that Polygon, a Layer-2 scaling solution for Ethereum, is facing within its market niche. Polygon has been known for its ability to enhance Ethereum&#8217;s performance, making it faster, cheaper, and more efficient. MATIC market cap currently at $7.11 billion. Chart: TradingView.com However, the emergence of numerous other cryptocurrencies offering similar services, including Optimism, poses a significant challenge to Polygon&#8217;s once-dominant position in the sector.  In the past, Polygon enjoyed a clear lead in the Layer-2 scaling niche, capturing investor attention and interest. However, the current market dynamics indicate that this advantage has diminished. Related Reading: Chainlink Holds Strong With 19% Rally – More Gains In The Pipeline? Despite its impressive features, the price of Polygon has exhibited minimal movement throughout the year, indicating subdued investor sentiment and potentially reduced demand. On the other hand, Optimism, a direct competitor to Polygon, has experienced remarkable growth over the year, with its yearly growth soaring by over 80%. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Coin Chapter"
  }
]