[
  {
    "source": "Decrypt",
    "date": "2023-08-24T01:01:09.000Z",
    "title": "NVIDIA Rides AI Boom to Record-Setting Revenue",
    "url": "https://decrypt.co/153565/nvidia-ai-business-record-quarterly-revenue",
    "description": "The company's data center and gaming products also boosted the bottom line."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-24T00:49:38.000Z",
    "title": "Dogecoin Millionaire's Fortune Fell From $3M to $50,000—But He Hasn’t Lost the Faith",
    "url": "https://decrypt.co/153563/dogecoin-millionaire-bags-3-million-to-50000-dollars-has-not-lost-faith",
    "description": "‘SlumDOGE Millionaire’ Glauber Contessoto still believes in the popular memecoin."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-24T01:00:41.000Z",
    "title": "What is a top-heavy market, and are we in one?",
    "url": "https://cryptoslate.com/whats-a-top-heavy-market-and-are-we-in-one/",
    "description": "<p>The crypto market saw significant turbulence last week as a massive futures liquidation event pushed Bitcoin&#8217;s price below the $25,000 mark. And while there has been a slight recovery, with BTC hovering around $25,900 at the time of writing, the market remains on thin ice. The primary concern? Bitcoin is operating in a top-heavy market. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/whats-a-top-heavy-market-and-are-we-in-one/\">What is a top-heavy market, and are we in one?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-24T00:40:14.000Z",
    "title": "Reserve Bank of Australia issues report on CBDC use cases",
    "url": "https://cryptoslate.com/reserve-bank-of-australia-issues-report-on-cbdc-use-cases/",
    "description": "<p>On August 23, the Reserve Bank of Australia (RBA) and the Digital Finance Cooperative Research Centre (DFCRC) unveiled their findings in a report detailing the implications of a central bank digital currency (CBDC). Notably, this investigation involved the RBA issuing a pilot CBDC to selected industry participants within a secure environment, marking a departure from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/reserve-bank-of-australia-issues-report-on-cbdc-use-cases/\">Reserve Bank of Australia issues report on CBDC use cases</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-24T01:00:20.000Z",
    "title": "The Jackson Hole Effect? Powell’s Speech Sparks Bitcoin Fears Amid Similar 2022 Price Action",
    "url": "https://www.newsbtc.com/bitcoin-news/the-jackson-hole-effect-powells-speech-sparks-bitcoin-fears-amid-similar-2022-price-action/",
    "description": "As Jerome Powell, the Federal Reserve (Fed) Chair, prepares to return to Jackson Hole this Friday, the Bitcoin (BTC) market is experiencing a sense of anticipation due to the similarities in the current price action compared to the period leading up to last year&#8217;s speech.  Key moving averages have been tested and lost over the past two weeks, followed by a period of consolidation, reminiscent of previous events. However, it is important to note that these similarities do not guarantee a repeat of the past, as market conditions and Powell&#8217;s stance have since evolved.  Related Reading: Rarible To Stop Aggregating Orders From These Three NFT Marketplaces – Here’s Why Déjà Vu In The Bitcoin Market? According to Keith Alan, co-founder of analysis and crypto research firm Material Indicator, last year, in the two weeks preceding Powell&#8217;s speech, BTC’s price broke through crucial technical support levels represented by the 21-day, 50-day, 100-day, and 200-week Moving Averages (MA).  Subsequently, a period of consolidation ensued, followed by a significant price drop in response to Powell&#8217;s hawkish tone during the speech. Alan stated: Remember when Fed Chair Powell spoke from Jackson Hole last year and his hawkish tone triggered a 29% BTC dump that took 5 months to recover?  Notably, the recent price action in the Bitcoin market has displayed similarities to last year&#8217;s pattern. Over the past two weeks, Bitcoin has tested and lost these same key moving averages, and it is currently undergoing a phase of consolidation, mirroring the events leading up to Powell&#8217;s previous address.  Keith Alan emphasizes that since last year&#8217;s Jackson Hole event, there have been notable changes. Core inflation has decreased, and Powell&#8217;s approach to communication has become more “measured”.  It is uncertain whether Powell will adopt a hawkish or dovish stance in his upcoming speech, making it challenging to predict the market&#8217;s reaction with certainty. What is evident, however, is that the market is primed for a significant move.  Additionally, Alan suggests that the formation of a lower low in price increases the likelihood of an extension of the existing downtrend. Market participants should be prepared for the possibility of further testing of support levels. Related Reading: Crypto Analyst Predicts Solana Could Mirror Cardano Price Action – A Buy Or Sell Alarm? As the Bitcoin market awaits Powell&#8217;s speech, market sentiment remains dynamic. Traders and investors are anticipating potential market-moving cues from the event. As the date of Jerome Powell&#8217;s return to Jackson Hole approaches, Bitcoin has displayed a notable recovery of 2.1% within the past 24 hours, marking a positive upward movement that brings it closer to the $27,000 threshold.  However, it is crucial to note that if the outcome of Jerome Powell&#8217;s speech on Friday proves favorable for crypto investors and propels Bitcoin&#8217;s price to higher levels, the cryptocurrency may encounter a significant obstacle in the form of its 200-day moving average positioned at $27,200.  Featured image from iStock, chart from TradingView.com"
  }
]