[
  {
    "source": "Cointelegraph",
    "date": "2024-02-20T02:55:18.000Z",
    "title": " UK could pass stablecoin, staking laws within six months: Report ",
    "url": "https://cointelegraph.com/news/uk-crypto-laws-stablecoins-staking-six-months-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOTgxMGNhOTktN2RjNi00MDhhLTgxNGMtM2UzYjBkZWY4YjM4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Minister Bim Afolami says the government is working “very hard” to pass crypto-specific legislation in the U.K.</p>\n                    <p><p>The United Kingdom is aiming to pass new laws regulating stablecoins and crypto staking and expects to do so within the next six months.</p><p>Speaking at a Coinbase-hosted crypto event in London on Feb. 19, Economic Secretary to the Treasury Bim Afolami said the government was working hard to ensure the new legislation was passed ahead of this year’s general election, Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2024-02-19/uk-s-afolami-says-expects-rules-on-stablecoins-crypto-staking-within-six-months?sref=dJOSAJZH\" target=\"_blank\" rel=\"noopener nofollow\">reported</a>.</p><p>Afolami remained tight-lipped when pressed for more specific details concerning the long-awaited crypto regulation.</p><p><a href=\"https://cointelegraph.com/news/uk-crypto-laws-stablecoins-staking-six-months-report\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-20T03:00:55.000Z",
    "title": "Rising stablecoin supply shows an influx of capital into the crypto market",
    "url": "https://cryptoslate.com/rising-stablecoin-supply-shows-an-influx-of-capital-into-the-crypto-market/",
    "description": "<p>Last week, Bitcoin rode the bullish wave it got on last fall and broke above the coveted $52,000 level. Bitcoin regaining almost all of its losses since the collapse of FTX is a significant milestone for the industry that has been struggling to get out of a bear market for the better part of the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/rising-stablecoin-supply-shows-an-influx-of-capital-into-the-crypto-market/\">Rising stablecoin supply shows an influx of capital into the crypto market</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T03:06:32.000Z",
    "title": "Nigerian Businesses Empowered to Harness Google AI for Enhanced Search Ads",
    "url": "https://www.cryptopolitan.com/nigerian-businesses-harness-google-ai/",
    "description": "In a groundbreaking development, businesses across Africa, particularly in Nigeria and the Sub-Saharan region, are now poised to tap into the potential of Google AI for enhancing their online visibility and driving growth through Search Ads. Following Google&#8217;s recent announcement, the Gemini AI-powered tool is now fully operational, offering businesses a chat-like experience to streamline [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T02:44:53.000Z",
    "title": "AI-Generated Voices Rally for Gun Control – Advocates Deploy Deceased Loved Ones’ Voices to Urge Lawmakers",
    "url": "https://www.cryptopolitan.com/ai-generated-voices-rally-for-gun-control/",
    "description": "In a groundbreaking move to advocate for stricter gun control measures, prominent gun control organizations like March for Our Lives and Change the Ref are employing AI-generated voices of deceased individuals, such as victims of past mass shootings, to exert pressure on lawmakers. The use of these voices, notably that of Joaquin Oliver, a victim [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-20T03:00:40.000Z",
    "title": "Bitcoin’s Golden Projection: Analyst Envisions $600K Price Tag, Assessed In Gold Ounces",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoins-golden-projection-analyst-envisions-600k-price-tag-assessed-in-gold-ounces/",
    "description": "Renowned Bitcoin analyst PlanB, known for his stock-to-flow model for BTC, has made a bold prediction regarding the future price of BTC. What sets this forecast apart is its evaluation in terms of gold ounces, shedding light on a unique perspective. The PlanB Projection: Bitcoin Meteoric Rise According to PlanB&#8217;s recent post on X, he foresees a monumental shift in Bitcoin&#8217;s value, expected to rise significantly in the coming years. Drawing a comparison with gold, PlanB highlighted that currently, one Bitcoin is equivalent to 26 ounces of gold, valuing an ounce of gold at $2,000. Bitcoin = 26 ounces of Gold. It would surprise me if BTC would stay below 100 ounces of Gold in 2024/2025. pic.twitter.com/IghU4u7gCy — PlanB (@100trillionUSD) February 19, 2024 Looking ahead to 2024-2025, PlanB predicts that Bitcoin&#8217;s price could skyrocket to roughly 100 gold ounces, translating to $200,000 in fiat currency terms. Related Reading: 16,000 Bitcoin Dormant Since 5+ Years Suddenly Moves, What’s Going On? Delving deeper into the charted trajectory, PlanB anticipates Bitcoin to climb to 35 gold ounces ($70,000) by 2024 and surge to 300 gold ounces by 2025. This projection would place Bitcoin&#8217;s value at a price target of $600,000, marking a monumental milestone in its journey. Correct. And more if gold price rises too. — PlanB (@100trillionUSD) February 19, 2024 Bullish Momentum Fuels Bitcoin&#8217;s Rise As Bitcoin continues to capture the attention of investors, recent weeks have witnessed a notable bullish momentum propelling the cryptocurrency forward. With a surge of more than 20% over this period, Bitcoin has crossed the $1 trillion market cap threshold, accompanied by a trading volume hovering above $20 billion in the past week alone. This surge in activity has ignited optimism among investors and traders, leading to a significant accumulation of the asset. Notably, Whale Alert data reveals that earlier today a substantial withdrawal of approximately $962.15 million from the leading US crypto exchange, Coinbase, to an undisclosed address, underscoring the heightened interest in Bitcoin. 🚨 🚨 🚨 🚨 🚨 🚨 🚨 🚨 🚨 🚨 9,322 #BTC (485,247,899 USD) transferred from #Coinbase to unknown new wallethttps://t.co/AEyqa8qFQ9 — Whale Alert (@whale_alert) February 19, 2024 Meanwhile, the Bitcoin open interest has surged to over $24 billion, marking a 50% increase since the start of 2024. This surge in open interest, a metric representing the total value of outstanding derivative contracts, signifies heightened market activity and interest in Bitcoin futures and options trading. Related Reading: Bitcoin Open Interest Reaches $69,000 ATH Levels, What This Means For Price Notably, this surge in open interest levels has not been witnessed since the peak of Bitcoin&#8217;s price in November 2021 when it soared to an all-time high of $69,000. JUST IN: #Bitcoin futures Open Interest hits highest level since 2021 bull market. 🔥 pic.twitter.com/TseW6AosaN — Bitcoin Archive (@BTC_Archive) February 19, 2024 This trend has been consistent across various crypto exchanges, with platforms like CME, Binance, and ByBit leading the charge and commanding over 50% of the open interest in the market, according to data from Coinglass, Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-20T02:52:38.000Z",
    "title": "Bitcoin Price Consolidates Below Resistance, Are Dips Still Supported?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-consolidates-52500/",
    "description": "Bitcoin price is correcting gains from the $52,500 resistance. BTC must stay above the $50,500 support to remain in a bullish zone this month. Bitcoin price is struggling to clear the $52,800 resistance zone. The price is trading below $52,200 and the 100 hourly Simple moving average. There was a break below a key bullish trend line with support at $52,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase unless there is a clear move below the $50,500 support. Bitcoin Price Faces Hurdles Bitcoin price made another attempt to gain strength above the $52,000 resistance zone. BTC broke the $52,200 level, but the bears were still active near the $52,500 level. A high was formed near $52,475 and the price is now correcting gains. There was a move below the $52,000 level. The pair traded below the 50% Fib retracement level of the upward move from the $50,581 swing low to the $52,475 high. Besides, there was a break below a key bullish trend line with support at $52,200 on the hourly chart of the BTC/USD pair. Bitcoin is now trading below $52,000 and the 100 hourly Simple moving average. Source: BTCUSD on TradingView.com Immediate resistance is near the $52,000 level. The next key resistance could be $52,200, above which the price could rise toward the $52,500 resistance zone. The main resistance is still near the $52,800 level. A clear move above the $52,800 resistance could send the price toward the $53,500 resistance. The next resistance could be near the $55,000 level. More Losses In BTC? If Bitcoin fails to rise above the $52,200 resistance zone, it could start another decline in the near term. Immediate support on the downside is near the $51,300 level and the 61.8% Fib retracement level of the upward move from the $50,581 swing low to the $52,475 high. The first major support is $51,000. If there is a close below $51,000, the price could gain bearish momentum. In the stated case, the price could decline toward the $50,500 support zone, below which the price might turn bearish in the short term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $51,300, followed by $50,500. Major Resistance Levels – $52,200, $52,500, and $52,800."
  }
]