[
  {
    "source": "Decrypt",
    "date": "2023-08-11T20:50:18.000Z",
    "title": "Custodia Bank Now Accepting US Dollar Deposits, Adding Bitcoin Custody",
    "url": "https://decrypt.co/152245/custodia-bank-now-accepting-us-dollar-deposits-adding-bitcoin-custody",
    "description": "“The bar is very high for banks to launch, and we cleared it,\" Custodia Bank CEO Caitlin Long told Decrypt."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-11T20:40:00.000Z",
    "title": "SEC Seeks to 'Usurp Congress's Authority' in Coinbase Lawsuit: Blockchain Association",
    "url": "https://decrypt.co/152239/sec-seeks-to-usurp-congresss-authority-in-coinbase-lawsuit-blockchain-association",
    "description": "\"The SEC is trying to short-circuit the legislative process\" the consortium of crypto associations argued in its court brief."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-11T21:08:23.000Z",
    "title": "Gemini’s Cameron Winklevoss slams DCG for denying involvement in failed Earn program",
    "url": "https://cryptoslate.com/geminis-cameron-winklevoss-slams-dcg-for-denying-involvement-in-failed-earn-program/",
    "description": "<p>Gemini co-founder Cameron Winklevoss criticized Digital Currency Group (DCG) on Aug. 11 as part of an ongoing dispute between the two firms. On Twitter, Winklevoss said: &#8220;[DCG&#8217;s] response [to Gemini&#8217;s lawsuit] &#8230; is filled with carefully crafted statements that are incredibly revealing &#8230; It completely ignores the reality of the situation in a comical way.&#8221; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/geminis-cameron-winklevoss-slams-dcg-for-denying-involvement-in-failed-earn-program/\">Gemini&#8217;s Cameron Winklevoss slams DCG for denying involvement in failed Earn program</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T21:04:22.000Z",
    "title": "Sam Bankman-Fried finally sent to jail!",
    "url": "https://www.cryptopolitan.com/sam-bankman-fried-finally-sent-to-jail/",
    "description": "A massive blow struck the crypto realm today as Sam Bankman-Fried, the renowned founder of FTX, faced his biggest defeat yet: incarceration. The entrepreneur, once hailed as a revolutionary in the digital currency landscape, finds himself on the other side of the law today. So how did this saga unravel? The diary dilemma While awaiting ... <a title=\"Sam Bankman-Fried finally sent to jail!\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sam-bankman-fried-finally-sent-to-jail/\" aria-label=\"More on Sam Bankman-Fried finally sent to jail!\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T20:41:27.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-11T21:00:18.000Z",
    "title": "Black Swan Author Warns Of Bitcoin Volume Slump As BTC Fails To Breach $30,000",
    "url": "https://www.newsbtc.com/bitcoin-news/black-swan-author-warns-of-bitcoin-volume-slump-as-btc-fails-to-breach-30000/",
    "description": "Bitcoin seems on the verge of seeing downside volatility during today’s trading session if bears can break current support. However, price action has been slow as all major narratives, including those from macroeconomic forces, have lost strength. Related Reading: Bitcoin Price Prediction 2024/25: 4-Year Cycle And Elliot Wave Can Coexist As of this writing, Bitcoin trades at $29,300 with sideways movement across the board. Low volatility has been suppressing BTC’s price action, a status quo that could persist until macroeconomic forces come back into the picture in September. Nassim Taleb Lashes Out At Bitcoin Again In the meantime, Bitcoin critics are using the drop in volatility, and trading volume, to support their arguments against the cryptocurrency. Wall Street operator, professor, and author Nassim Taleb stands among the latter. Via his X account, Taleb showed his almost 1 million followers the chart below pointing at the Bitcoin price and the decline in trading volume. Using the chart and the metric as a proxy to gauge Bitcoin adoption, Taleb stated: When I said pple lost interest in bitcoin, it was based on this: BTC Volume is slowly disappearing, down &#62;85% from the peak. As volume drops, manipulations become easier but, at some point, manipulators will need to exit. This is how Open Ponzis implode. The chart above shows BTC declining trading volume since 2020 when the cryptocurrency entered a rally that took it from a low of around $3,000 during a “Black Swan” event, the COVID-19 pandemic, to an all-time high of $69,000. At that time, similar to today, BTC and the crypto market spend years in a “Crypto Winter” with declining prices. Once the sector rallied, many jumped in on the action swelling the trading volume to an all-time high. In that sense, Taleb seems to be hinting at a downside for the price of the cryptocurrency following a rise in price with low trading volume, which often leads to a decline. One crypto investor tried to show Taleb a different version of the chart above, which goes back to 2014 when the cryptocurrency was trading just above $100. The user pointed out that BTC has seen periods of volatile volumes as the cryptocurrency became a mainstream asset. Related Reading: Bitcoin Price Next Leg Lower Underway And At Risk for Key Reasons However, Taleb dismissed the user with the following: Imbecile, if you knew how to read the chart you&#8217;d see only now a rise in price WITH DROP in volume. The Black Swan author has been a Bitcoin critic, comparing the cryptocurrency with a “cult” and predicting that the sector will eventually “fade.&#8221; Cover image on Unsplash, chart from Tradingview"
  }
]