[
  {
    "source": "Crypto Daily",
    "date": "2023-12-22T16:26:09.000Z",
    "title": "While Top Altcoins Soar, Ripple’s (XRP) Sideways Dance Might Turn Into A Real 2024 Bull Stampede!",
    "url": "https://cryptodaily.co.uk/2023/12/while-top-altcoins-soar-ripples-xrp-sideways-dance-might-turn-into-a-real-2024-bull-stampede",
    "description": "Discover Ripple's (XRP) unique journey in the crypto world! As top altcoins skyrocket, XRP takes a different path. Dive into our analysis to uncover if Ripple (XRP) is quietly gearing up for a monumental bull run by 2024. Stay ahead of the curve in the ever-changing cryptocurrency landscape with our insights."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-22T16:35:36.000Z",
    "title": "Crypto community criticizes SEC Chair for compliance comments",
    "url": "https://www.cryptopolitan.com/crypto-community-criticizes-sec-chair/",
    "description": "Crypto community members have responded strongly to recent comments by the Chair of the United States Securities and Exchange Commission (SEC), Gary Gensler, regarding compliance within the cryptocurrency space.&#160; Gensler&#8217;s remarks on social media triggered a backlash from various cryptocurrency industry figures, who argue that the SEC has failed to provide clear regulatory guidance. Gensler&#8217;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-22T16:33:01.000Z",
    "title": "Artificial Intelligence Reshapes Content Marketing Landscape",
    "url": "https://www.cryptopolitan.com/ai-reshaping-content-marketing-landscape/",
    "description": "In the ever-evolving realm of content marketing, artificial intelligence (AI) emerges as a transformative force, revolutionizing strategies and reshaping the way brands engage with their audiences. With its analytical prowess, AI holds the key to unlocking unprecedented efficiency and innovation, propelling content marketing into a future where predictive insights and personalized experiences take center stage. [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-22T16:22:04.000Z",
    "title": "SEC met multiple spot Bitcoin ETF applicants on Dec. 21",
    "url": "https://crypto.news/sec-met-multiple-spot-bitcoin-etf-applicants-on-dec-21/",
    "description": "Several potential issuers met with the SEC to discuss their spot Bitcoin ETFs, adding to hopes that harmonized approvals may be on the horizon."
  },
  {
    "source": "Kraken Blog",
    "date": "2023-12-22T16:15:21.000Z",
    "title": "Kraken successfully passes November 2023 Proof of Reserves",
    "url": "https://blog.kraken.com/news/kraken-successfully-passes-november-2023-proof-of-reserves",
    "description": "<p> <img width=\"300\" height=\"137\" src=\"https://i0.wp.com/blog.kraken.com/wp-content/uploads/2023/11/Blog-1536x700-1.png?fit=300%2C137&amp;ssl=1\" class=\"attachment-medium size-medium wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://i0.wp.com/blog.kraken.com/wp-content/uploads/2023/11/Blog-1536x700-1.png?w=1536&amp;ssl=1 1536w, https://i0.wp.com/blog.kraken.com/wp-content/uploads/2023/11/Blog-1536x700-1.png?resize=300%2C137&amp;ssl=1 300w, https://i0.wp.com/blog.kraken.com/wp-content/uploads/2023/11/Blog-1536x700-1.png?resize=1024%2C467&amp;ssl=1 1024w, https://i0.wp.com/blog.kraken.com/wp-content/uploads/2023/11/Blog-1536x700-1.png?resize=768%2C350&amp;ssl=1 768w, https://i0.wp.com/blog.kraken.com/wp-content/uploads/2023/11/Blog-1536x700-1.png?resize=1200%2C547&amp;ssl=1 1200w, https://i0.wp.com/blog.kraken.com/wp-content/uploads/2023/11/Blog-1536x700-1.png?resize=200%2C91&amp;ssl=1 200w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-attachment-id=\"23994\" data-permalink=\"https://blog.kraken.com/blog-1536x700\" data-orig-file=\"https://i0.wp.com/blog.kraken.com/wp-content/uploads/2023/11/Blog-1536x700-1.png?fit=1536%2C700&amp;ssl=1\" data-orig-size=\"1536,700\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Blog 1536&#215;700\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/blog.kraken.com/wp-content/uploads/2023/11/Blog-1536x700-1.png?fit=300%2C137&amp;ssl=1\" data-large-file=\"https://i0.wp.com/blog.kraken.com/wp-content/uploads/2023/11/Blog-1536x700-1.png?fit=1024%2C467&amp;ssl=1\" /> <i>We are thrilled to announce we have successfully completed our latest Proof of Reserves. Clients can verify their account balances are fully backed with on-chain assets, custodied securely by Kraken, for  supported cryptocurrencies as of the November 30, 2023 snapshot.</i></p>\n<p>The post <a href=\"https://blog.kraken.com/news/kraken-successfully-passes-november-2023-proof-of-reserves\">Kraken successfully passes November 2023 Proof of Reserves</a> appeared first on <a href=\"https://blog.kraken.com\">Kraken Blog</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-22T16:30:42.000Z",
    "title": "Polygon Breaks Through $0.85, Is A Move To New Highs Next?",
    "url": "https://www.newsbtc.com/matic/analyst-explains-polygon-touch-new-highs/",
    "description": "Polygon has seen some sharp uptrend during the past day and has now broken above $0.85. Here&#8217;s why this break could pave the way for a further rally. Polygon Has Risen By More Than 6% During The Past 24 Hours After topping above the $0.94 mark earlier in the month, MATIC had gone on to register some significant drawdowns. In the last few days, though, the asset appears to have hit a bottom around the $0.75 level, as it hasn&#8217;t gone below the mark yet. Related Reading: Analyst Says Polygon (MATIC) On Brink Of Major Move, Here’s Why Something that could add further evidence for this is the fact that bullish momentum has returned for Polygon in the past day, as its price has shot up over 6%. The below chart shows how the cryptocurrency has performed during the past month: Looks like MATIC has sharply risen in the past day &#124; Source: MATICUSD on TradingView With this sharp surge, the cryptocurrency has recovered back above the $0.85 mark. This break could turn out to be significant for Polygon if on-chain data is anything to refer to. MATIC Has Broken Past A Major Resistance Zone With The Latest Surge In a post on X, analyst Ali discussed about how Polygon was about to face a major test of on-chain resistance. When the analyst had made the post, the coin was still trading around the $0.78 mark. Here is a chart that shows how the on-chain support and resistance levels looked like at the time of the post: The different MATIC price ranges based on the density of cost basis &#124; Source: @ali_charts on X In on-chain analysis, the potential of any price range to act as support or resistance depends on the number of coins that the investors purchased inside the particular range. This is because of the fact that holders are more likely to react whenever the price retests their cost basis or acquisition price, as such a retest can flip their profit-loss condition. The more addresses that have their cost basis inside a particular range, the stronger the market reaction when the price retests said range. From the chart, it&#8217;s visible that Polygon&#8217;s price had been trading just under the $0.79 to $0.84 range at the time Ali had made the post. This range carried the cost basis of around 38,570 addresses, which bought 4.24 billion MATIC at it. Generally, whenever the investors are in a loss (as these holders would have been when MATIC was trading under the range), there is a chance that they sell when the price retests their cost basis since they might get desperate to exit the market and break-even would sound like a good opportunity to do so. Related Reading: XRP Whales Show Exchange Inflow Activity, Bad Sign For Price? As a result of this, price ranges above the spot price that are dense with investors can provide resistance to the cryptocurrency. This had made the aforementioned thick $0.79 to $0.84 range important for Polygon. &#8220;For MATIC to embark on a journey to new heights, it&#8217;s crucial to break through this level with conviction,&#8221; the analyst noted in the post. Following the latest surge, MATIC has clearly surged past this major obstacle. And as is visible in the graph, there aren&#8217;t any ranges this difficult to break anymore, either. It now remains to be seen how the Polygon price develops from here, given the lower on-chain resistance at the levels above. Featured image from Shutterstock.com, charts from TradingView.com, Santiment.net"
  }
]