[
  {
    "source": "CoinDesk",
    "date": "2023-09-21T19:56:03.000Z",
    "title": "Judge Blocks Sam Bankman-Fried's Proposed Witnesses From Testifying",
    "url": "https://www.coindesk.com/policy/2023/09/21/judge-blocks-sam-bankman-frieds-proposed-witnesses-from-testifying/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Judge Lewis Kaplan, who's overseeing Sam Bankman-Fried's trial, granted the U.S. Department of Justice's motion to block all of the FTX founder's proposed witnesses from testifying at his trial next month."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-21T19:53:25.000Z",
    "title": "Tim Draper Launches Crypto Accelerator Despite US Regulatory 'Shitshow,' Says Partner",
    "url": "https://decrypt.co/198223/tim-draper-launches-crypto-accelerator-despite-us-regulatory-shitshow-says-partner",
    "description": "Billionaire investor Tim Draper's new Draper Goren Blockchain will have 10-year time horizons and aim to help build companies from scratch. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-21T19:44:17.000Z",
    "title": "Sky-high interest rates are exactly what the crypto market needs",
    "url": "https://cointelegraph.com/news/high-interest-rates-exactly-what-crypto-market-needs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/d2e1c088-0af2-4e85-bda3-e4dcb3c16333.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>We can no longer rely on central banks to prop up our investments, which means learning to look at the health of the companies and products in which we invest.</p>\n                    <p><p>The United States Federal Reserve Open Market Committee’s September decision on interest rates was entirely expected, with the FOMC holding rates at the current level of 5.25% to 5.5%. As also expected, the committee indicated there may be another rate hike coming this year, with Chairman Jerome Powell insisting — as usual — in his Sept. 20 press conference that the job of getting inflation back to the Fed’s 2% target is in “no way done.”</p><p>What was more of a surprise, however, is the fact that the Fed raised its long-term forecast for the Federal Funds Rate, which they now see as standing at 5.1% by the end of 2024 — up from June’s prediction of 4.6% — before falling to 3.9% at the end of 2025, and 2.9% at the end of 2026. These numbers are notably higher than previous forecasts and indicate a “higher for longer” scenario for U.S. interest rates that not too many market participants were expecting. </p><p>As such, we saw markets pull back slightly, with the S&amp;P 500 trading down 0.80% shortly after the announcement, followed by the NASDAQ, which fell 1.28% — a big tumble for these headline indexes. Cryptocurrency markets also responded negatively, with Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) falling below $27,000 and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) falling nearly 2% to just more than $1,600 shortly after Powell wrapped up his press conference.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-miners-survive-hostile-market\"><strong><em>How Bitcoin miners can survive a hostile market — and the 2024 halving</em></strong></a></p><p>Ultimately, the data shows the U.S. economy is returning to a state we haven’t seen since before the financial crisis of 2008-09, one in which economic growth and inflation remain relatively consistent. A U.S. interest rate averaging around 4% over three years would be no surprise in this old world, nor would annual inflation greater than 2%.</p><p>The trouble is that investors have become addicted to central banks pumping fast, free money into our economies to battle concurrent crises. We are now in a mentality as investors where strong economic growth and stable inflation are interpreted as bad news — and crypto markets seem to feel the same way. This is particularly interesting considering Bitcoin was founded during the financial crisis in direct critique of the loose monetary policy decisions of the Federal Reserve, Bank of England, and others. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/6c14546a-355a-4896-9fd5-0813683a7b5b.jpg\"  /><figcaption style=\"text-align: center;\"><em>The Federal Funds Rate from January 2000 through August 2023. Source: Board of Governors of the Federal Reserve System.</em></figcaption></figure><p>What now seems evident is that we can’t rely on central banks to provide our investment mandates. Rather, we must focus more closely on the actual health of companies and the utility, products, and services they are providing to their customers. In the crypto world, we will have to focus carefully on the viability of the crypto ecosystem, and what it can offer to its users as an alternative or complementary financial marketplace.</p><p>In the short-to-medium term, of course, this means that we will all be sitting and waiting for the U.S. Securities and Exchange Commission to make its ruling on the teetering pile of Bitcoin spot ETF applications it has sitting on its desk, submitted by the world’s largest asset managers.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-justice-department-binance\"><strong><em>What will Bitcoin do if the Justice Department takes aim at Binance?</em></strong></a></p><p>Franklin Templeton — one of the oldest asset managers in the U.S. — has joined BlackRock, Fidelity, Invesco, and others in the race to launch a mass-market fund for the world’s biggest cryptocurrency. If even one is approved, this really will mark Bitcoin’s internment into the hall of fame for global assets, and we can expect cryptocurrency to join portfolios around the world as an alternative investment in the coming bull market. Should the SEC favor one industry giant over another, though, we can predict many uncomfortable Upper East Side dinner parties.</p><p>If the SEC stays true to form and doesn’t approve any of these applications, Bitcoin and other cryptocurrencies will remain marginal assets. That doesn’t mean they won’t find new price drivers and head back toward previous all-time highs. But we certainly won’t see much action in crypto markets until this issue is resolved in one way or another. </p><p>Equally, the FOMC decision and Powell’s comments indicate we won’t see much excitement on the macroeconomic side for the foreseeable future either. But if the U.S. and global economy do return to something like the old normal — unfamiliar territory to any investor under 40 — it may well be exactly what the world, and even cryptocurrency markets, need.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Lucas Kiely</strong> is chief investment officer of Yield App, where he oversees investment portfolio allocations and leads the expansion of a diversified investment product range. He was previously the chief investment officer at Diginex Asset Management, and a senior trader and managing director at Credit Suisse in Hong Kong, where he managed QIS and Structured Derivatives trading. He was also the head of exotic derivatives at UBS in Australia.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-21T19:40:26.000Z",
    "title": "X CEO confirms forthcoming in-app payment features",
    "url": "https://cryptoslate.com/x-ceo-confirms-forthcoming-in-app-payment-features/",
    "description": "<p>Linda Yaccarino, the CEO of X (formerly Twitter), revealed on Sept. 21 that the social media company will soon introduce payment features. Yaccarino posted a video that described various upcoming features including peer payments (&#8220;paying your friend back for that cake&#8221;), retail payments (&#8220;snagging that new pair of sneakers&#8221;), and rewards (&#8220;earning an income by [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/x-ceo-confirms-forthcoming-in-app-payment-features/\">X CEO confirms forthcoming in-app payment features</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-21T20:01:19.000Z",
    "title": "Linear Finance faces security breach, takes swift action to rectify",
    "url": "https://crypto.news/linear-finance-faces-security-breach-takes-swift-action-to-rectify/",
    "description": "Hong Kong-based defi protocol Linear Finance reported a security breach that drained its Linear USD token&#8217;s liquidity on PancakeSwap and Ascendex platforms. Hong Kong&#8216;s burgeoning defi ecosystem faced a significant setback this week as Linear Finance, one of its leading&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-21T19:55:00.000Z",
    "title": "CoinScan emerges from stealth with $6.3m in funding",
    "url": "https://crypto.news/coinscan-emerges-from-stealth-with-6-3m-in-funding/",
    "description": "The Shalom MecKenzie-backed digital asset analytics platform CoinScan aims to save crypto traders from millions in losses by providing free unbiased token data and scam prevention tools for investing in virtual currencies. CoinScan announced its stealth launch on Sept. 21&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-21T20:00:34.000Z",
    "title": "Ex-Alameda Employee Claims Firm Triggered 87% Bitcoin Price Plummet In 2021",
    "url": "https://www.newsbtc.com/bitcoin-news/ex-alameda-employee-claims-firm-triggered-87-bitcoin-price-plummet-in-2021/",
    "description": "In a recent disclosure, a former employee of Alameda Research, a trading firm led by Sam Bankman-Fried, has unveiled crucial information regarding the dramatic 87% plummet in Bitcoin (BTC) value during 2021.  The incident, which occurred on October 21, 2021, witnessed BTC’s price on Binance.US nosedive from approximately $65,760 to $8,200 within a short period. Related Reading: Binance &#38; Deribit Traders Aggressively Short Bitcoin, Squeeze Incoming? Insider Details Of Bitcoin Plunge And Alleged Manual Trading Error The ex-employee, Baradwaj, alleged that the trading firm was directly responsible for the sudden price drop, attributing it to a “manual trading error” rather than solely relying on algorithmic trading.  Baradwaj claimed that a trader at Alameda Research inadvertently entered an incorrect decimal while attempting to sell a block of BTC in response to breaking news.  Consequently, the trade was executed at an extraordinarily low price, resulting in a drastic crash. Highlighting Alameda&#8217;s trading operations, Baradwaj revealed that the firm primarily employed semi-systematic strategies, where traders fine-tuned algorithms to execute trades automatically at high frequencies.  However, manual trades were occasionally employed in instances of system bugs or arbitrage opportunities on platforms where automated trading had not been implemented. Unlike automated trading, which adhered to sanity checks and market prices, manual trades were discretionary and prone to human error. Unfortunately, an Alameda trader&#8217;s mistake triggered a chain reaction on that fateful day in October.  The erroneous trade caused Bitcoin&#8217;s price to plummet from its peak of $65,000 to as low as $8,000 on certain platforms before swiftly recovering through the actions of arbitrageurs. The incident created a stir on social media, with traders and news outlets scrambling to understand the sudden price movement. Binance.US, the platform at the center of the flash crash, issued a statement attributing the event to a bug in the trading algorithm of one of their institutional traders. Baradwaj further states that the losses incurred by Alameda Research were substantial, amounting to tens of millions. Still, due to the genuine nature of the mistake, the firm took immediate action to enhance sanity checks for manual trades.  This incident exposed a vulnerability in Alameda&#8217;s risk management practices, prompting implementing “robust measures” to prevent similar occurrences in the future. The former employee shed light on the working culture at Alameda, characterized by a philosophy of moving fast to capitalize on opportunities, even if it occasionally resulted in unforeseen costs or vulnerabilities.  This approach, championed by Sam Bankman-Fried, shaped the culture at Alameda Research and the now-bankrupt crypto exchange FTX. Related Reading: Optimism To Sell 116 Million OP Tokens Via Private Sale: Will The Price React? For nearly two years, the BTC flash crash incident remained a puzzle to the public, leaving many wondering about the cause behind such a significant price drop. With the revelations made by Baradwaj, the veil has been lifted, providing valuable insights into the events that unfolded behind the scenes. As of this writing, the largest cryptocurrency in the market, BTC, trades at $26,600, down by over 2.1% in the 24-hour time frame.  Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-21T20:00:31.000Z",
    "title": "$819,000,000,000 British Bank Launches New Staking Service Under Its Crypto Arm",
    "url": "https://dailyhodl.com/2023/09/21/819000000000-british-bank-launches-new-staking-service-under-its-crypto-arm/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/band-staking-arm.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/band-staking-arm.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/band-staking-arm.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/band-staking-arm.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/band-staking-arm.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/band-staking-arm.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/band-staking-arm.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>British bank Standard Chartered’s crypto arm Zodia Custody just rolled out a new service that will enable crypto investors to generate passive earnings from their digital assets. The subsidiary in the business of storing institutions’ crypto assets says it struck a deal with Singapore-based blockchain technology provider OpenEden for the Zodia Custody Yield program that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/21/819000000000-british-bank-launches-new-staking-service-under-its-crypto-arm/\">$819,000,000,000 British Bank Launches New Staking Service Under Its Crypto Arm</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-21T19:55:49.000Z",
    "title": "‘Back in the Chop’: Crypto Analyst Breaks Down a Bouncing Bitcoin (BTC)",
    "url": "https://dailyhodl.com/2023/09/21/back-in-the-chop-crypto-analyst-breaks-down-a-bouncing-bitcoin-btc/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/breakout-signal-for-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/breakout-signal-for-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/03/breakout-signal-for-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/03/breakout-signal-for-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/03/breakout-signal-for-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/03/breakout-signal-for-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/03/breakout-signal-for-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is breaking down Bitcoin (BTC) as the top crypto by market cap bounces on the price charts. Crypto trader Michaël van de Poppe tells his 667,500 followers on the social media platform X that BTC&#8217;s &#8220;crucial&#8221; levels are around $26,700 and $28,000. &#8220;The chop continues on Bitcoin. Let&#8217;s see what happens after [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/21/back-in-the-chop-crypto-analyst-breaks-down-a-bouncing-bitcoin-btc/\">‘Back in the Chop’: Crypto Analyst Breaks Down a Bouncing Bitcoin (BTC)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]