[
  {
    "source": "CoinDesk",
    "date": "2023-05-30T18:01:19.000Z",
    "title": "Crypto Exchange Bybit Exits Canada Citing Recent Regulatory Development",
    "url": "https://www.coindesk.com/business/2023/05/30/crypto-exchange-bybit-exit-canada-citing-recent-regulatory-development/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bybit has announced that it will be exiting the Canadian market starting as soon as May 31 due to recent regulatory developments in the country, adding to several other exchanges that pulled out from the country."
  },
  {
    "source": "Decrypt",
    "date": "2023-05-30T17:55:47.000Z",
    "title": "Hong Kong, UAE Central Banks Coordinate on Crypto Regulations",
    "url": "https://decrypt.co/142834/hong-kong-uae-central-banks-coordinate-on-crypto-regulations",
    "description": "Their focus on cross-border trade settlements could open up the possibility of central bank digital currencies being used."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T18:07:10.000Z",
    "title": "Avalanche price analysis: Avax drops to $14.46 as market conditions turn bearish",
    "url": "https://www.cryptopolitan.com/avalanche-price-analysis-2023-05-30/",
    "description": "Avalanche price analysis highlights a bearish trend, with the price dropping to a low of $14.46 in the past 24 hours. This marks a decrease of 0.14% from its previous close of $14.48, indicating a selling sentiment among investors. The momentum is expected to extend further as the market trades in red territory. The resistance ... <a title=\"Avalanche price analysis: Avax drops to $14.46 as market conditions turn bearish\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-analysis-2023-05-30/\" aria-label=\"More on Avalanche price analysis: Avax drops to $14.46 as market conditions turn bearish\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T17:41:42.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-30T18:00:44.000Z",
    "title": "Rare Crypto Signal Emerges That Could Spark Another 2017-Style Boom",
    "url": "https://www.newsbtc.com/bitcoin-news/rare-crypto-signal-emerges-2017-style-boom/",
    "description": "A rare crypto technical indicator signal has appeared for the first time in over six years. The last time it fired, the total cryptocurrency market cap climbed more than 7,000% and put the asset class on the map. With the signal now firing once again, is this a prelude to another 2017-style market boom in digital currencies? Why Crypto Could Be On The Verge Of A 2017-Style Boom Volatility is the measure of how much price varies within a timeframe. For example, an asset that rises and falls $5 either way on average is nowhere nearly as volatile as something like Bitcoin which can crash by 80% then rip higher by a 1000%. The Bollinger Bands visualize volatility over the last 20-periods using a moving average and two standard deviations. When the tools tighten, it signals a lack of volatility. When the bands expand, they signal intense volatility ahead. Related Reading: Bitcoin Price Double Fractal Points To “Extended” Parabolic Rally A squeeze setup involves the Bollinger Bands tightening, then expanding to release the energy built up in the trading range. This is precisely what&#8217;s happening in the Total Crypto Market cap chart for the first time since late 2016. In the chart below, Bollinger Band Width is at the tightest in over six years. Although past performance is no guarantee of future results, the last time the signal appeared the crypto market climbed from $10 billion to $780 billion in value. A massive move is coming in cryptocurrencies &#124; TOTAL on TradingView.com Buckle Up: Bollinger Bands Suggest Volatility Ahead The Bollinger Bands are telling us that volatility is coming, but says little about the direction of price action. For a buy signal to occur, price must close above the upper band. Until that happens, all we know is a big move is coming. Volatility, however, can resolve to the upside, despite being more so associated with downside in financial markets. The VIX, which is a measure of implied volatility in the S&#38;P 500, is also called the &#8220;Fear Index&#8221; because it so often spikes during corrections. Related Reading: This Bitcoin Indicator Turned $5 Into $34,000 Even Oxford Languages defines the term with a negative connotation. According to the authority, volatility is the &#8220;liability to change rapidly and unpredictably, especially for the worse.&#8221; Simply put, things could also get worse for crypto. But considering the extended downtrend and evidence from the last time the signal fired, this tight of Bollinger Band Width has the potential to produce a 2017-like rally in crypto. Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for exclusive daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-30T18:07:27.000Z",
    "title": "Ripple Lawyer: XRP at Current Price of $0.49 Is Super Cheap; Investors Expected to Flood the Market, Triggering FOMO and Driving the Price to $10 at $2 Buy-In",
    "url": "https://www.crypto-news-flash.com/ripple-lawyer-xrp-at-current-price-of-0-49-is-super-cheap-investors-expected-to-flood-the-market-triggering-fomo-and-driving-the-price-to-10-at-2-buy-in/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-lawyer-xrp-at-current-price-of-0-49-is-super-cheap-investors-expected-to-flood-the-market-triggering-fomo-and-driving-the-price-to-10-at-2-buy-in",
    "description": "<p>Attorney John Deaton has shared his take on the current and future price outlook for XRP. He believes massive FOMO will set in when the asset touches $2. XRP, the digital currency linked to the Ripple payment network, has been experiencing a surge in price in recent weeks. According to John Deaton, a pro-XRP attorney [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/ripple-lawyer-xrp-at-current-price-of-0-49-is-super-cheap-investors-expected-to-flood-the-market-triggering-fomo-and-driving-the-price-to-10-at-2-buy-in/\">Ripple Lawyer: XRP at Current Price of $0.49 Is Super Cheap; Investors Expected to Flood the Market, Triggering FOMO and Driving the Price to $10 at $2 Buy-In</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-30T18:03:59.000Z",
    "title": "Polygon and Altr Collaborate to Bring the Legendary Ferrari F40 as the Inaugural Luxury Car on Their Platform: Unlocking Luxury on the Blockchain",
    "url": "https://www.crypto-news-flash.com/polygon-and-altr-collaborate-to-bring-the-legendary-ferrari-f40-as-the-inaugural-luxury-car-on-their-platform-unlocking-luxury-on-the-blockchain/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-and-altr-collaborate-to-bring-the-legendary-ferrari-f40-as-the-inaugural-luxury-car-on-their-platform-unlocking-luxury-on-the-blockchain",
    "description": "<p>Lucidao partners with Polygon to integrate the newly launched Altr marketplace. Ferrari F40 will be the first car to feature on the Altr platform. Lucidao, a governance protocol connecting crypto holders with traditional business owners, has announced that it is partnering with Polygon, a blockchain platform developed to establish a multi-chain blockchain system that seamlessly [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/polygon-and-altr-collaborate-to-bring-the-legendary-ferrari-f40-as-the-inaugural-luxury-car-on-their-platform-unlocking-luxury-on-the-blockchain/\">Polygon and Altr Collaborate to Bring the Legendary Ferrari F40 as the Inaugural Luxury Car on Their Platform: Unlocking Luxury on the Blockchain</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-30T18:01:09.000Z",
    "title": "TMS Network (TMSN) Maintains Superiority, Casts Doubt on Shiba Inu (SHIB) and Polkadot (DOT)",
    "url": "https://www.crypto-news-flash.com/tms-network-tmsn-maintains-superiority-casts-doubt-on-shiba-inu-shib-and-polkadot-dot/?utm_source=rss&utm_medium=rss&utm_campaign=tms-network-tmsn-maintains-superiority-casts-doubt-on-shiba-inu-shib-and-polkadot-dot",
    "description": "<p>For years, many traders have basked in failure due to ineffective trading tools and platforms. However, a new age of trading revolution has begun with the launch of the TMS Network (TMSN). This decentralized trading protocol is a game changer in the ever-evolving crypto trading landscape. The platform is a game changer that revolutionizes trading [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/tms-network-tmsn-maintains-superiority-casts-doubt-on-shiba-inu-shib-and-polkadot-dot/\">TMS Network (TMSN) Maintains Superiority, Casts Doubt on Shiba Inu (SHIB) and Polkadot (DOT)</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-30T18:05:25.000Z",
    "title": "Bitcoin Bullish Trend Reversal Around the Corner As Nasdaq Rally Accelerates: SwissBlock",
    "url": "https://dailyhodl.com/2023/05/30/bitcoin-bullish-trend-reversal-around-the-corner-as-nasdaq-rally-accelerates-swissblock/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/short-btc-see.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/short-btc-see.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/short-btc-see.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/short-btc-see.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/short-btc-see.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/short-btc-see.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/short-btc-see.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trend reversal to the upside is brewing for Bitcoin (BTC) based on multiple flashing signals, according to analytics firm SwissBlock. In a new report, SwissBlock says that there&#8217;s a risk-on sentiment in equities, specifically the rallying Nasdaq index, which could easily spill over to crypto. The firm also says that there was previously a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/30/bitcoin-bullish-trend-reversal-around-the-corner-as-nasdaq-rally-accelerates-swissblock/\">Bitcoin Bullish Trend Reversal Around the Corner As Nasdaq Rally Accelerates: SwissBlock</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]