[
  {
    "source": "Decrypt",
    "date": "2024-02-17T13:01:02.000Z",
    "title": "This Week in Coins: Bitcoin Closes Week Strong, Simmering Above $51K",
    "url": "https://decrypt.co/217880/this-week-in-coins-bitcoin-above-50000",
    "description": "Bitcoin started the week strong, and despite a Valentine's Day dip, has since been simmering near $52,000."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-17T13:03:23.000Z",
    "title": "Yuga Labs’ Acquisition of Proof Fuels Moonbirds NFT Sales Uptick",
    "url": "https://news.bitcoin.com/yuga-labs-acquisition-of-proof-fuels-moonbirds-nft-sales-uptick/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/mbvvv67-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Yuga Labs&#039; Acquisition of Proof Fuels Moonbirds NFT Sales Uptick\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/mbvvv67-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/mbvvv67-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/mbvvv67-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/mbvvv67-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/mbvvv67-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/mbvvv67-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/mbvvv67.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Friday saw Yuga Labs, known for creating the Bored Ape Yacht Club (BAYC) non-fungible token (NFT) series, unveiled its acquisition of Proof, a notable NFT startup behind the Moonbirds collection. Kevin Rose, founder of Proof, will assume an advisory role within Yuga, and the startup&#8217;s team plans to integrate into the Yuga framework. Moonbirds NFT [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-17T13:00:32.000Z",
    "title": "Modern Warfare 3 Possibly Coming to Xbox Game Pass",
    "url": "https://www.cryptopolitan.com/warfare-3-possibly-coming-to-xbox-game-pass/",
    "description": "Microsoft&#8217;s recent acquisition of Activision Blizzard has sparked speculation among Call of Duty enthusiasts, particularly regarding the potential addition of Modern Warfare 3 to the Xbox Game Pass library. This move signifies significant implications for the gaming community, with Xbox and PC gamers eagerly anticipating new additions to the subscription service. Uncertain arrival of Xbox [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-17T13:00:00.000Z",
    "title": "Dogecoin (DOGE) Won’t Hit $1, While This New Alternative Is Poised to Do So in Q1 of 2024",
    "url": "https://www.cryptopolitan.com/dogecoin-doge-wont-hit-1-while-this-new-alternative-is-poised-to-do-so-in-q1-of-2024/",
    "description": "As Dogecoin (DOGE) struggles to reach the highly anticipated $1 milestone, a new contender is swiftly rising in the cryptocurrency realm, capturing the attention of investors with its promising potential. This emerging alternative, characterized by innovative technology and a strong underlying ecosystem, is not just turning heads but is also on track to achieve what [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-17T13:00:00.000Z",
    "title": "Why Bitcoin Jumped Past $50,000: Top 3 Factors; Market Experts Bullish on Injective and Shiba Inu Killer",
    "url": "https://www.cryptopolitan.com/why-bitcoin-jumped-past-50000-top-3-factors-market-experts-bullish-on-injective-and-shiba-inu-killer/",
    "description": "Bitcoin&#8217;s recent surge past the $50,000 mark has reignited interest and optimism in the cryptocurrency market. This significant milestone comes amid a backdrop of evolving market dynamics and increasing mainstream acceptance of digital assets. While Bitcoin&#8217;s rally captures headlines, attention also turns to top altcoins like Injective and Rebel Satoshi ($RBLZ), gaining traction among market [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-17T13:06:05.000Z",
    "title": "PEPE PRICE ANALYSIS & PREDICTION (February 17) – Pepe Rejects Crucial Resistance After Two-Week Bounce, Can It Breakthrough? ",
    "url": "https://nulltx.com/pepe-price-analysis-prediction-february-17-pepe-rejects-crucial-resistance-after-two-week-bounce-can-it-breakthrough/",
    "description": "Pepe has demonstrated bullish signs following a dramatic 30% increase over the past two weeks. However, it just encountered a crucial resistance and primes to break out of its two-month bearish phase. Following a breakdown to a low of $0.00000087 this month, Pepe established support there and started to increase. [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-17T13:00:35.000Z",
    "title": "BONK PRICE ANALYSIS & PREDICTION (February 17) – Bonk Resumes Bullish",
    "url": "https://nulltx.com/bonk-price-analysis-prediction-february-17-bonk-resumes-bullish/",
    "description": "After witnessing a roller coaster for two months, Bonk found support last week and began to increase daily. It has recovered well in the past week, surpassing Doge and Shiba Inu in terms of gains.  The past few days have been an interesting moment for Bonk following a bounce off [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-17T12:56:16.000Z",
    "title": "Cardano and Polkadot poised for breakouts as GFOX prepares to go live",
    "url": "https://crypto.news/cardano-and-polkadot-poised-for-break-outs-as-gfox-prepares-to-go-live/",
    "description": "Galaxy Fox gears up for launch, catching eyes alongside ADA and DOT&#8217;s market moves. With its unique ecosystem, GFOX is a presale to watch. The crypto community is closely watching Galaxy Fox, a new project poised for launch on retail&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-17T12:59:22.000Z",
    "title": "Hot New Memecoin Is Surging, Toncoin (TON) and Celestia (TIA) Are Struggling for Momentum",
    "url": "https://www.newsbtc.com/all/hot-new-memecoin-is-surging-toncoin-ton-and-celestia-tia-are-struggling-for-momentum/",
    "description": "Despite the recent market surge, Toncoin and Celestia have lost their momentum. Both projects have seen price declines over the last 24 hours, causing investors to jump boat and diversify. Meanwhile, a new meme coin is surging during its presale. Now, as early investors prepare for returns of 220%, experts believe this project could become one of the biggest meme coins of 2024. Toncoin Pioneers New DeFi Developments Toncoin is working to bridge the gap between DeFi and real-world applications. Over the last month, Toncoin’s new development has made it possible for users to buy anonymous phone numbers. The altcoin also set a new translation speed record, with 104,715 transactions per second. These developments have put Toncoin on the radar of many investors, however, the altcoins price performance has been poor. Over the last month, Toncoin’s price decreased by 5.55%, while many projects saw increases of over 20%. Consequently, Toncoin&#8217;s popularity has decreased, and its daily trading volume has fallen to just $41 million. According to CoinMarketCap, this makes Toncoin the #160 ranked cryptocurrency by daily trading volume, despite TON being the 15th ranked cryptocurrency by market cap. Celestia Crashes After Hitting An All-Time High On February 10, Celestia hit a new all-time high of $20.91. This achievement helped Celestia make global headlines, during which Celestia’s daily trading volume surged. However, since hitting this milestone, Celestia’s momentum has crashed. The altcoin hit a strong resistance, and its price is down by 12.62% to $18.21. This price crash has caused Celestia’s daily trading volume to fall to $220 million, and some investors are now selling their TIA tokens. Nonetheless, experts remain bullish about Celestia. According to bullish market predictions, Celestia could hit $30 by the end of Q1. This significant increase would make Celestia one of the markets best-performing altcoins, though it would require the general crypto market to remain bullish for at least another month. Investors Choose This New Altcoin Over Trending Cryptos As several altcoins start to lose their momentum, many investors are choosing to diversify with a popular new meme coin, KangaMoon. KangaMoon (KANG) has quickly attracted a bullish investor community with its hybrid social-fi and P2E model. Unlike other meme coins, KangaMoon offers fantastic utility and gives its player base several different income opportunities. For example, KangaMoon users will be able to complete weekly, monthly, and quarterly challenges to win the project&#8217;s native token, KANG. Furthermore, during the KangaMoon presale, investors who actively promote the project will be granted additional KANG rewards. The KangaMoon ecosystem is designed to promote social activity. Users will be rewarded for engaging with players, with more social activity leading to greater social rewards. The aim of this is to create a vibrant, exciting community where DeFi enthusiasts can network, build new connections, and more. KANG tokens are currently available for $0.005, though are expected to increase in value soon as stage 1 of the KangaMoon presale sells out. During its presale, analysts speculate that KangaMoon could offer returns of over 220%, which has made the presale a popular option among altcoin investors. Can KangaMoon Outpace Toncoin and Celestia? Having already gained significant momentum, KangaMoon is expected to outperform Toncoin and Celestia in Q1. Once it launches on Tier-1 exchanges, experts speculate that KangaMoon could offer additional returns of up to 350%, which has made the meme coin a highly anticipated project. Discover the Exciting Opportunities of the Kangamoon (KANG) Presale Today! Website: https://Kangamoon.com/ Join Our Telegram Community: https://t.me/Kangamoonofficial"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-17T12:47:00.000Z",
    "title": "Coinbase Manages 90% Of All Bitcoin ETF Assets: Brian Armstrong",
    "url": "https://coinedition.com/coinbase-manages-90-of-all-bitcoin-etf-assets-brian-armstrong/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coinbase Manages 90% Of All Bitcoin ETF Assets: Brian Armstrong\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-3-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Coinbase CEO Brian Armstrong, as the custodian of 8 of the 11 newly launched ETFs, Coinbase manages 90% of approximately $37 billion in Bitcoin ETF assets. He noted that Coinbase has seen net inflows into its retail and institutional products since the launch of the ETF. While laying out some significant aspects of [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/coinbase-manages-90-of-all-bitcoin-etf-assets-brian-armstrong/\">Coinbase Manages 90% Of All Bitcoin ETF Assets: Brian Armstrong</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-17T12:45:08.000Z",
    "title": "Trader Says AI-Focused Altcoin Will Soar Much Higher in Coming Months, Updates Outlook on Bitcoin and Chainlink",
    "url": "https://dailyhodl.com/2024/02/17/trader-says-ai-focused-altcoin-will-soar-much-higher-in-coming-months-updates-outlook-on-bitcoin-and-chainlink/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/Says-AI-Focused-Altcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/Says-AI-Focused-Altcoin.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2024/02/Says-AI-Focused-Altcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/Says-AI-Focused-Altcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/Says-AI-Focused-Altcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/Says-AI-Focused-Altcoin.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/02/Says-AI-Focused-Altcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto analyst believes one artificial intelligence (AI)-focused project could remain in an uptrend for months. The pseudonymous trader known as Altcoin Sherpa tells his 207,300 followers on the social media platform X that the decentralized artificial intelligence platform for applications Fetch.ai (FET) may rally “much higher” from its current value. &#8220;FET: still looks [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/17/trader-says-ai-focused-altcoin-will-soar-much-higher-in-coming-months-updates-outlook-on-bitcoin-and-chainlink/\">Trader Says AI-Focused Altcoin Will Soar Much Higher in Coming Months, Updates Outlook on Bitcoin and Chainlink</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]