[
  {
    "source": "CoinDesk",
    "date": "2023-08-23T07:56:53.000Z",
    "title": "Thailand’s New Pro-Crypto Prime Minister Was an Active Crypto Investor",
    "url": "https://www.coindesk.com/business/2023/08/23/thailands-new-pro-crypto-prime-minister-was-an-active-crypto-investor/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The resolution of political drama and appointment of Srettha Thavisin as Thailand’s next Prime Minister means a 10,000 THB ‘airdrop’ is likely happening."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-23T07:54:19.000Z",
    "title": "Binance Data Tells All: Accused of Violating Russian Sanctions: WSJ",
    "url": "https://cryptobriefing.com/binance-investigated-by-another-us-agency/?utm_source=feed&utm_medium=rss",
    "description": "Fresh scrutiny emerges as Binance faces allegations regarding its trading activities in Russia and potential sanctions evasions."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-23T07:45:11.000Z",
    "title": "\n                        Balancer Discloses Critical Vulnerability Affecting Its V2 Pools\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/balancer-discloses-critical-vulnerability-affecting-its-v2-pools",
    "description": "\n                        <p dir=\"ltr\">Liquidity protocol Balancer has disclosed that it has discovered a critical vulnerability that has impacted over 100 of its v2 pools spread across eight different blockchains.&nbsp;</p>\n<p dir=\"ltr\">The team at Balancer has posted a list of the impacted pools on its GitHub page while also activating its emergency subDAO.&nbsp;</p>\nCritical Vulnerability Discovered&nbsp;\n<p dir=\"ltr\">Balancer announced the discovery of the vulnerability in a post on X (formerly Twitter), stating that it had initiated emergency mitigation features. The protocol also urged users to withdraw funds from the impacted pools.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;Balancer has received a critical vulnerability report affecting a number of V2 Pools. Emergency mitigation procedures have been executed to secure a majority of TVL, but some funds remain at risk. Users are advised to withdraw affected LPs immediately.&rdquo;</p>\n\n<p dir=\"ltr\">The protocol stated that the issue had been mitigated in about 80% of the impacted pools. Meanwhile, the remaining 20% of the impacted pools represented around 4% of Balancer&rsquo;s total value locked (TVL). Balancer stated in its forum,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;Balancer Labs received a report of a critical vulnerability affecting a number of pools. We were able to mitigate over 80% of these; the remaining funds at risk represent about 4% of Balancer TVL.&rdquo;</p>\n\nFunds Remain Safe&nbsp;\n<p dir=\"ltr\">The protocol also assured users that, at this point, the vulnerability had not been exploited, and all funds remained safe. Balancer added that pools labeled mitigated were safe but still urged users to migrate to safe pools or withdraw for the time being. The team also urged liquidity providers to exit their positions from impacted pools immediately. Jeff Bennett, a software engineer at Balancer Labs, said in a post,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;We believe funds in the mitigated pools (labeled &lsquo;mitigated&rsquo;) are safe, but nevertheless strongly recommend timely migration to safe pools or withdrawal. Pools that could not be mitigated are labeled &lsquo;at risk.&rsquo; If you are [a liquidity provider] in any of these pools, please exit immediately.&rdquo;</p>\n\n<p dir=\"ltr\">Users have heeded the warnings from the protocol following the discovery of the vulnerability. As a result of users withdrawing liquidity, the protocol&rsquo;s total value locked dropped by nearly $100 million amidst the rush of withdrawals. Balancer has also stated that it would be conducting a thorough post-mortem of the vulnerability and would publish details about it and how it was addressed soon.&nbsp;</p>\n<p dir=\"ltr\">This is not the first time Balancer has asked users to pull liquidity from its pools. In January, the protocol had advised liquidity providers to pull liquidity citing &ldquo;ongoing issues.&nbsp;</p>\nBalancer&rsquo;s Native Token Registers Significant Drop&nbsp;\n<p dir=\"ltr\">The unfolding situation unsurprisingly had an immediate impact on the market. As a result of the discovery of the vulnerability, Balancer&rsquo;s native BAL token registered a drop of over 4%. However, the value has recovered with the protocol moving swiftly to mitigate the vulnerability and communicate with users. Currently, the token is trading at around $3.51, according to data from CoinMarketCap.&nbsp;</p>\n<p dir=\"ltr\">Meanwhile, Spencer Hughes, a Blockworks Research Analyst, observed that the discovery of the Balancer vulnerability demonstrated the fact that smart contract audits cannot guarantee complete safety. However, he added that these audits never claimed to be a hundred percent foolproof.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;With ~$830M TVL, a Balancer exploit would have left one of the most prominent DEXs for dead. Emergency SubDAOs are definitely very important for all DeFi protocols, and it is great that they were able to act before anything malicious could occur.&rdquo;</p>\n\nThe Curve Hack\n<p dir=\"ltr\">While Balancer has moved fast to mitigate any potential damage, the DeFi space has been reeling from a spate of exploits. Recently, an exploit in the Curve Finance platform put over $100 million in crypto at risk, significantly amplifying concerns around the decentralized finance (DeFi) ecosystem. At the heart of the exploit was a re-entrancy bug that was found in Vyper, a programming language critical to Curve&rsquo;s system.</p>\n<p dir=\"ltr\">The vulnerability allowed hackers to drain several stablecoin pools on Curve, leading to a significant disruption of the price and liquidity of several DeFi services. Other major exploits in the DeFi space include the Ronin exploit, which saw the Ronin Network lose a staggering $622 million. The exploit was a result of a breach in the Ethereum sidechain. BadgerDAO also fell victim to hackers, losing around $80 million to hackers.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-23T07:41:33.000Z",
    "title": "\n                        Litecoin and Filecoin Hope For A Positive Response As Pomerdoge Makes A Case For The Next Market Bull Run\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/litecoin-and-filecoin-hope-for-a-positive-response-as-pomerdoge-makes-a-case-for-the-next-market-bull-run",
    "description": "\n                        <p class=\"s7\">If you are searching for a project to multiply your investment, Pomerdoge is the best option in the crypto world. Experts are highly bullish on it, and its market value can rise by 40x by the end of the year.</p>\n<p class=\"s7\">In fact, Litecoin (LTC) and Filecoin (FIL) holders have also shifted their sides to join this new project.</p>\nSummary\n● Gate.io has recently listed Litecoin (LTC) on its exchange.\n● Filecoin (FIL) has announced plans to launch a developer summit in September.\n● Pomerdoge has progressed toward 40x profit.\n<p>Click Here To Find Out More About The Pomerdoge (POMD) Presale</p>\nLitecoin (LTC) Secures First Listing Since The Halving\n<p class=\"s7\">Recently, the Litecoin (LTC) network underwent its halving event on August 2. This third edition of the Litecoin halving has reduced miners&rsquo; rewards from 12.5 LTC to 6.25 LTC. However, the halving event has failed to make any positive impact on the price of Litecoin (LTC).</p>\n<p class=\"s7\">The market value of Litecoin (LTC) has dipped by more than 20% in the past month. Subsequently, the current trading price of Litecoin (LTC) has tumbled to $83.11.</p>\n<p class=\"s7\">Meanwhile, Litecoin (LTC) secured its first listing post-halving. Recently, Gate.io, a leading crypto trading platform, announced the mega listing of Litecoin (LTC).</p>\nFilecoin (FIL) Announces Dev Summit\n<p class=\"s7\">To keep its community engaged and active, Filecoin (FIL) recently announced the first-ever Dev Summit. As per the official notification from Filecoin (FIL), the summit will take place in September 2023 in both Ireland and Singapore.</p>\n<p class=\"s7\">Under this summit, Filecoin (FIL) will provide developers with a chance to shape the network&rsquo;s protocol and tooling. However, the price movement of Filecoin (FIL) has remained in the red zone for the past many weeks. Subsequently, the trading price of Filecoin (FIL) has plunged by more than 11% in the last month.</p>\n<p class=\"s7\">At press time, a Filecoin (FIL) token can be purchased at $4.12.</p>\nPomerdoge (POMD) Presale Surges In Value\n<p class=\"s7\">A recent market report has suggested that the global blockchain gaming market size can surge to $301.53 billion over the next seven years. Subsequently, it has also become a favorite of investors looking to strengthen their portfolios.</p>\n<p class=\"s7\">To make the most out of this growth opportunity, Pomerdoge, a new P2E meme coin, has unveiled a hybrid business plan. Pomerdoge has the best features of two verticals: the popularity of meme coins, and the utility of gaming tokens. It will soon introduce a new P2E game, Pomergame, with several exciting features. One of them is allowing players to build their avatars, and create customized in-game assets.</p>\n<p class=\"s7\">Another important component of the platform is Pomerplace. It will provide an arena where players can compete against each other to earn rewards. They can also sell or trade their customized in-game items at Pomerplace to generate extra income. Pomerdoge has announced releasing 7,777 NFTs during the presale. However, only POMD owners will be allowed to purchase these NFTs, which will offer a range of benefits.</p>\n<p class=\"s7\">The presale phase of Pomerdoge is undergoing the first round, and a POMD token costs $0.008. Notably, it was just $0.007 at the time of the presale launch. Experts express confidence that the token&rsquo;s value will jump by 1,700% during the presale. It is also likely to offer a 4,000% ROI to its presale investors by the end of 2023. After the presale, POMD tokens will be available to purchase on the Uniswap exchange.</p>\n<p class=\"s17\">Find out more about the Pomerdoge (POMD) Presale Today</p>\n<p class=\"s17\">Website: https://pomerdoge.com/</p>\n<p class=\"s17\">Telegram Community: https://t.me/pomerdoge</p>\n<p class=\"s7\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n                    "
  },
  {
    "source": "BTCManager",
    "date": "2023-08-23T08:08:06.000Z",
    "title": "Bitcoin spot ETF launches on Euronext, analysts expect more growth for this AI-centric altcoin",
    "url": "https://crypto.news/bitcoin-spot-etf-launches-on-euronext-analysts-expect-more-growth-for-this-ai-centric-altcoin/",
    "description": "This article explores InQubeta's growth potential while shedding light on Europe's new Bitcoin exchange-traded fund (ETF)"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T07:45:21.000Z",
    "title": "Bitcoin Market Analysis: Key Price Levels And Metrics To Watch",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-market-analysis-key-price-levels-and-metrics-to-watch/",
    "description": "As the Bitcoin market navigates the choppy waters around $26,000, there are several metrics to keep an eye on. After hitting a low of $25,374 yesterday, the bulls have managed to push the price back up, although the market remains in a vulnerable state following last Thursday&#8217;s price crash. Currently, the Fear and Greed Index for Bitcoin sits at 37, which is indicative of strong fear permeating the market. Typically, such a low level on this index suggests that market participants are apprehensive about the near-term future, often leading to a self-fulfilling prophecy of sorts where the selling pressure increases. An In-Depth Look At Bitcoin CVDs &#38; Delta Renowned analyst Skew has highlighted the role of Cumulative Volume Delta (CVD) in understanding the current market dynamics today. &#8220;BTC Aggregate CVDs &#38; Delta reveal limit spot sellers here with shorts pushing for control.&#8221; This means that even as traders are looking to buy at market prices (takers), those willing to sell are setting limits, adding a ceiling to any short-term bullish momentum. Related Reading: Bitcoin Chicken Game: Why Losing This Level Could Send BTC Back To $20,000 The specific price point to note here is $26,100. &#8220;This level has acted as a magnet for limit sellers,&#8221; Skew notes, &#8220;and is backed by the pattern seen in spot CVD versus price so far.&#8221; In other words, spot takers are being absorbed by limit sellers at this price, constraining upward movement. Perpetual CVD (Perp CVD) also deserves attention as it &#8220;moves lower in line with longs closing out and new shorts coming in.&#8221; This suggests that traders are not only covering their long positions but also opening new short positions, in line with the current bearish price action. Examining specific exchanges like Binance and Bybit gives further granularity to the analysis. According to Skew, &#8220;Longs got rinsed in that sweep below $25,800, thereby marking that level as a key pivot point.&#8221; Open Interest (OI) on Binance saw a reduction of 6,000 BTC, and Bybit OI was down by 3,000 BTC &#8211; all in long positions that were liquidated. Related Reading: Will Bitcoin Show A Repeat Of The March Rebound? The liquidation of longs at these levels presents a clear risk for any bullish scenarios. &#8220;Clear risk for longs is below $25,800,&#8221; Skew asserts, making it an essential level to watch for traders who are net long. MacroCRG, a renowned market analyst, added to the analysis that large amount of longs were liquidated again during yesterday&#8217;s BTC dip: &#8220;More pain for #Bitcoin longs as another $300M+ of open interest was wiped out overnight by a downside sweep. When will it end?&#8221; However, there could be a silver lining, as Skew puts it: &#8220;Likely to see apes rage shorting this soon.&#8221; But so far, Bitcoin&#8217;s open interest (OI) remains flat after Thursday&#8217;s flush. OI currently stands at $10.88 billion (after being above $14 billion). BTC&#8217;s OI-weighted funding rate has already turned positive again at +0.0060. If the value turns negative for several days, as it did before the March 2023 rally, it could be a sign that a short squeeze is on the cards. However, after Thursday&#8217;s crash, the metric remained in negative territory only for a short time. BTC Short-Term Holders and Velocity On-chain specialist Axel Adler Jr. points out that the short-term Bitcoin holders (STH) cohort has decreased their holdings by a significant 400,000 BTC. This mass exodus has put considerable selling pressure on the market, rendering many STHs &#8220;underwater&#8221; and thereby less likely to engage in bullish behavior. Moreover, Adler emphasizes the BTC Velocity metric, stating, &#8220;At the beginning of this year, the BTC Velocity metric dropped to its minimum level.&#8221; This extremely low velocity indicates not just low volatility, but also a lack of market participant activity &#8211; a concerning sign for any imminent bullish turn. Therefore, Adler concludes: Taking into account these two factors, as well as the fact that the STH cohort has traditionally been the primary player creating volatility in the BTC market, recovery after this drop will require more time than usual and may take an indefinite period. At press time, BTC traded at $26,114. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T08:00:48.000Z",
    "title": "Despite Market Fluctuations, Coinbase Advocates for Continuous Bitcoin and Crypto Investment, and Whales Rally Behind This Promising AI Project’s Presale",
    "url": "https://www.crypto-news-flash.com/despite-market-fluctuations-coinbase-advocates-for-continuous-bitcoin-and-crypto-investment-and-whales-rally-behind-this-promising-ai-projects-presale/?utm_source=rss&utm_medium=rss&utm_campaign=despite-market-fluctuations-coinbase-advocates-for-continuous-bitcoin-and-crypto-investment-and-whales-rally-behind-this-promising-ai-projects-presale",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-70.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-70.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-70-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-70-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />A leading cryptocurrency exchange, Coinbase, recently obtained authorization to introduce regulated futures trading to crypto users. This approval has prompted Coinbase to advocate for the continuous growth of prominent cryptocurrencies such as Bitcoin (BTC) and other crypto assets. Simultaneously, major crypto whales rally behind a new, potentially high-yielding crypto project, InQubeta (QUBE). InQubeta is a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T07:49:37.000Z",
    "title": "Shiba Inu Surpasses 10 Million as Shibarium’s Public Restarts and SHIB Price Poised to Skyrocket to $0.00001",
    "url": "https://www.crypto-news-flash.com/shiba-inu-surpasses-10-million-as-shibariums-public-restarts-and-shib-price-poised-to-skyrocket-to-0-00001/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-surpasses-10-million-as-shibariums-public-restarts-and-shib-price-poised-to-skyrocket-to-0-00001",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-96.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-96.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-96-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Shibarium, Shiba Inu&#8217;s Layer-2 network, is almost set for a public restart after fixing initial launch issues. Over 10 million wallets registered after Shibarium&#8217;s launch, showcasing the massive community support. In an exciting update, Shiba Inu developers have been actively addressing the challenges faced during the initial launch of the Shibarium network, as reported by [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-23T07:50:14.000Z",
    "title": "Crypto Critics WARN YOU about this BULLISH Project",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/crypto-critics-warn-you-about-this-bullish-project/",
    "description": "<p>Friend Tech, this viral new app on Coinbase&#8217;s layer 2 is making people rich. Some of the top Friend Tech accounts have earned more than $10k in just 2 weeks. What is this new craze all about? In just 11 days Friend tech has outperformed established players in the crypto ecosystem, including Uniswap and the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/crypto-critics-warn-you-about-this-bullish-project/\">Crypto Critics WARN YOU about this BULLISH Project</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]