[
  {
    "source": "Cointelegraph",
    "date": "2024-02-21T04:29:51.000Z",
    "title": " Stellar launches smart contracts following bug fix delays ",
    "url": "https://cointelegraph.com/news/stellar-launches-smart-contract-soroban-bug-fix-delays",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMjVjYmQzNDctYjkyNS00MzRkLWE0MjctZDUwMTAwYjM3YjNkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Stellar Development Foundation has finally rolled out Stellar smart contracts after 16 months on testnet. </p>\n                    <p><p>The Stellar Development Foundation (SDF) has announced the deployment of smart contracts on the Stellar network, something it claims will help kick off “a new era” for its tech stack.</p><p>In a Feb. 20 <a href=\"https://stellar.org/blog/developers/protocol-20-and-smart-contracts-are-live-on-mainnet\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, the SDF shared that Stellar network validators successfully introduced the “Protocol 20” upgrade, enabling new <a href=\"https://cointelegraph.com/learn/what-are-smart-contracts-a-beginners-guide-to-automated-agreements\">smart contracts</a> capabilities and initiating the phased rollout of its smart contract platform dubbed Soroban. </p><p>Stellar smart contracts will aim to provide a more user-friendly developer experience for those using the Rust and WASM (WebAssembly) languages. </p><p><a href=\"https://cointelegraph.com/news/stellar-launches-smart-contract-soroban-bug-fix-delays\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-21T04:31:07.000Z",
    "title": "Nvidia Leads AI Stocks with Expectations of More AI Earnings Surge",
    "url": "https://www.cryptopolitan.com/nvidia-leads-ai-stocks-with-expectations/",
    "description": "In the realm of AI stocks, Nvidia stands at the forefront, poised to continue its remarkable trajectory of earnings growth. As Wall Street anticipates the chipmaker&#8217;s earnings call this week, expectations are high, with analysts projecting revenues nearing $20 billion for the quarter. Nvidia&#8217;s pivotal role in the burgeoning generative AI space has not only [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-21T04:12:40.000Z",
    "title": "Puffer Finance TVL crosses $1 billion in 3 weeks – Team plans TVL safety",
    "url": "https://www.cryptopolitan.com/puffer-finance-tvl-crosses-1b-in-3-weeks/",
    "description": "Puffer Finance, a liquid restaking protocol, has achieved a significant milestone by surpassing $1 billion in Total Value Locked (TVL) in just three weeks since its inception. This remarkable achievement underscores the platform&#8217;s rapid growth and strong community support within the decentralized finance (DeFi) ecosystem. Puffer Finance offers users the opportunity to restake their assets [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-21T04:25:26.000Z",
    "title": "Ethereum Price Hits $3K But The Bulls Are Not Done Yet",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-hits-3k/",
    "description": "Ethereum price climbed further higher and broke the $3,000 resistance. ETH is still showing positive signs and might extend gains toward $3,120. Ethereum extended its rally above the $2,980 and $3,000 levels. The price is trading above $3,000 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2,950 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move up toward the $3,120 resistance zone. Ethereum Price Extends Rally Ethereum price formed a base above the $2,850 level and started another increase. ETH cleared the $2,920 resistance zone and outperformed Bitcoin. Finally, the price climbed above the $3,000 barrier. A new multi-week high is formed near $3,032 and the price is now consolidating gains. Ether is stable near the 23.6% Fib retracement level of the recent increase from the $2,876 swing low to the $3,032 high. There is also a key bullish trend line forming with support at $2,950 on the hourly chart of ETH/USD. Ethereum is now trading above $3,000 and the 100-hourly Simple Moving Average. Immediate resistance on the upside is near the $3,040 level. The first major resistance is near the $3,065 level. The next major resistance is near $3,120, above which the price might rise and test the $3,220 resistance zone. Source: ETHUSD on TradingView.com If there is a move above the $3,220 resistance, Ether could even rally toward the $3,350 resistance. Any more gains might call for a test of $3,500. Downside Correction In ETH? If Ethereum fails to clear the $3,040 resistance, it could start a downside correction. Initial support on the downside is near the $2,995 level. The first major support is near the $2,950 level and the trend line zone. It is close to the 50% Fib retracement level of the recent increase from the $2,876 swing low to the $3,032 high. The next key support could be the $2,910 zone. A clear move below the $2,910 support might send the price toward $2,880 or the 100-hourly Simple Moving Average. The main support could be $2,850. Any more losses might send the price toward the $2,720 level in the coming sessions. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $2,950 Major Resistance Level – $3,040"
  }
]