[
  {
    "source": "Crypto Daily",
    "date": "2023-08-19T19:00:00.000Z",
    "title": "Shiba Inu’s (SHIB) Record Highs -  Can SHIB Match Pomerdoge’s (POMD) Record Highs",
    "url": "https://cryptodaily.co.uk/2023/08/shiba-inus-shib-record-highs-can-shib-match-pomerdoges-pomd-record-highs",
    "description": "<p class=\"s7\">The last few weeks have seen some exciting events. Shiba Inu (SHIB) and Pomerdoge have been in the lead. However, analysts prefer Pomerdoge over Shiba Inu (SHIB) for better gains. The former is a new project, and is still in its presale. But experts opine that it will grow at least 4,000% in 2023.</p>\nSummary\n● Shiba Inu (SHIB) has grown by more than 25% since July 1.\n● Pomerdoge is likely to grow by 4,000% in the next four months.\n<p class=\"s13\">Click Here To Find Out More About The Pomerdoge (POMD) Presale</p>\nShiba Inu (SHIB) Gains Massively From Shibarium Mania\n<p class=\"s7\">Shiba Inu (SHIB) has been on the rise lately, despite the overall market conditions being bearish. Decoupling with larger market trends, Shiba Inu (SHIB) has witnessed a rise in its market value in recent times. The price of Shiba Inu (SHIB) has soared by more than 16% in the last seven days. On the 30-day chart, Shiba Inu (SHIB) is up by more than 36%. Consequently, the trading price of Shiba Inu (SHIB) has increased to $0.000010.</p>\n<p class=\"s7\">The data from Kaiko shows that Shiba Inu (SHIB) had an explosion in developer activity, thereby supporting its price movement. The meme coin has grown by more than 25% since July 1. Notably, Shiba Inu (SHIB) has surpassed its arch-rival, Dogecoin, in network growth. The biggest reason behind this exponential growth of Shiba Inu (SHIB) is the upcoming Shibariummainnet launch. According to reports, Shiba Inu (SHIB) can launch the Shibarium mainnetbefore the end of August. Therefore, there is a strong mania around Shiba Inu (SHIB).</p>\n<p class=\"s7\">Another development that has helped Shiba Inu (SHIB) rise on the growth chart is the self-sovereign identity (SSI) protocol. Recently, Shiba Inu developers announced that they would tie digital identity verification, dubbed SSI, to all the development within the SHIB ecosystem. With this update, Shiba Inu (SHIB) aims to give users more control over their personal data. According to experts, this update can make Shiba Inu (SHIB) more attractive, as users are getting privacy-conscious.</p>\nPomerdoge (POMD) Presale Posts Ballistic Growth\n<p class=\"s7\">As per the latest market data, the global play-to-earn (P2E) NFT Games industry can rise at a CAGR of over 21% during the next five years. Pomerdoge has planned to launch a new P2E meme coin that will disrupt the blockchain gaming industry. The platform has attracted a large number of investors with its growth-oriented business roadmap.</p>\n<p class=\"s7\">It has brought a new P2E game, Pomergame. In this game, which has not been launched yet, players will get an opportunity to battle against each other, win rewards, and earn money. Players can also create and improve their characters with customized in-game items. If gamers get a gold status Pomer, they become eligible to sell or trade their in-game items with other members.</p>\n<p class=\"s7\">Pomerdoge has also planned to launch 7,777 non-fungible tokens (NFTs). However, one must be a POMD token owner to get an opportunity to purchase these exclusive NFTs. POMD will be the native crypto of the platform, and has been built on the Ethereum blockchain.</p>\n<p class=\"s7\">The project will have four stages of POMD&rsquo;s presale. At present, the platform&rsquo;s presale is in stage 1. The purchase price of a token has increased from $0.007 to $0.008. However, the token&rsquo;s market value can jump by 1,700% during the presale round, and 40x before the end of 2023. Additionally, Pomerdoge will give a $50,000 mega Pomer prize, and weekly giveawaysworth $100,000. Moreover, there is no buy or sell tax on POMD transactions, making it lucrative to savvy investors.</p>\nFind out more about the Pomerdoge (POMD) Presale Today\n<p class=\"s18\">Website: https://pomerdoge.com/</p>\n<p class=\"s7\">Telegram Community: https://t.me/pomerdoge</p>\n<p class=\"s7\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-19T19:00:00.000Z",
    "title": "OpenSea NFT Community Could Jump Ship to Everlodge.io Here's Why",
    "url": "https://cryptodaily.co.uk/2023/08/opensea-nft-community-could-jump-ship-to-everlodgeio-heres-why",
    "description": "<p>OpenSea is still the biggest NFT marketplace, but there are new players and competitors that offer things that Opensea doesn&rsquo;t. One example is an upcoming project called Everlodge, which allows people to buy NFTs that represent a share in luxury holiday projects. Here I&rsquo;ll explore both of them and the potential for the future.</p>\n<p>Join the Everlodge presale and win a luxury holiday to the Maldives</p>\nOpenSea is behind the times with Real World Assets NFTs\n<p>Founded in 2017, OpenSea is a grandaddy of Web3 at this point, given the speed at which blockchain technology progresses. With over 40 million NFTs for sale its the best place to find everything and anything, but not necessarily to find something truly special.</p>\n<p>Many customers are using Nifty or SuperRare to find truly special NFTs, and Blur, a newer market entrant. In May 2023, Blur emerged as the dominant NFT marketplace with an impressive 65% market share and $442 million in sales. They disrupted the market with their zero royalty fee platform and customer loyalty rewards. Meanwhile, OpenSea, once a heavyweight, struggled to keep up with Blur's disruptive approach. They eventually followed suit by offering zero royalty fees after experiencing traffic loss to Blur.</p>\n<p>However even Blur&rsquo;s success versus Opensea may be more to do with the fact that Blur incentivised people to do wash trading in order to receive Blur tokens.</p>\n<p>PFPs and in game NFTs have lost a lot of popularity and value this year, with industry experts turning towards tokenisation of financial products and also Real World Assets (RWA) such as property and art, and social projects. &nbsp;Since Opensea and Blur focuses mainly on the former types of NFTs, they arent keeping on trend with NFT options. Everlodge on the other hand, is part of a wider trend where NFTs have real use cases and tokenise RWA.</p>\nWhat Everlodge has to offer over Opensea in terms of NFTs and value\n<p>Everlodge provides the chance for people to make money in property, using NFTs. Luxury villas and holiday homes are fractionalised on the blockchain, with deeds in the metadata, and then sold in fractions to users.</p>\n<p>As property tends to go up, there is a good chance that the NFTs rise in value, as the properties do. &nbsp;But there&rsquo;s more ways to make money from Everlodge. &nbsp;One of the ways is to buy into their presale of their native token ELDG.</p>\n<p>Holders will get staking benefits with an APR of 10%, discounts in the Everlodge NFT marketplace, and lower fees on property maintenance costs. &nbsp;Holders can also provide liquidity and receive an APY for that. Owning an NFT also brings advantages since you get a timeshare in one of these luxury places. &nbsp;But for those who want to skip that they can then rent out their timeshare for extra income.</p>\n<p>Big players like Avalanche, Solana and Polygon are also just getting involved in the RWA tokenization space, showing how much room for growth there is in the industry. Boston Consulting Group predict that the space will be worth $16 trillion by 2030. Binacnce believe the figure is much higher due to the value of the total global asset market.</p>\n<p>ELDG is currently on offer for $0.01 and 40 million will be available at that price. That&rsquo;s bullish considering that 480 million tokens will be offered in the presale. This means that now is a great chance to get in, before the price increases. &nbsp;The token will launch for $0.035, and is expected to do around a 3000% after it goes live on Uniswap and certain CEXes.</p>\nFind out more about the Everlodge (ELDG) Presale\n<p class=\"s10\">Website: https://www.everlodge.io/</p>\n<p class=\"s11\">Telegram: https://t.me/everlodge</p>\n<p>&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-19T19:03:51.000Z",
    "title": "SheetGPT Revolutionizes Google Sheets with AI Integration",
    "url": "https://www.cryptopolitan.com/sheetgpt-revolutionizes-google-sheets/",
    "description": "In a significant leap forward for productivity and data analysis, SheetGPT has emerged as a transformative tool by seamlessly integrating artificial intelligence into Google Sheets. Priced at a mere $49, this AI-powered solution has the potential to reshape the way users interact with spreadsheet software. SheetGPT, a revolutionary AI tool, has taken center stage with ... <a title=\"SheetGPT Revolutionizes Google Sheets with AI Integration\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sheetgpt-revolutionizes-google-sheets/\" aria-label=\"More on SheetGPT Revolutionizes Google Sheets with AI Integration\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-19T18:55:38.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 As we venture into 2023 to 2032, the next decade promises to be a critical period for Aptos as it strives to establish itself as a significant blockchain platform. The rapidly changing market dynamics, technological advancements, and evolving adoption trends will undoubtedly shape Aptos&#8217;s path. Against this backdrop, investors and stakeholders ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-19T18:45:05.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "BTCManager",
    "date": "2023-08-19T18:57:45.000Z",
    "title": "Polkadot and Cosmos falling, Everlodge charting higher",
    "url": "https://crypto.news/polkadot-and-cosmos-falling-everlodge-charting-higher/",
    "description": "Polkadot (DOT) and Cosmos (ATOM) are down in the last month. While this prints out, Everlodge, a real estate platform, is trending higher. EGLD presale is ongoing"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-19T19:00:46.000Z",
    "title": "The $200 Million BNB Bridge Exploiter Just Got Liquidated On Venus",
    "url": "https://www.newsbtc.com/news/binance-coin/200-million-bnb-bridge-exploiter-liquidated/",
    "description": "According to Coinglass, the crypto market witnessed more than $1.04 billion in liquidations during this period. Of this, a BNB position on the Venus lending protocol belonging to the perpetrator of the BSC bridge $560M hack was liquidated. The BSC Bridge Hack: Understanding One of Crypto&#8217;s Biggest Exploits The BSC brdige hack in October 2022 was one of the biggest exploits in crypto and DeFi history, with the hacker stealing nearly $593 million in BNB. But the story didn’t end there as the hacker tried to launder as much money as they could.  Related Reading: Shibarium Launch Saga: Block Production Resumes Despite Stuck ETH After the attack, the hacker deposited 900,000 BNB worth $200 million on Venus as collateral to borrow $150 million worth of stablecoins. With more than $598.25 million in TVL, the Venus protocol is the second-largest DeFi protocol on the Binance Smart Chain.  According to DeFi researcher Ignas, the position was the &#8220;single largest potential liquidation in all #DeFi that cannot be closed.&#8221; This is because, while the BNB Chain was halted and the network upgrade after the exploit, the ecosystem was put at risk, as liquidation of such an amount could lead to a further plummet in the price of BNB.  As a result, the Venus DAO voted to whitelist BNB Chain as the sole liquidator of the hacker&#8217;s address in case of a margin call. Notably, a drop in the price of BNB to $220 would see the hacker&#8217;s collateral liquidated.  Now, with the price of the token experiencing a selloff in the past few days, the team has chosen to manually liquidate the position to reduce the impact of a margin call on the BSC ecosystem.  On-chain data from PeckShieldAlert shows that the position has been liquidated for 5.6 million BNB tokens worth $52.3 million, a fraction of the total position.  Following today’s market movement, the BNB Bridge exploiter account was made healthy as promised by @BNBCHAIN using whitelisted liquidation without any resulting shortfall or further impact to $bnb https://t.co/TGZ7nbiDPN — Venus Protocol (@VenusProtocol) August 18, 2023 What’s Next For BNB? Since that time, the price of BNB has dropped below $220. Now, the cryptocurrency is trading at $215.00, reflecting a drop of 10.76% in the past 7 days.  Related Reading: Valkyrie Taps Into Ethereum Momentum With New ETF Filing Although the token has had a tough time with its price in the past few months as the industry awaits the outcome of the SEC&#8217;s lawsuit against Binance.US, the toke still manages to stand strong than most would expect.  At this time, BNB has a market cap of $33 billion, making it the fourth-largest cryptocurrency.  Token price falls below hacker's liquidation price &#124; Source: BNBUSDT on Tradingview.com Featured image from Binance, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-19T18:45:58.000Z",
    "title": "Coinbase’s New Ethereum Layer-2 Briefly Surpasses Optimism and Arbitrum in Daily Transactions: On-Chain Data",
    "url": "https://dailyhodl.com/2023/08/19/coinbases-new-ethereum-layer-2-briefly-surpasses-optimism-and-arbitrum-in-daily-transactions-on-chain-data/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/new-ethereum-layer-data.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/new-ethereum-layer-data.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/new-ethereum-layer-data.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/new-ethereum-layer-data.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/new-ethereum-layer-data.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/new-ethereum-layer-data.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/new-ethereum-layer-data.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Coinbase’s new Ethereum (ETH) layer-2 scaling solution briefly surpassed Optimism (OP) and Arbitrum (ARB) this week in terms of daily transactions. According to data provided by each scaling solution&#8217;s respective block explorers, Base hit 617,330 transactions on August 13th, compared to 438,559 for Optimism and 544,575 for Arbitrum on the same day. Both Optimism and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/19/coinbases-new-ethereum-layer-2-briefly-surpasses-optimism-and-arbitrum-in-daily-transactions-on-chain-data/\">Coinbase’s New Ethereum Layer-2 Briefly Surpasses Optimism and Arbitrum in Daily Transactions: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]