[
  {
    "source": "NewsBTC",
    "date": "2023-06-26T02:59:55.000Z",
    "title": "Bitcoin Price Signals Downside Correction Before Fresh Increase",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-correction-29200/",
    "description": "Bitcoin price is correcting gains from the $31,400 zone. BTC could revisit the $29,200 support or even $28,500 before it starts a fresh increase. Bitcoin is currently correcting gains from the $31,400 zone. The price is trading below $30,500 and the 100 hourly Simple moving average. There is a connecting bearish trend line forming with resistance near $30,550 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to correct lower toward the $29,200 support or $28,500. Bitcoin Price Starts Downside Correction Bitcoin price remained well-bid above the $29,500 resistance zone. BTC cleared the $30,000 resistance to move further into a positive zone. Finally, there was a push above the $31,000 zone. The price tested the $31,500 zone. A high is formed near $31,435 and the price is now correcting lower. There was a move below the $30,500 level. The price traded below the 50% Fib retracement level of the upward move from the $29,550 swing low to the $31,435 high. Bitcoin price is now trading below $30,500 and the 100 hourly Simple moving average. There is also a connecting bearish trend line forming with resistance near $30,550 on the hourly chart of the BTC/USD pair. The pair is trading close to the 76.4% Fib retracement level of the upward move from the $29,550 swing low to the $31,435 high. If the price remains stable above the $30,000 level, it could soon start a fresh increase. On the upside, the price is facing resistance near the $30,400 level and the 100 hourly Simple moving average. Source: BTCUSD on TradingView.com The first major resistance is near the $30,550 level and the trend line, above which the price might revisit the $31,400 resistance zone. The next major resistance is near the $32,000 level. Any more gains could send the price toward the $32,500 resistance zone. More Downsides in BTC? If Bitcoin’s price fails to clear the $30,550 resistance, it could continue to move down. Immediate support on the downside is near the $30,000 level. The next major support is near the $29,550 level, below which there is a risk of a move toward the $29,200 support. Any more losses might send the price toward $28,500 in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is below the 50 level. Major Support Levels – $30,000, followed by $29,550. Major Resistance Levels – $30,400, $30,550, and $31,400."
  }
]