[
  {
    "source": "CoinDesk",
    "date": "2023-08-18T20:51:32.000Z",
    "title": "El Salvador Diary: Lightning Is Key to Bitcoin Adoption",
    "url": "https://www.coindesk.com/consensus-magazine/2023/08/18/el-salvador-diary-lightning-is-key-to-bitcoin-adoption/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "As he travels around the first country to adopt Bitcoin as legal tender, Jonathan Martin finds that few are using it. But Lightning integration could soon change the game."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T20:43:15.000Z",
    "title": "AI-Powered Security Tools and DARPA’s New Challenge for Open Source Developers",
    "url": "https://www.cryptopolitan.com/ai-powered-security-tools-darpas-challenge/",
    "description": "Artificial intelligence (AI), particularly large language models (LLMs) like GPT, has been the focus of discussions at the recent Black Hat and Def Con conferences in Las Vegas. However, experts are divided on how AI will impact the security posture of companies, from protecting internal data to developing applications. Maria Markstedter, an Arm reverse engineer ... <a title=\"AI-Powered Security Tools and DARPA&#8217;s New Challenge for Open Source Developers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-powered-security-tools-darpas-challenge/\" aria-label=\"More on AI-Powered Security Tools and DARPA&#8217;s New Challenge for Open Source Developers\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-18T21:01:52.000Z",
    "title": "Analysts are bullish on Aave, STEPN, and Pomerdoge in 2023",
    "url": "https://crypto.news/analysts-are-bullish-on-aave-stepn-and-pomerdoge-in-2023/",
    "description": "Learn about the future of Aave, STEPN and Pomerdoge as we explore which altcoin and project can rise in 2023"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-18T21:00:43.000Z",
    "title": "Algorand Faces Tough Times, Records New All-Time Low As Crypto Market Plunges",
    "url": "https://www.newsbtc.com/algorand/algorand-faces-tough-times-records-new-all-time-low-as-crypto-market-plunges/",
    "description": "Algorand&#8217;s (ALGO) performance on the charts has been nothing short of a rollercoaster. According to data from CoinGecko, yesterday, the asset&#8217;s value plummeted to a historical bottom, and it&#8217;s currently down by nearly 10% in the past 24 hours. Related Reading: Algorand Delivers Lightning-Fast Transaction Finality With Major Protocol Upgrade Algorand Records New Low Just yesterday, amid the significant downturn in the crypto market, Algorand&#8217;s price fell below notable support. The asset dropped to a price of $0.0905 despite maintaining its stability and striving to hold its ground above the $0.11 mark over the past week. This price move resulted in more than $50 million being wiped away from the asset&#8217;s market capitalization in the past day. Algorand&#8217;s market cap stands at a valuation of $755 million, a 7.1% drop from its earlier record of $808 million on Thursday. Despite the bloodbath the asset&#8217;s market cap and price currently suffer, its trading volume has moved in the opposite direction. ALGO&#8217;s trading volume has surged from a low of $46.5 million yesterday to as high as sitting above $73 million at the time of writing. This isn&#8217;t surprising as it indicates a potential violent sell-off. Furthermore, it is worth noting that before ALGO&#8217;s current bloodbath, the US Securities and Exchange Commission Chairman once recognized Algorand as a &#8220;great technology.&#8221; At least on Algorand, I agree with Gary. Gensler is bullish on Algorand!😅 pic.twitter.com/BnKkU8d8gS — Mr. Huber🔥🦅🔥 (@Leerzeit) November 14, 2021 However, despite receiving positive reviews, even from the SEC, the asset eventually became entangled in legal disputes, leading to its inability to maintain stability and ultimately hitting a historic low. Legal Complications Taking A Toll? Besides ALGO&#8217;s price action, the last few months have been tumultuous for Algorand. Two lawsuits have cast long shadows over its progress. In its suit against the cryptocurrency exchange Bittrex in April, the SEC hinted that ALGO is a security under US laws. This classification opened Pandora&#8217;s box of regulatory challenges for Algorand, impacting its perception among investors. Further complicating matters for Algorand was another SEC lawsuit aimed at the behemoth crypto exchange, Binance, in June 2023. This litigation mentioned ALGO, exacerbating its woes and dragging it to its recent historically low prices. Related Reading: Algorand (ALGO) Price Turns Positive, Bulls Eyeing Further Gains? When reviewing a potential cause for ALGO&#8217;s bearish moves in the past months, both of these high-profile legal disputes within a short time frame could be considered one of the reasons, as external factors such as regulatory challenges can significantly sway investor sentiment. Featured image from iStock, Chart from TradingView"
  }
]