[
  {
    "source": "Cointelegraph",
    "date": "2023-08-22T14:01:00.000Z",
    "title": "Blockchain takes the stage at Longevity+DeSci summit in New York",
    "url": "https://cointelegraph.com/news/blockchain-longevity-de-sci-summit-new-york",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/ec5241bf-ba8e-471f-b5d6-5b7d031c6011.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> This year’s Longevity+DeSci Summit in New York City showcased several decentralized solutions. </p>\n                    <p><p>Those seeking to slow the progress of time spent a few days immersed in that possibility from Aug. 10–11 at the Capitale conference hall in downtown New York City. </p><p>There, the sixth-annual Longevity+DeSci summit convened for its third in-person event — sequestered to online sessions amid the COVID-19 pandemic — following successful editions at the Cooper Union. </p><p>This year also marked the first time that the event’s organizer, Lifespan.io, included decentralized science (DeSci) in the title, despite the growing phenomenon’s close ties to the field of longevity.</p><h2>DeSci on the rise</h2><p>Decentralized science has proven a hot byproduct of blockchain’s emergence that researchers and investors are watching — even if the principles underpinning it date back to the early 2000s. Simply defined, DeSci is science that takes place outside of traditional academia. </p><p>In his opening remarks on the conference’s first day, mathematician and programmer turned <a href=\"https://cointelegraph.com/news/keith-comito-is-at-the-intersection-of-blockchain-longevity-and-decentralized-science\">Disney tech head Keith Comito</a> — who founded Lifespan.io in 2014 — likened DeSci to the Jimmy Fund, an advocacy group that conducted telethons throughout the last century to raise awareness and money for cancer research, catapulting their cause to a global health priority.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/c8387548-b79b-4285-951e-437f87cff01e.png\"  /><figcaption style=\"text-align: center;\"><em>Attendees line up. Source: Lifespan</em></figcaption></figure><p>Nevertheless, blockchain technology and its many emergent phenomena like <a href=\"https://cointelegraph.com/news/play-for-gold-this-game-backs-in-game-nfts-with-physical-golden-eggs\">play-to-earn (P2E) games</a> and <a href=\"https://cointelegraph.com/learn/what-is-a-dao#:~:text=A%20decentralized%20autonomous%20organization%20(DAO,rules%20enforced%20on%20a%20blockchain.\">decentralized autonomous organizations (DAOs)</a> have empowered a new chapter in DeSci, opening channels for ambitious biotech firms to fund exploration into their endeavors and forego the narrow pathways to finite (and competitive) National Institute of Health (NIH) grants.</p><p>Todd White, steward of the Coordination Working Group at VitaDAO, spoke to this facet of the DeSci equation in his keynote remarks, which truly kicked off the conference’s inaugural morning. </p><p>Researchers angling for NIH grants <a href=\"https://cointelegraph.com/news/decentralized-science-is-key-to-fixing-academic-research\">battle for peer-reviewed publications</a>, which are a necessary prerequisite for those funds. Some perceive the process as cliquey, but it protects the scientific process. </p><p>However, longevity science still suffers distinct, lingering and perhaps unfair perceptions from traditional researchers. Before the advent of artificial intelligence or camera phones, the possibility that human beings could live for thousands of years seemed like the stuff of science fiction. Those who wanted to “cure aging” said instead they were working on an age-related disease like Alzheimer’s. But technology is advancing, and with it, our collective visions for the future. Massive investments in the field show there’s a shift afoot.</p><h2>Longevity science’s challenges, and blockchain solutions</h2><p>Thus far, longevity science’s loudest proponents have been eccentric wealthy people proclaiming they want to live forever. Much like many blockchain supporters can understand, those folks have only worsened longevity science’s image problem. Their presence has drawn attention but also overshadowed the profound possibilities that advancements in each field would pose.</p><p>Conference attendees had their feet somewhat on the ground throughout the event’s two-day program of concurrent presentations, panels and workshops. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\">Deposit risk: What do crypto exchanges really do with your money?</a></em></strong></p><p>Despite the occasional necessary rigor in their post-presentation questions, no one outright named any skepticism about the cause at hand, such as living an extra fifty frail years, overpopulation or whether we’ve made a world worth living in longer. Instead, they questioned practical processes.</p><p>But still, anyone who might’ve come into Lifespan’s conference with their mind already made up in opposition would have been met with open ears and strategic explanations. Rather than seeking to “live forever,” there was a sense that longevity research means treating the cause of conditions rather than conditions themselves, which some academics have <a href=\"https://www.technologyreview.com/2022/11/16/1063300/billion-dollar-mega-rich-live-forever/\" target=\"_blank\" rel=\"noopener nofollow\">likened</a> to a game of Whac-A-Mole.</p><p>So longevity science’s game at this moment is many-fold. This year’s event continued its focus on fostering interdisciplinary interactions that not only benefit longevity research but also help policy advocates, fundraisers and others share ideas that might not arise naturally in existing silos. </p><p>There was, of course, a heavier focus than ever on DeSci, through the lens of its new blockchain capabilities. But on day one, Dr. Vadim Gladyshev of Harvard Medical School presented facets of his research into longevity signatures and treatments; Yuri Deigin of cutting-edge gene therapies developer YouthBio Therapeutics discussed the biotech firm’s studies into cell reprogramming; and Omar Elnaggar, the founder and CEO behind Web3 security framework Weavechain, spoke between both Gladyshev and Deigin’s presentations, debuting a dynamic nonfungible token (NFT) his team developed for the event to support current intentions to gamify philanthropy. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/63d29e47-f49e-4520-9bad-2f9603eb5faa.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Gladyshev presents at the event. Source: Lifespan</em></figcaption></figure><p>Participants were encouraged to mint their own NFT and then drop it into high-profile wallets, with the token accruing donations along the way. At charitable milestones, new visual elements activate.</p><p>Intellectual property-NFTs also proved a hot topic at the intersection of longevity science and blockchain tech. These fractionalized approaches to funding research appeared in University of Copenhagen associate professor Dr. Morten Scheibye-Knudsen’s talk on the Longevity Molecule Project, which outlined its work and how the new tech helped make it possible. </p><p>Kelsey Moody, CEO of Ichor Life Sciences, gave an illuminating outline of a drug’s pipeline from discovery to approval, illustrating the current trend of Big Pharma increasingly outsourcing that pipeline’s initial stages to contract research organizations like his, which handle and conduct early testing.</p><p>Moody also shared an interesting but contentious use case from Ichor where a “high net worth individual” with a dangerous heart condition approached his firm to determine whether he was part of the clinical or placebo group in a trial for a cutting-edge new treatment. </p><p>While those tests ran, Moody’s team then devised a backup plan to treat him — for the cost of a small house in certain semi-rural suburbs. </p><p>Fortunately for the client, they learned they were getting the treatment, but this raises questions about the ability of high-net-worth individuals to skirt a blinded study — a critical element in medical research that, if compromised, could spoil the study entirely.</p><p>If any conference attendees had ethical questions about Moody’s story, no one said anything. The closest they came was in the Q&amp;A following a presentation by Kennedy Schaal, senior biologist at Rejuve AI, a biotech firm with numerous objectives around decentralizing science, like creating a process for gamified remote clinical studies. One attendee asked how it verifies the results of home tests. Schaal said the firm hadn’t thought about it; it just believed people would act with integrity.</p><h2>In-person, interdisciplinary problem solving</h2><p>Disney’s Comito told Cointelegraph that Lifespan’s conference differentiates itself with its commitment to reaching maximal participants. That’s why tickets are much cheaper than the <a href=\"https://cointelegraph.com/news/how-crypto-is-playing-a-role-in-increasing-healthy-human-lifespans\">many-figured fees or background checks</a> customary to exclusive events like the Longevity Investors Conference in Gstaad, Switzerland, in 2022.</p><p>Not only does this approach increase Lifespan’s reach in evangelizing its mission, but the strategy also helps foster desired collaborations among the conference. Writers came across each other in the crowd, for instance, to share ideas on covering this rapidly evolving field. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/9e84c3eb-7f1b-49e7-be55-9e0d68c68868.jpeg\"  /><figcaption style=\"text-align: center;\"><em>A dedicated panel discussed DAOs and decentralized tech in longevity biotech. Source: Lifespan</em></figcaption></figure><p>Fundraising is a typical outcome of the event, and Comito announced that Lifespan had partnered with the development team on a Dragon Tyrant P2E game that will contribute to longevity research. </p><p>Panel discussions proved the conference’s most interesting part. In a regulatory discussion at the end of the first day, Montana State Senator Kenneth Bogner presented Alliance for Longevity Initiatives founder Dylan Livingston with the pen that Montana Governor Greg Gianforte had used to sign legislation they’d worked on together. </p><p>There are a lot of big personalities in the space at present, and on several occasions, those panels persisted in arguing semantics. But at this stage in the game, perhaps that’s the thing to be done. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/paypal-new-stablecoin\">PayPal’s new PYUSD stablecoin faces legal headwinds and ‘less functionality’</a></em></strong></p><p>Thus, the big questions dogging longevity science right now are manners of labeling: Comito called a biomarker for aging, a shifting variable to quantify it — one of the science side’s holy grails. </p><p>Meanwhile, messaging is proving critical on the policymaking and fundraising fronts. Whether or not anyone really believes in living forever, it seems that society might change the way it regards health. An earlier panel discussing whether reversing aging is truly possible dwelled at length on the importance of understanding the body in terms of systems rather than isolated parts. The same approach applies from longevity science to DeSci, and the tech emboldening both.</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-22T13:57:16.000Z",
    "title": "FTX's Sam Bankman-Fried pleads not guilty to fraud charges: Report",
    "url": "https://cointelegraph.com/news/ftx-s-sam-bankman-fried-pleads-not-guilty-to-fraud-charges-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/49f5ebad-0baa-4afa-9695-dc838b4b97f6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sam Bankman-Fried, the former CEO and founder of now-defunct crypto exchange FTX, has reportedly pleaded not guilty to fraud and money laundering charges in a court hearing on Aug. 22.</p>\n                    <p><p>Sam Bankman Fried, the former CEO and co-founder of FTX crypto exchange, has pleaded not guilty to fraud and money laundering charges levied in an updated indictment by prosecutors, according to a report. </p><p>Bankman Fried appeared in the Southern District of New York courthouse on Aug. 22 facing accusations of misusing customer funds for personal use as well as for political donations. The charges of fraud and money laundering are from December, however, prosecutors added additional charges of campaig finance earlier this month.</p><p>The latest proceedings in the FTX lawsuit come after Bankman Fried's <a href=\"https://cointelegraph.com/news/judge-orders-sam-bankman-fried-bail-revoked-following-allegations-witness-intimidation\">bail was revoked</a> and the FTX founder left the New York courtroom in handcuffs.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-22T13:45:13.000Z",
    "title": "Crypto amplified financial risks in emerging markets: BIS papers",
    "url": "https://cointelegraph.com/news/crypto-amplified-financial-risks-in-emerging-markets-bis-papers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/a38b4d1c-6654-49cb-88cd-bb0c522e7553.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The central banks of the United States, Canada, Mexico and Brazil have pointed out the risks of crypto but warned against excessively prohibitive laws.</p>\n                    <p><p>Cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) have failed to reduce but rather have “amplified financial risks” in less developed economies, according to a new study published by the The Bank for International Settlements (BIS).</p><p>On Aug. 22, the Consultative Group of Directors of Financial Stability (CGDFS) <a href=\"https://www.bis.org/publ/bppdf/bispap138.pdf\" target=\"_blank\" rel=\"noopener nofollow\">released</a> a new report on cryptocurrencies, titled “Financial stability risks from crypto assets in emerging market economies.”</p><p>The study was conducted by BIS member central banks within the CGDFS, including those in Argentina, Brazil, Canada, Chile, Colombia, Mexico, Peru and the United States. The document emphasized that the views expressed are those of the authors and “not necessarily the views of the BIS.”</p><p>According to the authors of the study, cryptocurrencies like Bitcoin hold out the “illusory appeal” of being a quick solution for financial challenges in emerging markets.</p><p>“They have been promoted as low-cost payment solutions, as alternatives for accessing the financial system and as substitutes for national currencies in countries with high inflation or high exchange rate volatility,” the study reads. As cryptocurrencies allegedly extended the financial stability risks of emerging markets, authorities have many policy options to address those risks, ranging from outright bans to containment to regulation, the report notes.</p><p>At the same time, there are also risks if central banks and regulators react in an “excessively prohibitive manner,” the paper reads, adding that such policies may drive crypto activities into the shadows. The authors added:</p><blockquote>“While crypto-related activities have not fulfilled their stated goals to date, the technology could still be applied in various constructive ways. Creating a regulatory framework to channel innovation into such socially useful directions will remain a key challenge in future.”</blockquote><p>The central banks mentioned Bitcoin exchange-traded funds (ETFs) as one of major potential market risks in emerging markets, as such products are able to lower the barriers to entry for “less sophisticated investors” and increase their exposure.</p><p>Among the risks, the study’s authors mentioned a situation where Bitcoin ETF investors “own no crypto assets but still face large losses when the price of Bitcoin drops.” Additionally, crypto futures-based ETFs “may increase price volatility and amplify risks if they hold a significant portion of the futures market,” the document notes.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ripple-joins-bis-cross-border-payments-task-force\"><strong><em>Ripple joins BIS cross-border payments task force</em></strong></a></p><p>It also appears somewhat unclear what emerging markets exactly are implied in the study, as many jurisdictions in this category, including China and Pakistan, have been quite restrictive in terms of crypto regulations. Equally, it’s not clear whether the situation is different for more developed countries.</p><p>The BIS did not immediately respond to Cointelegraph’s request for comment.</p><p>Though not necessarily expressing views of the BIS, the study is another sign that the authority is cautious about the adoption of cryptocurrencies like Bitcoin. In another report in July, the international financial institution <a href=\"https://cointelegraph.com/news/bis-gives-cbdcs-thumbs-up-crypto-thumbs-down-reports-g20-ministers\">reiterated its high skepticism over crypto</a>, pointing to commonly cited issues such as the instability of stablecoins and the purported irreversibility of smart contracts.</p><p>On the other hand, the central bank spoke highly of central bank digital currencies. “By underpinning the future monetary system, CBDCs would be the foundation upon which further innovations are built,” the authority wrote.</p><p><strong><em>Magazine:</em></strong> <a href=\"https://cointelegraph.com/magazine/big-questions-did-the-nsa-create-bitcoin/\"><strong><em>Big Questions: Did the NSA create Bitcoin?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-22T14:00:36.000Z",
    "title": "\n                        Recur Sinks Despite Setting Sail With Big Names\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/recur-sinks-despite-setting-sail-with-big-names",
    "description": "\n                        <p dir=\"ltr\">The NFT platform Recur has shut down operations despite raising $50 million and having support from industry bigwigs.&nbsp;</p>\nBig-Name Partnerships Fade Away\n<p dir=\"ltr\">Despite its initial promising trajectory and significant partnerships, NFT startup Recur has made the disheartening announcement that its Web3 platform is shutting down. The platform's inability to withstand the challenges of the crypto winter has led to this unexpected decision.</p>\n<p dir=\"ltr\">Recur had set sail with grand ambitions, boasting partnerships with iconic brands such as Hello Kitty and Nickelodeon. However, the cold winds of the crypto winter have taken a toll on the platform's sustainability.&nbsp;</p>\n<p dir=\"ltr\">The firm acknowledged that its core features would gradually phase out over the coming months, including the withdrawal of NFTs, cashing out stablecoin balances, and trading collectibles on Recur-hosted marketplaces.</p>\nA Shift In The NFT Space\n<p dir=\"ltr\">Established in 2021, Recur positioned itself as a provider of Web3 \"building blocks\" for businesses, enabling the creation of in-game assets, loyalty programs, and digital collectibles through NFTs. However, Recur's fate is not unique, as the broader NFT space witnessed the closure of companies like Nifty, which had also secured partnerships with big media titles.</p>\n<p dir=\"ltr\">With over 380,000 minted NFTs, Recur is working to ensure the legacy of these digital collectibles. The company plans to migrate metadata and media for its NFTs to the InterPlanetary File System (IPFS), a decentralized file-sharing network. Additionally, other assets will be hosted on Filecoin's network, indicating Recur's commitment to maintaining the digital artifacts it helped create.</p>\nA Shift In Value\n<p dir=\"ltr\">Recur's journey included milestones like the Recur Pass, which was initially sold as an NFT for $300 and granted holders early access to NFT drops. Despite an impressive early sale of a Recur Pass for $88,888, current prices reflect a stark contrast, with the cheapest pass listed on OpenSea for 0.001 ETH (about $1.69).</p>\n<p dir=\"ltr\">Recur had garnered notable attention with a $50 million Series A funding round in late 2021, valuing the company at $333 million. Esteemed investors like Gary Vaynerchuk, the Winklevoss twins, and Ethereum co-founder Joe Lubin participated in an earlier $5 million seed funding round. Despite the initial momentum, Recur's journey underscores the volatility and challenges inherent in the NFT landscape.</p>\n<p dir=\"ltr\">In conclusion, Recur's announcement to shut down its Web3 platform serves as a sobering reminder of the challenges faced by NFT-focused companies in the ever-evolving crypto space. The dissolution of big-name partnerships and the necessity to adapt to changing market dynamics highlight the fragility of even the most promising ventures.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-22T14:00:26.000Z",
    "title": "Analysis Suggests Bitcoin’s 2024 Halving Could Propel Price to $400,000",
    "url": "https://news.bitcoin.com/analysis-suggests-bitcoins-2024-halving-could-propel-price-to-400000/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/halv-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Analysis Suggests Bitcoin&#039;s 2024 Halving Could Propel Price to $400,000\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/halv-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/halv-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/halv-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/halv-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/halv-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/halv-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/halv.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The highly anticipated 2024 bitcoin halving could spark a meteoric price rise, potentially driving its value to a staggering $400,000, suggests an analysis by Blockware Solutions. The forecasted supply trim in 2024 might ignite an explosive demand for bitcoin. The report highlights how a dynamic duo &#x2014; a dip in sell-off pressures and a burgeoning [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T14:02:13.000Z",
    "title": "Uniswap (UNI) And Solana (SOL) Looking To Rebound As Pomerdoge (POMD) Brings Bulls To Market Again",
    "url": "https://www.cryptopolitan.com/uniswap-uni-and-solana-sol-looking-to-rebound-as-pomerdoge-pomd-brings-bulls-to-market-again/",
    "description": "As the overall crypto market is rebounding, investors want to encash this opportunity. Seasoned investors are betting big on Pomerdoge. Moreover, experts believe that POMD will rise by 40x before the end of the year. Therefore, its presale tokens are in great demand. Meanwhile, Uniswap (UNI) and Solana (SOL) have tried to fight market bears. ... <a title=\"Uniswap (UNI) And Solana (SOL) Looking To Rebound As Pomerdoge (POMD) Brings Bulls To Market Again\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-uni-and-solana-sol-looking-to-rebound-as-pomerdoge-pomd-brings-bulls-to-market-again/\" aria-label=\"More on Uniswap (UNI) And Solana (SOL) Looking To Rebound As Pomerdoge (POMD) Brings Bulls To Market Again\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T13:58:46.000Z",
    "title": "Future Blockchain Summit Announces the 1inch Network as its 2023 Headline Sponsor",
    "url": "https://www.cryptopolitan.com/future-blockchain-summit-announces-the-1inch-network-as-its-2023-headline-sponsor/",
    "description": "Dubai, 19,Aug,, 2023: Decentralized protocol powerhouse the 1inch Network has been announced as the official sponsor of the highly anticipated 2023 edition of the Future Blockchain Summit from October 15 to 18 at Dubai Harbour. “This is a major global event for the space, with Dubai as one of the established blockchain centers. We hope ... <a title=\"Future Blockchain Summit Announces the 1inch Network as its 2023 Headline Sponsor\" class=\"read-more\" href=\"https://www.cryptopolitan.com/future-blockchain-summit-announces-the-1inch-network-as-its-2023-headline-sponsor/\" aria-label=\"More on Future Blockchain Summit Announces the 1inch Network as its 2023 Headline Sponsor\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T13:56:12.000Z",
    "title": "Stake Casino: Leading the Charge in Crypto Gaming",
    "url": "https://www.cryptopolitan.com/stake-casino-leading-the-charge-in-crypto-gaming/",
    "description": "Online casinos have burgeoned in the digital age, with a multitude catering to varied tastes and preferences. Among the numerous platforms, Stake Casino has carved a niche, becoming a frontrunner in the realm of crypto gaming. If you&#8217;ve been contemplating diving into the world of online gaming with a focus on cryptocurrency, this comprehensive guide ... <a title=\"Stake Casino: Leading the Charge in Crypto Gaming\" class=\"read-more\" href=\"https://www.cryptopolitan.com/stake-casino-leading-the-charge-in-crypto-gaming/\" aria-label=\"More on Stake Casino: Leading the Charge in Crypto Gaming\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T13:54:20.000Z",
    "title": "Crypto Bull Market Roars: SEC’s Impending Failure Fuels Massive Surge, Elonator, Ethereum and XRP Set to Shine",
    "url": "https://www.cryptopolitan.com/crypto-bull-market-roars-secs-impending-failure-fuels-massive-surge-elonator-ethereum-and-xrp-set-to-shine/",
    "description": "The SEC&#8217;s inevitable demise foreshadows a cataclysmic event that might rocket the whole crypto environment into an electric crypto bull market. A huge upheaval is on the horizon, set against a scene of exhilarating expectation. SEC seeks to appeal the ruling that XRP is not a security when sold to the general public. As the ... <a title=\"Crypto Bull Market Roars: SEC&#8217;s Impending Failure Fuels Massive Surge, Elonator, Ethereum and XRP Set to Shine\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-bull-market-roars-secs-impending-failure-fuels-massive-surge-elonator-ethereum-and-xrp-set-to-shine/\" aria-label=\"More on Crypto Bull Market Roars: SEC&#8217;s Impending Failure Fuels Massive Surge, Elonator, Ethereum and XRP Set to Shine\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T13:44:43.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-22T14:07:50.000Z",
    "title": "Pepe Coins Whales’ Latest Moves Could Spark Interest In PEPE. But, This Rival Meme Coin Promises More Profit.",
    "url": "https://www.crypto-news-flash.com/pepe-coins-whales-latest-moves-could-spark-interest-in-pepe-but-this-rival-meme-coin-promises-more-profit/?utm_source=rss&utm_medium=rss&utm_campaign=pepe-coins-whales-latest-moves-could-spark-interest-in-pepe-but-this-rival-meme-coin-promises-more-profit",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-66.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-66.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-66-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-66-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Pepe coin investors are on the move and are looking to push the price of the PEPE token higher despite the fact that it’s in a downtrend. While analysts believe that Pepe coin whales may achieve their goal, they have their attention set on this rapidly growing new meme coin that promises more profit for [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-22T14:05:55.000Z",
    "title": "BYDFi, Small and Mid-Cap Coins Americans Can Still Buy",
    "url": "https://www.altcoinbuzz.io/reviews/bydfi-small-and-mid-cap-coins-americans-can-still-buy/",
    "description": "<p>US and Canadian citizens can have a hard time buying crypto assets. Crypto exchanges close down or on-ramping becomes difficult. However, BYDFi is a regulated exchange that offers trading to all but 4 countries. And yes, US and Canadian citizens can trade there. So, let&#8217;s take a look at BYDFi and two small and mid-cap [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/bydfi-small-and-mid-cap-coins-americans-can-still-buy/\">BYDFi, Small and Mid-Cap Coins Americans Can Still Buy</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-22T14:02:59.000Z",
    "title": "Two Major DeFi Tokens to Access on BYDFI",
    "url": "https://www.altcoinbuzz.io/spotlight/two-major-defi-tokens-to-access-on-bydfi/",
    "description": "<p>DeFi protocols were the high performers of the last bull market. They accounted for the bulk of the liquidity in the crypto market and also attracted new users to crypto with their reward-earning schemes. Protocols such as Synthetix and Compound Finance were two of the biggest DeFi leaders. And although DeFi protocols have suffered greatly [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/spotlight/two-major-defi-tokens-to-access-on-bydfi/\">Two Major DeFi Tokens to Access on BYDFI</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-22T14:02:00.000Z",
    "title": "ETH Poised for a Recovery as Indicators Point to Positive Momentum",
    "url": "https://coinedition.com/eth-poised-for-a-recovery-as-indicators-point-to-positive-momentum/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Ethereum-Price-Lost-20-Weekly-Whats-The-Key-Support-Now.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum Price Lost 20% Weekly, What’s The Key Support Now\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Ethereum-Price-Lost-20-Weekly-Whats-The-Key-Support-Now.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Ethereum-Price-Lost-20-Weekly-Whats-The-Key-Support-Now-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Ethereum-Price-Lost-20-Weekly-Whats-The-Key-Support-Now-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Ethereum-Price-Lost-20-Weekly-Whats-The-Key-Support-Now-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Ethereum-Price-Lost-20-Weekly-Whats-The-Key-Support-Now-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In the previous 24 hours, bearish pressure has prevailed in the Ethereum (ETH) market, with the price falling from an intraday high of $1,679.76 to an intraday low of $1,651.96. This negative trend can be attributable to a mix of investor profit-taking and a broader market correction. ETH was trading at $1,665.11 at publication, indicating [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/eth-poised-for-a-recovery-as-indicators-point-to-positive-momentum/\">ETH Poised for a Recovery as Indicators Point to Positive Momentum</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]