[
  {
    "source": "NewsBTC",
    "date": "2023-12-19T01:00:01.000Z",
    "title": "Bitcoin Crash To $38,000: Here’s What Could Trigger It",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-crash-to-38000-heres-what-could-trigger-it/",
    "description": "Data shows Bitcoin is losing a major region of on-chain support with its latest plunge. Here&#8217;s the range where the next zone lies for the asset. Bitcoin Has Slipped Under $41,200 To $42,400 Support Region As explained by analyst Ali in a post on X, BTC has slipped under a key on-chain support zone today. An &#8220;on-chain support&#8221; range refers to a price below the current spot price of the cryptocurrency that hosts the cost basis of many investors. For any holder, the cost basis, the price at which they bought their coins, is a fundamental level, as a retest of it by the cryptocurrency can change their profit-loss balance. Related Reading: XRP Gets Rejected Down: Analyst Predicts Bottom Target Investor psychology works such that if this retest of the cost basis happens from above (meaning that the holder had been carrying profits before this), the holder might react by buying more of the asset because they may believe this same price range could turn out to be profitable again in the future. On the other hand, any investor who had been in a loss earlier could become likely to sell when the price reaches its break-even mark, as they wouldn&#8217;t want to miss out on the opportunity to escape without any losses if the asset happens to drop again shortly. The individual investors&#8217; reactions aren&#8217;t generally relevant to the market as a whole. Still, if many holders show this reaction at once, the combined force can cause fluctuations in the price. Now, here is a chart that shows what the different price ranges look like for Bitcoin in terms of the number of addresses who bought at them: Looks like the range around $38,000 is heavy with investors at present &#124; Source: @ali_charts on X As displayed in the above graph, the Bitcoin range between $41,200 and $42,400 is quite thick with investors. In total, 1.87 million addresses have bought 727,520 BTC at these levels. Bitcoin has been moving in and out of this crucial support region the past day, suggesting that the zone may weaken. If the range gets lost, BTC might see an extended drop below towards the next major support zone. The chart shows that the $37,400 to $38,700 range is where substantial on-chain support could next be available, as 1.28 million addresses have their cost basis. Related Reading: VanEck CEO Predicts When The Bitcoin Price Will Reach $69,000 Again Thus, Bitcoin may be at risk of declining to as low as $38,000 (the average price of the range) shortly. In the potential scenario of such a drawdown, the current $41,200 to $42,400 range could also become resistance, as these addresses would become loss holders desperate to leave. BTC Price Bitcoin slipped toward the $40,500 level during the past day but has since recovered to the $41,600 mark. It would appear that the support may not be entirely lost yet. The price of the coin seems to have gone through a rollercoaster today &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, IntoTheBlock.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-19T01:00:05.000Z",
    "title": "Analyst Predicts Rallies for Avalanche (AVAX) and Fetch.ai (FET), Outlines Area of Interest for Gaming Altcoin",
    "url": "https://dailyhodl.com/2023/12/18/analyst-predicts-rallies-for-avalanche-avax-and-fetch-ai-fet-outlines-area-of-interest-for-gaming-altcoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-two-based-roadmap.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-two-based-roadmap.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-two-based-roadmap.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-two-based-roadmap.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-two-based-roadmap.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-two-based-roadmap.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/coinbase-two-based-roadmap.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader is predicting more rallies for smart contract protocol Avalanche (AVAX) and artificial intelligence (AI)-focused altcoin Fetch.ai (FET). Pseudonymous analyst Altcoin Sherpa tells his 201,600 followers on the social media platform X that Avalanche is likely not yet done rallying. The trader shares a chart that shows AVAX breaking out of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/18/analyst-predicts-rallies-for-avalanche-avax-and-fetch-ai-fet-outlines-area-of-interest-for-gaming-altcoin/\">Analyst Predicts Rallies for Avalanche (AVAX) and Fetch.ai (FET), Outlines Area of Interest for Gaming Altcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]