[
  {
    "source": "Cointelegraph",
    "date": "2023-10-18T09:45:13.000Z",
    "title": "Middle East regulatory clarity drives crypto industry growth — Binance FZE head ",
    "url": "https://cointelegraph.com/news/middle-east-regulatory-clarity-drives-crypto-industry-growth-binance-fze-head",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/cc99d278-fde7-434b-945d-58e2b5235298.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>UAE, Dubai and Bahrain continue to attract major cryptocurrency exchanges and businesses due to their progressive regulatory approaches. </p>\n                    <p><p>Major cryptocurrency exchanges and businesses are being lured to a proverbial crypto oasis around the Persian Gulf, according to Binance FZE’s general manager.</p><p>Alex Chehade, who heads Binance's local operation in Dubai, tells Cointelegraph reporter Ezra Reguerra that progressive regulatory frameworks in the region are a major drawcard for startups and established industry players:</p><blockquote>“What stands out in the Middle East is regulatory certainty and clarity. We have a virtual-asset-specific regulator here in Dubai, VARA. We have ADGM with its virtual asset framework, we have Bahrain’s central bank being accepting of cryptocurrencies.”</blockquote><p>Chehade believes that regulators in other jurisdictions have not quite figured out or taken the time to learn the ins and outs of the cryptocurrency landscape, or simply lack the “bandwidth” to begin regulatory the sector:</p><blockquote>“So you’re seeing events like GITEX and Future Blockchain Summit as well as global companies coming here because it’s easy to do business.”</blockquote><p>The Binance FZE general manager adds that businesses need certainty in order to create long-term plans and the regulatory parameters that exist in these specific jurisdictions are facilitating that process. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/9cc09bd4-d03c-4d63-8bb8-0abe0b3c27e8.jpg\"  /><figcaption style=\"text-align: center;\">Cointelegraph's Ezra Reguerra in conversation with Chehade at Future Blockchain Summit in Dubai.</figcaption></figure><p>Chehade also highlighted Binance’s role as a catalyst of sorts for Web3 companies and startups to become established in the region.</p><blockquote>“We’re an ecosystem enabler, we’re the biggest Web3 company in the world. You often see network effects with size and we’re seeing a healthy environment with big and small players.”</blockquote><p>Chehade stated that Binance now employs around 600 people in its Dubai-based operation and will continue to play its part in fostering the industry. He adds that Binance FZE has been operating as a regulated exchange in Dubai for a year and a half and is segregated from the rest of its global operations with ring-fenced custody and operations.</p><p><a href=\"https://cointelegraph.com/news/dubai-ai-web3-subsidized-commercial-licenses\"><strong><em>Related: Dubai lures AI, Web3 enterprises with 90% subsidized commercial licenses</em></strong></a></p><p>In a prior interview with Cointelegraph at the Blockchain Economy Dubai Summit, Akshay Chopra, Visa’s vice president, and head of innovation and design, echoed Chehade’s sentiments regarding the region's progressive regulatory outlook.</p><p>As a board member of the MENA Fintech Association, Chopra highlighted the “forward-looking and inclusive view of blockchain and crypto solutions” as a key driver of growth for the sector in the region:</p><blockquote>“Regulators are actually looking forward and working with the local blockchain community, institutions, startups, entrepreneurs to come up with a very inclusive perspective on what is the future and how can we be best positioned both as a market and as a regulator.”</blockquote><p>Research from blockchain analysis firm Chainalysis <a href=\"https://cointelegraph.com/news/middle-east-and-north-africa-are-fastest-growing-crypto-markets-data\">indicates</a> that the MENA region is the fastest growing cryptocurrency market in the world. Transaction volume in the region reveals users received $566 billion in crypto between July 2021 and June 2022. </p><p><em>Additional reporting by Ezra Reguerra.</em></p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/middle-east-regulatory-clarity-drives-crypto-industry-growth-binance-fze-head&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Magazine: Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-18T09:54:04.000Z",
    "title": "Ethereum co-founder Vitalik Buterin refutes asset dumping claims",
    "url": "https://cryptoslate.com/ethereum-co-founder-vitalik-buterin-refutes-asset-dumping-claims/",
    "description": "<p>Ethereum (ETH) co-founder Vitalik Buterin has dismissed recent speculations that he is dumping his ETH bag, saying that he hasn&#8217;t sold the digital asset for personal gain since 2018. &#8220;I haven&#8217;t &#8220;sold&#8221; ETH for personal gain since 2018,&#8221; Buterin said. Several media outlets have recently reported how wallets connected to Buterin have sent Ethers to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ethereum-co-founder-vitalik-buterin-refutes-asset-dumping-claims/\">Ethereum co-founder Vitalik Buterin refutes asset dumping claims</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-18T09:50:09.000Z",
    "title": "OKX Liquid Marketplace Outperforms in September, Hits All-Time High $1.54 Billion in Monthly Futures Spreads Volume",
    "url": "https://cryptodaily.co.uk/2023/10/okx-liquid-marketplace-outperforms-in-september-hits-all-time-high-154-billion-in-monthly-futures-spreads-volume",
    "description": "OKX, a leading crypto exchange and Web3 technology company, today announced that futures spreads trading volumes on its Liquid Marketplace, a spot OTC"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-18T10:04:39.000Z",
    "title": "Expert Price Breakdown: The Truth Behind Dogecoin (DOGE), Shiba Inu (SHIB), Pepe (PEPE) Upcoming Trends",
    "url": "https://cryptodaily.co.uk/2023/10/expert-price-breakdown-the-truth-behind-dogecoin-doge-shiba-inu-shib-pepe-pepe-upcoming-trends",
    "description": "Explore expert insights on the future of meme coins: Dogecoin (DOGE), Shiba Inu (SHIB), and PEPE. From price predictions to strategic moves and controversies, get the in-depth analysis on where these tokens are headed in the crypto market."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T09:56:31.000Z",
    "title": "Unlock the ‘Bloody Mess’ Mastery SMG Blueprint in Warzone’s Haunting Event",
    "url": "https://www.cryptopolitan.com/unlock-the-bloody-mess-mastery-smg-blueprint/",
    "description": "As October ushers in the eerie vibes of Halloween, &#8216;Call of Duty: Warzone and DMZ&#8217; intensifies the gaming landscape with its seasonal Haunting event. Among the exclusive rewards awaiting players is the much-coveted &#8216;Bloody Mess&#8217; Mastery SMG blueprint. To claim this prize, participants must navigate a series of spine-chilling challenges set in the night-shrouded Al ... <a title=\"Unlock the &#8216;Bloody Mess&#8217; Mastery SMG Blueprint in Warzone&#8217;s Haunting Event\" class=\"read-more\" href=\"https://www.cryptopolitan.com/unlock-the-bloody-mess-mastery-smg-blueprint/\" aria-label=\"More on Unlock the &#8216;Bloody Mess&#8217; Mastery SMG Blueprint in Warzone&#8217;s Haunting Event\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T09:43:49.000Z",
    "title": "OKX Liquid Marketplace Outperforms in September, Hits All-Time High $1.54 Billion in Monthly Futures Spreads Volume",
    "url": "https://www.cryptopolitan.com/okx-liquid-marketplace-outperforms-in-september-hits-all-time-high-1-54-billion-in-monthly-futures-spreads-volume/",
    "description": "Dubai, UAE, October 18th, 2023, Chainwire OKX, a leading crypto exchange and Web3 technology company, today announced that futures spreads trading volumes on its Liquid Marketplace, a spot OTC, futures spreads and options liquidity network, reached a record monthly high of US$1.54 billion in September 2023. This achievement represents 62%* of the institutional market share ... <a title=\"OKX Liquid Marketplace Outperforms in September, Hits All-Time High $1.54 Billion in Monthly Futures Spreads Volume\" class=\"read-more\" href=\"https://www.cryptopolitan.com/okx-liquid-marketplace-outperforms-in-september-hits-all-time-high-1-54-billion-in-monthly-futures-spreads-volume/\" aria-label=\"More on OKX Liquid Marketplace Outperforms in September, Hits All-Time High $1.54 Billion in Monthly Futures Spreads Volume\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-18T10:00:28.000Z",
    "title": "Real Reason Behind Ethereum Founder’s Massive ETH ‘Sales’ Exposed",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-founder-eth-sales/",
    "description": "A crypto wallet owned by the Ethereum founder Vitalik Buterin has seen a series of transactional activities lately, piquing the interest of crypto community members at a time when Ethereum selling pressures are rising.  Following this, Buterin has taken the initiative to address the concerns regarding his recent transfer of digital assets to multiple exchanges.  Ethereum Co-Founder Discloses Truth Behind Multi-Transfers In a recent post on Warp Cast, a decentralized social network, Russian-Canadian computer programmer and founder of Ethereum, Vitalik Buterin publicized the real reason behind the latest ETH transfers made via his wallet address.  Related Reading: BlackRock Reacts To False Bitcoin Spot ETF Approval News In A Positive Way Buterin explained to the public that the large-scale ETH transactions that were performed using his wallet were not sold by him. He stated that over the years, he has mostly focused on donating large sums of Ethereum funds to charity organizations and other projects. He further solidified his claims saying that he had not sold ETH for personal profits since 2018.  “If you see an article saying ‘Vitalik sends XXX ETH to [exchange]’, it&#8217;s not actually me selling, it&#8217;s almost always me donating to some charity or nonprofit or other projects, and the recipient selling because, well, they have to cover expenses,” Buterin stated.  Buterin is well-known for his philanthropic acts toward charity organizations and medical interventions. The Ethereum co-founder made headlines in 2021, after donating $1 billion worth of SHIB tokens to a COVID-19 relief fund in India.  Additionally, in February 2023, Buterin donated $150,000 to Anka Relief to fund a crypto aid project that would support Türkiye after its recent earthquake experiences. Although there have been many proofs of Buterin’s propensity to donate to multiple charities, the crypto community has remained skeptical and vigilant, relentlessly monitoring the Ethereum founder’s cryptocurrency activities, as well as these recent high-value ETH transactions.  ETH price settles above $1,570 &#124; Source: ETHUSD on Tradingview.com Spokesperson Reveals $15 Million ETH Transfer From Kanro Charity According to data from PeckShield Alert, a blockchain security and auditing firm, Vitalik Buterin recently made a large-scale transaction of $15 million USDC to the Gemini Exchange.  This transaction in question is among the list of recent transfers associated with the Ethereum founder. These movements have prompted both curiosity and concern in the crypto community, as observers attempt to determine the underlying motive behind Buterin’s transactions. Related Reading: Shiba Inu Whale Moves $32.4 Million In SHIB, Large Sell Incoming? A report from Cointelegraph said an Ethereum Foundation Spokesperson has clarified the details behind the lofty transaction. According to the Spokesperson, the $15 million USDC transfer was only executed under Buterin’s Ethereum Name Service (ENS) and not from his wallet address.  The spokesperson also supposedly confirmed that the funds were from a transfer made by a charity multi-sig wallet, Kanro, which is closely linked to Buterin to sponsor a grant. Featured image from U.Today, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-18T09:40:00.000Z",
    "title": "OKX Liquid Marketplace Outperforms in September, Hits All-Time High $1.54 Billion in Monthly Futures Spreads Volume",
    "url": "https://www.crypto-news-flash.com/okx-liquid-marketplace-outperforms-in-september-hits-all-time-high-1-54-billion-in-monthly-futures-spreads-volume/?utm_source=rss&utm_medium=rss&utm_campaign=okx-liquid-marketplace-outperforms-in-september-hits-all-time-high-1-54-billion-in-monthly-futures-spreads-volume",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/OKX_FSV_ANNOUNCEMENT_1200x628_1_16975336022rKKctQjur.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/OKX_FSV_ANNOUNCEMENT_1200x628_1_16975336022rKKctQjur.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/OKX_FSV_ANNOUNCEMENT_1200x628_1_16975336022rKKctQjur-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/OKX_FSV_ANNOUNCEMENT_1200x628_1_16975336022rKKctQjur-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/OKX_FSV_ANNOUNCEMENT_1200x628_1_16975336022rKKctQjur-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Dubai, UAE, October 18th, 2023, Chainwire OKX, a leading crypto exchange and Web3 technology company, today announced that futures spreads trading volumes on its Liquid Marketplace, a spot OTC, futures spreads and options liquidity network, reached a record monthly high of US$1.54 billion in September 2023. This achievement represents 62%* of the institutional market share [...]"
  }
]