[
  {
    "source": "CoinDesk",
    "date": "2023-06-27T10:00:53.000Z",
    "title": "Crypto Bankruptcy Investor Ouroboros Eyes Smaller Claims",
    "url": "https://www.coindesk.com/business/2023/06/27/crypto-bankruptcy-investor-ouroboros-eyes-smaller-claims/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The platform automates the due diligence process for buying cryptocurrency bankruptcy claims in firms like FTX or Celsius, providing previously missing liquidity for creditors owed around $50,000."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-27T10:00:00.000Z",
    "title": "Web3 Fashion Platform SYKY Launches Incubator for Emerging Digital Designers",
    "url": "https://www.coindesk.com/web3/2023/06/27/luxury-web3-fashion-platform-syky-launches-incubator-for-digital-designers/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Seven Seven Six-backed SYKY platform will work with a group of 10 digital designers to grow their skills in the year-long incubator program."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-27T10:00:00.000Z",
    "title": "Digital pound will be pseudonymous with a focus on privacy: BoE CBDC chief ",
    "url": "https://cointelegraph.com/news/digital-pound-will-be-pseudonymous-with-a-focus-on-privacy-boe-cbdc-chief",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/4702b423-db32-4840-891c-b0111f2905ed.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The underpinning technology for the UK CBDC could use a different ledger than the popular blockchain technology.</p>\n                    <p><p>The Bank of England has made significant developments in its central bank digital currency (CBDC) program. Tom Mutton, the head of the fintech and CBDC program at BoE, recently <a href=\"https://open.spotify.com/show/1B9qwepswPeR5i8eYzmUtF\" target=\"_blank\" rel=\"noopener nofollow\">shared </a>insights on the privacy aspect of the CBDC and why they might look for other options beyond blockchain as the underpinning technology.</p><p>Mutton, during his interview, said that during a recent meeting of technologists hosted by the BoE to discuss digital pound design, there was a clear disagreement on which ledger should be used for the CBDC. Thus, the bank aims to trail multiple ledger technologies including blockchain.</p><p>The digital pound dubbed Britcoin development plans was first proposed when the UK Treasury and the Bank established a joint task force to research a UK CBDC in April 2021. Later, in February 2023 the Bank issued a consultancy paper outlining the design of the digital pound. </p><p>Currently, the BOE and the Treasury are seeking <a href=\"https://www.bankofengland.co.uk/paper/2023/the-digital-pound-technology-working-paper\" target=\"_blank\" rel=\"noopener nofollow\">feedback </a>from the stakeholders and technology experts on the proposed design of its CBDC. The feedback is open until June 30.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bank-of-england-thinks-digital-pound-can-co-exist-with-private-stablecoins\"><strong><em>Digital pound could co-exist with private stablecoins</em></strong></a></p><p>Mutton, during his interview, said that during a recent meeting of technologists hosted by the BoE to discuss digital pound design, there was a clear disagreement on which ledger should be used for the CBDC. Thus, the bank aims to trail multiple ledger technologies including blockchain.</p><blockquote>“We want to be compatible with distributed-ledger business models in the private sector, but we were not convinced that distributed ledgers offered more efficiency over conventional ledgers,” Mutton said.</blockquote><p>Cointelegraph reached out to BoE to enquire about what other ledger technologies they were considering or on trial and was redirected to the consultancy paper. However, BoE did not respond at the time of writing.</p><p>Apart from the discussions around the ledger technology, Mutton also talked about the privacy aspect of the CBDC and claimed the digital pound will be focused on offering privacy to the users and won’t collect personal data. He said that the bank will be focused on providing the infrastructure while the private players will be responsible for the innovation. </p><blockquote>“There will be no data shared with the Bank of England, we will know what transactions have happened but we will have no data on the individual who did it. While the wallet provider would have the user data but won’t have access to their transaction data.”</blockquote><p>Mutton claimed BoE or the government won’t have access to any user data and even the wallet providers who have limited access to that data will need consent from the users to what data they can store. With a focus on retail, the BoE has noted earlier that the <a href=\"https://cointelegraph.com/news/bank-of-england-thinks-digital-pound-can-co-exist-with-private-stablecoins\">digital pound could co-exist with private stablecoins </a></p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\">Best and worst countries for crypto taxes — plus crypto tax tips</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-27T09:55:28.000Z",
    "title": "Reserve Bank of India expects to reach 1M CBDC users in June",
    "url": "https://cryptoslate.com/reserve-bank-of-india-expects-to-reach-1m-cbdc-users-soon/",
    "description": "<p>Reserve Bank of India (RBI) governor Shaktikanta Das said he expects the e-rupee Central Bank Digital Currency (CBDC) pilot to achieve 1 million retail users by the end of this month. The news comes after early indications suggested the e-ruppe had failed to gain traction last year. The e-rupee pilot program consists of two components: [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/reserve-bank-of-india-expects-to-reach-1m-cbdc-users-soon/\">Reserve Bank of India expects to reach 1M CBDC users in June</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-27T09:59:00.000Z",
    "title": "LTC Mining Difficulty Skyrockets, Crypto Daily TV 27/6/2023",
    "url": "https://cryptodaily.co.uk/2023/06/ltc-mining-difficulty-skyrockets-crypto-daily-tv-27-6-2023",
    "description": "In Todays Headline TV CryptoDaily News:\n<p></p>\n<p>Litecoin mining difficulty skyrockets</p>\n<p>Litecoin sees mining difficulty reaching a new value of 26 million at blocks 2 million as Bitcoin records a similar situation. Analyst predicts a bull run for Litecoin and other cryptos amid the possible approval of some Bitcoin Exchange-Traded Fund applications.</p>\n<p>Ether&rsquo;s hazy status inhibits rally</p>\n<p>US regulatory uncertainty surrounding Ether is damaging the token&rsquo;s performance compared with a recent rally in Bitcoin. The ambiguity stems from whether the US SEC will add Ether to a growing list of digital assets it deems to be unregistered securities, a designation that can make the tokens harder to trade, compared to Bitcoin's&nbsp; commodity status.</p>\n<p>FTX bankruptcy team says exchange owed customers $8.7 billion</p>\n<p>A new report from the FTX team that&rsquo;s digging through the financial guts of the failed exchange said the company owed its customers $8.7 billion after commingling and misusing their deposits, and senior executives started hiding that trouble as early as August 2022.</p>\nBTC/USD fell 0.9% in the last session.\n<p>The last session saw the Bitcoin drop 0.9% against the Dollar. The ROC is giving a negative signal. Support is at 29901.6667 and resistance at 31349.6667.</p>\n<p>The ROC is currently in negative territory.</p>\n<p></p>\nETH/USD plummeted 2.3% in the last session.\n<p>The Ethereum-Dollar pair plummeted 2.3% in the last session. The ROC is giving a negative signal. Support is at 1838.871 and resistance at 1959.571.</p>\n<p>The ROC is giving a negative signal.</p>\n<p></p>\nXRP/USD dove 2.6% in the last session.\n<p>The Ripple-Dollar pair dove 2.6% in the last session. The Ultimate Oscillator is giving a negative signal, which matches our overall technical analysis. Support is at 0.4759 and resistance at 0.5046.</p>\n<p>The Ultimate Oscillator is currently in negative territory.</p>\n<p></p>\nLTC/USD plummeted 1.3% in the last session.\n<p>The Litecoin-Dollar pair dove 1.3% in the last session. The MACD is giving a positive signal. Support is at 84.8733 and resistance at 92.0733.</p>\n<p>The MACD is giving a positive signal.</p>\n<p></p>\nDaily Economic Calendar:\n<p>US Durable Goods Orders</p>\n<p>The Durable Goods Orders measure the cost of orders received by manufacturers for durable goods, which means goods that should last three years or more, excluding the transport sector. The US Durable Goods Orders will be released at 12:30 GMT, the US Nondefense Capital Goods Orders at 12:30 GMT, the US Consumer Confidence at 14:00 GMT.</p>\n<p>US Nondefense Capital Goods Orders</p>\n<p>The Nondefense Capital Goods Orders measure the cost of orders received by manufacturers for capital goods, which are durable goods used in the production of goods or services.</p>\n<p>US Consumer Confidence</p>\n<p>The Consumer Confidence is a leading index that measures the level of consumer confidence in economic activity. </p>\n<p>FI Consumer Confidence</p>\n<p>The Consumer Confidence is a leading index that measures the level of consumer confidence in economic activity.&nbsp; Finland's Consumer Confidence will be released at 05:00 GMT, Finland's Industrial Confidence at 05:00 GMT, Italy's Business Confidence at 08:00 GMT.</p>\n<p>FI Industrial Confidence</p>\n<p>The Industry Confidence shows the opinion of manufacturing executives regarding production expectations, order books, and finished goods inventories.</p>\n<p>IT Business Confidence</p>\n<p>The Business Confidence is a survey of the current business conditions. It indicates the short-term performance of the overall economy.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T09:41:59.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 BREAKING: Twitter to enable #crypto trading in partnership with eToro. Users searching using a $Cashtag symbol currently see live charts for a select few financial assets, like $LTC. Users will soon be able to click through to eToro &#38; have the option to invest in #Litecoin. Is Litecoin silver to Bitcoin&#8217;s ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T09:54:34.000Z",
    "title": "Bitcoin might be bracing for bull run on resurgence of smart investors",
    "url": "https://crypto.news/bitcoin-might-be-bracing-for-bull-run-on-resurgence-of-smart-investors/",
    "description": "Bitcoin (BTC) has registered impressive despite a predominantly bearish atmosphere. Amid this trend, a recent analysis by a CryptoQuant market observer suggests the return of smart investors in the market, which could signal the start of a bull run.&#160; The&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-27T10:07:31.000Z",
    "title": "How High Can Bitcoin Price Rise Due To Spot ETFs? Running The Numbers",
    "url": "https://www.newsbtc.com/news/bitcoin/how-high-can-bitcoin-price-rise-due-spot-etfs/",
    "description": "The recent Bitcoin rally has led to speculation that the price could rise further with the introduction of spot ETFs. The arrival of ETFs, especially from reputable companies such as BlackRock and Fidelity, could boost institutional investor confidence and lead to a surge in the Bitcoin price. The one million dollar question, however, is: how high? Clues to answering this question can come from various metrics and data. One such data point was provided yesterday by CoinShares&#8217; Chief Strategy Officer Meltem Demirors via Twitter. As she writes, the Bitcoin spot ETF news is not the only story. Many of the largest financial institutions in the US are currently actively working to provide access to BTC and more. In total, there are more than $27 trillion in client assets waiting on the sidelines. With BlackRock, the world&#8217;s largest asset manager has filed a Bitcoin ETF application. Rumour has it that the world&#8217;s number three, Fidelity Investments, is also flirting with a Bitcoin ETF. Bitcoin ETF applications from Invesco and WisdomTree (both top 10 ETFs) are a fact. How High Can Bitcoin Rise? All-Time High? Quadruple? If just a fraction of the $27 trillion in client money managed by the largest asset managers were to go into Bitcoin spot ETFs, the impact on price would be gigantic. Just 1% would amount to over $270 billion (rather more because not all Bitcoin ETF applicants are included in the chart). In comparison, the Bitcoin market cap is currently $590 billion. Related Reading: Momentum: Why The Bitcoin Train Is Ready To Leave The Station As NewsBTC reported two weeks ago, the performance of the gold price after the first gold ETF in November 2004 could also be a metric that provides a glimpse into the future. The launch of the first gold ETFs led to a fabulous gold rally. While the price of gold was still at $400 at the time of approval, it reached $600 in 2006 and $800 in 2008. Seven years after approval, in 2011, gold reached its preliminary high of almost $2,000 (+359%). Renowned expert Will Clemente commented via Twitter: Shown below is when GLD launched, allowing easy access to Gold exposure for investors. If/when Blackrock&#8217;s (who has a 99% ETF approval) Bitcoin ETF launches (very similar structure to GLD), expect similar price action as it unlocks access to Bitcoin exposure for the masses. &#160; As Bitcoin is the digital gold of the 21st century, it is also worth looking at the market capitalizations of both assets in comparison. While BTC stands at $590 billion, the gold market capitalization is around $12 trillion. If Bitcoin were to gain just 10% of gold&#8217;s market share (around $1.2 trillion), this would be a doubling of BTC&#8217;s current market capitalization and, to put it simply, a doubling of Bitcoin&#8217;s current price. That this target is by no means impossible is shown by BTC&#8217;s all-time high of around $67,000 at the end of 2021, when its market capitalization was already around $1.2 trillion. Another benchmark is the total market capitalization of the global stock market of over $100 trillion. Apple accounts for about 3% of this. The company is thus five times as capitalised as Bitcoin. Related Reading: Bitcoin Bullish Signal: Exchange Whale Ratio Plunges One factor that also needs to be taken into account when determining the price is the supply side. As expert Alessandro Ottaviani writes, BlackRock and Fidelity would only have to move 0.3% of their managed capital into Bitcoin to buy all existing BTC on the exchanges at the current price. The on-chain analysis service Glassnode has published research on this. The analysts write that after a period of weaker relative US demand, there is a revival in 2023. This encounters a highly illiquid market. Currently, there is a continued transfer of wealth to HODLers, while more and more coins are being withdrawn from exchanges. According to Glassnode, there are currently only 2.28 million BTC left on exchanges (11.9% of circulating supply), a short term holder supply of 2.65 BTC (13.6% of circulating supply) while 14.47 BTC are held by long term holders (74.5% of circulating supply). All the above metrics and data suggest that Bitcoin is facing a huge bull run led by institutions. However, there is no guarantee for this. One thing to consider is that the US Securities and Exchange Commission could reject the Bitcoin spot ETFs despite BlackRock&#8217;s fantastic success rate. On the other hand, BlackRock and others need to buy BTC on the spot market for it to have a direct impact on the price. But one possibility is that BlackRock could buy Bitcoin over-the-counter (OTC). For example, the asset manager could buy the BTC seized by the US government (over 200,000) over-the-counter. This could lead to a &#8220;buy the rumor sell the news&#8221; event. But even if they bought over-the-counter from the US, this could be beneficial in the long run, as it means that the US government will no longer sell its BTC on the open market as it did in the past. At press time, the BTC price stood at $30,388. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T09:46:48.000Z",
    "title": "Binance Australia Cut Off from Banking System with No Warning: 1 Million Customers Affected",
    "url": "https://www.crypto-news-flash.com/binance-australia-cut-off-from-banking-system-with-no-warning-1-million-customers-affected/?utm_source=rss&utm_medium=rss&utm_campaign=binance-australia-cut-off-from-banking-system-with-no-warning-1-million-customers-affected",
    "description": "Binance has confirmed that it has been cut off from the Australian banking system with its 1 million customers affected. On top of getting short notice, the reasons given to the crypto exchange were not entirely clear. Binance has been dealt a major blow in Australia with the biggest crypto exchange by trading volume being [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-27T09:59:00.000Z",
    "title": "Trader Predicts That ETH May Climb as High as $2,750 Soon",
    "url": "https://coinedition.com/trader-predicts-that-eth-may-climb-as-high-as-2750-soon/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Trader Predicts That ETH May Climb as High as $2,750 Soon\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-2-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto trader and analyst KALEO predicted in a tweet yesterday that the market dominance of Bitcoin (BTC) may retest a higher timeframe support which was successfully challenged earlier this month. In his post, the trader added that this will not necessarily be an indication of an altcoin season, but will definitely provide a few [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/trader-predicts-that-eth-may-climb-as-high-as-2750-soon/\">Trader Predicts That ETH May Climb as High as $2,750 Soon</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]