[
  {
    "source": "Decrypt",
    "date": "2024-01-23T22:01:02.000Z",
    "title": "Edward Snowden Backs Tornado Cash Founder’s Fundraiser",
    "url": "https://decrypt.co/213958/edward-snowden-backs-tornado-cash-founders-fundraiser",
    "description": "Snowden has previously spoken out about the seriousness of the Tornado Cash saga."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-23T21:44:35.000Z",
    "title": "Meme Scheme: How Avalanche Is Picking Which Meme Coins to Buy",
    "url": "https://decrypt.co/213970/meme-scheme-how-avalanche-picking-which-coins-buy",
    "description": "The Avalanche Foundation is investing in meme coins via a \"Culture Catalyst\" fund. Here's how they're picking tokens."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-23T21:45:00.000Z",
    "title": " All eyes are on $40K Bitcoin price leading into Friday’s $4.5B BTC options expiry ",
    "url": "https://cointelegraph.com/news/all-eyes-are-on-40k-bitcoin-price-leading-into-friday-s-4-5b-options-expiry",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYzMxZTMxZTYtY2M5My00NjIxLTkyNjMtYWExNjhlZGViNjRiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin price is trading at levels few analysts anticipated. Could this week’s $4.5 billion options expiry help change the trend? </p>\n                    <p><p>Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price traded below the $40,000 support on Jan. 18 for the first time in 50 days, and the upcoming $4.5 billion BTC monthly options expiry on Jan. 26 might hold the key to whether the downtrend will continue. Oddly enough, the U.S. stock market reached an all-time high on Jan. 22, indicating that whatever held back Bitcoin’s performance is unlikely to be related to the macroeconomic scenario.</p><p>Some analysts argue that most of the selling <a href=\"https://cointelegraph.com/news/ftx-estate-sold-most-grayscale-bitcoin-trust-shares-report\">pressure comes from the Grayscale GBTC</a>, which experienced significant outflows since its conversion to a spot exchange-traded fund (ETF) on Jan. 11. The instrument holds over $25 billion in assets, and despite being listed since 2015 in the form of a Trust fund, its investors were previously unable to request redemptions.</p><p>Bitcoin influencer @alanbwt described the situation on X social network as \"the biggest blown lead in the history of Bitcoin,\" considering Grayscale's GBTC entered Jan. 11 with a $27 billion capitalization, while <a href=\"https://cointelegraph.com/news/spot-bitcoin-etfs-scoop-up-10000-btc-day-5-trading\">Fidelity, BlackRock, Bitwise</a>, and the remaining contenders had to start from scratch. However, Grayscale opted for a 1.5% yearly administration fee—far higher than its incumbents—triggering the selling pressure on GBTC shares.</p><p><a href=\"https://cointelegraph.com/news/all-eyes-are-on-40k-bitcoin-price-leading-into-friday-s-4-5b-options-expiry\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-23T21:40:55.000Z",
    "title": " Court orders $20M to be paid out in Crowd Machine 2018 ICO case  ",
    "url": "https://cointelegraph.com/news/court-orders-20-million-paid-crowd-machine-2018-ico-case",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvM2ZiMDEwODYtMTZlMy00MjFiLThhMGEtZDJjZjJjODc0ZmQzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Crowd Machine Compute Token was meant to pay to use holders’ computer time, but it never became operational. </p>\n                    <p><p>A court in California has ruled that Crowd Machine and Metavine, issuers of Crowd Machine Compute Tokens (CMCT), pay more than $20 million in disgorgement, interest and penalties in a case that began over two years ago. The companies’ founder, Craig Sproule, was also found liable.</p><p>Sproule’s troubles began in January 2022, when the United States Securities and Exchange Commission (SEC) <a href=\"https://cointelegraph.com/news/sec-files-complaint-against-operator-of-unregistered-33m-crowd-machine-ico\">filed suit against him claiming</a> that the 2018 initial coin offering (ICO) for CMCT was a “fraudulent and unregistered” securities sale. Besides the claim of unregistered securities sales, it was also alleged that Sproule misused and lost $5.8 million of the $33 million he raised. </p><p>CMCT was designed to reimburse computer owners for using their computing power and pay programmers for writing code. The tokens never became operational.</p><p><a href=\"https://cointelegraph.com/news/court-orders-20-million-paid-crowd-machine-2018-ico-case\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T22:02:47.000Z",
    "title": "HashKey Group and OKX forge game-changing blockchain alliance",
    "url": "https://www.cryptopolitan.com/hashkey-group-and-okx-forge-partnership/",
    "description": "HashKey Group, a leading digital asset management and blockchain solutions provider, has announced a strategic partnership with OKX, a top-tier virtual asset exchange. This collaboration is set to revolutionize the digital asset landscape in Hong Kong, focusing on blockchain infrastructure, product innovation, and investor education. HashKey Group and OKX commit to investor education The cornerstone [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T21:56:20.000Z",
    "title": "A quick overview of today’s crypto events and news",
    "url": "https://www.cryptopolitan.com/overview-of-todays-crypto-events-and-news/",
    "description": "In today&#8217;s fast-paced world of cryptocurrency, a myriad of events unfolds that can reshape the landscape of digital finance. From the shifting sands of Coinbase&#8217;s market position to the intricate details of Bitcoin ETFs&#8217; on-chain activities, and the penetrating gaze of U.S. legislators on Meta&#8217;s blockchain ambitions, the crypto sphere is a hive of activity. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T21:49:33.000Z",
    "title": "Bitcoin Analyst Foresees Rapid Price Recovery Amid Coinbase Premium Gap Trend",
    "url": "https://www.cryptopolitan.com/bitcoin-analyst-foresees-price-recovery/",
    "description": "A prominent Bitcoin analyst has offered a confident outlook for Bitcoin&#8217;s price recovery in the wake of recent developments involving the Coinbase Premium Gap. This metric, which tracks price disparities between Coinbase and Binance, has drawn attention due to its potential implications for the market. The Bitcoin analyst&#8217;s observations suggest a favorable climate for Bitcoin, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T21:46:22.000Z",
    "title": "Investor hopes for early interest rate cuts WILL be crushed",
    "url": "https://www.cryptopolitan.com/investor-hopes-for-early-interest-rate-cuts/",
    "description": "Dreams of imminent rate cuts by the Federal Reserve seem to be just that &#8211; dreams. Investors, riding high on the wave of a recent stock market rally and fueled by a perceived disinflationary trend, have been placing their bets on the Fed initiating rate cuts as soon as March or May. However, these expectations [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-23T21:55:02.000Z",
    "title": "Cryptocurrency Market Faces Contraction As Bitcoin And Ethereum Decline",
    "url": "https://nulltx.com/cryptocurrency-market-faces-contraction-as-bitcoin-and-ethereum-decline/",
    "description": "The cryptocurrency market witnessed a notable downturn as Bitcoin slipped below the $40,000 mark, accompanied by Ethereum&#8217;s decline to a low of $2,303. Reports reveal significant movements of Ethereum by Celsius and FTX. Celsius Network initiated the transfer of 15,200 ETH ($36.04 million) to Coinbase and FalconX. Despite this movement, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-23T22:00:16.000Z",
    "title": "Taurus expands tokenized securities trading to retail clients",
    "url": "https://crypto.news/taurus-expands-tokenized-securities-trading-to-retail-clients/",
    "description": "Swiss fintech Taurus, supported by Deutsche Bank, now offers tokenized securities trading to retail clients following regulatory approval."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-23T21:49:01.000Z",
    "title": "SEC Commissioner: Ethereum ETF approvals won’t be same as Bitcoin",
    "url": "https://crypto.news/sec-commissioner-ethereum-etf-approvals-wont-be-same-as-bitcoin/",
    "description": "SEC Commissioner Hester Peirce said that the Ethereum ETF approval process won’t be the same as Bitcoin, as the SEC has learned several lessons from the spot Bitcoin ETF saga. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-23T22:00:27.000Z",
    "title": "Expert Analysis: Six Factors Suggest Bitcoin Price Won’t Drop Below $37,800",
    "url": "https://www.newsbtc.com/bitcoin-news/expert-analysis-six-factors-suggest-bitcoin-price-wont-drop-below-37800/",
    "description": "In the past month, the Bitcoin price has experienced a significant decline after reaching a 22-month high of $49,000. Currently, the largest cryptocurrency has fallen below the crucial $40,000 mark, raising concerns about the prospects of the ongoing bull run and the overall bullish market structure.  However, there are indications that the bottom of the current downtrend may be near, potentially setting the stage for a potential price reversal. Bitcoin Price To Avoid Plummeting To Low $30,000s Market analyst Marco Johanning sheds light on the situation, offering insights into the Bitcoin price movement. Johanning suggests that it won&#8217;t be long until Bitcoin reclaims the $41,500 level or potentially rises from a lower level if a specific scenario unfolds.  According to Johanning, Bitcoin will finally encounter significant liquidity on the downside. Notably, the price has touched around below $39,000 multiple times, indicating the presence of substantial liquidity at these lows.  Related Reading: JP Morgan Reveals Likelihood Of Spot Ethereum ETFs Getting Approved Moreover, Johanning addresses the skepticism surrounding the price of around $37,800, arguing against widespread expectations of a drop into the low $30,000 range.  Johanning emphasizes that the primary liquidity lies below $40,000 and is not in the low $30,000 range. Traders profited from the low $30,000 range have likely adjusted their stop orders to protect their gains, creating a layer of support below the recent equal lows.  As the price starts hitting these stop orders, automatic selling occurs, further down the price until it encounters significant buy pressure. The analyst points out a daily order block at $37,700 and high timeframe (HTF) support at $38,5000, indicating the potential for notable buy pressure in these price regions.  Johanning also highlights the likelihood of filling Chicago Mercantile Exchange (CME) gaps and Imbalances, with the next imbalance anticipated below $33,000. Short Squeeze Rally Imminent?  According to Johanning, the prevailing sentiment reveals many bears waiting to short a market dump. Johanning predicts that a short squeeze could occur once the price reverses, leading to a rapid price increase. In terms of Fibonacci retracement levels, Johanning suggests that since the Bitcoin price has already lost the $40,200 level, it could potentially fall to the 0.5% Fibonacci level, which coincides with those above the $37,800 level.  Johanning speculates that the price may briefly touch $37,800 before closing above the HTF support level of $38,500, setting the stage for a potential upward movement. Related Reading: Celsius Dump Triggers Ethereum Dive: $35 Million Sell-Off Sends ETH Price Crashing The recent downtrend in Bitcoin&#8217;s price has raised concerns about continuing the bull run. However, market analyst Marco Johanning presents several key arguments supporting the possibility of a price reversal.  With Bitcoin&#8217;s current price at $38,900, there is a possibility of increased buying pressure in this region. The support wall at $38,5000 has demonstrated resilience thus far, and its performance will be closely observed.  If the support wall fails to hold, the market will observe how the $37,800 price level performs and whether it aligns with the analyst&#8217;s thesis. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-23T21:48:00.000Z",
    "title": "Binance Slams SEC’s Hypocritical Stance on Crypto Regulation: Report",
    "url": "https://coinedition.com/binance-slams-secs-hypocritical-stance-on-crypto-regulation-report/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance Slams SEC’s Hypocritical Stance on Crypto Regulation: Report\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/SEC-Suspects-Binances-Overseas-Trade-Violates-Federal-Securities-Law-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Securities and Exchange Commission’s autocratic authority over the crypto space has been in question over the past years. In the recent Binance-SEC court hearing, Binance lawyers criticized the regulators’ hypocritical stance on crypto regulation. As per reports, Judge Amy Berman Jackson, US District Court for the District of Columbia, ordered the SEC to define [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/binance-slams-secs-hypocritical-stance-on-crypto-regulation-report/\">Binance Slams SEC’s Hypocritical Stance on Crypto Regulation: Report</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]