[
  {
    "source": "Cointelegraph",
    "date": "2023-05-27T15:32:56.000Z",
    "title": "Crypto Stories: Cheds recounts how he leaned on crypto during his toughest times",
    "url": "https://cointelegraph.com/news/crypto-stories-cheds-recounts-how-he-leaned-onto-crypto-after-his-toughest-times",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/6ba45d75-a7a1-4a6d-8227-4d8d3745b907.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cheds shares the story of how he shifted his focus to crypto after being diagnosed with cancer. </p>\n                    <p><p>Technical analyst Cheds has dreamed of being a trader since his childhood. However, the journey he had to take to fulfill his dream wasn’t very straightforward. </p><p>In an episode of Cointelegraph’s <em>Crypto Stories</em>, Cheds shared his humble beginnings. According to the technical analyst, he always dreamed about trading stocks since he was a kid. He said: </p><blockquote>“I loved the idea of buying low and selling high. Playing the market seemed like a great way to become rich enough to buy my own island.”</blockquote><p>Despite this, life had other plans. He studied psychology in college and eventually decided to get some experience in sales and marketing, working his way to upper management of the company he worked in. Even though he was walking a different path, he never let go of his desire to trade and kept an eye on stocks. </p><p>He was then introduced to penny stocks and started trading marijuana stocks. According to Cheds, he was able to grow his portfolio only to find out that the news people were basing their trading decisions on was spurred by holders looking to find a way to sell their shares. He experienced massive losses and decided to take a break from trading. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/qpxXKBX7qlY\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Eventually, Cheds said he was able to accept his situation, and a fire was lit inside him. “I would have to become a well-rounded trader. The skills I learned from studying psychology and poker were just not enough. I would have to get better at technical analysis,” he said. This sparked the beginnings of his social media account and blog about technical analysis. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-stories-scott-melker-tells-the-story-of-how-he-became-the-wolf-of-all-streets\"><strong><em>Crypto Stories: Scott Melker tells the story of how he became The Wolf of All Streets</em></strong></a></p><p>Fast forward a few years, and he was finally able to earn enough to quit his day job and realize his childhood dream of being a trader. The next year, Cheds discovered Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) and Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) through a friend. He started sharing crypto charts and analysis, rapidly growing his social media. </p><p>The trader faced a new challenge not long after when he was diagnosed with cancer. At the time, he embraced his new identity as a crypto trader. “Instead of focusing on being sick and vulnerable all the time, I wanted to focus on being a top-notch technical analyst,” he said. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ripple-visa-hong-kong-cbdc-pilot-huobi-token-allegations-asia-express/\"><strong><em>Asia Express: Ripple, Visa join HK CBDC pilot, Huobi accusations, GameFi token up 300%</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-05-27T15:12:46.000Z",
    "title": "Gemini challenges SEC in legal battle over Earn product",
    "url": "https://crypto.news/gemini-challenges-sec-in-legal-battle-over-earn-product/",
    "description": "Gemini strikes back in a fierce legal battle against the SEC as the crypto giant defends its Earn product, claiming it's not a security but a loan-based offering. "
  }
]