[
  {
    "source": "NewsBTC",
    "date": "2023-07-19T02:00:58.000Z",
    "title": "Avalanche (AVAX) Q2 Success: Network Activity Surges, Revenue Jumps 170%",
    "url": "https://www.newsbtc.com/avalanche/avalanche-avax-q2-success-network-activity-surges-revenue-jumps-170/",
    "description": "Avalanche, the smart contract platform for decentralized applications, witnessed remarkable growth in  Q2 2023, driven by increased activity on the C-Chain- one of the three chains that make up the Avalanche network- and the launch of new subnets.  According to a recent report by Messari, the network&#8217;s daily average active addresses and transactions on the C-Chain was increased by 132.1% and 162.2%, respectively, primarily due to a rise in stablecoin liquidity and activity from LayerZero.  Avalanche’s Unprecedented Growth Per the report, despite the challenging regulatory climate, Avalanche&#8217;s financial performance improved in Q2, with revenue in AVAX increasing by 173.1% Quarter-Over Quarter (QoQ) (up 150.3% in USD terms).  The increased revenue was partly due to higher transaction fees but primarily due to the activity stemming from LayerZero.  The difference between the change in revenue versus market cap suggests that the overall fundamental network utility was more significant than market behavior in Q2. Avalanche concluded the quarter as the 18th largest crypto asset by market capitalization, reaching $4.5 billion. Related Reading: Thodex CEO Sentenced To Prison For Tax Evasion Furthermore, the platform has been launching new subnets like Evergreen Subnets and Spruce, which have ushered in partners like T. Rowe Price, WisdomTree, Wellington Management, and Cumberland.  Alibaba Cloud also launched Cloudverse, a launchpad for businesses to deploy metaverses on Avalanche, and SK, one of South Korea&#8217;s largest conglomerates, launched its dedicated Avalanche Subnet, UPTN. In Q4 2022, LayerZero, an Omnichain interoperability protocol enabling cross-chain applications, launched support for BTC.b, a token representing Bitcoin on Avalanche.  Compared to other natively bridged Bitcoin assets, BTC.b allows users to freely transfer native Bitcoin without relying on custodians. BTC.b adoption on Avalanche quickly grew after LayerZero&#8217;s support in Q4 2022. Avalanche NFT Secondary Sales And Unique Buyers Decrease According to Messari, the Avalanche NFT sector experienced a decline in Q2 of 2023, with secondary sales volume and the number of unique NFT buyers decreasing by 38.3% and 49.8%, respectively.  However, despite the decline, Avalanche&#8217;s developer ecosystem expanded the NFT sector through new initiatives and partnerships. One such initiative was the Avaissance program, launched in Q1 to accelerate artists&#8217; careers and catalyze the Avalanche NFT ecosystem. The program comprised an Artist-in-Residence program and the Mona Lisa Initiative for digital art curation.  During Q2, 70 artists were selected to participate in the 6-month Artist-in-Residence program, and the Mona Lisa Initiative announced the initial group of participating DAOs. Superchief Gallery NFT, Zeroone, and Peek NFT, three new marketplaces also announced partnerships with Avalanche and Ava Labs to launch unique NFT marketplaces.  In the gaming sector, DeFi Kingdoms continued to dominate, generating the lion&#8217;s share of transaction activity on the Avalanche network. However, several developments are underway to usher in more gaming activity from other applications.  Related Reading: XRP Overtakes Bitcoin In Highest Weekly Trading Volume Following Legal Triumph Avalanche introduced Avalanche Arcad3, a program to accelerate gaming development with partners like GREE, Loco, and TSM, and Merit Circle&#8217;s launch of Beam, a subnet catering to gamers and game developers. Gunzilla Games, Battle for Giostone (BFG), Draft Labs, Defimons, and NEOBRED announced their Avalanche launches during Q2. Overall, Q2 was a positive quarter for Avalanche, and the platform&#8217;s plans for 2023 remain robust as it seeks to remain competitive throughout the rest of the year. Despite the challenges posed by the SEC, Avalanche&#8217;s renewed network activity and expansion plans suggest that the platform is well-equipped to navigate the evolving landscape of the blockchain industry. Featured image from Unsplash, chart from TradingView.com"
  }
]