[
  {
    "source": "Bitcoin.com",
    "date": "2024-02-13T02:00:25.000Z",
    "title": "Crypto Community Fires Back at Hillary Clinton’s Criticism of Bitcoin Undermining US Dollar as Reserve Currency",
    "url": "https://news.bitcoin.com/crypto-community-fires-back-at-hillary-clintons-criticism-of-bitcoin-undermining-us-dollar-as-reserve-currency/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/us-dollar-clinton-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Community Fires Back at Hillary Clinton&#039;s Criticism of Bitcoin Undermining US Dollar as Reserve Currency\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/us-dollar-clinton-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/us-dollar-clinton-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/us-dollar-clinton-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/us-dollar-clinton-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/us-dollar-clinton-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/us-dollar-clinton-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/us-dollar-clinton.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The crypto industry has responded to criticism from Hillary Clinton, who said that cryptocurrency can undermine the role of the U.S. dollar as the world&#x2019;s reserve currency. Galaxy Digital CEO Mike Novogratz argued that the only thing that can undermine the U.S. dollar as a reserve currency is reckless spending by both U.S. political parties. [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-13T02:00:36.000Z",
    "title": "Cardano’s Future Revealed: Founder Would “Love To Be The Taylor Swift Of Blockchain”",
    "url": "https://www.newsbtc.com/news/cardano/cardanos-future-revealed-founder-would-love-to-be-the-taylor-swift-of-blockchain/",
    "description": "Charles Hoskinson, co-founder of Cardano, joined Discovery Crypto to discuss his thoughts about the state of the crypto space, what current developments in the industry suggest, and the network&#8217;s future as the “Taylor Swift of Blockchains.” Related Reading: Top-Trader Picks Cardano As Bull Market Leader: Here’s Why Cardano’s Big Reputation The recent interview sparked a discussion about Cardano’s relationship with crypto exchanges like Gemini and other figures in the crypto industry, as the interviewers suggested there appears to be a “coordinated effort to minimize Cardano’s impact.” During this discussion, Charles Hoskinson noted that most players in the crypto space seem to &#8220;fear&#8221; Cardano for “doing everything right” since the beginning. Hoskinson listed factors like liquid staking and its growth without Venture Capital (VC) funding as crucial elements that make Cardano “pretty scary.” When asked why stablecoins like USDC are not on the Cardano blockchain, it was highlighted that the reason is neither economical nor technical. Instead, the conversation indicates a seeming “lack of a strong desire to engage” with the blockchain and its projects. Following the discussion, Hoskinson expressed his thoughts and concerns on asset-backed stablecoins, affirming that he doesn’t like them and they “are not crypto” despite 80-90% of the real money velocity and value transactions that happen on-chain being done through them. The Cardano founder considers the highly centralized state of asset-backed stablecoins as a concerning matter, as they grant control over the crypto space to a few entities: At the end of the day, they’re controlled by centralized entities, and the problem when you look at asset-backed stablecoins connect them to CEXs, centralized exchanges, they have gargantuan and enormous control and now we have a new actor, ETFs, and a huge amount of control over crypto. So, 10 companies now basically control the cryptocurrency space. Hoskinson’s View Of The Crypto Industry’s Future The current developments of the crypto space are also a matter of concern for Cardano’s founder, with the recent tendencies and developments leaning towards a &#8220;road opposite of the original mission for cryptocurrencies: financial freedom. To Hoskinson, the crypto market is handing “soft power” to a handful of regulated entities that control the value and volume of the crypto industry instead of aiming to take down “banks and legacy financial systems.” Cardano’s founder considers asset-backed stablecoins inevitable and highlighted that Cardano “is not looped into that, but eventually it will happen.” However, he believed addressing his concerns was necessary as they weren’t “compatible with the long-term cryptocurrencies being decentralized” and would generally affect the industry. To address this concern, Cardano’s team has extensively researched algorithmic stablecoins, as Hoskinson considers them a potential solution more suitable for the crypto industry. Lastly, Cardano’s founder closed the interview by comparing American Singer Taylor Swift and the crypto industry, jokingly suggesting that compared to the 14th Grammy winner, nobody knows who Charles Hoskinson is. However, the interviewer pointed out that, like Swift, Cardano could follow a similar trajectory and grow from a smaller and niche artist to a globally recognized and mainstream figure with a significant impact on the world. Hoskinson replied that he &#8220;would love to be the Taylor Swift of Blockchain.&#8221; Related Reading: Cardano Bulls Come Out To Play: Buy Orders Dominate As ADA Price Soars ADA is trading at $0.5419 in the hourly chart. Source: ADAUSDT on Tradingview.com Featured image from Unsplash.com, Chart from Tradingview.com"
  }
]