[
  {
    "source": "Decrypt",
    "date": "2023-09-29T19:28:46.000Z",
    "title": "What's Stopping Fortnite and Call of Duty From Using the Same Items? It's Not Just NFTs",
    "url": "https://decrypt.co/199378/whats-stopping-fortnite-call-duty-using-same-items-not-just-nfts",
    "description": "Will the video game industry open up and play nice? These are the hurdles left to overcome to enable interoperable items at scale."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-29T19:15:26.000Z",
    "title": "Terra's Do Kwon Admits to Faking Trading Volume in Leaked Chat: Court Docs",
    "url": "https://decrypt.co/199375/terras-do-kwon-admits-to-faking-trading-volume-in-leaked-chat-court-docs",
    "description": "\"I won't tell if you won't,\" Terra's Do Kwon said, according to SEC documents. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-29T19:30:35.000Z",
    "title": "Gemini confirms it withdrew $282M from Genesis to boost liquidity reserves in 2022",
    "url": "https://cryptoslate.com/gemini-confirms-it-withdrew-282m-from-genesis-to-boost-liquidity-reserves-in-2022/",
    "description": "<p>Gemini has confirmed it withdrew $282 million of its Earn users funds from the bankrupt crypto lender Genesis in August last year into its liquidity reserve, according to a Sept. 28 statement. The exchange made this statement in response to a New York Post report alleging that the crypto platform&#8217;s co-founders, Tyler and Cameron Winklevoss, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/gemini-confirms-it-withdrew-282m-from-genesis-to-boost-liquidity-reserves-in-2022/\">Gemini confirms it withdrew $282M from Genesis to boost liquidity reserves in 2022</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-29T19:30:59.000Z",
    "title": "MATIC Price Downtrend Halted As Google Cloud Joins Polygon Network",
    "url": "https://www.newsbtc.com/analysis/matic-analysis/matic-price-downtrend-halted-as-google-cloud-joins-polygon-network/",
    "description": "Google Cloud, the renowned cloud computing service provided by Google, has made a significant move by becoming a validator on the Polygon (MATIC) network.  This collaboration aims to bolster the security of the Polygon Proof-of-Stake (PoS) network, with Google Cloud employing its infrastructure, which powers popular platforms like YouTube and Gmail, to contribute to the network&#8217;s integrity. Google Cloud Strengthens Polygon Network Security Polygon Labs, the team behind the Polygon protocol, recently announced that Google Cloud has joined their validator set. This move brings Google Cloud into the fold of over 100 validators responsible for verifying transactions on the Layer 2 Ethereum (ETH) network offered by Polygon.  Related Reading: This Bullish Combination Has Finally Formed For Bitcoin, Rally Ahead? In a statement shared on X (formerly known as Twitter), Polygon highlighted the significance of Google Cloud&#8217;s involvement, emphasizing utilizing the same infrastructure that underpins YouTube and Gmail to safeguard the fast and cost-effective Ethereum-based Polygon protocol. According to the announcement, by joining forces with over 100 other validators, Google Cloud adds to the collective efforts to secure the Polygon PoS Network.  Including reputable and security-focused validators like Google Cloud provides an additional layer of confidence for Heimdall, Bor, and the Polygon PoS ecosystem users. The collaboration between Google Cloud and Polygon Labs extends beyond a validator partnership. It is described as an ongoing strategic collaboration, indicating a long-term commitment to advancing the adoption and development of Web3 technologies.  As part of their joint efforts, Google Cloud APAC released a YouTube video titled &#8220;Polygon Labs is solving for a Web3 future for all,&#8221; further underscoring their shared vision for a decentralized web. The Google Cloud team further stated:  Is there an easier way to build and grow Web3 products? That’s the mission of Polygon Labs, and with the help of Google Cloud, it&#8217;s one step closer to making this vision a reality. We are now serving as a validator on the Polygon PoS network, contributing to the network&#8217;s collective security, governance, and decentralization alongside 100+ other validators. Overall, the involvement of Google Cloud, a prominent player in the cloud computing industry, as a validator on the Polygon network brings increased credibility and expertise to the ecosystem.  This collaboration is expected to enhance Polygon&#8217;s network infrastructure&#8217;s overall security and reliability, benefiting users who rely on the platform for seamless and efficient blockchain transactions. MATIC Breaks Free From 3-Month Downtrend Polygon&#8217;s native cryptocurrency, MATIC, has successfully broken a 3-month downtrend that had pushed the token to reach a yearly low of $0.5040 on Wednesday.  However, in the past 24 hours, there has been a notable rebound in MATIC&#8217;s price, experiencing a 1.7% surge and currently trading at $0.5240.  Related Reading: Bitcoin Eyes Turnaround: Could A New All-Time High Be On The Horizon? Analyst Predicts This upward movement is further supported by the Squeeze Momentum Indicator, which has broken the downtrend pattern, indicating the initiation of a recovery phase for MATIC since Friday. It is important to note that MATIC&#8217;s ADX indicator displays a spike downwards, suggesting low volatility and a neutral battle between bullish and bearish forces in the cryptocurrency market. Looking ahead, MATIC faces obstacles around the $0.5442 zone, which it failed to surpass on September 21. Conversely, if the uptrend continues, the next significant hurdle lies at $0.5951 before reaching the $0.6000 level, which has not been achieved since late August. The sustainability of MATIC&#8217;s uptrend and its ability to strive towards its yearly high of $1,569, reached in February, remains uncertain and will require further observation. Featured image from Shutterstock, chart from TradingView.com"
  }
]