[
  {
    "source": "CryptoSlate",
    "date": "2023-08-18T00:20:24.000Z",
    "title": "SpaceX saw valuation of Bitcoin holdings fall by $373M over two years: WSJ",
    "url": "https://cryptoslate.com/elon-musks-spacex-saw-bitcoin-holdings-fall-by-373m-over-two-years/",
    "description": "<p>SpaceX&#8217;s Bitcoin (BTC) holdings have declined over a two-year period, according to a report from the Wall Street Journal on Aug. 17. According to WSJ, SpaceX wrote down its Bitcoin holdings by $373 million over the course of 2022 and 2021, including by selling the asset. The reporting did not state how much Bitcoin the company [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/elon-musks-spacex-saw-bitcoin-holdings-fall-by-373m-over-two-years/\">SpaceX saw valuation of Bitcoin holdings fall by $373M over two years: WSJ</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-18T00:14:08.000Z",
    "title": "Shiba Inu Botches Shibarium Launch, $2.5M in Crypto Stuck",
    "url": "https://cryptobriefing.com/shiba-bridge-shiubarium-funds-stuck/?utm_source=feed&utm_medium=rss",
    "description": "Shibarium's much-anticipated launch had a rocky start when bridging issues left $2.5 million worth of assets trapped on-chain."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-18T00:30:22.000Z",
    "title": "Judge Grants SEC’s Request to Seek Interlocutory Appeal in Ripple Case Over XRP",
    "url": "https://news.bitcoin.com/judge-grants-secs-request-to-seek-interlocutory-appeal-in-ripple-case-over-xrp/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-ripple-xrp-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Judge Grants SEC&#039;s Request to Seek Interlocutory Appeal in Ripple Case Over XRP\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-ripple-xrp-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-ripple-xrp-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-ripple-xrp-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-ripple-xrp-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-ripple-xrp-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-ripple-xrp-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-ripple-xrp.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />District Judge Analisa Torres has granted the request by the U.S. Securities and Exchange Commission (SEC) seeking to file an interlocutory appeal in the Ripple case over XRP. Judge Torres&#x2019; approval came one day after Ripple Labs filed its objection to the SEC&#x2019;s request. Judge Approves SEC&#x2019;s Request in Ripple-XRP Case The U.S. Securities and [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-18T00:10:52.000Z",
    "title": "Post-Hack Shenanigans: Curve (CRV) To Launch On TRON Following $2 Million Investment",
    "url": "https://www.newsbtc.com/news/defi/curve-to-launch-on-tron/",
    "description": "Curve Finance, a decentralized liquidity pool for stableswap and stablecoin trading, has disclosed a strategic partnership that will see the decentralized exchange (DEX) launch on the TRON network.  Curve Set To Launch On Tron And BTTC Networks Decentralized Exchange, Curve Finance has solidified its position as the second largest DEX, following the announcement of its integration into the TRON network. Curve Finance&#8217;s recent alliance with the TRON network has prompted a substantial investment from TRON DAO Ventures, a venture capital firm established by the TRON network. On Thursday, August 17, TRON Founder, Justin Sun purchased $2 million worth of CRV, the native token of the DeFi protocol.  Similarly, Curve Finance has stated that it will be launching on the BitTorrent Chain (BTTC) network, a peer-to-peer network blockchain scaling solution for file and data sharing. The Integration of the protocol into TRON DAO and BTTC networks aims to fuel the development of innovative DeFi projects and the growth of DeFi ecosystems.  Curve Finance is widely known for its role in stable coin trading by providing low slippage exchanges through automated market maker (AMM) algorithms. By aligning with the protocol, TRON  and BTTC will benefit from lower financial costs and indirect backing from prominent blockchains Curve DAO supports including Avalanche, Ethereum, and Arbitrum. Justin Sun welcomed the newly formed alliance with enthusiasm. He commented that Curve Finance plays a pivotal role in the DeFi ecosystem and blockchain industry and looked forward to new innovative solutions promoted by the partnership.  &#8220;Curve is an essential DeFi infrastructure for the blockchain industry. Our thoughts are with the team and the users affected. As a community, let&#8217;s support and strengthen the security measures to protect our decentralized ecosystem,” Sun stated.  CRV price resting at $0.54 &#124; Source: CRVUSDT on Tradingview.com Compensation For Hack Victims Following Tron Alliance The decentralized finance (DeFi) landscape was previously shaken up following news of a hack on the DEX. On July 30, Curve Finance fell victim to a reentrancy attack that exploited vulnerabilities in its smart contract codes, resulting in a loss of $62 million.  Following the news of the hack attack, the CRV token declined and the majority of the DeFi ecosystem was in panic. However, Curve Finance has reportedly recovered 70% of the funds and to recover the rest of the stolen funds, the protocol has placed a bounty on the attacker, promising $1.85 million to anyone able to reveal the hacker’s identity.  Curve Finance has also promised to compensate victims of the security breach. The DEX has stated that it will distribute reimbursements fairly as they determine the extent of damages and work toward recovering the stolen funds.  Featured image from Zipmex, chart from Tradingview.com"
  }
]