[
  {
    "source": "Decrypt",
    "date": "2023-09-18T17:15:26.000Z",
    "title": "Citigroup Will Let Rich Clients Use Private Blockchain to Transfer Assets",
    "url": "https://decrypt.co/197602/citigroup-launches-smart-contract-digital-token-service-for-institutions",
    "description": "Citigroup is allowing big money clients to transform their deposits into digital tokens. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T17:32:27.000Z",
    "title": "Price analysis 9/18: SPX, DXY, BTC, ETH, BNB, XRP, ADA, DOGE, TON, SOL",
    "url": "https://cointelegraph.com/news/price-analysis-9-18-spx-dxy-btc-eth-bnb-xrp-ada-doge-ton-sol",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/e69a5a41-6b91-4395-a0e3-92921eb7f4f4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin and select altcoins are attempting to make a comeback as traders expect the Fed to hold rates steady during their meeting this week.</p>\n                    <p><p>The failure of the bears to sink Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price below $25,000-support ignited buying interest last week. The positive momentum picked up further at the start of the new week and buyers are trying to sustain Bitcoin’s price above $27,000.</p><p>Market participants seem to be buoyant on expectations that the Federal Reserve will not hike rates this year. The CME FedWatch <a href=\"https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html\" target=\"_blank\" rel=\"noopener nofollow\">Tool</a> shows a 58% probability that the rates will remain at the current levels even in the December meeting.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/712832e1-7b71-4f84-864c-bdfbb1990b5c.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>That could be one of the reasons why the strength in the United States dollar index (DXY) has not adversely impacted the price of Bitcoin. However, traders need to be careful as the last ten days in September are known to favor the bears. According to the Carson Group, the S&amp;P 500 Index (SPX) has been <a href=\"https://www.cnbc.com/2023/09/17/stock-futures-are-little-changed-as-wall-street-awaits-fed-meeting-live-updates.html\" target=\"_blank\" rel=\"noopener nofollow\">positive</a> on average only for two days between Sep. 20 and 30 since 1950.</p><p>Could Bitcoin and select altcoins extend their recovery further or will bears pull the price lower? Let’s analyze the charts to find out.</p><h2>S&P 500 Index price analysis</h2><p>The S&amp;P 500 Index broke above the moving averages on Sep. 14 but the bulls could not keep up the momentum and clear the overhead hurdle at the downtrend line.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/7795aff3-1f95-4645-8e42-93c878cdfc00.png\"  /><figcaption style=\"text-align: center;\"><em>SPX daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=TVC%3ASPX\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears sold aggressively at the downtrend line and pulled the price back below the moving averages on Sep. 15. Sellers will try to further strengthen their position by pulling the price below the next support at 4,030. If they do that, it will open the doors for a potential retest of the vital support at 4,325.</p><p>If bulls want to gain the upper hand, they will have to quickly drive the price above the downtrend line. There is a minor resistance at 4,542 but if this level is crossed, the index could sprint toward 4,607.</p><h2>U.S. dollar index price analysis</h2><p>The U.S. dollar index has continued to grind higher in the past few days but it is likely to face stiff resistance at 106.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/9f434aa6-3f28-4d17-9a66-6ca95dc9a515.png\"  /><figcaption style=\"text-align: center;\"><em>DXY daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=TVC%3ADXY\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If buyers do not allow the price to dip below the 20-day exponential moving average (104), it will enhance the prospects of a rally above 106. If that happens, the index could pick up momentum and soar to 108.</p><p>Alternatively, if the price turns down sharply from 106, it will suggest that bears are defending this level aggressively. A drop below the 20-day EMA could sink the price to the 50-day simple removing average (102). That could keep the price stuck between 101 and 106 for some more time.</p><h2>Bitcoin price analysis</h2><p>Bitcoin has maintained above the 20-day EMA ($26,394) since Sep. 14, indicating that the bulls have flipped the level into support. Buyers are trying to strengthen their position further by pushing the price above the 50-day SMA ($27,255).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/2060e11f-9c59-4896-8cff-3a6519307db2.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears are expected to pose a strong challenge in the zone between the 50-day SMA and the overhead resistance at $28,143. If the price turns down sharply from this zone, it will indicate that the BTC/USDT pair may stay range-bound between $24,800 and $28,143 for a few days.</p><p>On the other hand, if bulls drive the price above $28,143, it will clear the path for $30,000 and $31,000 as the next targets. </p><p>Overall, time is running out for the bears. If they want to regain control, they will have to quickly yank the price back below the 20-day EMA. </p><h2>Ether price analysis</h2><p>After struggling near the 20-day EMA ($1,639) for the past few days, the bulls succeeded in pushing Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) above the overhead resistance on Sep. 18.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/cf869dc7-e39b-45ec-98f7-bd0c42659817.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AETHUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The 20-day EMA is flattening out and the RSI is near the midpoint, indicating that the bulls are on a comeback. If buyers sustain the price above the 20-day EMA, the ETH/USDT pair could first rise to the 50-day SMA ($1,712) and thereafter to $1,750. A break above this level will signal a short-term double bottom. The pattern target of this bullish setup is $1,959.</p><p>However, the bears are likely to have other plans. They will try to tug the price back below the 20-day EMA and trap the aggressive bulls. A break below $1,600 could start a downward move toward presumably strong support at $1,531.</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) rose above the 20-day EMA ($215) on Sep. 17, indicating that the bearish momentum is weakening. The price could next reach the 50-day SMA ($224).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/1eebbedf-4e98-4622-b644-75a89cb9e4c4.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABNBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears are likely to offer stiff resistance in the zone between the 50-day SMA and $235. If the price turns down from this zone, it will signal that the BNB/USDT pair could remain range-bound between $200 and $235 for a while. The flattish 20-day EMA and the RSI near the midpoint also suggest a consolidation in the near term.</p><p>Instead, if the bears sink the price below the 20-day EMA, the pair could again retest the vital support near $200. The repeated retest of a support level within a short interval tends to weaken it. If this level cracks, the pair may tumble to $183.</p><h2>XRP price analysis</h2><p>XRP’s (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) recovery is facing selling near the 20-day EMA ($0.50) but the bulls have not given up and are trying to push the price above the resistance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/bcc92d7d-2606-4c89-80f8-d77bfd63f287.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AXRPUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If buyers kick the price above the 20-day EMA, the XRP/USDT pair could attempt a rally to $0.56. This level could prove to be a difficult barrier for the bulls to overcome.</p><p>Contrarily, if the price turns down from the current level, it will suggest that the bears are fiercely protecting the 20-day EMA. There is a minor support at the uptrend line but if this level cracks, the pair risks sliding to $0.45 and eventually to $0.41.</p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) continues to be squeezed between the 20-day EMA ($0.25) and the critical support at $0.24. This tight-range trading is unlikely to continue for long and a breakout may be around the corner.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/623f05f3-ab18-4303-b3e8-b514fca3bd61.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AADAUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The positive divergence on the RSI suggests that the selling pressure is reducing. If the uncertainty resolves to the upside, it will pave the way for a possible rally to the overhead resistance at $0.28.</p><p>On the contrary, if the price plummets below $0.24, it will signal that the bears have asserted their supremacy. That could signal the start of the next leg of the downtrend. The ADA/USDT pair may then slump to $0.22.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/btc-price-27-4-k-bitcoin-open-interest-grayscale-peak\"><strong><em>BTC price hits $27.4K as Bitcoin open interest matches Grayscale peak</em></strong></a></p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) has been stuck between the 20-day EMA ($0.06) and the horizontal support at $0.06 for the past few days.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/8ee247f1-c935-410d-b1df-39b3666868ae.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOGEUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Generally, a squeeze in volatility is followed by a range expansion. If the DOGE/USDT pair soars and closes above the 20-day EMA, it will suggest that bulls are attempting a comeback. The pair could then rally to $0.07. Buyers will have to overcome this roadblock to start an up-move to $0.08.</p><p>This positive view will be invalidated if the price turns down and dives below the $0.06 support. That could pull the price down to the next support at $0.055. The bulls are expected to guard this level with vigor.</p><h2>Toncoin price analysis</h2><p>The long wick on Toncoin’s (TON) Sep. 16 and 17 candlestick shows that traders are booking profits near the overhead resistance at $2.59.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/1584c806-a762-4a31-8a3c-830ced62dfc8.png\"  /><figcaption style=\"text-align: center;\"><em>TON/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=OKX%3ATONUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The overbought level on the RSI suggests a possible correction or range formation in the near term. However, the bulls have not given up and are again trying to propel TON price above $2.59. If they can pull it off, TON/USDT could pick up momentum and skyrocket to $3.</p><p>The important support to watch for on the downside is $2.25. If this level gives way, the pair could start a deeper correction to the next support at $2.07.</p><h2>Solana price analysis</h2><p>After trading near the 20-day EMA ($19.47) for the past few days, Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) broke above the resistance on Sep. 18.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/d2e9d8f8-456c-4330-9282-ed86f31bfac4.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASOLUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The 20-day EMA is flattening out and the RSI is near the midpoint, indicating that the bears may be losing their grip. Buyers will try to cement their position further by pushing the price to the overhead resistance at $22.30. This level is likely to attract sellers.</p><p>If the bulls fail to hold the price above the 20-day EMA, it will suggest that bears are selling at higher levels. The first support on the downside is $18.50 and if this level is violated, SOL price risks descending towar the next major support at $17.33. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T17:30:00.000Z",
    "title": "The Truth Behind Cuba’s Bitcoin Revolution: Video",
    "url": "https://cointelegraph.com/news/truth-behind-cuba-bitcoin-revolution-video",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/a780d125-a8ce-44ca-8a14-caa117f62013.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cointelegraph’s latest documentary travels to Cuba, the land of classic cars, communism, hyperinflation and Bitcoin.</p>\n                    <p><p>Cuba, a country known for its unique blend of rich history, vibrant culture, and political isolation, is the focus of the latest Cointelegraph on-the-ground documentary. “The Truth Behind Cuba’s Bitcoin Revolution” explores Bitcoin's (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) impact in one of the world's last Communist states. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/UPp0Xbk4bFo\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>The documentary provides a firsthand account of how Cubans are using Bitcoin to navigate challenging economic circumstances, attract new businesses and save money in a censorship-heavy environment.</p><p>Journalist and Bitcoin enthusiast Joe Hall embarked on the journey to Cuba determined to witness and capture the \"Bitcoin Revolution\" that gained prominence in Alex Gladstein's book, \"<em>Check Your Financial Privilege</em>.\" Gladstein explains how Cubans have harnessed Bitcoin's stateless and low-fee nature to escape financial oppression and secure their savings.</p><p>The documentary explores how Bitcoin has taken root in the Cuban financial landscape through interviews and interactions with Cubans, as well as the cofounders of the Cuba Bitcoin community: Forte, Catrya and Bitalion (not their real names). <a href=\"https://cointelegraph.com/news/crypto-stories-youtuber-paco-de-la-india-explains-his-travels-using-bitcoin\">Paco de la India, a regular Cointelegraph contributor</a>, traveled with Joe and provides feedback and commentary throughout the documentary. </p><p>Bitcoin users in Cuba primarily engage in peer-to-peer transactions, buying and selling Bitcoin through Telegram and Signal groups. They run nodes with limited resources and evade online surveillance and access banned internet sites with VPNs.</p><p>Unlike many countries, Cuba is devoid of centralized crypto exchanges such as Coinbase or Binance. Plus, Cubans are banned from creating accounts due to poor diplomatic relations with the United States. </p><p>Consequently, the environment for Bitcoin in Cuba is a unique ecosystem that operates almost entirely outside of the reach of the state. Moreover, the resilient Bitcoin community is set against a backdrop of economic hardship. 72% of Cubans live below the poverty line, and while the minimum monthly wage is approximately $30, Catrya, one of the documentary’s main characters explains that it is closer to $13.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/1246718d-9f3c-4d7b-ac89-e3e391f64f09.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Reporter Joe Hall, Paco de la India and only $200 of Cuban peso bills</figcaption></figure><p>Cuba's economic hardships are exacerbated by hyperinflation, with the Cuban peso losing more than 940% of its value in the last two years. Through testimonials and interviews with Cubans across Havana, it’s clear that Bitcoin emerges as a lifeline for those looking to protect their savings from currency devaluation.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/cuba-bitcoin-community-hosts-btc-only-meetup\">Cuba Bitcoin community hosts BTC-only meetup</a></em></strong></p><p>The documentary captures the grassroots adoption of Bitcoin in Cuba. It also highlights the efforts of the humble “Cuba Bitcoin” community who spend their time educating and propagating the principles of Bitcoin to Cubans in an environment where the consequences of their actions are uncertain.</p><p>Ultimately, As Bitcoin continues to gain traction in Cuba, it remains to be seen how the government will react to the emergence of a parallel financial system. The Truth Behind Cuba’s Bitcoin Revolution, provides a rare glimpse into a nation on the cusp of transformative change. Bitcoin could offer Cubans a glimmer of hope and freedom on an island where such aspirations have been long suppressed.</p><p><strong><em>Magazine: ‘<a href=\"https://cointelegraph.com/magazine/elegant-and-ass-backward-jameson-lopps-first-impression-of-bitcoin/\">Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T17:13:59.000Z",
    "title": "SEC claims Ceffu wallet provider is 'Binance-related' in motion against BAM",
    "url": "https://cointelegraph.com/news/sec-claims-ceffu-binance-related-motion-against-bam",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/cbb5e5d9-609c-4feb-bb82-3dbc6d0e679b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The securities regulator claims that \"Ceffu\" is a Binance entity and not merely a digital asset wallet provider. </p>\n                    <p><p>In its latest filing regarding its motion to compel against BAM, the holding company for Binance.US, the United States Securities and Exchange Commission (SEC) has claimed that Ceffu, a wallet provider, <a href=\"https://cointelegraph.com/news/binance-custody-partner-clarifies-singapore-licensing-plans\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-custody-partner-clarifies-singapore-licensing-plans/amp\">is indeed “Binance-related.”</a> This is in contradiction to claims made by Binance in earlier court documents.</p><p>The redacted <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.256060/gov.uscourts.dcd.256060.113.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> argues again that Binance’s request for a protective order against the SEC investigation is meritless. It calls for the court to deny that request. Binance made the request in the Dsictrict of Columbia District Court on Aug. 15, calling the SEC investigation a “fishing expedition.” In its latest filing, the SEC called Binance’s response to its June suit “a house of mirrors.” </p><p>The SEC raised questions about Ceffu in a memorandum filed in the court on Sept. 14, saying the company, which was rebranded from Binance in March, “appears to have control of Customer Assets.” </p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-18T17:30:55.000Z",
    "title": "From $10,000 to $24 Million: 909 ‘Sleeping Bitcoins’ From 2012 Stir After 11 Years",
    "url": "https://news.bitcoin.com/from-10000-to-24-million-909-sleeping-bitcoins-from-2012-stir-after-11-years/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/2012-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"From $10,000 to $24 Million: 909 &#039;Sleeping Bitcoins&#039; From 2012 Stir After 11 Years\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/2012-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/2012-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/2012-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/2012-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/2012-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/2012-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/2012.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to records, a batch of five transactions from &#x201C;sleeping bitcoin&#x201D; addresses, established more than 11 years ago in 2012, transferred 909.89 BTC valued at $24.88 million. The value of the whale&#x2019;s cache of bitcoin when it was acquired was less than $10,000. The 11-Year Slumber: $24.88M in Bitcoin Emerges From 2012 Wallets Another set [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T17:14:33.000Z",
    "title": "British Columbia Court approves Hut 8 and USBTC merger for new entity",
    "url": "https://www.cryptopolitan.com/bc-court-accepts-hut-8-usbtc-merge/",
    "description": "The Supreme Court of British Columbia has officially sanctioned the merger between Canadian Bitcoin mining giant Hut 8 and US Bitcoin (USBTC). Announced initially in February 2023, the union aims to form a new entity, Hut 8 Corporation, colloquially known as “New Hut.” This new venture will be a publicly traded company based in the ... <a title=\"British Columbia Court approves Hut 8 and USBTC merger for new entity\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bc-court-accepts-hut-8-usbtc-merge/\" aria-label=\"More on British Columbia Court approves Hut 8 and USBTC merger for new entity\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T17:21:35.000Z",
    "title": "BitBoy dismissed from FTX case as three celebrities settle",
    "url": "https://crypto.news/bitboy-dismissed-from-ftx-case-as-three-celebrities-settle/",
    "description": "The legal fallout from the collapse of crypto exchange FTX continues, with some high-profile names opting to settle while others are dismissed entirely. Crypto influencer Ben &#8220;BitBoy&#8221; Armstrong is no longer facing a lawsuit related to his promotion of FTX.&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T17:18:59.000Z",
    "title": "Spacemesh’s members up 5X since July launch",
    "url": "https://crypto.news/spacemeshs-members-up-5x-since-july-launch/",
    "description": "In epochs 2, 3, and 4, Spacemesh community members increased from 2,800 to 32,000"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-18T17:25:00.000Z",
    "title": "Ripple’s Supporter Raises Questions About ETH’s Decentralization",
    "url": "https://coinedition.com/ripples-supporter-raises-questions-about-eths-decentralization/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple’s Supporter Raises Questions About ETH’s Decentralization\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/XRP-Price-Slumps-as-Investors-Question-Long-Term-Prospects-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The lawyer said that ETH cannot be considered fully decentralized despite its move to PoS. ETH could move toward $1,700 if the 20 EMA remains above the 50 EMA. Traders are also bullish on the ETH price action as the OBV also increased. For a while, there has been some sort of debate if Ethereum [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ripples-supporter-raises-questions-about-eths-decentralization/\">Ripple’s Supporter Raises Questions About ETH’s Decentralization</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]