[
  {
    "source": "Cointelegraph",
    "date": "2023-06-02T16:03:35.000Z",
    "title": "CFTC commissioner says proposal to reassess risk management could consider crypto",
    "url": "https://cointelegraph.com/news/cftc-commissioner-says-proposal-to-reassess-risk-management-could-consider-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a5eb3c61-b79d-440c-b952-e0ade62df272.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Christy Goldsmith Romero pointed to the collapse of FTX, Terra and Celsius in having the CFTC reconsider the way it handled risk management.</p>\n                    <p><p>Christy Goldsmith Romero, commissioner with the United States Commodity Futures Trading Commission (CFTC), has commented on a proposal amending the government body’s Risk Management Program with respect to digital assets.</p><p>In a June 1 notice, the CFTC <a href=\"https://www.cftc.gov/PressRoom/PressReleases/8710-23\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it would be opening a proposed rule change for amendments to its risk management requirements applicable to swap dealers and futures commission merchants. Romero <a href=\"https://www.cftc.gov/PressRoom/SpeechesTestimony/romerostatement060123\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a public statement that the proposal could allow the commission to address risks associated with certain crypto investments, citing the failure of Silvergate Bank.</p><p>“These technological advancements, with their accompanying risks, necessitate the Commission revisiting our regulatory oversight, including our risk management requirements,” said Romero. “Existing Commission rules require that banks’ and brokers’ risk management programs ‘take into account’ risks related to lines of business. That could include, for example, digital asset markets.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The CFTC is seeking public comment on the Risk Management Program (RMP) requirements for swap dealers and futures commission merchants. Learn more: <a href=\"https://t.co/Vs1rb9qfey\">https://t.co/Vs1rb9qfey</a></p>&mdash; CFTC (@CFTC) <a href=\"https://twitter.com/CFTC/status/1664399653805203459?ref_src=twsrc%5Etfw\">June 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the commissioner, the potential interest of brokers into the crypto derivatives market could “carry additional risks”. She pointed to the collapse of crypto exchange FTX, Terra and Celsius, as well as areas with “rampant fraud and illicit finance.”</p><blockquote>“Evolving technologies like digital assets, artificial intelligence, and cloud services, also have emerged as areas that can carry significant risk.”</blockquote><p>The CFTC will <a href=\"https://cointelegraph.com/news/us-cftc-issues-letter-on-digital-asset-derivatives-clearing-compliance-in-3-areas\">leave the proposal open</a> for public comment for 60 days following publication in the Federal Register. After that time, the commission could introduce a formal rule change leading to a vote among its leadership.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/eth-can-be-security-and-commodity-says-former-cftc-commissioner\"><strong><em>ETH can be both a security and a commodity, former CFTC commissioner says</em></strong></a></p><p>Since being sworn into office in March 2022, Commissioner Romero has often acted as a crypto-friendly voice in the CFTC, <a href=\"https://cointelegraph.com/news/cftc-commissioner-crypto-exchanges-shouldn-t-self-certify-tokens\">calling for oversight</a> to ensure investor protection and public trust. In April, she proposed the CFTC <a href=\"https://cointelegraph.com/news/cftc-proposes-reducing-anonymity-to-manage-risks\">reduce the anonymity</a> of certain tokens in order to better manage the risks associated with digital assets.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-02T15:43:17.000Z",
    "title": "Bitcoin 'big move' due in July after March $30K push — latest analysis",
    "url": "https://cointelegraph.com/news/bitcoin-big-move-due-in-july-after-march-30k-push-latest-analysis",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/6e52d944-23db-4292-ba56-490b1811b113.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin has been busy \"perfectly\" mimicking its moves from after the March 2020 crash, QCP Capital argues.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) “consolidation” could end by July, new research predicts as optimism over a BTC price breakout returns.</p><p>In its latest <a href=\"https://qcp.capital/featured-article/market-update-2-jun-23/\" target=\"_blank\" rel=\"noopener nofollow\">market update</a> on June 2, trading firm QCP Capital revealed a bullish bias on both Bitcoin and largest altcoin Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>).</p><h2>QCP Capital: Bitcoin consolidation \"played out perfectly\"</h2><p>Bitcoin price has been ranging between $26,000 and $31,000 since mid-March, but analysts are increasingly calling time on the sideways action.</p><p>QCP Capital is among them, predicting a change of course as soon as the end of the month.</p><p>This, it argues, is thanks to the United States <a href=\"https://cointelegraph.com/news/us-debt-ceiling-declining-trust-in-banks-send-eth-staking-to-record-highs\">debt ceiling</a> “sideshow” vanishing, leaving Bitcoin closely mimicking its consolidation and breakout phase from 2020.</p><p>“With the passage of the Debt ceiling bill through the House and Senate that extends the ceiling until Jan 2025, we can now all move on and not have to worry about any political sideshow again until next year’s US Presidential elections,” it wrote.</p><blockquote>“This means we now return to our regular programming of proper macro and crypto narratives.”</blockquote><p>For QCP, the price levels may be different, but underlying behavior is the same in 2023 as at the start of the Coronavirus pandemic.</p><p>Then, the Federal Reserve unleashed a giant $4 trillion of liquidity, buoying risk assets and ultimately sending Bitcoin to new all-time highs.</p><p>“In March 2020 we were on the verge of a massive price breakdown below 5k when the Fed unleashed the liquidity tap, resulting in an exponential price increase as we approached the halving cycle the following year,” it wrote, quoting a previous edition of its “<a href=\"https://qcp.capital/justcrypto/just-crypto-6-the-crypto-circular-11-zombieland-the-sequel/\" target=\"_blank\" rel=\"noopener nofollow\">Just Crypto</a>” newsletter series.</p><blockquote>“Similarly in March 2023, we were about to break below 20k on BTC as a result of the banking crisis risk-off, when the Fed again unleashed the liquidity tap to drive us back above 30k, as we head into the next halving cycle next year.”</blockquote><p>Should the relationship continue to play out, the next phase is obvious — a dramatic exit of the trading range, with QCP positioning long options plays.</p><p>“This consolidation has played out perfectly so far, but we expect that we are soon coming close to the end sometime this month. As a result, we recommend positioning for an upcoming big move through long 3m and 6m strangles here, with a bias to the long call side,” it added.</p><p>An accompanying chart showed the month of June as a hotspot for both BTC and ETH volatility from 2019 onward.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/482cf8b6-03e6-4b13-9959-45e1a086f9eb.png\"  /><figcaption style=\"text-align: center;\"><em>3-month \"at-the-money\" volatility chart for BTC, ETH (screenshot). Source: QCP Capital</em></figcaption></figure><h2>Betting on a BTC price breakout</h2><p>As Cointelegraph <a href=\"https://cointelegraph.com/news/bitcoin-hodlers-exited-capitulation-above-20k-new-metric-hints\">reported</a>, other signals coming from within Bitcoin point to a new paradigm taking over shortly.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-wicks-down-to-26-5k-but-trader-eyes-chance-for-bullish-surprise\">Bitcoin wicks down to $26.5K, but trader eyes chance for ‘bullish surprise’</a></em></strong></p><p>These include a on-chain metric tracking hodler behavior, which late last month put BTC/USD in a “transition” phase away from “capitulation” and on the way to “euphoria.”</p><p>Multiple market participants, meanwhile, argue that BTC price action is at a critical stage with a <a href=\"https://cointelegraph.com/news/bitcoin-holds-200-week-average-as-trader-says-inflection-point-is-here\">decision</a> on trajectory now due.</p><p>BTC/USD traded at near $27,000 on the day, data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.142027444.742658523.1640948929-762064149.1640948929\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed, having ended May <a href=\"https://cointelegraph.com/news/last-btc-price-dip-before-a-30k-breakout-bitcoin-wipes-weekend-gains\">down 7%</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/3857fc99-9f80-4f19-8524-99d436b9d00b.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day candle chart on Bitstamp. Source: TradingView</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ai-eye-traders-chatgpt-stock-picks-ai-dice-adobe-firefly/\">AI Eye: 25K traders bet on ChatGPT’s stock picks, AI sucks at dice throws, and more</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-02T15:58:32.000Z",
    "title": "Decentralized Exchange Sushi Partners with Ethics-First, Shariah-Compliant Haqq Network",
    "url": "https://cryptodaily.co.uk/2023/06/decentralized-exchange-sushi-partners-with-ethics-first-shariah-compliant-haqq-network",
    "description": "<p>Sushi.com, a major decentralized exchange, has entered into a transformative alliance with the Haqq Network, aiming to bring about a significant shift in decentralized finance (DeFi) accessibility for the worldwide Muslim community. This collaboration positions Sushi.com as the primary decentralized exchange for users of Haqq and its native digital currency Islamic Coin ($ISLM), ensuring smooth and Shariah-compliant token transactions with unparalleled convenience.</p>\nThe benefits of the alliance\n<p>With a significant presence in the DeFi sector, Sushi.com stands out as a prominent player, facilitating an extensive range of tokens and reaching impressive daily trade volumes ranging from $50 million to $150 million. It has also amassed a total value locked (TVL) of approximately $1.14 billion. Through this integration, a robust platform emerges for Haqq participants and usersinvestors, enabling seamless participation in Shariah-compliant financial activities.</p>\n<p>Members of the Haqq community will enjoy various benefits from Sushi.com, including the ability to provide liquidity, stake their assets in a pool created by Haqq on the platform, and earn $ISLM tokens during the liquidity mining phase. Additionally, they will be able to share in the profits generated from these pools.</p>\n\n<p> \"This integration with Sushi.com is a significant milestone not just for us but for the entire global Muslim community. It paves the way for faith-driven investors to engage in halal financial activities within a DeFi environment that's accessible and profitable,\"</p>\n<p>HAQQ Network's CTO, Andrey Kuznetsov, commented.&nbsp;</p>\n\nEnabling access to ethical finance\n<p>The collaboration between Haqq and Sushi.com also significantly enhances liquidity, ensuring users the most favorable prices for any supported pair across all chains. Additionally, this partnership offers a convenient avenue for users on different chains to exchange tokens from the primary chain to Haqq Network's native token, $ISLM.</p>\n<p>Sushi.com&rsquo;s user experience flow, designed with the global community of DEX traders in mind, will also bring substantial benefits to both the Haqq and Islamic Coin communities. With the deployment across 18 different chains, users can easily replenish gas in their wallets through swaps on any source chain supported on SushiXSwap, Sushi&rsquo;s unified and multi-chain user interface for token swapping.</p>\n<p>This strategic integration with Sushi.com showcases Haqq's unwavering commitment to establishing a more seamless, accessible, and lucrative DeFi environment for the global Muslim community and those enthusiastic about ethical finance.</p>\n<p>More information on Haqq, Islamic Coin and the alliance is available via the official website and the platform&rsquo;s social media.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T16:04:43.000Z",
    "title": "FINEXPO Brings FinTech Industry Leaders and Enthusiasts Together at FinTech Festival Asia 2023",
    "url": "https://www.cryptopolitan.com/finexpo-brings-fintech-industry-leaders-and-enthusiasts-together-at-fintech-festival-asia-2023/",
    "description": "Bangkok, 3 April 2023 – FINEXPO, the world&#8217;s leading event organiser, announced today that it is hosting its first-ever FinTech Festival Asia (FTF Asia) on 27 and 28 September 2023 at the Royal Paragon Hall in Bangkok, Thailand. The FinTech Festival Asia 2023 held by FINEXPO is an exciting two-day event filled with cutting-edge presentations, ... <a title=\"FINEXPO Brings FinTech Industry Leaders and Enthusiasts Together at FinTech Festival Asia 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/finexpo-brings-fintech-industry-leaders-and-enthusiasts-together-at-fintech-festival-asia-2023/\" aria-label=\"More on FINEXPO Brings FinTech Industry Leaders and Enthusiasts Together at FinTech Festival Asia 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T16:04:32.000Z",
    "title": "A deep dive into China’s current crypto scene",
    "url": "https://www.cryptopolitan.com/a-deep-dive-into-chinas-current-crypto-scene/",
    "description": "In the bustling labyrinth of global cryptocurrency, China&#8217;s market stands as a resilient titan. Despite regulatory tussles that have pushed many domestic crypto companies to foreign shores, China&#8217;s crypto landscape remains vibrant, diverse, and innovative. China&#8217;s crypto users Understanding China&#8217;s crypto market begins with a deep dive into the user profiles. A comprehensive survey conducted ... <a title=\"A deep dive into China&#8217;s current crypto scene\" class=\"read-more\" href=\"https://www.cryptopolitan.com/a-deep-dive-into-chinas-current-crypto-scene/\" aria-label=\"More on A deep dive into China&#8217;s current crypto scene\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T15:59:15.000Z",
    "title": "Maximizing Your Winnings with No Deposit Bonuses at Bitcoin Casinos",
    "url": "https://www.cryptopolitan.com/maximizing-your-winnings-with-no-deposit-bonuses-at-bitcoin-casinos/",
    "description": "Are you looking to maximize your winnings at Bitcoin casinos? One of the best ways to do so is by taking advantage of no deposit bonuses. In this article, we&#8217;ll explore the benefits of using these bonuses and provide tips and strategies for maximizing your winnings. No deposit bonuses are one of the most popular ... <a title=\"Maximizing Your Winnings with No Deposit Bonuses at Bitcoin Casinos\" class=\"read-more\" href=\"https://www.cryptopolitan.com/maximizing-your-winnings-with-no-deposit-bonuses-at-bitcoin-casinos/\" aria-label=\"More on Maximizing Your Winnings with No Deposit Bonuses at Bitcoin Casinos\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-02T15:57:49.000Z",
    "title": "Crypto markets rebounded by 83% in Q1 2023 data shows",
    "url": "https://crypto.news/crypto-markets-rebounded-by-83-in-q1-2023-data-shows/",
    "description": "On-chain data released by Messari, focusing on the layer-1 blockchain ecosystem analysis during Q1’23, show that the market capitalization of the leading chains rebounded by 83%. "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-02T16:00:43.000Z",
    "title": "Twitter CEO and Dogecoin Father Elon Musk Accused of DOGE Insider Trading to Push Price Up by 36,000%",
    "url": "https://www.crypto-news-flash.com/twitter-ceo-and-dogecoin-father-elon-musk-accused-of-doge-insider-trading-to-push-price-up-by-36000/?utm_source=rss&utm_medium=rss&utm_campaign=twitter-ceo-and-dogecoin-father-elon-musk-accused-of-doge-insider-trading-to-push-price-up-by-36000",
    "description": "<p>Dogecoin investors have filed a class action lawsuit accusing Elon Musk of insider trading and manipulating the DOGE prices, resulting in significant losses for investors. The lawsuit also alleges that Musk engaged in &#8220;publicity stunts&#8221; and profited from trading Dogecoin through wallets controlled by him or Tesla, at the expense of investors. Billionaire Elon Musk [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/twitter-ceo-and-dogecoin-father-elon-musk-accused-of-doge-insider-trading-to-push-price-up-by-36000/\">Twitter CEO and Dogecoin Father Elon Musk Accused of DOGE Insider Trading to Push Price Up by 36,000%</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-02T15:58:54.000Z",
    "title": "2024 Price Predictions Reveal Uwerx (WERX) Will Keep Climbing Alongside Optimism (OP) And Chainlink (LINK)",
    "url": "https://www.crypto-news-flash.com/2024-price-predictions-reveal-uwerx-werx-will-keep-climbing-alongside-optimism-op-and-chainlink-link/?utm_source=rss&utm_medium=rss&utm_campaign=2024-price-predictions-reveal-uwerx-werx-will-keep-climbing-alongside-optimism-op-and-chainlink-link",
    "description": "<p>As Uwerx scaled past its first to third presale stages in record time, many investors became convinced that this new project would be the crypto to beat in the market. Thanks to its innovative features, Uwerx is gearing up to start providing more value to freelancers and money to investors. Due to its impressive ongoing [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/2024-price-predictions-reveal-uwerx-werx-will-keep-climbing-alongside-optimism-op-and-chainlink-link/\">2024 Price Predictions Reveal Uwerx (WERX) Will Keep Climbing Alongside Optimism (OP) And Chainlink (LINK)</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]