[
  {
    "source": "Cointelegraph",
    "date": "2023-06-18T10:58:48.000Z",
    "title": "Binance sends cease and desist notice to Nigerian scammer entity  ",
    "url": "https://cointelegraph.com/news/binance-cease-and-desist-notice-to-nigerian-scammer",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/9eea1c84-fab4-4f06-9edf-75bdcbfd1efd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This comes after the Securities and Exchange Commission, Nigeria (SEC), released a circular stating the illegality of Binance Nigeria Limited in the country.</p>\n                    <p><p>Binance CEO, <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/changpeng-zhao\">Changpeng Zhao</a> (CZ) has made an announcement stating that Binance has officially issued a cease and desist notice to the fraudulent entity known as Binance Nigeria Limited. </p><p>On Sunday, June 18, the CEO took to Twitter to make the <a href=\"https://twitter.com/cz_binance/status/1670369403223900160\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>. However, it's worth noting that on June 9, the Securities and Exchange Commission, Nigeria (SEC), <a href=\"https://sec.gov.ng/circular-on-the-activities-of-binance-nigeria-limited/\" target=\"_blank\" rel=\"noopener nofollow\">released</a> a circular stating the illegality of Binance Nigeria Limited in the country.</p><p>According to <a href=\"https://techpoint.africa/2023/06/12/binance-is-not-affiliated-with-binance-nigeria-limited/\" target=\"_blank\" rel=\"noopener nofollow\">reports</a>, a Binance spokesperson responded, stating that the entity mentioned in the circular is not affiliated with them. They expressed their intention to seek clarity from the Nigerian SEC and reiterated their commitment to cooperating with them on the next steps.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Binance have issued cease &amp; desist notice to the scammer entity &quot;Binance Nigeria Limited&quot;.<br><br>Don&#39;t believe everything you read in the news. ‍♂️</p>&mdash; CZ  Binance (@cz_binance) <a href=\"https://twitter.com/cz_binance/status/1670369403223900160?ref_src=twsrc%5Etfw\">June 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>During that period, the Nigerian SEC circular cast a shadow over Binance's prospects. Although Binance maintained no affiliation with Binance Nigeria Limited, as mentioned in the circular, the company was <a href=\"https://cointelegraph.com/news/binance-and-cz-sued-by-the-sec\">concurrently facing a lawsuit</a> from the United States Securities Exchange Commission(U.S. SEC). The U.S. Commission had filed 13 charges against Binance entities and their CEO, Changpeng Zhao.</p><p>Some of the charges include operating unregistered exchanges, broker-dealers, and clearing agencies and misrepresenting trading controls. The U.S. SEC stated that despite earning $11.6 billion from U.S. customers, Binance and Zhao failed to register as an exchange, broker-dealer, or clearing agency. Binance Holdings Limited was also accused of granting access to Binance.com to high-value U.S. investors.</p><p>In a recent development, United States Judge Amy Berman Jackson granted approval on June 17 to an agreement reached between Binance.US, Binance, and the Securities and Exchange Commission. This agreement resulted in the dismissal of a previous temporary restraining order (TRO) that aimed to freeze all Binance.US assets.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-ceo-cz-sec-request-for-emergency-relief-unwarranted\"><strong><em>Binance CEO CZ deems SEC’s request for emergency relief unwarranted</em></strong></a></p><p>Binance, which is available in about 100 countries, registered its headquarters, Binance Holdings Limited, in George Town, Cayman Islands, in 2017. In 2019, it also registered Binance Investments Company, in Mahe, Seychelles.</p><p><strong><em>Magazine:</em></strong> <a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-18T10:55:58.000Z",
    "title": "How web3 meets creative industries in Portugal: Interview",
    "url": "https://cryptoslate.com/how-web3-meets-creative-industries-in-portugal-interview/",
    "description": "<p>BlockDown Festival: Portugal, hosted by web3 Creative Marketing and Communications Agency EAK Digital, will kick off its second annual in-person Web3 and blockchain festival in Algarve, Portugal, on July 10-12, 2023. The festival will bring together key leaders in web3 and the creator economy, focusing on creative industries such as music, fashion, entertainment, sports, gaming, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/how-web3-meets-creative-industries-in-portugal-interview/\">How web3 meets creative industries in Portugal: Interview</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-18T10:56:31.000Z",
    "title": "Disruptive TMS Network (TMSN) Shatters Expectations, Stuns BNB (BNB) and Dogecoin (DOGE)",
    "url": "https://www.cryptopolitan.com/disruptive-tms-network-tmsn-shatters-expectations-stuns-bnb-bnb-and-dogecoin-doge/",
    "description": "Since blockchain&#8217;s introduction, many projects have brought revolutionary changes to the global financial system. From BNB (BNB)&#8217;s scalable chain to Dogecoin (DOGE)&#8217;s peer-to-peer meme coin, the list goes on limitlessly. Despite this,&#160;TMS Network (TMSN)&#8217;s&#160;disruptive capabilities&#160;seem to be taking the spotlight as investors&#8217; newest favorite. As the crypto market goes through a rippling downtrend, TMS Network ... <a title=\"Disruptive TMS Network (TMSN) Shatters Expectations, Stuns BNB (BNB) and Dogecoin (DOGE)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/disruptive-tms-network-tmsn-shatters-expectations-stuns-bnb-bnb-and-dogecoin-doge/\" aria-label=\"More on Disruptive TMS Network (TMSN) Shatters Expectations, Stuns BNB (BNB) and Dogecoin (DOGE)\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-18T11:08:09.000Z",
    "title": "Binance CEO responds to resolution of SEC’s request for emergency relief",
    "url": "https://crypto.news/binance-ceo-responds-to-resolution-of-secs-request-for-emergency-relief/",
    "description": "Binance CEO Changpeng \"CZ\" Zhao expressed pleasure at the amicable resolution of a recent request from the SEC that would have resulted in the freezing of client funds"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-18T10:54:54.000Z",
    "title": "Gemini co-founder slams SEC for inconsistency after suing Coinbase, Binance but approving Prometheum",
    "url": "https://crypto.news/gemini-co-founder-slams-sec-for-inconsistency-after-suing-coinbase-binance-but-approving-prometheum/",
    "description": "SEC criticized for suing Coinbase, Gemini, Binance, and other cryptocurrency exchanges but approving the less known Prometheum"
  }
]