[
  {
    "source": "CoinDesk",
    "date": "2023-11-23T06:06:31.000Z",
    "title": "Bitcoin Supply Inactive For a Year Hits Record High of 70%",
    "url": "https://www.coindesk.com/markets/2023/11/23/bitcoin-supply-inactive-for-a-year-hits-record-high-of-70/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "It appears bitcoin holders are not planning on offloading inventory at these price levels or any time soon, one observer said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-23T04:58:29.000Z",
    "title": "CZ an ‘unacceptable risk of flight,’ should stay in US: DOJ",
    "url": "http://cointelegraph.com/news/cz-a-flight-risk-should-stay-in-us-doj",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/7546c52a-2822-4eaa-9587-fedaf3a4f2b8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>U.S. prosecutors are pushing for CZ to stay in the country, saying they “would not be able to secure his return” if he’s allowed back to Dubai.</p>\n                    <p><p>United States government prosecutors are trying to stop former Binance boss Changpeng “CZ” Zhao from leaving the country, expressing concern about his potential flight risk.</p><p>In a Nov. 22 filing to a Seattle federal court, U.S. prosecutors requested a review and overturn of a judge’s decision that would allow Zhao to return to his home in the United Arab Emirates (UAE) on a <a href=\"https://cointelegraph.com/news/cz-released-on-bond-may-return-to-dubai\">$175 million bond</a> under the condition he returns to the U.S. two weeks before his February 2024 sentencing.</p><p>In a proposed order, U.S. prosecutors wrote Zhao “presents an unacceptable risk of flight and nonappearance if he is allowed to leave the United States pending sentencing.”</p><p>In an accompanying letter, prosecutors said if Zhao decided not to come back to the U.S., then the government \"would not be able to secure his return.\" </p><p>In its argument, the government pointed to Zhao’s ties and favored status in the UAE along with the country’s lack of an extradition treaty with the U.S. as reasons to block him from leaving the country.</p><blockquote>“He has three young children and a partner in the UAE; once in the UAE and faced with the prospect of traveling back to the United States to face up to 18 months in prison, he may elect to instead simply stay in the UAE with his family.”</blockquote><p>Prosecutors said Zhao could live on his wealth in the UAE indefinitely as a vast majority of it is held overseas away from U.S. jurisdiction. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/f3ecde9f-4581-422d-bccc-424ff90a30b3.jpg\"  /><figcaption style=\"text-align: center;\"><em>Excerpt of the motion to review Zhao’s bond conditions. Source: PACER</em></figcaption></figure><p>The government also argued Zhao’s bond was inadequate as a majority of the $175 million used to secure his release was outside the reach of the U.S. </p><p>Zhao <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\">recently confessed</a> to failing to maintain an effective Anti-Money Laundering program at Binance and part of his plea agreement saw him step down as CEO of the exchange and pay a $50 million fine.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-doj-settlement-offered-glimmers-hope-crypto-industry\"><strong><em>Binance’s DOJ settlement offers a glimmer of hope for the crypto industry</em></strong></a></p><p>Industry experts and observers have argued that <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\">Binance’s settlement</a> with the Justice Department is a positive outcome for the crypto industry, further legitimizing it in the U.S. </p><p>Additionally, crypto markets have already rebounded from the bad news regarding one of the industry’s most enigmatic and influential players. </p><p>Total market capitalization has already returned to pre-Binance news levels, hitting $1.48 trillion during the Thursday morning Asian trading session. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-23T05:00:24.000Z",
    "title": "US Seizes $9 Million in Tether Allegedly Linked to Pig Butchering Crypto Scams",
    "url": "https://news.bitcoin.com/us-seizes-9-million-in-tether-allegedly-linked-to-pig-butchering-crypto-scams/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/doj-tether-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Seizes $9 Million in Tether Allegedly Linked to Pig Butchering Crypto Scams\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/doj-tether-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/doj-tether-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/doj-tether-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/doj-tether-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/doj-tether-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/doj-tether-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/doj-tether.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Department of Justice (DOJ) has seized $9 million in tether (USDT) allegedly linked to &#x201C;pig butchering&#x201D; crypto scams. The Justice Department explained that U.S. Secret Service agents and analysts tracked the laundering of victims&#x2019; crypto deposits through numerous cryptocurrency addresses, where they were exchanged for various cryptocurrencies. DOJ Seizes $9M in USDT The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-23T06:22:49.000Z",
    "title": "OpenAI’s Leadership Shakeup Amidst Groundbreaking AI Development",
    "url": "https://www.cryptopolitan.com/openais-leadership-shakeup-ai-development/",
    "description": "OpenAI, a leading artificial intelligence research lab, recently witnessed a significant leadership upheaval. Sam Altman, the company&#8217;s CEO, faced a temporary exile following the surfacing of internal concerns about a new AI discovery. This development, which reportedly could threaten humanity, sparked a flurry of activity within the organization. After Altman&#8217;s short-lived departure, over 700 employees ... <a title=\"OpenAI&#8217;s Leadership Shakeup Amidst Groundbreaking AI Development\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openais-leadership-shakeup-ai-development/\" aria-label=\"More on OpenAI&#8217;s Leadership Shakeup Amidst Groundbreaking AI Development\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-23T06:04:08.000Z",
    "title": "Navigating the AI Odyssey: A Journey Through Fiction and Reality",
    "url": "https://www.cryptopolitan.com/ai-odyssey-through-fiction-and-reality/",
    "description": "In an era where artificial intelligence (AI) is no longer a distant dream but a tangible, rapidly evolving reality, literature has quickly adapted and explored this phenomenon. The past year has witnessed explosive growth in generative AI, sparking a complex mix of emotions ranging from awe and excitement to apprehension and fear. This surge in ... <a title=\"Navigating the AI Odyssey: A Journey Through Fiction and Reality\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-odyssey-through-fiction-and-reality/\" aria-label=\"More on Navigating the AI Odyssey: A Journey Through Fiction and Reality\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-23T06:01:37.000Z",
    "title": "KyberSwap DEX loses $48M – Here are the hacker’s demands",
    "url": "https://www.cryptopolitan.com/kyberswap-dex-loses-48m-the-hackers-demands/",
    "description": "According to on-chain data, the decentralized exchange system KyberSwap looks to have been the victim of a $47 million hack. The funds came through the company&#8217;s Elastic Pools liquidity solution. Funds were abruptly transferred from protocol-associated wallets into a single wallet, as initially reported by X user Spreek. KyberSwap DEX suffers millions in losses In ... <a title=\"KyberSwap DEX loses $48M &#8211; Here are the hacker&#8217;s demands\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kyberswap-dex-loses-48m-the-hackers-demands/\" aria-label=\"More on KyberSwap DEX loses $48M &#8211; Here are the hacker&#8217;s demands\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-23T05:08:53.000Z",
    "title": "XRP Price Prediction – Indicators Suggest Fresh Bull Run If XRP Clears $0.642",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-prediction-bull-run-0-642/",
    "description": "XRP price started a downside correction and tested $0.572. The price is now rising and might gain bullish momentum if it clears $0.642. XRP started a downside correction below $0.650 and $0.620. The price is now trading below $0.640 and the 100 simple moving average (4 hours). There was a break above a major bearish trend line with resistance near $0.608 on the 4-hour chart of the XRP/USD pair (data source from Kraken). The pair start a fresh rally if it clears the $0.642 resistance zone. XRP Price Holds Key Support After facing rejection near the $0.740 zone, XRP started a fresh decline. There was a move below the $0.70 and $0.650 support levels. The price even dived below the $0.60 support, underperforming Bitcoin and Ethereum. Finally, the bulls took a stand near $0.572. A low was formed near $0.572 and the price is now attempting a fresh increase. There was a move above the $0.600 resistance. There was a break above a major bearish trend line with resistance near $0.608 on the 4-hour chart of the XRP/USD pair. The price is now testing the 23.6% Fib retracement level of the downward move from the $0.7499 swing high to the $0.5723 low. On the upside, immediate resistance is near the $0.615 level. The first major resistance is near the $0.642 zone or the 100 simple moving average (4 hours). It is close to the 50% Fib retracement level of the downward move from the $0.7499 swing high to the $0.5723 low. A close above the $0.642 resistance zone could spark a steady increase. Source: XRPUSD on TradingView.com The next key resistance is near $0.682. If the bulls remain in action above the $0.682 resistance level, there could be a rally toward the $0.720 resistance. Any more gains might send XRP toward the $0.750 resistance. Another Decline? If XRP fails to clear the $0.642 resistance zone, it could start a fresh decline. Initial support on the downside is near the $0.588 zone. The next major support is at $0.572. If there is a downside break and a close below the $0.572 level, XRP price might accelerate lower. In the stated case, the price could retest the $0.540 support zone. Technical Indicators 4-Hours MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for XRP/USD is now just above the 50 level. Major Support Levels – $0.588, $0.572, and $0.540. Major Resistance Levels – $0.615, $0.642, and $0.682."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-23T04:43:23.000Z",
    "title": "Ethereum Price Prediction: After 5% Surge, Is ETH Increase Just Getting Started?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-prediction-2120/",
    "description": "Ethereum price recovered all losses and climbed above $2,050. ETH outperformed Bitcoin and might aim for more gains above the $2,120 resistance. Ethereum remained strong above $1,930 and started a fresh increase above $2,000. The price is trading above $2,020 and the 100-hourly Simple Moving Average. There was a break above a major bearish trend line with resistance near $1,980 on the hourly chart of ETH/USD (data feed via Kraken). The pair is up over 5% and the bulls could aim for more upsides above $2,100. Ethereum Price Turns Green Ethereum price remained well-bid above the $1,930 support after a steady decline post report of Binance settlement. ETH formed a base and started a strong increase above the $2,000 resistance. There was a break above a major bearish trend line with resistance near $1,980 on the hourly chart of ETH/USD. The pair gained strength and climbed above the $2,020 resistance. It gained over 5% and outperformed Bitcoin. Finally, it tested the $2,100 zone. A high is formed near $2,092 and Ethereum is now consolidating gains. It is testing the 23.6% Fib retracement level of the upward move from the $1,930 swing low to the $2,092 high. It is well above $2,020 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,080 zone. The first key resistance is near the $2,120 level. A clear move above the $2,120 level could spark another strong increase. Source: ETHUSD on TradingView.com The next resistance is near $2,200, above which the price could aim for a move toward the $2,250 level. Any more gains could start a wave toward the $2,320 level. Another Downside Correction in ETH? If Ethereum fails to clear the $2,120 resistance, it could start a fresh decline. Initial support on the downside is near the $2,050 level. The next key support is $2,000 or the 50% Fib retracement level of the upward move from the $1,930 swing low to the $2,092 high. The main support is now near $1,980. A downside break below the $1,980 support might trigger more losses. In the stated case, Ether could drop toward the $1,920 support zone in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $2,000 Major Resistance Level – $2,120"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-23T04:40:11.000Z",
    "title": "The Role of Blockchain in the Evolution of CBDCs (Central Bank Digital Currencies) for Trading",
    "url": "https://dailyhodl.com/2023/11/22/the-role-of-blockchain-in-the-evolution-of-cbdcs-central-bank-digital-currencies-for-trading/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/Gainers-in-Next-Bull-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/Gainers-in-Next-Bull-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/Gainers-in-Next-Bull-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/Gainers-in-Next-Bull-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/Gainers-in-Next-Bull-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/Gainers-in-Next-Bull-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/Gainers-in-Next-Bull-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>CBDCs (Central Bank Digital Currencies) have become a hot topic among crypto enthusiasts as the main weapon of governments against privacy and freedom. By controlling all the finances of their population, governments can use CBDCs to control and manipulate the population to an extent that was not possible until now. Despite these issues, there may [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/22/the-role-of-blockchain-in-the-evolution-of-cbdcs-central-bank-digital-currencies-for-trading/\">The Role of Blockchain in the Evolution of CBDCs (Central Bank Digital Currencies) for Trading</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]