[
  {
    "source": "CryptoGlobe",
    "date": "2023-07-08T12:59:41.000Z",
    "title": "XRP Ledger Q2 2023: A Comprehensive Analysis by Messari",
    "url": "https://www.cryptoglobe.com/latest/2023/07/xrp-ledger-q2-2023-a-comprehensive-analysis-by-messari/",
    "description": "Messari’s Protocol Research Analyst, Red Sheehan, recently released the “State of XRP Ledger Q2 2023” report, providing a detailed analysis of the XRP Ledger (XRPL) and its performance in the second quarter of 2023. According to Sheehan, the XRPL, which has been operational for over a decade, offers fast, energy-efficient, cross-currency, and cross-border payments. Despite […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-08T13:00:00.000Z",
    "title": "Google Cloud Taps Into Voltage To Offer Bitcoin $BTC Services",
    "url": "https://cryptodaily.co.uk/2023/07/google-cloud-taps-into-voltage-to-offer-bitcoin-btc-services",
    "description": "<p class=\"md-end-block md-p md-focus\">Google Cloud's recently announced a partnership with infrastructure provider Voltage, unveiling a new trajectory for the tech giant's Bitcoin and Lightning ambitions.</p>\n<p class=\"md-end-block md-p\">The agreement will enable Google Cloud, a $225-billion data and cloud service, to extend Bitcoin-related services worldwide while assisting Voltage's global operations expansion.</p>\nGoogle&rsquo;s Outsourced Bitcoin and Lightning Team\n<p class=\"md-end-block md-p\">The collaboration sees Voltage functioning as Google's outsourced Bitcoin and Lightning team. Voltage CEO, Graham Krizek, explained that the infrastructure provider will facilitate Bitcoin or Lightning integration for companies interested in these services via Google. </p>\n<p class=\"md-end-block md-p\">The deal has not only generated substantial social media interest but also signals Google&rsquo;s evolving recognition of Bitcoin and Lightning's potential. This increased attention isn't isolated within Google alone, but industry-wide. Christopher Calicott, managing director of venture capital firm Tramell Venture Partners, suggested that any corporation adjacent to payments \"would ignore Lightning at their peril.\"</p>\nGoogle Ventures Fueling Bitcoin Momentum\n<p class=\"md-end-block md-p\">Google's interests in blockchain, Bitcoin, and Web3 companies have been increasingly apparent since 2020, primarily via Google Ventures (GV), its investment arm. Voltage benefited from GV's interest, receiving participation in a $6-million seed round in 2021. </p>\n<p class=\"md-end-block md-p\">This significant financial backing is seen as an indication of the rising momentum for Bitcoin and related technologies. Calicott pointed out that when companies invest, it sends a potent signal of their focus, adding weight to the Bitcoin and Lightning narrative. Krizek concurred, stating that the partnership is indicative of an increased Bitcoin focus strategy within larger organizations, including Google. </p>\n<p class=\"md-end-block md-p\">Despite its competitor, Apple, showing an aversion to Lightning by recently delisting Damus, a Lightning-friendly decentralized social media protocol, the Lightning Network is gaining traction among billion-dollar businesses globally. </p>\n<p class=\"md-end-block md-p\">Both Binance and Coinbase, two leading crypto exchanges, have recently committed to Lightning integrations. </p>\n<p class=\"md-end-block md-p\">Google Cloud's partnership with Voltage marks a significant step towards further integrating Bitcoin and Lightning technologies within the wider tech industry. With the growing corporate interest and investment in these areas, the expectation for further services rollout, along with expanded efforts in Bitcoin education, continues to rise.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-08T12:58:13.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-08T12:58:10.000Z",
    "title": "$3.1M NFT scandal unearthed by a Blockchain investigator",
    "url": "https://www.cryptopolitan.com/3-1m-nft-scandal-unearthed-by-zachxbt/",
    "description": "Blockchain investigator ZachXBT&#8217;s research has played a crucial role in a class-action lawsuit filed in Canada against Boneheads, an NFT project accused of orchestrating a rug pull worth $3.1 million. ZachXBT took to Twitter on July 7 to shed light on the lawsuit, reaffirming allegations that the Boneheads team swiftly vanished after spending the minted ... <a title=\"$3.1M NFT scandal unearthed by a Blockchain investigator\" class=\"read-more\" href=\"https://www.cryptopolitan.com/3-1m-nft-scandal-unearthed-by-zachxbt/\" aria-label=\"More on $3.1M NFT scandal unearthed by a Blockchain investigator\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-08T13:00:17.000Z",
    "title": "Is Solana Dead? Inqubeta Looks To Take Its Place as a Top Token",
    "url": "https://nulltx.com/is-solana-dead-inqubeta-looks-to-take-its-place-as-a-top-token/",
    "description": "The broader crypto market being in an uptrend means many cryptocurrencies are following suit, including Solana. However, its long-term value remains in doubt as investors opt to invest in other tokens with the potential for a stronger trajectory in the future. This uncertainty has led investors to InQubeta, the AI token and platform set to [&#8230;]"
  }
]