[
  {
    "source": "CoinDesk",
    "date": "2023-09-27T19:03:32.000Z",
    "title": "Crypto Exchange Kraken to Explore Stock Trading: Bloomberg",
    "url": "https://www.coindesk.com/business/2023/09/27/crypto-exchange-kraken-to-explore-stock-trading-bloomberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The service could launch as soon as 2024, Bloomberg reported, citing a person familiar with the matter."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-27T18:57:08.000Z",
    "title": "Longevity Starts With Ending ‘Self-Destructive Behavior', Says Anti-Aging Obsessed Billionaire",
    "url": "https://decrypt.co/198980/longevity-starts-with-ending-self-destructive-behavior-anti-aging-billionaire-bryan-johnson",
    "description": "In an interview with Bloomberg, Kernel founder Bryan Johnson says simple changes can extend our lives."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-27T19:00:00.000Z",
    "title": "UK politicians enter the metaverse, mainstream media says NFTs are worthless: Nifty Newsletter",
    "url": "https://cointelegraph.com/news/uk-politicians-enter-metaverse-mainstream-media-says-nf-ts-are-worthless-nifty-newsletter",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/9ed9f40c-25a9-4f1c-9d87-249176f5723a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>British politicians went to the metaverse to discuss the benefits and potential challenges that Web3 technology brings.</p>\n                    <p><p>In this week’s newsletter, check out Glassnode data that shows <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> protocol Bitcoin Ordinals may not be clogging the network. Read about British politicians using the metaverse to discuss opportunities and challenges in Web3, and find out why Rolling Stone says NFTs are “finally totally worthless.” And don’t forget this week’s Nifty News, featuring world-renowned artist Takashi Murakami saying he might not release any more NFTs. </p><h2>U.K. politicians don metaverse avatars as they share Web3 roadmap</h2><p>Politicians in the United Kingdom gathered in the metaverse on Sept. 20 to set out a vision for the country’s Web3 and blockchain industry. The gathering included eight British Lords, politicians and global leaders speaking about both the opportunities and challenges that the growth of Web3 technology could bring. </p><p>According to Natalie Elphicke, a member of parliament who appeared with a unique avatar in the metaverse, Web3 “reimagines the very fabric of the internet,” representing a paradigm shift. </p><p><a href=\"https://cointelegraph.com/news/uk-politicians-metaverse-speech-share-web3-roadmap\"><strong>Continue reading</strong></a></p><h2>Bitcoin Ordinals haven’t wrestled blockspace from money TXs: Glassnode</h2><p>Data from on-chain analytics firm Glassnode shows that despite concerns the NFT-like Bitcoin Ordinals protocol is clogging the Bitcoin network, there’s little evidence to prove it. According to Glassnode, inscription users tend to set low fee rates, showing they are more willing to wait longer for confirmation. </p><p>“Inscriptions appear to be buying and consuming the cheapest available blockspace, and are readily displaced by more urgent monetary transfers,” the firm explained in its on-chain report. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-ordinals-have-not-displaced-money-transfers-blockspace-glassnode\"><strong>Continue reading</strong></a></p><h2>NFTs are “totally worthless” says mainstream media, community responds</h2><p>Media outlet Rolling Stone has declared that NFTs are “finally totally worthless” in a recent report. The firm cited the findings of a DappGambl study on the NFT landscape. According to the data, up to 95% of NFTs owned by over 23 million users have no value at all. </p><p>Members of the community responded to the report, with some showing previous articles from the media outlet that promoted the Bored Ape Yacht Club collection. The community member highlighted the drastic shift in the media narrative regarding NFTs. </p><p><a href=\"https://cointelegraph.com/news/nfts-totally-worthless-mainstream-media-says-community-responds\"><strong>Continue reading</strong></a></p><h2>Nifty News: Murakami to step back from NFTs, Dan Harmon’s NFT show debut and more</h2><p>Japanese artist Takashi Murakami has recently said he might not release any more NFTs after entering the market in 2021. The artist said in an interview with The Guardian that maybe he is “done releasing NFTs.” Murakami’s NFT collection Murakami.Flowers generated over $40 million in secondary trading volume, according to data from NFT marketplace OpenSea. </p><p>Meanwhile, NFT artist Danny Casale recently won a multimillion-dollar contract dispute with a Web3 art curator called DigiArt. DigiArt sued Casale in March 2023 for allegedly breaching their contract after launching his own NFT project. However, a judge has taken the artist’s side as there was no contract start date specified. </p><p><a href=\"https://cointelegraph.com/news/nifty-news-murakami-nfts-dan-harmon-nft-show\"><strong>Continue reading</strong></a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-01/43adc850-7dbd-4fa8-811b-9eb32b6c1983.jpg\"  alt=\"\"  title=\"UK politicians enter the metaverse, mainstream media says NFTs are worthless: Nifty Newsletter\"  /></figure><p class=\"post-content__accent post-content__accent_big\"><a href=\"https://cointelegraph.com/podcasts/nft-steez\">CHECK OUT COINTELEGRAPH’S <em>NFT STEEZ</em> PODCAST</a></p><p><em>Thanks for reading this digest of the week’s most notable developments in the NFT space. Come again next Wednesday for more reports and insights into this actively evolving space.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-27T18:40:00.000Z",
    "title": "Uniswap Foundation targets $62M in additional funding",
    "url": "https://cointelegraph.com/news/uniswap-foundation-targets-62-million-additional-funding",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/f23618f6-152e-4cfb-bb68-c7a4a5c2286d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Foundation plans to issue $15 million per year in community grants to fund DeFi projects. </p>\n                    <p><p>Decentralized exchange (DEX) Uniswap is seeking an on-chain vote to approve the second tranche of the $74 million funding for its developer Uniswap Foundation.</p><p>According to the September 27 <a href=\"https://gov.uniswap.org/t/governance-proposal-complete-initial-funding-of-the-uniswap-foundation/21956\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, the second tranche of funding, with a buffer of 10% for price volatility, is worth an estimated $62 million and will be decided via an on-chain vote on October 4. If approved, the funds will be used for operations and research grants. The Uniswap Foundation is responsible for growing core protocol metrics, building a pipeline for innovation, and aligning incentives for stakeholders of the popular DEX. </p><p>Developers explained that over the next year, they plan to build a software development kit for Uniswap V4 and support its subsequent migration, having already received $17.3 million in the first tranche for this target. The Uniswap Foundation team said the funding request was split in two to allow more time to register its legal entity and receive non-profit 501(c)4 status from the Internal Revenue Service, which developers say was finalized in spring before receiving the larger lump sum payment.</p><p>In the last 12 months, Uniswap Foundation disclosed a total of $4.8 million spent on research grants, $3.15 million for operations, and a $1.29 million loss on capital from the market decline of Uniswap (UNI) tokens between the initial governance proposal and receipt of funds. \"The UF has $53.2M<strong> </strong>in grants capital remaining to disburse. We plan to disburse $10-$15M per year, with the amount disbursed per year increasing over time,\" developers wrote. </p><p><strong><em>Related:<a href=\"https://cointelegraph.com/news/judge-dismisses-class-action-suit-against-uniswap-over-token-scam-losses\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/judge-dismisses-class-action-suit-against-uniswap-over-token-scam-losses/amp\"> Judge dismisses class-action suit against Uniswap over token scam losses</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-27T19:00:28.000Z",
    "title": "Marathon Digital confirms it mined invalid Bitcoin block",
    "url": "https://cryptoslate.com/marathon-digital-confirms-mining-invalid-bitcoin-block/",
    "description": "<p>Bitcoin (BTC) miner Marathon Digital confirmed that it mined an invalid BTC block at height 809478. &#8220;We can confirm that Marathon did mine an invalid bloc,&#8221; Marathon Digital said. &#8220;We utilize a small portion of our hash rate to experiment with our development pool and research potential methods to optimize our operations.&#8221; In a Sept. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/marathon-digital-confirms-mining-invalid-bitcoin-block/\">Marathon Digital confirms it mined invalid Bitcoin block</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-27T18:53:20.000Z",
    "title": "Xsolla Announces Acquisition of AcceleratXR, A Multi-Player Platform For Games",
    "url": "https://www.cryptoglobe.com/latest/2023/09/xsolla-announces-acquisition-of-acceleratxr-a-multi-player-platform-for-games/",
    "description": "Sherman Oaks, United States, September 27th, 2023, Chainwire Xsolla, a global video game commerce company, announces its strategic acquisition of AcceleratXR, a provider of in-game server backend technology designed for live service games and software. The AcceleratXR platform and network engine offer robust scalability, supporting experiences across multiple platforms and devices. It functions similarly to an […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-27T18:49:59.000Z",
    "title": "U.S. Economic Uncertainty and Rising Debt Bolster Gold’s Position, Says Invesco’s Kristina Hooper",
    "url": "https://www.cryptoglobe.com/latest/2023/09/u-s-economic-uncertainty-and-rising-debt-bolster-golds-position-says-invescos-kristina-hooper/",
    "description": "In a recent discussion with Kitco News, Kristina Hooper, the Chief Global Market Strategist at Invesco, shared her insights on the current economic landscape in the United States and its implications for the gold market. Hooper expressed skepticism about the Federal Reserve’s optimistic outlook for a smooth economic transition, suggesting that the U.S. is more […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T19:00:11.000Z",
    "title": "Gary Gensler still hang up on crypto regulation – won’t recognize Ripple’s win",
    "url": "https://www.cryptopolitan.com/gary-gensler-still-hard-on-crypto-regulation/",
    "description": "Chairman of the Securities and Exchange Commission (SEC) Gary Gensler testified before the House Financial Services Committee on Wednesday, staunchly defending his agency&#8217;s role as the crypto market&#8217;s policing officer. Gary Gensler elaborated on the SEC&#8217;s authority under the securities laws and its function in the economy. He did not mention significant legal setbacks that ... <a title=\"Gary Gensler still hang up on crypto regulation &#8211; won&#8217;t recognize Ripple&#8217;s win\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gary-gensler-still-hard-on-crypto-regulation/\" aria-label=\"More on Gary Gensler still hang up on crypto regulation &#8211; won&#8217;t recognize Ripple&#8217;s win\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-27T19:00:16.000Z",
    "title": "Chainlink (LINK) Brushes Off Market Downtrend, Scores 11% In Last Week",
    "url": "https://www.newsbtc.com/analysis/link/chainlink-link-brushes-off-market-downtrend-scores-11-in-last-week/",
    "description": "Chainlink has remained bullish despite the bearish pressure in the broader crypto market. The crypto closed bullish at $7.4 yesterday, September 26, with over 7% increase.  LINK remains bullish, with an 11% seven-day price increase and over 2% gain in the last 24 hours. But while the token’s price continues to increase, data shows the trading volume has declined 17% in the last 24 hours. What could be the reason behind this contradiction? Chainlink Price Continues To Surge In an X post on September 24, Chainlink network announced it had recorded multiple integrations across six blockchains. These include Arbitrum, Ethereum, Optimism, Avalanche, Polygon, and BNB Chain. Also, yesterday, September 26, gaming platform BetSwirl announced that it integrated Chainlink&#8217;s CCIP across Ethereum, Polygon, Avalanche, and Arbitrum. According to the post, this CCIP integration will help “BetSwirl enable seamless, secure, and reliable cross-chain token transfers” Related Reading: XRP Price Analysis: 4-Month Chart Dynamics Decoded By Crypto Analyst This increased adoption across multiple chains expanded Chainlink&#8217;s user base, a plausible factor behind LINK&#8217;s resilience amid the prevailing bearish market. Although LINK briefly slipped off the $7.5 level to $7.3 yesterday, it has since recovered momentum. Given the ongoing movement, the crypto asset could break the $7.8 resistance and record higher highs soon. Meanwhile, Chainlink (LINK) is number 3 among the top weekly gainers after CRV and PEPE. It has also secured a position on the top daily gainers’ chart. Although the price strides are bullish, the trading volume, down 17%, raises concern about whether LINK can sustain the rally. It indicates reduced trading activity, a possible sign that buyers have reached saturation and paused to weigh their next move.  This setup bodes badly for LINK as it could signal the entrance of sellers, which will exert downward pressure on the token’s price. Price Surge Drops Chainlink (LINK) Supply On Crypto Exchanges According to Santiment&#8217;s report on September 24, Chainlink remains one of the best-performing cryptocurrencies in September. It outlined that, unlike most assets, LINK’s price often records an initial boost when holders move their tokens from exchanges. Santiment noted that the asset&#8217;s price increased 23% in two weeks as the exchange supply flowed back to cold wallets. Also, the analytics platform reported that LINK exchange supply increased by 17.2%, reaching a 2023 high on September 14. However, on September 24, 10 days later, the token&#8217;s exchange supply dropped to 16.4%. This observation is a plausible reason behind Chainlink’s declining trading volume.  Related Reading: Early Rejection Of 21Shares Spot Bitcoin ETF Sparks Concerns Meanwhile, as of the time of writing, LINK trades at $7.64, with a 2.88% price increase in the last 24 hours. The token trades above the simple moving averages of $6.494 and $6.719 and two key support levels.  LINK is approaching the overbought area, forming a bullish candlestick as buyers vie to conquer the $7.823 resistance. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-27T18:52:00.000Z",
    "title": "BTC Advisor Called Out By Visa Product Head & XRP CTO For Tweet",
    "url": "https://coinedition.com/btc-advisor-called-out-by-visa-product-head-xrp-cto-for-tweet/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Trader-Shares-the-2-Levels-XRP-Needs-to-Break-Before-It-Can-Rally.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Trader Shares the 2 Levels XRP Needs to Break Before It Can Rally\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Trader-Shares-the-2-Levels-XRP-Needs-to-Break-Before-It-Can-Rally.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Trader-Shares-the-2-Levels-XRP-Needs-to-Break-Before-It-Can-Rally-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Trader-Shares-the-2-Levels-XRP-Needs-to-Break-Before-It-Can-Rally-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Trader-Shares-the-2-Levels-XRP-Needs-to-Break-Before-It-Can-Rally-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Trader-Shares-the-2-Levels-XRP-Needs-to-Break-Before-It-Can-Rally-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Trader-Shares-the-2-Levels-XRP-Needs-to-Break-Before-It-Can-Rally-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Earlier today, Visa Installment’s product head and former employee of Ripple, Josh Giersch, criticized Max Keiser for his problematic stance on XRP. On September 24, Keiser, who is the Bitcoin advisor to El Salvador’s president, claimed that XRP is centralized, triggering a range of reactions from the Ripple community on X (formerly known as Twitter). [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/btc-advisor-called-out-by-visa-product-head-xrp-cto-for-tweet/\">BTC Advisor Called Out By Visa Product Head &amp; XRP CTO For Tweet</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-27T18:45:12.000Z",
    "title": "SEC Skeptical of Coinbase’s Role in Crypto Lending Firm Celsius’ Bankruptcy Process",
    "url": "https://dailyhodl.com/2023/09/27/sec-skeptical-of-coinbases-role-in-crypto-lending-firm-celsius-bankruptcy-process/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/sec-role-lending-firm.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/sec-role-lending-firm.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/sec-role-lending-firm.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/sec-role-lending-firm.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/sec-role-lending-firm.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/sec-role-lending-firm.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/sec-role-lending-firm.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Securities and Exchange Commission (SEC) is opposed to Coinbase&#8217;s current involvement in Celsius&#8217; bankruptcy plan. Celsius, a crypto lender, originally filed for bankruptcy in July 2022 after its native asset plummeted by over 99% and it was unable to fulfill customer withdrawals. The bankrupt lender&#8217;s most recent Chapter 11 plan entails using Coinbase as an [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/27/sec-skeptical-of-coinbases-role-in-crypto-lending-firm-celsius-bankruptcy-process/\">SEC Skeptical of Coinbase’s Role in Crypto Lending Firm Celsius’ Bankruptcy Process</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-27T18:41:00.000Z",
    "title": "Binance Leaves Russia, Enters Agreement To Sell Operations to Local Firm",
    "url": "https://dailyhodl.com/2023/09/27/binance-leaves-russia-enters-agreement-to-sell-operations-to-local-firm/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/crypto-binance-sec-offer.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/crypto-binance-sec-offer.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/crypto-binance-sec-offer.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/crypto-binance-sec-offer.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/crypto-binance-sec-offer.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/crypto-binance-sec-offer.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/crypto-binance-sec-offer.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The largest crypto exchange in the world is exiting Russia and in the process of selling its operations to a local business. In a new press release, Binance says that it will be selling the entirety of its Russian business to local crypto exchange CommEX and completely leaving the nation – a process that will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/27/binance-leaves-russia-enters-agreement-to-sell-operations-to-local-firm/\">Binance Leaves Russia, Enters Agreement To Sell Operations to Local Firm</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]