[
  {
    "source": "Crypto Daily",
    "date": "2023-05-27T07:12:00.000Z",
    "title": "Senator Cynthia Lummis Pushes Back Against Biden’s Crypto Tax",
    "url": "https://cryptodaily.co.uk/2023/05/senator-cynthia-lummis-pushes-back-against-bidens-crypto-tax",
    "description": "<p>US Senator Cynthia Lummis has pushed back against the Biden Administration&rsquo;s proposal to tax cryptocurrency miners, stating that the administration is picking &ldquo;winners and losers.&rdquo;</p>\n<p>Bitcoin mining is a very polarizing subject in the United States of America and has drawn considerable ire from the Biden administration.&nbsp;</p>\nA Harsh Tax Regime&nbsp;\n<p>Bitcoin mining has often drawn harsh criticism from governments thanks to its high energy consumption. In the latest example, the Joe Biden administration has outlined plans to impose harsh taxes on Bitcoin mining. According to reports, the tax in question is called the Digital Asset Mining Energy Excise Tax (DAME). It was proposed by the administration in its budget for the fiscal year 2024. Under the proposal, cryptocurrency mining firms would have to pay a tax equal to 30% of the cost of electricity consumed.&nbsp;</p>\n<p>The tax would come into effect next year and be gradually phased in over a period of three years at a fixed rate of 10% per year until it reaches the targeted 30% by the end of 2026.&nbsp;</p>\nSignificant Pushback&nbsp;\n<p>The proposal has been subject to furious pushback from prominent members of the cryptocurrency community, who have argued that the administration&rsquo;s priorities are misplaced. However, prominent faces from the crypto community are not the only ones critical of the proposal. Robert F. Kennedy Jr, United States presidential candidate, has also roundly criticized the bill, calling it a &ldquo;bad idea.&rdquo; According to recent statements, Kennedy has chosen to publicly align himself with the Bitcoin community.&nbsp;</p>\n<p>Another prominent voice against the proposal is that of Senator Cynthia Lummis, who has been vocal in her criticism of the bill. Lummis first spoke against the bill at the Bitcoin 2023 conference, telling the audience in attendance that the tax would not happen. She later tweeted about the conference and reiterated her opposition to the proposal, arguing that she would not let the government kill the crypto industry with taxes and oppose the proposal in Congress.</p>\n\n<p>&ldquo;America must welcome innovation, and digital assets are the future of financial innovation. A 30% tax hike on any specific industry is a blatant attempt by the administration to pick winners and losers. I will not let President Biden tax the digital asset industry out of existence.&rdquo;</p>\n\n<p>Cryptocurrency regulation and taxation has become a significant talking point in the US budget. Apart from the proposed 30% tax on crypto mining activities, the Biden government has also stated that it wants to eliminate tax loopholes for wealthy crypto traders. President Biden&rsquo;s comments have understandably sparked confusion within crypto circles. However, experts believe that he referred to a dearth of wash trading rules, allowing traders to engage in tax-loss harvesting. If the proposal is passed, it could lead to miners moving to other jurisdictions and putting significant uncertainty over the crypto industry in the United States in the face of growing regulatory pressure.&nbsp;</p>\nResponsible Innovation Act To Be Reintroduced&nbsp;\n<p>Senator Lumis, along with Democratic Senator Gillibrand of New York, has stated that there are plans to reintroduce the Responsible Innovations Act with some amendments, such as adding in greater customer protections. The bill was originally introduced last year and takes a comprehensive approach to regulating the crypto industry in the United States of America.&nbsp;</p>\n<p>Lummis and Gillibrand are working with the House Financial Services Committee Chair Patrick T. McHenry, R-N.C., and Maxine Waters, D-Calif, with the group working to break the bill into different committees and get it passed. Lummis stated at the Bitcoin 2023 conference,</p>\n\n<p>&ldquo;What we&rsquo;re apt to see is for the House to move a stablecoin bill first, then you&rsquo;ll probably see the introduction of Lummis Gillibrand in the Senate, which will remain comprehensive.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-27T07:30:04.000Z",
    "title": "EAEU Official Urges BRICS and SCO for Joint Use of Digital Currencies, New Payment Card",
    "url": "https://news.bitcoin.com/eaeu-official-urges-brics-and-sco-for-joint-use-of-digital-currencies-new-payment-card/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1985287640-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"EAEU Official Urges BRICS and SCO for Joint Use of Digital Currencies, New Payment Card\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1985287640-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1985287640-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1985287640-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1985287640-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1985287640-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1985287640-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1985287640-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Three integration unions with Russian participation, BRICS, SCO, and the EAEU, should adopt joint policies on the use of digital currencies, according to a top representative of one of them. He also believes the international organizations should develop a new payment system with its own bank cards. BRICS, SCO, and EAEU May Launch Common Payment [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-27T07:25:48.000Z",
    "title": "InQubeta (QUBE) Sees Spike in Interest as Decentraland (MANA) and EOS (EOS) Underperform",
    "url": "https://www.crypto-news-flash.com/inqubeta-qube-sees-spike-in-interest-as-decentraland-mana-and-eos-eos-underperform/?utm_source=rss&utm_medium=rss&utm_campaign=inqubeta-qube-sees-spike-in-interest-as-decentraland-mana-and-eos-eos-underperform",
    "description": "<p>The crypto world has been a hotbed of innovation and investment in recent years, with blockchain-based platforms aiming to revolutionize how we interact, transact, and even own digital assets. Big names like Decentraland (MANA) and EOS (EOS) are considered pioneers in this space, but now a new player InQubeta (QUBE), has emerged, capturing the attention [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/inqubeta-qube-sees-spike-in-interest-as-decentraland-mana-and-eos-eos-underperform/\">InQubeta (QUBE) Sees Spike in Interest as Decentraland (MANA) and EOS (EOS) Underperform</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-27T07:39:25.000Z",
    "title": "Price of Solana (SOL) Could Rise to $19.933 in the Next Few Days",
    "url": "https://coinedition.com/price-of-solana-sol-could-rise-to-19k-in-the-next-few-days/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Price-of-Solana-SOL-Could-Rise-to-19.933-in-the-Next-Few-Days-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Price of Solana (SOL) Could Rise to $19.933 in the Next Few Days\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Price-of-Solana-SOL-Could-Rise-to-19.933-in-the-Next-Few-Days-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Price-of-Solana-SOL-Could-Rise-to-19.933-in-the-Next-Few-Days-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Price-of-Solana-SOL-Could-Rise-to-19.933-in-the-Next-Few-Days-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Price-of-Solana-SOL-Could-Rise-to-19.933-in-the-Next-Few-Days-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Price-of-Solana-SOL-Could-Rise-to-19.933-in-the-Next-Few-Days-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Price-of-Solana-SOL-Could-Rise-to-19.933-in-the-Next-Few-Days.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Solana (SOL) was able to print a 24-hour gain of 1.49% to trade at $19.49. The altcoin was in the process of flipping the $19.49 resistance level into support. SOL’s price could rise to $19.933 if it is able to successfully turn $19.49 into support. Solana (SOL) was able to print a 24-hour gain according [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/price-of-solana-sol-could-rise-to-19k-in-the-next-few-days/\">Price of Solana (SOL) Could Rise to $19.933 in the Next Few Days</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]