[
  {
    "source": "CoinDesk",
    "date": "2024-03-19T21:16:52.000Z",
    "title": "Ether ETFs Likely Won't Get Approved in May, Bloomberg Analyst Predicts",
    "url": "https://www.coindesk.com/markets/2024/03/19/ether-etfs-likely-wont-get-approved-in-may-bloomberg-analyst-predicts/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Odds that spot ether ETFs will get approved in May have gotten slimmer, according to a Bloomberg ETF analyst who cited U.S. regulators' seeming lack of engagement with potential issuers over the products."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-19T20:57:48.000Z",
    "title": "Bitcoin Retreats Below $65,000 Ahead of Big Fed Day—What Gives?",
    "url": "https://decrypt.co/222437/bitcoin-retreats-below-65000-ahead-of-big-fed-day-what-gives",
    "description": "The biggest cryptocurrency is down, and the imminent Federal Reserve meeting is only part of the story."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-19T20:46:02.000Z",
    "title": "How Fighting Game ‘AI Arena’ Turned Its Airdrop Into a Team Sport",
    "url": "https://decrypt.co/222438/how-fighting-game-ai-arena-turned-airdrop-team-sport",
    "description": "AI Arena is like Super Smash Bros, only you’re training the fighters. And its recent airdrop campaign took another unique approach."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-19T20:36:43.000Z",
    "title": "Ethereum ETFs Won't Be Approved In May—Nor Should They, Some Experts Say",
    "url": "https://decrypt.co/222439/ethereum-etf-may-2024-bitcoin-hype",
    "description": "Ethereum ETFs may perform better if launched after the hype around Bitcoin ETFs fades."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-19T21:31:12.000Z",
    "title": " Advocacy groups file amicus briefs encouraging SEC to write crypto rules ",
    "url": "https://cointelegraph.com/news/crypto-advocacy-groups-amicus-briefs-sec-rules",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNTJmZmM1MzctNmUxOS00YTY1LTk2MWUtZjQzMDcxNzZhMGNjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Crypto Council for Innovation, Satoshi Action Fund, Texas Blockchain Council, Paradigm, Lejilex and the U.S. Chamber of Commerce all called on the SEC to establish guidelines.</p>\n                    <p><p>Several advocacy groups have filed amicus briefs in support of an appeal by Coinbase, calling for the United States Securities and Exchange Commission (SEC) to create clear rules for the crypto industry.</p><p>In separate March 18 filings with the Third Circuit Court of Appeals, the Crypto Council for Innovation (CCI), Satoshi Action Fund, Texas Blockchain Council, investment firm Paradigm, digital asset company Lejilex and the U.S. Chamber of Commerce <a href=\"https://cryptoforinnovation.org/cci-files-amicus-brief-supporting-coinbases-challenge-to-secs-denial-of-rulemaking-petition/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the SEC lacked clear guidelines for market participants to successfully follow in the United States. Many of the filings argued that without clear rules of the road, companies would be more inclined to leave the country.</p><p>“The uncertainty and paralysis created by the SEC could cause digital asset companies to move out of the United States altogether,” said a joint filing from the Satoshi Action Fund and Texas Blockchain Council. “The need for clear rules, with adequate notice rooted in congressional authority, is especially crucial where the SEC seeks to impose ‘adverse consequences’ and ‘liability’ on the digital asset industry ‘for past actions which were taken in good-faith reliance on [the SEC’s] pronouncements.’”</p><p><a href=\"https://cointelegraph.com/news/crypto-advocacy-groups-amicus-briefs-sec-rules\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-19T21:15:36.000Z",
    "title": " BlackRock begins asset tokenization with launch of digital liquidity fund ",
    "url": "https://cointelegraph.com/news/blackrock-begins-asset-tokenization-launch-digital-liquidity-fund",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYzA1NWE5N2ItMjIzNC00MWFmLTk1MDctZDU1Yjk3ODg4ZDRiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The world’s largest asset manager has taken “the next step forward” toward a single ledger, instantaneous settlement and ending illicit activities, in the view of CEO Larry Fink.</p>\n                    <p><p>BlackRock, the world’s largest asset manager, has filed United States Securities and Exchange Commission (SEC) Form D for the BlackRock USD Institutional Digital Liquidity Fund. This marks the launch of BlackRock’s first tokenized asset fund.</p><p>According to the filing, BlackRock created the fund in 2023, but has yet to launch it. Form D is used to obtain various exemptions. BlackRock indicated that it is seeking an exemption under the Investment Company Act Section 3(c), which exempts it from certain SEC regulations. The fund was created under the jurisdiction of the British Virgin Islands.</p><p>The fund will have a $100,000 minimum investment and be offered by Securitize, a U.S. digital assets securities firm, which will also conduct the sale of the tokens. The form shows $525,000 in sales commissions, and indicates the size of the fund as “indefinite.” The form was signed on March 14.</p><p><a href=\"https://cointelegraph.com/news/blackrock-begins-asset-tokenization-launch-digital-liquidity-fund\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-19T21:06:21.000Z",
    "title": "UK FCA to recover $8 million in costs via fees placed on stablecoin issuers, custodians",
    "url": "https://cryptoslate.com/uk-fca-to-recover-8-million-in-costs-via-fees-placed-on-stablecoin-issuers-custodians/",
    "description": "<p>The UK Financial Conduct Authority (FCA) announced that it intends to recover the equivalent of $8 million in costs stemming from the supervision of stablecoins and crypto, according to a March 19 release. The funds will be recovered in the form of fees placed on stablecoin issuers and digital asset custodians. The regulator mainly plans [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/uk-fca-to-recover-8-million-in-costs-via-fees-placed-on-stablecoin-issuers-custodians/\">UK FCA to recover $8 million in costs via fees placed on stablecoin issuers, custodians</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-19T20:00:45.000Z",
    "title": "Bankrupt Genesis agrees to $21 million SEC fine over defunct Gemini Earn crypto lending violations",
    "url": "https://cryptoslate.com/bankrupt-genesis-agrees-to-21-million-sec-fine-over-defunct-gemini-earn-crypto-lending-violations/",
    "description": "<p>Bankrupt crypto lender Genesis Global has consented to a $21 million civil penalty tied to the now-defunct Gemini Earn lending initiative, according to a March 19 statement from the US SEC. Under the settlement terms, the SEC will not be paid the penalty until Genesis satisfies all bankruptcy claims, including those from Gemini Earn investors. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bankrupt-genesis-agrees-to-21-million-sec-fine-over-defunct-gemini-earn-crypto-lending-violations/\">Bankrupt Genesis agrees to $21 million SEC fine over defunct Gemini Earn crypto lending violations</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-19T20:13:56.000Z",
    "title": "Optimism begins trials for fault proofs on Sepolia testnet",
    "url": "https://cryptobriefing.com/op-fault-proof-sepolia-testnet/",
    "description": "Optimism begins testing its new fault proof system on Ethereum's Sepolia network to enhance security and decentralization."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-19T19:47:21.000Z",
    "title": "Umoja raises $4 million to power crypto retail investors with ‘smart money tools’",
    "url": "https://cryptobriefing.com/umoja-raises-4-million-power-crypto-retail/",
    "description": "Umoja raises $4M in seed funding to advance its smart money protocol, aiming to provide sophisticated wealth creation tools to crypto retail."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T19:46:49.000Z",
    "title": "Chainlink (LINK) and Ethereum (ETH) Investors See Kelexo (KLXO) as a Major Contender in the Crypto Lending Arena",
    "url": "https://cryptodaily.co.uk/2024/03/chainlink-link-and-ethereum-eth-investors-see-kelexo-klxo-as-a-major-contender-in-the-crypto-lending-arena",
    "description": "The crypto lending industry is built on the dedication to recreating traditional financial markets on the blockchain with the purpose of making them easier to access. Kelexo (KLXO) is a new entrant into this market, offering a Web 3 marketplace for lenders and borrowers to interact without needing a middle man."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-19T21:00:35.000Z",
    "title": "Wu-Tang’s Ghostface Killah to Release Exclusive Music Collection on Bitcoin Blockchain",
    "url": "https://news.bitcoin.com/wu-tangs-ghostface-killah-to-release-exclusive-music-collection-on-bitcoin-blockchain/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/po90-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Wu-Tang&#039;s Ghostface Killah to Release Exclusive Music Collection on Bitcoin Blockchain\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/po90-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/po90-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/po90-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/po90-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/po90-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/po90-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/po90.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />This week, the popular American rapper and Wu-Tang Clan member, Ghostface Killah, declared his intention to release exclusive tracks on the Bitcoin blockchain. The influential hip-hop artist mentioned that this issuance will encompass a 10,000-piece collection, granting owners the rights to the music. Ghostface Killah Innovates With Bitcoin-Backed Music Rights Collection Tracks produced by Wu-Tang [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-19T20:45:41.000Z",
    "title": "New Crypto to Watch: VR Project 5thScape Raises Over $1.5M",
    "url": "https://news.bitcoin.com/new-crypto-to-watch-vr-project-5thscape-raises-over-1-5m/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_185349_665-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_185349_665-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_185349_665-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_185349_665-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_185349_665-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_185349_665-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_185349_665-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_185349_665.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A new player has burst onto the crypto scene, and investors and gamers alike are taking notice. 5thScape (5SCAPE), a groundbreaking project that aims to blur the lines between reality and virtual reality (VR) gaming, has already raised over $1.5 million during its presale phase. 5thScape Aims to Blur Reality &#38; Virtual Worlds Imagine a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T19:54:19.000Z",
    "title": "Binance founder launches educational platform Giggle Academy",
    "url": "https://www.cryptopolitan.com/binance-founder-launches-giggle-academy/",
    "description": "Changpeng “CZ” Zhao, the founder of Binance, a leading cryptocurrency exchange, has unveiled plans to launch Giggle Academy, a nonprofit online education platform. This initiative comes amidst legal challenges stemming from federal money laundering charges faced by Zhao, who stepped down as Binance’s CEO in November as part of a settlement agreement. Binance founder launches [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T19:45:47.000Z",
    "title": "Genesis reaches agreement to settle SEC case for $21 million",
    "url": "https://www.cryptopolitan.com/genesis-reaches-agreement-sec-21-million/",
    "description": "Genesis Global Capital has recently settled a legal dispute with the United States Securities and Exchange Commission (SEC) by agreeing to pay a substantial civil penalty of $21 million. This settlement stems from allegations related to the Gemini Earn lending program, which Genesis and Gemini were accused of launching without proper registration as a securities [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T19:45:11.000Z",
    "title": "NVIDIA GTC Unveils Powerful Tools Empowering Creators",
    "url": "https://www.cryptopolitan.com/nvidia-gtc-unveils-powerful-tools/",
    "description": "At the recent NVIDIA GPU Technology Conference (GTC), many cutting-edge tools were unveiled, promising to revolutionize content creation by integrating generative AI and accelerated computing. These advancements aim to empower creators with enhanced capabilities across various platforms. Adobe substance 3D stager and sampler upgrades In collaboration with Adobe Firefly, Adobe Substance 3D Stager and Sampler [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-19T20:55:11.000Z",
    "title": "Biggest 2024 Giveaway – Pepe (PEPE) Community Join The Option2Trade $888K Competition",
    "url": "https://nulltx.com/biggest-2024-giveaway-pepe-pepe-community-join-the-option2trade-888k-competition/",
    "description": "As the crypto universe expands, 2024 has marked a significant milestone with the announcement of one of the biggest giveaways the sector has seen – a staggering $888K competition hosted by Option2Trade (O2T). This monumental event has caught the attention of various crypto communities, particularly the Pepe (PEPE) community, known [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-19T20:51:41.000Z",
    "title": "Meme Season: Pepe (PEPE) Drops 20.30%, Investors Hedge Their Cryptocurrency Portfolio by Adding 1000x A.i Token O2T",
    "url": "https://nulltx.com/meme-season-pepe-pepe-drops-20-30-investors-hedge-their-cryptocurrency-portfolio-by-adding-1000x-a-i-token-o2t/",
    "description": "In the whirlwind world of cryptocurrency, where volatility is the norm and the next big thing is always around the corner, investors are constantly on the lookout for opportunities to balance their portfolios and hedge against unpredictable swings. The latest trend in this financial saga involves the meme coin Pepe [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-19T20:38:03.000Z",
    "title": "ZachXBT: Solana meme coins raised $149m in a week ",
    "url": "https://crypto.news/solana-meme-coin-fundraiser/",
    "description": "Solana prices are near an all-time high as speculators purchase crypto to invest in the next possible meme coin play."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-19T20:32:09.000Z",
    "title": "Analyst: Bitcoin resistance around $66.9k pre-halving",
    "url": "https://crypto.news/bitcoin-resistance-halving-analysis/",
    "description": "Bitcoin’s retrace below $63,000 has offered a clearer view of support and resistance levels to watch leading to next month's halving."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-19T21:00:19.000Z",
    "title": "Bitcoin Might Be Poised For A  ‘Double Pump Cycle,’ Reveals Analyst – Here’s Why",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-might-be-poised-for-a-double-pump/",
    "description": "Bitcoin&#8217;s recent downturn has prompted renowned crypto analyst Willy Woo to offer a fresh perspective on the cryptocurrency&#8217;s future trajectory. Woo&#8217;s analysis, based on the surge in Bitcoin&#8217;s Macro Index, suggests an optimistic outlook for the leading digital currency, potentially indicating a pivotal shift in market dynamics. Unveiling Bitcoin Double Pump Prediction Willy Woo, a figure well-respected in the cryptocurrency analysis sphere, has recently shared insights that paint an intriguing future for Bitcoin. Related Reading: Bitcoin Plunges Under $63,000, Here’s Where Next On-Chain Support Is According to Woo, the notable increase in the Bitcoin Macro Index could signal more than just a recovery; it might be the precursor to a rare &#8220;double pump&#8221; cycle. Drawing parallels with the market patterns 2013, Woo&#8217;s forecast points towards two significant price surges for Bitcoin in the coming years. He anticipates the first peak by mid-2024 and a second, even more substantial top in 2025. This dual surge scenario, though historically uncommon, aligns with Woo&#8217;s analysis of current market conditions and Bitcoin&#8217;s intrinsic growth potential. At the rate the #Bitcoin Macro Index is pumping, I wouldn&#8217;t be surprised if we get a top by mid-2024, which would hint at a double pump cycle like 2013&#8230; a second top in 2025. pic.twitter.com/i2a0V5ytPv — Willy Woo (@woonomic) March 19, 2024 Navigating Through The Bearish Terrain Meanwhile, the past week has not been kind to BTC, with the asset experiencing a roughly 10% decline. This downward trend extended over the past 24 hours, seeing Bitcoin&#8217;s value dip by 4.9%, bringing its price to around $65,000—a sharp fall from its recent peak above $73,000. Amid this bearish price action, IntoTheBlock, a notable crypto analytics firm, suggests the $61,000 level as a critical demand zone, highlighted by the significant volume of Bitcoin purchased at this price point. This area is deemed attractive for accumulation by institutional investors and large-scale traders, suggesting a possible recovery in the near future. Bitcoin is looking for support. But where will it find it? The $61k range could be a key area to keep an eye on. 805k addresses acquired over 466k BTC at this level, indicating a healthy appetite for $BTC around that level. pic.twitter.com/XYw7LSC6Ji — IntoTheBlock (@intotheblock) March 19, 2024 Additionally, as Bitcoin navigates its current market challenges, cryptocurrency analyst Charles Edwards points out that a typical pullback during a Bitcoin bull run amounts to about 30%. Related Reading: FOMC Preview: Bitcoin and Crypto’s Fate Tied To Fed Rate Move With BTC having experienced its longest winning streak in history, a corrective dip to $59,000 or even $51,000, as per some predictions, remains within the realm of possibility. A normal Bitcoin bullrun pullback is 30%. Back in December, we were already in the longest winning streak in Bitcoin&#8217;s history. A 20% pullback here takes us to $59K. A 30% pullback would be $51K. These are all levels we should be comfortable expecting as possibilities. — Charles Edwards (@caprioleio) March 19, 2024 These levels represent potential buying opportunities for investors looking to capitalize on Bitcoin&#8217;s cyclical nature and its anticipated ascension post-pullback. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-19T20:00:31.000Z",
    "title": "Crypto Presale Frenzy Raises Over $122M Worth Of SOL In A Week",
    "url": "https://www.newsbtc.com/news/crypto-presale-frenzy-raises-over-122m-worth-of-sol-in-a-week/",
    "description": "The crypto market is down as most cryptocurrencies have registered red numbers for the past few days. Expectations of making big profits out of the bullish sentiment are momentarily halted. And while many patiently wait for the prices to rise again, others are seemingly looking for different options to make their bags. Related Reading: Introducing Book Of Meme (BOME), The Latest $1 Billion Crypto Sensation Crypto Presale Frenzy Sees Big Numbers The “memecoin mania” has been at the forefront of the market, stealing the spotlight since February. As a result, investors might see a window of opportunity to profit from these tokens. During the previous bull cycle, Dogecoin (DOGE) and Shiba Inu (SHIB) were at the center of the stage, with millions of dollars invested in the tokens. This time, the biggest memecoins by market cap are being outshined by some of the newer players. Dogwifhat and other Solana-based tokens have led the way during this leg, registering massive gains in the last month. Recently, the presale and launch of Book of MEME (BOME), which started as a small experimental project, saw its surge to a $1 billion market cap in a few days. The memecoin surge has now turned into a memecoin presale frenzy, with presale launching left and right after becoming the “meta” of the market. PRE SALE META pic.twitter.com/z02vQWnnhz &#8212; duss (@dussincook) March 18, 2024 The meta term, borrowed from the gaming community, refers to the Most Effective Tactic Available. As such, investors and scammers are equally attempting to take profit off the trend. Crypto investigator ZachXBT revealed on X that the current “presale meta” trend has raised $122.5 million since March 12. Taking the BOME project as a starting point, the crypto detective counted 27 different presales from Solana-based memecoins since that date. These projects raised approximately 655,000 SOL, according to the crypto sleuth calculations. I was interested to see how much SOL has been sent as a result of the presale meta and calculated &#62;655,000 SOL ($122.5M) raised from 27 presales. pic.twitter.com/dvsW4TSoov &#8212; ZachXBT (@zachxbt) March 19, 2024 To put the numbers into perspective, ZachXBT highlighted that these figures only account for the projects on the Solana chain in the last seven days. This means that the calculations are only one part of the bigger image as the presales before March 12, and chains like Ethereum, Base, and BSC are excluded. Memecoins Raising Millions In Minutes The biggest raiser on the list was the SMOLE token by visual artist Dekadente. This project received 169,982 SOL during the presale and has seen notable support from the community. Similarly, the recently launched Slerf raised over 50,000 SOL. However, the token faced a dramatic launch after its creator accidentally burned the tokens reserved for the presale participants airdrop. Many of the presales raised millions in a matter of minutes, which hints at impressive participation from the crypto community. However, many suggest that the massive figures raised come from “fabricated fomo” and “insiders sending sol that they’ll eventually get back.” Despite raising millions in SOL, the presale meta trend left investors with nothing. As the investigator highlights, many of the presales on his list have seen a “hard rug” or the tokens’ momentum quickly fading after launch. As a result, the presale participants’ investments vanished or diminished considerably. depends if you mean hard rug or just presale contributors down bad &#8212; ZachXBT (@zachxbt) March 19, 2024 Moreover, scammers have taken their chance to profit off the presale frenzy. Phishing scams under the presale posts have skyrocketed, with impersonating accounts trying to drain investors’ wallets or collect whatever amount people meant to send to the presale addresses. Members of the crypto community have expressed their concerns over the presale trend. Many crypto investors consider the trend might create memecoin fatigue, which could hurt the organic projects aiming for long-term stability. Related Reading: Shiba Inu Ecosystem Blooms: BONE Jumps 44% With $3 Target In Sight SOL is trading at $177.9 in the 1-day chart. Source: SOLUSDT on Trading.view.com  Featured Image from Unsplash.com, Chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-19T20:18:57.000Z",
    "title": "Binance Implements Stricter Compliance: Prime Brokers to Verify US Investors",
    "url": "https://www.crypto-news-flash.com/binance-implements-stricter-compliance-prime-brokers-to-verify-us-investors/?utm_source=rss&utm_medium=rss&utm_campaign=binance-implements-stricter-compliance-prime-brokers-to-verify-us-investors",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance.jpg 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance-48x27.jpg 48w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />Binance has directed prime brokers, including FalconX and Hidden Road, to gather client details to identify US investors as it looks to enhance compliance. The world&#8217;s largest cryptocurrency is still under pressure from the US after admitting to financial violations late last year. In an effort to enhance compliance, Binance has directed prime brokers, including [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-19T20:15:36.000Z",
    "title": "Cardano Surpasses Ethereum in Developer Activity: What This Means for ADA?",
    "url": "https://www.crypto-news-flash.com/cardano-surpasses-ethereum-in-developer-activity-what-this-means-for-ada/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-surpasses-ethereum-in-developer-activity-what-this-means-for-ada",
    "description": "<img width=\"1200\" height=\"799\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-02T231836.091.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-02T231836.091.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-02T231836.091-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-02T231836.091-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-02T231836.091-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-02T231836.091-450x300.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Cardano (ADA) maintains its position as the leading blockchain protocol in terms of development activity, with a notable surge in GitHub commits compared to Ethereum. Analyst Ali Martinez predicts an ADA consolidation phase followed by a breakout, potentially driving ADA&#8217;s price to $5 by the end of 2024. Cardano (ADA), a proof-of-stake (PoS) layer-1 (L1) [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-19T19:54:53.000Z",
    "title": "Ripple Recognized as Best Cross-Border Payments Platform and the Best DeFi Infrastructure Platform in 2024",
    "url": "https://www.crypto-news-flash.com/ripple-recognized-as-best-cross-border-payments-platform-and-the-best-defi-infrastructure-platform-in-2024/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-recognized-as-best-cross-border-payments-platform-and-the-best-defi-infrastructure-platform-in-2024",
    "description": "<img width=\"2133\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-chart-with-green-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple-XRP-price-chart-with-green-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-chart-with-green-background.jpg 2133w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-chart-with-green-background-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-chart-with-green-background-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-chart-with-green-background-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-chart-with-green-background-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-chart-with-green-background-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-chart-with-green-background-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-chart-with-green-background-450x253.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-price-chart-with-green-background-1200x675.jpg 1200w\" sizes=\"(max-width: 2133px) 100vw, 2133px\" />Ripple has earned another award for its role in cross-border payments. The company is making important pivots including plans to launch EVM Sidechain. Ripple Labs Inc. continues to make headlines as it bags the best cross-border payments platform and the best Decentralized Finance (DeFi) Infrastructure platform awards from the Fintech Breakthrough Awards 2024. “We&#8217;re excited [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-19T20:00:31.000Z",
    "title": "Bitcoin Gearing Up for Explosive Rallies As FOMO Greater Than Fear, According to On-Chain Analyst Willy Woo",
    "url": "https://dailyhodl.com/2024/03/19/bitcoin-gearing-up-for-explosive-rallies-as-fomo-greater-than-fear-according-to-on-chain-analyst-willy-woo/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/bitcoin-as-fomo-greater.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/bitcoin-as-fomo-greater.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/bitcoin-as-fomo-greater.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/bitcoin-as-fomo-greater.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/bitcoin-as-fomo-greater.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/bitcoin-as-fomo-greater.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/bitcoin-as-fomo-greater.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed on-chain analyst thinks that Bitcoin (BTC) is just taking a breather before rallying to fresh all-time highs. Analyst Willy Woo tells his 1 million followers on the social media platform X that the Bitcoin Risk Signal, which compares BTC&#8217;s network flows to price action, suggests that the crypto king is not yet [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/19/bitcoin-gearing-up-for-explosive-rallies-as-fomo-greater-than-fear-according-to-on-chain-analyst-willy-woo/\">Bitcoin Gearing Up for Explosive Rallies As FOMO Greater Than Fear, According to On-Chain Analyst Willy Woo</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-19T19:55:43.000Z",
    "title": "Galaxy Digital Executive Predicts ‘Steady Build’ Before Bitcoin Drives Higher to Six-Figure Price Target",
    "url": "https://dailyhodl.com/2024/03/19/galaxy-digital-executive-predicts-steady-build-before-bitcoin-drives-higher-to-six-figure-price-target/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/BTC-Can-Collapse-Fiat.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/BTC-Can-Collapse-Fiat.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/BTC-Can-Collapse-Fiat.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/BTC-Can-Collapse-Fiat.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/BTC-Can-Collapse-Fiat.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/BTC-Can-Collapse-Fiat.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/BTC-Can-Collapse-Fiat.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A top Galaxy Digital executive thinks Bitcoin (BTC) will eventually reach $100,000 and beyond this market cycle. In a new interview with CNBC, Galaxy Digital&#8217;s Global Head of Trading Jason Urban says $100,000 for BTC is within the realm of possibility. Based on Galaxy Digital CEO Mike Novogratz&#8217;s $100,000 prediction and Standard Chartered&#8217;s recent $150,000 forecast, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/19/galaxy-digital-executive-predicts-steady-build-before-bitcoin-drives-higher-to-six-figure-price-target/\">Galaxy Digital Executive Predicts ‘Steady Build’ Before Bitcoin Drives Higher to Six-Figure Price Target</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]