[
  {
    "source": "Decrypt",
    "date": "2024-02-06T02:01:02.000Z",
    "title": "Apple Vision Pro Doesn't Do VR Porn—And Users Are Already Trying to Hack It",
    "url": "https://decrypt.co/215935/apple-vision-pro-porn-vr-spatial-immersive-adult-content",
    "description": "Almost every new technology finds early adoption in adult entertainment. Apple's new headset doesn't support immersive porn experiences out of the box—but just wait."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-06T02:00:38.000Z",
    "title": "Grayscale CEO advocates for spot Bitcoin ETF options to gain approval",
    "url": "https://cryptoslate.com/grayscale-ceo-advocates-for-spot-bitcoin-etf-options-to-gain-approval/",
    "description": "<p>Grayscale CEO Michael Sonnenshein urged regulators to approve spot Bitcoin exchange-traded fund (ETF) options in a statement on Feb. 5. Sonnenshein wrote in a post on X: &#8220;&#8230; I think it’s never been more important &#8230; to advocate for the development of a robust listed options market for spot Bitcoin ETFs. Although GBTC has been [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/grayscale-ceo-advocates-for-spot-bitcoin-etf-options-to-gain-approval/\">Grayscale CEO advocates for spot Bitcoin ETF options to gain approval</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T02:04:57.000Z",
    "title": "Renowned BlockChain & Web3 Event CRYPTO EXPO DUBAI 2024 is back with its 6th Edition",
    "url": "https://www.cryptopolitan.com/renowned-blockchain-web3-event-crypto-expo-dubai-2024-is-back-with-its-6th-edition/",
    "description": "CRYPTO EXPO DUBAI, the leading global Web3 and crypto event, which will be taking place from 20-21 May 2024. Held at&#160;World Trade Centre, a leading event venue and the largest event and exhibition centre in the whole Middle East. CRYPTO EXPO DUBAI is set to welcome entrepreneurs, investors, developers, industry leaders, and global media in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T02:01:34.000Z",
    "title": "Fantom Price Prediction 2024-2033: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2024-2033 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain, solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-06T02:00:16.000Z",
    "title": "FTT Crashes 30% As FTX Relaunch Hopes Fade: Is the Dream Over?",
    "url": "https://www.newsbtc.com/ftx/ftt-crashes-30-ftx-relaunch-hopes-fade/",
    "description": "The dream of a revived FTX exchange evaporates, triggering a massive sell-off of its native token, FTT. According to Kaiko, on February 5, FTT, the now utility-free currency of the defunct exchange, plummeted over 30% last week, erasing much of its recent gains fueled by speculation of an FTX comeback.  FTX Won&#8217;t Resume Operations The worrying drop follows reports that the bankrupt exchange, once led by Sam Bankman-Fried, is unlikely to resume operations. Notably, the news comes despite a glimmer of hope for FTX customers.  At a recent court hearing, the exchange&#8217;s representatives claimed it expects to repay its users fully. However, repayments would be based on the worth of their assets during FTX&#8217;s bankruptcy.  Related Reading: Chainlink (LINK) Price Breaks Out Of Bullish Flag Pole, Here’s The Next Target It should be noted that by the time FTX went bankrupt in late 2022, crypto assets were at the last phase of a bear market, with prices plunging to multi-month lows. Bitcoin, the world&#8217;s largest crypto asset, was trading below $20,000. After FTX collapsed, prices crashed below $16,000 before bouncing back strongly.  Following a court hearing in late January, FTX lawyer Andrew Dietderich, in a now-deleted YouTube video, said the exchange wouldn&#8217;t be looking to relaunch due to the absence of buyers. For this reason, the exchange is looking at allowing creditors to obtain approvals from investors seeking repayments.  Claimants impacted, given the new conditions and trajectory the exchange plans to take, have to provide sufficient proof that they held assets in FTX before it collapsed.  This new detail raises concerns for thousands, if not hundreds of thousands, of claimants, who argue that the actual value of their assets lies at the pre-crash level. On average, Bitcoin and top coins were roughly double digits higher than the November 2022 lows. FTT Is Free Falling, Reverses November Gains For the better part of 2023, FTT prices recovered steadily. To demonstrate, since November 2023, FTT prices have risen by over 300%. The encouraging surge was fueled solely by the possibility of FTX 2.0 launching and implementing a new management model.  Related Reading: Bitcoin Price Will Skyrocket To $280,000 Next Year: Hedge Fund Manager With that hope fading, FTT appears to be facing a harsh reality check. Questions about its utility are being asked since FTT served as a critical cog in the FTX ecosystem when the exchange operated normally.  When writing on February 5, FTT changes hands at around $1.7. Looking at price charts, bears are in control, completely reversing the gains of November 2023. As it is, $0.95 remains to be a key support line.  Feature image from iStock, chart from TradingView"
  }
]