[
  {
    "source": "Cointelegraph",
    "date": "2023-11-24T09:00:16.000Z",
    "title": "Nigeria’s NITDA advocates AI integration in payments for global recognition",
    "url": "http://cointelegraph.com/news/nigeria-nitda-advocates-ai-integration-payments-global-recognition",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e1c61096-c0e9-4241-a6fa-59e7441ef2b5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>National Information Technology Development Agency chief, Kashifu Inuwa Abdullahi, said it’s crucial to take proactive measures to harness AI benefits and mitigate threats.</p>\n                    <p><p>In a bid for greater global recognition and domestic use of the Nigeria Payments System, the Director-General (DG) of the National Information Technology Development Agency (NITDA), Kashifu Inuwa Abdullahi, has stressed the importance of collaboration between NITDA, <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/central-bank-of-nigeria\">the Central Bank of Nigeria (CBN)</a> and financial institutions.  </p><p>In an interview with Cointelegraph at the CBN’s 2023 Payments System Management Departmental Retreat program, Inuwa said collaboration is necessary to leverage emerging technologies such as <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligence\">artificial intelligence (AI)</a> and Data Analytics to deepen digital payments.</p><p>The DG said financial technology (fintech) has shown it can help drive Nigeria’s performance in the industry and Environmental, Social, and Governance (ESG) sectors, especially with the application of a developmental regulation approach and enabling policies co-created by the tech ecosystem.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/c66903b7-7702-4e67-81e4-6c2a483b0ecd.jpg\"  /><figcaption style=\"text-align: center;\"><em>Image of the Director-General (DG) of the National Information Technology Development Agency (NITDA), Kashifu Inuwa Abdullahi. </em></figcaption></figure><p>Inuwa said it’s important for measures to be deliberately taken to reap the benefits and forestall the impending threats of AI and emphasized that NITDA will be working collaboratively with CBN, as with others, in regulating the AI space. He added that if CBN adopts a particular technology, the potential of such tech to move quickly is high.</p><p>Asked about Nigeria’s strategy around the opportunities and threats posed by artificial intelligence, Inuwa explained that the federal government had noted the trajectory of AI models, which have seen growth proportions shift from linear to geometrical. He added that the government had, in the previous administration, started working on an Artificial intelligence Policy through the Agency, which he said would be soon unveiled to the public.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/italian-regulators-investigate-online-ai-data-scraping\"><strong><em>Italian regulators investigate online AI data scraping</em></strong></a><strong><em><u> </u></em></strong></p><p>This AI Policy will serve as the foundation for outlining rules, and agencies like NITDA, tasked with implementation, will discuss strategies, frameworks, and guidelines for adopting and deploying artificial intelligence. Inuwa noted,</p><blockquote>“Although artificial intelligence is often regarded as a double-edged sword, the potential and benefits are tangible but not without a lot of threats, and that is apart from the biases that abound, notwithstanding, our regulatory approach has always been not to stifle innovation.,” </blockquote><p>Inuwa, while citing a list of other policies of the federal government for the industry, claimed that the initiatives are startup ecosystem-friendly.</p><p>Nigeria’s Minister of Communications, Innovation and Digital Economy, Bosun Tijani, recently unveiled the 3 Million Technical Talent (3MTT) program. This is intended to offer <a href=\"https://cointelegraph.com/news/nigeria-3mtt-program-1m-applicants-ai-course\">over one million applicants the chance to follow an introductory artificial intelligence (AI) course.</a></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/train-kickass-ai-model-sell-nfts-llms-are-largely-lying-machines-ai-eye/\"><strong><em>Train AI models to sell as NFTs, LLMs are Large Lying Machines: AI Eye</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T09:03:44.000Z",
    "title": "Cathie Wood’s Ark Invest cuts Bitcoin stake despite CEO’s high hopes",
    "url": "https://www.cryptopolitan.com/cathie-woods-ark-invest-cuts-bitcoin-stake/",
    "description": "Ark Invest, led by CEO Cathie Wood, is reportedly scaling back its Bitcoin investments. This development is particularly noteworthy given Wood&#8217;s previously stated optimistic outlook on the digital currency. Contrasting investment strategies and public statements Cathie Wood, renowned for her forward-looking financial predictions, has consistently been a strong advocate for Bitcoin. Her forecasts have frequently ... <a title=\"Cathie Wood&#8217;s Ark Invest cuts Bitcoin stake despite CEO&#8217;s high hopes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cathie-woods-ark-invest-cuts-bitcoin-stake/\" aria-label=\"More on Cathie Wood&#8217;s Ark Invest cuts Bitcoin stake despite CEO&#8217;s high hopes\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T09:02:00.000Z",
    "title": "“Elliptic Labs’ AI Virtual Proximity Sensor Revolutionizes HONOR 100 Series Smartphones”",
    "url": "https://www.cryptopolitan.com/elliptic-labs-ai-virtual-proximity-sensor-revolutionizes-honor-100-series-smartphones/",
    "description": "Elliptic Labs, a global AI software company known for its groundbreaking AI Virtual Smart Sensors, has launched its AI Virtual Proximity Sensor INNER BEAUTY on the new HONOR 100 series of smartphones for the Chinese market. This exciting development comes as Elliptic Labs continues to solidify its position as a leader in AI/ML, ultrasound, and ... <a title=\"&#8220;Elliptic Labs&#8217; AI Virtual Proximity Sensor Revolutionizes HONOR 100 Series Smartphones&#8221;\" class=\"read-more\" href=\"https://www.cryptopolitan.com/elliptic-labs-ai-virtual-proximity-sensor-revolutionizes-honor-100-series-smartphones/\" aria-label=\"More on &#8220;Elliptic Labs&#8217; AI Virtual Proximity Sensor Revolutionizes HONOR 100 Series Smartphones&#8221;\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T08:49:29.000Z",
    "title": "Zscaler Appoints Top Tech Innovators to Drive AI Advancements in Cloud Security",
    "url": "https://www.cryptopolitan.com/zscaler-appoints-top-tech-innovators-to-drive-ai-advancements-in-cloud-security/",
    "description": "Zscaler, Inc., a renowned leader in cloud security, is strengthening its commitment to advancing Artificial Intelligence (AI) by welcoming two prominent tech industry disruptors to its executive team. In a strategic move to fortify its Zero Trust Exchange cloud security platform, Claudionor Coelho Jr. has been appointed as Chief AI Officer, while Mohamed Shabar joins ... <a title=\"Zscaler Appoints Top Tech Innovators to Drive AI Advancements in Cloud Security\" class=\"read-more\" href=\"https://www.cryptopolitan.com/zscaler-appoints-top-tech-innovators-to-drive-ai-advancements-in-cloud-security/\" aria-label=\"More on Zscaler Appoints Top Tech Innovators to Drive AI Advancements in Cloud Security\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-24T08:57:09.000Z",
    "title": "British investment funds get go-ahead to launch blockchain-based tokenized assets",
    "url": "https://crypto.news/british-investment-funds-get-go-ahead-to-launch-blockchain-based-tokenized-assets/",
    "description": "With the latest move, the U.K. hopes to bolster liquidity in its asset management market. British investment managers have received an approval to develop tokenized funds with the help of blockchain technology as the country seeks to benefit from the&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-24T08:42:36.000Z",
    "title": "Unprecedented crypto bull run on the horizon: analyst",
    "url": "https://crypto.news/unprecedented-crypto-bull-run-on-the-horizon-analyst/",
    "description": "The king is dead, long live the king! Crypto analyst declares the end of the CZ era ushers in the biggest bull run yet."
  }
]