[
  {
    "source": "CryptoSlate",
    "date": "2023-12-08T16:40:54.000Z",
    "title": "VanEck embraces crypto culture with ‘HODL’ ticker for proposed Bitcoin ETF",
    "url": "https://cryptoslate.com/vaneck-embraces-crypto-culture-with-hodl-ticker-for-proposed-bitcoin-etf/",
    "description": "<p>Asset managers Fidelity and VanEck have unveiled their tickers for their spot Bitcoin (BTC) Exchange-Traded Fund (ETF) applications with the U.S. Securities and Exchange Commission (SEC). VanEck chooses HODL VanEck revealed the ticker for its Bitcoin ETF to be &#8220;HODL,&#8221; according to an updated filing submitted with the SEC. VanEck&#8217;s HODL ticker choice is a [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/vaneck-embraces-crypto-culture-with-hodl-ticker-for-proposed-bitcoin-etf/\">VanEck embraces crypto culture with &#8216;HODL&#8217; ticker for proposed Bitcoin ETF</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-08T17:04:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-08T17:00:26.000Z",
    "title": "Binance Founder Ordered To Stay Put In The US In Ongoing Probe",
    "url": "https://www.newsbtc.com/binance/binance-ex-ceo-ordered-to-stay-put-in-the-us-in-ongoing-probe/",
    "description": "Binance Co-founder and former Chief Executive Officer (CEO) Changpeng CZ Zhao, has been confined to remain in the United States in advance of his sentencing expected to take place next year. Former Binance CEO No Longer Leaving The US The Binance co-founder has been ordered by US District Judge Richard Jones to remain in the country in a ruling on Thursday. Zhao was instructed to stay in the US due to the significance of his recent guilty plea. The ruling read: As relief, the government requests that Mr. Zhao be required to remain in the continental United States in the period between his plea and sentencing. The Thursday ruling reversed an earlier decision that would have allowed Zhao to return to the United Arab Emirates (UAE). Jones acknowledged in his decision the arguments provided by Zhao, which ordinarily would result in the government&#8217;s motion being denied.  Related Reading: Crypto Market Reacts: Binance CEO Changpeng Zhao Steps Down However, Jones highlighted the distinctive features of Zhao&#8217;s case. These include his riches, the absence of an extradition treaty with the UAE, and Zhao’s family living in the UAE. Furthermore, the judge also highlighted that Zhao poses a flight risk if he were allowed to return to the UAE. This is due to the former CEO&#8217;s substantial assets and the meager connections he has to the United States. Additionally, knowing that the Binance ex-CEO faces a potential 18-month sentence in prison also sparks a possible flight risk. Jones asserted that Zhao is asking for a lesser sentence, which might lead to 18 months of incarceration as indicated by the government. The judge stated that despite promises that CZ wouldn&#8217;t flee if permitted to travel to the UAE, the court wasn&#8217;t convinced. This led to the order that he should remain in the US until his sentencing on February 23, 2024. So far, the court stated in the ruling that its decision is not based on Zhao&#8217;s citizenship and alienage. &#8220;The risk of the defendant not showing up is posed by the circumstances surrounding their combined facts,&#8221; the court said. Changpeng &#8220;CZ&#8221; Zhao&#8217;s Guilty Plea Last Month, the former Binance CEO pleaded guilty and stepped down from the cryptocurrency exchange he founded about 6 years ago. Zhao&#8217;s plea to one count of violating the Bank Secrecy Act was formally accepted by Judge Jones. Related Reading: Binance Compliance Officer Under Scrutiny For FTX, Gemini, And Sex Trafficker Associations Jones accepted the plea after a thorough consideration report and recommendation of the United States Magistrate Judge which found him guilty. Jones wrote: This Court, having considered the Report and Recommendation of the United States Magistrate Judge, to which there has been no timely objection, hereby accepts the plea of guilty of the defendant. His plea was accepted just over two weeks after both he and Binance acknowledged a number of criminal and civil charges. These include failure to maintain an appropriate anti-money laundering program, running an unlicensed money transfer business, and violation of sanctions law. Featured image by Shutterstock, chart by Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-08T16:50:59.000Z",
    "title": "Record-Breaking NFT Sale: Early Bitcoin Ordinals Art Fetches $450,000",
    "url": "https://www.crypto-news-flash.com/record-breaking-nft-sale-early-bitcoin-ordinals-art-fetches-450000/?utm_source=rss&utm_medium=rss&utm_campaign=record-breaking-nft-sale-early-bitcoin-ordinals-art-fetches-450000",
    "description": "<img width=\"877\" height=\"590\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/NFT.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/NFT.jpg 877w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/NFT-300x202.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/NFT-104x69.jpg 104w\" sizes=\"(max-width: 877px) 100vw, 877px\" />Ordinals inscription number 8, which hails from the Honey Badger collection, fetched 10.4 BTC, which equates to over $450,000 on NFT marketplace Magic Eden on Thursday. The NFT, which was purchased by an anonymous buyer who goes by &#8220;OG General&#8221; on X, was minted on January 5 and its sale shows how far Bitcoin Ordinals [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-08T16:50:00.000Z",
    "title": "US Lawmakers Introduce Bill to Counter Crypto Use in Terror Funding",
    "url": "https://coinedition.com/us-lawmakers-introduce-bill-to-counter-crypto-use-in-terror-funding/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Blockchain-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Lawmakers in the United States on Thursday introduced bipartisan legislation to combat the use of cryptocurrency for terrorism funding as part of a broader proposal to tighten regulatory actions against terror groups.&#160; Indeed, the legislation titled the Terrorism Financing Prevention Act, driven by the Hamas October 7 attacks on Israel, was sponsored by U.S. Senators [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/us-lawmakers-introduce-bill-to-counter-crypto-use-in-terror-funding/\">US Lawmakers Introduce Bill to Counter Crypto Use in Terror Funding</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]