[
  {
    "source": "Cointelegraph",
    "date": "2023-08-11T02:26:01.000Z",
    "title": "Robinhood beats investors’ appeal in GameStop meme stock case",
    "url": "https://cointelegraph.com/news/robinhood-defeat-appeal-in-meme-stock-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/837515f6-1896-48d6-86a2-a04ba88c5e61.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The appeals court judge said Robinhood “had the right” to impose restrictions on meme trade purchases. </p>\n                    <p><p>A United States federal appeals court has upheld a decision to dismiss an investor class action lawsuit against online brokerage firm Robinhood Markets over its <a href=\"https://cointelegraph.com/news/rob-from-the-poor-and-give-to-the-rich-robinhood-prompts-furious-backlash-after-restricting-trades\">meme stock trading debacle</a> in early 2021. </p><p>A total of 16 investors took part in a class action lawsuit <a href=\"https://cointelegraph.com/news/robinhood-ordeal-shows-broken-system-and-importance-of-regulation-crypto-industry-execs-say\">against the trading platform</a> in September 2021, alleging the firm restricted them from purchasing 13 “meme stocks” when hedge funds were being short squeezed in January 2021. </p><p>This stopped them reaping the profits and also caused the share prices of these stocks to plummet, they alleged. </p><p>Robinhood won a motion to dismiss the complaint in January 2022, citing the plaintiff's failure to state a claim, plaintiffs then went on to argue the decision in the U.S. appeals court in March 2023. </p><p>However,  it appears the investors have hit another setback as the appeals judge has <a href=\"https://www.courthousenews.com/wp-content/uploads/2023/08/Juncadelia-v-Robinhood-order-11th-circuit.pdf\" target=\"_blank\" rel=\"noopener nofollow\">upheld</a> the decision to dismiss the lawsuit, with U.S. Appellate Court Judge Britt Grant saying the arguments lacked legal merit. </p><p>She explained that Robinhood “had the right to do exactly what they did” because they were not legally obligated to protect these investors from pure economic loss. </p><p>This is because Robinhood was, and still is legally permitted to restrict its customers’ ability to trade securities and to refuse to accept any of their transactions, Judge Grant added.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/1eabb18e-af9f-4ef0-a7ef-ef0fc8660f86.png\"  /><figcaption style=\"text-align: center;\"><em>The U.S. Appellate Court’s concluding remarks, affirming the lower court’s decision to dismiss the plaintiff’s case.</em></figcaption></figure><p>If the investors decide to pursue the matter further, their next and final route will be through the U.S. Supreme Court — the highest court in the U.S. However, they will need to file a petition for a  \"writ of certiorari,\" which is a document asking the Supreme Court to review the case. </p><p>The Supreme Court takes on about 100-150 cases from over 7,000 reviews, so the plaintiff’s chances of having its case heard once more are likely slim.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/robinhood-turns-profitable-in-q2-but-crypto-revenue-declines\"><strong><em>Robinhood turns profitable in Q2, but crypto revenue declines </em></strong></a></p><p>The GameStop short squeeze happened in January 2021, which was initially triggered by users of the /wallstreetbets subreddit. </p><p>The strategy of the short squeeze was to cause big losses for Wall Street firms shorting these particular stocks, and by doing so, profiting themselves.</p><p>Another 12 stocks became part of the frenzy, including AMC Entertainment, American Airlines Group, Blackberry, Bed, Bath &amp; Beyond, and Trivago. </p><p>GameStop stocks were however one of the largest gainers of the Reddit-fueled price pump, increasing over 9,900% from $0.86 to over $86 between Apr. 2020 and Jan. 2021, <a href=\"https://www.macrotrends.net/stocks/charts/GME/gamestop/stock-price-history\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Macrotrends.net.</p><p><strong><em>Magazine</em></strong><strong><em>: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\"><strong><em>Blockchain games aren’t really decentralized… but that’s about to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-11T02:30:33.000Z",
    "title": "Navigating the World of Crypto with Paybis: An In-Depth Exchange Review",
    "url": "https://cryptoslate.com/navigating-the-world-of-crypto-with-paybis-an-in-depth-exchange-review/",
    "description": "<p>Founded in 2014, Paybis started as a side project but quickly became a significant global crypto player. The first crypto exchange transaction occurred in 2015, with support for credit cards added the following year, leading to widespread approval. Fast forward to 2023, Paybis has grown to a team of over 100 people from various parts [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/navigating-the-world-of-crypto-with-paybis-an-in-depth-exchange-review/\">Navigating the World of Crypto with Paybis: An In-Depth Exchange Review</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  }
]