[
  {
    "source": "CoinDesk",
    "date": "2024-02-22T21:25:43.000Z",
    "title": "Protocol Village: Research Paper Details 'Snarktor,' Featuring 'Recursive Proof Aggregation'",
    "url": "https://www.coindesk.com/tech/2024/02/21/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Feb. 22-28."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-22T21:26:24.000Z",
    "title": " OCC acting head compares crypto-asset intermediaries to corrupt bank ",
    "url": "https://cointelegraph.com/news/occ-acting-head-compares-crypto-asset-intermediaries-corrupt-bank",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMWIwYmE5NjQtMGQ0NC00NDYxLWFkMzQtNWE5ZDhmMjM5NDU3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Michael Hsu urged international cooperation and collaboration in a bid to prevent crypto firms from leveraging competition among jurisdictions. </p>\n                    <p><p>The Financial Stability Board (FSB) Crypto Working Group met on Feb. 22. United States Acting Comptroller of the Currency Michael Hsu gave opening remarks at the meeting and shared thoughts on cooperation and collaboration in global supervisory activities.</p><p>Hsu devoted much of his short talk to the Bank of Credit and Commerce International (BCCI), an international bank that closed in 1991 after a seven-country operation against its money laundering and other financial crimes. Before its closure, BCCI had offices in over 72 countries. Hsu said:</p><p>Like BCCI, FTX had no single supervisor and its parent holding company was not subject to regulation in the jurisdiction where it was chartered. The collapse of BCCI led to enhanced supervision of international banks, Hsu said. In the United States, the Foreign Bank Supervision Enhancement Act (FBSEA) was one of the resulting enhancements. </p><p><a href=\"https://cointelegraph.com/news/occ-acting-head-compares-crypto-asset-intermediaries-corrupt-bank\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-22T21:23:08.000Z",
    "title": "Reddit IPO filing reveals treasury exposure to Bitcoin, Ethereum",
    "url": "https://cryptoslate.com/reddit-ipo-filing-reveals-treasury-exposure-to-bitcoin-ethereum/",
    "description": "<p>Social media giant Reddit has been quietly buying Bitcoin and Ethereum with some of its excess cash and holds an undisclosed amount of the two tokens in its treasury for investment purposes. The social media giant&#8217;s crypto exposure details were revealed in its initial public offering (IPO) prospectus, which was filed with the SEC on [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/reddit-ipo-filing-reveals-treasury-exposure-to-bitcoin-ethereum/\">Reddit IPO filing reveals treasury exposure to Bitcoin, Ethereum</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NullTX",
    "date": "2024-02-22T21:11:23.000Z",
    "title": "Polygon (MATIC) and Render Token (RNDR) Prices Soar As Meme Moguls (MGLS) Raises Nearly $2.5M in Presale Frenzy",
    "url": "https://nulltx.com/polygon-matic-and-render-token-rndr-prices-soar-as-meme-moguls-mgls-raises-nearly-2-5m-in-presale-frenzy/",
    "description": "In the current meme coin market, the hottest topic is Meme Moguls (MGLS) and its stellar presale performance. This Stage 5 presale star has already obtained close to $2.5M while also being pegged as the next 100x meme coin in 2024. Meanwhile, Polygon (MATIC) and Render Token (RNDR) also show [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-22T21:30:00.000Z",
    "title": "Filecoin rally as MetaClip presale gains, Chainlink choppy",
    "url": "https://crypto.news/filecoin-rally-as-metaclip-presale-gains-chainlink-choppy/",
    "description": "MetaClip is firm in the ongoing presale while Filecoin is rallying. Chainlink is struggling for gains"
  }
]