[
  {
    "source": "CoinDesk",
    "date": "2023-09-07T17:45:00.000Z",
    "title": "CFTC Commissioner Pitches Pilot Program for U.S. Crypto Regulation",
    "url": "https://www.coindesk.com/policy/2023/09/07/cftc-commissioner-pitches-pilot-program-for-us-crypto-regulation/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. watchdog for derivatives markets should create a limited pilot program for regulating cryptocurrencies, said Caroline Pham, one of the members of the Commodity Futures Trading Commission (CFTC)."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-07T18:01:02.000Z",
    "title": "NFL All Day Has Fumbled: NFT Sales Down 87% From a Year Ago",
    "url": "https://decrypt.co/155347/nfl-all-day-has-fumbled-nft-sales-down-87-from-a-year-ago",
    "description": "Dapper Labs may be hoping for a Hail Marry as NFL All Day’s sales flounder compared to its 2022 football preseason rally."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-07T17:43:33.000Z",
    "title": "Bitcoin Witnesses Second-Highest Daily Ordinal Inscription Count as Inscriptions Near 30 Million",
    "url": "https://news.bitcoin.com/bitcoin-witnesses-second-highest-daily-ordinal-inscription-count-as-inscriptions-near-30-million/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/ords-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Witnesses Second-Highest Daily Ordinal Inscription Count as Inscriptions Near 30 Million\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/ords-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ords-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ords-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ords-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ords-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ords-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ords.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />While Bitcoin-based nonfungible token (NFT) sales have declined, and the network has dropped to seventh out of 23 blockchains in sales this past month, Ordinal inscriptions continue unabated. The number of inscriptions linked to the Bitcoin blockchain is nearing 30 million. On September 3, a record 418,240 inscriptions were minted, marking the second-highest daily rate [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-07T18:03:42.000Z",
    "title": "CryptoWallet aims to simplify crypto transactions",
    "url": "https://crypto.news/cryptowallet-aims-to-simplify-crypto-transactions/",
    "description": "CryptoWallet seeks to alleviate crypto’s rigidity as a functional currency"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-07T17:48:44.000Z",
    "title": "Crypto whale losses over $24m in phishing scam",
    "url": "https://crypto.news/crypto-whale-losses-over-24m-in-phishing-scam/",
    "description": "Crypto whale has lost over $24 in rETH and stETH in a phishing attack"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-07T17:46:10.000Z",
    "title": "Make Or Break: Bitcoin Fate Hangs On The Edge Of The 200-Week EMA",
    "url": "https://www.newsbtc.com/bitcoin-news/make-or-break-bitcoin-fate-hangs-on-the-edge-of-the-200-week-ema/",
    "description": "Bitcoin (BTC) has officially dipped below the $26,000 level and is currently trading at $25,800, which coincides with its 200-week Exponential Moving Average (EMA). This EMA has served as a crucial support level, as it played a role in Bitcoin&#8217;s rebound on June 15, leading to its yearly high of $31,800. Bitcoin Consolidation Conundrum The current situation appears to be slightly different for BTC. On the one hand, Bitcoin has been experiencing an extended consolidation phase just above this significant level for over seven days.  Related Reading: Chainlink Price Prediction For September: Buy LINK Now? More concerning is that the cryptocurrency has been forming lower lows during this consolidation, indicating a downward pressure trend. Moreover, during Bitcoin&#8217;s rally on June 15, it had the advantage of holding its key 200-day Moving Average (MA), which has been influential in determining its prospects and upward gains. However, this same moving average presents a potential hurdle for BTC, acting as a resistance at the $27,100 level, potentially impeding a recovery rebound. As highlighted by crypto market analyst Michael Van De Poppe, the crucial question is whether Bitcoin will maintain its position above the 200-week EMA. Abnormally Low Trading Volume In Spot Market Raises Concerns On this matter, CryptoQuant author and crypto analyst Maartunn has identified an intriguing phenomenon in the BTC market that may shed light on the cryptocurrency&#8217;s recent stagnant state and low volatility.  Maartunn has observed an abnormal pattern: the trading volume in the Bitcoin-spot market has reached its lowest level since 2017. This finding has significant implications for understanding the dynamics of BTC&#8217;s price and market behavior. The Bitcoin spot market plays a crucial role in the cryptocurrency ecosystem. It is where investors and traders buy and sell actual Bitcoins for immediate delivery instead of derivative products or futures contracts.  Spot market trading volume reflects the level of participant activity and liquidity in the market, providing insights into the supply and demand dynamics of Bitcoin. The unusually low trading volume in the BTC-spot market suggests decreased market activity and engagement among traders.  This lack of participation can contribute to stagnation and low volatility in BTC&#8217;s price. With fewer buyers and sellers entering the market, there may be limited price movement and a reduced likelihood of significant price swings. Such conditions can have implications for investors and traders. Low volatility may discourage short-term speculative trading strategies as the potential for quick profits diminishes.  Additionally, it may indicate a lack of market confidence or uncertainty among participants, leading to a cautious approach and potential hesitation in making significant investment decisions. Monumental First Half Of 2024 For BTC? According to crypto analyst Miles Deutscher, the first half of 2024 is shaping to be a monumental period for the cryptocurrency market. Several key events and deadlines are anticipated during this timeframe, which could profoundly impact the industry and its major players. Starting in January through March, the spotlight will be on Bitcoin as the final deadline for approving the Bitcoin spot exchange-traded funds (ETFs) approach.  The crypto community has long awaited the introduction of a Bitcoin ETF as it could potentially open the doors for broader institutional participation and investment in the digital asset. In May, another highly anticipated event is the Bitcoin halving. This recurring event, which occurs approximately every four years, reduces the rate at which new Bitcoins are generated.  Related Reading: XRP Bulls On The Horizon: Could A Breakout Push Prices Above $0.6? In June, the focus shifted to the Federal Reserve (FED) and its potential decision to cut interest rates. While market pricing currently suggests the likelihood of a rate cut, such a move could have implications for the broader financial landscape, including the cryptocurrency market.  Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-07T18:02:13.000Z",
    "title": "Crypto on the Edge: Bitcoin’s $25K Battle and Ethereum’s ETF Ascent",
    "url": "https://www.crypto-news-flash.com/crypto-on-the-edge-bitcoins-25k-battle-and-ethereums-etf-ascent/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-on-the-edge-bitcoins-25k-battle-and-ethereums-etf-ascent",
    "description": "<img width=\"1000\" height=\"689\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wot-Olszweski-4-Ethereum.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wot-Olszweski-4-Ethereum.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wot-Olszweski-4-Ethereum-300x207.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wot-Olszweski-4-Ethereum-768x529.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wot-Olszweski-4-Ethereum-668x460.jpg 668w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The crypto market led by Bitcoin (BTC) and Ethereum (ETH) has reacted to news of the first Ethereum spot ETF. The last quarter of the year could see the approval of a Bitcoin spot ETF and an Ethereum futures ETF. Following news of an Ethereum spot ETF filing, the crypto market has enjoyed positive sentiments. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-07T18:00:12.000Z",
    "title": "Buterin Liquidates 500 Maker (MKR) Tokens, Experts Recommend VC Spectra and Tron (TRX)",
    "url": "https://www.crypto-news-flash.com/buterin-liquidates-500-maker-mkr-tokens-experts-recommend-vc-spectra-and-tron-trx/?utm_source=rss&utm_medium=rss&utm_campaign=buterin-liquidates-500-maker-mkr-tokens-experts-recommend-vc-spectra-and-tron-trx",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-07T164201.363.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-07T164201.363.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-07T164201.363-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Maker (MKR) considering a move to the Solana blockchain hasn&#8217;t received a warm response from Ethereum&#8217;s co-founder. Meanwhile, Tron (TRX) is gearing up for a significant rally following support from a Chinese court. However, VC Spectra (SPCT) remains the best crypto to buy, according to experts, due to its exceptional performance in the public presale. [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-07T18:05:05.000Z",
    "title": "Crypto Could Be Among the Worst-Performing Assets in Coming Years, Warns Nicholas Merten – Here’s Why",
    "url": "https://dailyhodl.com/2023/09/07/crypto-could-be-among-the-worst-performing-assets-in-coming-years-warns-nicholas-merten-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/02/watchdog-warning-crypto-assets.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/02/watchdog-warning-crypto-assets.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/02/watchdog-warning-crypto-assets.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/02/watchdog-warning-crypto-assets.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/02/watchdog-warning-crypto-assets.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/02/watchdog-warning-crypto-assets.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/02/watchdog-warning-crypto-assets.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is warning that big tech stocks and digital assets could perform poorly for years to come. In a new strategy session, DataDash host Nicholas Merten tells his 512,000 YouTube subscribers that tech giants and crypto assets, including Bitcoin (BTC), could put up lackluster gains over the next several years. “One [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/07/crypto-could-be-among-the-worst-performing-assets-in-coming-years-warns-nicholas-merten-heres-why/\">Crypto Could Be Among the Worst-Performing Assets in Coming Years, Warns Nicholas Merten – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]