[
  {
    "source": "CoinDesk",
    "date": "2023-08-14T16:25:21.000Z",
    "title": "Crypto’s Theater Is Becoming More Surreal",
    "url": "https://www.coindesk.com/consensus-magazine/2023/08/14/cryptos-theater-is-becoming-more-surreal/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Decentralization theater, governance theater, community theater. Web3 promised a revolution, but, mostly, the innovation is all for show, says Cami Russo, the founder of The Defiant."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-14T16:15:00.000Z",
    "title": "Amazon Partners with Ripple, Will Use XRP for Payments",
    "url": "https://cryptodaily.co.uk/2023/08/amazon-partners-with-ripple-will-use-xrp-for-payments",
    "description": "<p>E-commerce giant Amazon joined forces with RippleNet to enable fast and cost-efficient transactions via the use of XRP.</p>\nRipple Is Now on the List of Amazon&rsquo;s Partners\n<p>On Monday, August 14, the world&rsquo;s largest online retailer Amazon confirmed its strategic partnership with a prominent blockchain company RippleNet. According to the statement, Amazon will use Ripple&rsquo;s native XRP token for digital payments to enable smooth, speedy, and reasonably-priced transactions.</p>\n<p>Amazon has highlighted three key Ripple&rsquo;s products on the AWS Partner Profile. First of all, the page described xCurrent, Ripple&rsquo;s software solution that allows to process cross-border real-time payments efficiently and at lower costs:</p>\n\n<p>&ldquo;The solution is specifically designed to meet the needs of banks by fitting within their existing risk, compliance,and information security frameworks.&rdquo;</p>\n\n<p>Secondly, Amazon emphasized xRapid, Ripple&rsquo;s solution for sourcing on-demand liquidity and minimizing its costs:</p>\n\n<p>&ldquo;xRapid uniquely uses a digital asset, XRP, to offer on-demand liquidity, which lowers costs while enabling real-time payments in emerging markets. Built for enterprise use, XRP offers banks and payment providers an efficient, scalable, reliable liquidity option to service cross-border payments.&rdquo;</p>\n\n<p>Finally, the e-commerce titan endorsed Ripple&rsquo;s xVia, API which enables global payments with just a single integration:</p>\n\n<p>&ldquo;xVia's simple API requires no software installation and enables users to send payments globally with transparency into the payment status and with rich information, like invoices, attached.&rdquo;</p>\n\n<p>Additionally, Amazon&rsquo;s announcement provided examples of Ripple&rsquo;s commercial use cases for banks, payment providers, exchanges, and corporates:</p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\">\n&ldquo;e-Invoicing\n</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">\nInternational supply chain payments\n</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">\nGlobal currency account\n</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">\nReal-time cashpooling\n</li>\n</ul>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\">\nInternational bill pay\n</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">\nReal-time remittances and international P2P payments&rdquo;\n</li>\n</ul>\nWhat Does it Mean for Ripple and Crypto Industry In General?&nbsp;\n<p>The Ripple-Amazon collaboration is a groundbreaking move which marks the first time a cryptocurrency is integrated into a major retailer system. Undoubtedly, this partnership also signifies a step towards global crypto adoption and might potentially revolutionize the way global e-commerce works. If the collaboration is successful, Amazon could set an example for other retailers to follow suit and integrate cryptocurrencies into their systems as well.</p>\n<p>As for Ripple, becoming partners with Amazon definitely adds up to the blockchain company&rsquo;s recognition and strengthens its position as one of the leading crypto platforms across the market. The new collaboration aligns with Ripple's mission to &ldquo;build breakthrough crypto solutions for a world without economic borders&rdquo;.</p>\nXRP Reacts to the News\n<p>Following the announcement, the price of Ripple&rsquo;s native token soared and briefly reached $0.637 before pulling back shortly after. At the moment of writing, XRP is hovering at $0.631.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T16:16:20.000Z",
    "title": "Coinbase enters the Canadian crypto market with People’s Trust Company partnership",
    "url": "https://www.cryptopolitan.com/coinbase-enters-the-canadian-crypto-market-with-peoples-trust-company-partnership/",
    "description": "Coinbase announced its entry into the Canadian cryptocurrency market on August 14th. This decision follows strategic cooperation with People&#8217;s Trust Company. Notably, this firm is a subsidiary of the well-known People&#8217;s Group. As a result, our collaboration will include Interac payment rails. As a result, Coinbase clients in Canada will find it easier to deposit ... <a title=\"Coinbase enters the Canadian crypto market with People&#8217;s Trust Company partnership\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-enters-the-canadian-crypto-market-with-peoples-trust-company-partnership/\" aria-label=\"More on Coinbase enters the Canadian crypto market with People&#8217;s Trust Company partnership\">Read more</a>"
  },
  {
    "source": "Kraken Blog",
    "date": "2023-08-14T16:10:14.000Z",
    "title": "Kraken’s story in Canada",
    "url": "https://blog.kraken.com/news/krakens-story-in-canada",
    "description": "Now more than ever, Kraken remains deeply committed to Canada. But our commitment to the Great White North isn&#8217;t just hype. It&#8217;s a relationship that stretches back to the earliest days of Bitcoin itself. The early years Kraken&#8217;s Canada story begins in 2011 – the year CaVirtEx, an early Canadian crypto trading platform based in [&#8230;]"
  }
]