[
  {
    "source": "Cointelegraph",
    "date": "2023-12-18T04:57:32.000Z",
    "title": " What happened in crypto this weekend? ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-on-the-weekend",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDgvNDljZTRmMTMtNTA1My00MTk3LTg0MmYtNTMwMTIyYTZiODYwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Tether is working closer with U.S. law enforcement, revealing it has already frozen 326 wallets linked to criminals, while VanEck CEO has pled a bullish case for the future of Bitcoin.</p>\n                    <p><p>Stablecoin issuer Tether <a href=\"https://cointelegraph.com/tether-price-index\">(USDT)</a> has revealed it has <a href=\"https://cointelegraph.com/news/tether-responds-us-lawmakers-calls-doj-action\">frozen 326 wallets</a> linked to criminals, totaling $435 million as of Dec. 15, and is working closer with U.S. law enforcement agencies than ever before.</p><p>“We have assisted in freezing, as of the date of this letter, approximately 326 wallets totaling approximately USDT 435 Million,” the firm’s CEO Paolo Ardoino explained to Senator Cynthia Lummis and U.S. Representative French Hill on Dec. 15.</p><p>Tether said it also onboarded the United States Secret Service into its platform to strengthen its compliance measures with U.S. law enforcement and is in the same process with the FBI.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-on-the-weekend\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-18T04:48:37.000Z",
    "title": "Ethereum Price Key Indicators Suggest Strong Case For Correction Below $2K",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-correction-2k/",
    "description": "Ethereum price is again moving lower below the $2,200 support. ETH is showing a few bearish signs and might decline further below $2,000. Ethereum started a fresh decline from the $2,330 resistance zone. The price is trading below $2,220 and the 100-hourly Simple Moving Average. There is a connecting bearish trend line forming with resistance near $2,210 on the hourly chart of ETH/USD (data feed via Kraken). The pair could accelerate lower if there is a break below the $2,135 support. Ethereum Price Dips Again Ethereum price failed to gain strength for more gains above the $2,300 resistance. ETH peaked near the $2,330 zone and started a fresh decline, like Bitcoin. There was a move below the $2,250 and $2,220 levels. The price even dropped below the 50% Fib retracement level of the key increase from the $1,980 swing low to the $2,330 high. The bears are now in control below the $2,180 support zone. Ethereum is trading below $2,220 and the 100-hourly Simple Moving Average. There is also a connecting bearish trend line forming with resistance near $2,210 on the hourly chart of ETH/USD. If there is a fresh increase, the price could face resistance near the $2,200 zone. The next key resistance is near the $2,210 level and the trend line. The main resistance is now at $2,250. A clear move above the $2,250 zone could send the price toward the $2,330 level. Source: ETHUSD on TradingView.com The next resistance sits at $2,400. Any more gains could start a wave toward the $2,550 level, above which Ethereum might rally and test the $2,750 zone. More Losses in ETH? If Ethereum fails to clear the $2,210 resistance, it could continue to move down. Initial support on the downside is near the $2,135 level or the last swing low. The first key support could be the $2,080 zone. It is close to the 1.236 Fib extension level of the key increase from the $1,980 swing low to the $2,330 high. A downside break below $2,080 might start another major decline. In the stated case, Ether could even decline below the $2,000 support. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $2,135 Major Resistance Level – $2,210"
  }
]