[
  {
    "source": "CoinDesk",
    "date": "2023-12-06T10:44:35.000Z",
    "title": "Over $600M Locked in Open Dogecoin Futures as DOGE Price Hits Highest Since April",
    "url": "https://www.coindesk.com/markets/2023/12/06/over-600m-locked-in-open-dogecoin-futures-as-doge-price-hits-highest-since-april/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A rise in open interest alongside a rise in price is said to confirm an uptrend."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-06T10:46:30.000Z",
    "title": "Bitcoin developer’s ‘bug’ claim triggers ORDI token brief dip below $50",
    "url": "https://cryptoslate.com/bitcoin-developers-bug-claim-triggers-ordi-token-breif-dip-below-50/",
    "description": "<p>Bitcoin (BTC)-based Ordinals (ORDI) price briefly fell under $50 after renowned BTC core developer Luke Dashjr described Inscriptions as bugs on the blockchain network that must be fixed. In a Dec. 6 post on social media platform X, Dashjr said inscriptions&#8217; were exploiting a vulnerability in Bitcoin Core to spam the blockchain. Ordinal Inscriptions are [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-developers-bug-claim-triggers-ordi-token-breif-dip-below-50/\">Bitcoin developer&#8217;s &#8216;bug&#8217; claim triggers ORDI token brief dip below $50</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-06T11:05:45.000Z",
    "title": "Bitcoin breaks bull flag - $48,000 next move?",
    "url": "https://cryptodaily.co.uk/2023/12/bitcoin-breaks-bull-flag-48000-next-move",
    "description": "Bitcoin is moving up steadily, breaking all resistances as it goes. With $44,000 looking to become support, bitcoin bulls will have their eyes set on the prize of $48,000."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-06T10:46:33.000Z",
    "title": "ProBit Global Launches Montage Token Presale: Pioneering Secure Trading and Community Empowerment",
    "url": "https://cryptodaily.co.uk/2023/12/probit-global-launches-montage-token-presale-pioneering-secure-trading-and-community-empowerment",
    "description": "ProBit Global Launches Montage Token Presale: Pioneering Secure Trading and Community Empowerment"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T10:57:40.000Z",
    "title": "Investors Turn to AI Amidst Challenging Startup Funding Landscape",
    "url": "https://www.cryptopolitan.com/investors-turn-to-ai-amidst/",
    "description": "As the startup funding landscape faces increasing challenges due to geopolitical tensions, rising interest rates, and macroeconomic headwinds, investors increasingly focus on opportunities in artificial intelligence (AI) technologies. This shift in focus was discussed by prominent Asian venture capitalists Hian Goh of Openspace, David Gowdey of Jungle Ventures, and Yinglan Tan of Insignia Ventures Partners ... <a title=\"Investors Turn to AI Amidst Challenging Startup Funding Landscape\" class=\"read-more\" href=\"https://www.cryptopolitan.com/investors-turn-to-ai-amidst/\" aria-label=\"More on Investors Turn to AI Amidst Challenging Startup Funding Landscape\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T10:52:42.000Z",
    "title": "Baldur’s Gate 3: A Statistical Insight into Player Choices and Gameplay Trends",
    "url": "https://www.cryptopolitan.com/baldurs-gate-3-a-statistical-insight/",
    "description": "Game enthusiasts around the world have embraced Baldur&#8217;s Gate 3 with remarkable enthusiasm, as indicated by recent statistics released by Larian Studios. The game, set in the Dungeons &#38; Dragons fantasy world, has seen an impressive 1.3 million players completing their quests since its release on August 3. Player choices: Avatars and romance arcs Baldur&#8217;s ... <a title=\"Baldur&#8217;s Gate 3: A Statistical Insight into Player Choices and Gameplay Trends\" class=\"read-more\" href=\"https://www.cryptopolitan.com/baldurs-gate-3-a-statistical-insight/\" aria-label=\"More on Baldur&#8217;s Gate 3: A Statistical Insight into Player Choices and Gameplay Trends\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T10:46:36.000Z",
    "title": "ProBit Global Launches Montage Token Presale: Pioneering Secure Trading and Community Empowerment",
    "url": "https://www.cryptopolitan.com/probit-global-launches-montage-token-presale-pioneering-secure-trading-and-community-empowerment/",
    "description": "Vilnius, Lithuania, December 6th, 2023, Chainwire ProBit Global is proud to announce the third and final round of the token presale for Montage Token (MTGX), taking place from December 8, 2023, 03:00 UTC to December 18, 2023, 03:00 UTC. This partnership marks a monumental step towards reshaping the crypto trading landscape ahead of the upcoming ... <a title=\"ProBit Global Launches Montage Token Presale: Pioneering Secure Trading and Community Empowerment\" class=\"read-more\" href=\"https://www.cryptopolitan.com/probit-global-launches-montage-token-presale-pioneering-secure-trading-and-community-empowerment/\" aria-label=\"More on ProBit Global Launches Montage Token Presale: Pioneering Secure Trading and Community Empowerment\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-06T11:07:28.000Z",
    "title": "PancakeSwap unveils November burn report, CAKE jumps 6.7%",
    "url": "https://crypto.news/pancakeswap-unveils-november-burn-report-cake-jumps-6-7/",
    "description": "In its latest burn report, PancakeSwap revealed it had burned 0.089% of the CAKE total supply, achieving a negative net in November 2023. According to a blog announcement, the PancakeSwap team has burned a total of 351,962 CAKE tokens in&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-06T11:00:20.000Z",
    "title": "Ethereum Price 2023 Breakthrough: Surpassing Bitcoin, Altcoin Surge Next?",
    "url": "https://www.newsbtc.com/ethereum-news/ethereum-price-2023-breakthrough-surpassing-bitcoin-altcoin-surge-next/",
    "description": "For the first time in 2023, the Ethereum price has outperformed Bitcoin across several metrics, hinting at a fundamental shift in market structure. The second cryptocurrency by market capitalization follows the general sentiment in the sector, setting new yearly highs. Related Reading: XRP Greed Index Soars, Backed By Robust $1.3 Billion Volume – Good For Price? As of this writing, the Ethereum price trades at $2,300 with a 4% profit in the last 24 hours. Over the previous week, the cryptocurrency recorded a 10% profit, with most of the altcoin sector still lagging the current price action. Ethereum Price Signals Strength For Altcoin Sector? A report from BlockScholes posted by the options platform Deribit indicates a spike in the Ethereum price volatility back to its levels above Bitcoin’s. ETH&#8217;s shift in market structure hints at traders and institutions gearing up for early 2024. The report claims that the potential approval of a spot in the US ETH Exchange Traded Fund (ETF) is behind the current price action. This new dynamic suggests that the bullish sentiment above this event slipped from Bitcoin to Ethereum. As seen in the chart below, Ethereum records a higher return than Bitcoin for the first time since July 2023. The surge in returns, BlockSholes said, allowed ETH to buck a persistent downtrend, but overall, the cryptocurrency’s performance remains in its yearly range. In other words, the Ethereum price is doing better than in other periods across 2023 but has yet to resume a bullish momentum concerning Bitcoin. However, the report noted: This reversal is not yet strong enough for us to be confident in a return to the market structure that we had previously come to expect, but does indicate that the effects of speculative bets around the application of a spot ETF are not limited to BTC. This is echoed by the implied volatilities for both assets across the term structure, which forecast similar volatility levels for both assets. What Favors An Altcoin Rally In addition, the report noted a decline in the US dollar as measured by the DXY Index. Risk assets can thrive as the currency trends lower, potentially hinting at a loose monetary policy by the Federal Reserve (Fed). If Ethereum continues gaining bullish momentum from its current levels, the entire altcoin sector could see further profits. The report indicates that most entities and traders are pricing in a “risk event” by the end of January 2024. Related Reading: Bloomberg Experts Forecast Timeline For Spot Ethereum ETF Approval Thus, Bitcoin and Ethereum may see a more significant rally by that time. Whichever coin prevails might reveal more information on the subsequent trend; if Ethereum outperformed, then altcoins are more likely to follow. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-06T10:56:43.000Z",
    "title": "Coinbase to Support Money Transfers Via Links",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/coinbase-to-support-money-transfers-via-links/",
    "description": "<p>Coinbase has rolled out a new service on its wallet. It enables users to transfer crypto via a link sent through major social media applications like Telegram, iMessage, TikTok, Facebook, WhatsApp, and Instagram. Coinbase said the move is part of its plans to make its services accessible to a wider audience and eliminate possible barriers. [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/coinbase-to-support-money-transfers-via-links/\">Coinbase to Support Money Transfers Via Links</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-06T10:45:12.000Z",
    "title": "AVAX Surges to a 52-Week High: Will the Rally Continue?",
    "url": "https://coinedition.com/avax-surges-to-a-52-week-high-will-the-rally-continue/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Bulls-Drive-AVAX-Price-Up-by-Over-13-Indicators-Point-to-More-Upward-Swing.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bulls Drive AVAX Price Up by Over 13%; Indicators Point to More Upward Swing\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Bulls-Drive-AVAX-Price-Up-by-Over-13-Indicators-Point-to-More-Upward-Swing.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Bulls-Drive-AVAX-Price-Up-by-Over-13-Indicators-Point-to-More-Upward-Swing-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Bulls-Drive-AVAX-Price-Up-by-Over-13-Indicators-Point-to-More-Upward-Swing-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Bulls-Drive-AVAX-Price-Up-by-Over-13-Indicators-Point-to-More-Upward-Swing-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Bulls-Drive-AVAX-Price-Up-by-Over-13-Indicators-Point-to-More-Upward-Swing-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Bulls-Drive-AVAX-Price-Up-by-Over-13-Indicators-Point-to-More-Upward-Swing-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Avalanche&#8217;s native cryptocurrency, AVAX, has recently seen an impressive surge, climbing 15% to a 52-week high of $26.65 and entering the top ten cryptocurrency list, according to CoinMarketCap. This remarkable growth has outpaced competitors like Tron (TRX) and Chainlink (LINK).  At press time, AVAX was trading at $25.82, boasting a market cap of $9.4 billion. [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/avax-surges-to-a-52-week-high-will-the-rally-continue/\">AVAX Surges to a 52-Week High: Will the Rally Continue?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]