[
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T05:14:37.000Z",
    "title": "US House Democratic coalition creates AI working group",
    "url": "https://cointelegraph.com/news/ai-working-group-announced-by-house-democrats",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/166da658-c3bd-4c7a-b7bd-2f205968c8de.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Representative Derek Kilmer will chair the Artificial Intelligence Working Group, which is aimed at introducing “sensible, bipartisan” policies for AI technology.</p>\n                    <p><p>Democrats from the United States House of Representatives have formed a working group on artificial intelligence aimed at introducing new legislation around the nascent tech sector. </p><p>The 97-member New Democrat Coalition <a href=\"https://newdemocratcoalition.house.gov/media-center/press-releases/new-dems-announce-first-ever-artificial-intelligence-working-group\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> its AI working group on Aug. 15, stating it would work with President Joe Biden’s administration, stakeholders and lawmakers from both sides of the political arena to develop “sensible, bipartisan policies to address this emerging technology.”</p><p>The group will focus on a range of issues including how best to leverage AI for growth while still ensuring that workers who stand to lose their jobs as a result of AI can remain employed.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Artificial Intelligence is the biggest technological threat we&#39;ve faced since the invention of the atomic bomb.<br><br>I am proud to be a part of the <a href=\"https://twitter.com/NewDemCoalition?ref_src=twsrc%5Etfw\">@NewDemCoalition</a>&#39;s AI Working Group to assess the dangers and opportunities posed by AI and develop a framework to regulate it. <a href=\"https://t.co/99hGdHgb7x\">https://t.co/99hGdHgb7x</a></p>&mdash; Rep. Seth Moulton (@RepMoulton) <a href=\"https://twitter.com/RepMoulton/status/1691478756693520384?ref_src=twsrc%5Etfw\">August 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Representative Derek Kilmer will serve as chair of the AI working group and <a href=\"https://www.cnbc.com/2023/08/15/new-democrats-ai-working-group-aims-to-shape-policy.html\" target=\"_blank\" rel=\"noopener nofollow\">told</a> CNBC the primary focus of the working group was to crack down on the spread of misinformation and aired concerns on advanced <a href=\"https://cointelegraph.com/news/chinese-police-to-crackdown-crypto-deepfake-ai\">AI-generated deepfakes</a> becoming increasingly prevalent online.</p><blockquote>“There’s real concern about the potential for AI generated disinformation, real concern about misuse of advanced AI models.”</blockquote><p>“That’s the type of thing that requires Congress to get smart and get smart fast,” Kilmer added.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Artificial intelligence is the next great frontier of technological advancement.<br><br>And we’re already seeing how breakthroughs in this emerging technology present both great opportunities and challenges with potential disruptions for workers, democracy, and national security. <a href=\"https://t.co/hflVef6k9Y\">https://t.co/hflVef6k9Y</a></p>&mdash; Rep. Derek Kilmer (@RepDerekKilmer) <a href=\"https://twitter.com/RepDerekKilmer/status/1691494962536521728?ref_src=twsrc%5Etfw\">August 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: <a href=\"https://cointelegraph.com/news/pentagon-task-force-lima-to-study-generative-ai-defense\">Pentagon forms ‘Task Force Lima’ to map generative AI for US defense</a></em></strong></p><p>Lawmakers, academics and top tech CEOs have all <a href=\"https://cointelegraph.com/news/ai-experts-sign-doc-comparing-risk-of-extinction-from-ai-to-pandemics-nuclear-war\">signaled the need</a> to reign in on the potential dangers raised by AI.</p><p>In May, Vice President Kamala Harris, along with Biden’s top advisers, <a href=\"https://cointelegraph.com/news/us-vice-president-gathers-top-tech-ceos-to-discuss-dangers-of-ai\">held a meeting</a> with several AI industry CEOs to discuss concerns about the risks associated with AI.</p><p>In June, President Biden held a <a href=\"https://cointelegraph.com/news/ai-companies-commit-safe-and-transparent-ai-white-house-reports\">meeting with experts</a> in AI in Silicon Valley to discuss a similar subject. </p><p><strong><em>AI Eye: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-is-ai-a-threat-why-ai-advance/\"><strong><em>Is AI a nuke-level threat? Why AI fields all advance at once, dumb pic puns</em></strong></a></p><p class=\"post-content__disclaimer\">Additional reporting by Felix Ng. </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-16T05:16:54.000Z",
    "title": "CoinDesk Cuts 45% of Its Editorial Staff Amid Sale Rumours",
    "url": "https://cryptodaily.co.uk/2023/08/coindesk-cuts-45-of-its-editorial-staff-amid-sale-rumours",
    "description": "<p>Crypto media outlet CoinDesk has cut its editorial staff by 45% as its parent company DCG prepares to introduce strategic investors. </p>\n<p>Rumours that DCG is negotiating a sale of its crypto media outlet CoinDesk have been circulating for a while. Reports by The Wall Street Journal (WSJ) claim that the crypto conglomerate was reportedly finalizing a $125 million deal to sell a portion of the company. DCG would reportedly retain a stake in the company.</p>\nCoinDesk Announced Staff Cuts\n<p>Reports by crypto news outlet The Block claim that CoinDesk let go of 45% of its editorial staff as its parent company Digital Currency Group (DCG), prepares for a partial sale of the company. DCG purchased CoinDesk in 2016 for $500,000. The company was established in 2013.</p>\n<p>In an internal memo viewed by The Block, the firm was soon to have an &ldquo;all-hands&rdquo; meeting to discuss the layoffs.</p>\n<p>In an email, Kevin Worth, CoinDesk CEO, told staff:</p>\n\n<p>&ldquo;The purpose of the meeting is to inform everyone that today several roles, predominantly in our media team, were impacted by a reduction in force.&rdquo;</p>\n\n<p>Adding,</p>\n\n<p>&ldquo;This is an incredibly difficult message to send to everyone over email and yet I also wanted everyone at CoinDesk to know as soon as possible what is happening today. This was a required step to ensure a financially sound business moving forward and to set us on the path to close the deal to sell CoinDesk Inc.&rdquo;</p>\n\n<p>According to The Block&rsquo;s report, which cites someone familiar with the matter, CoinDesk would let go of 45% of its editorial team or 20 people.</p>\nDCG Will Retain a Stake in CoinDesk\n<p>CoinDesk recently appointed financial advisers to &ldquo;help bring on new institutional and strategic investors&rdquo; alongside its parent company. DCG has faced severe pressure from crypto exchange Gemini over a dispute involving the &ldquo;Earn&rdquo; program. In July, Gemini announced that it had filed a lawsuit against DCG.</p>\n<p>The reports from the WSJ indicated CoinDesk was in the final stages of a partial sale of the company to a crypto syndicate led by crypto investor Matthew Roszak of Tally Capital. As part of the $125 million deal, DCG would retain a share of CoinDesk.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-16T05:30:38.000Z",
    "title": "Cashtokens Upgrade 3 Months Out: BCH Developers Building NFT Creator Studio, Marketplaces, Wallets, and More",
    "url": "https://news.bitcoin.com/cashtokens-upgrade-3-months-out-bch-developers-building-nft-creator-studio-marketplaces-wallets-and-more/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2280419431-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Cashtokens Upgrade 3 Months Out: BCH Developers Building NFT Creator Studio, Marketplaces, Wallets, and More\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2280419431-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2280419431-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2280419431-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2280419431-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2280419431-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2280419431-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2280419431.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />With the Bitcoin Cash network&#x2019;s May 15 Cashtokens upgrade now three months behind us, bustling development in non-custodial wallets, marketplaces, non-fungible tokens (NFTs), games, and other applications continues unabated. Paytaca wallet CEO Joemar Taganna notes that &#x201C;improvements in consensus building&#x201D; and &#x201C;new and powerful upgrades to the protocol&#x201D; showcase several parties &#x201C;working together to make [&#8230;]"
  }
]