[
  {
    "source": "Bitcoin.com",
    "date": "2023-12-22T05:00:51.000Z",
    "title": "Ministry of Information and Technology of China to Formulate New Web3 Strategy",
    "url": "https://news.bitcoin.com/ministry-of-information-and-technology-of-china-to-formulate-new-web3-strategy/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/7d76f868-c3fe-40cf-8ea1-e0f4d77b9b4c-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ministry of Information and Technology of China to Formulate New Web3 Strategy\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/7d76f868-c3fe-40cf-8ea1-e0f4d77b9b4c-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/7d76f868-c3fe-40cf-8ea1-e0f4d77b9b4c-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/7d76f868-c3fe-40cf-8ea1-e0f4d77b9b4c-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/7d76f868-c3fe-40cf-8ea1-e0f4d77b9b4c-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/7d76f868-c3fe-40cf-8ea1-e0f4d77b9b4c-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/7d76f868-c3fe-40cf-8ea1-e0f4d77b9b4c-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/7d76f868-c3fe-40cf-8ea1-e0f4d77b9b4c.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Ministry of Information and Technology of China has agreed to formulate a new strategy for the Web3 field to improve the state of the industry in China. The initiative comes as an answer to a proposal made at the 14th Chinese People&#8217;s Political Consultative Conference (CPPCC) National Committee, aiming to strengthen Web3&#8217;s condition in [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-22T04:48:04.000Z",
    "title": "XRP Price Could Be Soon The Next One To Rally – Here’s Why",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-rally-0-630/",
    "description": "XRP price is eyeing a fresh rally above the $0.630 resistance. The price could gain bullish momentum if it clears the $0.630 and $0.640 resistance levels. XRP is slowly moving higher from the $0.600 support level. The price is now trading below $0.630 and the 100 simple moving average (4 hours). There was a break above a major bearish trend line with resistance near $0.610 on the 4-hour chart of the XRP/USD pair (data source from Kraken). The pair start a fresh rally if it clears the $0.630 and $0.640 resistance levels. XRP Price Aims Fresh Surge After a major decline, XRP found support near the $0.580 zone. A low was formed near $0.5781, and the price started a steady increase. There was a move above the $0.600 resistance, but XRP lagged momentum compared to Bitcoin and Ethereum. There was a break above the 23.6% Fib retracement level of the key drop from the $0.700 swing high to the $0.578 swing low. Besides, there was a break above a major bearish trend line with resistance near $0.610 on the 4-hour chart of the XRP/USD pair. The price is now trading below $0.630 and the 100 simple moving average (4 hours). On the upside, immediate resistance is near the $0.630 zone. It is close to the 50% Fib retracement level of the key drop from the $0.700 swing high to the $0.578 swing low. Source: XRPUSD on TradingView.com The first major resistance is near the $0.640 zone. A close above the $0.640 resistance zone could spark a strong increase. The next key resistance is near $0.672. If the bulls remain in action above the $0.672 resistance level, there could be a rally toward the $0.700 resistance. Any more gains might send the price toward the $0.720 resistance. Another Decline? If XRP fails to clear the $0.630 resistance zone, it could start a fresh decline. Initial support on the downside is near the $0.606 zone. The next major support is at $0.600. If there is a downside break and a close below the $0.600 level, XRP price might accelerate lower. In the stated case, the price could retest the $0.578 support zone. Technical Indicators 4-Hours MACD – The MACD for XRP/USD is now losing pace in the bearish zone. 4-Hours RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $0.606, $0.600, and $0.578. Major Resistance Levels – $0.630, $0.640, and $0.672."
  }
]