[
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T13:04:51.000Z",
    "title": "U.S. lawmakers introduce CLARITY Act to limit federal ties with Chinese blockchain",
    "url": "http://cointelegraph.com/news/u-s-lawmakers-clarity-act-tlimit-federal-ties-chinese-blockchain",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/c8292c27-d730-432d-ba6f-9837056cabe0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Furthermore, the act aims to explicitly forbid U.S. government officials from engaging in transactions with iFinex, the parent company of USDT issuer Tether.</p>\n                    <p><p>U.S. Representatives Zach Nunn and Abigail Spanberger have jointly introduced the Creating Legal Accountability for Rogue Innovators and Technology (CLARITY) Act. The legislation aims to prohibit federal government officials from conducting business with Chinese blockchain companies.</p><p>The Act would <a href=\"https://nunn.house.gov/sites/evo-subsites/nunn.house.gov/files/evo-media-document/clarity-act.vf_.pdf\" target=\"_blank\" rel=\"noopener nofollow\">ban</a> government employees from using the underlying networks of Chinese blockchain or cryptocurrency trading platforms. Furthermore, it would explicitly forbid U.S. government officials from engaging in transactions with iFinex, the parent company of USDT issuer Tether.</p><p>In addition to iFinex, the CLARITY Act would prohibit officials from conducting transactions with The Spartan Network, The Conflux Network, and Red Date Technology. In a statement on Wednesday, the lawmakers said that the legislation, if passed, would ensure the nation’s “foreign adversaries … do not have a backdoor to access critical national security intelligence and Americans’ private information”.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/a8e2f88f-4ee7-49f0-aaa4-775bf11265d4.JPG\"  /></figure><p>Tether was reported to have been <a href=\"https://cointelegraph.com/news/usdt-tether-responds-to-chinese-securities-reports\">exposed to Chinese securities and other Chinese firms</a> earlier this year. On June 16, several news sources, including Bloomberg, disclosed that the company previously held securities from Chinese state-owned firms. Bloomberg referred to documents released by New York’s Attorney General (NYAG) and emphasized that deposits from entities like the Industrial and Commercial Bank of China, China Construction Bank, and Agricultural Bank of China formerly supported USDT.</p><p>This revelation follows years of inquiry and <a href=\"https://cointelegraph.com/news/stablecoin-supplies-and-cash-reserves-in-question-amid-crypto-exodus\">concern about the assets supporting Tether’s stablecoin.</a></p><p>Tether’s reserves encompassed substantial short-term loans to Chinese firms and a <a href=\"https://cointelegraph.com/news/tether-celsius-crisis-has-no-impact-on-usdt-reserves\">significant loan to the cryptocurrency platform Celsius Network</a>. Tether had previously <a href=\"https://cointelegraph.com/news/does-evergrande-s-300b-debt-crisis-pose-systemic-risk-to-crypto-industry\">denied any involvement with the debt of China’s troubled Evergrande Group</a> but had not revealed its holdings of other Chinese securities.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/tether-usdt-610-million-debt-northern-data\"><strong><em>Tether issues $610M debt financing to Bitcoin miner Northern Data</em></strong></a><strong><em><u> </u></em></strong></p><p>Further, the U.S. SEC is also closely monitoring Tether’s operations. In September, a report suggested that the company secretly began offering USDT <a href=\"https://cointelegraph.com/news/tether-2023-stablecoin-loans-rise-despite-size-down-plans\">stablecoin loans to customers</a> a year after Tether Holdings pledged to cease providing secured loans.</p><p>As the bill’s sponsors state, the latest move underscores Washington’s growing concerns about Chinese connections within the cryptocurrency sector.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T13:07:06.000Z",
    "title": "OpenAI’s ChatGPT Faces Intermittent Outages Attributed to Potential Cyberattack",
    "url": "https://www.cryptopolitan.com/openais-chatgpt-faces-intermittent-outages/",
    "description": "OpenAI&#8217;s ChatGPT, an AI chatbot, has been grappling with intermittent outages, and the company has cited a potential cyberattack as the cause. These disruptions persisted even after the platform&#8217;s recovery from a significant outage attributed to a surge in interest for new features. OpenAI&#8217;s service status page indicated that both ChatGPT and its API services, ... <a title=\"OpenAI&#8217;s ChatGPT Faces Intermittent Outages Attributed to Potential Cyberattack\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openais-chatgpt-faces-intermittent-outages/\" aria-label=\"More on OpenAI&#8217;s ChatGPT Faces Intermittent Outages Attributed to Potential Cyberattack\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T12:49:20.000Z",
    "title": "Viction (Formerly TomoChain), Coin98 Announces Web3 Hackathon for Global Developers",
    "url": "https://www.cryptopolitan.com/viction-formerly-tomochain-coin98-announces-web3-hackathon-for-global-developers/",
    "description": "Viction, formerly known as TomoChain, has announced it’s hosting a Web3 startup hackathon together with Coin98 Super Wallet to foster next-level potential in the rapidly evolving Web3 and blockchain space. The event, introduced as “Viction Horizon Hackathon,” began on November 2 and will last through January 9. The event is supported by leading Web3 companies, ... <a title=\"Viction (Formerly TomoChain), Coin98 Announces Web3 Hackathon for Global Developers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/viction-formerly-tomochain-coin98-announces-web3-hackathon-for-global-developers/\" aria-label=\"More on Viction (Formerly TomoChain), Coin98 Announces Web3 Hackathon for Global Developers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T12:42:30.000Z",
    "title": "Livepeer Price Prediction 2023-2032: Will LPT Price Spike Higher?",
    "url": "https://www.cryptopolitan.com/livepeer-price-prediction/",
    "description": "Livepeer Price Prediction 2023-2032 Livepeer Price Prediction 2023 &#8211; up to $5.14 Livepeer Price Prediction 2026 &#8211; up to $17.79 Livepeer Price Prediction 2029 &#8211; up to $52.18 Livepeer Price Prediction 2032 &#8211; up to $165.66 Livepeer is a protocol based on the Ethereum network. However, this protocol allocates video transcoding work in its decentralized ... <a title=\"Livepeer Price Prediction 2023-2032: Will LPT Price Spike Higher?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/livepeer-price-prediction/\" aria-label=\"More on Livepeer Price Prediction 2023-2032: Will LPT Price Spike Higher?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-09T13:09:42.000Z",
    "title": "SEC sees Binance’s arguments for lawsuit dismissal as absurd",
    "url": "https://crypto.news/sec-sees-binances-arguments-for-lawsuit-dismissal-as-absurd/",
    "description": "The U.S. Securities and Exchange Commission (SEC) said that Binance&#8217;s attempts to dismiss the lawsuit against it are invalid. The regulator called the company&#8217;s arguments &#8220;absurd.&#8221; In its response, the Commission also reiterated that most crypto assets are securities under the&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-09T13:00:19.000Z",
    "title": "Ukraine lost nearly $53b due to lack of crypto regulation",
    "url": "https://crypto.news/ukraine-lost-nearly-53b-due-to-lack-of-crypto-regulation/",
    "description": "Ukraine&#8217;s largest crypto exchange, Kuna, says the country has lost dozens of billions of dollars since 2016 in revenue related to the crypto market. Ukraine&#8217;s state budget has lost $52.9 billion in revenue from taxes and other crypto-related activities since&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-09T12:51:24.000Z",
    "title": "Gensler’s nod to FTX revival sparks market frenzy",
    "url": "https://crypto.news/genslers-nod-to-ftx-revival-sparks-market-frenzy/",
    "description": "SEC chair Gary Gensler is open to the idea of FTX&#8217;s revival, provided its new management operates within legal parameters. This openness from Gensler came to light following revelations that Tom Farley, ex-president of the New York Stock Exchange, might&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T13:00:12.000Z",
    "title": "Want To Get Into XRP? Crypto Analyst Reveals The Ideal Price",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-crypto-analyst-ideal-price/",
    "description": "As the market continues to rally, many begin to feel that they have missed the chance to get in early on their favorite altcoins, including XRP. However, a prominent crypto analyst has provided hope to those still looking to get in on the token as he talks of the possibility of a correction and the ideal price to accumulate the crypto token.  The Right Time To Be A “Buyer” In a post shared on his X (formerly Twitter) platform, the CEO and founder of MN Trading, Michaël van de Poppe, acknowledged how the price of XRP has been rallying in recent times. He further went on to hint at the fact that XRP has always corrected whenever it experienced such rallies. The one that he pinpointed was when the token corrected from $0.93 to $0.45 before its resurgence. Related Reading: Bitcoin Parabolic Rally Above $600,000: Crypto Analyst Says It’s Closer Than You Think As such, his belief seems to be that the XRP will dip once again. This time, he stated that an ideal time to be a buyer will be if XRP is able to correct to around $0.54.  However, many in the XRP community will be hoping that XRP continues to rally from henceforth, especially considering that it just recently hit the $0.7 price mark. The technical and fundamental analysis surrounding the XRP ecosystem seems to be bullish, with many predicting more upward trend from the $0.7 mark. In a recent X post, renowned crypto analyst Egrag, who had predicted that a god candle was coming for XRP, mentioned that that XRP just witnessed an “exciting development.” This is because the 21 Exponential Moving Average (EMA) has crossed over the 55 MA. According to him, this “bullish crossover” historically signifies the beginning of “significant price explosions.” Source: X To consolidate this development, he stated how XRP closing above the $51.3 billion Fib 0.702 level was critical as it could be the “watershed moment for our victory.” XRP Fundamentals Are Also Bullish  The Ripple Swell Conference 2023 is currently ongoing, and the event has lived up to the hype following Ripple’s latest announcements. Apart from the rebranding of its payment service as Ripple Payments, the crypto company also announced how its partner Onafriq will begin utilizing its payment service. This move would see Ripple open up the cross-border payments structure across three continents: Africa, Europe, and Australia.  Related Reading: Dogecoin Climbs Above $0.075 To 3-Month High, But Metrics Show It’s Far From Done The crypto company is also expected to make more announcements before the conference comes to a close on November 9. Ripple isn’t resting on its laurels, as the company feels more confident than ever to keep expanding. By extension, this will increase the utility of the XRP token, which is an important piece in its Ripple Payments service.  Token price readies to retest $0.7 &#124; Source: XRPUSD on Tradingview.com Featured image from Decrypt, chart from Tradingview.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T13:00:08.000Z",
    "title": "PEPE’s Price Propels To 3-Month Highs, Here’s Why",
    "url": "https://www.newsbtc.com/analysis/pepe/pepe-price-propels-to-3-month-highs-heres-why/",
    "description": "Amid the bullish sentiment around the cryptocurrency market, popular meme coin PEPE has recently experienced a significant surge in its price recording over a 15% increase in its price in the past 24 hours. The Price Of PEPE Gains Traction PEPE seems to be gaining traction and heading towards a bullish run indicating potential benefits for investors. The meme coin&#8217;s price is currently sitting at $0.0000013, indicating a 15% increase in price in the past 24 hours. The surge in price might be traced back to the Dogecoin (DOGE) millionaire Glauber Contessoto, who picked PEPE to be among his top 10 choice cryptocurrency investments. According to the millionaire, PEPE seems to represent the same irreverent, internet-culture-focused approach that initially drew him to Dogecoin. Related Reading: Could Meme Kombat be the Next Pepe as Presale Hits $1M Milestone PEPE might have experienced a surge in its price, but the meme coin is still over 69% down from its all-time high of $0.000004354 in early May. However, the bullish sentiment circling in the crypto market has propelled the meme coin&#8217;s price by 89% over the past 30 days. The token has also experienced a significant increase in whale transactions in the past 24 hours. The number of whale transactions involving at least $100,000 in PEPE increased by 50% over the past 24 hours.  According to data from Santiment, show that its deposits to crypto exchanges have since fallen by 33% in just 3 days, the report, despite the increase in whale transactions. This could be because investors are choosing to hold for higher prices rather than sell now. In addition, PEPE&#8217;s recent social media dominance seems to have significantly contributed to the increase in price by the token. It was revealed by Santiment that the memecoin experienced an impressive 105% surge in its social media volume in the past 24 hours. Decline In Active Address Doesn&#8217;t Hinder Memecoin&#8217;s Performance PEPE&#8217;s performance this month is nothing compared to that of last month just yet. In October, the price of PEPE grew by 60%, this might be due to the bullish nature of the month of October also known as &#8216;Uptober&#8217; in the crypto space.  PEPE has seen a consistent decline in the number of active addresses. According to IntoTheBlock, it was revealed that the number subsequently fell from a total of 3,700 to 2,020 active addresses. This pattern suggests that, due to memecoin&#8217;s failure to live up to investor expectations, they may be selling their PEPE holdings in favor of trending altcoins. Related Reading: Pepe Conquers The Weekend Charts With 61% Rally – Here’s Why The meme coin&#8217;s daily active addresses (DAA) divergence currently stands at 5.8% according to Santiment. Initially, a &#8220;buy&#8221; signal is indicated when the DAA divergence indicator increases. Featured image by iShock, chart by Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-09T13:09:54.000Z",
    "title": "Dogecoin and Cardano Whales Buy Revolutionary New Crypto Presale with 3,000% Upside",
    "url": "https://www.crypto-news-flash.com/dogecoin-and-cardano-whales-buy-revolutionary-new-crypto-presale-with-3000-upside/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-and-cardano-whales-buy-revolutionary-new-crypto-presale-with-3000-upside",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-26.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-26.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-26-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-26-336x200.jpg 336w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Dogecoin (DOGE) and Cardano (ADA) whales are showing an unwavering appetite for BorroeFinance ($ROE) based on the AI-powered altcoin’s long-term potential of recording a 3,000% surge thanks to its prowess of revolutionizing Web3 financing. &#62;&#62;BUY $ROE TOKENS NOW&#60;&#60; BorroeFinance Illustrates a Creative NFT Use Case To propel the Web3 industry to unprecedented heights, BorroeFinance ($ROE) [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-09T12:55:00.000Z",
    "title": "Dubai’s VARA Sets New Deadline for Crypto Entities To Get Licensed",
    "url": "https://coinedition.com/dubais-vara-sets-new-deadline-for-crypto-entities-to-get-licensed/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Dubai_Becomes_a_Haven_for_Crypto_Enthusiasts_Fleeing_Strict_US_Regulation-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto companies registered under Dubai&#8216;s new legal framework have until November 17 to finish their applications. The Dubai Virtual Assets Regulatory Authority (VARA) recently made this announcement and warned crypto entities risk enforcement actions if they failed to comply.  Notably, the regulator said the announcement underscores its commitment to fostering a transparent and resilient virtual [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/dubais-vara-sets-new-deadline-for-crypto-entities-to-get-licensed/\">Dubai’s VARA Sets New Deadline for Crypto Entities To Get Licensed</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-09T12:45:25.000Z",
    "title": "Crypto Trader Says One Shiba Inu Rival Hinting at a Potential Breakout, Updates Outlook on Cardano and Uniswap",
    "url": "https://dailyhodl.com/2023/11/09/crypto-trader-says-one-shiba-inu-rival-hinting-at-a-potential-breakout-updates-outlook-on-cardano-and-uniswap/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Rival-Hinting-Potential-Breakout.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Rival-Hinting-Potential-Breakout.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Rival-Hinting-Potential-Breakout.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Rival-Hinting-Potential-Breakout.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Rival-Hinting-Potential-Breakout.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Rival-Hinting-Potential-Breakout.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Rival-Hinting-Potential-Breakout.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto trader Ali Martinez says that the largest memecoin by market cap could surge after overcoming a key resistance level. Martinez tells his 32,300 followers on the X social media platform that if Dogecoin (DOGE) manages to climb above the $0.076 resistance level, the leading memecoin could surge by around 13% from the current level. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/09/crypto-trader-says-one-shiba-inu-rival-hinting-at-a-potential-breakout-updates-outlook-on-cardano-and-uniswap/\">Crypto Trader Says One Shiba Inu Rival Hinting at a Potential Breakout, Updates Outlook on Cardano and Uniswap</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]