[
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T13:21:39.000Z",
    "title": "Blockchain technology lets East African farmers sell globally",
    "url": "https://cointelegraph.com/news/blockchain-technology-africa-farmers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/c19161aa-6ce2-4877-80cf-1d82342608b5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchains’ tracing capacities can help certify that crops weren’t grown by razing woodlands or harvested with child labor.</p>\n                    <p><p>Small farmers in the developing world may be on the cusp of an agricultural breakthrough. With emerging technologies like satellite imagery, drones and machine learning boosting productivity, it’s becoming more viable than ever to sell their produce in places like Western Europe. </p><p>There’s just one catch: avocado farmers in East Africa or coffee growers in Latin America have to be able to document that their crops have been grown in accordance with sustainable agricultural practices. </p><p>Their harvest bounty can’t come at the expense of denuded forests or through the assistance of child labor. And if their products are labeled “organic,” they will have to provide certification that no synthetic fertilizers and pesticides were used. </p><p>This is where blockchain technology could play a significant role. </p><h2>Generating an immutable record</h2><p>“Blockchain creates a great solution with an immutable record, particularly [when] combined with mobile” and other emerging technologies, Jon Trask, CEO of Dimitra — an AgTech firm active in 18 countries, which has worked with government agencies in Brazil, India, Uganda and Nepal — told Cointelegraph. </p><p>On July 20, Dimitra and One Million Avocados (OMA) — a sustainability-focused tech group — <a href=\"https://africabusinesscommunities.com/tech/tech-news/kenya-dimitra-announces-partnership-with-sustainability-tech-organization-one-million-avocados/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> a partnership to help Kenyan avocado farmers boost production and quality through cutting-edge emerging technologies, including blockchain. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/9573b430-c109-4bf5-acfa-59f3526169d9.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Dimitra Technology announced the partnership on Twitter. Source: Twitter</em></figcaption></figure><p>Dimitra’s multitech platform, which also includes mobile technology, artificial intelligence (AI), Internet of Things devices, satellite imaging and genomics, will give small farmers “greater access to solutions to further promote sustainable farming practices, primarily in pest and disease prevention and data reporting,” according to the press release. </p><p>Another key goal of the partnership is to help farmers in East Africa “overcome traceability issues to ensure maximum value of produce and to align with international regulatory frameworks.”</p><p>It’s not just in Kenya or the African continent where this movement of agricultural goods from the Global South to the Global North is picking up, either. “We have the same situation in Indonesia, Brazil and a few other Latin American countries,” Trask told Cointelegraph. “When they [farmers] are exporting their produce, they can get more dollars per kilo.” </p><p>Documentation will be critical for would-be exporters, especially with Europe’s new deforestation <a href=\"https://www.mayerbrown.com/en/perspectives-events/publications/2023/06/european-union-publishes-deforestation-regulation#:~:text=Per%20the%20Deforestation%20Regulation%2C%20operators,having%20ascertained%E2%80%94through%20due%20diligence%E2%80%94\" target=\"_blank\" rel=\"noopener nofollow\">regulation</a>, which went into force in June — though its main obligations won’t apply until yearend 2024. “You will have to prove that your firm has not been involved in deforestation,” explained Trask, adding: </p><blockquote>“When an avocado farmer in Kenya goes to export their produce, they need to create certain documentation to show the origin of the produce. There is security associated with that document. It’s easy to create a fraudulent document.”</blockquote><p>Enter blockchain, the traceability tool <em>par excellence</em>. “Blockchain-traced data is immutable and can serve as proof for farmers to get certifications or loans,” researcher SzuTung Chen, who recently completed a master’s thesis on coffee growing in Colombia, told Cointelegraph. “A blockchain company is working with carbon credit companies, for example, so that the farmers that are operating sustainable practices can have recorded data of their farming and get additional income.”</p><p>One of the biggest problems facing small farmers is information asymmetry, Chen explained. “Coffee brands and roasters capture the highest margin of the coffee price because they are closer to the end customers, and can leverage branding and marketing.”</p><p>Farmers, on the other hand, don’t know where their coffee goes after they sell it, the destination of their coffee or any coffee market trends — “which keeps them in a vulnerable situation in the supply chain,” she adds. </p><p>What blockchain can potentially do, she continued, is facilitate two-way transparency, so not only do stakeholders at the end of the supply chain know where the coffee comes from, but farmers also know what happens in the downstream supply chain.</p><h2>More powerful than blockchain alone</h2><p>Dimitra will use satellite imaging technology to help Kenyan farmers prove they aren’t ravaging woodlands to grow their avocados, but this technology can also be used to enhance productivity. By applying machine learning models to satellite imagery, Dimitra has developed algorithms that can pinpoint where more fertilizer is required or where irrigation needs to be stepped up, for example.</p><p>A multitech solution may generate synergies too. As Monica Singer, South African lead and senior strategy at ConsenSys, told Cointelegraph:</p><blockquote>“When you are able to create an ecosystem using mobile and Internet of Things devices and AI, where relevant, it will be a more powerful solution than the blockchain ledger on its own.”</blockquote><p>Is this cross-disciplinary approach the wave of the future? “I believe that blockchain can’t do it on its own,” Trask said. “We need to combine technologies in order to provide the services that the agricultural industry needs.”</p><p>It may be different in the financial sphere, conceded Trask, who has spent the past six years working on blockchain-related projects — his supply chain-related experience goes back even further. DeFi use cases can often stand on their own, but agriculture is different. “When we combine those technologies — machine learning and visual imaging and drones with blockchain — we can get more bang for the buck.”</p><p>The firm has “trained” machine learning models to recognize what a tree looks like using satellite images. A “tree” must have a certain canopy, height, etc. The firm can generate deforestation reports that illustrate within the boundaries of a farm where trees have been removed and where they have been added over a period of time. </p><p>Dimitra says Kenyan farmers can double their productivity by applying emerging technologies available today, but how much of that gain derives from digital ledger technology per se?</p><p>“It does require a combination of technologies,” answered Trask, but one shouldn’t overlook blockchain’s importance. “We originally did a project in East Africa around cattle,” he said, adding:</p><p>Farmers discovered that they could “get 50% to 100% more per pound of beef than they would if they didn’t have a traceability [blockchain] system.” </p><p>If African avocado farmers can meet the European Union’s documentation requirements, “they can get 30%, 50%, maybe even a couple hundred percent more on export.” Further gains from AI-driven enhancements in areas like irrigation and fertilization could result in a further doubling of productivity, he suggested. </p><p>Others agree that blockchain technology can become a factor in its own right with regard to the continent’s agricultural sector, particularly if its record-keeping capabilities are used for quality assurance, as Shadrack Kubyane, co-founder of South’s Africa’s Coronet Blockchain and eFama App, told Cointelegraph.</p><p>The importance of tamper-proof agricultural records was driven home to Kubyane by the world’s worst-ever listeriosis <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7023107/#:~:text=South%20Africa%20witnessed%20the%20world's,)%2C%20216%20deaths%20were%20recorded.\" target=\"_blank\" rel=\"noopener nofollow\">outbreak</a>, which occurred in South Africa in January 2017 and had a death toll exceeding 200. </p><p>That case “continues to be contested in the courts to this day,” he said. The primary suspect remains a major food processing and distribution entity that, to this day, insists it was <em>not </em>the major source of the outbreak. “Had blockchain been in full force across that specific food chain, then the determinant factors and source of the outbreak would have been determined in two-and-a-half seconds or less, rather than waiting six-and-a-half years for a still-pending verdict.”</p><h2>A “game changer”</h2><p>ConsenSys’s Singer is bullish about blockchain’s future use on the continent. “Supply chain technology with track-and-trace functionality using blockchain technology will be a game changer in Africa,” she told Cointelegraph. “We have a high penetration of mobile phones in the continent. We also know that blockchain technology is most useful when there are many intermediaries and when we need to have an audit trail of transactions involving many parties in a transparent manner.”</p><p>In Africa, the farmer is often the last to benefit from the sale of produce, “in particular when there is dependency on many intermediaries.” Among other virtues, blockchain tech also helps with “right-sizing intermediaries,” Singer added. Moreover, “We currently have very few sophisticated technologies for track-and-trace.”</p><p>Some of blockchain’s key attributes resemble those of traditional African bartering systems, like the one used in the small village where Kubyane grew up. </p><p>During the harvest season, crops could be traded for livestock in various quantities as needed. This made for some blockchain-like benefits, including traceability, as “people knew exactly where their food came from”; transparency<em>, </em>since “goods could be exchanged without intermediaries adding unnecessary markups”; and supply chain control, as “many farming families had control over their entire supply chain — however small scale — from seed banks to direct sales to consumers.”</p><p>A barter system has many limitations, of course, including a lack of scalability, and Kubyane is against turning back the clock on Africa’s modern food supply chain. But blockchain technology can help with many contemporary challenges, including “food traceability, post-harvest losses, lack of supply chain transparency, unfair trade practices, and monopolies that marginalize small and semi-commercial farmers,” he told Cointelegraph. </p><h2>Patience is required</h2><p>Overall, it may take some time to move the African farming needle. “Certainly, it will take years,” said Trask. For instance, a farm cooperative may come in and sign a contract with Dimitra and say that “they’re going to onboard 30,000 farmers. We probably never get 100% adoption; we may only get 80%.” </p><p>Moreover, only 10% of system users may be “power users,” he continued. Some may be participating because food giants like Nestle and others have told them “they had to have traceability,” Trask noted. Other farmers simply don’t want to convert to new technologies.</p><p>Another challenge is, implementing these solutions sometimes “requires too many parties to be involved or to learn about the technology,” according to ConsenSys’s Singer.</p><p>Solutions must also be accessible, affordable and scalable, added Kubyane. “It is of utmost importance to have patient capital at a significant scale.”</p><p>In sum, synergies from melding blockchains with other emerging technologies like satellite imagery, AI, mobile tech and others may one day revolutionize agriculture in the developing world. But until that day arrives, farmers in East Africa and other regions can potentially fetch higher prices for their products by tapping export markets like the EU and North America. </p><p>But to secure a permanent place at dining tables in these Western economies, they will have to convince regulators and sustainability-minded publics that their crops weren’t grown by razing woodlands or employing child labor. To accomplish that, private and public blockchains, with their enhanced tracking, tracing and certification capabilities, may prove invaluable.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-28T13:22:34.000Z",
    "title": "Cryptocurrency Entrepreneur Fernando Pérez Algaba Found Dead in Argentina",
    "url": "https://cryptobriefing.com/cryptocurrency-entrepreneur-dead-in-argentina/?utm_source=feed&utm_medium=rss",
    "description": "Argentine authorities have launched an investigation into the death of Fernando Prez Algaba, a millionaire entrepreneur and crypto influencer, following the discovery of his dismembered body in Buenos Aires Province,..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T13:15:04.000Z",
    "title": "Debunking Four Myths About AI, ML, and Data Storage For Effective Functioning",
    "url": "https://www.cryptopolitan.com/ai-ml-and-data-storage-effective-functioning/",
    "description": "Curtis Anderson, the software architect at Panasas and co-chair of the MLCommons storage working group, recently shed light on data storage&#8217;s importance in artificial intelligence and machine learning (AI/ML). He emphasized that the right storage infrastructure is crucial for the effective functioning of AI/ML applications.  The rising influence of AI/ML AI/ML, at its core, is ... <a title=\"Debunking Four Myths About AI, ML, and Data Storage For Effective Functioning\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-ml-and-data-storage-effective-functioning/\" aria-label=\"More on Debunking Four Myths About AI, ML, and Data Storage For Effective Functioning\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T13:30:41.000Z",
    "title": "Pomerdoge, Solana and AAVE. Why holders are selling and buying into the hottest new meme coin",
    "url": "https://www.crypto-news-flash.com/pomerdoge-solana-and-aave-why-holders-are-selling-and-buying-into-the-hottest-new-meme-coin/?utm_source=rss&utm_medium=rss&utm_campaign=pomerdoge-solana-and-aave-why-holders-are-selling-and-buying-into-the-hottest-new-meme-coin",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T154414.438.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T154414.438.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T154414.438-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T154414.438-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Pomerdoge is an upcoming play-to-earn blockchain game that is full of potential. Solana wants a piece of the P2E action and so they have announced GameShift to help developers create more games on the Solana blockchain. Meanwhile, Aave launches a stablecoin on the Ethereum blockchain. Here is what you need to know. Click Here To [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T13:11:08.000Z",
    "title": "Bank Of Italy Selects Polygon Labs And Fireblocks To Facilitate Financial Institutions DeFi And Tokenized Assets Exploration",
    "url": "https://www.crypto-news-flash.com/bank-of-italy-selects-polygon-labs-and-fireblocks-to-facilitate-financial-institutions-defi-and-tokenized-assets-exploration/?utm_source=rss&utm_medium=rss&utm_campaign=bank-of-italy-selects-polygon-labs-and-fireblocks-to-facilitate-financial-institutions-defi-and-tokenized-assets-exploration",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/polygon-blockchain-pr-agency-rISmip9iFHA-unsplash.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/polygon-blockchain-pr-agency-rISmip9iFHA-unsplash.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/polygon-blockchain-pr-agency-rISmip9iFHA-unsplash-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/polygon-blockchain-pr-agency-rISmip9iFHA-unsplash-1024x576.jpg 1024w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Bank of Italy Collaborates with Polygon Labs and Fireblocks to Boost Financial Institutions&#8217; DeFi and Tokenized Assets Research. Cetif Advisory&#8217;s Project Chosen by Milano Hub to Propel Institutional DeFi and Tokenization in Italy. In a significant move towards fostering a safe and open environment for supervised entities in the decentralized finance (DeFi) space, the Bank [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-28T13:24:10.000Z",
    "title": "The State of the Crypto Market (H1-2023) – Part 2",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-state-of-the-crypto-market-h1-2023-part-2/",
    "description": "<p>This is Part 2 of a 2-part series about the state of the crypto market in Q1 and Q2, 2023. CoinMarketCap made a report on this. We will look at the most engaged communities in the crypto market and key themes for H2 in 2023. Here&#8217;s the Part 1. So, let&#8217;s take a closer look [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-state-of-the-crypto-market-h1-2023-part-2/\">The State of the Crypto Market (H1-2023) – Part 2</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]