[
  {
    "source": "NewsBTC",
    "date": "2023-10-24T22:00:02.000Z",
    "title": "Bitcoin: On-Chain Tracker Points Out Interesting Difference Between Current And Past Rallies",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-current-past-ralies/",
    "description": "The current Bitcoin rally has taken most of the crypto space by surprise after going from under $27,000 to $35,000 in less than two weeks. As prices continue to fly, on-chain data tracker Santiment has revealed something different between the current Bitcoin rally and its previous rallies above $30,000. Altcoins Refuse To Fall Behind Bitcoin In the report that was posted on X (formerly Twitter), Santiment revealed that altcoins have changed their usual routine for when the Bitcoin price is surging. For instance, when Bitcoin had rallied to $30,000 in April and July of this year, altcoins had taken a back seat, allowing BTC to enjoy the shine. Related Reading: Economist Peter Schiff Raises Concerns About Spot Bitcoin ETFs This time around, the rally has been just as prominent in altcoins as it has been in Bitcoin, and in some cases, even outshining BTC’s price trajectory. Some of these altcoins that have shown teeth this time include Chainlink’s LINK, Polygon’s MATIC, Aptos’s APT, AAVE, and UIP. All of these altcoins have defied the established trend with their prices surging double-digits in a short time. Source: Santiment on X Not only are these altcoins seeing a lot of success at a time when Bitcoin would be the only one rallying, but they have also managed to decouple completely from the leading cryptocurrency. According to Santiment, all of the named altcoins “are all seeing their best performing decouplings of 2023.” Meme Coins Show Their Prowess As the crypto market rally has progressed through some of its most bullish stages, other altcoins such as meme coins have begun to also show a lot of promise. The usual culprits such as PEPE saw double-digit gains as well, with ELON rallying up to 57%. Additionally, $BITCOIN also saw a $36 rise in one week. Source: Santiment on X PEPE has continued to surge as well and is up 34.55% in the last day, bringing its weekly gains to 51.49%. The meme coin’s run has seen it emerge as a top gainer, also trending alongside the likes of Bitcoin (BTC) and Chainlink (LINK). Related Reading: Solana Remains Institutional Investor Darling As Inflows Continue Another altcoin that stands out is Troller’s TRB. The coin rose around 750% in a 3-month period to emerge as one of the winners of the rallies. It also saw large transactions from unique whale addresses, suggesting a very high level of interest in the altcoin from investors. Source: Santiment on X In all, this rally is completely different from the previous rallies recorded this year in that the whole market seems to be pulling up together. This is interesting because rallies like these are usually seen in bull markets, with 2021 serving as a perfect example. BTC price falls below $34,400 support &#124; Source: BTCUSD on Tradingview.com Featured image from Business Insider, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-24T22:01:28.000Z",
    "title": "Coinbase (COIN), Microstrategy (MSTR) and Grayscale’s Bitcoin Trust (GBTC) All Soar in Price As Crypto Heats Up",
    "url": "https://dailyhodl.com/2023/10/24/coinbase-coin-microstrategy-mstr-and-grayscales-bitcoin-trust-gbtc-all-soar-in-price-as-crypto-heats-up/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2020/12/higher-stocks.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2020/12/higher-stocks.jpg 1450w, https://dailyhodl.com/wp-content/uploads/2020/12/higher-stocks.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2020/12/higher-stocks.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2020/12/higher-stocks.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2020/12/higher-stocks.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2020/12/higher-stocks.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Three stocks associated with digital assets are soaring amid a big jump in Bitcoin (BTC) and crypto markets. Coinbase (COIN), Microstrategy (MSTR) and Grayscale Bitcoin Trust (GBTC) shares are all soaring after BTC rose over 19% in the last week. Shares of Coinbase, the largest US-based cryptocurrency exchange, are worth $82.80 at time of writing, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/24/coinbase-coin-microstrategy-mstr-and-grayscales-bitcoin-trust-gbtc-all-soar-in-price-as-crypto-heats-up/\">Coinbase (COIN), Microstrategy (MSTR) and Grayscale’s Bitcoin Trust (GBTC) All Soar in Price As Crypto Heats Up</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]