[
  {
    "source": "CryptoSlate",
    "date": "2023-08-17T00:40:59.000Z",
    "title": "Former SEC official comments on Binance.US’ request for protection",
    "url": "https://cryptoslate.com/former-sec-official-comments-on-binance-us-request-for-protection/",
    "description": "<p>Binance.US&#8217;s parent company&#8217;s request for a protective order on Aug. 14 to prevent securities regulators from making excessive demands may be on shaky grounds, according to one former official. In its original filing, BAM complained that the Securities and Exchange Commission (SEC) demanded excessive information and depositions of numerous employees. As such, BAM aimed to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/former-sec-official-comments-on-binance-us-request-for-protection/\">Former SEC official comments on Binance.US&#8217; request for protection</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-17T01:00:40.000Z",
    "title": "Early Signs Of Life: Why Bitcoin Is Likely To Move Away From $30,000 Soon",
    "url": "https://www.newsbtc.com/bitcoin-news/early-signs-of-life-why-bitcoin-is-likely-to-move-away-from-30000-soon/",
    "description": "The Bitcoin price action has been stuck in a tight range for weeks leading to the lowest volatility levels in years. A recent report hints at a potential breakout from the current range, but which side will be favorable by the potential spike in volatility? Related Reading: Bitcoin Speculators Retreat As Long-Term Holders Double Down Since $69,000 Peak As of this writing, Bitcoin trades at $28,950 with sideways movement in the last 24 hours. Over the previous seven days, the BTC’s price saw a slight downtick recording a 2% loss. Other tokens in the top 10 by market cap are underperforming, with many seeing double-digit losses on low timeframes. The Last Time The Bitcoin Price Saw Low Volatility As seen in the chart below, provided by trading desk QCP Capital in a report, annualized volatility for BTC reached critical levels seen for the first time in over five years. The metric last stood at these levels from late 2018 to 2019. The chart above also shows that volatility fluctuated from the low to the yearly high in a cycle that extended for 2019. At that time, Bitcoin and the crypto market were coming out from a prolonged bear market that, as today, left traders and market participants in shambles and with almost no appetite for risk. QCP Capital noted that from 2018 to 2019, the macroeconomic landscape dominated the Bitcoin price action. At that time, the US Federal Reserve (Fed) hiked interest rates, but the COVID-19 pandemic, which operated as a catalyzer, forced it to reverse. The latter occurred from late 2019 to 2020, when the ease in macroeconomic conditions allowed Bitcoin to soar to a new all-time high. Thus, the trading desk believes that a catalyzer is needed to push the price action back to life: The last time trading was this compressed, it was during the crypto winter of 2018 and 2019, and it took a change in the macro environment to revive the market again. However, they noted that the break of the current low volatility environment is not “imminent.” However, the upcoming decision on a Bitcoin spot Exchange Traded Fund (ETF) in the US could operate as a catalyzer, bringing BTC to its next resistance level at around $34,000, but patience is still required. Related Reading: Bitcoin &#38; Top Assets See High Loss Taking, Is This Bullish? QCP Capital concluded: Will there be a sharp rally that takes us to the 34k resistance – like the prior three times which kissed the support trendline this year? We think it could still be another quiet few weeks before we find out. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-17T00:42:42.000Z",
    "title": "TRON Joins JCBA (Japan Cryptoasset Business Association)",
    "url": "https://dailyhodl.com/2023/08/16/tron-joins-jcba-japan-cryptoasset-business-association/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2021/04/tron-crypto-livewire-featured-image-template-1.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/04/tron-crypto-livewire-featured-image-template-1.jpg 500w, https://dailyhodl.com/wp-content/uploads/2021/04/tron-crypto-livewire-featured-image-template-1.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2021/04/tron-crypto-livewire-featured-image-template-1.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2021/04/tron-crypto-livewire-featured-image-template-1.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2021/04/tron-crypto-livewire-featured-image-template-1.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>August 16, 2023 – Geneva, Switzerland TRON DAO (&#8216;TRON&#8217;) is pleased to announce that it has joined the JCBA (Japan Cryptoasset Business Association) as an associate member starting from August 1, 2023. As a leading global blockchain, TRON is committed to building cooperation and collaboration with other JCBA members to promote the growth of the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/16/tron-joins-jcba-japan-cryptoasset-business-association/\">TRON Joins JCBA (Japan Cryptoasset Business Association)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]