[
  {
    "source": "CryptoSlate",
    "date": "2023-07-27T23:00:21.000Z",
    "title": "Despite good faith actors, crypto is ‘rife with fraud; rife with hucksters,’ says Gensler",
    "url": "https://cryptoslate.com/despite-good-faith-actors-crypto-is-rife-with-fraud-rife-with-hucksters-says-gensler/",
    "description": "<p>U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler reiterated his concerns about the cryptocurrency sector, saying it is &#8220;rife with fraud&#8221; and lacks adequate protections for investors during an interview today with BBTV. The chairman&#8217;s comments come amid ongoing debates about regulatory oversight for cryptocurrencies. While Gensler allowed that the cryptocurrency sector contains reputable [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/despite-good-faith-actors-crypto-is-rife-with-fraud-rife-with-hucksters-says-gensler/\">Despite good faith actors, crypto is &#8216;rife with fraud; rife with hucksters,&#8217; says Gensler</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-27T23:00:29.000Z",
    "title": "Dogecoin Falls While Others Rally, Is It Decoupling From The Market?",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-falls-while-others-rally-is-it-decoupling-from-the-market/",
    "description": "Over the last day, the majority of the crypto market has been rallying alongside Bitcoin. But Dogecoin seems to have a mind of its own as it has gone in the opposite direction. The meme coin started out Thursday with a decline, which follows the trend of DOGE deviating from the general crypto market trend over the past week. Dogecoin Fails To Register Similar Gains To Larger Altcoins Dogecoin has struggled to keep up with the gains of top altcoins such as Ethereum and XRP. In this time, the meme coin has maintained a rather constrained trend, falling over 3% in the early hours of Thursday while the likes of Bitcoin saw recoveries. Related Reading: Bitcoin Pre-Halving Patterns Suggest Bull Market Is Not Starting In 2023 This is not the first that DOGE has gone in the opposite direction in as many days. Earlier in the week, the price of Bitcoin fell below $30,000, taking the broader market down with it. However, DOGE remained resilient in the face of this bear trend as billionaire Elon Musk reiterated his support for the digital asset once more. With the change of Twitter to X, Musk had changed his location to X but added the infamous DOGE symbol as well. This move sparked speculation of Dogecoin being integrated into the social media platform as a payment method and the price rallied as a result of this. Thus, while digital assets across the space saw their prices falling, Dogecoin was rising as high as double-digit daily gains. So the meme coin’s deviation during the market recovery comes as no surprise given the expected cool-off from its earlier rally. DOGE price struggles to break $0.08 resistance &#124; Source: DOGEUSD on Tradingview.com DOGE Becomes 7th-Largest Cryptocurrency Despite Dogecoin not following the market uptrend, the meme coin continues to maintain its standing in the market. DOGE is currently the 7th-largest cryptocurrency with a market cap of $11.1 billion. This puts it ahead of Cardano, which lost its spot to the meme coin following’s DOGE’s multiple rallies this week. However, DOGE is currently seeing a significant slowdown in its momentum with a rapid decline in daily trading volume. According to Coinmarketcap, the daily trading volume of Dogecoin is down more than 45% in the last day to rest at $678 million at this time. Related Reading: Crypto Analyst Says It’s Time To Buy Dogecoin, Here’s Why This nosedive in trading volume indicates that investors may already be moving away from the asset as they believe the rally might already be over. Given this, the meme coin may have a hard time mounting a recovery at this level. Nonetheless, the slowdown in momentum would not matter if Musk mentions the coin in the coming days as it would rally nonetheless. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]