[
  {
    "source": "CoinDesk",
    "date": "2023-06-26T16:50:31.000Z",
    "title": "Bitcoin Investment Sentiment Turned Bullish After Largest Weekly Fund Inflow in a Year",
    "url": "https://www.coindesk.com/markets/2023/06/26/bitcoin-investment-sentiment-turned-bullish-after-largest-weekly-fund-inflow-in-a-year/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The inflows totalled $199 million, reversing nearly half of the previous nine consecutive weeks of outflows."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-26T16:47:40.000Z",
    "title": "Azuki Unveils New ‘Elementals’ Collection, Expanding Its NFT Ecosystem",
    "url": "https://www.coindesk.com/web3/2023/06/26/azuki-unveils-new-elementals-collection-expanding-its-nft-ecosystem/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A portion of the yet-to-be-revealed, 20,000-edition NFT collection was airdropped to holders on Friday."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-26T16:44:46.000Z",
    "title": "Bitcoin Cash Price Jumps to One-Year High Fueled by Spiking Social Interest, Exchange Support",
    "url": "https://www.coindesk.com/markets/2023/06/26/bitcoin-cash-price-jumps-to-one-year-high-fueled-by-spiking-social-interest-exchange-support/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "With today’s 17% gain, the BCH has now more than doubled in the week since it was listed on EDX Markets, a new crypto exchange backed by financial heavyweights."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-26T16:52:33.000Z",
    "title": "Bitcoin Miner Hut 8 Borrows $50M From Coinbase for 'Treasury Management Strategy'",
    "url": "https://decrypt.co/146210/bitcoin-miner-hut-8-borrows-50m-from-coinbase-for-treasury-management-strategy",
    "description": "The $50 million credit facility from Coinbase comes in three tranches and will bolster the miner's HODL treasury strategy."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-26T16:44:10.000Z",
    "title": "Crypto investment products see largest weekly inflow since July 2022",
    "url": "https://cointelegraph.com/news/bitcoin-crypto-investments-largest-weekly-inflow-since-july-2022",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/162f0973-caf7-4bc2-b74e-e8645ced0706.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> CoinShares’ latest weekly inflow report shows a substantial increase in investor appetite for digital asset investment products with Bitcoin leading the rally.</p>\n                    <p><p>A recent surge in activity surrounding exchange-traded funds has led to the largest weekly inflow for digital asset investment products since July 2022, according to a June 26 report <a href=\"https://blog.coinshares.com/volume-137-digital-asset-fund-flows-weekly-report-a6eaca3b9dd9\" target=\"_blank\" rel=\"noopener nofollow\">via</a> CoinShares.</p><p>Totalling $199 million, inflows for the week of 19–23 June turned around <a href=\"https://cointelegraph.com/news/crypto-investment-products-experience-outflows-for-9th-consecutive-week\">a nine-week string of consecutive outflows</a>, with Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) representing the lion’s share at $187 million (94% of overall inflows). </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This week in Fund Flows, by <a href=\"https://twitter.com/jbutterfill?ref_src=twsrc%5Etfw\">@jbutterfill</a>:<br><br>A sharp shift to bullishness among investors, injecting US$199m in digital asset investment products.<br><br>This marks the largest single weekly inflow since July ’22, correcting almost half of 9 consecutive weeks of outflows.  (1/5) <a href=\"https://t.co/TvZ0EM2KLU\">pic.twitter.com/TvZ0EM2KLU</a></p>&mdash; CoinShares (@CoinSharesCo) <a href=\"https://twitter.com/CoinSharesCo/status/1673315702298607618?ref_src=twsrc%5Etfw\">June 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>CoinShares analysts attributed the reversal to increasing activity from exchange-traded product (ETP) issuers in the exchange-traded fund (ETF) space:</p><blockquote>“We believe this renewed positive sentiment is due to recent announcements from high profile ETP issuers that have filed for physically backed ETFs with the US Securities &amp; Exchange Commission.”</blockquote><p>As Cointelegraph <a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-up-today\">reported</a> on June 23, Bitcoin reached a 2023 high of $31,431 last week — movement that was largely attributed to institutional interest in ETFs, with both BlackRock and Fidelity Investments filing for spot Bitcoin ETFs in June. </p><p>While the uptick in Bitcoin inflows managed to have a small knock-on effect for Ether (ETH) — inflows increased to $7.8 million — there was no sign of follow-through for altcoins, which saw little to no positive movement outside of trickling inflows for <a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a> and Solana (<a href=\"https://cointelegraph.com/ethereum-price\">SOL</a>) in the amounts of $240,000 and $170,000 respectively.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-relists-privacy-coins-in-europe\"><strong><em>Binance reverses decision to delist privacy coins in Europe</em></strong></a></p><p>Bitcoin futures fund BITO — the ProShares Bitcoin Strategy ETF — also made waves last week with <a href=\"https://cointelegraph.com/news/proshares-bitcoin-etf-bito-weekly-inflows-largest-in-year\">its largest weekly inflow in a year</a>, a $65.3 million haul bringing its assets up to $1 billion.</p><p>These rallies come after Bitcoin dropped below $25,000 in June for the first time since mid-March after the United States Securities and Exchange Commission levied separate <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">lawsuits against Binance</a> <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">and Coinbase</a> alleging improprieties. </p><p>Last week’s Bitcoin high of $31,431 not only snapped a nine-week outflows streak for crypto assets, but also set three new all-time national cryptocurrency-based records. <a href=\"https://cointelegraph.com/news/bitcoin-price-new-all-time-highs-3-countries-btc-31k\">As Cointelegraph reported on June 25</a>, Argentina, Venezuela and Lebanon saw BTC hit its highest-ever levels against local currencies.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-26T16:55:06.000Z",
    "title": "Binance reportedly pulls out of Austria, shifts focus to MiCA compliance in Europe",
    "url": "https://cryptoslate.com/binance-reportedly-pulls-out-of-austria-shifts-focus-to-mica-compliance-in-europe/",
    "description": "<p>Binance told CryptoSlate in a June 26 email that it strives to act in compliance wherever it operates amid new reports that it withdrew from yet another European market. Earlier today, reports emerged that Binance had withdrawn its application in another European country. According to Finance Forward, Binance&#8217;s subsidiary Binance Austria GmbH withdrew its license [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-reportedly-pulls-out-of-austria-shifts-focus-to-mica-compliance-in-europe/\">Binance reportedly pulls out of Austria, shifts focus to MiCA compliance in Europe</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-26T16:41:41.000Z",
    "title": "Over 86% of unspent Bitcoin in profit as BTC continues to trade above $30k",
    "url": "https://cryptoslate.com/86-percent-of-utxos-in-profit-as-bitcoins-climb-over-30k/",
    "description": "<p>The cryptocurrency market has been a whirlwind of activity over the past week, with Bitcoin (BTC) seeing the most notable uptick, climbing over the $30,000 mark for the first time in two months, a crucial psychological milestone that could return much-needed confidence to the market. At press time, Bitcoin is trading at $30,343. Over the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/86-percent-of-utxos-in-profit-as-bitcoins-climb-over-30k/\">Over 86% of unspent Bitcoin in profit as BTC continues to trade above $30k</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-26T17:00:00.000Z",
    "title": "NEAR Foundation Partners With Alibaba Cloud For Web3 Services",
    "url": "https://cryptodaily.co.uk/2023/06/near-foundation-partners-with-alibaba-cloud-for-web3-services",
    "description": "<p class=\"md-end-block md-p md-focus\">NEAR Foundation, the firm behind the NEAR protocol ecosystem development, is partnering with Alibaba Cloud, Alibaba Group's digital technology and intelligence backbone.</p>\n<p class=\"md-end-block md-p\">The strategic alliance aims to galvanize the NEAR Foundation's reach into Alibaba Cloud's extensive developer ecosystem in Asia and the Middle East. By simplifying the process of launching new NEAR validators via Alibaba Cloud's \"plug-and-play\" infrastructure, the partnership seeks to attract more developers to build on the NEAR protocol.</p>\n\n<p class=\"md-end-block md-p\">&ldquo;Our partnership with Alibaba Cloud is a major milestone for the NEAR Foundation. It proves that NEAR protocol&rsquo;s technology can truly lift the restrictions surrounding Web3 development, allowing more creators to build exciting applications and helping to onboard billions of Web2 users to the possibility of Web3,\" said Marieke Flament, CEO of the NEAR Foundation.</p>\n\nTooling and Infrastructure: Empowering Developers\n<p class=\"md-end-block md-p\">The NEAR Foundation and Alibaba Cloud are joining forces to offer Remote Procedure Calls (RPC) as a service to developers and users in the NEAR ecosystem. This service, coupled with multi-chain data indexing, provides developers with a data-query API, simplifying the process of searching data across multiple blockchains.</p>\n<p class=\"md-end-block md-p\">App developers working on the NEAR Blockchain Operating System (BOS) can now leverage Alibaba Cloud's infrastructure. BOS offers a unified layer for browsing and discovering open web experiences compatible with any blockchain. Its standout feature, FastAuth, enables developers to onboard new users with just an email, eliminating the need for crypto.</p>\n\n<p class=\"md-end-block md-p\">&ldquo;Together with NEAR&rsquo;s Node-as-a-Service initiative and BOS, we support the Web3 community to create exciting applications that will benefit a wide consumer audience. We are looking forward to what we can achieve with this partnership,\" said Raymond Xiao, Head of International Web3 Solutions, Alibaba Cloud Intelligence.</p>\n\nMarket Response and Future Collaborations\n<p class=\"md-end-block md-p\">Following the partnership announcement, NEAR's market price witnessed an 8% surge to $1.57, signaling the market's positive response. As part of the partnership's future endeavors, both entities plan to expand their collaboration through participation in a variety of global Web3 conferences and events.</p>\n<p class=\"md-end-block md-p\">The announcement follows closely on the heels of Alibaba's appointment of new Chairman Joseph Tsai, known for his active investments in the Web3 sector.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-26T16:47:53.000Z",
    "title": "LBank Labs to Launch Global Universities Summer Bootcamp for Web3 Students",
    "url": "https://cryptodaily.co.uk/2023/06/lbank-labs-to-launch-global-universities-summer-bootcamp-for-web3-students",
    "description": "<p>Road Town, British Virgin Islands, June 26th, 2023, Chainwire</p><p>LBank Labs, the independent venture capital fund of global crypto exchange LBank, has partnered with 15 blockchain clubs of renowned universities from around the globe to host a Web3-focused summer bootcamp. Participating students will receive a bootstrap fund of $10,000 and access to Labs&rsquo; extensive network.&nbsp;</p><p>Led by LBank Labs, the Global Universities Summer Bootcamp will host students interested in Web3 from around the world. The collaboration will involve the blockchain clubs of esteemed institutions such as Stanford University, University of California, Berkeley, Columbia University, University of Pennsylvania, University of Southern California, University of Washington, Hong Kong University of Science and Technology, Paris Blockchain Business School, and Tec de Monterrey.</p><p>Under the guidance of mentors hailing from top cryptocurrency funds such as BAI Capital, Hashed, and Hashkey Investments, the summer bootcamp will provide an immersive and comprehensive learning experience in the blockchain field. Participants will have the opportunity to acquire valuable knowledge and skills while fostering connections within the industry. Students will also engage in various daily activities including surfing classes, hiking, and sampling local cuisine.</p><p>To further incentivize participants, outstanding individuals will receive startup capital of $10,000. Moreover, they will gain access to Labs&rsquo; vast network that includes 10+ global crypto funds, where the venture fund is a Limited Partner. These resources are aimed at nurturing and inspiring the next generation of blockchain innovators, equipping them with the tools needed for success.</p><p>Interested students and alumni of the participating schools who wish to apply for the summer bootcamp can do so via the official website. The submission deadline is set for July 15.</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge platform that ensures the integrity of users&rsquo; funds and aims to contribute to the global adoption of cryptocurrency.</p><p>Start Trading Now:&nbsp;lbank.com</p><p>Community &amp; Social Media:&nbsp;l&nbsp;Telegram&nbsp;l&nbsp;&nbsp;Twitter&nbsp;l&nbsp;&nbsp;Facebook&nbsp;l&nbsp;&nbsp;LinkedIn&nbsp;l&nbsp;&nbsp;Instagram&nbsp;l&nbsp;&nbsp;YouTube</p>ContactGlobal PR DirectorJeremy Van der HaegenLBankpress@lbank.info"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T16:54:46.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 While the crypto market navigated the fallout from the&#160;collapse&#160;of FTX in late 2022, Ava Labs says it dodged the bullet. Ava Labs founder and CEO Emin Gün Sirer assure its stakeholders that FTX impacts very little the companies and projects operating in the Avalanche ecosystem. The company had an account on ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T16:52:39.000Z",
    "title": "What To Do With Your Mining Rig If Ethereum Mining Is No Longer Possible?",
    "url": "https://www.cryptopolitan.com/if-ethereum-mining-is-no-longer-possible/",
    "description": "Blockchain mining was perhaps first made popular when Bitcoin mining started to gain popularity in the late 2010s. After all, mining was the only way to create Bitcoin at first, which was the only cryptocurrency. The idea of completing computational work in exchange for digital tokens that were quickly increasing in value appealed to tech-savvy ... <a title=\"What To Do With Your Mining Rig If Ethereum Mining Is No Longer Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/if-ethereum-mining-is-no-longer-possible/\" aria-label=\"More on What To Do With Your Mining Rig If Ethereum Mining Is No Longer Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T16:50:08.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T16:50:03.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T16:44:57.000Z",
    "title": "BTC sits at $30k  – Here are 5 things to know in Bitcoin this week",
    "url": "https://www.cryptopolitan.com/5-things-to-know-in-bitcoin-this-week/",
    "description": "The crypto industry has normally had negative weekend effects, but Bitcoin has lived through the period with grace. Now, Bitcoin starts a new week in a solid position above $30,000 after its latest rapid gains. According to CoinMarketCap, the price of BTC today sits at $30,270. The leading coin has a 24-hour trading volume of ... <a title=\"BTC sits at $30k  &#8211; Here are 5 things to know in Bitcoin this week\" class=\"read-more\" href=\"https://www.cryptopolitan.com/5-things-to-know-in-bitcoin-this-week/\" aria-label=\"More on BTC sits at $30k  &#8211; Here are 5 things to know in Bitcoin this week\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-26T17:08:49.000Z",
    "title": "MAS publishes report on asset tokenization and DeFi",
    "url": "https://crypto.news/mas-publishes-report-on-asset-tokenization-and-defi/",
    "description": "The Monetary Authority of Singapore (MAS) has recently disclosed a detailed report exploring the integration of asset tokenization and decentralized finance (DeFi) within global financial systems and standards."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-26T16:43:04.000Z",
    "title": "Ethscriptions launched on Ethereum, tradecurve prices up 20%",
    "url": "https://crypto.news/ethscriptions-launched-on-ethereum-tradecurve-prices-up-20/",
    "description": "Tradecurve is gaining traction and its native token, TCRV is already up 80% since launch. Its successful presale coincides with positive reception of Ethscriptions"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T16:47:56.000Z",
    "title": "LBank Labs to Launch Global Universities Summer Bootcamp for Web3 Students",
    "url": "https://www.crypto-news-flash.com/lbank-labs-to-launch-global-universities-summer-bootcamp-for-web3-students/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-labs-to-launch-global-universities-summer-bootcamp-for-web3-students",
    "description": "Road Town, British Virgin Islands, June 26th, 2023, Chainwire LBank Labs, the independent venture capital fund of global crypto exchange LBank, has partnered with 15 blockchain clubs of renowned universities from around the globe to host a Web3-focused summer bootcamp. Participating students will receive a bootstrap fund of $10,000 and access to Labs’ extensive network.  [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-26T16:51:00.000Z",
    "title": "Why Dogecoin May Hold This Key Support Amid Bears Presence",
    "url": "https://coinedition.com/why-dogecoin-may-hold-this-key-support-amid-bears-presence/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Dogecoin_Price_Retests_Macro_Support_at_0_065_for_Third_Time_in.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Why Dogecoin May Hold This Key Support Amid Bears Presence\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Dogecoin_Price_Retests_Macro_Support_at_0_065_for_Third_Time_in.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Dogecoin_Price_Retests_Macro_Support_at_0_065_for_Third_Time_in-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Dogecoin_Price_Retests_Macro_Support_at_0_065_for_Third_Time_in-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The CMF drop to -0.11 suggests that DOGE had lost the strength behind its uptrend. The RSI indicated that there was low demand but enough to keep the price above water. DOGE could end up consolidating in the short term and Open Interest shrunk. Dogecoin’s (DOGE) recovery over the last week has hit a stumbling [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/why-dogecoin-may-hold-this-key-support-amid-bears-presence/\">Why Dogecoin May Hold This Key Support Amid Bears Presence</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-26T16:55:22.000Z",
    "title": "Google Launches ‘Anti Money Laundering AI’ in Collaboration With Banking Giant HSBC",
    "url": "https://dailyhodl.com/2023/06/26/google-launches-anti-money-laundering-ai-in-collaboration-with-banking-giant-hsbc/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Suggests-Crypto-Activities-Could-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Suggests-Crypto-Activities-Could-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Suggests-Crypto-Activities-Could-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Suggests-Crypto-Activities-Could-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Suggests-Crypto-Activities-Could-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Suggests-Crypto-Activities-Could-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Suggests-Crypto-Activities-Could-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Tech titan Google is launching an artificial intelligence (AI) based anti-money laundering system after working with banking giant HSBC. According to a new statement by Google Cloud, the firm is launching a new system to help global financial institutions more efficiently detect money laundering. The product is designed to improve the traditional methods of countering [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/26/google-launches-anti-money-laundering-ai-in-collaboration-with-banking-giant-hsbc/\">Google Launches ‘Anti Money Laundering AI’ in Collaboration With Banking Giant HSBC</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]