[
  {
    "source": "Cointelegraph",
    "date": "2024-01-18T03:30:11.000Z",
    "title": " Donald Trump vows to ‘never allow’ creation of a CBDC if elected ",
    "url": "https://cointelegraph.com/news/donald-trump-former-president-vows-never-allow-cbdc-in-us",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNjUzNjljYjktODFiZS00NmVlLTkzZjMtNDg1YjdlMzg1YzkxLkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>U.S. presidential candidate Donald Trump made the promise during a campaign speech in Portsmouth to a round of cheers and applause. </p>\n                    <p><p>U.S. presidential candidate and former president Donald Trump vowed to “never allow” the Federal Reserve to create a central bank digital currency (CBDC) in the United States. </p><p>The pledge came during a campaign speech in Portsmouth, New Hampshire on Jan. 17 where the former president of the United States said: “Tonight I’m making another promise to protect Americans from government tyranny.”</p><p>“This would be a dangerous threat to freedom and I will stop it from coming to America,” he said. </p><p><a href=\"https://cointelegraph.com/news/donald-trump-former-president-vows-never-allow-cbdc-in-us\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-18T03:33:00.000Z",
    "title": "Crypto Trader Transforms $10K into $1M in 10 Days, Thanks to Elon Musk’s ‘Chief Troll Officer’ Profile Update",
    "url": "https://www.cryptoglobe.com/latest/2024/01/crypto-trader-transforms-10k-into-1m-in-10-days-thanks-to-elon-musks-chief-troll-officer-profile-update/",
    "description": "A cryptocurrency trader has managed to turn $10,000 into a $1 million stash in just 10 days, taking advantage of a small change in the profile of X CEO Elon Musk, who wrote “(CTO) Chief Troll Officer) on his profile. The trader, seeing the move, withdraw 4.313 ETH tokens from leading cryptocurrency exchange Binance, worth […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T03:26:38.000Z",
    "title": "AI Code Assistants – Navigating Productivity Peaks and Code Security Potholes",
    "url": "https://www.cryptopolitan.com/ai-code-assistants-productivity-security/",
    "description": "In the rapidly evolving landscape of software development, the role of AI code assistants is pivotal. These sophisticated tools have promised unprecedented gains in productivity and code efficiency. Yet, a recent research study has cast a shadow over this promising scenario, revealing a potential Achilles&#8217; heel—compromised code security linked to the usage of these AI [&#8230;]"
  }
]