[
  {
    "source": "CoinDesk",
    "date": "2023-07-11T11:13:46.000Z",
    "title": "Aave DAO to Vote on Gho Stablecoin Deployment on Ethereum",
    "url": "https://www.coindesk.com/tech/2023/07/11/aave-dao-to-vote-on-gho-stablecoin-deployment-on-ethereum/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "GHO has been in the works for over a year and was issued on a testnet earlier this year."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-11T11:25:43.000Z",
    "title": "MATIC Soars 9% Ahead of Polygon 2.0 Rollout, Rebounding Network Growth",
    "url": "https://decrypt.co/148047/matic-soars-9-ahead-polygon-2-0-rollout-rebounding-network-growth",
    "description": "Polygon’s uptick can likely be attributed to rebounding on-chain growth and the completion of a $66 million sell-off by bankrupt Celsius."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-11T11:26:00.000Z",
    "title": "Driving liquidity and efficiency: The essential role of crypto market makers ",
    "url": "https://cointelegraph.com/news/crypto-market-makers-driving-liquidity-efficiency",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/a37a85ad-eabc-420f-b608-57364fc022ba.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Exploring the vital role of crypto market makers in driving liquidity and stability in the digital asset markets. </p>\n                    <p><p>As the cryptocurrency market continues to mature, the importance of market makers in maintaining liquidity and stability has grown respectively. Similar to the worldwide trend of increased regulation, market makers are acquiring prominence in the evolving cryptocurrency landscape.</p><p>By partnering with exchanges, such as Binance, Coinbase, KuCoin and others, market makers try to reduce spreads in highly liquid markets, benefiting both retail and institutional participants. <a href=\"https://research.cointelegraph.com/reports/detail/crypto-market-makers-database\">Cointelegraph Research has compiled a database</a> of about 50 crypto market makers operating worldwide, with detailed information on their activities and focus.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/2f654977-9e5a-4692-84b3-4873da61366e.jpg\"  /></figure><h2>Why are market makers needed?</h2><p>Market makers play a crucial role in digital asset markets by absorbing sudden fluctuations in supply and demand, stabilizing prices and providing a more predictable trading environment.</p><p>However, it is also true that market makers may not always be effective. For example, factors such as speculative trading, limited liquidity and sudden market movements can make it challenging for market makers to mitigate price volatility. </p><p class=\"post-content__accent post-content__accent_small\"><a href=\"https://research.cointelegraph.com/reports/detail/crypto-market-makers-database\">Explore Cointelegraph Research Market Makers Database here</a></p><p>Market makers maintain a presence in the market by simultaneously offering competitive bids and asking prices for a given cryptocurrency. To illustrate, let us consider a scenario where a market maker places a bid to purchase a cryptocurrency at a price of $99 and concurrently sets an ask price to sell the same cryptocurrency at $100. The disparity between these bid and ask prices, commonly referred to as the spread, represents the profit margin captured by the market maker.</p><h2>Strategies and speculations</h2><p>Market makers employ advanced algorithmic trading strategies to optimize their operations. These strategies involve analyzing market data, identifying trading opportunities, leveraging technologies and various trading techniques to provide continuous liquidity and respond to market changes effectively. </p><p>Also, market makers are not limited to their role of liquidity providers. They can also be market manipulators and possess an in-depth understanding of the market and its patterns, including pending orders, the distribution of volumes and the levels at which stop-losses and take-profits are set.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/b2076ea7-0579-4d5b-9b0c-ed1955e95400.jpg\"  /></figure><p>For example, if Ether’s (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) price is steadily rising, a market maker may notice a concentration of stop-loss orders around $2,500, accompanied by limited buyer interest at that level.</p><p>To take advantage of this situation, a market maker may enter the market with a significant buying volume between $2,400 and $2,450 and absorb the available counter orders, considering their known volume. Consequently, the price briefly dips to $2,500, triggering the stop-loss orders placed by other traders. Shortly after, Ether experiences a rapid surge, reaching, for example, $2,600. At this point, the market maker will exit the trade.</p><h2>Staying informed and thriving in the market</h2><p>Overall, crypto market makers are vital; however, they face a variety of challenges in the crypto space, including regulatory uncertainty, price manipulation concerns and crypto volatility. Especially in the United States, the Securities and Exchange Commission has been actively <a href=\"https://www.sec.gov/spotlight/cybersecurity-enforcement-actions\" target=\"_blank\" rel=\"noopener nofollow\">monitoring</a> the cryptocurrency market, leading to heightened industry problems. </p><p>Accordingly, staying up-to-date with the latest industry shifts and strategies is crucial to thriving in the crypto market-making landscape, and the <a href=\"https://research.cointelegraph.com/reports/detail/crypto-market-makers-database\">Cointelegraph Research Market Makers Database</a> is <a href=\"https://research.cointelegraph.com/reports/detail/crypto-market-makers-database\">here</a> to help.</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-11T11:15:00.000Z",
    "title": "Was Multichain A Rug Pull?",
    "url": "https://cryptodaily.co.uk/2023/07/was-multichain-a-rug-pull",
    "description": "<p>Blockchain security and analytics firm Chainalysis has suggested that the multimillion-dollar exploit of the Multichain Protocol could be indicative of a rug pull.&nbsp;</p>\nMultimillion Dollar Exploit Was Inside Job?&nbsp;\n<p>The cross-chain bridge protocol Multichain has fallen victim to a multimillion-dollar exploit that Chainalysis believes is an inside job. The incident, which took place on July 6, 2023, involved unauthorized withdrawals of an unusually large scale and resulted in a staggering loss of around $130 million.&nbsp;</p>\n<p>The aftermath of this exploit has left the blockchain community stunned, as Multichain was once regarded as a promising cross-chain bridge protocol. However, with the suspicion of an inside job, questions arise regarding the integrity and security practices within the organization.</p>\nHacker Seized MPC Keys&nbsp;\n<p>Chainalysis expressed its suspicions in its July 10th blog post calling the situation &ldquo;a hack or rug pull by insiders.&rdquo; This aligns with the prior claims made by blockchain security firm SlowMist, which also raised the possibility of internal involvement.&nbsp;</p>\n<p>The latter tweeted,&nbsp;</p>\n\n<p>&ldquo;It appears that activity has stopped. However, with multiple bridges all being drained, this looks more like a hack or rug pull and less like a migration. Please do not use and revoke all permission related to Multichain.&rdquo;</p>\n\n<p>Explaining the technical aspects of Multichain's smart contracts, Chainalysis highlighted their use of a multiparty computation (MPC) system, much like a multisignature wallet. The firm suggested that the attacker might have gained control of Multichain's MPC keys to orchestrate this exploit. While acknowledging the chance of external hackers obtaining the keys, experts and analysts are leaning toward an inside job or rug pull due to recent questionable incidents surrounding the protocol.</p>\nShady Incidents At Multichain\n<p>One prominent example of these incidents happened toward the end of May, when the protocol&rsquo;s CEO, &ldquo;Zhaojun&rdquo; went missing. There was immediate speculation that Chinese authorities had arrested him.</p>\n<p>Additionally, the platform suffered from delayed transactions and various technical problems, leading Binance to withdraw its support for several bridged tokens on July 7.</p>\n<p>As the investigation unfolds, blockchain analysts have uncovered further dubious token movements associated with Multichain. These abnormal outflows included draining token addresses across multiple chains through the Multichain executor address.</p>\n<p>Furthermore, on July 8, stablecoin issuers Circle and Tether took swift action by freezing over $65 million in assets linked to the Multichain exploit. Also, the fact that the exploiter did not bother swapping out the centrally controlled assets like USDC, which can be easily frozen by the issuing company, just adds to the dubious nature of the entire situation.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T11:25:34.000Z",
    "title": "How Can An AI Program Predict CKD Risk from Retinal Examination?",
    "url": "https://www.cryptopolitan.com/ai-program-predicts-ckd-retinal-examination/",
    "description": "Severance Hospital has achieved a significant breakthrough in healthcare by developing artificial intelligence (AI) software that can predict the risk of chronic kidney disease (CKD) based on retinal examination results. Led by Professors Joo Young-soo at Yongin Severance Hospital and Park Jung-tak at Severance Hospital, the research team has harnessed the power of AI to ... <a title=\"How Can An AI Program Predict CKD Risk from Retinal Examination?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-program-predicts-ckd-retinal-examination/\" aria-label=\"More on How Can An AI Program Predict CKD Risk from Retinal Examination?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-11T11:30:48.000Z",
    "title": "Market Watch: FIL, SPCT, and TRX Take Over the Crypto Bull Run in July",
    "url": "https://www.crypto-news-flash.com/market-watch-fil-spct-and-trx-take-over-the-crypto-bull-run-in-july/?utm_source=rss&utm_medium=rss&utm_campaign=market-watch-fil-spct-and-trx-take-over-the-crypto-bull-run-in-july",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-11T122207.586.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-11T122207.586.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-11T122207.586-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Recently, Filecoin (FIL), TRON (TRX), and VC Spectra (SPCT) have witnessed significant increases in their respective values, positioning them as noteworthy cryptocurrencies to monitor during the anticipated July market surge. Out of the three, VC Spectra (SPCT) has established itself as the most promising option, and investors are rushing to buy SPCT  tokens for a [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-11T11:29:00.000Z",
    "title": "VC Firm Founder Calls Binance “Ponzi,” Compares With Bankrupt FTX",
    "url": "https://coinedition.com/vc-firm-founder-calls-binance-ponzi-compares-with-bankrupt-ftx/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/The-Face-off-between-Binance-and-FTX-Crypto-Exchanges-Explained.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"The Face-off between Binance and FTX Crypto Exchanges Explained\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/The-Face-off-between-Binance-and-FTX-Crypto-Exchanges-Explained.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/The-Face-off-between-Binance-and-FTX-Crypto-Exchanges-Explained-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/The-Face-off-between-Binance-and-FTX-Crypto-Exchanges-Explained-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/The-Face-off-between-Binance-and-FTX-Crypto-Exchanges-Explained-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/The-Face-off-between-Binance-and-FTX-Crypto-Exchanges-Explained-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/The-Face-off-between-Binance-and-FTX-Crypto-Exchanges-Explained-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Venture capital firm Cinneamhain Ventures founder Adam Cochran called out Binance for being a “Ponzi” scheme with an evident “hole across multiple assets.” Comparing the leading exchange with FTX, Cochran said while all funds haven’t yet disappeared, users don’t deserve to pay for CEO Changpeng Zhao’s mistakes. The above was part of a Twitter thread [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/vc-firm-founder-calls-binance-ponzi-compares-with-bankrupt-ftx/\">VC Firm Founder Calls Binance “Ponzi,” Compares With Bankrupt FTX</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-11T11:10:00.000Z",
    "title": "US Dollar Depreciation Could Spike Crypto Prices, Says Analyst",
    "url": "https://coinedition.com/us-dollar-depreciation-could-spike-crypto-prices-says-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Crypto_Is_NOT_Ready_For_This_Massive_Bitcoin_Move_Coming-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Prominent crypto analyst and trader Michael Pizzino believes the US dollar&#8217;s decline could spike the prices of cryptocurrencies. In a recent YouTube video, Pizzino discussed a possible breakdown in the US dollar and its far-reaching consequences for the economy. The video highlights how a weaker USD could positively affect assets priced in US dollars, such [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/us-dollar-depreciation-could-spike-crypto-prices-says-analyst/\">US Dollar Depreciation Could Spike Crypto Prices, Says Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]