[
  {
    "source": "CoinDesk",
    "date": "2023-08-15T13:00:00.000Z",
    "title": "Dinari Raises $7.5M for Decentralized Stock Trading Platform",
    "url": "https://www.coindesk.com/business/2023/08/15/dinari-raises-75m-for-decentralized-stock-trading-platform/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Backers for the dShares platform, which will be available ex-US, included a Susquehanna subsidiary."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-15T13:00:00.000Z",
    "title": "De.Fi's Antivirus Tool Releases on zkSync Era Mainnet",
    "url": "https://www.coindesk.com/tech/2023/08/15/defis-antivirus-tool-releases-on-zksync-era-mainnet/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The antivirus tool protects users against common malicious crypto exploits, such as phishing, smart contract vulnerabilities, blind signing, and more."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-15T13:01:00.000Z",
    "title": "SEC delays set deadline for Bitcoin ETF approval to early 2024",
    "url": "https://cointelegraph.com/news/bitcoin-etf-approval-2024",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/f408a7f8-e596-46a1-a5bd-0e2937d32b08.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>With a maximum 240-day window available to the SEC to delay crypto ETF applications, some firms could wait until March 2024 to hear decisions on filings made in July 2023.</p>\n                    <p><p>The United States Securities and Exchange Commission (SEC) — the financial regulator with the final say over allowing a spot cryptocurrency exchange-traded fund (ETF) — may be moving closer to giving the investment vehicle the green light after several years of applications.</p><p>In June, the world’s largest asset management firm, BlackRock, <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">added its application</a> to the bundle of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETF filings currently being reviewed by the SEC, creating renewed interest among investors in and out of the crypto space. The company later added a “surveillance-sharing agreement” with cryptocurrency exchange Coinbase following reports the SEC could be more open to accepting an ETF application under such conditions.</p><p>BlackRock is one of many firms with crypto ETF applications in the SEC pipeline. ARK Invest, under CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/cathie-wood\">Cathie Wood</a>, filed to list its ARK 21Shares spot Bitcoin ETF in May 2023 and received the most recent delay from the SEC on Aug. 11, <a href=\"https://cointelegraph.com/news/sec-punts-ark21shares-spot-bitcoin-etf-opens-proposal-comments\">pushing back the deadline</a> another 21 days as the regulator opens the proposal to public comments.</p><p>Under SEC guidelines, the federal regulator has the authority to delay ETF applications for up to 240 days — by opening them to public comment or otherwise — from the first filing in the Federal Register. Even so, the SEC has never approved a spot Bitcoin ETF proposal from any firm in the United States and only started accepting investment vehicles tied to BTC futures in October 2021. </p><p>One of the challenges behind getting the SEC to allow a spot crypto ETF may be the nature of the investment vehicle. Bitcoin futures-linked ETFs also enable individuals and companies to invest in the crypto asset without an exchange, while a spot BTC ETF could involve holding Bitcoin within a fund for more direct investment.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/1_RCqOFYSzE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Gemini co-founders <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/winklevoss-twins\">Cameron and Tyler Winklevoss</a> were the first to <a href=\"https://www.sec.gov/Archives/edgar/data/1579346/000119312513279830/d562329ds1.htm\" target=\"_blank\" rel=\"noopener nofollow\">apply</a> for a crypto exchange-traded product listing using their Bitcoin Trust in July 2013, when many regulators might not have even understood digital currencies and the SEC ultimately rejected the application.</p><p>Stuart Barton, co-founder and chief investment officer of Volatility Shares — the firm behind the <a href=\"https://cointelegraph.com/news/volatility-shares-trust-listing-leveraged-bitcoin-futures-etf\">listing of a leveraged Bitcoin futures ETF</a> in June — told Cointelegraph its process of applying with the SEC involved back-and-forth negotiations. The regulator proposed changes to disclosure documents but was generally “cooperative.” He speculated that smaller firms might have more of an edge with the SEC on a spot crypto ETF offering.</p><p>“Big companies have been doing the same thing they’ve been doing for years,” said Barton. “Yeah, there are new applications, new filings… they haven’t really moved the argument along.”</p><p>At the time of publication, major asset management firms with <a href=\"https://cointelegraph.com/news/spot-crypto-etf-applications-federal-register-sec-approval\">spot Bitcoin ETF applications under review</a> by the SEC include BlackRock, ARK Invest, Bitwise Asset Management, VanEck, WisdomTree, Invesco and Galaxy Digital, Fidelity and Valkyrie. With the maximum 240-day extension window available to the SEC, the final deadline for ARK’s Bitcoin ETF is in January 2024, while approval or disapproval of all the other firms’ offerings could come as late as March 2024. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-decision-bitcoin-etfs-wont-leave-out-wall-street-giants\"><strong><em>SEC decision on Bitcoin ETFs won’t leave out Wall Street giants</em></strong></a></p><p>Part of the SEC’s seeming reluctance to sign off on a spot crypto ETF could be from the nature of the crypto market in the United States, which, while regulated, has left many lawmakers and industry leaders calling for greater clarity and oversight. The SEC is currently pursuing enforcement cases against Coinbase, Binance and Ripple, and it has already <a href=\"https://cointelegraph.com/news/sec-announces-24m-settlement-case-against-bittrex-former-ceo\">levied financial penalties</a> against firms such as Bittrex. Barton added:</p><blockquote>“Both sides are going to bend a little bit. I think the SEC are going to have to be a little bit more open-minded [...] There’s going to be a lot more bending, I think, from the crypto side.”</blockquote><p>U.S. lawmakers are currently considering legislation to better define the roles the SEC and Commodity Futures Trading Commission (CFTC) should have in regulating digital assets. In addition, both the regulator and industry may have to consider court decisions until regulations are better defined, as a judge in the SEC vs. Ripple case largely <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">ruled that XRP was not a security</a>, creating ramifications for everyone dealing with crypto in the United States.</p><p>“[The ETF application process] puts the SEC in an incredibly powerful position,” said Barton. “Gensler has a great amount of sway in that; the political makeup of the commission definitely influences that.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><p>As of August, certain analysts have <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-approval-chances-65\">suggested that the chances</a> of a spot Bitcoin ETF being approved in the U.S. are close to 65% based partly on BlackRock’s application. Both Cathie Wood and Grayscale — the asset manager currently suing the SEC over its ETF application — have hinted that the regulator could approve multiple applications simultaneously to avoid any company having an advantage over another.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-15T13:00:53.000Z",
    "title": "Fake beta-testing apps enlisted to rob cryptocurrency, FBI reports",
    "url": "https://cryptoslate.com/fake-beta-testing-apps-enlisted-to-rob-cryptocurrency-fbi-reports/",
    "description": "<p>The U.S. Federal Bureau of Investigation (FBI) warned that fraudulent beta-testing applications were masquerading as genuine cryptocurrency investment platforms to steal funds from unsuspecting victims, according to an Aug. 15 notice. The law enforcement agency revealed that cybercriminals engaged victims through dating and networking apps. These malicious actors persuaded individuals to download harmful beta-testing apps, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/fake-beta-testing-apps-enlisted-to-rob-cryptocurrency-fbi-reports/\">Fake beta-testing apps enlisted to rob cryptocurrency, FBI reports</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-15T12:55:23.000Z",
    "title": "Europe’s First Spot BTC ETF Launches on Euronext Amsterdam",
    "url": "https://cryptobriefing.com/europe-launches-first-spot-btc-etf/?utm_source=feed&utm_medium=rss",
    "description": "Jacobi Asset Management debuts a unique spot Bitcoin ETF on Euronext Amsterdam for European institutional investors."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-15T12:44:00.000Z",
    "title": "Understanding the Factors Influencing Cryptocurrency Prices",
    "url": "https://www.cryptoglobe.com/latest/2023/08/understanding-the-factors-influencing-cryptocurrency-prices/",
    "description": "Disclaimer: This article is sponsored content and should not be considered as financial or investment advice. Always do your own research before making any financial decisions. The opinions expressed in this article are those of the author and do not necessarily reflect the views of CryptoGlobe. Cryptocurrencies have gained significant popularity in recent years, attracting […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-15T12:45:58.000Z",
    "title": "LBank Revives IEO: A Look at the IEO Powerhouse LBank and its Historical Yields",
    "url": "https://news.bitcoin.com/lbank-revives-ieo-a-look-at-the-ieo-powerhouse-lbank-and-its-historical-yields/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/762032a9-e635-4bd2-8cb1-5048c3b72027-768x432.jpeg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/762032a9-e635-4bd2-8cb1-5048c3b72027-300x169.jpeg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/762032a9-e635-4bd2-8cb1-5048c3b72027-1024x576.jpeg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/762032a9-e635-4bd2-8cb1-5048c3b72027-768x432.jpeg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/762032a9-e635-4bd2-8cb1-5048c3b72027-190x107.jpeg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/762032a9-e635-4bd2-8cb1-5048c3b72027-380x214.jpeg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/762032a9-e635-4bd2-8cb1-5048c3b72027-760x428.jpeg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/762032a9-e635-4bd2-8cb1-5048c3b72027.jpeg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />As the cryptocurrency market has witnessed a decline for over a year, many investors have chosen to liquidate their assets or move to alternative markets. However, 2023 has painted a different picture, positioning cryptocurrency as one of the best-performing investments. According to CoinMarketCap, the total crypto market capitalization rebounded from a low of $780.9 billion [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-15T13:00:10.000Z",
    "title": "Singapore Wraps Up Stablecoin Framework: Pathway to Global Adoption?",
    "url": "https://www.newsbtc.com/stablecoin/singapore-stablecoin-framework-pathway-to-global-adoption/",
    "description": "The Monetary Authority of Singapore (MAS) has unveiled the features of a new regulatory framework aimed at ensuring a high degree of stability for stablecoins in the country. This is the outcome of the central bank’s public consultation, which commenced in October 2022. Feedback from this public consultation was considered during the design of this new set of stablecoin rules in Singapore. According to MAS, these rules will apply to single-currency stablecoins (SCS) pegged to the Singapore dollar or any G10 currency &#8211; including the US dollar. MAS Releases “Key Requirements” For Stablecoin Issuers In Singapore In a media release published on Tuesday, August 15, the Monetary Authority of Singapore outlined key requirements for issuers of single-currency stablecoins in the country. The new regulatory framework for stablecoins consists of various provisions relating to value stability, base capital, redemption timeframes, and disclosure. Related Reading: US Congresswoman Raises Concerns About Paypal Stablecoin In The Absence Of Regulation The central bank stated that reserve assets &#8211; of a stablecoin &#8211; will be subject to requirements relating to their composition, valuation, custody, and audit, to give a high level of assurance on value stability.  Meanwhile, issuers are required to maintain minimum base capital and liquid assets to lower the risk of bankruptcy. This is to also facilitate an “orderly wind-down” of business &#8211; if the need arises. Additionally, SCS issuers in Singapore must refund the equivalent value of the stablecoins to holders within five business days after a redemption request is submitted.  Finally, the Monetary Authority of Singapore has mandated all stablecoin companies to provide appropriate disclosures to their users. Some of the information they are expected to disclose to their customers include SCS’ value stabilizing mechanism, the rights of SCS holders, and the audit results of reserve assets. The MAS noted that only issuers that fulfill all requirements under this new regulatory framework can apply for their stablecoins to be recognized as “MAS-regulated stablecoins.”  However, the financial regulator also warned issuers against misrepresenting their tokens as MAS-regulated stablecoins, as it may result in penalties under the revised stablecoin regulatory framework. MAS&#8217; Stablecoin Regulatory Framework &#8211; A Positive Sign For Global Adoption? In the press release, the MAS defined stablecoins as digital payment tokens designed to maintain a constant value against one of more specified fiat currencies. “When well-regulated to preserve such value stability, stablecoins can serve as a trusted medium of exchange to support innovation, including the “on-chain” purchase and sale of digital assets,” it added. Meanwhile, Ms. Ho Hern Shin, MAS’ deputy managing director, reacted to this development in a statement:  MAS’ stablecoin regulatory framework aims to facilitate the use of stablecoins as a credible digital medium of exchange and as a bridge between the fiat and digital asset ecosystems. We encourage SCS issuers who would like their stablecoins recognized as “MAS-regulated stablecoins” to make early preparations for compliance. Taking these statements into account, this new regulatory framework represents a positive attitude by the Singaporean authorities towards the use of stablecoin as a trusted means of payment. Moreover, it is expected to provide the needed clarity for stablecoin companies to operate in the country. It is worth mentioning that Singapore is not the only country making positive strides in terms of stablecoin regulation. There have also been discussions on regulating these digital payment tokens in the United States. Related Reading: Can PayPal’s PYUSD Be Frozen In Your Wallet Like Tether’s USDT? In what was dubbed a &#8220;momentous move&#8221;, the US House Financial Services Committee recently advanced a bill titled “Clarity for Payments Stablecoin.” This proposed bill, if passed, will regulate the issuance and use of payment stablecoins in the United States. Crypto Total Market Cap at $1.15 trillion &#124; Source: daily TOTAL chart from TradingView &#160; Featured image from Shutterstock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T12:55:04.000Z",
    "title": "Game-Changer: Europe Welcomes Its First Bitcoin Spot ETF from Billion-Dollar Asset Manager – Will It Push BTC Price to $50,000? Details",
    "url": "https://www.crypto-news-flash.com/game-changer-europe-welcomes-its-first-bitcoin-spot-etf-from-billion-dollar-asset-manager-will-it-push-btc-price-to-50000-details/?utm_source=rss&utm_medium=rss&utm_campaign=game-changer-europe-welcomes-its-first-bitcoin-spot-etf-from-billion-dollar-asset-manager-will-it-push-btc-price-to-50000-details",
    "description": "<img width=\"1000\" height=\"333\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Volodymyr-Plysiuk-Bitcoin-ETF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin Spot ETF\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Volodymyr-Plysiuk-Bitcoin-ETF.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Volodymyr-Plysiuk-Bitcoin-ETF-300x100.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Volodymyr-Plysiuk-Bitcoin-ETF-768x256.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Jacobi Asset Management achieves a milestone by launching Europe&#8217;s pioneering spot Bitcoin ETF on Euronext Amsterdam.  This ETF stands out for its ESG dedication, incorporating Renewable Energy Certificates. Jacobi Asset Management has reached a noteworthy achievement by launching Europe&#8217;s first spot Bitcoin ETF on Euronext Amsterdam. This ETF is remarkable not only due to its [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-15T12:56:00.000Z",
    "title": "BTC Soaring to $250K-$600K Is Not Far-Fetched, Says Analyst",
    "url": "https://coinedition.com/btc-soaring-to-250k-600k-is-not-far-fetched-says-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/With_Bitcoin_jumping_a_cool_26_in_the_past_30_days_March_was.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"With_Bitcoin_jumping_a_cool_+26%_in_the_past_30_days,_March_was\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/With_Bitcoin_jumping_a_cool_26_in_the_past_30_days_March_was.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/With_Bitcoin_jumping_a_cool_26_in_the_past_30_days_March_was-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/With_Bitcoin_jumping_a_cool_26_in_the_past_30_days_March_was-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/With_Bitcoin_jumping_a_cool_26_in_the_past_30_days_March_was-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/With_Bitcoin_jumping_a_cool_26_in_the_past_30_days_March_was-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/With_Bitcoin_jumping_a_cool_26_in_the_past_30_days_March_was-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Kyledoops from Crypto Banter highlighted the fact that the legendary trader Michael J. Burry, who was portrayed in the movie the Big Short, recently opened a substantial short position against the financial market. Despite this bet against the traditional financial market, another analyst that was in the video, MDX Crypto, is bullish on Bitcoin (BTC) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/btc-soaring-to-250k-600k-is-not-far-fetched-says-analyst/\">BTC Soaring to $250K-$600K Is Not Far-Fetched, Says Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]