[
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T02:28:23.000Z",
    "title": "Apple's Vision Pro headset reveal swaps metaverse for 'spatial computing'",
    "url": "https://cointelegraph.com/news/apple-vision-pro-headset-wwdc-no-mention-metaverse",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/21d10858-08c9-46c6-8fd5-c12b4c1f75ab.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Metaverse tokens have failed to pump following the major announcement, however this is likely due to the SEC abruptly dropping a lawsuit against Binance.  </p>\n                    <p><p>Apple’s newly revealed mixed-reality headset, the Apple Vision Pro, has both turned tech-enthusiast heads and raised eyebrows after its unveiling at the WWDC on June 5. </p><p>There was however, one glaring omission from the launch — a single mention of the word “metaverse.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Apple Vision Pro is everything we hoped for and then some. <br><br>But at $3,499 you&#39;re either an early adopter or a AR/VR developer.<br><br>Yet two things change after today:<br><br>1. &quot;Metaverse&quot; will stop being a bad word (even though Apple didn&#39;t use the word) - sparking a resurgence in… <a href=\"https://t.co/x8FcGsKTbj\">pic.twitter.com/x8FcGsKTbj</a></p>&mdash; Bilawal Sidhu (@bilawalsidhu) <a href=\"https://twitter.com/bilawalsidhu/status/1665808948614578180?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The tech company appears to have taken deliberate steps to call its technology the first “spatial computer.” It will be launched in the U.S. in early 2024, for a hefty retail price of $3,499, and will roll out to other countries shortly after. </p><p>The announcement is a firm step away from Microsoft’s Hololens launches and that of Meta’s headsets, which both notably used the term generously in comparison.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/d6bf908b-bb53-4b9a-a031-f5a04a1b8c4e.png\"  /><figcaption style=\"text-align: center;\"><em>Using apps with Apple Vision Pro. Source: Apple</em></figcaption></figure><p>Instead, Apple’s marketing is focused on the words “spatial” and “spatial computing” as opposed to words such as “metaverse,” “AR” and \"VR.\"</p><p>“Creating our first spatial computer required invention across nearly every facet of the system,” noted Apple’s vice president of the technology development group, Mike Rockwell. </p><p>“Through a tight integration of hardware and software, we designed a standalone spatial computer in a compact wearable form factor that is the most advanced personal electronics device ever,” he said.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/bc66d987-ec14-4561-9b2f-5fce6e5a6782.png\"  /><figcaption style=\"text-align: center;\"><em>Looking at photos with Apple Vision Pro. Source: Apple</em></figcaption></figure><p>Back in January 2022, Bloomberg’s Apple tech reporter Mark Gurman suggested via Twitter that the firm has no intention of <a href=\"https://cointelegraph.com/news/nifty-news-mike-tyson-loves-solana-aoki-stops-show-to-flaunt-nft-apple-and-the-ar-verse\">approaching the sector</a> in a similar vein to<a href=\"https://cointelegraph.com/news/metaverse-division-s-4b-loss-drags-on-positive-first-quarter-for-meta\"> Mark Zuckerberg’s Meta</a>, particularly relating to the notion of the Metaverse. </p><p>“I’ve been told pretty directly that the idea of a completely virtual world where users can escape to — like the can in Meta Platforms/Facebook’s vision of the future — is off-limits from Apple,” Gurman said, adding that the firm will place its focus providing a mixed-reality headset intended for use in short bursts for work, gaming, communication, etc. </p><p> Apple's Vision Pro has both augmented reality and virtual reality capabilities, as it can make it look like apps have been projected out into the nearby physical space around the user, or provide a fully virtual experience via modes such as Immersive Environments.</p><p>“Featuring visionOS, the world’s first spatial operating system, Vision Pro lets users interact with digital content in a way that feels like it is physically present in their space,” the announcement reads. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/tim-cook-says-apple-will-weave-ai-into-products-as-researchers-work-on-solving-bias\"><strong><em>Tim Cook says Apple will weave AI into products as researchers work on solving bias</em></strong></a></p><p>Anticipation over Apple’s new headset had some investors hoping metaverse-related <a href=\"https://cointelegraph.com/news/apple-headset-could-boost-metaverse-token\">tokens would see a meteoric rise</a>, however, a new SEC lawsuit on the same day appears to have spoiled optimism for <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">metaverse-related tokens</a>.</p><p>According to Coingecko, the top-ranked metaverse token Internet Computer (<a href=\"https://cointelegraph.com/internet-computer-icp-price-index\">ICP</a>) is down 9.5% over the past 24 hours, while second and third-placed The Sandbox (<a href=\"https://cointelegraph.com/the-sandbox-sand-price-index\">SAND</a>) and Decentraland (<a href=\"https://cointelegraph.com/decentraland-mana-price-index\">MANA</a>) are also down 12.7% and 11.2% apiece. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e02d6085-65eb-49ae-9d08-eabf74d8f884.png\"  /><figcaption style=\"text-align: center;\"><em>Metaverse token prices. Source: CoinGecko</em></figcaption></figure><p>Going further down the list, there are no projects of note with positive price action over that time frame, with the total market cap for metaverse tokens decreasing by 10% to $7.7 billion over the past 24 hours.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/illuvium-assassins-creed-epic-games-store/\"><strong><em>Web3 Gamer: Illuvium controversy, Aurory Prologue review, Fornite CEO salty, Assassin’s Creed NFTs </em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T02:10:08.000Z",
    "title": "Ex-NFL team owner Reggie Fowler gets 6 years for crypto ‘shadow banking’",
    "url": "https://cointelegraph.com/news/nfl-reggie-fowler-six-years-shadow-banking-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/9c08ea9e-7c76-48a9-a289-5ee5f8153b83.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>U.S. Attorney Damian Williams said Fowler’s lies exposed the U.S. financial system to “serious risk.”</p>\n                    <p><p>Reginald Fowler, a former NFL team owner, has been sentenced to six years of prison for operating as a “shadow bank” to the crypto sector, which involved over $700 million in unregulated transactions over a 10 month timespan in 2018.</p><p>The 63-year-old, who was a co-owner of the Minnesota Vikings, was sentenced to a total of 75 months on <a href=\"https://cointelegraph.com/news/us-attorney-seeks-7-year-sentence-for-exec-in-crypto-shadow-banking-case\">bank fraud and money laundering charges</a>, according to a <a href=\"https://www.justice.gov/usao-sdny/pr/former-co-owner-minnesota-vikings-sentenced-75-months-prison-providing-shadow-banking\" target=\"_blank\" rel=\"noopener nofollow\">statement</a> from the United States Attorney’s Office in New York on June 5.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Former co-owner of Minnesota Vikings sentenced to 75 months in prison for providing shadow banking services to cryptocurrency exchanges<a href=\"https://t.co/Nc2PVhEajw\">https://t.co/Nc2PVhEajw</a></p>&mdash; US Attorney SDNY (@SDNYnews) <a href=\"https://twitter.com/SDNYnews/status/1665772186353672195?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>It marks the end of a five-year long case that began when he was arrested in 2019 for alleged shadow banking. Shadow banking is a term used to describe (often illegal) bank-like activities that are carried out by non-bank entities. </p><p>Fowler initially <a href=\"https://cointelegraph.com/news/reginald-fowler-pleads-not-guilty-to-new-crypto-capital-charges\">pleaded not guilty</a> to all charges in 2020, but changed his plea to guilty in April 2022. </p><p>In his latest statement, U.S. Attorney Damian Williams said that a string of lies enabled Fowler to mislead and deceive several banks:</p><blockquote>“Reginald Fowler evaded federal law by processing hundreds of millions of dollars of unregulated transactions on behalf of cryptocurrency exchanges as a shadow bank. He did so by lying to legitimate U.S. financial institutions, which exposed the U.S. financial system to serious risk.”</blockquote><p>Williams then said Fowler “victimized” the Alliance of American Football (AAF) — a former professional football league — by lying about his net worth in order to own a “substantial” stake in the league. </p><p>“Let it be clear: this Office is committed to prosecuting people who lie to banks and skirt the law as a means to conduct their business,” the U.S. Attorney stressed. </p><p>According to Williams, Fowler managed to pull this off by establishing Global Trading Solutions (GTS) around February 2018, which worked with Crypto Capital and other crypto firms operating out of Israel.</p><p>There, Fowler, GTS and the crypto firms sidestepped a license by lying to banks in order to open accounts that were used to process crypto transactions. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">OK -now at crypto Fowler sentencing. It was set for 10: FOwler just came in at 10:19 am. Inner City Press is covering the case <a href=\"https://t.co/S97h82I3FP\">https://t.co/S97h82I3FP</a> and will live tweet, thread below <a href=\"https://t.co/HapbKHoHaz\">pic.twitter.com/HapbKHoHaz</a></p>&mdash; Inner City Press (@innercitypress) <a href=\"https://twitter.com/innercitypress/status/1665725772764532741?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Fowler opened a dozen of these accounts to facilitate these crypto transactions without the banks’ knowledge and failed to disclose GTS’s relationship with the crypto firms, Williams said:</p><blockquote>“At no point were FOWLER, GTS, nor any of the Crypto Companies ever licensed as a money transmitting business in the United States, as required by federal law.”</blockquote><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/cryptocurrency-has-become-a-playground-for-fraudsters\"><strong>Cryptocurrency has become a playground for fraudsters</strong></a></p><p>One of the crypto firms involved was iFinex Inc — the parent company of crypto exchange Bitfinex and stablecoin issuer Tether, it claimed. </p><p><a href=\"https://cointelegraph.com/news/reginald-fowler-pleads-not-guilty-to-new-crypto-capital-charges\">Other convictions included</a> bank fraud conspiracy, operation of an unlicensed money-transmitting business, conspiracy to operate an unlicensed money-transmitting business, and wire fraud.</p><p>In addition to the prison sentence, Fowler was ordered to forfeit $740 million and pay over $53 million in restitution to the AAF.</p><p><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong>Unstablecoins: Depegging, bank runs and other risks loom</strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  }
]