[
  {
    "source": "Cryptopolitan",
    "date": "2023-11-27T21:08:35.000Z",
    "title": "Unthinkable Bitcoin fee drama, $3 million lost in alleged hack",
    "url": "https://www.cryptopolitan.com/bitcoin-fee-3-million-lost-in-alleged-hack/",
    "description": "A Bitcoin user has claimed to be the victim of hacking, leading to a record-breaking transaction fee of over $3 million. This incident, which has garnered significant attention, involves an unusually high fee of 83.65 BTC (approximately $3.1 million) paid for a single Bitcoin transaction. The unfolding of an unprecedented event The sequence of events ... <a title=\"Unthinkable Bitcoin fee drama, $3 million lost in alleged hack\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-fee-3-million-lost-in-alleged-hack/\" aria-label=\"More on Unthinkable Bitcoin fee drama, $3 million lost in alleged hack\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-27T21:01:20.000Z",
    "title": "UAE officially stops using dollar for oil trades",
    "url": "https://www.cryptopolitan.com/uae-stops-using-dollar-for-oil-trades/",
    "description": "The global financial landscape is witnessing a seismic shift as the United Arab Emirates (UAE) boldly moves away from the US dollar in its oil trade dealings. This strategic pivot aligns with the broader ambitions of the BRICS economic alliance, of which the UAE is a recent addition. The changeover, involving the transition to local ... <a title=\"UAE officially stops using dollar for oil trades\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uae-stops-using-dollar-for-oil-trades/\" aria-label=\"More on UAE officially stops using dollar for oil trades\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-27T21:00:16.000Z",
    "title": "Hamas And Hezbollah Pick Tron Instead Of Bitcoin In Crypto Shift, Report",
    "url": "https://www.newsbtc.com/analysis/trx/hamas-and-hezbollah-pick-tron-instead-of-bitcoin-in-crypto-shift-report/",
    "description": "TRON (TRX), a blockchain-based digital platform, has surpassed Bitcoin (BTC) as the platform of choice for financial transfers by groups such as Hamas and Hezbollah, which are designated terrorist organizations by the US, UK, and other countries. According to a Reuters report, this development has opened a new front in Israel&#8217;s battle against the funding of alleged Iranian-backed militant groups. Tron Wallets Targeted In Israeli Seizures According to the report, a comprehensive analysis of crypto seizures announced by Israeli security services since 2021 highlights a significant increase in targeting TRON wallets and a decrease in seizures related to Bitcoin wallets. The National Bureau for Counter Terror Financing (NBCTF) of Israel, responsible for seizure operations, froze a total of 143 TRON wallets between July 2021 and October 2023, believing them to be associated with &#8220;designated terrorist organizations&#8221; or involved in &#8220;severe terror crimes.&#8221;  Notably, 87 of these seizures occurred this year, including 39 wallets linked to Lebanon&#8217;s Hezbollah and 26 wallets associated with Palestinian Islamic Jihad, a Hamas ally. Related Reading: Blast Surpasses Cardano And Base – Here’s How Much DeFi Investors Have Locked In response to heightened scrutiny of Hamas&#8217; financing, Israel intensified its investigation efforts. It discovered that 56 TRON wallets were connected to Hamas, with 46 traced back to a Gaza-based money exchange company called Dubai Co. For Exchange.  Following the recent Hamas attacks on Israel, the largest crypto account seizure to date was announced, freezing approximately 600 accounts associated with Dubai Co.  Per the report, several individuals whose funds were frozen in this seizure claimed to have been using TRON for legitimate business or personal financial purposes and denied any affiliation with Hamas or Islamic Jihad.  However, Israel designates Dubai Co. as a terrorist group due to its alleged aid to Hamas, particularly in transferring substantial funds on an annual basis. Key Blockchain For Tether Transactions When contacted by Reuters, a spokesperson for TRON, Hayward Wong, emphasized that all technologies have the potential for misuse, citing the example of US dollars being employed for money laundering.  Wong further stated that TRON lacks control over how its technology is utilized and asserted that it is not linked to the groups identified by Israel. The report also sheds light on the dominance of the cryptocurrency Tether (USDT) within the TRON network. Tether stated that it routinely traces and freezes tokens used for illicit purposes, working in collaboration with law enforcement agencies. According to Reuters, TRON has become the primary blockchain for Tether transactions, hosting a remarkable $48 billion worth of the tokens. Average daily transactions on Tron jumped to 9.1 million from April to June, a remarkable increase of over 70% compared to last year. However, as reported by our sister website Bitcoinist, Tron has faced its share of controversies. The founder of Tron, Justin Sun, sued the US Securities and Exchange Commission (SEC) in March on allegations of artificially inflating trading volumes and selling unregistered Tron tokens. Related Reading: XRP Price Manipulated? Crypto Pundits Alarmed By Market Patterns It is important to note that crypto transactions related to terrorist groups have been decreasing since 2021 as seen in the chart below. Unlike traditional payment methods, Bitcoin and cryptocurrencies provide authorities with a backdoor, a transparent path that has allowed them to put a halt to illegal money flows. The unfolding developments in this matter are yet to be fully determined, and it remains uncertain whether there will be additional lawsuits and enforcement actions against crypto companies and exchanges implicated in these allegations. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-27T21:00:55.000Z",
    "title": "Crypto Assets Will Massively Outperform Tech as Key Catalyst Starts To Kick In: Macro Guru Raoul Pal",
    "url": "https://dailyhodl.com/2023/11/27/crypto-assets-will-massively-outperform-tech-as-key-catalyst-starts-to-kick-in-macro-guru-raoul-pal/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Crypto-a-Better-Option.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Crypto-a-Better-Option.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Crypto-a-Better-Option.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Crypto-a-Better-Option.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Crypto-a-Better-Option.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Crypto-a-Better-Option.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Crypto-a-Better-Option.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Former Goldman Sachs executive Raoul Pal says that digital assets are set to outrun tech stocks as an important catalyst begins to appear. The Real Vision CEO tells his one million followers on the social media platform X that dollar liquidity is ultimately what drives risk assets like stocks and crypto. He shares a chart [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/27/crypto-assets-will-massively-outperform-tech-as-key-catalyst-starts-to-kick-in-macro-guru-raoul-pal/\">Crypto Assets Will Massively Outperform Tech as Key Catalyst Starts To Kick In: Macro Guru Raoul Pal</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-27T20:55:12.000Z",
    "title": "New Airdrop Incoming As Cosmos Co-Founder Moves To Fork Network Amid Governance Change",
    "url": "https://dailyhodl.com/2023/11/27/new-airdrop-incoming-as-cosmos-co-founder-moves-to-fork-network-amid-governance-change/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/10/cosmos-primed-parabolic.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/10/cosmos-primed-parabolic.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/10/cosmos-primed-parabolic.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/10/cosmos-primed-parabolic.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/10/cosmos-primed-parabolic.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/10/cosmos-primed-parabolic.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/10/cosmos-primed-parabolic.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Cosmos (ATOM) founder Jae Kwon is forking the interoperable blockchain following a successful governance proposal to put a 10% cap on ATOM inflation. Proposal 848, which was largely based on the idea that ATOM is overpaying for its security, brought down inflation from roughly 14% to 10%, and also lowered staking rewards. However, Kwon didn&#8217;t [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/27/new-airdrop-incoming-as-cosmos-co-founder-moves-to-fork-network-amid-governance-change/\">New Airdrop Incoming As Cosmos Co-Founder Moves To Fork Network Amid Governance Change</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]