[
  {
    "source": "Cointelegraph",
    "date": "2024-03-27T02:22:12.000Z",
    "title": " Bitcoin gears up for a ‘massive’ short squeeze, price could go ‘vertical’  ",
    "url": "https://cointelegraph.com/news/bitcoin-short-squeeze-liquidation-price-vertical-swan-bitcoin-swyftx",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZmM1MDAyMjQtZmIwMy00ZGQwLWFjZTQtMTA2Njg0NzE3NTNlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Swyftx lead analyst Pav Hundal says this isn’t a “classic bulls versus bear battle,” while Swan Bitcoin CEO Cory Klippsten predicts “somebody gotta break at some point.” </p>\n                    <p><p>As Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) toes around the $70,000 price mark, there’s speculation that short-sellers are feeling the pressure due to diminishing downtrends and quicker-moving uptrends, potentially driving Bitcoin’s price to $80,000, according to an analyst.</p><p>“This is a textbook sign that shorts are being squeezed as we hit fresh all-time high territory,” trading resource The Kobeissi Letter stated in a March 26 X <a href=\"https://twitter.com/KobeissiLetter/status/1772683234347716818\" target=\"_blank\" rel=\"noopener nofollow\">post</a>.</p><p>The Kobeissi Letter explained the main factor for the BTC short squeeze is the margin between institutional long positions and hedge fund short positions is “at a record high.”</p><p><a href=\"https://cointelegraph.com/news/bitcoin-short-squeeze-liquidation-price-vertical-swan-bitcoin-swyftx\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-27T02:28:40.000Z",
    "title": "Ethereum Price May Have Another Chance For A Bullish Streak: Here’s How",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-bullish-streak-3680/",
    "description": "Ethereum price is showing positive signs above the $3,550 zone. ETH must clear the $3,680 resistance to continue higher in the near term. Ethereum started another increase above the $3,550 resistance zone. The price is trading above $3,550 and the 100-hourly Simple Moving Average. There is a major bullish trend line forming with support at $3,590 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to rise if it settles above the $3,680 resistance zone. Ethereum Price Remains In Uptrend Ethereum price started another increase above the $3,500 resistance zone. ETH bulls were able to push the price in a positive zone above the $3,580 level, like Bitcoin. ETH climbed above the $3,650 resistance zone. A high was formed at $3,680 before the price started a downside correction. There was a minor decline below the $3,600 level. The price declined below the 23.6% Fib retracement level of the upward move from the $3,302 swing low to the $3,680 high. Ethereum is now trading above $3,580 and the 100-hourly Simple Moving Average. There is also a major bullish trend line forming with support at $3,590 on the hourly chart of ETH/USD. Source: ETHUSD on TradingView.com On the upside, immediate resistance is near the $3,640 level. The first major resistance is near the $3,680 level. The next key resistance sits at $3,720, above which the price might gain bullish momentum. In the stated case, Ether could rally toward the $3,800 level. If there is a move above the $3,800 resistance, Ethereum could even climb toward the $3,880 resistance. Any more gains might call for a test of $4,000. Are Dips Supported In ETH? If Ethereum fails to clear the $3,640 resistance, it could start another decline. Initial support on the downside is near the $3,590 level and the trend line. The first major support is near the $3,550 zone. The next key support could be the $3,500 zone or the 50% Fib retracement level of the upward move from the $3,302 swing low to the $3,680 high. A clear move below the $3,500 support might send the price toward $3,390. Any more losses might send the price toward the $3,250 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $3,590 Major Resistance Level – $3,680"
  }
]