[
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T09:01:54.000Z",
    "title": "Most fear since SVB collapse — 5 things to know in Bitcoin this week",
    "url": "https://cointelegraph.com/news/btc-price-fear-svb-5-things-bitcoin-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/a510c7d4-8b47-4cdf-bbe1-3903ef6f8cf9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin traders are truly \"spooked\" and sentiment crashes harder than BTC price as the shake-up from last week's losses continues.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) starts a new week with traders licking their wounds after a 10% snap crash.</p><p>BTC price action is struggling to recover from a manic end to the days prior to the weekend, and the fear is palpable going into what could turn out to be an equally volatile few days.</p><p>With $26,000 so far forming the focus for the markets, theories are brewing over where Bitcoin might head next.</p><p>Multiple factors are set to converge to provide some influence — United States macro data prints are firing up again, while the Federal Reserve will deliver key commentary on the economy at the annual Jackson Hole Economic Symposium.</p><p>Within Bitcoin, meanwhile, short-term holders now face increasing unrealized losses, and on-chain transactions in loss are setting multi-year highs.</p><p>Sentiment is back on the floor, but is the fear really justified?</p><p>Cointelegraph takes a look at these topics and more ahead of what promises to be an interest week for crypto markets.</p><h2>BTC order book \"ghost town\" after OI obliterated</h2><p>While many expected volatility to kick in around the Aug. 20 weekly close, Bitcoin in the end produced something of a non-event, data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> shows, with $26,300 capping the extent of its upside.</p><p>A subsequent comedown took the market back to the $26,000 mark, where it traded at the time of writing.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/6e6be76d-2839-4b06-869e-2bd0cd2953b0.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><p>After a week of mayhem, traders and analysts alike remained highly cautious on the outlook, with sources referencing various triggers for new downside.</p><p>“Traders still spooked, expecting more downside,” trading suite Decentrader <a href=\"https://twitter.com/decentrader/status/1693514194660798830/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in an X update on Aug. 21.</p><p>Decentrader noted that traders were positioned short across exchanges after a major open interest wipeout during last week’s drop.</p><p>“Funding rates continue to be negative,” it added.</p><p>Maartunn, a contributor to on-chain analytics platform CryptoQuant, <a href=\"https://twitter.com/JA_Maartun/status/1693336137400475672\" target=\"_blank\" rel=\"noopener nofollow\">described</a> Binance order book liquidity as a “ghost town.”</p><p>“This will open the door for volatility, in case you've missed it,” he suggested, alongside a chart showing liquidity and whale order volumes from monitoring resource Material Indicators.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/8e244b3d-c093-41d2-b123-feb2c476248d.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD order book data and whale volume for Binance. Source: Maartunn/X</em></figcaption></figure><p>Maartunn nonetheless reasoned that upside could come as a result, given historical precedent.</p><p>“In the entire history of Bitcoin, there were 11 times when Open Interest had a similar decline as three days ago. Among these eleven, eight led to increased prices, whereas three did not,” part of a separate analysis <a href=\"https://twitter.com/JA_Maartun/status/1693473008957214939\" target=\"_blank\" rel=\"noopener nofollow\">stated</a>.</p><p>As Cointelegraph <a href=\"https://cointelegraph.com/news/how-low-can-the-bitcoin-price-go\">reported</a>, overall long and short liquidations reached levels comparable to the aftermath of the November 2022 FTX implosion.</p><h2>Bitcoin traders weigh \"consolidation scenario\"</h2><p>The quiet weekend gave some traders pause for thought. Bitcoin, they argued, might now open the door to a new phase of rangebound trading.</p><p>“Bitcoin fell off back into the previous range. Most likely outcome for next week is to keep trading the range imo,” popular trader CrypNuevo <a href=\"https://twitter.com/CrypNuevo/status/1693367049311891639\" target=\"_blank\" rel=\"noopener nofollow\">told</a> X subscribers. </p><blockquote>“I would like to see a false move to the downside to $25700-$25800 on Monday and then a relief bounce the rest of the week till mid-range $27k.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/243dc504-537c-4576-99f4-f0a8ae8cc955.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: CrypNuevo/X</em></figcaption></figure><p>Fellow trader Crypto Tony eyed a reclaim of the weekend’s $26,300 local top as a call to action.</p><p>“Until then i am sitting on hands waiting for Bitcoin next move,” he <a href=\"https://twitter.com/CryptoTony__/status/1693514016667349112\" target=\"_blank\" rel=\"noopener nofollow\">concluded</a>.</p><p>Maartunn likewise acknowledged that a consolidation period for BTC/USD was “not unlikely.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Another possible scenario for <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> is a period of consolidation.<br><br>This is not unlikely, as we have witnessed such consolidation multiple times in the past following significant market movements.<a href=\"https://t.co/pfl62msjJm\">https://t.co/pfl62msjJm</a> <a href=\"https://t.co/1jeRb6eJfL\">pic.twitter.com/1jeRb6eJfL</a></p>&mdash; Maartunn (@JA_Maartun) <a href=\"https://twitter.com/JA_Maartun/status/1693352698438132012?ref_src=twsrc%5Etfw\">August 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On weekly timeframes, trader Skew outlined upside, downside and consolidation scenarios all being possible.</p><p>“Consolidation scenario is chopping between $25K &amp; $30K ~ long term range,” he <a href=\"https://twitter.com/52kskew/status/1693432428743004446\" target=\"_blank\" rel=\"noopener nofollow\">confirmed</a> alongside an illustrative chart.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2ec62209-ab17-4305-910d-3219f20f1be1.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Skew/X</em></figcaption></figure><h2>Key timing for Powell's Jackson Hole speech</h2><p>While last week was quiet in terms of United States macroeconomic data releases, the coming five days promises a key change of tempo.</p><p>U.S. jobless claims will hit on Aug. 24, with home sales and other data preceding them.</p><p>“Volatility is officially back,” financial commentary resource The Kobeissi Letter summarized to X subscribers.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Key Events This Week:<br><br>1. Existing Home Sales data - Tuesday<br><br>2. US Services PMI data - Wednesday<br><br>3. New Home Sales data - Wednesday<br><br>4. Core Durable Goods data - Thursday<br><br>5. Initial Jobless Claims - Thursday<br><br>6. Fed Chair Powell Speaks - Friday<br><br>Volatility is officially back.</p>&mdash; The Kobeissi Letter (@KobeissiLetter) <a href=\"https://twitter.com/KobeissiLetter/status/1693253603438268603?ref_src=twsrc%5Etfw\">August 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Traders and analysts, however, have their eyes mostly set on Jerome Powell, Chair of the Federal Reserve, who will take to the stage at the annual Jackson Hole Economic Symposium on Aug. 25.</p><p>Jackson Hole is a classic venue for market volatility, and given the current climate, this year’s event should be no exception.</p><p>“The Fed's annual Jackson Hole meeting is more important than ever this week,” Kobeissi added.</p><p>Powell will be joined by speakers including Christine Lagarde, Chair of the European Central Bank (ECB).</p><p>With both the Nasdaq and S&amp;P 500 joining crypto in a week of losses, historical patterns could still turn the tables as Jackson Hole traditionally provides risk-on relief.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">More often than not, stocks rise the week after Jackson Hole<br><br>Will this year follow the pattern, or will it be one of the outlier years with a sell-off?  <a href=\"https://t.co/QPST4p9HUs\">pic.twitter.com/QPST4p9HUs</a></p>&mdash; Markets &amp; Mayhem (@Mayhem4Markets) <a href=\"https://twitter.com/Mayhem4Markets/status/1693271443222487479?ref_src=twsrc%5Etfw\">August 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Popular trader and analyst Miles Johal was also hopeful, noting that unlike stocks and Bitcoin, U.S. dollar strength faced an uphill struggle.</p><p>“SPX - Uptrend, at support and oversold. BTC - Uptrend, at support and oversold. DXY - Downtrend, at resistance and overbought. US10Y - Double top pattern, at resistance and overbought,” he <a href=\"https://twitter.com/JohalMiles/status/1692914318256259457\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> to X subscribers. </p><blockquote>“Lining up very clearly. $BTC and Equities bias is vertical up after the correction is over.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/e8ef5077-b751-461e-9e09-b3f51af303b2.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Macro asset comparison annotated chart. Source: Miles Johal/X</em></figcaption></figure><p>Kobeissi meanwhile added that the equity put/call ratio had reached its highest since the start of 2023, suggesting a volatile move would soon hit.</p><p>“Are markets bracing for a major pullback or is another short squeeze about to begin?” it <a href=\"https://twitter.com/KobeissiLetter/status/1693420874378973327\" target=\"_blank\" rel=\"noopener nofollow\">queried</a>.</p><h2>On-chain losses mount as speculators feel the pressure</h2><p>It will come as little surprise that Bitcoin’s 11% drop engendered a considerable shake-up in on-chain profitability metrics.</p><p>Among these is the adjusted Spent Output Profit Ratio (aSOPR), which tracks aggregate profitability of all transactions, excluding those with an age of one hour or less.</p><p>This “price sold versus price paid” ratio is now back below 1, the barrier between profit and loss, to hit its lowest levels in five months, per <a href=\"https://twitter.com/glassnodealerts/status/1693416445659505076\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from on-chain analytics firm Glassnode.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/8c234b94-1b8c-407b-9914-b0b424b3c952.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin aSOPR chart. Source: Glassnode/X</em></figcaption></figure><p>Glassnode also <a href=\"https://twitter.com/glassnodealerts/status/1693507037043282078\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> a three-year high in the seven-day average number of unspent transaction outputs (UXTOs) in loss.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3be98052-84b9-4a52-a6fa-877a4c46565e.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin UTXOs in loss chart. Source: Glassnode/X</em></figcaption></figure><p>At that time, BTC/USD was seeing another August retracement — one that was nonetheless short lived, with September seeing its final visit to $10,000 before launching to new all-time highs later in 2020.</p><p>Speculators were on the receiving end of most of the pain this time around, with Bitcoin currently <a href=\"https://cointelegraph.com/news/bitcoin-speculators-btc-since-69k-all-time-highs\">trading below the cost basis</a>, or realized price, of short-term holders (STHs) — entities holding BTC for under 155 days.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/4955170c-6448-41d1-906f-40a13f37a7b3.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin hodler cohort realized price chart. Source: Glassnode</em></figcaption></figure><h2>Familiar fear</h2><p>Could Bitcoin in fact not be as weak as the market makes out?</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-bearadise-20k-back-btc-price-target\">Bitcoin on the way to 'bearadise?' $20K is back as a BTC price target</a></em></strong></p><p>Sentiment data suggests a knee-jerk reaction as the defining response to recent BTC price action — and the dust may be yet to settle.</p><p>According to the <a href=\"https://alternative.me/crypto/fear-and-greed-index/\" target=\"_blank\" rel=\"noopener nofollow\">Crypto Fear &amp; Greed Index</a>, the average crypto investor is more scared now than at any time since the <a href=\"https://cointelegraph.com/news/silicon-valley-bank-collapse-everything-that-s-happened-until-now\">Silicon Valley Bank (SVB) collapse</a> in March.</p><p>At just 38/100, “fear” is firmly in command as the new week begins, with Fear &amp; Greed dropping 16 points over the past seven days.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/a7418e81-d852-45d2-9b83-699e4b16eb6b.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto Fear &amp; Greed Index (screenshot). Source: Alternative.me</em></figcaption></figure><p>Among those calling for a more balanced take on the status quo, meanwhile, is trading team Stockmoney Lizards. BTC price performance regularly encounters the kind of drawback seen last week, it argued, making this month nothing new.</p><p>“Bitcoin sell off and everyone is yelling 10k,” it <a href=\"https://twitter.com/StockmoneyL/status/1692857926665240890\" target=\"_blank\" rel=\"noopener nofollow\">summarized</a> at the weekend, commenting on a comparative chart of price action in the current halving cycle versus its previous one.</p><blockquote>“The history of BTC is lined with such sell offs and the market will recover from it as it did in the past.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/08126ad4-2873-42a6-a5be-5cd1e00eeb05.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD comparative chart. Source: Stockmoney Lizards/X</em></figcaption></figure><p>Popular trader and analyst Rekt Capital went into further detail, noting several 20%+ drawdowns in 2023 alone on BTC/USD.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">All <a href=\"https://twitter.com/hashtag/BTC?src=hash&amp;ref_src=twsrc%5Etfw\">#BTC</a> pullbacks in 2023:<br><br>• Early February -12%<br><br>• Late February -22%<br><br>• March -9%<br><br>• April to June -20%<br><br>• July to August -12%<a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> <a href=\"https://twitter.com/hashtag/Crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#Crypto</a> <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> <a href=\"https://t.co/4pmBXPY0fp\">pic.twitter.com/4pmBXPY0fp</a></p>&mdash; Rekt Capital (@rektcapital) <a href=\"https://twitter.com/rektcapital/status/1692235356706427245?ref_src=twsrc%5Etfw\">August 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Data from monitoring resource <a href=\"https://coinglass.com/today\" target=\"_blank\" rel=\"noopener nofollow\">CoinGlass</a> puts August 2023 losses at -10.8% as of Aug. 21.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/c528775e-6fc2-4a18-bf62-44df47af4b01.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD monthly returns table (screenshot). Source: CoinGlass</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-21T09:00:56.000Z",
    "title": "Terra official website compromised, replaced with phishing site",
    "url": "https://cryptoslate.com/terra-official-website-compromised-replaced-with-phishing-site/",
    "description": "<p>Terra&#8217;s official website has been reportedly replaced by a phishing site, cautioning a potential threat to the digital assets of its users. According to posts from the official Terra Twitter account, users are urged to refrain from interacting with the terra(dot)money domain until further updates confirming full access are provided. Following the incident, the official [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/terra-official-website-compromised-replaced-with-phishing-site/\">Terra official website compromised, replaced with phishing site</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-21T09:00:11.000Z",
    "title": "Islamic Coin Announces Token Sale & Appoints Republic As Web3 Advisor",
    "url": "https://cryptodaily.co.uk/2023/08/islamic-coin-announces-token-sale-appoints-republic-as-web3-advisor",
    "description": "<p>Zug, Switzerland, August 21st, 2023, Chainwire</p><p>Islamic Coin, a Shariah-compliant, ethics-first, digital money that has been featured globally, has announced it is working with Republic Crypto, the web3 advisory group within global digital finance leader, Republic. </p><p>The collaboration includes white-glove support to promote Islamic Coin's go-to-market strategy, along with advisory services focused on tokenomics, DAO governance, and long-term economic utility value. Republic Crypto will also help engage with potential strategic partners, exchanges, and market makers.</p><p>Fine-tuning the Islamic Coin value proposition, Republic Crypto advised on creating fair and Shariah-compliant allocation options, distribution, and other mechanisms aimed at adding to the sustainability features in the ecosystem.</p><p>Separately, Islamic Coin plans to conduct a Reg D public token offering facilitated by OpenDeal Broker on Republic's retail investment platform in September 2023. Upon public launch, Islamic Coin's international community will reap various advantages, including options to offer liquidity, stake their holdings, and gain tokens during the liquidity mining stage.</p><p>The Advisory Board of Islamic Coin is steered by members of ruling families of the UAE, including the grandson of UAE founder, Sheikh Dr. Hazza bin Sultan bin Zayed Al Nahyan, the country&rsquo;s Navy Chief, Sheikh Saeed bin Hamdan bin Mohammed Al Nahyan (serving in a private advisory capacity), Sheikh Khalifa Bin Mohammed bin Khalid Al Nahyan, Sheikh Mohammad Bin Khalifa Bin Mohammad Bin Khalid Al Nahyan, His Highness Sheikh Juma bin Maktoum Al Maktoum, and Her Highness Sheikha Mariam Suhail Obaid Suhail Al Maktoum.</p><p>The Executive Board is also composed of experts from both traditional and Islamic finance. It humbly highlights Emaar's Hussein Al Meeza (also a co-founder), an award-winning banker with over four and a half decades of experience across the Islamic banking, finance, and insurance industries. He was a key figure in the establishment of the Dubai Islamic Bank, one of the first fully operational Islamic Banks. The Executive Board is further strengthened by Khamis Buharoon AI Shamsi, the former Assistant Director of the Finance Division, and Assistant Director of the Internal Audit Division of the Central Bank of the UAE. Adding to the team's robust profile, Greg Gigliotti, CEO, Chief Investment Officer, and Founding Partner of Xtellus Advisors. With a rich background at Goldman Sachs and other global institutions, Gigliotti has managed a portfolio exceeding $16 billion throughout his career.</p><p>The Reg D offering is slated for September 2023.</p><p>ABOUT REPUBLIC:</p><p>Republic is a global technology firm pioneering the digital transformation of finance. The Republic ecosystem is composed of an enterprise-focused digital merchant bank and a network of international retail investment platforms. Republic has made it possible for 3+ million community members across 150+ countries to deploy $2.5+ billion into thousands of private ventures. </p><p>Backed by Valor Equity Partners, Galaxy Interactive, Morgan Stanley, Hashed, AngelList, and other leading institutions, Republic is headquartered in New York City and has established operations in the US, UK, UAE, South Korea, and Singapore.</p><p>Republic Crypto Disclaimer: https://republic.com/islamic-coin-crypto-disclaimer.</p>ContactPR Manager of Islamic CoinAnastasiia KulibabaIslamic Coinanastasiia@inputpr.com+380632528270"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-21T08:45:34.000Z",
    "title": "Binance Coin Slides Under $220 – What Comes Next After Consolidation?",
    "url": "https://www.newsbtc.com/breaking-news-ticker/binance-coin-slides-under-220-what-comes-next-after-consolidation/",
    "description": "Binance Coin (BNB) faced a weekend of market indecision, leading the altcoin into a range-trading scenario. The coin, which had dropped below the $220 mark on August 18, experienced fluctuations between the narrow range of $213 to $220 over the course of the weekend.  As of the latest update, CoinGecko reported the current BNB price at $216, marking a 0.3% decline over the past 24 hours and a significant seven-day slump of 10%. Related Reading: Hedera (HBAR) Rises As Weekend’s Top 50 Sole Gainer With 14% Rally Binance Coin (BNB) price action today. Source: Coingecko The past year has been marked by significant challenges for BNB, largely attributed to the regulatory uncertainties surrounding its parent company, Binance. The situation escalated in June when the US Securities and Exchange Commission categorized BNB and its sibling token, Binance USD (BUSD) stablecoin, as securities within the context of its lawsuit against the cryptocurrency exchange.  Despite vehement opposition from Binance and the exchange’s chief, the impact on BNB&#8217;s demand has been evident, with cautious investors steering clear of assets entangled in regulatory ambiguities. Binance Coin Market Dynamics And CEO&#8217;s Stance Binance CEO Changpeng “CZ” Zhao recently took to the social media platform X (formerly Twitter) to address growing speculation that Binance was proactively shoring up BNB&#8217;s price to prevent it from dipping below $212.  CZ refuted these claims, asserting that BNB&#8217;s price was, in fact, shaped by market forces. He challenged the notion of artificial price support and emphasized that the coin&#8217;s valuation was ultimately determined by its interaction with the open market. This declaration marked an attempt to alleviate concerns that the exchange was manipulating the token&#8217;s price. And where did the $212 magic number come from? #BNB price is determined by the market. A $30m re-buy is less than 4% of a single day&#8217;s volume. 🤷‍♂️ — CZ 🔶 Binance (@cz_binance) August 19, 2023 On-Chain Activity And DeFi&#8217;s Influence The decline in BNB&#8217;s price can also be attributed to diminished on-chain activity on the Binance Smart Chain, a prominent layer1 smart contract blockchain. Decentralized Finance (DeFi) activities have experienced a significant contraction, with the weekly exchange volume plummeting from its peak of $24.70 billion to a mere $2.34 billion, as per DeFillama data.  Source: Defillama Moreover, the total value of assets within the Binance Smart Chain ecosystem has dwindled by a staggering 87%, now resting at $2.84 billion, according to DeFillama&#8217;s statistics. Related Reading: Ordinals Sales In Freefall: 97% Decrease Sparks Worries About Bitcoin NFT’s Extinction Binance Coin: Navigating The Crossroads As BNB navigates these uncertain waters, traders and investors remain at a crossroads, carefully assessing the potential for regulatory clarity, market dynamics, and the revitalization of on-chain activities to influence the coin&#8217;s trajectory.  BNB market cap currently at $33 billion. Chart: TradingView.com The weekend&#8217;s range trading and the response from Binance&#8217;s CEO underscore the complexities of BNB&#8217;s journey, as it strives to regain its footing amidst a landscape marked by challenges and opportunities. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Siam Blockchain"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T09:09:37.000Z",
    "title": "Holesky Update Unveiled: Ethereum’s Path to Enhanced Performance and $1680 Price Target",
    "url": "https://www.crypto-news-flash.com/holesky-update-unveiled-ethereums-path-to-enhanced-performance-and-1680-price-target/?utm_source=rss&utm_medium=rss&utm_campaign=holesky-update-unveiled-ethereums-path-to-enhanced-performance-and-1680-price-target",
    "description": "<img width=\"1920\" height=\"1067\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/ethereum-7162361_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum Name Service\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/ethereum-7162361_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/ethereum-7162361_1920-300x167.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/ethereum-7162361_1920-1024x569.jpg 1024w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Ethereum&#8217;s Holesky mainnet, set to launch on September 15, 2023, is anticipated to replace Goerli as a staking, infrastructure, and protocol-developer testnet. Recent market activities hint at Ethereum&#8217;s potential price swings, influenced in part by the potential approval of an Ethereum-based futures ETF. In a wave of enthusiasm and anticipation, recent revelations from the ethereum [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T09:00:38.000Z",
    "title": "OKB’s (OKB) Market Strategy – How Pomerdoge’s (POMD) Unique Concept Could Change The Game",
    "url": "https://www.crypto-news-flash.com/okbs-okb-market-strategy-how-pomerdoges-pomd-unique-concept-could-change-the-game/?utm_source=rss&utm_medium=rss&utm_campaign=okbs-okb-market-strategy-how-pomerdoges-pomd-unique-concept-could-change-the-game",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-86.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-86.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-86-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-86-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />High volatility is a basic feature of the crypto market. Therefore, investors should make investments while keeping it in mind. In 2023, Pomerdoge emerged as the most profitable investment option due to its high market viability and acceptance. Meanwhile, OKB (OKB) has taken measures to support its price trajectory. Summary OKB (OKB) has taken efforts [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-21T09:00:18.000Z",
    "title": "3 More LOW RISK/HIGH GAIN Altcoins",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/3-more-low-risk-high-gain-altcoins/",
    "description": "<p>I have been looking at low-risk high-gain crypto opportunities lately. I did a video on it a couple of days back where I covered 3 altcoins. While some of you disagreed with my research, some of you really suggested some really good projects.  I did a little more research on one of the altcoins you [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/3-more-low-risk-high-gain-altcoins/\">3 More LOW RISK/HIGH GAIN Altcoins</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]