[
  {
    "source": "Decrypt",
    "date": "2024-03-21T00:40:45.000Z",
    "title": "‘Why Were the Bitcoins Missing?’: FTX Bankruptcy Lead Slams SBF's ‘Delusional’ Defense",
    "url": "https://decrypt.co/222686/why-bitcoins-missing-delusional-ftx-sam-bankman-fried-victim-statement",
    "description": "The renown bankruptcy attorney tapped to lead the dismantling of collapsed crypto exchange FTX said victims are still suffering."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-21T01:02:57.000Z",
    "title": "What’s pushing down Bitcoin’s hodler balances?",
    "url": "https://cryptoslate.com/whats-pushing-down-bitcoins-hodler-balances/",
    "description": "<p>Glassnode&#8217;s hodler net position change metric offers a granular view into the behavior of Bitcoin&#8217;s long-term investors. The metric is calculated by tracking the inflows and outflows from wallets categorized as holders — or those who have been &#8220;holding on for dear life&#8221; for a very long time. This metric is pivotal in understanding market [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/whats-pushing-down-bitcoins-hodler-balances/\">What’s pushing down Bitcoin’s hodler balances?</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-21T00:50:09.000Z",
    "title": "Coinbase secures CFTC approval to list Dogecoin futures",
    "url": "https://cryptoslate.com/coinbase-secures-cftc-approval-to-list-dogecoin-futures/",
    "description": "<p>The Commodities and Futures Trading Commission (CFTC) has approved Coinbase Derivatives Exchange&#8217;s application to list futures contracts tied to Dogecoin (DOGE), Bitcoin Cash (BCH), and Litecoin (LTC). According to the filing, the listings will go live and begin trading on or after April 1, 2024. The CFTC&#8217;s website indicates that all three contracts were certified on [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/coinbase-secures-cftc-approval-to-list-dogecoin-futures/\">Coinbase secures CFTC approval to list Dogecoin futures</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-21T01:00:00.000Z",
    "title": "Quick Fortune: Crypto Trader Nets Over $3 Million Trading New Solana Memecoin in Minutes",
    "url": "https://www.cryptoglobe.com/latest/2024/03/quick-fortune-crypto-trader-nets-over-3-million-trading-new-solana-memecoin-in-minutes/",
    "description": "A cryptocurrency trader has managed to make a profit of over $3 million trading a newly launched Solana-based memecoin within just 12 minutes after betting nearly $2 million on it right after it started trading. According to on-chain analysis service Lookonchain, the trader spent 9,894 SOL tokens worth $1.98 million on the meme-inspired cryptocurrency $SLEF […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-21T01:00:31.000Z",
    "title": "Celsius Fights To Reclaim $2 Billion Withdrawn Prior To Bankruptcy Declaration",
    "url": "https://www.newsbtc.com/news/celsius/celsius-fights-to-reclaim-2-billion-withdrawn-prior-to-bankruptcy-declaration/",
    "description": "According to a Bloomberg report, Celsius Network, the crypto platform that filed for bankruptcy in July 2022, demands that major customers who collectively withdrew over $2 billion before the bankruptcy return those funds to avoid potential litigation.  An oversight committee formed during Celsius&#8217;s Chapter 11 case has begun contacting customers who withdrew more than $100,000 during the period leading up to the company&#8217;s bankruptcy filing. This recovery effort aims to repay creditors who did not withdraw funds from Celsius.  Settlement Offered To Celsius Users  Per the report, the oversight committee&#8217;s recovery process will impact around 2% of Celsius users who, in total, withdrew approximately 40% of the platform&#8217;s assets within the 90 days preceding the Chapter 11 filing.  Celsius reported $6 billion in assets, 1.7 million registered users, and 300,000 active users with account balances exceeding $100 at the time of bankruptcy.  Related Reading: Crypto Expert Reveals Why XRP Price Will Rise 1,700% To $10 Notably, the oversight committee has offered customers who may face clawback suits a settlement option, providing them with a “favorable rate” if they choose to settle.  Customers who opt for settlement would have their potential liabilities determined based on the value of their assets at the time of their 2022 withdrawals. This means that settling customers would retain any appreciation in the value of their digital assets resulting from the surge in crypto prices over the past year. Legal Consequences If Settlement Offer Is Declined According to Bloomberg, customers who decline to settle may be subject to significantly more liability through potential litigation. The committee&#8217;s letter warns customers about the potential consequences of not accepting the settlement offer. In November, a bankruptcy judge approved Celsius&#8217; plan to distribute billions of dollars in assets and transform into a creditor-owned Bitcoin mining firm. According to a court filing by the company&#8217;s lawyers, Celsius has already distributed around $2 billion in assets. Related Reading: Shiba Inu May Rise 250% Pre-Bitcoin Halving, Predicts SHIB Team Overall, Celsius Network&#8217;s oversight committee is pursuing the recovery of over $2 billion in withdrawals made by major customers shortly before the company filed for bankruptcy. By offering settlement options based on the value of assets at the time of withdrawal, Celsius aims to alleviate potential litigation and expedite the repayment of creditors.  As the process unfolds, impacted customers decide to settle potential liabilities or face potential litigation with potentially higher consequences. Currently, the network&#8217;s native token, CEL, is trading at $0.1862, reflecting a significant year-to-date decline of over 49%. In shorter time frames, the token has experienced a 12% decline in the last 24 hours, a 32% decline in the last week, and a 27% decline in the last fourteen days, highlighting the limited interest and lack of confidence among investors in the CEL token. Featured image from Shutterstock, chart from TradingView.com "
  }
]