[
  {
    "source": "Cointelegraph",
    "date": "2023-10-22T17:46:23.000Z",
    "title": "Sam Bankman-Fried trial moves to final stages",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-moves-final-stages",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/2ca8a2f5-5d1b-4f43-ad99-b25d5d2c6a86.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The trial of Sam Bankman-Fried is reaching a conclusion, with the prosecution set to rest its case on Oct. 26.</p>\n                    <p><p>Sam Bankman-Fried’s trial is reaching its final stages over the next few days, with the prosecution scheduled to rest their case on Oct. 26 following the examination of almost 20 testimonies in the case.</p><p>The prosecution presented a lineup of witnesses over the past three weeks, including former FTX employees, customers, investors, government officials, and law enforcement agents. At the heart of the case is the central argument that Bankman-Fried intentionally deceived all of them and that he was behind the decisions resulting in the $8 billion gap between FTX and Alameda Research in November 2022.</p><p>As for Bankman-Fried’s defense, they still haven’t confirmed whether they will waive the case. In criminal trials, attorneys aren’t required to present a defense. Assuming his legal team will present a case, it will also begin on Oct. 26. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/d7e780de-a5ea-42e0-a938-d2306e6bd44c.png\"  /></figure><p>Bankman-Fried’s counsel, led by Mark Cohen and Christian Everdell, <a href=\"https://cointelegraph.com/news/what-going-on-sam-bankman-fried-defense\">has struggled to present a narrative to jurors</a>. The attorneys even missed crucial arguments during the cross-examination of his former closest friends, including Caroline Ellison, Nishad Singh, Adam Yedidia, and Gary Wang. Cooperating with the government, the group accused Bankman-Fried of directing them to commit crimes. </p><p>An attorney observing the trial told Cointelegraph that when a case is initiated by the government, there is a 95% likelihood of indictment, underscoring the significant challenge faced by the defense. Prosecutors, however, have the burden of proving the alleged crimes. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/caroline-ellison-desired-step-down-feared-bank-run-ftx-sam-bankman-fried\">Caroline Ellison wanted to step down but feared a bank run on FTX</a></em></strong></p><p>Among the highlights of the previous week in court was the testimony of former FTX’s engineering director. Singh told jurors that Bankman-Fried instructed him to make millionaire venture investments via loans from Alameda. According to Singh, he didn’t know the funds were tied to FTX customer’s deposits. Singh <a href=\"https://cointelegraph.com/news/ftx-engineering-director-faces-prison-guilty-plea\">faces up to 75 years in prison</a> for charges related to defrauding users of the crypto exchange.</p><p>The week also saw District Judge Lewis Kaplan <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">run out of patience with lawyers</a> representing both parties after a witness fleeing Texas for the trial testified for roughly 15 minutes.</p><p>“We had a witness this morning who knew absolutely nothing…and this afternoon we fly somebody in from Texas [...] he knows nothing or next to nothing,” Judge Kaplan said, complaining about prosecutors and the defense's witnesses strategies.</p><p>Also in the last few days, FTX’s former general counsel Can Sun <a href=\"https://cointelegraph.com/news/sam-bankman-fried-asked-ftx-attorneys-come-up-legal-argument-8-billion-hole\">presented a spreadsheet used to track $2.1 billion</a> in loans to Bankman-Fried and other executives. Can was unaware of the exchange’s commingling of funds with Alameda, he told jurors. He is also cooperating with the government in the case. </p><p>Bankman-Fried could spend up to 115 years in prison if convicted of fraud and conspiracy to commit fraud.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/dao-hyped-voting-decentralization/\"><strong><em>Are DAOs overhyped and unworkable? Lessons from the front lines</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-10-22T17:59:17.000Z",
    "title": "Base launches 8-week boot camp to train blockchain developers",
    "url": "https://crypto.news/base-launches-8-week-boot-camp-to-train-blockchain-developers/",
    "description": "The Base Camp program aims to bring more people into blockchain technology. The current number of on-chain developers sits at less than 30,000, while over 30 million work in software development as a whole, according to the L2 network."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-22T18:05:32.000Z",
    "title": "Bitcoin ETF Buzz Reaches Retail Realm: Google Trends Reveals",
    "url": "https://www.crypto-news-flash.com/bitcoin-etf-buzz-reaches-retail-realm-google-trends-reveals/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-etf-buzz-reaches-retail-realm-google-trends-reveals",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-2023-10-20T115731.632.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-2023-10-20T115731.632.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-2023-10-20T115731.632-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Google search interest for &#8220;spot bitcoin ETF&#8221; soars, signaling heightened curiosity among retail investors. Market players are optimistic about the SEC approving the first U.S.-based spot bitcoin ETF in the near future. Digital Gold Rush: Main Street&#8217;s Rising Curiosity There&#8217;s a palpable sense of excitement building around the concept of a spot bitcoin exchange-traded fund [...]"
  }
]