[
  {
    "source": "Cointelegraph",
    "date": "2024-03-20T04:53:28.000Z",
    "title": " Bitcoin pre-halving correction narrative strengthens as BTC falls below $62K ",
    "url": "https://cointelegraph.com/news/bitcoin-halving-price-narrative-strengthens-crypto-market-falls",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvM2M2YzIyNTgtZGExYy00MWNlLTgwNWUtZTEzNWIzMTJjOTI1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>“Everyone who wanted to buy into the halving mostly has,” said Capriole Fund founder Charles Edwards.  </p>\n                    <p><p>Analysts are predicting a significant increase in the price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) following the halving event, despite the world’s largest crypto asset plummeting nearly 15% from its latest all-time high of $73,738 over the last six days.</p><p>In a March 19 post to X, Capriole Fund founder Charles Edwards said it’s “normal” to have a lot of volatility in the months on either side of the <a href=\"https://cointelegraph.com/learn/bitcoin-halving-how-does-the-halving-cycle-work-and-why-does-it-matter\">Bitcoin halving</a>, speculating that the 12-month period following the event would be the best “risk-reward” timeframe for investors. </p><p>Edwards posited there would be a shutdown of inefficient miners in the wake of the Bitcoin halving event — which is <a href=\"https://cointelegraph.com/news/bitcoin-halving-not-priced-in-full-extent\">slated to occur sometime</a> between April 18-20. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-halving-price-narrative-strengthens-crypto-market-falls\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-20T05:00:16.000Z",
    "title": "Slerf and LBank Launch Donation Campaign: Over 2600 SOL Raised in 12 Hours for Compensation Initiative",
    "url": "https://news.bitcoin.com/slerf-and-lbank-launch-donation-campaign-over-2600-sol-raised-in-12-hours-for-compensation-initiative/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_174440_977-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_174440_977-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_174440_977-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_174440_977-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_174440_977-1536x864.jpg 1536w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_174440_977-2048x1152.jpg 2048w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_174440_977-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_174440_977-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_174440_977-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_174440_977-1520x855.jpg 1520w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240319_174440_977-1280x720.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. In a remarkable show of solidarity and community support, Slerf, in partnership with LBank, has initiated a donation campaign that has garnered extraordinary attention. Within just 12 hours of its launch, the campaign&#8217;s dedicated blockchain address, fCuw5ppJ9aZYzjm8EsT2fHwxV1h5JwUfqXM44iX3Pzb, has received over 2600 SOL, roughly valued at $500K USD. This address is publicly available on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-20T04:59:44.000Z",
    "title": "Is AI Cyber Harassment Endangering Press Freedom in Pakistan?",
    "url": "https://www.cryptopolitan.com/ai-cyber-harassment-press-freedom-pakistan/",
    "description": "In an era where technology permeates every aspect of society, journalists, particularly in regions like Pakistan, find themselves ensnared in a digital battleground. The advent of generative artificial intelligence has escalated cyber harassment to unprecedented levels, with journalists, especially women, bearing the brunt of this malicious onslaught. Amidst concerns over the efficacy of legal mechanisms [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-20T04:48:38.000Z",
    "title": "BNB Price Could Restart Rally If It Is Able To Hold This Key Support",
    "url": "https://www.newsbtc.com/analysis/bnb/bnb-price-could-restart-rally-500/",
    "description": "BNB price rallied further above $600 before it faced sellers. The price corrected gains and now testing an important support at $500. BNB price started a downside correction from the $645 resistance zone. The price is now trading near $515 and the 100 simple moving average (4 hours). There is a key bearish trend line forming with resistance near $520 on the 4-hour chart of the BNB/USD pair (data source from Binance). The pair could attempt a fresh increase if it stays above the $500 support zone. BNB Price Holds Support In the last BNB price prediction, we discussed the chances of more gains above the $550 resistance zone. The price continued to rise and broke many hurdles near the $580 level. BNB even outperformed Bitcoin and Ethereum with a move above the $600 resistance. Finally, it faced resistance near the $645 zone. A high was formed near $645 and the price recently started a downside correction. There was a move below the $600 level. The price declined below the 23.6% Fib retracement level of the upward move from the $365 swing low to the $645 high. The price is now trading near $515 and the 100 simple moving average (4 hours). Immediate resistance is near the $520 level. There is also a key bearish trend line forming with resistance near $520 on the 4-hour chart of the BNB/USD pair. The next resistance sits near the $550 level. A clear move above the $550 zone could send the price further higher. Source: BNBUSD on TradingView.com In the stated case, BNB price could test $580. A close above the $580 resistance might set the pace for a larger increase toward the $600 resistance. Any more gains might call for a test of the $645 level in the coming days. More Losses? If BNB fails to clear the $520 resistance, it could continue to move down. Initial support on the downside is near the $500 level or the 50% Fib retracement level of the upward move from the $365 swing low to the $645 high. The next major support is near the $470 level. The main support sits at $430. If there is a downside break below the $430 support, the price could drop toward the $400 support. Any more losses could initiate a larger decline toward the $350 level. Technical Indicators 4-Hours MACD – The MACD for BNB/USD is gaining pace in the bearish zone. 4-Hours RSI (Relative Strength Index) – The RSI for BNB/USD is currently below the 50 level. Major Support Levels – $500, $470, and $430. Major Resistance Levels – $520, $550, and $580."
  }
]