[
  {
    "source": "CryptoGlobe",
    "date": "2023-11-23T03:00:00.000Z",
    "title": "XRP Whales Spark Market Frenzy With Huge Transfers After Price Surged 75% Year-to-Date",
    "url": "https://www.cryptoglobe.com/latest/2023/11/xrp-whales-spark-market-frenzy-with-huge-transfers-after-price-surged-75-year-to-date/",
    "description": "A recent increase in XRP whale transactions has led to heightened interest and speculation within the cryptocurrency’s community as to what these large token holders are doing after the price of the cryptocurrency moved up over 75% this year. According to data from whale monitoring service WhaleAlert, numerous XRP whales have been making large transactions […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-23T03:00:37.000Z",
    "title": "Congressman Calls for Gensler’s Removal After SEC Sues a Crypto Exchange Twice in 10 Months",
    "url": "https://news.bitcoin.com/congressman-calls-for-genslers-removal-after-sec-sues-a-crypto-exchange-twice-in-10-months/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/warren-davidson-gensler-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Lawmaker Calls for Gensler&#039;s Removal After SEC Sues a Crypto Exchange Twice in 10 Months\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/warren-davidson-gensler-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/warren-davidson-gensler-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/warren-davidson-gensler-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/warren-davidson-gensler-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/warren-davidson-gensler-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/warren-davidson-gensler-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/warren-davidson-gensler.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A U.S. lawmaker has urged Congress to pass his bill that would fire U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler. This call followed the securities regulator filing a second lawsuit against crypto exchange Kraken this year after the exchange paid $30 million to settle the initial lawsuit. Lawmaker Seeks to Fire Gary Gensler [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-23T03:00:51.000Z",
    "title": "Synthetix (SNX) Shines As TVL Hits $670M, Analyst Predicts Continued Upswing",
    "url": "https://www.newsbtc.com/snx/synthetix-snx-shines-as-tvl-hits-670m-analyst-predicts-continued-upswing/",
    "description": "Synthetix (SNX), currently positioned as the 54th largest cryptocurrency, has been closely aligned with the overall market trend. Over the past 30 days, SNX has experienced a substantial uptrend of 60%, while its year-to-date performance shows an impressive price increase of over 108%.  These notable achievements indicate the potential for continued bullish momentum for the decentralized protocol and its native token. Significant Growth For Synthetix As Demand For On-Chain Derivatives Surges Renowned cryptocurrency analyst and writer, Jake Pahor, has expressed a highly optimistic outlook on SNX, hailing it as the ultimate “picks &#38; shovels play” in anticipation of the forthcoming bull market.  Pahor highlights Synthetix&#8217;s pivotal role as the backbone for derivatives trading in the decentralized finance (DeFi) sector. The protocol has already amassed an annualized revenue of $54 million, serving as a platform that enables the creation and trading of synthetic assets such as commodities, stocks, and currencies. While Synthetix may not have user-facing front-ends, it powers popular DeFi applications like Kwenta, Polynomial, dHedge, and Lyra. As the demand for permissionless trading of spot synthetics and on-chain derivatives of traditional assets continues to rise, Synthetix stands poised for significant growth in the coming years, according to Pahor. Related Reading: Cardano Forecast: Crypto Analyst Identifies The Event That Could Send ADA Price To $11 Notably, a key driver of Synthetix&#8217;s success lies in the fees generated on every synthetic asset exchange, ranging from 0.1% to 1% (average 0.3%). These fees are directed towards SNX stakers, creating a rewarding incentive structure.  SNX, sUSD, and eSNX are the three primary tokens utilized within the Synthetix ecosystem, each serving distinct purposes in staking, collateralization, and protocol functionality. With a circulating supply of 326.5 million SNX tokens and a total supply of 327.2 million, Synthetix boasts a market cap of $1.14 billion, placing it at the forefront of the Synthetics category. The protocol&#8217;s treasury holds a healthy $145.96 million, including stablecoins, BTC/ETH, and its token SNX. SNX Bulls Poised For Breakout Opportunity Synthetix operates under the governance of four key bodies: Spartan Council, Treasury Council, Ambassador Council, and Grants Council. These councils&#8217; Decisions and proposals are subject to majority votes from SNX stakers, ensuring a democratic and community-driven approach to protocol development. It was established as Havven in 2017, a stablecoin protocol, the project rebranded in 2018 to become Synthetix, focusing on synthetic assets and derivatives trading.  According to Pahor’s analysis, with a “strong ecosystem” of projects built on its infrastructure and a first-mover advantage, Synthetix has established itself as the market leader in the Synthetics category. Related Reading: Celestia Loses Momentum: Anticipating A Rebound Post 11% Dip Furthermore, the impending release of Synthetix V3, including Perps, Base, and USDC, is expected to be a significant catalyst for the protocol. Additionally, the protocol&#8217;s DEX perps feature aims to compete with centralized exchanges, while the Infinex front-end promises a user experience akin to traditional CEX trading. Currently, SNX is trading at $3.455, reflecting a significant 4.7% uptrend over the past 24 hours. This positive momentum follows a 31% gain over the last fourteen days.  In the immediate future, SNX faces a crucial hurdle in surpassing the resistance level at $3.58, which is necessary to retest its recently achieved yearly high of $3.810. As SNX reached this high only a few hours ago, its next target is to surpass the $4 mark, a level not seen since August 2022. On the other hand, if a short-term pullback or correction unfolds for SNX, it will be crucial for bullish investors to defend the $3.035 support level. Maintaining this level can sustain a favorable bullish trend throughout the remainder of the month. Featured image from Shutterstock, chart from TradingView.com "
  }
]