[
  {
    "source": "CryptoGlobe",
    "date": "2023-09-08T00:48:00.000Z",
    "title": "Crypto Investors Hold Over 580,000 $BTC on Binance, $ETH Deposits Dropped 4.3%: 10th Reserve Report Shows",
    "url": "https://www.cryptoglobe.com/latest/2023/09/crypto-investors-hold-over-580000-btc-on-binance-eth-deposits-dropped-4-3-10th-reserve-report-shows/",
    "description": "Leading cryptocurrency exchange Binance has recently unveiled its 10th proof of reserves, casting a detailed light on the assets the cryptocurrency trading platform has in its custody. The report shows users’ ETH deposits dropped 4.3% from the prior report, while USDT holdings experienced a minor 1% increase to 15.44 billion. According to the report, Binance’s […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-08T01:00:54.000Z",
    "title": "Bitcoin Drop Before Halving Expected, Will It Get Worse In September?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-drop-halving-get-worse-in-september/",
    "description": "Benjamin Cowen, an analyst and founder of Into The Cryptoverse, thinks Bitcoin will likely maintain a downside trajectory in September ahead of next year&#8217;s halving. Pointing to the coin&#8217;s performance and comparing it to how Bitcoin has faired over the years, the analyst predicts doom for the world&#8217;s most valuable cryptocurrency. Bitcoin is trading at around $25,860 and has remained under pressure in the past few weeks after surging almost 60% from November 2022 lows, when the drop was accelerated by the collapse of FTX and the bankruptcy of several centralized finance (CeFi) lending platforms like BlockFi, the coin retraced from July 2023 peaks when it rallied to around $31,800.  Will September Be Tough For BTC Bulls? After an impressive performance in July, bears peeled back all gains in August. By the close of the month, Bitcoin was down roughly 20% from July 203 highs, with losses on August 17 triggering a scare across the board. In his analysis, Cowen notes that the coin lost 11.31% in August, slightly lower than the average of the past two pre-halving years when the mean return that month when the coin shrunk by 11.71%. However, his projections for BTC look dimmer in September.  The analyst, citing data, said prices tend to contract in all of September before halving. The average return stood at -17.29% in September before Bitcoin halved. Therefore, if the same holds and Bitcoin follows the same trend, the coin will likely dump to $21,400 by the end of this month.  Related Reading: Make Or Break: Bitcoin Fate Hangs On The Edge Of The 200-Week EMA On the &#8220;brighter&#8221; side, if the performance of Bitcoin in September in the last two halvings is factored in, the average return was -5.66%, which means BTC, though bearish, could end up falling to around $24,400 by the end of the month. This assessment implies that if historical performance leads, BTC may edge even lower in the next few weeks. Which Way For Bitcoin? Bitcoin supporters are bullish over the medium to long term. Despite the sharp dump on August 17, which pushed the coin to new H2 2023 lows at around $25,200, the slight recovery in the second half of August and the first week of September might anchor bulls&#8217; hopes. Bitcoin is not out of the woods just yet, looking at price action. Related Reading: Polygon Foundation Refutes Claims Of Dumping MATIC On Binance – Here’s What Happened From the daily chart, BTC prices are inside the bear candlestick of August 17, the main anchor bar that defines the current price action. Besides, though prices are relatively higher, trading volumes are relatively low.  For a refreshing recovery, supporters are banking on the Securities and Exchange Commission (SEC) approving a spot Bitcoin Exchange-Traded Fund (ETF). This derivative product would allow institutions to gain exposure, channeling capital and potentially driving demand for BTC. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-08T01:03:28.000Z",
    "title": "Shiba Inu’s Shibarium Becomes Investors First Choice for Massive Business Growth with Low Fees and Seamless Scalability",
    "url": "https://www.crypto-news-flash.com/shiba-inus-shibarium-becomes-investors-first-choice-for-massive-business-growth-with-low-fees-and-seamless-scalability-2/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-shibarium-becomes-investors-first-choice-for-massive-business-growth-with-low-fees-and-seamless-scalability-2",
    "description": "<img width=\"1200\" height=\"600\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/shiba-6763358_1920-1200x600-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba Inu Holding a $GOLDEN Token\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/shiba-6763358_1920-1200x600-1.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/shiba-6763358_1920-1200x600-1-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/shiba-6763358_1920-1200x600-1-1024x512.jpg 1024w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />The Shibarium L2 network offers immense scalability with unmatched security provided by the Ethereum (ETH) blockchain. Businesses can access the vibrant Shibarmy global ecosystem with BONE for fee payments and SHIB and LEASH used in governance. The launch of the Shibarium layer two (L2) scaling solution for the Shiba Inu (SHIB) network was a significant [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-08T00:41:00.000Z",
    "title": "Taiwan Invites International Opinions To Set Virtual Asset Guidance",
    "url": "https://coinedition.com/taiwan-invites-international-opinions-to-set-virtual-asset-guidance/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Taiwan_Mobile_Explores_Potential_Investment_in_Local_Crypto_Platforms.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Taiwan_Mobile_Explores_Potential_Investment_in_Local_Crypto_Platforms.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Taiwan_Mobile_Explores_Potential_Investment_in_Local_Crypto_Platforms-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Taiwan_Mobile_Explores_Potential_Investment_in_Local_Crypto_Platforms-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Taiwan is collecting advice from other nations when it comes to regulating crypto-related businesses and companies in the republic. Earlier today, a local news platform published a report announcing a public hearing to be hosted by the Financial Supervisory Commission to establish &#8220;Guiding Principles for the Management of Virtual Asset Platforms and Trading Businesses (VASP).” [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/taiwan-invites-international-opinions-to-set-virtual-asset-guidance/\">Taiwan Invites International Opinions To Set Virtual Asset Guidance</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]