[
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T08:41:36.000Z",
    "title": "Crypto​.com joins ranks of licensed payment institutions in Singapore",
    "url": "https://cointelegraph.com/news/crypto-com-joins-ranks-of-licensed-payment-institutions-in-singapore",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/74edcfc8-f293-4dd5-9206-a93dcb7e31a4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Singapore’s Crypto.com expands its regulatory achievements by securing a license for digital payment token services.</p>\n                    <p><p>The Singapore-based <a href=\"https://cointelegraph.com/learn/what-is-a-cryptocurrency-a-beginners-guide-to-digital-money\">cryptocurrency</a> exchange, Crypto.com, announced on June 1 that it had been granted a major payment institution (MPI) license for digital payment token (DPT) services by the Monetary Authority of Singapore (MAS).</p><p>The <a href=\"https://crypto.com/company-news/crypto-com-obtains-major-payment-institution-licence-from-monetary-authority-of-singapore\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a> comes after Crypto.com <a href=\"https://cointelegraph.com/news/crypto-com-scores-approval-from-singapore-finance-regulators\">received its in-principle approval from MAS</a> in June 2022. With the MPI license, Crypto.com is now authorized to offer its DPT services to customers in Singapore.</p><p>The Monetary Authority of Singapore serves as Singapore’s central bank and primary financial regulatory authority. It is responsible for overseeing and implementing legislation related to money, banking, insurance, securities and the overall financial industry, including the issuance of currency.</p><p>This latest announcement adds to Crypto.com’s track record of <a href=\"https://cointelegraph.com/news/crypto-com-continues-its-worldwide-registration-push-with-brazilian-emi-license\">securing regulatory licenses</a>. The exchange <a href=\"https://cointelegraph.com/news/crypto-com-scores-fresh-regulatory-approval-in-france\">has also been granted registration</a> as a digital asset service provider by the Autorité des Marchés Financiers in France and as a crypto asset business by the United Kingdom’s Financial Conduct Authority.</p><p>Furthermore, Crypto.com received approval for its <a href=\"https://cointelegraph.com/news/crypto-com-gets-mvp-preparatory-license-from-dubai-regulator\">MVP Preparatory License from the Dubai </a>Virtual Assets Regulatory Authority (VARA) and obtained Electronic Financial Transaction Act and Virtual Asset Service Provider <a href=\"https://cointelegraph.com/news/kbw-2022-crypto-com-hits-key-regulatory-milestone-in-south-korea\">registration in South Korea</a>. The company also secured registration approval as a Digital Currency Exchange Provider and Independent Remittance Dealer in Australia by AUSTRAC, as well as an Australian Financial Services Licence and Australian Credit Licence from ASIC. Crypto.com's regulatory achievements extend to <a href=\"https://cointelegraph.com/news/crypto-com-secures-regulatory-license-in-italy\">registration in Italy</a> from the Organismo Agenti e Mediatori (OAM), registration in Greece from the Hellenic Capital Market Commission, and<a href=\"https://cointelegraph.com/news/crypto-com-scores-regulatory-approval-from-cyprus-sec\"> registration in Cyprus</a> from the Securities and Exchange Commission.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/crypto-com-adds-pay-support-for-matic-usdc-and-dai\">Crypto.com adds Pay support for MATIC, USDC and DAI</a></em></strong></p><p>In addition, the cryptocurrency exchange has recently broadened its user base in the United States, allowing users to <a href=\"https://crypto.com/product-news/shop-top-brands-with-crypto-pay\" target=\"_blank\" rel=\"noopener nofollow\">utilize</a> over 30 cryptocurrencies to make purchases across a selection of over 150 renowned consumer brands through its app. It released this feature on May 31. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\">Crypto regulation: Does SEC Chair Gary Gensler have the final say?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-01T08:50:22.000Z",
    "title": "Binance layoffs – CZ refutes bear market struggles",
    "url": "https://cryptoslate.com/binance-layoffs-cz-refutes-bear-market-struggles/",
    "description": "<p>Binance CEO Changpeng Zhao (CZ) played down the significance of recent company layoffs &#8211; saying, &#8220;Another day, another FUD.&#8221; Layoff rumored to be bear market driven. On May 31, Colin Wu of the Wu Blockchain Twitter account stated multiple sources had confirmed Binance was planning to lay off staff. Although details on the cuts were [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-layoffs-cz-refutes-bear-market-struggles/\">Binance layoffs &#8211; CZ refutes bear market struggles</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-01T08:43:54.000Z",
    "title": "Economist Alex Krüger Foresees Bullish Future for Bitcoin and Ethereum",
    "url": "https://www.cryptoglobe.com/latest/2023/06/economist-alex-kruger-foresees-bullish-future-for-bitcoin-and-ethereum/",
    "description": "Economist and crypto trader Alex Krüger has expressed a bullish outlook on Bitcoin (BTC) and Ethereum (ETH), forecasting a strong finish for both cryptocurrencies this year. In a recent tweet, Krüger shared his views, suggesting that the Federal Reserve is likely nearing the end of its interest rate hikes aimed at curbing inflation and could […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T08:44:00.000Z",
    "title": "Jimbos Protocol Turns To Law Enforcement As Hacker Ignores Bounty",
    "url": "https://cryptodaily.co.uk/2023/06/jimbos-protocol-turns-to-law-enforcement-as-hacker-ignores-bounty",
    "description": "<p>Jimbos Protocol has contacted the Department of Homeland Security in an effort to reclaim the funds that were stolen via a flash loan exploit on the 28th of May.&nbsp;</p>\n<p>The protocol had offered the hacker a bounty which the latter chose to ignore.&nbsp;</p>\nJimbos Protocol Contacts Law Enforcement&nbsp;\n<p>With the hacker ignoring the bounty offer, the Arbitrum-based Jimbos protocol has revealed that it has contacted law enforcement and has opened a case with the New York Branch of the Department of Homeland Security to arrest the hacker. Jimbos Protocol was hacked on the 28th of May and saw 4000 ETH (roughly $7.5 million) stolen via a flash loan exploit. The team behind the protocol also noted that the Department of Homeland Security had arrested several other exploiters in the past and that it believed they would be able to arrest the protocol&rsquo;s hacker as well.</p>\n<p>According to reports, the Department of Homeland Security has worked on several crypto cases, such as 2013&rsquo;s Mt. Gox seizures and the 2021 Colonial Pipeline ransomware attacks.</p>\n<p>The Jimbos Protocol team took to Twitter to address the hacker, stating,</p>\n\n<p>&ldquo;They&rsquo;re behind finding and arresting many of these exploiters. We don&rsquo;t think this case will be an exception to the rule. To the attacker: We warned you. We&rsquo;d prefer to give you the bounty so we can focus on our protocol. Instead, we will deal with law enforcement to find you.&rdquo;</p>\n\n<p>The protocol also revealed that the hacker ignored the bounty offer, stating,&nbsp;</p>\n\n<p>&rdquo; We&rsquo;ve spoken about our bounty before, 10% of stolen funds (~$800k USD). We&rsquo;ve given the hacker time to comply for the bounty, but evidently, they&rsquo;re not interested.&rdquo;</p>\n\nBounty Offered To General Public&nbsp;\n<p>The Jimbos Protocol has now offered the bounty to the general public instead. This means any user or community member that provides any information that could lead to the hacker&rsquo;s arrest or recovery of funds would receive the reward. The protocol team had previously stated that they had found several promising leads regarding the hacker but did not wish to harm anyone&rsquo;s reputation by making assertions before verifying all the facts.&nbsp;</p>\n\n<p>&ldquo;In order to speed up the investigation and return of funds, we&rsquo;re offering the 10% bounty (~$800K USD) to the general public. Anyone who provides information that leads to: 1) catching the exploiter, or 2) all funds being returned, is eligible for the reward.&rdquo;</p>\n\n<p>However, the protocol also left the door open for the hacker to return the funds, stating that they were willing to give the hacker the opportunity to return the funds right until they are arrested, at which point the offer will no longer be on the table.&nbsp;</p>\n\n<p>&ldquo;The door remains open for the hacker to return the funds until they are arrested, at which point the offer will be rescinded. Because then, we will be getting 100% of the funds back, and they will go to prison.&rdquo;</p>\n\n<p>The Jimbos Protocol also added that it would soon publish an analysis of the hack. It also revealed that it would be publishing a plan for a future version of the protocol, which would include a recovery plan for users impacted by the attack.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T08:51:58.000Z",
    "title": "Australian government launches consultation to assess ban on “high-risk” AI",
    "url": "https://www.cryptopolitan.com/australian-government-on-ai-consultation/",
    "description": "The Australian government has initiated an unexpected eight-week consultation period aimed at determining whether certain &#8220;high-risk&#8221; artificial intelligence (AI) tools should be prohibited. This move follows similar measures taken by other regions, including the United States, the European Union, and China, in addressing the risks associated with rapid AI development. On June 1, Industry and ... <a title=\"Australian government launches consultation to assess ban on &#8220;high-risk&#8221; AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/australian-government-on-ai-consultation/\" aria-label=\"More on Australian government launches consultation to assess ban on &#8220;high-risk&#8221; AI\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-01T09:05:39.000Z",
    "title": "XDC price rallies 28% as exchange enters Japan",
    "url": "https://crypto.news/xdc-price-rallies-28-as-exchange-enters-japan/",
    "description": "XDC Network expands its presence in Japan through a partnership with SBI VC Trade, leading to a 30% rally in XDC token value in a single day. "
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-01T09:02:22.000Z",
    "title": "The Latest Review About Stellar",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-latest-review-about-stellar/",
    "description": "<p>Many cryptos offer fast and inexpensive transactions, but Stellar stands out for its ability to work with any form of currency. Whether it&#8217;s the US dollar, euro, or Bitcoin- Stellar allows for transferring its digital representations. While many aim to replace traditional financial systems, Stellar takes a different approach. Stellar has designed the network to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-latest-review-about-stellar/\">The Latest Review About Stellar</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]