[
  {
    "source": "CoinDesk",
    "date": "2023-12-21T05:57:45.000Z",
    "title": "The Sandbox Aims To Make India Its Largest Market",
    "url": "https://www.coindesk.com/web3/2023/12/21/the-sandbox-aims-to-make-india-its-largest-market/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Metaverse platform The Sandbox is aiming to make India its largest market within the coming 24 months."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-21T05:50:00.000Z",
    "title": "AI and the Entrepreneurial Mindset – Catalysts for Tomorrow’s Business Terrain",
    "url": "https://www.cryptopolitan.com/ai-and-the-entrepreneurial-mindset-business/",
    "description": "In a world where technological advancements are reshaping industries, the amalgamation of artificial intelligence and the entrepreneurial spirit is creating a paradigm shift in business dynamics. Contrary to the belief that automation might stifle creativity, AI is proving to be a revolutionary force, unlocking unprecedented opportunities for innovation. This report delves into the transformative influence [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-21T05:40:39.000Z",
    "title": "UK Supreme Court Rules AI Cannot Be Recognized as Inventor in Landmark Decision",
    "url": "https://www.cryptopolitan.com/uk-supreme-court-rules-ai-is-not-an-inventor/",
    "description": "The UK Supreme Court has definitively ruled that artificial intelligence (AI) systems cannot be recognized as inventors in patent applications, reinforcing previous judgments issued by lower courts. This decision stems from a case involving Dr. Stephen Thaler and his AI creation, Dabus, which was credited with inventing a food container and a flashing light beacon. [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-21T06:00:17.000Z",
    "title": "NEAR Hits New High Since 2022 – Will The Bears Get In The Way? ",
    "url": "https://www.newsbtc.com/news/near-hits-new-high-since-2022-will-the-bears-get-in-the-way/",
    "description": "The past two months have been a green flag for the broader crypto market in the run-up to the festive season. Although the hype has since cooled down, a few outliers continue to follow the upward trend. NEAR is one of those tokens that aren’t showing signs of cooling down. According to Coingecko, the token is up nearly 8% in the daily, with the biggest jump being at 23% in the weekly timeframe. With this price ascent, NEAR just reached a new high of $2.81. The token hit its all-time high of $20.42 in January 2022.  The token’s market capitalization has likewise ballooned significantly, currently priced around $2.8 billion. Several on-chain integrations power this new wave of bullishness for NEAR.  Related Reading: Solana Q4 Triumph: Soaring Activity Leaves Ethereum In The Dust – Report NEAR: Monolithic And Modular? Recently, eyes are on NEAR as it continues to improve its systems. According to a Medium article last week, the protocol is implementing more changes to become what they call “a monolithic going modular” blockchain.  “In a monolithic blockchain, all four functions are executed by the same set of nodes. This has some benefits, such as high security, easier deployment, and potentially improved utility for users thanks to the ability to specialize the entire network,” the Medium article said.  Although the NEAR team says that the token is a monolothic chain, its implementation of sharding do not overwhelm individual validators. However, this isn’t enough for users as both users and developers quickly realized that publishing on Ethereum becomes an expensive ordeal.  But NEAR DA aims to change that.  NEAR market cap currently at $2.839 billion. Chart: TradingView.com NEAR DA (“DA” meaning data availability) will give rollup operators access to NEAR’s storage capacity.  “NEAR runs four shards with roughly 16MB throughput a second. Assuming 100 bytes per transaction, you can store quite a significant amount of your data on NEAR at a fraction of the cost of publishing to NEAR,” the article explained. As of writing, only a handful of rollups are using NEAR DA; namely Caldera, Fluent, and Movement Labs. Once this capability is in the hands of commercial users and other rollup operators, NEAR will be able to increase exposure to other investors.  Meanwhile, according to Artemis data, there has been a significant increase in network activity on the NEAR blockchain since the beginning of the month. The data source claims that there has been a 975% increase in the daily count of unique wallet addresses sending on-chain transactions on the network. Source: Artemis How Does This Affect NEAR’s Price?  As of now, the token is on its way to break through $2.90 price ceiling. However, it seems that the January 2022 high of $20.42 will be a tough nut to crack as the bears mount a strong defense. But the advent of strong on-chain development along with good market conditions will bring more bullishness in the short to medium-term.  Related Reading: Woo-ing Buyers: Woo Network Token 75% Rally Sparks Investor Interest For now, investors and traders should brace for a possible correction towards $2.25 once the hype starts to settle down.  Featured images from Shutterstock"
  }
]