[
  {
    "source": "NewsBTC",
    "date": "2023-06-27T02:00:15.000Z",
    "title": "Optimism Bedrock Upgrade Sends Network Transactions Soaring By 67%",
    "url": "https://www.newsbtc.com/optimism-2/optimism-bedrock-upgrade-sends-network-transactions-soaring-by-67/",
    "description": "Optimism (OP) is a layer 2 scaling solution that operates on top of the Ethereum mainnet, providing faster and cheaper transactions for Ethereum users. It was launched in 2020 and has quickly become one of the most popular scaling solutions for the Ethereum network. On June 6, Optimism released its much-anticipated Bedrock upgrade, which promised to improve the network&#8217;s transaction speed and reduce gas fees.  Related Reading: Ripple Emails Reveal: XRP Buybacks Were On The Table To Prop Up Price Optimism Upgrade Delivers On Promises The upgrade has since delivered on its promises, with daily transactions on the network increasing by about 67% to around 500,000 transactions, and gas fees reduced by approximately 50% to around $50,000. According to Nansen, a leading blockchain data analytics platform, the Bedrock upgrade has been a significant milestone for Optimism. The increased transaction speed and reduced gas fees have made the network more efficient and cost-effective, attracting more users to the platform. Furthermore, the Bedrock upgrade by Optimism has brought significant improvements to the protocol, enhancing the network&#8217;s performance and user experience.  One of the most notable improvements is the enhanced transaction throughput, which has significantly increased the number of transactions processed per second.  This has substantially increased daily transactions on the network, enabling users to execute transactions quickly and efficiently. In addition, the upgrade has also introduced lower gas fees on the Optimism network, reducing the cost of transactions for users, which is especially beneficial for those previously deterred by high gas fees on the Ethereum mainnet, making the network more cost-effective and accessible for all users. The Bedrock upgrade has also introduced several improvements to the developer experience on the network, including better documentation and tooling, making it easier for developers to build and deploy applications on the Optimism network, driving innovation and growth in the platform. Moreover, the Bedrock upgrade has also increased the network&#8217;s decentralization, making it more resilient to attacks and more secure overall. This has boosted user confidence in the network and attracted more users to the platform. Related Reading: Cardano (ADA) Soars 10% In The Last Week, More Rallies Ahead? Overall, the Bedrock upgrade has significantly improved the Optimism network, delivering enhanced transaction throughput, lower gas fees, improved developer experience, and increased decentralization.  These improvements have cemented Optimism&#8217;s position as a leading Ethereum layer 2 solutions and are set to drive the adoption of decentralized finance (DeFi) applications on the Ethereum network. As of the time of writing, OP’s expectations for further recovery and bullish momentum have diminished. Currently, OP is trading at $1,286, and it has been on a minor downtrend since it encountered its nearest resistance wall at the $1,508 level, which it lost in March 2023.  As seen in the chart above, the daily chart of OP&#8217;s Average Directional Index (ADX) shows a significant decline, indicating the loss of its bullish momentum and the entry of a new downtrend test. Despite this, OP investors are depending on the $1.087 support floor in case of further drops to surpass its yearly high of $3,323, which it reached on February 24th.  Featured image from Unsplash, chart from TradingView.com "
  }
]