[
  {
    "source": "Cointelegraph",
    "date": "2023-09-08T03:30:45.000Z",
    "title": "LBRY decides to fight: Blockchain firm files notice of appeal against SEC",
    "url": "https://cointelegraph.com/news/lbry-decides-to-fight-blockchain-firm-files-notice-of-appeal-against-sec",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/39d59691-6c64-46a7-bba6-bdf5a16c260d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchain-based file-sharing and payment network LBRY is planning to pick up the fight against the federal regulator again after losing the battle in November last year.</p>\n                    <p><p>Blockchain-based file-sharing and payment network LBRY may be reversing course on an earlier decision to wind down, filing a notice of appeal against a federal judge ruling in July that sided with the Securities and Exchange Commission.</p><p>On Sept. 7, LBRY filed a notice of <a href=\"https://www.courtlistener.com/docket/59774584/111/us-securities-and-exchange-commission-v-lbry-inc/\" target=\"_blank\" rel=\"noopener nofollow\">appeal</a> to the United States Court of Appeals for the First Circuit, seeking to appeal the final judgment entered on July 11, 2023, where LBRY was ordered to pay a civil penalty and barred from participating in unregistered offerings of crypto asset securities in the future. </p><p>“Defendant LBRY, Inc. now appeals to the United States Court of Appeals for the First Circuit this Court’s final judgment entered on July 11, 2023,” it read. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">LBRY has filed a Notice of Appeal against the SEC. <a href=\"https://t.co/Zp9S0TP0Qw\">pic.twitter.com/Zp9S0TP0Qw</a></p>&mdash; LBRY  (@LBRYcom) <a href=\"https://twitter.com/LBRYcom/status/1699874353213559145?ref_src=twsrc%5Etfw\">September 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The SEC first sued developer LBRY, Inc. in March 2021, claiming that its LBRY Credit token (LBC) was sold as a security under the 1933 Securities Act. </p><p>The U.S. District Court for the District of New Hampshire granted the SEC’s motion for summary judgment against LBRY on Nov. 7, which barred the platform from offering “unregistered crypto asset securities” and ordered it to pay a $111,614 civil penalty to the SEC.</p><p>The regulator originally <a href=\"https://cointelegraph.com/news/sec-revises-lbry-fine-to-111k\">sought</a> a punishment of $22 million but revised it after conceding the defunct firm couldn’t pay. </p><p>In January, founder and CEO of LBRY Jeremy Kauffman <a href=\"https://cointelegraph.com/news/the-aftermath-of-lbry-consequences-of-crypto-s-ongoing-regulatory-process\">told Cointelegraph</a> “LBRY as a company is almost certainly dead.”</p><p>Following the final judgment in July, the firm seemed to admit the same, <a href=\"https://twitter.com/LBRYcom/status/1678866789407551489\" target=\"_blank\" rel=\"noopener nofollow\">tweeting</a>: </p><blockquote>“In accordance with the court's order and our promises, we expect to spend the next several months winding LBRY Inc. down entirely.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/lbry-judge-declines-ruling-on-secondary-sales-being-securities\"><strong><em>Bad news for Ripple? LBRY judge passes ruling on if secondary crypto sales are securities</em></strong></a><strong><em> </em></strong></p><p>However, LBRY’s most recent move appears to be a possible change icourse. It also comes amid a number of high-profile crypto industry victories against the federal regulator including Ripple and Grayscale. </p><p>Cointelegraph contacted LBRY for further comments but had not received a response at the time of publication. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\">Crypto regulation — Does SEC Chair Gary Gensler have the final say?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-08T03:23:34.000Z",
    "title": "Synthetix DEX launch to join efforts reducing the 'serious friction' in DeFi",
    "url": "https://cointelegraph.com/news/synthetix-v3-infinex-launch-kain-warwick-interview",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/7851044a-a84e-489a-b67c-fc7cd08c1ebb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Kain Warwick tells Cointelegraph that Infinex will help reduce friction in DeFi and close the usability gap between DEXs and CEXs.</p>\n                    <p><p>Decentralized derivatives protocol Synthetix is the latest project aiming to close the usability gap between centralized and decentralized exchanges — with a Q4 slated launch of the Synthetix V3 protocol and its decentralized exchange front-end, called Infinex.</p><p>Speaking to Cointelegraph, Synthetix founder Kain Warwick said the Q4 slated launch of Infinex — a decentralized perpetual futures exchange front-end which enables trades on Optimism (OP) — as the “missing component” that could bring more users to DeFi. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We are entering DeFi’s greatest chance to take on centralised finance. <br><br>Let&#39;s start talking plans:<a href=\"https://t.co/lGWMD7WZdj\">https://t.co/lGWMD7WZdj</a></p>&mdash; Infinex (@infinex_app) <a href=\"https://twitter.com/infinex_app/status/1690522361483902976?ref_src=twsrc%5Etfw\">August 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“From a trading perspective, DeFi is pretty close to feature parity with CeFi. We’ve got the liquidity, we've got the markets, we've got the depth, we've got the execution time. But we’re still missing a key component.”</p><blockquote>“Right now, you still need to go jump through the hoops of self custody and all of these other little things that add serious friction. For the everyday user that’s used to trading on a CEX this is a level of friction that makes it really hard to use.” </blockquote><p>Infinex will be among a growing roster of projects aimed at increasing the adoption and usability of DeFi protocols. On Sept. 7, a <a href=\"https://cointelegraph.com/news/defi-30-introduces-a-new-way-to-hedge-crypto-assets-against-volatility\">new protocol called Bumper launched</a> with the goal of protecting users’ assets from crashes by pricing contract premiums based on actual volatility rather than past volatility. </p><p>On Sept. 6, DyDx Foundation CEO Charles d’Haussy<a href=\"https://cointelegraph.com/news/dydx-to-launch-decentralized-order-books-exchange-on-cosmos-kbw-2023\"> told Cointelegraph that the exchange will soon offer</a> a “purely decentralized” order book as it seeks to address the slow performance that comes with on-chain order books. </p><h3>DeFi's friction points</h3><p>Giving more detail about the upcoming launch, Kain explained that Infinex’s primary focus will be to make it easier for traders to access decentralized perpetuals by way of removing friction points such as convoluted accounts controls and having to sign off on every transaction.</p><blockquote>“Essentially, it's the features and experience of a centralized exchange powered by decentralized infrastructure.”</blockquote><p>In March, Maple Finance co-founder Sid Powell argued that institutional adoption of DeFi could only be achieved by reducing the friction for them. That month saw Maple Finance <a href=\"https://twitter.com/syrupsid/status/1640785685304209408\" target=\"_blank\" rel=\"noopener nofollow\">launch</a> downloadable monthly interest statements that lenders can take to auditors or accountants. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">If we want more institutional adoption of DeFi then we have to reduce friction for them. <a href=\"https://twitter.com/maplefinance?ref_src=twsrc%5Etfw\">@maplefinance</a> interest statements which a Lender can take to an auditor, accountant or fund admin. <a href=\"https://t.co/JqlW4CJlfp\">https://t.co/JqlW4CJlfp</a></p>&mdash; Sid Powell (v2) (@syrupsid) <a href=\"https://twitter.com/syrupsid/status/1640785685304209408?ref_src=twsrc%5Etfw\">March 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Meanwhile, Kain noted that due to Infinex just being a “front-end” to the underlying derivatives protocol, Kain explained that it would not initially impose any geoblocking restrictions or KYC limits on users. </p><p>While many other decentralized exchanges such as DyDx and Uniswap have imposed such measures, Kain said that the control of Infinex would be relegated to a mode of decentralized governance. </p><p>“It’s the SNX token holders that can decide whether they want to geo block or geo fence or KYC or whatever. They can decide and vote on whatever they want.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/synthetix-snx-trading-volume-overtakes-gmx-but-is-the-dex-token-rally-sustainable\"><strong><em>Synthetix (SNX) trading volume overtakes GMX, but is the DEX token rally sustainable?</em></strong></a></p><p>Infinex will be rolled out alongside Synthetix V3, the project’s newest forthcoming decentralized derivatives protocol. Kain explained that Synthetic V3 forms the underlying architecture of the Infinex front-end, and will include a “bunch of upgrades” to how traders are able to provide and access liquidity.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Curious about Synthetix Perps V3? <br><br>Dive in with <a href=\"https://twitter.com/snxambassadors?ref_src=twsrc%5Etfw\">@snxambassadors</a> on Spartan Spaces, Thursday, 6 pm UTC. <br><br>Explore new features, integrator possibilities, and benefits of building on V3 infrastructure.<br><br>RSVP  <a href=\"https://t.co/IkzhKpEddq\">pic.twitter.com/IkzhKpEddq</a></p>&mdash; Synthetix ⚔️ (@synthetix_io) <a href=\"https://twitter.com/synthetix_io/status/1699098265336131888?ref_src=twsrc%5Etfw\">September 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“The biggest change with Synthetix V3 is permissionless markets. These permissionless markets will allow for someone to do whatever kind of financial engineering they want, come up with a new market and deploy it and attract liquidity.” </p><p>“It’s a lot like a Uniswap style permissionless pool,” he added. </p><p>Decentralized derivatives have grown in popularity amongst fund managers and traders in recent months, with Apollo Capital CIO Henrik Andersson <a href=\"https://cointelegraph.com/news/defi-deriviatives-high-growth-for-crypto-apollo-capital\">telling Cointelegraph that the nascent sector</a> looks poised to eventually become the next major boon for DeFi as a whole. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-08T03:30:53.000Z",
    "title": "Kenyan Fintech Startup Kotani Pay Receives $2 Million Pre-Seed Funding",
    "url": "https://news.bitcoin.com/kenyan-fintech-startup-kotani-pay-receives-2-million-pre-seed-funding/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/binary-1695475_1920-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Kenyan Fintech Startup Kotani Pay Receives $2 Million Pre-Seed Funding\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/binary-1695475_1920-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/binary-1695475_1920-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/binary-1695475_1920-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/binary-1695475_1920-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/binary-1695475_1920-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/binary-1695475_1920-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/binary-1695475_1920.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Kenyan fintech startup Kotani Pay has raised $2 million in a pre-seed funding round which was led by P1 Ventures. The capital raised will be used to fund the startup&#8217;s expansion into five African countries. Felix Macharia said his firm is working with central banks, some of whom &#8220;are actually getting excited about some [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T03:29:25.000Z",
    "title": "Rocket Pool Price Prediction 2023-2032: Is RPL A Good Investment?",
    "url": "https://www.cryptopolitan.com/rocket-pool-price-prediction-2023-2032/",
    "description": "Rocket Pool (RPL) is making waves in the cryptocurrency world, and this is the ideal place to understand its future potential. It&#8217;s crucial to keep a close eye on RPL&#8217;s price trends and predictions because it&#8217;s a prominent name in decentralized finance. In this ever-evolving landscape, staying informed about RPL&#8217;s real-time charts and market insights ... <a title=\"Rocket Pool Price Prediction 2023-2032: Is RPL A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rocket-pool-price-prediction-2023-2032/\" aria-label=\"More on Rocket Pool Price Prediction 2023-2032: Is RPL A Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-08T03:24:16.000Z",
    "title": "Bitcoin Price Attempts Recovery But Here’s Why Its Path Is Fill With Challenges",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-recovery-26000/",
    "description": "Bitcoin price is slowly moving higher above $26,000. BTC is showing signs of recovery but is still struggling to clear the $26,500 resistance zone. Bitcoin is up 2% and trading above the $26,000 resistance zone. The price is trading well above $26,000 and the 100 hourly Simple moving average. There was a break above a key bearish trend line with resistance near $25,940 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could struggle to clear the $26,500 and $26,750 resistance levels. Bitcoin Price Avoids Downside Break Bitcoin price managed to stay above the $25,350 support zone. BTC bulls protected a major downside break and pushed the price above the $25,850 resistance. There was a move above the $26,000 resistance zone. Besides, there was a break above a key bearish trend line with resistance near $25,940 on the hourly chart of the BTC/USD pair. The pair even climbed toward the $26,500 resistance zone where the bears appeared. A high is formed near $26,487 and the price is now consolidating gains. It traded below the 23.6% Fib retracement level of the recent increase from the $25,609 swing low to the $26,487 high. Bitcoin is now trading well above $26,000 and the 100 hourly Simple moving average. Immediate resistance on the upside is near the $26,400 level. The first major resistance is near the $26,500 level. A proper close above the $26,500 level might start a decent increase. Source: BTCUSD on TradingView.com The next major resistance is near $27,000, above which the bulls could gain strength. In the stated case, the price could test the $28,000 level. Are Dips Now Limited In BTC? If Bitcoin fails to clear the $26,500 resistance, it could start a downside correction. Immediate support on the downside is near the $26,100 level. The next major support is near the $26,000 level or the 50% Fib retracement level of the recent increase from the $25,609 swing low to the $26,487 high. A downside break and close below the $26,000 level might increase selling pressure. In the stated case, the price could drop toward $25,500 or even $25,350. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $26,100, followed by $26,000. Major Resistance Levels – $26,400, $26,500, and $27,000."
  }
]