[
  {
    "source": "CoinDesk",
    "date": "2023-08-03T10:58:04.000Z",
    "title": "Alameda-Linked Coins Pumped by Twitter Bots After FTX Listing, Report Shows",
    "url": "https://www.coindesk.com/tech/2023/08/03/alameda-linked-coins-pumped-by-twitter-bots-after-ftx-listing-report-shows/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "At times, Twitter bots accounted for roughly half of all \"chatter\" on the platform for six FTX-listed altcoins."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-03T11:02:16.000Z",
    "title": "Binance starts BTC/FDUSD and ETH/FDUSD trading pairs with zero-fees",
    "url": "https://cointelegraph.com/news/binance-starts-btc-fdusd-and-eth-fdusd-trading-pairs-with-zero-fees",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/999618f3-4e68-4ce0-aab2-87b8b2a61d99.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Users can trade ETH/FDUSD with zero maker fee, while the standard taker fee will apply based on the user's VIP level.</p>\n                    <p><p>Crypto exchange Binance, on Thursday, August 3, announced that it would be opening trading for the Bitcoin/First Digital USD (BTC/FDUSD) and Ethereum/ First Digital USD (ETH/FDUSD) trading pairs alongside an updated zero-fee Bitcoin and Ethereum trading with newly added FDUSD stablecoin spot and margin pairs.</p><p>As per the <a href=\"https://www.binance.com/en/support/announcement/binance-adds-btc-fdusd-eth-fdusd-trading-pairs-and-updates-the-zero-fee-bitcoin-trading-program-0e4155610e6f4e8bbaaa332545dc43a2\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, starting from 08:00 UTC on August 4, users will benefit from zero maker and taker fees for BTC/FDUSD spot and margin trades through the Zero-Fee Bitcoin Trading Program. Additionally, users can trade ETH/FDUSD with zero maker fee, while the standard taker fee will apply based on the user's VIP level.</p><p>The trading volume for BTC/FDUSD spot and margin trading pairs is not included in the VIP tier volume calculation or the Liquidity Providers programs, enhancing the trading experience for users.</p><blockquote>“BNB discounts, referral rebates, and any other adjustments will not apply to the BTC/FDUSD spot and margin trading pairs during the promotion.”</blockquote><p>The recently introduced stablecoin, FDUSD, scheduled to be listed on Binance on July 26, 2023, at 8:00 am UTC, <a href=\"https://cointelegraph.com/news/binance-lists-new-zero-trading-fee-stablecoin-halts-shortly-after-on-technical-issues\">was postponed until 2:00 pm</a> UTC on July 26 due to FDUSD pairs’ liquidity providers experiencing technical issues. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/17ff8f1b-fe48-4f4a-8181-f5d3aa7e49ad.JPG\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of Binance's announcement on the FDUSD pairs and zero-fee bitcoin trading.              Source: Binance</em></figcaption></figure><p>In March, Binance concluded its zero-fee Bitcoin trading program and <a href=\"https://cointelegraph.com/binance-usd-busd-price-index\">BUSD</a> zero-maker fee promotion, shifting to the lesser-known TrueUSD (TUSD) stablecoin from BUSD. This change, along with the removal of Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) from the zero-fee program,<a href=\"https://cointelegraph.com/news/binance-market-share-chopped-with-the-end-of-zero-fee-btc-trading\"> led to a significant drop in Binance's market share</a> and trading volumes by over 50%. Consequently, the prices of cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) remained under pressure after the alteration.</p><p><strong><em>Related:</em></strong><a href=\"https://cointelegraph.com/news/binance-ceo-cz-warns-crypto-community-about-emerging-scam\"><strong><em>Binance’s CZ warns crypto community about emerging scam</em></strong></a></p><p>First Digital USD is backed by Hong Kong-based custodian and trust company First Digital. The group <a href=\"https://cointelegraph.com/news/hong-kong-based-first-digital-group-launches-redeemable-usd-backed-stablecoin\">announced the launch</a> of the United States dollar-pegged FDUSD on June 1. FDUSD’s market <a href=\"https://coinmarketcap.com/currencies/first-digital-usd/\" target=\"_blank\" rel=\"noopener nofollow\">cap</a> of $257 million is still low compared to other stablecoins like USDT, TUSD, BUSD and USTC. Thus, it will not have much impact on the crypto market now, but minting new FDUSD amid demand from Binance can cause a significant boost in market cap.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/multichain-saga-screws-users-binance-fires-1000-staff-asia-express/\"><strong><em>Multichain saga screws users, Binance fires 1,000 staff: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-03T10:55:44.000Z",
    "title": "FTX files motion to exclude its Dubai unit from bankruptcy proceedings",
    "url": "https://cointelegraph.com/news/ftx-files-motion-to-exclude-its-dubai-unit-from-bankruptcy-proceedings",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/12a5241b-0574-4b19-aeae-c2c278d471fa.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>FTX filed for bankruptcy in November 2022, with 102 of its units worldwide entering Chapter 11 proceedings.</p>\n                    <p><p>Bankrupt crypto exchange FTX <a href=\"https://restructuring.ra.kroll.com/FTX/Home-DocketInfo\" target=\"_blank\" rel=\"noopener nofollow\">filed </a>a motion in court to remove its Dubai unit from the ongoing restructuring proceedings in the United States.</p><p>In a court filing on Aug. 2, the crypto exchange argued that its FTX Dubai unit didn't conduct any business prior to the bankruptcy filing, thus the subsidy has no likelihood of rehabilitating its operations. The court will start its first hearing on the issue on Aug. 23.</p><p>The crypto exchange in its filing noted that FTX Dubai is balance sheet solvent and therefore a voluntary “liquidation procedure in accordance with the laws of the United Arab Emirates would allow a timely distribution of the positive cash balance after payment of all outstanding liabilities and liquidation of all assets.\" </p><p>FTX Dubai is a direct, wholly-owned subsidiary of FTX’s European arm which <a href=\"https://cointelegraph.com/news/dubai-permits-full-operation-to-ftx-subsidiary-fze-via-first-mvp-license\">obtained a virtual asset service provider license</a> from Dubai’s Virtual Assets Regulatory Authority (VARA). FTX Dubai currently holds approximately $4.5 million in several accounts, of which $4 million is presently restricted by VARA as security for the License.</p><p>On July 25 VARA confirmed to FTX Dubai management that such restricted cash would be released in the context of the liquidation of FTX Dubai according to United Arab Emirates law.</p><blockquote>“All of FTX Dubai’s assets are located in the United Arab Emirates and substantially all of FTX Dubai’s prepetition activities occurred in the United Arab Emirates, the Debtors have determined that a timely local voluntary liquidation of FTX Dubai in accordance with the laws of the United Arab Emirates is in the best interests of the Debtors and their estate,” the filing noted.</blockquote><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/the-ftx-contagion-which-companies-were-affected-by-the-ftx-collapse\">The FTX contagion: Which companies were affected by the FTX collapse?</a></em></strong></p><p>FTX Dubai is expected to enter into an agreement with the appointed liquidator to implement basic administrative procedures and promote the orderly and efficient administration of the liquidation. </p><p>FTX filed for <a href=\"https://cointelegraph.com/news/ftx-ftx-us-and-alameda-file-for-chapter-11-bankruptcy-in-us-sbf-resigns\">bankruptcy on November 11 last year</a> and the exchange started the bankruptcy proceedings for 102 associated entities from around the world. </p><p><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/elon-musk-tweets-twitter-bots-influenced-altcoin-prices&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a> to preserve this moment in history and show your support for independent journalism in the crypto space.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\"><strong><em>How smart people invest in dumb memecoins — 3-point plan for success</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-03T10:54:34.000Z",
    "title": "AI chip developer gets $100 million from Samsung and Hyundai ",
    "url": "https://cointelegraph.com/news/ai-chip-developer-gets-100-million-from-samsung-and-hyundai",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/eb456dfd-62f2-4ac3-abb5-87e880726cd6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The AI chip developing company Tenstorrent just closed a funding round worth $100 million which was led by manufacturing giants Samsung and Hyundai. </p>\n                    <p><p>The artificial intelligence (AI) chip developer Tenstorrent, <a href=\"https://www.prnewswire.com/news-releases/tenstorrent-raises-a-100m-strategic-up-round-co-led-by-hyundai-motor-group-and-the-samsung-catalyst-fund-301891181.html\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> the closing of a $100 million funding round on Aug. 3 which was led by major manufacturing companies Samsung and Hyundai, among others. </p><p>The company said it raised $30 million from Hyundai, $20 million from the automobile manufacturer Kia, and $50 million from the Catalyst Fund by Samsung and other participating investors in the round, including Fidelity Ventures, Eclipse Ventures and Maverick Capital. </p><p>Tenstorrent is led by its CEO Jim Keller, who previously developed AI chips for major tech companies such as Apple, Intel and Tesla. </p><p>Heung-soo Kim, the executive vice president and head of the global strategy office (GSO) at Hyundai Motor Group, commented on the group’s expectations from the investment: </p><blockquote> \"... the Group expects to develop optimized but differentiated semiconductor technology that will aid future mobilities and strengthen internal capabilities in AI technology development.\"</blockquote><p>Tenstorrent also said the funds will be used to “accelerate the company's product development, the design and development of AI chiplets,” along with advancements on the roadmap for its machine learning software.</p><p>These initatives come as developers are racing to compete with Nvidia, the <a href=\"https://cointelegraph.com/news/nvidia-ai-chip-value-skyrockets-amid-ai-development-boom\">current market leader</a> in AI chip development. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/openai-ceo-highlights-south-korean-chips-sector-for-ai-growth-willing-to-invest\"><strong><em>OpenAI CEO highlights South Korean chips sector for AI growth, investment</em></strong></a></p><p>The growing demand for high-powered semiconductor chips to develop AI systems briefly shot<a href=\"https://cointelegraph.com/news/nvidia-briefly-hits-1-trillion-market-cap\"> Nvidia’s market value</a> into the trillion-dollar range.</p><p>On June 13, Advanced Micro Devices (AMD) announced details of its forthcoming AI chip that has the <a href=\"https://cointelegraph.com/news/amd-reveals-new-a-i-chip-challenging-nvidia-s-dominance\">potential to also challenge Nvidia’s</a> market dominance. </p><p>AMD, Nvidia and Tenstorrent are all United States-based companies that are currently subject to the ongoing chip export restrictions that are primarily targeting China, one of the major markets for the chips.</p><p>Initially, U.S. President Joe Biden issued restrictions on AI chips to China in October 2022 in order to slow down the semiconductor industry. The administration announced that it’s <a href=\"https://cointelegraph.com/news/us-considers-tightening-restrictions-on-ai-chip-exports\">considering tightening the restrictions</a> in July. </p><p>Shortly after the U.S. made this statement, China said it plans to <a href=\"https://cointelegraph.com/news/china-to-tighten-control-on-exports-of-ai-chip-making-materials\">tighten controls on exports</a> of the materials needed to make the chips in the first place. </p><p><strong><em>Magazine:</em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em> Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-08-03T11:06:02.000Z",
    "title": "Blackberry identifies malware that affects crypto community",
    "url": "https://crypto.news/blackberry-identifies-malware-that-affects-crypto-community/",
    "description": "The cybersecurity arm of Blackberry identified malware that could impact the crypto community, healthcare, and government. Blackberry has identified a list of the most common malware currently affecting the crypto industry, such as SmokeLoader, RaccoonStealer and Vidar. SmokeLoader has been&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-03T10:44:16.000Z",
    "title": "ChainAware.ai aims to revolutionize crypto security",
    "url": "https://crypto.news/chainaware-ai-aims-to-revolutionize-crypto-security/",
    "description": "ChainAware.ai offers a solution to individuals and businesses seeking to better understand their users' crypto habits and creditworthiness"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-03T11:00:24.000Z",
    "title": "MicroStrategy’s Michael Saylor Says Spot ETF Approvals Have No Bearing On Bitcoin Strategy",
    "url": "https://www.newsbtc.com/bitcoin-news/microstrategy-bitcoin-strategy-spot-etfs/",
    "description": "MicroStrategy co-founder and former CEO Michael Saylor has stated that potential Spot Bitcoin ETF approvals will not influence the company’s “Bitcoin Strategy.” MicroStrategy Has A Unique Bitcoin Offering During a discussion with Bloomberg on August 2, Saylor stated that even if the SEC approves the spot Bitcoin ETF applications, it would not affect his company’s offerings. According to him, MicroStrategy’s Bitcoin offering offers a unique proposition that the spot Bitcoin ETFs cannot emulate.  Related Reading: BlackRock CEO Larry Fink Is The Best Thing To Happen To Bitcoin, Mike Novogratz Says Saylor echoed similar sentiments during the earnings call on August 1 when he stated that MicroStrategy&#8217;s unique “Bitcoin operating strategy&#8221; will make it stand out even when spot Bitcoin ETFs arrive.  The ex-CEO explained that, “We can tap into leverage because we’re an operating company, which an ETF couldn&#8217;t do so we view it as being beneficial to the entire ecosystem.” However, he believes these spot ETFs are good for the crypto industry as they will welcome institutional investors who boast more than enough liquidity into the space. Differentiating his company’s offering from spot ETFs, he stated: We are a unique instrument, we are the sportscar whereas the spot ETF is going to be the supertanker. Spot ETFs will serve another set of customers in a synergistic fashion to grow the entire asset class. MicroStrategy had filed an application to the SEC to sell up to $750 million in Class A common stock. Saylor also confirmed that his company would use the potential proceeds of this stock sale to “acquire Bitcoin.”  BTC price remains volatile amid Spot ETF expectations &#124; Source: BTCUSD on Tradingview.com  MicroStrategy’s Chief Financial Officer, Andrew Kang, had also confirmed that the proceeds from the proposed sale will be used for “the purchase of Bitcoin as well as the repurchase or repayment of outstanding debt.” Saylor’s Faith In Bitcoin Paying Off Saylor’s MicroStrategy, which happens to be one of the largest holders of Bitcoin, started buying the cryptocurrency in 2020 as a hedge against inflation. The company’s purchases largely resulted from Saylor’s faith in the token as he continued to advocate for it despite the recent market conditions in the crypto market. Saylor stepped down as the CEO a year ago just to focus on the company’s Bitcoin purchasing strategy. This strategy seems to be paying off as it provides an edge for the company over its competitors, with the MSTR stocks rising tremendously since MicroStrategy’s adoption of Bitcoin.  Related Reading: Ethereum ETFs Heat Up As Filings With SEC Climbs To Six As revealed by Saylor in a tweet, MicroStrategy’s stocks have risen by 254% since 2020 when it started buying Bitcoin, with this performance putting the company above some key assets and big tech stocks in terms of performance.  Saylor is not relenting as he confirmed that the goal is to “accumulate as much Bitcoin as we can” when quizzed about how much more Bitcoin the company intends to add to their existing holdings of 152,800 BTC. Featured image from Medium, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-03T11:03:19.000Z",
    "title": "Crypto Millionaires Are Buying Solana (SOL) and Pikamoon (PIKA) Massively, Here is Why You Should Do The Same",
    "url": "https://www.crypto-news-flash.com/crypto-millionaires-are-buying-solana-sol-and-pikamoon-pika-massively-here-is-why-you-should-do-the-same/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-millionaires-are-buying-solana-sol-and-pikamoon-pika-massively-here-is-why-you-should-do-the-same",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T111701.927.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T111701.927.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T111701.927-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T111701.927-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />A lot of crypto enthusiasts are so fixated on the bull market that they forget the bear market is where most of the work is done and money is made. Smart investors are loading up on high-utility tokens like Solana (SOL) and Pikamoon (PIKA) in preparation for the coming bull season. This is how they [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-03T11:01:47.000Z",
    "title": "Mercedes Benz Product and Polygon Technology Partner Wins International Awards in Industry Innovation and Technology Excellence – Can This Boost MATIC Adoption?",
    "url": "https://www.crypto-news-flash.com/mercedes-benz-product-and-polygon-technology-partner-wins-international-awards-in-industry-innovation-and-technology-excellence-can-this-boost-matic-adoption/?utm_source=rss&utm_medium=rss&utm_campaign=mercedes-benz-product-and-polygon-technology-partner-wins-international-awards-in-industry-innovation-and-technology-excellence-can-this-boost-matic-adoption",
    "description": "<img width=\"1000\" height=\"469\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/SmartPhotoLab-Zusammenarbeit-Kooperation.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/SmartPhotoLab-Zusammenarbeit-Kooperation.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/SmartPhotoLab-Zusammenarbeit-Kooperation-300x141.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/SmartPhotoLab-Zusammenarbeit-Kooperation-768x360.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Mercedes-Benz uses its Acentrik product to win the Industry Innovator of the Year award in the just-ended Tech Ascension Awards. This product was recently deployed on the Polygon network to provide enterprise-grade tools to organizations.  It was recently reported that Acentrik, a strategic initiative by Mercedes-Benz, has been deployed on the Polygon network to provide enterprise-grade [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-03T11:08:33.000Z",
    "title": "Scammer Alert: New Sneak Attack Could Be Waiting In Your Wallet Address",
    "url": "https://coinedition.com/scammer-alert-new-sneak-attack-could-be-waiting-in-your-wallet-address/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/I_want_to_share_this_luckily_unsuccessful_but_very_clever_and_close-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>After another close-call incident, it has been observed that bad actors, once again, found a new way to scam users. After arriving at the crime scene, the CEO of Binance Changpeng Zhao swiftly rushed to Twitter and warned the crypto community yesterday about one such scam, which could have created a loss of $20 million. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/scammer-alert-new-sneak-attack-could-be-waiting-in-your-wallet-address/\">Scammer Alert: New Sneak Attack Could Be Waiting In Your Wallet Address</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-03T10:53:04.000Z",
    "title": "BTC At Risk of Visiting $27Ks if It Does Not Reclaim $29.6K",
    "url": "https://coinedition.com/btc-at-risk-of-visiting-27ks-if-it-does-not-reclaim-29-6k/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/There_are_currently_15870_Bitcoin_addresses_that_hold_at_least-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Whales have actively been accumulating Bitcoin (BTC) over the past 12 weeks, according to a Twitter post shared earlier today by the on-chain analytics platform, Santiment. There are about 15,870 BTC addresses that hold at least 100 BTC coins. Furthermore, Santiment’s data revealed that these whales own approximately 11.5 million BTC. This BTC makes up [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/btc-at-risk-of-visiting-27ks-if-it-does-not-reclaim-29-6k/\">BTC At Risk of Visiting $27Ks if It Does Not Reclaim $29.6K</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]