[
  {
    "source": "Decrypt",
    "date": "2023-06-12T23:06:04.000Z",
    "title": "Another Solo Bitcoin Miner Hits the Jackpot for $160,000",
    "url": "https://decrypt.co/144309/another-solo-bitcoin-miner-hits-the-jackpot-for-160000",
    "description": "Beating one-to-5,500 odds, the miner solved a block by renting six-year-old hardware."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-12T23:03:09.000Z",
    "title": "Crypto-Friendly Congressmen Draft Bill to Reform SEC, Fire Gary Gensler",
    "url": "https://decrypt.co/144280/congressmen-draft-bill-to-fire-gary-gensler",
    "description": "The congressman aims to decentralize the structure of the SEC, and free the agency from its \"tyrannical Chairman.\""
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-12T23:00:28.000Z",
    "title": "Bitcoin Miner Inflows To Exchanges Reach 2021 Levels As Bear Trend Persists",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-miner-inflows-to-exchanges-reach-2021-levels-as-bear-trend-persists/",
    "description": "Bitcoin miners are now taking advantage of the recent price increase as they have begun to send massive amounts of BTC to centralized exchanges. While this is not new as miners tend to sell BTC to fund their operations, the sheer volume that is being moved to exchanges is what is alarming. Bitcoin Miners Send Over $70 Million To Exchanges In a recent development reported by on-chain data aggregator Glassnode, Bitcoin miners are moving massive amounts of BTC to exchange. In the last week alone, these miners moved a reported $70.8 million worth of BTC to centralized exchanges. Related Reading: Crypto Investor Sentiment Refuses To Budge, But Can The Weekend Change This? The amount moved in the last week marks the third-largest single inflow for Bitcoin miners in terms of dollar value. It is just 30% below the highest figures which were recorded in 2021 when the price of BTC hit its all-time high of $69,000. BTC miners send over $70m to exchanges &#124; Source: Glassnode Interestingly, because of the current price of Bitcoin, it means that the miners are moving more in terms of the BTC count compared to the dollar count. So miners moved around twice the number of BTC they moved back in 2021 to get the current figure of $70.8 million, data from Glassnode shows. Despite the large selling volumes that seem to be coming from miners, Bitcoin holders continue to be steadfast in their belief in the digital asset. Glassnode reported that long-term holders, i.e. holders who have held their BTC for more than one year, continue to be the most dominant of the bunch with a total of 40.1% of BTC supply remaining unmoved in the last three years. BTC Price Still Shows Bearish Pressure Bitcoin bulls have continued to fight the bears but the effort has fallen short of expectations. As such, BTC prices continue to show intense bearish pressure. BTC falls below $26,000 support &#124; Source: BTCUSD on TradingView.com Despite the digital asset trading above the $26,000 support, it is still sitting below its 50-day and 100-day moving averages, which could tell of more declines to come. It is also obvious in the fact that bulls are barely holding on to the $26,000 support as resistance mounts at $26,500. Related Reading: Here’s Why Ethereum Could Be At Risk Of Falling To $1,000 Again Nevertheless, the long-term outlook for the cryptocurrency is still very bullish with BTC well above its 200-day moving average. With the Bitcoin halving just around the corner, the digital asset could be headed into another bull market very soon. At the time of writing, BTC is changing hands at a price of $26,015, up 1.09% in the last 24 hours. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]