[
  {
    "source": "CryptoGlobe",
    "date": "2024-04-04T00:40:00.000Z",
    "title": "Crypto Trader Turns $100 into $8.3 Million on Coinbase’s Base in Less Than a Week",
    "url": "https://www.cryptoglobe.com/latest/2024/04/crypto-trader-turns-100-into-8-3-million-on-coinbases-base-in-less-than-a-week/",
    "description": "A cryptocurrency trader has managed to turn just 0.1 Ether ($ETH) into over $8.3 million on Coinbase’s Layer-2 scaling solution Base in less than a week by trading little-known cryptocurrencies with market capitalization below the $5,000 mark. In a post shared on the microblogging platform X (formerly known as Twitter) on-chain analysis service Lookonchain detailed […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-04T01:00:33.000Z",
    "title": "Fake NFT Project Hack? CTO Vanishes After Allegedly Stealing 94 SOL",
    "url": "https://www.newsbtc.com/news/fake-nft-project-hack-cto-vanishes-after-allegedly-stealing-94-sol/",
    "description": "A new rug pull alert sounded on Tuesday after crypto detective ZachXBT unveiled on-chain details of an alleged hack suffered by an NFT project last month. The project’s CTO announced that a response was in the works but ultimately vanished as criticism grew. Related Reading: Trezor X Account Hacked: How Much Was Taken In The Fake Crypto Presale? Nuddies NFT, A Hack Or Rug Pull? On-chain sleuth ZachXBT revealed the alleged misuse of funds by the CTO of NFT project Nuddies NFT.  In a now-deleted post, its CTO Kyle explained that the project was “derugged from its previous founder” and built differently from other NFT projects. A short investigation into how @kyledegods faked a hack and stole SOL from his project @NuddiesNFT before spending it on NFTs and lying to holders about how devastated he was about the incident. On March 3, 2024 Kyle made a post in his Discord server claiming his wallets had… pic.twitter.com/4ne6dtVyA5 &#8212; ZachXBT (@zachxbt) April 2, 2024 According to the crypto detective, Kyle faked a hack that seemingly stole the project’s funds. On March 3, the alleged culprit posted on the Nuddies NFT Discord server, informing us of the hack. The post affirmed that Kyle’s Mac was hacked despite “not clicking in any malicious link.” The CTO concluded that a “zombie process” was on his computer for an undetermined period. This “mini-program” gave control of the computer to “the hacker.” Through the TeamViewer app the attacker gained access to the project and Kyle’s wallets. The post further explained that 90 SOL, approximately $17,000 at today’s price, were taken from the Nuddies NFT creator wallet. Moreover, the hacker allegedly took control of Kyle’s Discord and stole 150 SOL, worth around $28,300, from his wallets. At the time, he claimed to be “mentally destroyed” by the loss of the project’s treasury money. SOL is trading at $188.43 in the 3-day chart. Source: SOLUSDT on Tradingview.com Nonetheless, the on-chain data compiled by ZachXBT tells a different story. Per the crypto detective’s post, the CTO allegedly lied to the holders and stole the 94 SOL, worth $12,000, when the incident occurred. The post reveals that the funds were transferred during that day from the Nuddies Royalty Wallet to an exchange deposit at 8:20 UTC. The on-chain investigator claims that a destination transaction was found using time analysis. The transaction to one of Kyle’s wallets accounted for 3.42 ETH, around $11,700, at 8:21 UTC. The ETH was seemingly used to buy two NFTs: DeGods 2921 and y00t 10991. The DeGod NFT was used as the CTO’s profile picture on X until yesterday. CTO Answers The Accusations, Then Vanishes The accusations didn’t go unnoticed by the suspect, who posted on his X account that he was “preparing the answer” with a wink face emoji. After changing his profile picture, Kyle answered some users&#8217; questions about his credibility, to which he replied that his “conscience is clear.” Now-deleted post from Nuddies' CTO Kyle. Source: X In the early hours of Wednesday, Nuddies NFT account shared a now-deleted post informing that the creator wallet was “refilled with 12k USD.” In the post, Kyle reassured that his previous claims of intending to refill the wallet were authentic. The CTO also claimed he was “waiting for his $W airdrop” to fulfill his promise instead of selling his DeAsset. Additionally, he “stepped out” of the project after giving the access keys to two community members. Recovered excerpt from the deleted Nuddies NFT post. Source: X However, the story doesn’t end there. Kyle and Nuddies NFT’s account were deleted a couple of hours after the post. The Nuddies website seems not to be working, as reported by an X user. The project’s future is unsure as one of the community members to whom Kyle gave the access keys was unaware of the situation. Juiceddd, an NFT artist, is one of the two people in charge of the project. Related Reading: Arbitrum Beats Ethereum and Solana With 119% Surge In NFT Sales, NFT Resurgence On The Horizon? The artist explained that he was responsible for redrawing the entire Nuddies collection while adding “70+ new traits.” Moreover, Juiceddd stated that he “woke up this morning to being the owner of everything.” The artist is contemplating giving his perspective on the incident as he considers that it is generally the artist who “gets fucked” in these situations. Featured Image from Unsplash.com, Chart from TradingView.com"
  }
]