[
  {
    "source": "CoinDesk",
    "date": "2023-11-06T16:23:54.000Z",
    "title": "Microsoft Listing Fake Ledger App Leads to $590K of Bitcoin Stolen by Hackers",
    "url": "https://www.coindesk.com/business/2023/11/06/microsoft-listing-fake-ledger-app-leads-to-590k-of-bitcoin-stolen-by-hackers/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Hackers managed to steal 16.8 bitcoin [BTC] over the weekend after a fake Ledger Live app was posted on the Microsoft app store."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-06T16:20:06.000Z",
    "title": "3 reasons why Ethereum price is underperforming altcoins",
    "url": "http://cointelegraph.com/news/why-ethereum-price-is-underperforming-altcoins",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/5e0eab52-1988-4148-953e-625307fef557.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Eth price trades at a key resistance level, but data highlights why the altcoin could struggle to hold $1,900.</p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) price surged by 6.2% from Nov. 3 to Nov. 5, but the altcoin faces difficulty in breaking the $1,900 resistance. Despite the current bullish trend, Ether's 17% return over the last 30 days falls short of Bitcoin's (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) impressive 27% gain during the same period.</p><h2>Regulatory hurdles and ecosystem centralization critiques linger </h2><p>Analysts attribute some of Ether’s underperformance to uncertainty surrounding Consensys, a key player in the Ethereum ecosystem. <a href=\"https://cointelegraph.com/news/consensys-founder-joseph-lubin-former-employee-lawsuit\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/consensys-founder-joseph-lubin-former-employee-lawsuit/amp\">Former employees have filed a lawsuit</a> against the company and its co-founder, Joseph Lubin. Over two dozen shareholders of the Swiss-based holding company, Consensys AG, claim that Lubin, who is also a co-founder of Ethereum, violated a \"no-dilution promise\" made in 2015.</p><p>Consensys is responsible for developing and hosting infrastructure projects crucial to the Ethereum network. It was founded in October 2014, about nine months before the Ethereum blockchain launched in mid-2015. Furthermore, the High Court of Zug in Switzerland ruled in favor of the plaintiffs, exacerbating the current uncertainty.</p><p>Regulatory challenges have hampered the growth of the Ethereum ecosystem. The latest concern centers around PayPal's U.S. dollar-pegged stablecoin, PYUSD, which operates on the Ethereum network. This token is designed for digital payments and Web3 applications. On November 2, <a href=\"https://cointelegraph.com/news/chainlink-garners-criticism-after-quiet-change-multisig\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/chainlink-garners-criticism-after-quiet-change-multisig/amp\">PayPal disclosed a subpoena it received</a> from the U.S. Securities and Exchange Commission (SEC).</p><p>In addition to regulatory pressures, there has been notable criticism of the decentralization of financial applications (DeFi) within the Ethereum network. Chainlink, a preferred solution for oracle services, quietly <a href=\"https://cointelegraph.com/news/chainlink-garners-criticism-after-quiet-change-multisig\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/chainlink-garners-criticism-after-quiet-change-multisig/amp\">reduced the number of participants in its multi-signature wallet</a> from 4-out-of-9 to 4-out-of-8. Analysts have highlighted the lack of governance by regular users as a significant issue.</p><h2>Ether’s underperformance to altcoins is an evidence of other issues</h2><p>Several major altcoins, including Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>), <a href=\"https://cointelegraph.com/xrp-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/xrp-price-index\">XRP</a> and Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) have outperformed Ether with returns of 75.5%, 37%, and 35% in the last 30 days, respectively. This discrepancy suggests that the factors holding back ETH are not solely related to regulatory pressure or reduced demand for DeFi and NFT markets.</p><p>One pressing issue for the Ethereum network is the high gas fees associated with transactions, including those executed by smart contracts. The latest 7-day average transaction fee was $4.90, negatively impacting the usage of decentralized applications (DApps).</p><p>Moreover, the total deposits on the Ethereum network, measured in Ether, have dropped to their lowest levels since August 2020. It's essential to note that this analysis does not consider the effects of native Ethereum staking.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/0bd52feb-9b80-464d-9c29-4fbd71ec8539.png\"><figcaption style=\"text-align: center;\"><em>Ethereum network applications' total deposits in ETH. Source: DefiLlama</em></figcaption></figure><p>According to DefiLlama data, Ethereum DApps had a total value locked (TVL) of 12.7 million ETH on November 5, down 4% from the 13.2 million ETH two months earlier. In comparison, TVL on the Tron network increased by 13% during the same period, while Arbitrum deposits remained at 1 million ETH. Data on DApps activity on the Ethereum network supports the notion of reduced activity.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/97ca667b-233e-4215-ae99-894ff16df84f.png\"><figcaption style=\"text-align: center;\"><em>Ethereum network top DApps, 30-day active addresses. Source: DappRadar</em></figcaption></figure><p>Even excluding the significant 60% decline in the Uniswap NFT Aggregator, the average number of active addresses across the top Ethereum network DApps decreased by 3% compared to the previous month. In contrast, Solana's top applications saw an average 18% increase in active users during the same period, according to DappRadar data.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/aave-pauses-several-markets-feature-issue\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/aave-pauses-several-markets-feature-issue/amp\">Aave pauses several markets after reports of feature issue</a></em></strong></p><p>Finally, on-chain activity indicates increased user deposits of ETH at exchanges. While this data doesn't necessarily signal short-term selling, the mere availability of coins is typically viewed as a precautionary measure by analysts.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/3c294bf6-7cab-4fbc-8a95-ae073043cc99.png\"><figcaption style=\"text-align: center;\"><em>Average 7-day daily ETH deposits at exchanges, ETH thousands. Source: CoinMetrics</em></figcaption></figure><p>The present daily ETH deposit average of 255,614 represents a 30% increase from two weeks earlier, indicating that holders are more inclined to sell as Ether's price approaches $1,900.</p><p>The data suggests that reduced TVL, declining DApps activity and a higher rate of ETH exchange deposits are negatively impacting the likelihood of Ether breaking the $1,900 resistance. The price level could be more challenging than initially expected and for now, Ether bears can take a breath.</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-06T16:18:00.000Z",
    "title": "Will the next crypto bull run be dominated by L1s, L2s or something else?",
    "url": "http://cointelegraph.com/news/will-next-crypto-bull-run-dominated-l1s-l2s-something-else",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/19395689-b9d4-49ee-b9ad-8ee1b139cd5c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This latest report from Cointelegraph Research dives into the tsunami of solutions coming onto the market that improve security, privacy and speed from existing protocols.</p>\n                    <p><p>The long-awaited “crypto spring” may be upon us as Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and other cryptocurrency markets rise in <a href=\"https://cointelegraph.com/news/4-signs-bitcoin-price-starting-next-bull-run\">anticipation of a full-on bull market</a>. </p><p>Over the recent crypto winter, many different projects have been growing, gaining users and building new networks. Some of these, like Polygon, are <a href=\"https://cointelegraph.com/learn/a-beginners-guide-on-blockchain-layer-2-scaling-solutions\">layer-2 (L2) solutions</a> to help scale the primary protocol, Ethereum. But what are the implications of L2s? Are they a better protocol to build on or invest in? Are other layer 1s (L1s) doing anything to stay competitive? </p><p>These questions and more are the focus of a new report from the Cointelegraph Research Terminal. The report looks at up-and-coming projects in the cryptoverse, as well as case studies for L1s like Avalanche and Hedera and how they compare to the new tech that is on the rise. </p><p><em>Download the report on the Cointelegraph Research Terminal.</em></p><p>Cointelegraph’s “L1 vs. L2: The Blockchain Scalability Showdown” report is a primer to why scaling solutions are necessary for the shortcomings of L1s. The report provides explanations of what is currently going on in the world of scalability solutions to bridges and projects that focus on interoperability. </p><p>Layer-1 blockchains, such as Bitcoin and Ethereum, are base protocols that can be used in conjunction with third-party layer-2 protocols and are also known as mainnets or primary chains. </p><p>A <a href=\"https://cointelegraph.com/learn/whats-the-difference-between-blockchain-layers-l0-and-l1\"></a><a href=\"https://cointelegraph.com/learn/whats-the-difference-between-blockchain-layers-l0-and-l1\">layer-0 (L0)</a> protocol allows developers to combine elements from different L1 and L2 protocols while retaining their own ecosystem to heighten interoperability. </p><p>L2 protocols enable thousands of low-value transactions to be processed after validation on parallel blockchains, with records then being transferred to the main blockchain or mainnet to ensure they are immutably recorded. This report will help get the reader ready for “crypto summer” with all the information and insights to make better-informed decisions. </p><h2>Gas fees are just the start</h2><p>As veterans in the blockchain space know, <a href=\"https://cointelegraph.com/explained/will-the-ethereum-20-update-reduce-high-gas-fees\">Ethereum gas fees</a><a href=\"https://cointelegraph.com/explained/will-the-ethereum-20-update-reduce-high-gas-fees\"></a> have been a significant issue, sometimes costing users more in the Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) transaction cost (measured in gwei) than the value of the underlying asset. As the chart below shows, the price of transactions on Ethereum can fluctuate dramatically, leaving users with an unpredictable experience that can hurt further adoption. </p><p>This sparked the creation of solutions to combat the issue, as well as increased scalability, including transactions per second (TPS), interoperability and ease of user experiences for developers and users. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/1f20e393-2f74-4ec2-bae2-367076545fcb.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Ethereum average gas price chart</figcaption></figure><h2>Protocol comparison, more than just speed </h2><p>TPS is one crucial factor that separates newer protocols from the older generations, such as Bitcoin and Ethereum. Bitcoin and Ethereum act as their own L1s but do not have intrinsic solutions to operating at speeds comparable to newer networks, as seen in the table below. </p><p>Today, there are layer-0 protocols that serve as a base layer in which different protocols can work interoperably. Layer-2 protocols are built on top of L1s to help fill in and overcome gaps that may exist on the L1. </p><p>For example, if a protocol has a low TPS, an L2 may provide an inexpensive and efficient way to still use the same programming language and infrastructure of the L1 for security. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/a6a53e12-6352-44ec-ba00-3a5f30aaeb46.png\"  /><figcaption style=\"text-align: center;\">TPS speeds of newer protocols. Source: Cointelegraph Research</figcaption></figure><h2>Top trends for the future </h2><p>The report provides several insights, including the top emerging trends that are leading the narrative of protocols outside of the traditional L1s, such as asset tokenization and account abstraction.</p><p> Asset tokenization, including the digital representation of <a href=\"https://cointelegraph.com/news/token-adoption-real-world-assets-blockchain\">real-world assets (RWA)</a> onto decentralized ledger protocols, will play a significant role in the spread of next-generation protocols. </p><p>The migration of assets to these protocols will increase transaction congestion as adoption rates climb. This increased adoption also has consequences, including the need to make custody for average users easier. This is where the next trend, <a href=\"https://cointelegraph.com/learn/account-abstraction-guide-to-ethereums-erc-4337-standard\">account abstraction</a>, comes into play. </p><p>Account abstraction will help user experiences by removing requirements like keeping seed phrases for account recovery. It could also allow for the batching of smart contract executions like complex payment structures to be simplified. By making user experiences easier, L0s and L2s can help spur the next leg of mass adoption.</p><p>Cointelegraph Research’s latest report is a starting place to help analyze these newer protocols. The report also includes insider insights from industry professionals who are on the cutting edge of different technologies in the decentralized ledger space. </p><h2>The Cointelegraph Research team</h2><p>Cointelegraph’s Research department comprises some of the best talents in the blockchain industry. Bringing together academic rigor and filtered through practical, hard-won experience, the researchers on the team are committed to bringing the most accurate, insightful content available on the market.</p><p>The research team comprises subject matter experts from across the fields of finance, economics and technology to bring the premier source for industry reports and insightful analysis to the market. The team utilizes APIs from a variety of sources in order to provide accurate, useful information and analyses. </p><p>With decades of combined experience in traditional finance, business, engineering, technology and research, the <a href=\"https://research.cointelegraph.com/\">Cointelegraph Research team</a> is perfectly positioned to put its combined talents to proper use with the “L1 vs. L2: The Blockchain Scalability Showdown” report.</p><p><em>The opinions expressed in the article are for general informational purposes only and are not intended to provide specific advice or recommendations for any individual or on any specific security or investment product.</em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-06T16:10:36.000Z",
    "title": "Conflux multichain protocol shuts down after two years",
    "url": "http://cointelegraph.com/news/conflux-multichain-blockchain-protocol-shuts-down",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/71ebac92-c576-4461-ad2f-24156c673583.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>ShuttleFlow will change ownership to be operated and developed by Zero Gravity. </p>\n                    <p><p>ShuttleFlow, the ecosystem multichain protocol operated and maintained by Conflux Foundation, also known as the Shanghai Tree-Graph Blockchain Research Institute, will <a href=\"https://forum.conflux.fun/t/announcement-shuttleflow-is-closing-its-services-on-2023-11-08-asset-bridging-operations-will-migrate-to-zero-gravity/19507\" target=\"_blank\" rel=\"noopener nofollow\">shut down</a> after two years. </p><p>The ShuttleFlow technology stack will instead be transferred to Web3 studio Zero Gravity, which will continue to develop the protocol under a new brand. \"All user funds are secure and will be migrated from ShuttleFlow to Zero Gravity,\" developers wrote, adding, \"Users who have previously bridged through ShuttleFlow and completed the claim of their bridged assets on the destination chain do not need to undergo any additional operations for the migration.\"</p><blockquote>\"After ShuttleFlow shuts down its bridging, users can bridge through Zero Gravity's official dApp or continue using the bridging aggregator, which will integrate Zero Gravity when launched.\"</blockquote><p>The ShuttleFlow decentralized application (dApp) will remain partially operational until January 2024 to allow users who have bridged assets but have not yet claimed them to retrieve their assets. After that, its website and servers will be removed permanently.</p><p>In 2021, Conflux <a href=\"https://medium.com/conflux-network/shuttleflow-enabling-the-future-of-defi-through-true-multi-chain-connection-e60c2bada7d4\" target=\"_blank\" rel=\"noopener nofollow\">launched</a> the Shuttleflow asset bridge to better onboard its ecosystem users to decentralized finance. The company said at the time that its proof-of-work algorithm allowed protocol transactions of up to 6,000 per second. Earlier this year, Conflux Foundation announced a partnership with China Telecom, the second-largest in the country with over 390 million users, to develop a blockchain SIM card. </p><p>Conflux is a <a href=\"https://cointelegraph.com/news/conflux-partners-with-china-telecom-to-develop-blockchain-sim-card\">layer-1 blockchain</a> operating on a hybrid proof-of-work and proof-of-stake consensus. Its parent, the Shanghai Tree-Graph Blockchain Research Institute, is supported by the Shanghai Municipal People’s Government. The project claims to be the “only regulatory-compliant public blockchain in China.”</p><p><strong>Related: <a href=\"https://cointelegraph.com/news/multichain-inside-job-and-sol-surges-80-in-a-month-finance-redefined\">Multichain inside job? And SOL surges 80% in a month</a></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-06T16:15:41.000Z",
    "title": "Bitcoin Technical Analysis: Steady Above $35K as Indicators Signal Growth Potential",
    "url": "https://news.bitcoin.com/bitcoin-technical-analysis-steady-above-35k-as-indicators-signal-growth-potential/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2013022463-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Technical Analysis: Steady Above $35K as Indicators Signal Growth Potential\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2013022463-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2013022463-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2013022463-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2013022463-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2013022463-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2013022463-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2013022463.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin&#x2019;s stability appears to be holding as the price consolidates around $35,140, showing a modest 24-hour trading range. Despite recent fluctuations, market sentiment remains cautiously optimistic, with key technical indicators providing a mixed but generally favorable perspective. The neutral readings on the RSI and Stochastic oscillators, alongside bullish signals from moving averages, suggest a potential [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-06T16:24:59.000Z",
    "title": "Government Announces the Establishment of AI Safety Institute",
    "url": "https://www.cryptopolitan.com/government-announces-ai-safety-institute/",
    "description": "The UK government has declared the formation of the AI Safety Institute, set to take over the critical functions of the Frontier AI Taskforce, which will remain under the umbrella of the Department for Science, Innovation, and Technology (DSIT). While the Institute will persist in the safety research and evaluations initiated by the task force, ... <a title=\"Government Announces the Establishment of AI Safety Institute\" class=\"read-more\" href=\"https://www.cryptopolitan.com/government-announces-ai-safety-institute/\" aria-label=\"More on Government Announces the Establishment of AI Safety Institute\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-06T16:18:25.000Z",
    "title": "FaZe Clan’s Ropz Secures MVP Title at Thunderpick World Championship 2023",
    "url": "https://www.cryptopolitan.com/faze-clans-ropz-secures-mvp-title/",
    "description": "FaZe Clan&#8217;s Robin &#8220;ropz&#8221; Kool has emerged as the Most Valuable Player (MVP) of the Thunderpick World Championship 2023, solidifying his status as one of the best players in the world. This online event showcased the talents of 16 top Dota 2 teams, competing for a generous $500,000 prize pool. In the end, FaZe Clan ... <a title=\"FaZe Clan&#8217;s Ropz Secures MVP Title at Thunderpick World Championship 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/faze-clans-ropz-secures-mvp-title/\" aria-label=\"More on FaZe Clan&#8217;s Ropz Secures MVP Title at Thunderpick World Championship 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-06T16:13:18.000Z",
    "title": "“SEC is overreacting on crypto,” says Sen. Cynthia Lummis",
    "url": "https://www.cryptopolitan.com/sec-is-overreacting-on-crypto-sen-lummis/",
    "description": "The United States Securities and Exchange Commission (SEC) has been making lots of moves against the crypto industry, placing allegations on major payers in the digital space. Their actions against cryptocurrencies have been met with heavy scrutiny among members of the crypto community, including top officials who are supporters of digital currencies.&#160; Senator Cynthia Lummis ... <a title=\"“SEC is overreacting on crypto,” says Sen. Cynthia Lummis\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-is-overreacting-on-crypto-sen-lummis/\" aria-label=\"More on “SEC is overreacting on crypto,” says Sen. Cynthia Lummis\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-06T16:33:27.000Z",
    "title": "Ionise protocol unveils first money market on Zilliqa",
    "url": "https://crypto.news/ionise-protocol-unveils-first-money-market-on-zilliqa/",
    "description": "In a Nov. 6 post on X, Zilliqa, a layer-1 blockchain with almost half a million followers, shares the news of the Ionise Protocol, built on Zilliqa EVM, going live on mainnet."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-06T16:10:54.000Z",
    "title": "Research reveals Binance’s shrinking market share in CEXs",
    "url": "https://crypto.news/research-reveals-binances-shrinking-market-share-in-cexs/",
    "description": "According to recent data released by 0xScope, Binance, the world's largest cryptocurrency exchange, is facing a decreasing market share, where it currently sits at 51.2%. "
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-06T16:30:00.000Z",
    "title": "Tellor Reaches 12-month High, Is a Correction Looming?",
    "url": "https://coinedition.com/tellor-reaches-12-month-high-is-a-correction-looming/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/MKR-Whale-Made-Its-Biggest-Moves-in-3-Months-as-MKRs-Price-Falls-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bullish momentum in the Tellor (TRB) market faltered early in the day, retreating from $117.06 to a low of $111.78 before recovering support and resuming the ascent back into the $115 level. The price movement implies that there may be substantial purchasing activity at this level, suggesting that the bulls may prolong the rally. Bulls [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/tellor-reaches-12-month-high-is-a-correction-looming/\">Tellor Reaches 12-month High, Is a Correction Looming?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]