[
  {
    "source": "CoinDesk",
    "date": "2023-07-10T22:50:13.000Z",
    "title": "Bitcoin Falls Below $31K After Late Monday Surge",
    "url": "https://www.coindesk.com/markets/2023/07/10/bitcoin-falls-below-31k-after-late-monday-surge/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The head of research for digital asset manager 3iQ wrote that the largest cryptocurrency by market capitalization is still riding tailwinds from multiple spot bitcoin ETF filings and other June events."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-10T22:43:05.000Z",
    "title": "'The Machines Arena' Adds In-Game Rewards That Can Be Minted as NFTs (Eventually)",
    "url": "https://decrypt.co/148008/machines-arena-adds-in-game-rewards-minted-nfts-eventually",
    "description": "Players with lots of XP in The Machines Arena will be able to unlock character skins that can later be minted and traded."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-10T22:55:27.000Z",
    "title": "Dubai’s virtual assets regulator suspends critical license for crypto exchange BitOasis citing regulatory non-compliance",
    "url": "https://cryptoslate.com/dubais-virtual-assets-regulator-suspends-critical-license-for-crypto-exchange-bitoasis-citing-regulatory-non-compliance/",
    "description": "<p>Dubai&#8217;s Virtual Assets Regulatory Authority (VARA) issued a market alert on July 10 concerning the local crypto exchange BitOasis. The notice indicates that BitOasis&#8217; conditional MVP Licence has been suspended as it has failed to meet the related requirements. Dubai issued BitOasis an MVP license on April 12, 2023, granting the firm the ability to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/dubais-virtual-assets-regulator-suspends-critical-license-for-crypto-exchange-bitoasis-citing-regulatory-non-compliance/\">Dubai&#8217;s virtual assets regulator suspends critical license for crypto exchange BitOasis citing regulatory non-compliance</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-10T22:43:26.000Z",
    "title": "Standard Chartered Raises Bitcoin Price Target to $120,000 by 2024",
    "url": "https://www.cryptoglobe.com/latest/2023/07/standard-chartered-raises-bitcoin-price-target-to-120000-by-2024/",
    "description": "London-based multinational banking and financial services firm Standard Chartered has suggested that the price of the flagship cryptocurrency Bitcoin ($BTC) could surge to $50,000 this year, and could breach the $120,000 by 2024’s close. Back in April, the banking giant made waves in the market with its prediction of Bitcoin reaching $100,000 by the end […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-10T23:00:45.000Z",
    "title": "Bulls Remain Resilient Despite Litecoin’s Fall Below $100, Key Levels To Watch",
    "url": "https://www.newsbtc.com/news/litecoin/bulls-remain-despite-litecoin-fall-below-100/",
    "description": "Despite facing a challenging period in recent months, the price of Litecoin has demonstrated a significant upward trajectory. In June, LTC experienced a decline to $71; however, the bulls subsequently took charge and initiated a recovery. Related Reading: Bitcoin NVT Golden Cross Says BTC Is Overpriced, Decline Soon? Nevertheless, over the past week, LTC&#8217;s progress slowed, with the coin retracing below the $100 mark and experiencing a loss of approximately 12%. On the daily chart, LTC witnessed a 1.5% decline. Although the coin experienced a significant devaluation on the weekly chart, the bullish sentiment remains. The technical analysis of Litecoin indicates that the bulls are currently dominant, with a minor retracement in demand and accumulation. As Bitcoin also retraced on its chart recently, other altcoins, including Litecoin, observed depreciation. Currently, Litecoin is in a crucial price zone ranging from $90 to $94. Sustaining a price above the $94 mark is expected to provide impetus for LTC to resume its upward trajectory. The market capitalization of LTC reflects a higher presence of sellers compared to buyers in the market. Litecoin Price Analysis: One-Day Chart As of the time of writing, LTC was priced at $95. The altcoin attempted to increase in value after successfully holding the $94 support level. The immediate resistance for LTC was observed at $97. The bullish sentiment remained intact for LTC as it managed to stay above the bearish order block (marked in red) formed in mid-April. Surpassing the $97 mark would propel Litecoin to challenge the $100 threshold and potentially move beyond the upper boundary of the bearish order block at $103. Conversely, if LTC fails to maintain its current level, there is a risk of breaching the $94 support, which may invite the bears back into the market. Technical Analysis Following its surge above the $100 threshold, LTC experienced a pullback as it entered an overbought condition. However, the Relative Strength Index (RSI) remained slightly above the half-line, indicating that buyers still maintained control in the market, particularly as the coin held above the crucial support level. Furthermore, LTC remained above the 20-Simple Moving Average line, signaling buyers were driving the price momentum. LTC needs to surpass the immediate resistance level in the upcoming trading sessions to sustain its upward trajectory. LTC has experienced notable capital inflows, indicating that investor interest has remained positive, as evidenced by the Chaikin Money Flow indicator. Related Reading: Bitcoin Sharks And Whales Go On $2.15 Billion Buying Spree, Is It Time To Sell? This indicates a sustained bullish outlook on the chart. Furthermore, the Bollinger Bands, which reflect price volatility and fluctuation, are currently wide open. This suggests that LTC may undergo significant price action and volatility in the upcoming trading sessions. Featured image from UnSplash, charts from TradingView.com"
  }
]