[
  {
    "source": "Cointelegraph",
    "date": "2023-10-20T21:16:23.000Z",
    "title": "Games need decentralized randomness to be fair",
    "url": "https://cointelegraph.com/news/games-need-decentralized-randomness",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/9f2ff669-fb6b-4111-bb84-bc16a9a6b699.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Does your RNG have sufficient randomness? Is it secure against tampering? Is it decentralized? These qualities are critical to building a viable metaverse.</p>\n                    <p><p>Quantum mechanics tells us that what looks like a highly predictable and orderly universe is built on a world of unpredictability and mere probability. While the quantum world looks bizarre, it can be understood and even harnessed for technology like semiconductors, LEDs, and quantum cryptography. Something similar can be said about randomness in the metaverse. What looks like a system built on random values produced by random number generators (RNGs) is, in fact, based on programs with a method behind them that can be understood — for good or ill.</p><h2>The pivotal role of random numbers</h2><p>Random numbers are of great importance in a number of applications, including games, security systems, <a href=\"https://cointelegraph.com/daos-for-beginners/what-is-a-dao\">decentralized autonomous organization (DAO)</a> governance, and <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> generation. If your game cannot access randomly generated numbers, your starts will become repetitive and stale. If your security system relies on easily guessed authentication codes, it isn’t providing much security. If any system that needs variety isn’t getting it, it won’t be very effective. </p><p>Even if these systems don’t look random, they rely on being supplied with randomly generated values to execute important operations. Without access to randomness, well-planned systems can’t operate. However, the random numbers these systems rely on are not always as random as they may seem. </p><p>Many RNGs are, in fact, Pseudo RNGs (PRNGs). Instead of producing random outputs, they are providing the results of a fixed equation. The output value results from running a starting value, often called a “seed,” through this equation. The output is then used as a new seed, and the process starts again. While the outcome isn’t random, it can certainly appear random to an outside observer. </p><p>For many applications, this is effective. True randomness is not required in every application. In a video game with random encounters, for example, there may only be a limited number of actions the game can take at any given time. A PRNG that provides values outside a given scope isn’t going to be of much use. When the stakes are low, technical requirements often match. However, the quality of a PRNG can vary dramatically. This can be an issue for applications with higher stakes, many people depending on them, or a variety of use cases. </p><p>Some PRNGs rely on simple equations which can repeat themselves after a short period of time. This repetition breeds predictability. Others can be influenced by outside factors. This leads to tampering. Additionally, many PRNGs do not provide a way to determine if the number provided is the intended value. This lack of verification opens another door to tampering and can lead to accusations by users that applications relying on these numbers are being manipulated by biased outputs. </p><p>While being able to verify that an apparently random number was the one intended by an RNG may seem silly, it is no laughing matter. The ethos of many blockchain systems is based on transparency and trustlessness. Not being able to confirm that a given number was truly randomly produced strikes at the very heart of these ideals. When the numbers are doing work, such as providing winnings in games or reinforcing security, not being able to prove that the numbers were not tampered with can seriously impact community confidence. </p><p>Additionally, not every PRNG is suited to every possible application. Some are designed for certain Web3 functions. These are not universally applicable. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/8cb92d60-4524-4e27-8c1f-0c8fcd1db279.jpg\"  /><figcaption style=\"text-align: center;\"><em>True random number generators (TRNGs) compared to Pseudo RNGs (PRNGs). Source: Level Up Coding</em></figcaption></figure><h2>The quest for true randomness</h2><p>However, these systems also have failings. They are often highly centralized, which can again lead to tampering by anyone with access to the machine. True randomness often comes at a much higher price than services by a quality PRNG. Lastly, the centralization these devices rely on means that if anything goes wrong, there is system-wide downtime.</p><h2>Decentralization and the imperative of reliability</h2><p>Using an RNG that does not meet your application's decentralization, verification, or security needs can be disastrous. As the collapse of Axie Infinity due to a security breach demonstrated, a technical failure can have major repercussions for even the best applications with the strongest user base. Given how important RNGs are to the applications that use them, the best one for the task at hand must be used. </p><p>The perfect RNG would be unpredictable, tamper-resistant, verifiable, decentralized, and continuously available. If you're selecting an RNG, ask:</p><ul><li>Does it provide sufficient randomness?</li><li>Can the outputs be verified?</li><li>Is it secure against tampering?</li><li>Is it decentralized to avoid single point failures?</li></ul><p>As blockchain developers continue to expand their vision, push the boundaries of their applications, and provide more and more opportunities for the public to engage with the technology, it is imperative that the best possible support for their applications be made available.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Felix Xu</strong> Crypto geek, early adopter, and NFT collector. Felix graduated from NYU Stern and founded two crypto projects, ARPA and Bella Protocol, among the global top 500 by market cap. Felix previously worked at Fosun Investment, Sackler family office, and Vertical Research in New York and Beijing. Felix loves sailing, kitesurfing and was featured in the Wall Street Journal and The New York Times for his NFT collection.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph. </em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-20T21:10:00.000Z",
    "title": "Singapore court authorizes freeze order attached to wallets as soulbound NFT ",
    "url": "https://cointelegraph.com/news/singapore-court-authorizes-freeze-order-attached-wallets-soulbound-nft",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/ee2a3806-a3c0-4e4a-af48-253b9ceb59d5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A British investigative firm tracked down stolen funds and convinced the High Court of Singapore to mark the wallets containing the funds permanently with its order. </p>\n                    <p><p>The Singapore High Court has allowed financial investigation firm Intelligent Sanctuary (iSanctuary) to attach nonfungible tokens (NFTs) containing a legal document to cold wallets associated with a hack, according to United Kingdom-based iSanctuary and local press accounts.</p><p>A court-issued worldwide freeze order was tokenized as soulbound NFTs and attached to the wallets in question. The NFTs will not prevent transactions with the wallets but will serve as a warning to counterparties and exchanges that the wallets were involved in a hack. In addition, iSanctuary claimed it has devised a means of tracking funds leaving the wallets, thanks to the NFTs. The NFTs will be permanently attached to the wallets.</p><p>iSanctuary <a href=\"https://www.isanctuary.io/testimonials/identifying-millions-in-stolen-cryptocurrency\" target=\"_blank\" rel=\"noopener nofollow\">recounted</a> on its website that it was employed by a businessperson who had lost $3 million in crypto assets and was able to track the stolen funds. Furthermore:</p><blockquote>“The on chain and off chain evidence was presented by an iSanctuary senior investigator to the Singapore High Court and the worldwide injunction, a first issued by that court, was granted. iSanctuary financial and crypto investigators identified a series of cold wallets holding the proceeds of the crime and their method of service via NFT was accepted by the court.”</blockquote><p>No additional details were provided. iSanctuary named Mintology, an app <a href=\"https://cointelegraph.com/news/mintable-app-to-support-minting-nfts-on-the-layer-2-immutable-x-protocol\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/mintable-app-to-support-minting-nfts-on-the-layer-2-immutable-x-protocol/amp\">created by Singaporean NFT studio Mintable</a>, as the producer of the NFTs. That was indirectly confirmed by Mintable founder Zach Burks in a posting on X (formerly Twitter).</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Thanks <a href=\"https://twitter.com/straits_times?ref_src=twsrc%5Etfw\">@straits_times</a> for the great article. <br><br>Happy to help clean up the crypto space and move the NFT ecosystem into a realm of utility and away from the speculation of jpegs! <br><br>The future is of NFTs is coming! <a href=\"https://t.co/PKmd7uxD7k\">https://t.co/PKmd7uxD7k</a> shows how.<a href=\"https://t.co/S8Jf2seNhy\">https://t.co/S8Jf2seNhy</a></p>— Zach Burks (@ZachSpaded) <a href=\"https://twitter.com/ZachSpaded/status/1714492064535400484?ref_src=twsrc%5Etfw\">October 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The Straits Times <a href=\"https://www.singaporelawwatch.sg/Headlines/userid/1/crypto-exchanges-in-singapore-roped-in-to-help-with-international-case-on-stolen-assets\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on Oct. 17 that the case was related to a stolen private key and that Singapore-based crypto exchanges were involved in laundering the funds from the hack by fraudsters “purported to be from Singapore.” It added that the case “spans countries from Singapore to Spain, Ireland, Britain and other European countries.”</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/hodl-until-mega-yacht-mintable-founder-shares-crypto-journey\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/hodl-until-mega-yacht-mintable-founder-shares-crypto-journey/amp\">Hodl until mega yacht: Mintable founder shares crypto journey</a></em></strong></p><p>The newspaper quoted iSanctuary founder Jonathan Benton as saying, “This is a game changer; it can happen in hours if needed. We can serve on wallets and start to police the blockchain, identify those holding illicit assets, serve civil or criminal orders, even red flags.”</p><p>NFTs <a href=\"https://cointelegraph.com/news/how-nft-court-summons-could-change-the-legal-landscape\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/how-nft-court-summons-could-change-the-legal-landscape/amp\">have been used to deliver court summonses</a> in Italy and the <a href=\"https://www.linkedin.com/pulse/what-first-subpoena-via-nft-means-future-legal-cases-crypto-henri/\" target=\"_blank\" rel=\"noopener nofollow\">United States</a>. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/token2049-singapore-huobi-asia-express/\">Token2049 captivates Singapore, Huobi rebrands on 10th Anniversary: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  }
]