[
  {
    "source": "CoinDesk",
    "date": "2024-02-01T21:47:47.000Z",
    "title": "OPNX, the Exchange Built by Founders of Doomed Hedge Fund Three Arrows, Is Shutting Down",
    "url": "https://www.coindesk.com/business/2024/02/01/opnx-the-exchange-build-by-founders-of-doomed-hedge-fund-three-arrows-is-shutting-down/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Customers were advised to settle their positions by Feb. 7 and withdraw their money by Feb. 14."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-01T21:50:00.000Z",
    "title": " Genesis reaches $21M settlement with SEC over Gemini Earn program ",
    "url": "https://cointelegraph.com/news/genesis-settlement-sec-gemini-earn",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvODllMDIyOWQtNjgyNS00NjNiLWJkMzMtNDFkNGJkZGYyZTA0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Genesis legal team proposed a Feb. 14 hearing to recognize the SEC settlement as part of its bankruptcy case.</p>\n                    <p><p>Bankrupt firm Genesis Global Holdco and its affiliates said they had settled with the United States Securities and Exchange Commission (SEC) for $21 million.</p><p>In a Jan. 31 filing in U.S. Bankruptcy Court for the Southern District of New York, Genesis debtors <a href=\"https://restructuring.ra.kroll.com/genesis/Home-DownloadPDF?id1=MzA1NjE5Mg==&amp;id2=-1\" target=\"_blank\" rel=\"noopener nofollow\">proposed</a> scheduling a hearing on Feb. 14 to enter a motion recognizing a deal between the firm and the SEC. According to the debtors, the SEC will receive $21 million in exchange for settling its civil lawsuit against Genesis over the “unregistered offer and sale of securities” through the Gemini Earn program.</p><p>“The Settlement Agreement is the product of extensive negotiations between the SEC and GGC,” said the filing. “The proposed settlement will, among other benefits to the Debtors’ estates, resolve the Civil Action Claim filed by the SEC in these Chapter 11 Cases and eliminate the risks, expenses, and uncertainty associated with protracted litigation against the SEC.”</p><p><a href=\"https://cointelegraph.com/news/genesis-settlement-sec-gemini-earn\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-01T21:45:23.000Z",
    "title": "Senator Elizabeth Warren targets illicit crypto finance with legislative proposal",
    "url": "https://www.cryptopolitan.com/elizabeth-warren-targets-illicit-crypto/",
    "description": "In a recent Senate Banking Committee hearing focused on fraud and scams within the banking system, Senator Elizabeth Warren, alongside other Democratic lawmakers, criticized the role of cryptocurrencies in illicit finance and scams. Warren, known for her critical stance on cryptocurrencies, has been actively promoting her Digital Asset Anti-Money Laundering Act to tighten the oversight [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-01T21:48:44.000Z",
    "title": "Valkyrie diversifies spot Bitcoin ETF custody with BitGo",
    "url": "https://crypto.news/bitcoin-etf-bitgo-valkyrie-custody/",
    "description": "Valkyrie is the first spot Bitcoin ETF issuer to leverage two separate crypto custodians for its fund, thanks to its deal with BitGo."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-01T21:44:07.000Z",
    "title": "Bitcoin billionaire Arthur Hayes urges a return to investing in Solana",
    "url": "https://crypto.news/bitcoin-arthur-hayes-investing-in-solana/",
    "description": "Former BitMEX CEO Arthur Hayes recently highlighted Solana's potential for recovery and growth in the crypto market after the FTX downfall and corruption."
  }
]