[
  {
    "source": "Decrypt",
    "date": "2024-03-30T00:00:02.000Z",
    "title": "Phishing Scam Targeted Decrypt Newsletter Subscribers—Here’s the Latest",
    "url": "https://decrypt.co/224133/phishing-email-decrypt-newsletter-latest",
    "description": "The scam email claimed to offer access to a $DECRYPT token airdrop. MailerLite, the service we use, was not at fault."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-29T23:45:19.000Z",
    "title": "Crypto market set for positive turnaround in Q2, says Coinbase executive",
    "url": "https://cryptobriefing.com/crypto-markets-q2-2024/",
    "description": "Coinbase's Head of Research sees a potential crypto market turnaround in Q2, with factors like spot Bitcoin ETFs influencing stability."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-29T23:50:07.000Z",
    "title": "Taiwan’s Crypto Industry Takes a Leap Forward with Government-Backed Association Formation",
    "url": "https://www.cryptopolitan.com/taiwans-crypto-government-backed-association/",
    "description": "The authorization of a specific industry group by the Ministry of the Interior is an essential step in the oversight and management of Taiwan&#8217;s cryptocurrency sector. Establishing a more organized structure is the goal for many in the local crypto community, making this achievement significant for their progress. This decision to approve the formation of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-30T00:00:22.000Z",
    "title": "Cardano Latest Technological Updates Unveiled, Analyst Maintains Bullish Outlook on ADA",
    "url": "https://www.newsbtc.com/news/cardano/cardano-latest-technological-updates-unveiled-analyst-maintains-bullish-outlook-on-ada/",
    "description": "Cardano (ADA), the proof-of-stake blockchain platform, has made notable progress in technological advancements, according to Input Output Hong Kong (IOHK), the engineering firm behind the Cardano blockchain. IOHK&#8217;s recent announcement highlights crucial improvements across various aspects of the platform, signaling further growth and development for Cardano. Cardano Smart Contract Optimization One significant area of improvement lies within the ledger team, which has reportedly enhanced test frameworks and data quality in the Newconstraints phase3. They achieved this by introducing constraints and new types such as Size, SizeSpec, and Sized.  Related Reading: Bitcoin Ready To Rip? Indicator Prints Bullish Signal After 9 Years The engineering company has also noted advancements in wallets and services. The Lace team is preparing to release Lace v.1.9, which promises new features and improvements for Cardano users. In the realm of smart contracts, the Plutus team has included a guide in the documentation, elucidating how to use AsData functionality to optimize scripts. They have also implemented a UPLC optimization pass to minimize the number of forces and delays in the script. Mithril Team Releases Major Update Addressing scalability, the Hydra team has restored test compatibility with all networks and reviewed and merged streaming plugins. They have rectified tutorial instructions for downloading the latest Cardano-node and resolved the observed contesters bug.  The Mithril team has released Mithril distribution 2412.0, encompassing critical updates and enhancements. These include support for the Prometheus metrics endpoint in signer, deprecation of the snapshot command in the client CLI, full Pallas-based implementation of the chain observer, and compatibility with Cardano node v.8.9.0.  Moreover, the team has implemented community-requested features to verify the output folder structure created by the client. They continue to investigate and address any sources of “flakiness” in the CI end-to-end test. Notable Surge In Token Trading Volume According to DeFiLlama data, Cardano&#8217;s total value locked (TVL) currently stands at $422 million, signifying a slight dip of $80 million following the achievement of the $500 million milestone. Cardano boasts a significant figure of $23.3 million in terms of stablecoin market capitalization. Analyzing Token Terminal data reveals several key market indicators for Cardano. The fully diluted market cap, representing the maximum potential market value of all tokens in circulation, is estimated at $29.20 billion, reflecting a notable 4.9% increase over the past 30 days.  Similarly, the circulating market cap, which considers only the tokens in active circulation, stands at $22.88 billion, with a 5.2% growth rate over the same period. Long-Term Outlook Remains Bullish For ADA Regarding price action, crypto analyst &#8220;Trend Rider&#8221; recently shared insights on ADA&#8217;s latest price action in a post on the social media platform X (formerly Twitter).  According to the analyst, ADA&#8217;s price experienced a decline after reaching a yearly high of $0.811 on March 14. It is currently trading within the range of a parabolic red line and a rider band.  The parabolic red line represents a significant resistance level, while the rider band indicates a potential support region for ADA&#8217;s price. This range-bound movement suggests a period of consolidation for ADA, as the cryptocurrency takes a breather before its next significant move. Related Reading: Coinbase Sees Largest USDC Inflow Ever, What This Could Mean For Bitcoin Furthermore, the analyst notes that the bullish strength of the trend has weakened over the past two weeks. This could indicate a temporary slowdown in ADA&#8217;s upward momentum, potentially leading to consolidation or sideways trading.  However, despite this weakening bullish strength, the analyst stated that the overall trend direction remains bullish, suggesting that ADA&#8217;s long-term prospects remain positive. ADA is trading at $0.652, exhibiting a sideways price action in the last 24 hours. However, over the past seven days, the token has successfully recovered from previous losses and registered a gain of 5.4%. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-30T00:00:30.000Z",
    "title": "Bitcoin Cash (BCH) Surges by 37% in One Week Ahead of Upcoming Halving Event in Early April",
    "url": "https://dailyhodl.com/2024/03/28/bitcoin-cash-bch-surges-by-37-in-one-week-ahead-of-upcoming-halving-event-in-early-april/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/halving-event-early-april.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/halving-event-early-april.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/halving-event-early-april.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/halving-event-early-april.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/halving-event-early-april.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/halving-event-early-april.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/halving-event-early-april.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bitcoin Cash (BCH) has surged by more than 37% in the past seven days ahead of its upcoming halving event. BCH, a Bitcoin hard fork that spun off from BTC in 2017, is trading at $573.39, up from $418.46 one week ago. Bitcoin Cash&#8217;s halving date is currently slated for April 3rd, according to the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/28/bitcoin-cash-bch-surges-by-37-in-one-week-ahead-of-upcoming-halving-event-in-early-april/\">Bitcoin Cash (BCH) Surges by 37% in One Week Ahead of Upcoming Halving Event in Early April</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]