[
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T03:09:12.000Z",
    "title": "Boffins Unleash Universal Backdoor, Inducing AI Hallucinations in Image Models",
    "url": "https://www.cryptopolitan.com/boffins-inducing-ai-hallucinations/",
    "description": "A team of computer scientists from the University of Waterloo in Canada has introduced a universal backdoor capable of inducing AI hallucinations in large image classification models. Benjamin Schneider, Nils Lukas, and Professor Florian Kerschbaum detail their innovative technique in a preprint paper titled &#8220;Universal Backdoor Attacks.&#8221; Departing from conventional attacks that focus on specific ... <a title=\"Boffins Unleash Universal Backdoor, Inducing AI Hallucinations in Image Models\" class=\"read-more\" href=\"https://www.cryptopolitan.com/boffins-inducing-ai-hallucinations/\" aria-label=\"More on Boffins Unleash Universal Backdoor, Inducing AI Hallucinations in Image Models\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T02:48:01.000Z",
    "title": "AI Breakthrough Revolutionizes Microplastic Detection for Environmental Protection’s Implications",
    "url": "https://www.cryptopolitan.com/ai-microplastic-detection-for-environmental/",
    "description": "In a move towards environmental protection, a team of interdisciplinary researchers at the University of Waterloo has harnessed the power of artificial intelligence (AI) to revolutionize the identification of microplastics. Microplastics, notorious pollutants causing severe environmental damage, are now under the radar of a cutting-edge AI tool named PlasticNet. Spearheaded by project lead Dr. Wayne ... <a title=\"AI Breakthrough Revolutionizes Microplastic Detection for Environmental Protection&#8217;s Implications\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-microplastic-detection-for-environmental/\" aria-label=\"More on AI Breakthrough Revolutionizes Microplastic Detection for Environmental Protection&#8217;s Implications\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-06T03:02:24.000Z",
    "title": "Bitcoin Price Surges Over 15% In Few Days, $45K Seems Imminent",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-surges-45k/",
    "description": "Bitcoin price extended its rally above the $43,200 resistance. BTC is now consolidating gains and might rally further toward the $45,000 zone. Bitcoin surged further above the $42,200 and $43,200 levels. The price is trading above $43,200 and the 100 hourly Simple moving average. There are two bullish trend lines forming with support near $43,200 and $41,800 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could correct lower toward $43,200 before it starts a fresh increase. Bitcoin Price Extends Rally Bitcoin price remained in a steady uptrend above the $40,000 resistance zone. BTC gained over 15% in the past few days and even surged above the $42,000 zone. The upward move gained pace above the $43,200 resistance zone.  A new multi-month high is formed near $44,465 and the price is now correcting gains. There was a move below the $44,000 level. The price is still above the 23.6% Fib retracement level of the upward move from the $39,476 swing low to the $44,465 high. Bitcoin also trades above $43,200 and the 100 hourly Simple moving average. Besides, there are two bullish trend lines forming with support near $43,200 and $41,800 on the hourly chart of the BTC/USD pair. The second trend line is close to the 50% Fib retracement level of the upward move from the $39,476 swing low to the $44,465 high. On the upside, immediate resistance is near the $44,200 level. The first major resistance is forming near $44,450, above which the price might rise toward the $45,000 level. Source: BTCUSD on TradingView.com A close above the $45,000 resistance might send the price further higher. The next key resistance could be near $46,400, above which BTC could rise toward the $48,000 level. Are Dips Supported In BTC? If Bitcoin fails to rise above the $44,500 resistance zone, it could start a downside correction. Immediate support on the downside is near the $43,250 level. The next major support is near $42,800, below which the price might test the second trend line. If there is a move below $42,000, there is a risk of more downsides. In the stated case, the price could drop toward the $40,500 support in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $43,200, followed by $42,000. Major Resistance Levels – $44,200, $44,450, and $45,000."
  }
]