[
  {
    "source": "CoinDesk",
    "date": "2023-06-08T08:58:49.000Z",
    "title": "Social Media Targeted in EU Consumer Group Complaint About Crypto Ads",
    "url": "https://www.coindesk.com/policy/2023/06/08/social-media-targeted-in-eu-consumer-group-complaint-about-crypto-ads/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BEUC wants Instagram, YouTube, TikTok and Twitter to prohibit influencers from promoting crypto"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T08:44:00.000Z",
    "title": "US federal court dismisses lawsuit against DeFi platform PoolTogether",
    "url": "https://cointelegraph.com/news/us-federal-court-dismisses-lawsuit-against-defi-platform-pooltogether",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/3d88817f-b6c2-449d-be29-491810c9f329.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The DeFi community funded the protocol's legal defense through a $1.4 million nonfungible token sale back in 2022. </p>\n                    <p><p>A United States federal judge has recently dismissed the lawsuit against the <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> platform PoolTogether. According to the ruling, the federal court system is not the correct place to air out concerns against the DeFi startup. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">CASE DISMISSED!!!!<br><br> <a href=\"https://t.co/HDApQZe3Sx\">https://t.co/HDApQZe3Sx</a> <a href=\"https://t.co/SjcDnMnLIV\">pic.twitter.com/SjcDnMnLIV</a></p>&mdash; Leighton  (@lay2000lbs) <a href=\"https://twitter.com/lay2000lbs/status/1666532463428943875?ref_src=twsrc%5Etfw\">June 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>U.S. Judge Frederic Block said that despite having genuine concerns about the startup, a lawsuit in a federal court is not \"an appropriate way to address them.\" The judge also said that the plaintiff Joseph Kent does not have the standing to pursue a lawsuit because he “suffered no concrete harm at the hands of the defendants.” The court order <a href=\"https://www.law360.com/articles/1686439/attachments/0\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a>: </p><blockquote>“Therefore, the Court holds that Kent lacks standing to sue and, accordingly, grants the defendants’ motions to dismiss on that ground. The alternative motions to compel arbitration are denied as moot.”</blockquote><p>The lawsuit was filed by Kent back in October 2021, alleging that the DeFi startup violated gambling laws in New York state by letting people evade financial regulations and scam consumers. It also described the platform as “an old-fashioned numbers racket.”</p><p>However, according to the judge, the injury that Kent claims to have suffered must be similar to the injuries he hopes to find a remedy for in the federal court. However, in this case, the judge said that there was a mismatch. In the end, the case was dismissed. </p><p>Despite the decision, the judge said that Kent is \"free to pursue his claims in state court” and ancillary issues raised in the dismissal motions that remain unanswered should be “resolved by the New York Court of Appeals.\"</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cumberland-labs-unveils-saas-api-for-public-blockchains-defi-protocols\"><strong><em>Cumberland Labs unveils SaaS API for public blockchains and DeFi protocols</em></strong></a></p><p>Members of the community rejoiced with the decision, with some even <a href=\"https://twitter.com/UncleRewards/status/1666580923943452673\" target=\"_blank\" rel=\"noopener nofollow\">saying</a> that their <a href=\"https://cointelegraph.com/tags/nft\">nonfungible token (NFT)</a> now has a utility and others expressing their support. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Finally, some great news in cryptolaw this week. <a href=\"https://twitter.com/lay2000lbs?ref_src=twsrc%5Etfw\">@lay2000lbs</a> is one of the best actors in the industry and I was truly disheartened when the case was brought against both <a href=\"https://twitter.com/PoolTogether_?ref_src=twsrc%5Etfw\">@PoolTogether_</a> and him personally. Great work from <a href=\"https://twitter.com/ohaiom?ref_src=twsrc%5Etfw\">@ohaiom</a>! <a href=\"https://t.co/5K0vqyK8x6\">https://t.co/5K0vqyK8x6</a></p>&mdash; Nick Pullman (@NickPullmanEsq) <a href=\"https://twitter.com/NickPullmanEsq/status/1666560884267950080?ref_src=twsrc%5Etfw\">June 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In 2022, the DeFi startup raised 769 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), around $1.4 million at the time, by selling PoolyNFTs. The funds were <a href=\"https://cointelegraph.com/news/defi-community-rallies-behind-pooltogether-to-hit-1-4m-nft-defense-funding-target\">used to fight against the lawsuit</a>, which some community members believed to be an attack on the DeFi sector as a whole. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethereums-layer-2-zk-rollups-can-become-interoperable/\"><strong><em>Here’s how Ethereum’s ZK-rollups can become interoperable</em></strong></a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-08T08:49:31.000Z",
    "title": "Three consecutive days of Bitcoin outflows",
    "url": "https://cryptoslate.com/insights/three-consecutive-days-of-bitcoin-outflows/",
    "description": "<p>Quick Take Looking at all exchanges combined, yesterday was the second largest Bitcoin outflow, 15,000 Bitcoin. Currently, 2.292M Bitcoin sit on exchanges, now only 8K BTC away from where we were at the start of the year but 60% higher in price. Three consecutive days of outflows</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/three-consecutive-days-of-bitcoin-outflows/\">Three consecutive days of Bitcoin outflows</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-08T08:55:16.000Z",
    "title": "Cathie Wood’s Ark Invest Buys the Coinbase Dip",
    "url": "https://cryptodaily.co.uk/2023/06/cathie-woods-ark-invest-buys-the-coinbase-dip",
    "description": "<p>As most investors offloaded Coinbase shares following the SEC&rsquo;s lawsuit, Cathie Wood&rsquo;s Ark Invest took the opportunity to buy the dip. </p>\n<p>Cathie Wood&rsquo;s Ark Invest knows when to grab an opportunity and run. After the US Securities and Exchange Commission (SEC) announced a lawsuit against crypto exchange Coinbase, three funds of Ark Investment Management added almost 420,000 Coinbase (COIN) shares.</p>\n<p>According to its trade disclosures, the flagship Ark Innovation ETF (NYSE: ARKK) added around 330,000 Coinbase shares, worth about $17 million based on the closing price on Tuesday. Ark Next Generation Internet ETF (NYSE: ARKW) bought about 53,900 shares, worth $2.8 million, and Ark Fintech Innovation ETF (NYSE: ARKF) bought approximately 35,700 shares, worth about $1.8 million, Forbes reports.</p>\n<p>Throughout Tuesday, Coinbase&rsquo;s stock dropped 11.4%, with share prices dipping from $58.26 to $51.61.</p>\n<p>Tuesday&rsquo;s purchase marks the first since May 3 and brought Ark&rsquo;s total Coinbase holdings to 11.44 million shares, a position worth approximately $590 million.</p>\nThe SEC&rsquo;s Crypto Witch Hunt\n<p>This week, the SEC launched an attack on crypto by suing Coinbase and rival exchange Binance.</p>\n<p>According to the agency, Coinbase allegedly acted as an unregistered securities exchange, broker, and clearing agency, charging it for &ldquo;the unregistered offer and sale of securities in connection with its staking-as-a-service program.&rdquo;</p>\n<p>It further deems at least 13 crypto assets on Coinbase&rsquo;s platform as &ldquo;crypto asset securities.&rdquo; Among the SEC&rsquo;s extensive list of so-called securities are Cardano (ADA), Polygon (MATIC), and Solana (SOL).</p>\n<p>The SEC&rsquo;s declaration of some tokens as securities has caused doubt in the industry. Crypto trading platform Robinhood is reportedly reconsidering its crypto offerings by &ldquo;actively reviewing&rdquo; the SEC&rsquo;s analysis &ldquo;to determine what if any, action to take.&rdquo;</p>\n<p>Coinbase CEO and co-founder Brian Armstrong welcomed the lawsuit and said a court battle would help establish much-needed clarity around industry rules and regulations.</p>\n\n<p dir=\"ltr\" lang=\"en\">Regarding the SEC complaint against us today, we're proud to represent the industry in court to finally get some clarity around crypto rules.Remember:1. The SEC reviewed our business and allowed us to become a public company in 2021.2. There is no path to \"come in and&hellip;</p>\n&mdash; Brian Armstrong 🛡️ (@brian_armstrong) June 6, 2023\n<p>\n\n</p>\n<p>Before filing suit against Coinbase, the securities regulator accused Binance and its CEO, Changpeng Zhao, of allegedly mishandling customer funds and lying to investors and regulators about its operations. The SEC also accused Binance of operating as an unregistered securities exchange.</p>\n<p>Binance and its CEO denied the claims.</p>\n<p>The agency doubled down its regulatory action against Binance and filed an emergency application for a temporary restraining order to freeze the assets of two of Binance&rsquo;s US units.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T08:57:42.000Z",
    "title": "Crypto exchanges face SEC lawsuits over securities law violations",
    "url": "https://www.cryptopolitan.com/exchanges-face-sec-lawsuits-over-securities/",
    "description": "The US Securities and Exchange Commission (SEC) has filed lawsuits against major crypto exchanges Coinbase and Binance, alleging that they have used deceptive business practices and broken securities laws. The US authorities are intensifying their efforts to regulate the crypto sector, which will have an impact on key actors and raise concerns about investor protection ... <a title=\"Crypto exchanges face SEC lawsuits over securities law violations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/exchanges-face-sec-lawsuits-over-securities/\" aria-label=\"More on Crypto exchanges face SEC lawsuits over securities law violations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T08:52:29.000Z",
    "title": "Coinbase CEO Brian Armstrong stands firm amidst SEC lawsuit, staking services to continue",
    "url": "https://www.cryptopolitan.com/coinbase-ceo-brian-armstrong-says-staking-services-will-continue/",
    "description": "Coinbase, the largest cryptocurrency exchange in the United States, remains undeterred by the recent lawsuit filed against it by the Securities and Exchange Commission (SEC). The company&#8217;s CEO, Brian Armstrong, assured investors and users that the legal action would not impact its operations, including its staking services, which were among the products targeted by the ... <a title=\"Coinbase CEO Brian Armstrong stands firm amidst SEC lawsuit, staking services to continue\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-ceo-brian-armstrong-says-staking-services-will-continue/\" aria-label=\"More on Coinbase CEO Brian Armstrong stands firm amidst SEC lawsuit, staking services to continue\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-08T08:59:27.000Z",
    "title": "Top 3 Ignorant Ways Crypto Users Can Give Scammers Access To Their Wallets",
    "url": "https://nulltx.com/top-3-ignorant-ways-crypto-users-can-give-scammers-access-to-their-wallets/",
    "description": "Wallet scam or hack is a growing thing in the crypto space in recent months. Several techniques can be used to stop situations like the recent theft of over $35 million in cryptocurrency from Atomic Wallet. The protection of users&#8217; funds can be considerably improved by using strong security techniques like two-factor authentication, encryption, and [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-08T08:50:06.000Z",
    "title": "BitDAO (BIT) And Chiliz (CHZ) Loses as Investors Troop to the Ongoing Sparklo (SPRK) Presale to Make Profits",
    "url": "https://nulltx.com/bitdao-bit-and-chiliz-chz-loses-as-investors-troop-to-the-ongoing-sparklo-sprk-presale-to-make-profits/",
    "description": "Holders of BitDAO (BIT) and Chiliz (CHZ) are crossing over to the latest jewel in the crypto market which is Sparklo after unconvincing price performances of both coins. Sparklo has emerged as the best alternative for many investors who are dissatisfied with the performance of their portfolio and the token has been living up to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-08T08:55:38.000Z",
    "title": "Polkadot Metrics Surge With Project Launches – Good News For DOT Price?",
    "url": "https://www.newsbtc.com/all/polkadot-metrics-surge-with-project-launches-good-news-for-dot-price/",
    "description": "Polkadot, the innovative multi-chain platform, has witnessed a remarkable surge in its key metrics following the launch of several ambitious projects. With an ecosystem bustling with activity and growing adoption, DOT’s performance metrics have soared to new heights.  Amidst this flurry of activity and positive indicators, the cryptocurrency market remains notoriously volatile. Cryptocurrencies have been subject to significant price swings, influenced currently by the regulatory developments chauffeured by the Securities and Exchange Commission (SEC). Will the growing momentum of Polkadot&#8217;s ecosystem be enough to sustain its strength amidst uncertain times?  Polkadot Emerges As Go-To Platform For Project Launches Polkadot Insider, a widely followed Twitter account that provides regular updates on the Polkadot ecosystem, recently shared an exciting revelation: Polkadot is rapidly becoming one of the most sought-after blockchain platforms for launching innovative projects.  🚀 @Polkadot is quickly becoming one of the most popular blockchain platforms for launching new projects 👀 Let&#8217;s take a look at the top parachains on the Polkadot ecosystem based on the number of investors they&#8217;ve attracted Top 3 include: 🥇 @AcalaNetwork: 36 🥈 @AstarNetwork:… pic.twitter.com/0mUCPqRlxA — Polkadot Insider (@PolkadotInsider) June 6, 2023 According to Polkadot Insider&#8217;s tweet, three specific parachains have emerged as the frontrunners in terms of investor interest within the Polkadot ecosystem. These parachains are Manta Network, Acala Network, and Astar Network. Their ability to capture the attention of numerous investors serves as a testament to the confidence placed in Polkadot as a launching pad for groundbreaking projects. In another noteworthy tweet, Polkadot Insider drew attention to the network statistics of Polkadot from the previous week. The tweet emphasized that Polkadot&#8217;s native token, DOT, displayed commendable stability in terms of daily active users and transaction volumes. This stability indicates a promising outlook for the platform and instills confidence in its ability to maintain consistent user engagement and network activity. POLKADOT WEEKLY RECAP 🚀Another weekly go through &#38; however, @Polkadot is still on the way to growth 👉Based on the data from @tokenterminal &#38; @subscan_io ✅AVG Developers: 162 ✅AVG Transactions: 6096 ✅AVG Users: 3513 👇Check out the details below#Polkadot #DOT pic.twitter.com/GlqhAK15ZW — Polkadot Insider (@PolkadotInsider) June 6, 2023 DOT Price Reacts To Key Developments The native token of Polkadot, DOT, has experienced a marginal increase in its price on crypto market tracker, CoinGecko. According to the most recent data available, the DOT price currently stands at $5.03, indicating a modest rally of 2.6% over the past 24 hours. Source: Coingecko This slight upward movement brings a glimmer of positivity to both the Polkadot community and investors, offering a temporary respite in the face of the prevailing challenges within the cryptocurrency market. Technical indicators play a crucial role in understanding the potential direction of a cryptocurrency&#8217;s price. In the case of DOT, its Moving Average Convergence Divergence (MACD) displayed a bullish crossover, which suggests a favorable development for buyers. Additionally, the Money Flow Index (MFI) registered an uptick, further increasing the likelihood of a continued uptrend in DOT&#8217;s price. However, it&#8217;s important to note that Polkadot&#8217;s Relative Strength Index (RSI) raised some concerns as it dipped below the neutral zone. The RSI provides insights into whether a cryptocurrency is overbought or oversold, and a reading below the neutral zone may indicate a potential downside risk. Featured image from"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-08T08:48:48.000Z",
    "title": "Chainlink to Power Tokenization of 10% of Trillions of Dollars in Global Assets by 2030",
    "url": "https://www.crypto-news-flash.com/chainlink-to-power-tokenization-of-10-of-trillions-of-dollars-in-global-assets-by-2030/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-to-power-tokenization-of-10-of-trillions-of-dollars-in-global-assets-by-2030",
    "description": "<p>Chainlink (LINK) is used by almost every other Dapp in the market to provide quality and reliable price feeds. The tokenization industry is expected to run on the Chainlink network to access private investors. The global economy is fast transforming to the digital era as the demand for automation, transparency, and interoperability transcends the traditional [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/chainlink-to-power-tokenization-of-10-of-trillions-of-dollars-in-global-assets-by-2030/\">Chainlink to Power Tokenization of 10% of Trillions of Dollars in Global Assets by 2030</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-08T08:40:27.000Z",
    "title": "Fundamental Analysis of InQubeta (QUBE) and Cardano (ADA) Investment Potential",
    "url": "https://www.crypto-news-flash.com/fundamental-analysis-of-inqubeta-qube-and-cardano-ada-investment-potential/?utm_source=rss&utm_medium=rss&utm_campaign=fundamental-analysis-of-inqubeta-qube-and-cardano-ada-investment-potential",
    "description": "<p>When it comes to investing in cryptocurrencies, conducting a fundamental analysis is essential to assess the long-term viability and potential returns of a particular token. In this article, we will delve into the fundamental analysis of two prominent projects: InQubeta (QUBE) and Cardano (ADA). InQubeta: Driving AI Growth Using Blockchain Technology InQubeta (QUBE) is an [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/fundamental-analysis-of-inqubeta-qube-and-cardano-ada-investment-potential/\">Fundamental Analysis of InQubeta (QUBE) and Cardano (ADA) Investment Potential</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-08T08:58:00.000Z",
    "title": "Asia Ascends Through Crypto Space as US Trading Volume Plummets",
    "url": "https://coinedition.com/asia-ascends-through-crypto-space-as-us-trading-volume-plummets/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/U.S-Crypto-Investors-RACING-TO-THE-EXIT-Where-to-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/U.S-Crypto-Investors-RACING-TO-THE-EXIT-Where-to-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/U.S-Crypto-Investors-RACING-TO-THE-EXIT-Where-to-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/U.S-Crypto-Investors-RACING-TO-THE-EXIT-Where-to.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Prominent crypto influencer, Crypto Banter, has thrown light upon the adverse effects of the increasing regulatory environment in the United States for the country’s biggest crypto investors. He exposed the scary fact that the previous year’s 27.2% crypto trading volume in America has plummeted to just 10.3% this year subsequent to the US regulator’s stringent [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/asia-ascends-through-crypto-space-as-us-trading-volume-plummets/\">Asia Ascends Through Crypto Space as US Trading Volume Plummets</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-08T08:40:55.000Z",
    "title": "Crypto Analyst Believes RNDR Has Dropped Into a Good Buying Area",
    "url": "https://coinedition.com/crypto-analyst-believes-rndr-has-dropped-into-a-good-buying-area/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/So-far-the-risk-is-paying-off-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/So-far-the-risk-is-paying-off-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/So-far-the-risk-is-paying-off-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/So-far-the-risk-is-paying-off.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The crypto market analyst with Twitter identity La Cabra (@blockchain_goat) believes the recent RNDR price drop plunged the digital token into a good buy area. In a tweet, the analyst described the current price zone as an area with prospects of recovery and consolidation. On Monday, June 5, 2023, RNDR’s price fell from $2.71 to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-analyst-believes-rndr-has-dropped-into-a-good-buying-area/\">Crypto Analyst Believes RNDR Has Dropped Into a Good Buying Area</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]