[
  {
    "source": "CoinDesk",
    "date": "2023-05-31T18:47:09.000Z",
    "title": "The PulseChain Sideshow Tent Is Collapsing",
    "url": "https://www.coindesk.com/consensus-magazine/2023/05/31/the-pulsechain-sideshow-tent-is-collapsing/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Welcome to Bizarro Crypto, where actually launching a project is the worst possible plan."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-31T19:00:00.000Z",
    "title": "NFT collections take massive price hit in 2023: Nifty Newsletter, May 24–30",
    "url": "https://cointelegraph.com/news/nft-collections-take-massive-price-hit-in-2023-nifty-newsletter-may-24-30",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/9ccc16dd-6775-4fa5-8d78-fd8763f833aa.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The value of popular NFTs has sharply declined over the past year, with drops of up to 95%.</p>\n                    <p><p>In this week’s newsletter, read about some of the most popular <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> collections and top metaverse properties taking massive price hits in 2023. Check out how the Hong Kong Police Force launched its own metaverse platform, and how Reddit’s digital collectibles have managed to onboard almost 10 million users to the crypto and NFT space. In other news, infamous crypto hater Peter Schiff has launched his own NFT collection on Bitcoin Ordinals. </p><h2>Popular NFT collections take massive price hit in 2023</h2><p>The value of popular NFTs from 2022 has plummeted over the past year. NFTs like Doodles, Invisible Friends, Moonbirds and Goblintown have seen their Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) value drop by as much as 95%, while even blue-chip NFT collections have experienced an average decrease of over 40%. </p><p>Despite these losses, NFT investors remain undeterred. The number of blue-chip NFT holders has increased by over 90% in the past year, although there has been a 30% decrease in buyers alongside a 32% increase in sellers.</p><p><a href=\"https://cointelegraph.com/news/popular-nft-investments-take-a-massive-hit-in-2023\"><strong>Continue reading</strong></a></p><h2>Reddit collectible avatars onboard nearly 10 million into the crypto, NFT space</h2><p>After initially surging and reaching around 3 million holders in November 2022, the number of Reddit avatar holders experienced significant growth in 2023.</p><p>Since the beginning of the year, the number of Reddit avatar holders has risen by 80%, resulting in a market capitalization of $38.4 million and a collection of 13.7 million NFT avatars. Notably, there have been 303,033 sales, generating a cumulative sales volume of $32.6 million.</p><p><a href=\"https://cointelegraph.com/news/reddit-collectible-avatars-onboard-millions-crypto-nft\"><strong>Continue reading</strong></a></p><h2>Hong Kong Police Force launches new metaverse platform, ‘CyberDefender’</h2><p>The Hong Kong Police Force’s cybersecurity unit has launched CyberDefender, a metaverse platform to educate the public about the risks associated with Web3 and the metaverse. </p><p>The platform was introduced to prepare citizens for the challenges of the digital age, particularly in preventing technology-related crimes. An event called “Exploring the Metaverse” was held on the platform, emphasizing the need for caution in the metaverse and addressing crime prevention strategies.</p><p><a href=\"https://cointelegraph.com/news/the-hong-kong-police-force-launch-metaverse-platform-cyberdefender\"><strong>Continue reading</strong></a></p><h2>Crypto hater Peter Schiff to drop Bitcoin Ordinals NFT art collection</h2><p>Prominent economist and crypto skeptic Peter Schiff, known for his criticism of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and cryptocurrencies, has surprisingly unveiled a collaborative NFT art collection on the Bitcoin network. </p><p>The “Golden Triumph” collection includes physical paintings, prints and digital versions inscribed as Ordinal NFTs on the Bitcoin blockchain. The announcement has garnered mixed reactions from the crypto community, with some finding it baffling or amusing, while others see it as hypocritical given Schiff’s previous negative stance on crypto.</p><p><a href=\"https://cointelegraph.com/news/crypto-hater-peter-schiff-unveils-bitcoin-ordinals-nft-project\"><strong>Continue reading</strong></a></p><h2>Top metaverse property investments suffer massive losses: Report</h2><p>While tech giants and major economies continue to explore the potential of the metaverse through investments and initiatives, the market for virtual lands has faced significant depreciation.</p><p>The prices of virtual lands in top metaverses have experienced a significant decline, with most properties losing around 90% of their value since their peak in 2022. Metaverse properties like Otherdeeds, The Sandbox, Decentraland, Somnium and Voxels have all depreciated, according to a study by CoinGecko.</p><p><a href=\"https://cointelegraph.com/news/top-metaverse-property-investments-suffer-massive-losses-report\"><strong>Continue reading</strong></a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-01/43adc850-7dbd-4fa8-811b-9eb32b6c1983.jpg\"  alt=\"\"  title=\"NFT collections take massive price hit in 2023: Nifty Newsletter, May 24&ndash;30\"  /></figure><p class=\"post-content__accent post-content__accent_big\"><a href=\"https://cointelegraph.com/podcasts/nft-steez\">CHECK OUT COINTELEGRAPH’S <em>NFT STEEZ</em> PODCAST</a></p><p><em>Thanks for reading this digest of the week’s most notable developments in the NFT space. Come again next Wednesday for more reports and insights into this actively evolving space.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-31T19:00:00.000Z",
    "title": "Fantom starts paying developers to generate gas fees",
    "url": "https://cointelegraph.com/news/fantom-starts-paying-developers-to-generate-gas-fees",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/a75ab4f4-5c85-487d-b3ae-a5d59aa8fc66.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Developers will get a 15% cut of the fees they generate, but only if their app has done more than 125,000 transactions and has existed for three months.</p>\n                    <p><p>A new program from the Fantom Opera network (FTM) team will <a href=\"https://fantom.foundation/blog/gas-monetization-sustainable-income-for-developers/\" target=\"_blank\" rel=\"noopener nofollow\">pay</a> developers for the gas fees they generate from users, according to a May 31 announcement. Specifically, the “Gas Monetization Program” will pay eligible developers 15% of the total gas fees their apps generate.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Gas Monetization on <a href=\"https://twitter.com/hashtag/Fantom?src=hash&amp;ref_src=twsrc%5Etfw\">#Fantom</a> is live! ⛽<br><br>The program provides dApps with a sustainable income by offering them a 15% share of the gas fees they generate.<br><br>Over 12,000 <a href=\"https://twitter.com/search?q=%24FTM&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$FTM</a> has been distributed thus far <a href=\"https://t.co/BqpuKtrZh0\">https://t.co/BqpuKtrZh0</a></p>&mdash; Fantom Foundation (@FantomFDN) <a href=\"https://twitter.com/FantomFDN/status/1663923422630486019?ref_src=twsrc%5Etfw\">May 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Six Web3 apps have already been approved for the program, including ParaSwap, Beethoven X, Stargate, LayerZero, WOOFi, and SpookySwap. These apps have generated over 12,000 FTM (worth approximately $3,715) of rewards already, the announcement stated.</p><p>The program was inspired by the “Web2 ad-revenue model” implemented by sites like YouTube and Snapchat that pay content creators for their contributions. The Fantom team hopes it will provide developers with an “alternative source of revenue,” leading to a “sustainable” ecosystem for Fantom.</p><p>However, not all apps will be eligible for the program. Protocols that have done less than 125,000 transactions or have been live on Fantom for less than three months will be automatically excluded. Others can apply to become part of the program, but Fantom warned that “the criteria are subject to change as the Fantom Foundation assesses their effectiveness.”</p><p>The team encountered some pushback from users when they first began discussing the Gas Monetization Program. “There are some who have speculated that the Gas Monetization program might discourage developers from creating gas-efficient contracts, as higher gas fees results in greater FTM rewards for them to claim,” the Fantom team said.</p><p>However, Fantom argued that this reasoning is flawed. They believe app developers will still need to make gas-efficient contracts; otherwise, the apps will be challenged by competitors. The team clarified that apps perceived to be abusing the program may be suspended from participation. </p><p>Fantom has been preparing for the Gas Monetization Program since December when it <a href=\"https://cointelegraph.com/news/fantom-wants-to-cut-token-burn-rate-by-75-to-fund-dapp-rewards-program\">proposed a 75% cut</a> to the token burn rate to finance it. Later that month, Fantom Foundation director and DeFi architect Andre Cronje announced that the team would <a href=\"https://cointelegraph.com/news/andre-cronje-says-fantom-will-focus-on-dapp-ecosystem-expansion-in-2023\">focus on “gas reform”</a> in 2023 to onboard more developers and users.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-31T18:55:00.000Z",
    "title": "Web3 gaming gets competitive: QORPO Game Studio joins Cointelegraph Accelerator",
    "url": "https://cointelegraph.com/news/web3-gaming-gets-competitive-qorpo-game-studio-joins-cointelegraph-accelerator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/6d9baff578fba1e2133290b99f01257b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Web3 game developer QORPO Game Studio aims to introduce competitive esports to the Web3 gaming ecosystem.</p>\n                    <p><p>The <a href=\"https://cointelegraph.com/explained/what-are-web3-games-how-do-they-work\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/what-are-web3-games-how-do-they-work/amp\">Web3 gaming world</a> saw consistent growth and exciting developments in the first quarter of 2023, <a href=\"https://dappradar.com/blog/state-of-blockchain-gaming-in-q1-2023\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">according</a> to a DappRadar report. Traditional Web2 gaming companies started to notice blockchain technology’s potential, resulting in a total of $739 million invested in blockchain games and metaverse projects during the first quarter of 2023.</p><p>From the open-world role-playing games to battle royale-themed shooters, gaming quickly turned to a major point of interaction between users and Web3, with almost <a href=\"https://cointelegraph.com/news/gamers-made-up-nearly-half-of-all-blockchain-activity-in-january-dappradar-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/gamers-made-up-nearly-half-of-all-blockchain-activity-in-january-dappradar-report/amp\">half of blockchain activity</a> coming from gaming. While play-to-earn provides a fresh take on players’ experience of a game, there’s an even bigger potential for <a href=\"https://cointelegraph.com/news/crypto-seems-ready-to-solve-gaming-industrys-microtransaction-dilemma\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-seems-ready-to-solve-gaming-industrys-microtransaction-dilemma/amp\">Web3 gaming with microtransactions</a>. Web2 gaming offers skins or other in-game items via microtransactions, but the inefficiency and lack of transparency of traditional payment methods are often met with criticism from players.</p><p>Founded in 2018, QORPO Game Studio seeks to pair up <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-everything-there-is-to-know\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/how-does-blockchain-work-everything-there-is-to-know/amp\">blockchain technology</a> and esports — a major Web2 gaming trend with skyrocketing popularity — to act as the gateway between traditional gamers and Web3 opportunities. The Web3 game developer joined the <a href=\"https://cointelegraph.com/news/cointelegraphs-accelerator-program-launches-and-is-seeking-web3-startups\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cointelegraphs-accelerator-program-launches-and-is-seeking-web3-startups/amp\">Cointelegraph Accelerator Program to ramp up the development of end-to-end blockchain gaming solutions</a>.</p><p><img alt=\"Citizen Conflict is a PvP shooter in which heroes with different skills and gameplay compete against each other. Source: Citizen Conflict\" src=\"https://s3.cointelegraph.com/storage/uploads/view/e7e2e746030383b5caa1f9f23fe00ba1.png\" title=\"Citizen Conflict is a PvP shooter in which heroes with different skills and gameplay compete against each other. Source: Citizen Conflict\"></p><p style=\"text-align: center;\"><em>Citizen Conflict is a PvP shooter in which heroes with different skills and gameplay compete against each other. Source: <a href=\"https://citizenconflict.com/home\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Citizen Conflict</a></em></p><p>Given a team of seasoned game developers who previously worked on major titles, including Arma 3, Overwatch and Mafia II, the studio’s main project Citizen Conflict, a free-to-play shooter, aims to bring triple-A gaming to Web3. Citizen Conflict is a team-based cyberpunk shooter created in Unreal Engine 5 where three hostile organizations wage an endless battle for dominance.</p><p>Players will heavily rely on vehicles to get around the world of the Ether Islands with gameplay that is characterized by its humorous yet gritty gameplay that evokes a war-like environment and trading features brought about by blockchain technology. Following its alpha test in Q2 2023, QORPO Game Studio is planning a public beta phase of its competitive mode in the third quarter.</p><div class=\"embed-responsive embed-responsive-16by9\"><center><p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/8RcR0Q7cnlA\" width=\"560\"></iframe></p></center></div><p>QORPO Game Studio is also working on an open-world action RPG, AniMate, which aims to deliver extraction and battle royale gameplay. Inspired by companion-based adventures such as Pokemon, AniMate takes players to a world divided into islands and centered around five essential elements.</p><p><img alt=\"AniMate blends Pokemon-esque graphics and narrative with Fortnite’s battle royale game mechanics. Source: QORPO Game Studio\" src=\"https://s3.cointelegraph.com/storage/uploads/view/6706409fc3003b9562cf36bac339ec53.png\" title=\"AniMate blends Pokemon-esque graphics and narrative with Fortnite’s battle royale game mechanics. Source: QORPO Game Studio\"></p><p style=\"text-align: center;\"><em>AniMate blends Pokemon-esque graphics and narrative with Fortnite’s battle royale game mechanics. Source: <a href=\"https://qorpogamestudio.medium.com/animate-a-new-open-world-mmo-rpg-set-in-the-mythical-land-of-little-monsters-1873876e6c8\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">QORPO Game Studio</a></em></p><p>Users will be able to customize their characters and join an open world to engage in dangerous challenges as they battle other players and loot NPC-guarded camps. Each monster has unique powers and is subject to different weaknesses at various stages of evolution. Following the release of the game, QORPO Game Studio also plans to launch AniMate comics and a physical trading card collection.</p><p>The <a href=\"https://cointelegraph.com/accelerate\">Cointelegraph Accelerator</a> program helps fresh Web3 startups and projects prosper by leveraging Cointelegraph’s network and leadership as the leading crypto and blockchain media outlet since 2013. As part of the program, QORPO Game Studio will continue developing its two titles, focusing on bringing the skill-based competitive niche to Web3 gaming.</p>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-31T18:50:00.000Z",
    "title": "Price analysis 5/31: BTC, ETH, BNB, XRP, ADA, DOGE, MATIC, SOL, DOT, LTC",
    "url": "https://cointelegraph.com/news/price-analysis-5-31-btc-eth-bnb-xrp-ada-doge-matic-sol-dot-ltc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/391b724f-4b3b-4d0b-b8b4-f8bf6c4be031.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin and most major altcoins are struggling to hold on to their higher levels, indicating that the bears have not given up yet. </p>\n                    <p><p>After rising for four successive months, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is on track to end May with losses of about 7%. Another noteworthy thing in May is that Bitcoin’s 30-day volatility dropped to 1.52%, which is far below the yearly average 4% and higher. Glassnode data shows that Bitcoin’s low volatile periods have only lasted for 19.3% of its total price history. Hence, there is an expectation for <a href=\"https://cointelegraph.com/news/bitcoin-on-chain-and-options-data-hint-at-a-decisive-move-in-btc-price\">volatility to pick up in June</a>.</p><p>In an exclusive interview with Cointelegraph, Glassnode lead on-chain analyst James Check said that <a href=\"https://cointelegraph.com/news/bitcoin-s-next-rally-may-be-imminent-on-chain-analyst-points-out\">Bitcoin could rally to $32,000</a>, which is its “true cost basis.” Analysts at Glassnode arrived at this level after focusing on active Bitcoin investors and removing coins that are lost forever.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/4289d2bb-d4d6-44c9-ad79-3df551c0fff8.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>In the near term, the outcome of the <a href=\"https://www.cnbc.com/2023/05/30/stock-market-today-live-updates.html\" target=\"_blank\" rel=\"noopener nofollow\">vote</a> on the debt ceiling in the United States House of Representatives could provide direction. If the vote succeeds, as is widely accepted, it could lead to a knee-jerk reaction to the upside. But if the vote fails, then Bitcoin is likely to break below $25,000.</p><p>The short-term charts of Bitcoin and select major altcoins suggest that the bulls may be losing their grip. What are the important support levels that the bulls need to hold to avoid a collapse? Let’s study the charts of the top-10 cryptocurrencies to find out.</p><h2>Bitcoin price analysis</h2><p>Bitcoin reversed direction from the downtrend line on May 29, indicating that the bears continue to sell near crucial resistance levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/b048a3c1-eb82-4518-98dd-815115e355e2.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The flattish 20-day exponential moving average ($27,273) and the relative strength index just below the midpoint do not give a clear advantage either to the bulls or the bears. If the price sustains below the 20-day EMA, the BTC/USDT pair could drop to the $25,250 support.</p><p>Buyers are expected to defend the zone between $24,000 and $25,250 with all their might because if it cracks, the pair may nosedive to $20,000.</p><p>On the upside, the bulls will have to surmount the downtrend line to signal the start of a new up-move. The pair may first rise to $30,000 and later to $31,000.</p><h2>Ether price analysis</h2><p>The bulls are struggling to maintain Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) above the 50-day SMA ($1,883). This suggests a lack of demand at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/aec0728a-fe20-4f8a-8de3-aef2e4a67761.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bears are trying to sink the price back into the falling wedge pattern and trap the aggressive bulls. If that happens, the ETH/USDT pair may fall to $1,762 and then to the support line of the wedge.</p><p>Conversely, if the price rebounds off the resistance line of the wedge, it will suggest that the bears have flipped the level into support. The pair may then rise to the psychological resistance at $2,000 and subsequently to $2,142.</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) climbed and closed above the 20-day EMA ($311) on May 28 but the bulls could not continue the momentum and challenge the 50-day SMA ($319).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/a84a25d5-ae12-426b-a329-ea35e109a12b.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bears used the opportunity and pulled the price back below the 20-day EMA on May 31. Sellers will try to retest the psychological support at $300. If this level gives way, the BNB/USDT pair may descend to the support line.</p><p>Contrarily, if the price rebounds off $300, it will suggest that lower levels are attracting buyers. That may keep the pair inside the upper half of the channel for a few more days. A new up-move could begin after bulls kick the price above the channel.</p><h2>XRP price analysis</h2><p>XRP’s (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) rally is facing profit-booking near the overhead resistance of $0.54. The first support is at the 38.2% Fibonacci retracement level of $0.49 and then at the 50% retracement level at $0.48.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/b1c7e4ea-afc0-481f-bc1f-ad96ae670d57.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: TradingView</em></figcaption></figure><p>If the price rebounds off this support zone, it will suggest that the sentiment has changed from selling on rallies to buying on dips. That will enhance the prospects of a rally above $0.54. The XRP/USDT pair may then rise to $0.58.</p><p>Contrarily, if the price breaks below $0.48, it will suggest that the bullish momentum has weakened. That could tug the price to the moving averages and keep the price stuck inside the range for a few more days.</p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) turned down from the 50-day SMA ($0.38) on May 29, indicating that the bears are protecting this level aggressively.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/7515f640-9712-407d-9e7d-4bf8f333eebe.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The sellers will try to pull the price below the uptrend line. This is an important level for the buyers to defend because a break below it will invalidate the bullish ascending triangle pattern. That could then start a downswing to $0.30.</p><p>Alternatively, if the price turns up from the current level or the uptrend line, it will suggest that bulls are buying on dips. The bulls will then make one more attempt to thrust the price above the 50-day SMA. If they can pull it off, the ADA/USDT pair may surge toward the $0.42 to $0.44 resistance zone.</p><h2>Dogecoin price analysis</h2><p>Dogecoin’s (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) recovery stalled at the 20-day EMA ($0.07), indicating that the sentiment remains negative and relief rallies are being sold into.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/7a0e47f7-f936-4d87-bbb5-56762d28ea6a.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bears will try to strengthen their position by yanking the price below the immediate support at $0.07. If they manage to do that, the DOGE/USDT pair may start its journey toward the next support at $0.06.</p><p>Time is running out for the bulls. If they want to start a recovery, they will have to quickly drive the price above the 20-day EMA. The pair could then rally to the overhead resistance of $0.08. A break above this level will suggest that the bulls are on a comeback.</p><h2>Polygon price analysis</h2><p>Polygon’s (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) recovery fizzled out near the overhead resistance at $0.94, indicating that the bears are not willing to let go of their advantage.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/78a770e3-06f0-445f-a293-296d3bda9041.png\"  /><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bears are trying to sustain the price below the 20-day EMA ($0.90). If they do that, the MATIC/USDT pair could drop to the vital support at $0.82. This remains the key level to watch out for on the downside because if it cracks, the selling may intensify and the pair is likely to plunge to $0.69.</p><p>The first sign of strength will be a break and close above the 50-day SMA ($0.96). Such a move will open the doors for a possible rally to the downtrend line.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-hodlers-exited-capitulation-above-20k-new-metric-hints\"><strong><em>Bitcoin hodlers exited ‘capitulation’ above $20K, new metric hints</em></strong></a></p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) has been stuck between the moving averages for the past four days. This suggests that the bulls are buying the dips to the 20-day EMA ($20.50) but the bears remain active at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/f833463f-e2a5-4fd4-90cd-5d65e2772243.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The 20-day EMA is flattish and the RSI is near the midpoint, indicating a range-bound action in the near term. If the price dips below the 20-day EMA, the SOL/USDT pair could slide to the solid support at $18.70. A bounce off this level will suggest a consolidation between $18.70 and the 50-day SMA.</p><p>If the price bounces off the 20-day EMA, the bulls will again try to overcome the obstacle at the 50-day SMA. If they succeed, the pair could start a rally to $24 and then to $27.12.</p><h2>Polkadot price analysis</h2><p>The bulls pushed Polkadot (<a href=\"https://cointelegraph.com/polkadot-price-index\">DOT</a>) above the 20-day EMA ($5.40) on May 28 but they could not build upon this breakout. This shows that demand dries up at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/b824195b-8db1-40e9-b7c5-effc5cb001a5.png\"  /><figcaption style=\"text-align: center;\"><em>DOT/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bears have pulled the price back below the 20-day EMA. Sellers will next try to yank the price below the critical support at $5.15. If they manage to do that, the DOT/USDT pair could start a downward move toward $4.22.</p><p>If the price rebounds off $5.15, it will suggest that bulls continue to defend this level aggressively. The pair could then consolidate between $5.15 and $5.56 for a few more days. The bulls will gain the upper hand in the short term if they clear the 50-day SMA ($5.74).</p><h2>Litecoin price analysis</h2><p>The price action of the past few weeks has formed a symmetrical triangle pattern in Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>). This indicates indecision among the bulls and the bears about the next directional move.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/09c7810f-f0b9-4d66-bf2e-7d6112b84432.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The price action inside a triangle is generally random and volatile. If the price sustains below the moving averages, the LTC/USDT pair could drop to the uptrend line. This line is likely to attract buying from the bulls.</p><p>Another possibility is that the price turns up from the moving averages. In that case, the pair will attempt to rise to the resistance line. A break and close above this level will indicate the start of a new up-move. The pattern target of this setup is $142.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-05-31T18:53:06.000Z",
    "title": "Gold and Bitcoin: The Twin Beneficiaries of US Debt Crisis, Says Prominent Macro Investor",
    "url": "https://www.cryptoglobe.com/latest/2023/05/gold-and-bitcoin-the-twin-beneficiaries-of-us-debt-crisis-says-prominent-macro-investor/",
    "description": "Renowned macro investor Luke Gromen has identified a crucial turning point that could potentially propel the value of both gold and Bitcoin. According to a report by The Daily Hodl, in a recent discussion on Blockworks Macro, Gromen expressed his belief that Bitcoin and gold are poised for success regardless of the outcome. Gromen suggests […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T18:56:06.000Z",
    "title": "Blockchain firm raises $25m to revolutionize architecture",
    "url": "https://www.cryptopolitan.com/blockchain-firm-raises-25m-for-architecture/",
    "description": "With a recent cash infusion of $25 million, the Swiss-based Anoma Foundation is advancing its development and research into a novel blockchain architecture. The ambitious initiative promises to disrupt the blockchain space with its innovative approach to decentralized applications (DApps) and services. This substantial backing underlines investors&#8217; confidence in Anoma&#8217;s vision to redefine blockchain capabilities. ... <a title=\"Blockchain firm raises $25m to revolutionize architecture\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockchain-firm-raises-25m-for-architecture/\" aria-label=\"More on Blockchain firm raises $25m to revolutionize architecture\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T18:54:16.000Z",
    "title": "Aptos price analysis: APT slumps down to $8.30 range as bears take over",
    "url": "https://www.cryptopolitan.com/aptos-price-analysis-2023-05-31/",
    "description": "The latest Aptos price analysis shows a downtrend in the market. APT/USD has fallen to $8.30 in the past few hours, registering a nearly 2.39% decline. Market bears have taken control of the APT price and are pushing it lower with each passing hour. The market for APT opened today&#8217;s session with bullish sentiment, with ... <a title=\"Aptos price analysis: APT slumps down to $8.30 range as bears take over\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-analysis-2023-05-31/\" aria-label=\"More on Aptos price analysis: APT slumps down to $8.30 range as bears take over\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-05-31T19:00:16.000Z",
    "title": "InQubeta (QUBE) Presale Gains Traction Among Investors Seeking Higher-Yield Investment Options than Chainlink (LINK)",
    "url": "https://nulltx.com/inqubeta-qube-presale-gains-traction-among-investors-seeking-higher-yield-investment-options-than-chainlink-link/",
    "description": "Crypto is a continuously evolving landscape, with new projects emerging to push the boundaries of innovation and reshape various industries. They bring fresh ideas, technologies, and investment opportunities to the forefront of the digital asset space. InQubeta (QUBE) is one such promising crypto project that has recently gained significant traction among investors seeking higher-yield investment [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-31T19:03:15.000Z",
    "title": "Why This Is The Most Important Bitcoin Chart You’ll See This Week",
    "url": "https://www.newsbtc.com/bitcoin-news/why-this-is-the-most-important-bitcoin-chart-youll-see-this-week/",
    "description": "Bitcoin price action is at an impasse. Bulls and bears are divided as to what happens next, leading to months of consolidation. It could all come down to the next few days, according to the most important BTCUSD price chart you&#8217;ll see this week. The chart shows just how critical the stalemate in crypto markets is currently, and why this week could be the end of the indecision. Bitcoin Momentum Takes A Pause, But What&#8217;s Next? In technical analysis, the velocity of price increases or decreases can be measured by momentum. Various tools exist that get the job done, including the Moving Average Convergence Divergence indicator. The tool is designed to give overbought and oversold signals, plus buy and sell signals based on crossovers of the signal and MACD lines. Passing through the zero line is also an indication of momentum strengthening, as well as the underlying trend. Related Reading: Bitcoin Price Double Fractal Points To “Extended” Parabolic Rally It is for all these reasons and more that the chart below is so important. The chart consists of BTCUSD on the one-week timeframe. Underneath the price action is the LMACD – a logarithmic version of the MACD. The log version allows more comparative analysis between long-term cycles. At just a glance, it is easy to see that the tool appears ready to cross downward, generating a sell signal. The inflection point is visible in the LMACD &#124; BTCUSD on TradingView.com Below The Zero Line: Doom Or Redemption? What&#8217;s worse is the fact the sell signal will occur alongside a failure to hold above the zero line on the LMACD. Such a sign of momentum failure would more than likely lead to a retest of current bear market lows across crypto. However, the D in the indicator&#8217;s name stands for &#8220;divergence.&#8221; Signals are generated based on the tool converging or diverging. Diverging upward in Bitcoin, could send the crypto market blasting off higher instead. Related Reading: Down But Not Out: The One Line Bitcoin Must Hold To Be Bullish But beware. It is possible that both situations could happen before the week&#8217;s end. The LMACD could cross down and turn the histogram red for the first time in 2023 and shake out those eager to jump the gun on the sell signal. After the shakeout, the tool could diverge up before close and continue to push momentum and price to new highs. Alternatively, the tool could diverge upward at this inflection point, only to later cross back down. What is for certain is that the current lack of a decision in price direction is about to end, according to the LMACD. Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for exclusive daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T18:56:34.000Z",
    "title": "Are These 2 Altcoins the Next Pepe and SNEK That Can Turn Your $100 into a Fortune? Report",
    "url": "https://www.crypto-news-flash.com/are-these-2-altcoins-the-next-pepe-and-snek-that-can-turn-your-100-into-a-fortune-report/?utm_source=rss&utm_medium=rss&utm_campaign=are-these-2-altcoins-the-next-pepe-and-snek-that-can-turn-your-100-into-a-fortune-report",
    "description": "<p>Bluntz says BTC is expected to resume its downward trajectory. Additionally, Bluntz suggests that Litecoin is showing signs of reaching its target of $100. The cryptocurrency market has recently garnered significant attention in the financial realm, becoming a focal point of discussion. Cryptocurrency analyst who accurately predicted Bitcoin&#8217;s bear market bottom in 2018 has turned [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/are-these-2-altcoins-the-next-pepe-and-snek-that-can-turn-your-100-into-a-fortune-report/\">Are These 2 Altcoins the Next Pepe and SNEK That Can Turn Your $100 into a Fortune? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T18:50:52.000Z",
    "title": "Tether (USDT) expands into Argentina, Tradecurve is bringing trading to the world",
    "url": "https://www.crypto-news-flash.com/tether-usdt-expands-into-argentina-tradecurve-is-bringing-trading-to-the-world/?utm_source=rss&utm_medium=rss&utm_campaign=tether-usdt-expands-into-argentina-tradecurve-is-bringing-trading-to-the-world",
    "description": "<p>Shoppers visiting the Central Market of Buenos Aires can now pay for their groceries with Tether (USDT) thanks to a partnership with KriptonMarket. The Central Market sells over 106,000 tonnes of fresh fruit and vegetables each month, and the stablecoin Tether (USDT) will become a vital part of this thriving local economy. Grassroots adoption like [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/tether-usdt-expands-into-argentina-tradecurve-is-bringing-trading-to-the-world/\">Tether (USDT) expands into Argentina, Tradecurve is bringing trading to the world</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-31T18:45:32.000Z",
    "title": "Russia Abandons Plans for State-Run Crypto Exchange, Puts Focus on Regulating Centralized Platforms: Report",
    "url": "https://dailyhodl.com/2023/05/31/russia-abandons-plans-for-state-run-crypto-exchange-puts-focus-on-regulating-centralized-platforms-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/russia-plans-state-run.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/russia-plans-state-run.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/russia-plans-state-run.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/russia-plans-state-run.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/russia-plans-state-run.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/russia-plans-state-run.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/russia-plans-state-run.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Russia is reportedly giving up on plans to launch a state-owned crypto exchange and is instead expected to regulate private ones. According to a new Izvestia report, Russia’s Ministry of Finance rejected the idea of establishing a national crypto exchange, after the idea was discussed late last year. Says Ivan Chebeskov, director of the financial [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/31/russia-abandons-plans-for-state-run-crypto-exchange-puts-focus-on-regulating-centralized-platforms-report/\">Russia Abandons Plans for State-Run Crypto Exchange, Puts Focus on Regulating Centralized Platforms: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]