[
  {
    "source": "CoinDesk",
    "date": "2023-08-23T13:00:00.000Z",
    "title": "Blockchain Security Firm Quantstamp Hopes to Battle Flash Loan Attacks With New Service",
    "url": "https://www.coindesk.com/tech/2023/08/23/blockchain-security-firm-quantstamp-hopes-to-battle-flash-loan-attacks-with-new-service/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The service has been released in collaboration with researchers from the University of Toronto."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-23T13:01:02.000Z",
    "title": "Binance Labs Announces Investment in Fixed-Yield Protocol Pendle Finance",
    "url": "https://decrypt.co/153460/binance-labs-announces-investment-fixed-yield-protocol-pendle-finance",
    "description": "Binance Labs' backing of Pendle Finance is also another push for the investment group into the liquid staking sector. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-23T13:03:00.000Z",
    "title": "EU Data Act smart contract ‘kill switch’ brings uncertainty",
    "url": "https://cointelegraph.com/news/eu-data-act-smart-contract-kill-switch-brings-uncertainty",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/6b3492b4-aa67-4115-a175-b11f0f93b0b1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>EU lawmakers have reached a political consensus on the Data Act that has a “kill switch” for smart contracts, causing an uproar in the crypto community. </p>\n                    <p><p>On June 28, the European Council and Parliament achieved a political <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_23_3491\" target=\"_blank\" rel=\"noopener nofollow\">consensus</a> on the Data Act, which moves the legislation regarding non-personal data closer to fruition.</p><p>Thierry Breton, European Union commissioner for the internal market, described the agreement in an X post as a “milestone in the reshaping the digital space.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Another deal! <br>⁰Tonight’s agreement on the <a href=\"https://twitter.com/hashtag/DataAct?src=hash&amp;ref_src=twsrc%5Etfw\">#DataAct</a> is a milestone in reshaping the digital space.<br><br>Thanks to the swift work of the EP <a href=\"https://twitter.com/delcastillop?ref_src=twsrc%5Etfw\">@delcastillop</a> &amp; the  Council Presidency, we are on the way of a thriving  data economy that is innovative &amp; open — on our conditions. <a href=\"https://t.co/vTWUU8xTx9\">pic.twitter.com/vTWUU8xTx9</a></p>&mdash; Thierry Breton (@ThierryBreton) <a href=\"https://twitter.com/ThierryBreton/status/1673814911137316864?ref_src=twsrc%5Etfw\">June 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The Data Act complements the <a href=\"https://digital-strategy.ec.europa.eu/en/policies/data-governance-act\" target=\"_blank\" rel=\"noopener nofollow\">Data Governance Act</a> of November 2020 by clarifying who can create value from data and under which conditions. It stems from the <a href=\"https://digital-strategy.ec.europa.eu/en/policies/strategy-data\" target=\"_blank\" rel=\"noopener nofollow\">European Strategy for Data</a>, announced in February 2020, which also aims to position the EU as a regulatory frontrunner in the era of data-driven society.</p><p>The Data Act is part of the European Commission’s wider data strategy aimed at making Europe a global leader in the data-agile economy. In simple terms, the Data Act proposes new rules on who can access and use data generated in the EU across all economic sectors.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/14761770-2db8-4882-89bf-4336dea37144.jpg\"  /></figure><p>For the Data Act to become law, it must be approved by a vote of the European Parliament and the Council, which represent the bloc’s 27 member states. And once again, as with the <a href=\"https://cointelegraph.com/news/european-parliament-votes-against-pow-ban-providing-huge-relief-to-the-crypto-industry\">Markets in Crypto-Assets (MiCA) regulation</a>, the crypto sector is facing a major challenge. The problem raised by the new EU data law could permanently change the use of smart contracts in the European Economic Area (EEA) –– and not for the better.</p><h2>Smart contract “kill switch”</h2><p>The blockchain community is largely concerned about one provision in the Data Act, namely that automated data-sharing agreements contain a “kill switch” by which they could be terminated or halted in the event of a security breach.</p><p>Many blockchain experts contend that the <a href=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=COM%3A2022%3A68%3AFIN\" target=\"_blank\" rel=\"noopener nofollow\">current definition</a> of smart contracts in the Data Act is broad, fearing it may <a href=\"https://eu.ci/data-act-position-paper-euci/\" target=\"_blank\" rel=\"noopener nofollow\">lead</a> to unintended consequences for existing <a href=\"https://cointelegraph.com/learn/what-are-smart-contracts-a-beginners-guide-to-automated-agreements\">smart contracts</a> on public blockchains. For example, the text of the upcoming law doesn’t distinguish between just digital contracts and smart contracts utilizing distributed ledger technology.</p><p>But above all, the Data Act supposedly doesn’t give clear details about the conditions under which safe termination or interruption kill switch should occur, and it is hard to predict the potential outcomes with a higher degree of certainty. The smart contract architecture often doesn’t allow for termination or interruption, as blockchain technology is praised for being immutable and irreversible. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/crypto-p2p-scams-india\">Crypto P2P scams in India show digital asset education is needed</a></em></strong></p><p>The Data Act also doesn’t say exactly what a “data sharing agreement” is, and it doesn’t explain if the smart contracts currently ubiquitous in Web3 applications follow these kinds of agreements.</p><p>“By design, most of smart contracts don’t offer a termination or interruption feature and are often un-upgradable to ensure higher levels of protection from abusive behaviors,” Marina Markežič, executive director and co-founder of European Crypto Initiative, told Cointelegraph. </p><blockquote>“The fact that smart contracts lack such features puts their use and development at risk. They may be perceived as inconsistent with regulatory requirements.”</blockquote><p>“The problem is if the scope of Article 30 were to be extended beyond the application of smart contracts in this narrowly defined context, and on public permissionless networks. It becomes not only problematic but almost impossible for such protocols to comply,” he said.</p><p>Per Voloder, another concern is whether these rules could spill over into decentralized finance (DeFi). “As we do not have a DeFi regulation, this is a question that will need an answer over the next 18 months as the EC prepares its position on DeFi.”</p><p>Moreover, kill switches can have errors because of human mistakes and, in smart contracts in general, “as they are rigid, bounded information environments.” This rigidity, plus an automatic feature that triggers a certain outcome following strict rules, could lead to issues like locking up assets, shutting down protocols or even losing funds and important data, said Voloder.</p><h2>A lot of uncertainty</h2><p>The Data Act has rules for vendors of an app using smart contracts, or for people whose business involves deploying smart contracts.</p><p>According to Markežič, the Data Act might cause such vendors and deployers to be more cautious and consider whether their smart contracts in any way contain a data-sharing agreement. Apps might need to change how they work to meet these rules if their smart contracts share data.</p><p>But first, it’s crucial to understand who exactly needs to follow these rules, Markežič said: </p><p>Erwin Voloder, head of policy at the European Blockchain Association, told Cointelegraph that Article 30 of the Data Act applies when parties agree to share data using a smart contract, and this contract follows the rules. It should be fine if it’s only for that situation, especially when used on a controlled network where the Data Act’s safety stop can be used. </p><blockquote>“Is the regulation even targeted toward DeFi platforms and protocols? [...] It should be clarified under what circumstances the ‘access control’ is provided, what, who, why and how the ‘safe termination or interruption’ measure is triggered and how protocols prevent further abusive behavior thereof.”</blockquote><p>Markežič stated that, in the past, some changes and terminations were made on a protocol layer as part of the overall governance mechanisms. </p><p>A kill switch on the level of a smart contract might lump projects and individuals into “a single point of failure, prescribed by the regulators.” </p><p>Therefore, it’s critical that regulators clarify who has the power to use this kill switch. </p><h2>Crypto community across the globe reacts</h2><p>The crypto community has already proposed some alternative solutions to bring more legal clarity to smart contracts.</p><p>In April 2023, Polygon had already penned an <a href=\"https://assets-global.website-files.com/637359c81e22b715cec245ad/643d40b6f87a976691ad2093_Polygon%20Labs%20-%20Open%20Letter%20on%20the%20Data%20Act.pdf\" target=\"_blank\" rel=\"noopener nofollow\">open letter</a> suggesting how to improve Article 30, sating that lawmakers could apply these rules to enterprises only, excluding software and developers, and make clear that smart contracts aren’t “agreements” in and of themselves.</p><p>More recently, the European Crypto Initiative and numerous organizations, such as Stellar, Iota, Polygon, Near, Coinbase, Cardano and ConsenSys, have <a href=\"https://data-act.info/\" target=\"_blank\" rel=\"noopener nofollow\">signed</a> an open letter voicing their concerns regarding the Data Act and calling on lawmakers to reconsider and clarify certain aspects.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We called on lawmakers to reconsider and clarify certain aspects of the <a href=\"https://twitter.com/hashtag/DataAct?src=hash&amp;ref_src=twsrc%5Etfw\">#DataAct</a> in our Open Letter, written with other 5 organisations and 55 signatories ✉️<a href=\"https://t.co/37IrdSsFXC\">https://t.co/37IrdSsFXC</a></p>&mdash; European Crypto Initiative (@EuCInitiative) <a href=\"https://twitter.com/EuCInitiative/status/1688905742408126464?ref_src=twsrc%5Etfw\">August 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>They argued that the Data Act could potentially clash with the recently agreed MiCA regulation. MiCA, which will come into force in 2024, provides a license for crypto exchanges and wallet providers to operate throughout the EU. </p><p>They further claim that European lawmakers deliberately sidestepped the more complex issue of decentralized financial regulation –– an issue the Commission will need to revisit in the coming years.</p><h2>More harm than good?</h2><p>The trialogue on the Data Act has been completed, and this means that the text has reached its final version and is likely to be enacted in its current form. </p><p>According to Markežič, the new law could affect the European crypto industry and businesses that want to operate in the EU, stating that the Data Act doesn’t give clear details about what use cases the new rules apply to, and that makes the whole industry unsure about what to expect. And this is just the first step in the direction of regulating smart contracts, setting a precedent for forthcoming actions, she said.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/banning-ransomware-payments-attractive-dangerous-idea/\">Should we ban ransomware payments? It’s an attractive but dangerous idea</a></em></strong></p><p>The next important step for the community is to work closely with European standardization groups. These groups are responsible for creating the standards that vendors and developers of smart contracts should follow when making agreements to share data, especially given that these vendors will need to make sure their smart contracts broadly align with the scope of Article 30.</p><p>According to Voloder, if the Data Act is extended to public networks, it could mean companies leaving the EU, at worst, and “otherwise being pigeonholed into a narrow development trajectory of smart contracts in the best case.”</p><blockquote>“The result is capital flight, stifled innovation and a floundering blockchain industry in Europe. At a time when Europe is at the vanguard of the regulatory apex, the timing of such an outcome would be most inopportune.”</blockquote><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-23T13:00:00.000Z",
    "title": "Quantstamp introduces tool to detect protocols’ flash loan attack vulnerability",
    "url": "https://cointelegraph.com/news/quantstamp-introduces-tool-detect-protocol-flash-loan-attack-vulnerability",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/3ed9c8aa-5589-4fb9-ae0f-79af25965870.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The new service, called Economic Exploit Analysis, uses University of Toronto research and will work on any EVM-compatible blockchain.</p>\n                    <p><p>Blockchain security provider Quantstamp has launched an automated service to detect flash loan attack vectors in smart contracts. The new service is being called Economic Exploit Analysis and is based on research done at the University of Toronto.  </p><p>Economic Exploit Analysis will be available to protocols, whether they have been deployed or not. It will enhance Quantstamp’s audits by identifying flash loan attack vulnerabilities in a client’s code. The service will be available on any Ethereum Virtual Machine (EVM)-compatible blockchain and is non-exhaustive — that is, it may not detect all attacks.</p><p>In decentralized finance (DeFi), <a href=\"https://cointelegraph.com/explained/what-are-flash-loans-in-defi\">a flash loan is an unsecured loan</a> that has to be taken out and paid back in the same transaction. Flash loans can be used to take advantage of price differences between crypto exchanges (arbitrage), debt refinancing and similar actions. A flash loan attack is the manipulation of DeFi protocols in ways developers did not foresee. Quantstamp explained:</p><blockquote>“Flash loan attacks can drain the entire TVL (total value locked) of a DeFi protocol, and their complicated nature combined with DeFi’s composability means these attack vectors often evade conventional audits.”</blockquote><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ripple-expands-canadian-engineering-activities-with-u-of-toronto-xrp-validator\">Ripple expands Canadian engineering activities with U of Toronto XRP validator</a></em></strong></p><p>The need for greater security in DeFi markets <a href=\"https://cointelegraph.com/news/palo-alto-networks-ceo-hackers-getting-faster-breach-cybersecurity\">is garnering increasing attention</a>. The problem of flash loan largest attacks, in particular, was brought into focus when <a href=\"https://cointelegraph.com/news/euler-finance-hacked-for-over-195m-in-a-flash-loan-attack\">Euler Finance was attacked in March</a>. Last year, over $2 billion worth of crypto <a href=\"https://cointelegraph.com/news/the-10-largest-crypto-hacks-and-exploits-in-2022-saw-2-1b-stolen\">was stolen in hacks and exploits</a>.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Another day, another speaker for <a href=\"https://twitter.com/hashtag/L2Warsaw?src=hash&amp;ref_src=twsrc%5Etfw\">#L2Warsaw</a> - <a href=\"https://twitter.com/jgorzny?ref_src=twsrc%5Etfw\">@jgorzny</a>, Head of L2 Scaling at <a href=\"https://twitter.com/Quantstamp?ref_src=twsrc%5Etfw\">@Quantstamp</a>!<br><br>He&#39;ll discuss their new rollup security framework and its aim to standardize language for both users &amp; developers.<br><br> Title: &quot;Rollup Security Framework&quot; <br> 12:00 PM <a href=\"https://t.co/3rW9UFZZoS\">pic.twitter.com/3rW9UFZZoS</a></p>&mdash; L2BEAT  (@l2beat) <a href=\"https://twitter.com/l2beat/status/1692476694748115349?ref_src=twsrc%5Etfw\">August 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Coinbase’s new Base layer-2 is also addressing security vulnerabilities. It is developing a monitoring tool that it is calling Pessimism to “provide prompt notification of anomalies in the protocol and network, such as account balance irregularities, contract events, or disparities between L1 and L2 states,” it <a href=\"https://base.mirror.xyz/_SiAx8dQRYJJ4lygkJc0QvBKvf16VVm7_-mdWMdFv20\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> in a recent blog post.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/quantstamp-introduces-tool-detect-protocol-flash-loan-attack-vulnerability&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/trouble-with-crypto-automated-market-makers/\">The trouble with automated market makers</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-23T13:08:22.000Z",
    "title": "Euro Stablecoin on Solana Expected to be Fully MiCA Compliant",
    "url": "https://cryptobriefing.com/euro-stablecoin-on-solana-mica-compliant/?utm_source=feed&utm_medium=rss",
    "description": "Membrane Finance introduces Solana's first euro stablecoin, EUROe, expanding blockchain transaction possibilities in Europe."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-23T12:58:23.000Z",
    "title": "Bitcoin’s DeFi Rings New Era: Pyth Network and Stacks Partnership",
    "url": "https://cryptobriefing.com/pyth-network-and-stacks-partnership/?utm_source=feed&utm_medium=rss",
    "description": "Pyth Network with Stacks aims to redefine the Bitcoin DeFi framework, offering data access and innovative functionalities."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-23T13:00:00.000Z",
    "title": "\n                        FBI Identifies Six Bitcoin Wallets with Ties to North Korea\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/fbi-identifies-six-bitcoin-wallets-with-ties-to-north-korea",
    "description": "\n                        <p dir=\"ltr\">The Federal Bureau of Investigation (FBI) has spotlighted six Bitcoin wallets believed to have connections with North Korea. The revelation highlights the potential misuse of digital currencies for illicit purposes.</p>\nN Korea exploiting crypto financial freedom\n<p dir=\"ltr\">The flagged Bitcoin wallets are under scrutiny for their alleged ties to activities that breach US sanctions. Authorities have consistently emphasised the significance of monitoring and controlling digital currency transactions to deter malicious actors from exploiting the financial freedom that crypto offers.</p>\n<p dir=\"ltr\">North Korea's alleged involvement in crypto-based activities isn't new. Over the past few years, the nation has been frequently cited for its purported engagement in cyber-attacks, aimed at accruing cryptocurrencies to bypass economic restrictions.</p>\n<p dir=\"ltr\">According to the FBI, these findings serve as a stern reminder of what it sees as the double-edged nature of the crypto world. While the digital currency landscape offers remarkable opportunities for legitimate transactions and investments, it can also be a playground for entities with ulterior motives.</p>\n<p dir=\"ltr\">Reacting to this, some experts in the field advocate for more robust tracking mechanisms, saying that these mechanisms would not only identify suspicious wallet activities but also ensure that cryptocurrencies remain a secure and transparent medium for genuine users.</p>\nCrypto should not be scapegoated\n<p dir=\"ltr\">It should however be noted that the wallets contain the proceeds from hacks that were carried out over the past year. The wallets currently have 1,580 bitcoins between them according to a report by CoinTelegraph earlier today.</p>\n<p dir=\"ltr\">By its nature, cryptocurrency is already transparent, and this has enabled the FBI to pinpoint the hackers&rsquo; transactions. This really can&rsquo;t be said for cash, which enables more or less complete anonymity for hackers.&nbsp;</p>\n<p dir=\"ltr\">Using crypto as a scapegoat and then imposing a suffocating regulatory strait jacket is just going to harm an extremely innovative industry. With the world&rsquo;s economies severely battered and on the brink of meltdown, crypto financial innovation is sorely needed.</p>\n\n\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n\n\n                    "
  },
  {
    "source": "BTCManager",
    "date": "2023-08-23T13:03:21.000Z",
    "title": "BlockFi battles FTX, 3AC in court over repayment claims",
    "url": "https://crypto.news/blockfi-battles-ftx-3ac-in-court-over-repayment-claims/",
    "description": "Bankrupt BlockFi is contesting efforts by the insolvent FTX and Three Arrows Capital (3AC) to recover millions of dollars owed to their creditors. In a filing to a New Jersey bankruptcy court on Aug. 21, BlockFi insisted that its creditors&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T12:53:28.000Z",
    "title": "Why Are Cosmos and Ethereum Holders Shedding Their Tokens? Community Find New Market Champion In Everlodge",
    "url": "https://www.crypto-news-flash.com/why-are-cosmos-and-ethereum-holders-shedding-their-tokens-community-find-new-market-champion-in-everlodge/?utm_source=rss&utm_medium=rss&utm_campaign=why-are-cosmos-and-ethereum-holders-shedding-their-tokens-community-find-new-market-champion-in-everlodge",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-108.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-108.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-108-300x180.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-108-336x200.png 336w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The presale of Everlodge has become one of the most cherished events of 2023. Due to its high-value proposition and unique business roadmap, this new project has become the most sought-after investment option. Experts are also putting this new project over Cosmos (ATOM) and Ethereum (ETH). Join the Everlodge presale and win a luxury holiday [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-23T13:01:00.000Z",
    "title": "Unavailable DUring Bitcoin Halving? Ripple Executives Notify Court",
    "url": "https://coinedition.com/unavailable-during-bitcoin-halving-ripple-executives-notify-court/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Ripple-Peersyst-Partner-With-Colombian-Central-Bank-for-Blockchain-Project.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Crypto Lawyer\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Ripple-Peersyst-Partner-With-Colombian-Central-Bank-for-Blockchain-Project.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Ripple-Peersyst-Partner-With-Colombian-Central-Bank-for-Blockchain-Project-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Ripple-Peersyst-Partner-With-Colombian-Central-Bank-for-Blockchain-Project-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Ripple CEO Brad Garlinghouse and executive chairman Chris Larsen have informed the court of their unavailability for two weeks in April 2024, a court filing reveals. The notice follows the court&#8217;s order to schedule the final pretrial conference in the SEC-Ripple lawsuit. Notably, the filing sent to Judge Analisa Torres says the top executives will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/unavailable-during-bitcoin-halving-ripple-executives-notify-court/\">Unavailable DUring Bitcoin Halving? Ripple Executives Notify Court</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]