[
  {
    "source": "Cointelegraph",
    "date": "2023-07-27T04:41:19.000Z",
    "title": "Digital marketing will become Web3's next major use case, says report",
    "url": "https://cointelegraph.com/news/digital-marketers-see-web3-crypto-next-major-opportunity",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/8611845f-0544-4d8f-8c1e-3e59975e803e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>More than 70 startups have raised over $600 million in the embryonic Web3 digital marketing sector.  </p>\n                    <p><p>The Web3 ecosystem could become the next golden opportunity for digital marketers, with almost 200 companies already “thinking deeply” about how to utilize the Web3 tech stack.</p><p>On July 25, Web3 marketing analytics firm Safary released a comprehensive <a href=\"https://safaryclub.notion.site/safaryclub/The-State-of-Web3-Growth-Tech-2023-9e4aaed9906f4b08b63e60e5493bdabf\" target=\"_blank\" rel=\"noopener nofollow\">report</a> titled <em>The Web3 Growth Landscape 2023.</em></p><p>It noted that the 2010s were the “golden age of digital marketing” with Web2 growth seeing 150 marketing companies in 2011 increase to 11,000 in 2023.</p><p>However, over the last three years, the digital marketing landscape has to a more privacy-centric environment. Therefore, marketers may also need to change tack and embrace the <a href=\"https://cointelegraph.com/innovation-circle/14-web3-marketing-strategies-that-can-increase-exposure-and-consumer-trust\">Web3 tech stack</a>, it said. </p><p>Their findings reveal that there are currently almost 200 companies already “thinking deeply” about the new digital media landscape, and 71 of them have collectively raised $600 million in funding.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/565ef2eb-44b7-402c-92fe-fcc712dc323c.jpg\"  /><figcaption style=\"text-align: center;\">Market map showing 180+ teams building Web3 growth tools and experiences: Source: Safary</figcaption></figure><p>Messaging, Questing, and Loyalty platforms are the most well-funded categories, it reported, with each attracting more than $100 million in funding. </p><p>Quest platforms like <a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-yield-guild-games-ygg\">Yield Guide Games</a> create engagement marketplaces, directing users to complete incentive offers. This facilitates a more direct brand-user relationship than ads.</p><p>Additionally, loyalty companies help brands increase customer value and retention through rewards programs powered by NFTs and tokens.</p><p>There are also analytics tools for marketers like Nansen and Dune that aggregate on-chain, platform, and social data to uncover growth insights on Web3 communities.</p><p>Discovery platforms such as DappRadar “have the potential to be some of the biggest ad real estate proprietaries in Web3,” it added, provided they invest in long-term strategies like SEO. It also cited <a href=\"https://cointelegraph.com/news/coinmarketcap-s-h1-2023-report-says-q2-was-a-lost-quarter\">CoinMarketCap</a> as an example of one of “the highest trafficked websites on the internet.” </p><p>There are also 18 Web3 growth agencies that advise and deploy growth strategies on behalf of blockchain projects.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/web3-has-permanently-changed-how-marketing-works\"><strong><em>Web3 has permanently changed how marketing works</em></strong></a></p><p>Marketing industry analytics outlet Chiefmartec has <a href=\"https://chiefmartec.com/2023/05/2023-marketing-technology-landscape-supergraphic-11038-solutions-searchable-on-martechmap-com/\" target=\"_blank\" rel=\"noopener nofollow\">logged</a> 11,038 marketing solutions and services this year overall, an 11% increase from the 9,932 it charted in 2022.</p><p>As Web3 evolves and grows, marketers will need to keep up and it appears that hundreds of startups have already got a head start.</p><p><strong><em><a href=\"https://cointelegraph.com/magazine/web3-gamer-earn-bitcoin-minecraft-sega-blockchain-plans/\">Web3 Gamer: Earn Bitcoin in Minecraft, BGA’s 50/50 gender split, Oath of Peak hot take</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-27T05:00:00.000Z",
    "title": "Italian Central Bank Begins Development For DeFi Ecosystem",
    "url": "https://cryptodaily.co.uk/2023/07/italian-central-bank-begins-development-for-defi-ecosystem",
    "description": "<p class=\"md-end-block md-p md-focus\">The Bank of Italy's Milano Hub innovation center will provide support to a project spearheaded by Cetif Advisory that aims to develop a security token ecosystem for institutional decentralized finance (DeFi).</p>\n<p class=\"md-end-block md-p\">The project is a collaboration between Cetif Advisory, Polygon Labs, Fireblocks, and other organizations, with participation from Italian banks and ten other financial institutions.</p>\n<p class=\"md-end-block md-p\">Building an Institutional DeFi Ecosystem</p>\n<p class=\"md-end-block md-p\">The endeavor, selected during the Milano Hub&rsquo;s second call for proposals, will expand the scope of analysis of security tokens on secondaary markets. As explained by Cetif Advisory's general manager, Imanuel Baharier, these security tokens are digitized representations of the ownership of real-world assets. Baharier emphasises the importance of establishing conditions for DeFi to become a safe and open operating environment for supervised entities.</p>\n<p class=\"md-end-block md-p\">The project doesn't seek commercialisation, rather it aims to allow institutional market participants to operate in a DeFi environment while complying with regulatory guidelines. It will further develop Cetif Advisory&rsquo;s Lionity platform, touted as an &ldquo;institutional-grade automated market maker.\"</p>\n<p class=\"md-end-block md-p\">Cetif Advisory, a spinoff from the Cetif Research Centre at the Universit&agrave; Cattolica del Sacro Cuore in Milan, will receive six months of support from the Milano Hub. This backing includes expert advice and in-depth regulatory research, and it began earlier this month.</p>\n<p class=\"md-end-block md-p\">Emergence of Securities Tokenization</p>\n<p class=\"md-end-block md-p\">Securities tokenization is an emergent field in blockchain technology. According to projections from Citi Global Perspectives &amp; Solutions, tokenized securities market coulld be worth between $4 trillion and $5 trillion by 2030. The report suggests that private equity and venture capital are likely to become the most tokenized sectors, followed closely by real estate.</p>\n<p class=\"md-end-block md-p\">The project from Cetif Advisory, in collaboration with other industry stakeholders, may play a crucial role in advancing the DeFi ecosystem and furthering the utilization of tokenization. This move signals the Italian Central Bank's keen interest in the innovative potential of blockchain technology and tokenized securities.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-27T04:55:08.000Z",
    "title": "SOL Price Prediction: Solana Hints At Potential Fresh Rally To $30",
    "url": "https://www.newsbtc.com/analysis/sol-price-prediction-solana-to-30/",
    "description": "Solana is attempting a fresh increase above the $25 resistance against the US Dollar. SOL price might continue to rise steadily toward the $30 zone in the near term. SOL price is showing positive signs above the $24 level against the US Dollar. The price is now trading near $25 and the 100 simple moving average (4 hours). There was a break above a major bearish trend line with resistance near $24.80 on the 4-hour chart of the SOL/USD pair (data source from Kraken). The pair could continue to move up if it clears the $26 resistance zone. Solana Price Starts Recovery After a steady decline, Solana’s price found support near the $22.75 zone. SOL traded as low as $22.70 and recently started a recovery wave, unlike Bitcoin and Ethereum. The price climbed above the $24 and $24.50 resistance levels. There was a break above a major bearish trend line with resistance near $24.80 on the 4-hour chart of the SOL/USD pair. The pair climbed above the 23.6% Fib retracement level of the downward move from the $32.42 swing high to the $22.70 low. SOL is now trading near $25 and the 100 simple moving average (4 hours). On the upside, immediate resistance is near the $25.90 level. The first major resistance is near the $26 level. A clear move above the $26 resistance might send the price toward the $28.80 resistance. Source: SOLUSD on TradingView.com The 61.8% Fib retracement level of the downward move from the $32.42 swing high to the $22.70 low is also near the $28.80 level. Any more gains might send the price toward the $30 level. Another Drop in SOL? If SOL fails to clear the $26 resistance, it could start a fresh decline. Initial support on the downside is near the $24.80 level and the broken trend line. The first major support is near the $24 level. If there is a close below the $24 support, the price could decline toward the $22.75 support. In the stated case, there is a risk of more downsides toward the $20 support in the near term. Technical Indicators 4-Hours MACD – The MACD for SOL/USD is gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $24.00, and $22.75. Major Resistance Levels – $26.00, $28.80, and $30.00."
  }
]