[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T00:50:46.000Z",
    "title": "20 Cryptocurrency Predictions for the Next 10 Years and What to Do About Them",
    "url": "https://www.cryptopolitan.com/cryptocurrency-predictions-10-years/",
    "description": "Cryptocurrency prediction methodologies involve various approaches and tools to forecast the future price movements and trends of cryptocurrencies. While predicting the exact future price of cryptocurrencies is challenging and often speculative, analysts and traders use different methodologies to gain insights and make informed decisions. Here&#8217;s a detailed introduction to some common cryptocurrency prediction methodologies: Fundamental ... <a title=\"20 Cryptocurrency Predictions for the Next 10 Years and What to Do About Them\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cryptocurrency-predictions-10-years/\" aria-label=\"More on 20 Cryptocurrency Predictions for the Next 10 Years and What to Do About Them\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T01:00:09.000Z",
    "title": "SHIB Profitability Pumps As Meme Coins Continue To Rally",
    "url": "https://www.newsbtc.com/shiba-inu/shib-profitability-pumps-as-meme-coins-continue-to-rally/",
    "description": "The SHIB token has been on an incredible rally recently, pumping more than 18% in just the past week. This growth can be attributed to the current increase in the crypto market as a whole. SHIB, much like other meme coins, has a high degree of volatility, but it nevertheless manages to draw an engaged community of investors.  SHIB Pumps On Profitability According to data from IntoTheBlock, a blockchain and cryptocurrency market analysis website, the number of holders making money off the current market price of SHIB is currently ranging at its highest point in many months.  Related Reading: PEPE Surges By 34% Amid General Market Recovery The price of SHIB, the self-proclaimed “Dogecoin Killer,” skyrocketed from $0.000007 to $0.0000084 at a point today, propelling the number of holders in profit to almost 50%. This metric has since calmed down to 20% with SHIB now trading at $0.000007854. However, this figure is likely to climb back up as the current crypto sentiment continues. 14% of SHIB holders in profit &#124; Source: IntoTheBlock SHIB started as just another dog-themed meme coin, but it has gained real popularity and value. SHIB is now the 17th biggest cryptocurrency and second largest meme coin with a market cap of over $4.6 billion. According to data from Coinmarketcap, the meme coin&#8217;s price has had an 18.87% increase in the past week and an increase of 178% in trading volume in the past 24 hours. Meme Coins Rally As Crypto Sentiment Improves SHIB is not the only meme coin pumping right now and the meme coin rally shows no signs of slowing down any time soon. Other meme coins have also skyrocketed in value to a total market cap of $15.6 billion, and PEPE is leading the charge.  SHIB price trending above $0.000007 &#124; Source: SHIBUSD on TradingView.com The frog-themed meme coin which rose to popularity this year is up more than a massive 84% in the past 7 days. The meme coin is currently the biggest gainer among the top 100 crypto assets because of this surge and is currently trading at a price of $0.000001651. Related Reading: SHIB Jumps By 14% In A Single Day, As Shiba Inu “Worldpaper” Gets Closer DOGE, the original meme coin and still the most well-known, has spiked over 9% in the past week. At the time of writing, DOGE is trading at $0.06637, up from $0.060 just a few days ago. Other meme coins like FLOKI (FLOKI) and Dogelon Mars (ELON) have also pumped double-digits in the past few days. This surge can be attributed to a rise in the wider crypto market over the past 24 hours. Featured image from Times Tabloid, chart from TradingView.com"
  }
]