[
  {
    "source": "Cointelegraph",
    "date": "2024-03-14T15:36:39.000Z",
    "title": " Hong Kong regulators issue warning against Bybit exchange   ",
    "url": "https://cointelegraph.com/news/hong-kong-regulators-issue-warning-against-bybit-exchange",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMWI2YzIwNWMtNTY0OC00YjJhLWJiNmEtNTVhYjFkNWVmYTA5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>\"It is also an offence for any person to issue advertisements, invitations or documents relating to these products to the Hong Kong public without the SFC’s authorisation,\" the regulator stated. </p>\n                    <p><p>Hong Kong's Securities &amp; Futures Commission (SFC) has <a href=\"https://apps.sfc.hk/edistributionWeb/gateway/EN/news-and-announcements/news/doc?refNo=24PR47\" target=\"_blank\" rel=\"noopener nofollow\">placed</a> cryptocurrency exchange Bybit on its warning list as of March 14. \"The Securities and Futures Commission (SFC) today warns the public of an unlicensed virtual asset trading platform (VATP) known as Bybit,\" the regulator wrote, \"which offers trading services in crypto-related products in a number of jurisdictions.\"</p><p>Included in its warning list are 11 products offered by the Bybit exchange, such as Bybit Futures, Bybit Options, Bybit Leveraged Tokens, Dual Assets, Bybit Lending, Bybit Wealth Management, and others. \"The SFC is concerned that these products have also been offered to Hong Kong investors and wishes to make it clear that no entity in the Bybit group is licensed by or registered with the SFC to conduct any \"regulated activity\" in Hong Kong,\" said the regulator.</p><p>Currently, crypto-related products may constitute futures contracts or securities and require prior licensing with the SFC before they can be offered to Hong Kong residents. The March 14 warning refers to Bybit.com and its Seychelles-registered owner Bybit Fintech Limited, which is different than the https://www.bybit.com.hk, a similar domain owned by Spark Fintech Limited that does not currently provide crypto services in Hong Kong.</p><p><a href=\"https://cointelegraph.com/news/hong-kong-regulators-issue-warning-against-bybit-exchange\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-14T15:23:50.000Z",
    "title": " Bitcoin price slips 3% as US macro data compounds inflation problem ",
    "url": "https://cointelegraph.com/news/bitcoin-price-slips-us-macro-data-inflation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZmYyZTExZTktMGY2ZS00YTgwLThkODAtNjAxZjk0NmNjZDczLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>BTC price strength wobbles on the release of problematic U.S. inflation data as traders brush off Bitcoin's moves around all-time highs.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) headed lower at the March 14 Wall Street open after United States macro data offered a fresh inflation headache.</p><p>Data from <a href=\"https://subscription.cointelegraph.com/\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCGBP/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> tracked a swift BTC price descent from all-time highs to $71,200.</p><p>This took a matter of hours, with a rebound yet to kick in at the time of writing, leaving BTC/USD up to 3.3% down on the day.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-slips-us-macro-data-inflation\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-14T15:13:17.000Z",
    "title": " Why is Solana (SOL) price up today? ",
    "url": "https://cointelegraph.com/news/why-is-solana-price-up-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTAvMGI5ODY4NjktYWFhMi00ZDZmLTlkMTYtNzc1NDhlNGI4ZTcwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The rise in Solana’s price today can be attributed to the unexpected influence of a memecoin craze combined with a technical breakout coming to fruition.</p>\n                    <p><p>Solana’s (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) price has surged, buoyed by a wave of buying sentiment across the cryptocurrency market.</p><p>Notably, on March 14, SOL's price jumped approximately 6.70% to $174, its highest level since January 2022. In doing so, the cryptocurrency fared better than the overall crypto market, which dropped 0.25% on the same day.</p><p>Following are the core reasons behind Solana's impressive price rally on March 14.</p><p><a href=\"https://cointelegraph.com/news/why-is-solana-price-up-this-week\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-14T15:37:15.000Z",
    "title": "Binance says Nigeria ‘not yet one of its top markets,’ despite high crypto adoption in African country",
    "url": "https://cryptoslate.com/binance-says-nigeria-not-yet-one-of-its-top-markets-despite-high-crypto-adoption-in-african-country/",
    "description": "<p>Binance said Nigeria is not one of its top markets amid recent issues with authorities in the African country. In a March 13 statement, the exchange revealed its extensive cooperation with local law enforcement agencies to promote the responsible growth of crypto in Nigeria. Over the past weeks, Binance and the Nigerian authorities have been [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/binance-says-nigeria-not-yet-one-of-its-top-markets-despite-high-crypto-adoption-in-african-country/\">Binance says Nigeria &#8216;not yet one of its top markets,&#8217; despite high crypto adoption in African country</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-14T15:29:09.000Z",
    "title": "Syntropy Raises Additional Funding To Unlock Potential In Web 3 Data Infrastructure Space",
    "url": "https://cryptodaily.co.uk/2024/03/syntropy-raises-additional-funding-to-unlock-potential-in-web-3-data-infrastructure-space",
    "description": "Data infrastructure provider Syntropy raises additional funding from top crypto VCs. The company raised $4 million in May 2023, and a $5 million seed funding round."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-14T15:28:43.000Z",
    "title": "Polygon (MATIC) Thrives Post-Ethereum Dencun, Can Optimism (OP) Keep Up?",
    "url": "https://cryptodaily.co.uk/2024/03/polygon-matic-thrives-post-ethereum-dencun-can-optimism-op-keep-up",
    "description": "Discover the latest shake-up in the crypto world with Ethereum's Dencun upgrade! Find out how this major development is influencing giants like Optimism (OP) and Polygon (MATIC), and who stands to gain in this rapidly evolving market. Dive into the action now!"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-14T15:15:31.000Z",
    "title": "The Next Altcoin Boom: Key Players to Keep an Eye On",
    "url": "https://cryptodaily.co.uk/2024/03/the-next-altcoin-boom-key-players-to-keep-an-eye-on",
    "description": "Get ready for the next altcoin surge! With Bitcoin hitting new highs, keep an eye on key players – they're set to explode in the crypto market! Discover how these emerging altcoins are gearing up to ride Bitcoin's coattails to unprecedented growth and become must-haves in your investment portfolio."
  },
  {
    "source": "NullTX",
    "date": "2024-03-14T15:26:06.000Z",
    "title": "Privacy Concerns Slow Down WorldCoin (WLD) Momentum, Algotech Takes Spotlight",
    "url": "https://nulltx.com/privacy-concerns-slow-down-worldcoin-wld-momentum-algotech-takes-spotlight/",
    "description": "In less than a year since its launch, WorldCoin has shown impressive growth of over 460% and has held a spot on the watch list of many crypto enthusiasts. Standing out as one of the best investments in February 2024.  With many early investors reaping the profits, the community was [&#8230;]"
  }
]