[
  {
    "source": "Crypto Daily",
    "date": "2024-02-11T16:46:55.000Z",
    "title": "5 Best Hidden Gem Cryptocurrencies for Early 2024",
    "url": "https://cryptodaily.co.uk/2024/02/5-best-hidden-gem-cryptocurrencies-for-early-2024",
    "description": "Uncover the top 5 hidden gem cryptos set to explode in early 2024! See why these emerging tokens are causing a stir among savvy investors. Don't miss the chance to be part of the next big crypto wave – these digital assets could skyrocket and redefine your portfolio's potential!"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-11T17:00:27.000Z",
    "title": "Report: Crypto Ads Sideline in Super Bowl LVIII Despite Recent Bitcoin ETF Launches",
    "url": "https://news.bitcoin.com/report-crypto-ads-sideline-in-super-bowl-lviii-despite-recent-bitcoin-etf-launches/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/sbowl-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: Crypto Ads Sideline in Super Bowl LVIII Despite Recent Bitcoin ETF Launches\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/sbowl-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/sbowl-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/sbowl-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/sbowl-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/sbowl-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/sbowl-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/sbowl.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Following a wave of cryptocurrency ads securing airtime for promotions during the 2022 Super Bowl, the subsequent year witnessed an absence of crypto entities airing commercials in the event. The trend is set to continue into 2024, as highlighted by a recent analysis on the subject. Although several firms launched commercials for exchange-traded funds (ETFs), [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-11T17:00:00.000Z",
    "title": "This Newly Launched Crypto Will Soon Be Listed on Exchanges, Hitting the $5 Mark, Analysts Say",
    "url": "https://www.cryptopolitan.com/this-newly-launched-crypto-will-soon-be-listed-on-exchanges-hitting-the-5-mark-analysts-say/",
    "description": "Newly launched DeFi player, Pandoshi (PAMBO), has recently been generating substantial hype. Analysts who have studied the protocol say it has immense potential to reshape the industry. Most recently, they have pointed to Pandoshi’s upcoming listings on tier-1 exchanges Binance and Coinbase to spark a rally that could see PAMBO hit $5 in 2024. What [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-11T16:55:27.000Z",
    "title": "Nvidia’s Grace Hopper GH200 Superchip Challenges AMD and Intel in AI and HPC",
    "url": "https://www.cryptopolitan.com/nvidia-gh200-superchip-competes-amd-intel/",
    "description": "Nvidia&#8217;s Grace Hopper GH200 superchip has garnered significant attention in the tech sphere due to its cutting-edge AI and high-performance computing capabilities. CEO Jensen Huang&#8217;s emphasis on the critical role of accelerated computing in addressing intricate tasks further underscores the importance of GH200&#8217;s innovation.&#160; As a response to the escalating demands for processing power in [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-11T17:00:00.000Z",
    "title": "Kelexo presale draws Chainlink investors, Solana drops",
    "url": "https://crypto.news/kelexo-presale-draws-chainlink-investors-solana-drops/",
    "description": "Kelexo (KLXO), a lending platform, is popular. Chainlink (LINK) and Solana (SOL) are other trending projects investors are looking at"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-11T17:00:10.000Z",
    "title": "Bitcoin Price Nears $50,000 Milestone Again With 91% Of Addresses Now In Profit",
    "url": "https://www.newsbtc.com/news/bitcoin-price-nears-50000-milestone-again-with-91-of-addresses-now-in-profit/",
    "description": "Bitcoin is edging closer to the $50,000 mark after a week of extreme bullish price action, a level not seen since December 2021. Amidst this price surge, the number of Bitcoin addresses in profit has now crossed over 90%. According to data from IntoTheBlock, 91% of Bitcoin addresses are currently profitable. This means the vast majority of holders and investors have an incentive to continue holding, particularly as the next halving for Bitcoin miners approaches. Related Reading: BONK Stays Alive In Top 100 List With 25% Single-Day Rally – Details 91% Of Bitcoin Addresses Now In Profit As Price Nears $50,000 Bitcoin has had an eventful week in terms of price action. The world&#8217;s largest crypto recently grew by 14.4% to reach $48,500 on February 11, its highest point in 26 months. This price spike, although highly welcome, seemed to have taken most investors by surprise considering it was coming off four weeks of unimpressive action after the debut of spot Bitcoin ETFs in the US. Notably, IntoTheBlock&#8217;s &#8220;Global In/Out of the Money&#8221; profitability metric shows that the total number of addresses in profit is now at 46.87 million addresses, representing 90.53% of the total addresses. At the same time, 3.44 million addresses representing 6.64% are still posting losses, while 1.46 million addresses representing 2.83% of the total addresses are at the money or break-even point. Similarly, IntoTheBlock&#8217;s &#8220;In/Out of the Money Around Price&#8221; metric which follows addresses that bought between $40,919.92 and $55,413.77, shows that a majority (83.17%) of addresses are in profit. This is a hugely bullish signal and shows that the majority of Bitcoin holders are well in the money. As the price continues climbing as the crypto approaches the $50,000 mark, more and more addresses are likely to move into profit. Bitcoin Set To Keep Shining With over 90% of Bitcoin addresses now in profit and the price nearing $50,000, it&#8217;s clear this bull run still has room to run. The bullish action last week saw BTC closing over $44,000 on the weekly timeframe for the first time in the current market cycle.  BTCUSD currently trading at $48,354 on the daily chart: TradingView.com BitMEX Research recently reported that spot Bitcoin ETFs now have over $10 billion worth of BTC under management. There is a high probability that the price of the top coin continue to surge if the activity surrounding these exchange-traded funds (ETFs) continues at this pace. Bitcoin ETF Flow &#8211; 9th Feb All data out. Strong day at $541.5m of net inflow Invesco had an outflow, the first non-GBTC product to have an outflow day pic.twitter.com/UCFDVAaKD3 — BitMEX Research (@BitMEXResearch) February 10, 2024 Another catalyst for a sustained price increase is the upcoming halving. Historically, Bitcoin bull runs leading up to each halving have always trended up and gone parabolic after the halving event. A similar trend could see the crypto asset reaching $60,000 before the next halving in April and $100,000 before the end of the year. Related Reading: Bitcoin Back Above $48,000 – Is This Level The Springboard To $52,000? Featured image from Adobe Stock, chart from TradingView"
  }
]