[
  {
    "source": "Cointelegraph",
    "date": "2024-03-19T02:40:20.000Z",
    "title": " SEC requests extra $158M from federal budget to police crypto’s ‘Wild West’ ",
    "url": "https://cointelegraph.com/news/sec-2025-federal-budget-extra-160-million-crypto-enforcement",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvN2JlMzEyOWItYjFkNi00Y2Y3LThmMmYtZWFmMWRiYWNiMmY4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Part of the funds would hire staff across SEC divisions, with one job dedicated to crypto and another to help with the increased lawsuits the agency faces.</p>\n                    <p><p>The United States Securities and Exchange Commission is asking Congress for an extra $158 million from the federal budget next year to address “significant growth and change in our markets,” including the “Wild West of the crypto markets.”</p><p>The SEC’s March 11 Congressional Budget Justification — a document that outlines its budgetary needs for the upcoming 2025 fiscal year — is <a href=\"https://www.sec.gov/files/fy-2025-congressional-budget-justification.pdf\" target=\"_blank\" rel=\"noopener nofollow\">requesting</a> $2.594 billion for 2025 — up from $2.436 billion it <a href=\"https://www.sec.gov/files/fy-2024-congressional-budget-justification_final-3-10.pdf\" target=\"_blank\" rel=\"noopener nofollow\">requested</a> in 2024. </p><p>“Technology is rapidly transforming our markets and business models,” SEC Chair <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/gary-gensler\">Gary Gensler</a> wrote in the 148-page document that outlined its need for the money and included its performance report for last year.</p><p><a href=\"https://cointelegraph.com/news/sec-2025-federal-budget-extra-160-million-crypto-enforcement\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T02:47:41.000Z",
    "title": "Nvidia’s Project Gr00t – Transforming Humanoid Robotics with Apple Vision Pro Integration",
    "url": "https://www.cryptopolitan.com/nvidias-project-gr00t-robotics-apple-vision/",
    "description": "In a watershed moment for the advancement of artificial intelligence (AI) and robotics, Nvidia CEO Jensen Huang took center stage at the annual GPU Technology Conference (GTC) in San Jose, Calif., to unveil Project Gr00t—a pioneering initiative aimed at revolutionizing humanoid robotics. Anchored by Nvidia&#8217;s cutting-edge Blackwell AI GPU, the event showcased a convergence of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T02:46:24.000Z",
    "title": "A look at Sam Bankman-Fried’s leaked Twitter DMs",
    "url": "https://www.cryptopolitan.com/sam-bankman-frieds-leaked-twitter-dms/",
    "description": "Sam Bankman-Fried, the face behind the once-celebrated FTX empire, is in the spotlight for all the wrong reasons. The leak of his Twitter Direct Messages (DMs) exposes a saga of despair and dashed hopes, painting a stark picture of the human cost tethered to FTX&#8217;s downfall. From November 7 to November 11, 2022, Bankman-Fried&#8217;s inbox [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-19T03:00:47.000Z",
    "title": "PlanB’s Bitcoin Forecast: A Journey To $5 Million Per BTC In The Next Decade",
    "url": "https://www.newsbtc.com/bitcoin-news/planbs-bitcoin-forecast-a-journey-to-5-million/",
    "description": "PlanB, a popular name within the Bitcoin community, thanks to his Stock-to-Flow (S2F) model, has shared the latest discourse on X, igniting a flurry of excitement and speculation. This discourse particularly highlights BTC&#8217;s potential journey through successive halving cycles. PlanB&#8217;s analysis, deeply rooted in the S2F model, presents a narrative for Bitcoin&#8217;s future. This model scrutinizes the correlation between an asset&#8217;s existing reserves (stock) and annual production (flow) and lays the groundwork for PlanB’s bold predictions. Related Reading: Bitcoin Price Hits Support But Fresh Rally Faces Many Hurdles Navigating Through Predictions: A Community Aweigh According to the model, the forthcoming halving cycle spanning 2020-2024 is expected to solidify Bitcoin&#8217;s price at around $50,000. But the real spectacle unfolds in the ensuing cycles, with projections setting the stage for Bitcoin to ascend to $500,000 in the 2024-2028 cycle, eventually reaching a monumental $5 million in the 2028-2032 cycle. Stock-to-Flow 2020-2024 halving cycle: ~$50k Stock-to-Flow 2024-2028 halving cycle: ~$500k Stock-to-Flow 2028-2032 halving cycle: ~$5m Yes, S2F = exponential growth, and it will continue IMO. pic.twitter.com/rH1KmIyKSl — PlanB (@100trillionUSD) March 18, 2024 The predictions made by PlanB have sparked interest and debate among the crypto community. Many are curious to see if Bitcoin will experience the forecasted substantial growth. An X user responded to PlanB&#8217;s post, expressing hopefulness yet advising caution due to the limited number of data points that can&#8217;t definitively predict precise future prices, like an average of $500k from 2024 to 2028. PlanB acknowledged this caution, pointing out that his predictions are based on three past halving events and the significant pre-halving period, suggesting that while the Stock-to-Flow model can guide the general trend, its accuracy comes with a considerable margin of error. For instance, while the 2020-2024 period was projected to see an average of $55k, the actual figure was around $33k. Very true. Only 3 halvings (2012, 2016 and 2020) plus the crucial pre-halving period (where BTC S2F grew from below 1 to ~4). And S2F is only for general direction, of course, and with wide error margin (for example: prediction 2020-2024 was 55k but in reality ~33k). — PlanB (@100trillionUSD) March 18, 2024 Additionally, another user in the conversation, known as Phoenix of Crypto, remarked that while PlanB&#8217;s projection might seem &#8220;overly optimistic,&#8221; the true outcome remains to be seen, emphasizing the need for patience. This user highlighted the uncertainty surrounding Bitcoin&#8217;s future, especially considering the potential impacts of ETFs and widespread adoption, signaling an open-minded but watchful approach to market developments. Bitcoin Latest Price Action Bitcoin is undergoing a notable decline, having decreased by 7.5% over the last week. This downward trajectory has extended into the last 24 hours, with the cryptocurrency dropping an additional 1.5%. Despite these setbacks, Bitcoin&#8217;s trading price remains at $67,167 at the time of writing. Skew, a renowned trader, has provided technical analysis indicating a critical support range for Bitcoin investors between $60,000 and $67,000. Related Reading: Bitcoin Threatens To Retreat To $60,000 As Bulls Seek Solid Ground This range is seen as a possible pivot point for the market&#8217;s direction, concurrently noting the substantial selling activity on leading platforms such as Coinbase and Binance. $BTC Spot Market Data Thread, in partnership @_WOO_X $BTC Binance Spot Weekend spot buyer here Spot Supply ($72K &#8211; $74K) Spot Demand ($60K) Interestingly last bounce which was sold into also resulted in a stack of limit bids being quoted lower. ~ Keep an eye on those bids… pic.twitter.com/3PKHyddNlv — Skew Δ (@52kskew) March 17, 2024 Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-19T02:54:19.000Z",
    "title": "Bitcoin Price At Risk of More Downsides Before Fresh Increase To $70K",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-at-risk-65k/",
    "description": "Bitcoin price struggled to recover above the $68,800 resistance. BTC is now moving lower and there is a risk of more downsides below the $65,000 support. Bitcoin price is struggling to start a fresh increase above the $68,000 zone. The price is trading below $68,000 and the 100 hourly Simple moving average. There is a connecting bearish trend line forming with resistance at $67,800 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could gain bullish momentum if it clears the $68,000 resistance zone in the near term. Bitcoin Price Faces Resistance Bitcoin price attempted a fresh increase above the $65,500 zone. BTC climbed above the $67,200 and $68,000 levels. However, the bears were active near the $69,000 zone. A high was formed at $68,898 and the price is now moving lower. There was a move below the $67,500 support zone. The price declined below the 50% Fib retracement level of the recovery wave from the $64,555 swing low to the $68,898 high. Bitcoin is now trading below $68,000 and the 100 hourly Simple moving average. It is testing the 76.4% Fib retracement level of the recovery wave from the $64,555 swing low to the $68,898 high. There is also a connecting bearish trend line forming with resistance at $67,800 on the hourly chart of the BTC/USD pair. Immediate resistance is near the $66,750 level. The next key resistance could be $67,800 or the trend line, above which the price could rise toward the $68,800 resistance zone. Source: BTCUSD on TradingView.com If there is a clear move above the $68,800 resistance zone, the price could even attempt a move above the $70,000 resistance zone. Any more gains might send the price toward the $71,200 level. More Losses In BTC? If Bitcoin fails to rise above the $67,800 resistance zone, it could start another decline. Immediate support on the downside is near the $65,550 level. The first major support is $65,000. The main support sits at $64,500. If there is a close below $64,500, the price could start a drop toward the $63,500 level. Any more losses might send the price toward the $62,000 support zone. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $65,500, followed by $65,000. Major Resistance Levels – $67,800, $68,800, and $70,000."
  }
]