[
  {
    "source": "CoinDesk",
    "date": "2023-10-31T00:00:00.000Z",
    "title": "On Bitcoin White Paper's 15th Anniversary, Wall Street Threatens to Swallow Its One-Time Challenger",
    "url": "https://www.coindesk.com/business/2023/10/31/on-bitcoin-white-papers-15th-anniversary-wall-street-threatens-to-swallow-its-one-time-challenger/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The titans of finance are increasingly driving a space that, to many, was designed to put them out of business."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-30T23:45:31.000Z",
    "title": "Sam Bankman-Fried Can't Remember a Damn Thing",
    "url": "https://decrypt.co/203778/sam-bankman-fried-cant-remember-damn-thing",
    "description": "“I’m not sure, I don’t recall\" tells the story of the FTX founder's testimony on Monday."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-30T23:44:14.000Z",
    "title": "Voice Actors Slam 'The Finals' for Using AI Instead of Real People",
    "url": "https://decrypt.co/203768/ai-voices-used-in-the-finals-game-voice-actors-protest",
    "description": "The game maker said the technology \"gets us far enough in terms of quality.\""
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-30T23:42:00.000Z",
    "title": "Dogecoin ($DOGE) Price Eyes Bullish Breakout As It Moves Out of Multi-Year Downtrend, Analyst Says",
    "url": "https://www.cryptoglobe.com/latest/2023/10/dogecoin-doge-price-eyes-bullish-breakout-as-it-moves-out-of-multi-year-downtrend-analyst-says/",
    "description": "Popular cryptocurrency analyst Ali Martinez has recently revealed a bullish outlook on the meme-inspired cryptocurrency Dogecoin ($DOGE), noting the token is breaking out from a multi-year descending triangle on its weekly chart. The analyst noted that the breakout is coming at a time in which the TD Sequential indicator is showing a buy signal for […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-31T00:00:52.000Z",
    "title": "Time To Exit Bitcoin? Crypto Analyst Predicts 75% Breakdown To $8,000",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-crypto-analyst-8000/",
    "description": "Bitcoin has been on a winning streak for the better part of October and the multiple surges since then have pushed the price above $35,000 before correcting back downward. Even now, Bitcoin continues to show strength but not everyone is convinced that this winning streak will continue. One of these is a crypto analyst who has maintained that the price of Bitcoin will be headed back downward with an immense drop in price to crown the rally. Seeing Bitcoin At $8,000 The crypto analyst who goes by holeyprofit first posted their analysis of Bitcoin on TradingView on October 22, right at the start of the uptrend. At this point, the Bitcoin price was still hovering just around $30,000, and the analyst posited that the price of asset would not be able to climb above $31,000. Related Reading: Crypto Analyst Presents Uniswap’s UNI As The Next Coin Primed For Breakout According to the analyst, the recovery would make investors want to get in the market because they believe the price of BTC would continue to go up. However, this would be a bull trap and a consistent downward trend would follow quickly. Following the Bitcoin breakout just a few days later, the analyst updated the forecast but maintained that the price would return back downward. An October 25 update from the analyst read: “If this indeed going to be a reversal, the recent action would imply a very strong one.” Source: Tradingview.com This sustained bearish expectation from the analyst prompted short positions which seemed to raised from $34,000 to $35,000. “Moved off the high a bit and so far we have early structural failure of the uptrend,” the post read. “Very possible we drop here and it&#8217;s just a pullback (Highly likely even in a bull move this would retrace, which is why the 34/35K short seems a no brainer to try again.” Doubling Down On Bearish BTC Stance The analysis from the crypto analyst had received a lot of backlash from Bitcoin bulls but holeyprofit remains unmoved in their resolution. Even after the BTC price continued to rise, the analyst maintains that the crypto is headed for the $8,000 level. Related Reading: Bitcoin Bull Market: Crypto Spot Trading Volumes Climb To 8-Month Highs The most recent iteration of the post points out that the crypto is actually at the point where they expect it to start the downtrend. This region around $34,700 failed to hold on Sunday and has since broken back down into the $34,200 level. Holeyprofit addresses comments that they were trading against the trend saying that they were actually betting on the trend to hold. “This is where my models would suggest would be the best time to exit bull trades or at the very least trail stops to protect again a bear break,” the analyst said. BTC rests above $34,500 &#124; Source: BTCUSD on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-31T00:00:55.000Z",
    "title": "Artificial Intelligence-Focused Altcoin Rips Over 72% in One Week Amid New Project Updates",
    "url": "https://dailyhodl.com/2023/10/30/artificial-intelligence-focused-altcoin-rips-over-72-in-one-week-amid-new-project-updates/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Crypto-Transferred-to-the-Bahamas.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Crypto-Transferred-to-the-Bahamas.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Crypto-Transferred-to-the-Bahamas.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Crypto-Transferred-to-the-Bahamas.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Crypto-Transferred-to-the-Bahamas.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Crypto-Transferred-to-the-Bahamas.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Crypto-Transferred-to-the-Bahamas.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An altcoin from the artificial intelligence (AI) sector of digital assets has outperformed most of the crypto markets over the last week as the project readies new updates. Fetch.AI (FET) is a blockchain that aims to use AI to help automate certain tasks in various business sectors. According to crypto insights firm Messari, &#8220;Their platform [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/30/artificial-intelligence-focused-altcoin-rips-over-72-in-one-week-amid-new-project-updates/\">Artificial Intelligence-Focused Altcoin Rips Over 72% in One Week Amid New Project Updates</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]