[
  {
    "source": "CoinDesk",
    "date": "2024-02-05T19:57:33.000Z",
    "title": "Multicoin Capital Is in Talks to Sell Roughly $100M FTX Bankruptcy Claim: Source",
    "url": "https://www.coindesk.com/business/2024/02/05/multicoin-capital-is-in-talks-to-sell-roughly-100m-ftx-bankruptcy-claim-source/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Positive news around the FTX bankruptcy has seen claims being sold for upward of 70 cents on the dollar, now climbing towards the eighties."
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-05T19:56:19.000Z",
    "title": "Craig Wright Accused of ‘Industrial Scale’ Forgeries in First Day of COPA Trial",
    "url": "https://www.coindesk.com/policy/2024/02/05/craig-wright-accused-of-industrial-scale-forgeries-in-first-day-of-copa-trial/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A highly anticipated trial probing Australian computer scientist Craig Wright’s claim to fame as the pseudonymous author of the groundbreaking 2008 Bitcoin manifesto kicked off Monday at a U.K. high court, where a judge decided Wright could add some new evidence to back up his case."
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-05T19:40:30.000Z",
    "title": "WisdomTree Bets On Advisor Adoption For Bitcoin ETF Success",
    "url": "https://www.coindesk.com/business/2024/02/05/wisdomtree-bets-on-advisor-adoption-for-bitcoin-etf-success/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "WisdomTree, one of the ten issuers of spot bitcoin exchange-traded funds (ETFs), expects its product to be more successful towards the second half of the year thanks to adoption by financial advisor platforms."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-05T20:00:00.000Z",
    "title": " Hester Pierce against ‘gag rule,’ lawmakers challenging regulators: Law Decoded, Jan. 29–Feb. 5 ",
    "url": "https://cointelegraph.com/news/hester-pierce-against-gag-rule-lawmakers-challenging-regulators-law-decoded",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNDY1ZTAzNzgtOTNjNS00ZmRjLWE1NGQtZTM0YTRjYmEzOWJiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Hester Peirce believes that if the SEC is “confident in its investigative work” and analysis, it doesn’t need to “demand silence on the part of settling defendants.”</p>\n                    <p><p>United States Securities and Exchange Commission (SEC) Commissioner Hester Peirce <a href=\"https://cointelegraph.com/news/sec-settlement-gag-rule-undermines-integrity-hester-peirce\">disagreed with her agency’s denial</a> of a petition to amend its 1972 “gag rule,” which forbids defendants from denying or refusing to admit to the SEC’s allegations following a settlement. “The policy of denying defendants the right to criticize publicly a settlement after it is signed is unnecessary, undermines regulatory integrity, and raises First Amendment concerns,” Peirce wrote, adding that if the SEC is “confident in its investigative work” and analysis, it doesn’t need to “demand silence on the part of settling defendants.”</p><p>U.S. Congress members <a href=\"https://cointelegraph.com/news/congress-challenges-sec-crypto-custody-rule-repeal\">seek to repeal</a> the SEC’s Staff Accounting Bulletin 121 (SAB 121). This bulletin limits banks wishing to hold their client’s cryptocurrency assets, requiring them to keep their investor’s assets on the balance sheet. Representatives Mike Flood, Wiley Nickel and Senator Cynthia Lummis introduced a resolution under the Congressional Review Act to formally disapprove SAB 121 and cease its legal force. U.S. lawmakers have argued that it jeopardizes the willingness of regulated banks to act as crypto custodians and treats crypto holdings differently than other assets.</p><p>Leaders of the U.S. House Financial Services Committee and Subcommittee on Digital Assets, Financial Technology and Inclusion <a href=\"https://cointelegraph.com/news/us-lawmakers-proposed-cfpb-rule-crypto\">called for a longer comment period</a> on a proposed rule from the Consumer Financial Protection Bureau (CFPB), claiming its impact on the digital asset space would be “unclear” if implemented. Representatives Patrick McHenry, Mike Flood and French Hill question how a November 2023 proposal “would apply to specific entities within the digital asset ecosystem.” The CFPB rule <a href=\"https://cointelegraph.com/news/us-cfpb-proposes-supervising-digital-app-providers-including-crypto-wallets\">suggested extending its supervisory authority</a> over depository institutions, including digital assets in its “funds” definition and allowing it to target wallets.</p><p><a href=\"https://cointelegraph.com/news/hester-pierce-against-gag-rule-lawmakers-challenging-regulators-law-decoded\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-05T19:56:50.000Z",
    "title": " Terraform Labs former CFO Han Chang-joon extradited to South Korea ",
    "url": "https://cointelegraph.com/news/terraform-labs-former-cfo-han-chang-joon-extradited-south-korea",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNDg4NDk5NWEtMmRiZS00MmJhLTgzODQtMDEzZGU0MTg2MThmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Meanwhile, Terraform co-founder and CEO Do Kwon is coming to the United States for trial on charges advanced by the SEC.</p>\n                    <p><p>Former Terraform Labs chief financial officer Han Chang-joon was extradited from Montenegro to South Korea on Feb. 5, according to a statement by the police on a Montenegrin government website. Han was <a href=\"https://www.gov.me/clanak/izrucen-drzavljanin-juzne-koreje-koji-se-potrazivao-zbog-prevara-u-finansijsko-investicionim-uslugama\" target=\"_blank\" rel=\"noopener nofollow\">identified</a> only as J.C.H. in the statement, but an unnamed police spokesman <a href=\"https://www.reuters.com/technology/montenegro-extradites-ex-terraform-labs-financial-executive-south-korea-2024-02-05/\" target=\"_blank\" rel=\"noopener nofollow\">confirmed</a> his identity to Reuters. </p><p>Han <a href=\"https://cointelegraph.com/news/do-kwon-reportedly-arrested-in-montenegro\">was arrested with former Terraform CEO</a> Do Kwon at the airport in the Montenegrin capital Podgorica on March 23. They had been attempting to use forged Costa Rican passports to board a private jet heading to Dubai. According to the Montenegrin police statement said:</p><p> Oddly, the police statement said that Han is facing a life sentence in South Korea, which <a href=\"https://cointelegraph.com/news/prosecutor-says-do-kwon-s-extradition-to-south-korea-would-best-serve-terraform-labs-victims-report\">is more severe than the sentence</a> Kwon is threatened with, according to a South Korean newspaper. A report in KBS World stated that Kwon may be sentenced to up to 40 years in prison. </p><p><a href=\"https://cointelegraph.com/news/terraform-labs-former-cfo-han-chang-joon-extradited-south-korea\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-05T19:53:52.000Z",
    "title": " Bitcoin price flirts with $43K, but derivatives data points to traders&#039; low confidence ",
    "url": "https://cointelegraph.com/news/bitcoin-price-flirts-with-43k-but-derivatives-data-points-to-traders-low-confidence",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMDcyN2RjNjQtOGUzMi00ZDUxLTg0MGYtMjFmYmM5NWE3OWM3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin price hovers near the $43,000 level. Do bulls have plans to press BTC higher?</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) encountered difficulties as its price struggled to hold the $43,000 support on Feb. 5. The setback came after U.S. Federal Reserve (Fed) Chair Powell pushed back on market expectations for interest rate cuts in the next few months. The ensuing lack of interest from leverage longs in BTC derivatives markets fueled speculation of a potential decline to $40,000.</p><p>In a Feb. 4, 60 Minutes <a href=\"https://finance.yahoo.com/news/why-wall-street-is-still-bullish-on-stocks-even-with-march-rate-cut-hopes-dashed-113017736.html\" target=\"_blank\" rel=\"noopener nofollow\">interview</a>, Federal Reserve chair Jerome Powell clarified that the central bank committee needs more assurance about the inflation rate nearing the 2% target before taking action. While Powell expressed positive emotions about the economy, stating it's “in a good place”, he mentioned the possibility of \"three quarter-point rate cuts this year\" based on official projections, depending on job market behavior. However, this contradicted investors’ expectations of interest rate cuts starting in March.</p><p>Adding to Bitcoin's price pressure was an essay from Minneapolis Fed President Neel Kashkari on Feb. 5, suggesting the monetary authority might take time before reducing interest rates. Kashkari <a href=\"https://www.cnbc.com/2024/02/05/kashkari-backs-sentiment-that-the-fed-can-take-its-time-cutting-interest-rates.html\" target=\"_blank\" rel=\"noopener nofollow\">argued</a> that \"the current stance of monetary policy may not be as tight\" as believed, citing ongoing economic growth and low unemployment.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-flirts-with-43k-but-derivatives-data-points-to-traders-low-confidence\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-05T19:53:40.000Z",
    "title": "Bybit launches Inscriptions Marketplace supporting Ethereum, Avalanche, and other chains",
    "url": "https://cryptobriefing.com/bybit-inscriptions-marketplace-ethereum-avalanche-polygon/?utm_source=feed&utm_medium=rss",
    "description": "Crypto exchange Bybit partners with UniSat to enhance its inscription offerings, launching integrated support for Ethereum, Polygon, Fantom."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-05T19:53:02.000Z",
    "title": "Revolutionizing Redistribution: BLASTAR Pioneers 2024 Tax Tokens",
    "url": "https://cryptodaily.co.uk/2024/02/revolutionizing-redistribution-blastar-pioneers-2024-tax-tokens",
    "description": "Token and tax redistribution are key talking points in crypto. Most projects tax users for buying and selling tokens and while the percentages may vary, taxes are used to sponsor future developments."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T19:57:16.000Z",
    "title": "Ethereum-based Dogwifhat pumps amid insider trading rumors",
    "url": "https://www.cryptopolitan.com/ethereum-based-dogwifhat-pumps-insider/",
    "description": "In the recent crypto landscape, a surge of over $1.3 million flooded into multiple crypto wallets during the weekend, all thanks to a substantial acquisition of the Ethereum version of the meme coin known as “dogwifhat” (WIF). It’s crucial to distinguish this Ethereum iteration from the Solana-based WIF, which emerged in late November, quickly soaring [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T19:40:34.000Z",
    "title": "Binance denies reports of a compromise of its data and code",
    "url": "https://www.cryptopolitan.com/binance-denies-a-compromise-data-and-code/",
    "description": "Binance, a prominent cryptocurrency exchange, has refuted allegations suggesting a compromise of its data and code. Reports emerged claiming that a repository on GitHub contained a “highly sensitive cache of code,” internal passwords, and other technical information about the platform. The publication, 404 Media, asserted that this information had been publicly accessible for an extended [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-05T19:52:08.000Z",
    "title": "BTCS’ Builder+ Launches Optimized Block Construction for Ethereum",
    "url": "https://nulltx.com/btcs-builder-launches-optimized-block-construction-for-ethereum/",
    "description": "As Ethereum continues to innovate in the blockchain scene, the demand for technological tools to support its operations grows stronger. BTCS Inc., a seasoned player in the blockchain field, steps up to this challenge with its latest innovation: Builder+. This tool is designed to improve the way Ethereum block validators [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-05T19:40:48.000Z",
    "title": "SEC wins motion to disclose Ripple financial statements, XRP sales details",
    "url": "https://crypto.news/sec-wins-motion-to-disclose-ripple-financial-statements-xrp-sales-details/",
    "description": "A federal judge ruled that Ripple must disclose its financial records and details of XRP sales in the SEC's lawsuit over an unregistered securities offering."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-05T20:00:18.000Z",
    "title": "Crypto Winter In Spain? New Taxes Target Digital Assets",
    "url": "https://www.newsbtc.com/news/crypto-winter-in-spain-new-taxes-target-digital-assets/",
    "description": "In a move that could have ripple effects across Europe, Spain is tightening its grip on crypto monitoring and seizing digital assets for tax debts. The Ministry of Finance, led by María Jesús Montero, is spearheading legislative reforms to grant the Spanish Tax Agency enhanced powers to identify and seize crypto holdings from taxpayers with outstanding debts. This follows a February 1st decree expanding the entities obligated to report tax information to the Treasury, encompassing banks, savings banks, and even electronic money institutions. The measures come amidst Spain&#8217;s proactive approach to regulating the digital asset landscape ahead of the European Union&#8217;s Markets in Crypto-Assets Regulation (MiCA) framework, set for full implementation in December 2025. Related Reading: Meme Coin Blues: Nearly 70% Of Shiba Inu Investors Underwater As Price Flops Key Provisions Of The Crackdown The proposed crackdown on cryptocurrency in Spain includes several key provisions aimed at strengthening the government&#8217;s ability to regulate and collect taxes in the digital asset space. One major aspect of the legislative changes is the expansion of the Tax Agency&#8217;s authority, granting it the power to directly identify and seize assets associated with taxpayers having overdue debts. Additionally, the February 1st decree widens the scope of entities obligated to report tax-related data to the Treasury. This now includes not only banks, savings banks, and credit cooperatives but also electronic money institutions. This expanded list potentially provides a broader framework for tracking digital currency transactions. Spanish residents holding crypto assets on foreign platforms are subject to a mandatory declaration to the tax authorities by the end of March 2024. Initiated on January 1st, 2024, this declaration period requires individuals and corporations to disclose the value of their crypto holdings abroad as of December 31st, 2023. Total crypto market cap at $1.61 trillion on the daily chart: TradingView.com While all Spanish residents with foreign crypto holdings are required to make a declaration, only those exceeding €50,000 (approximately $54,000) are obliged to declare them for wealth tax purposes. Individuals holding their crypto in self-custodied wallets, outside of exchange platforms, must report them through the standard wealth tax form. These measures collectively aim to establish a more robust regulatory framework for cryptocurrency transactions and holdings in Spain. Spain At The Forefront Of Crypto Regulation Spain&#8217;s proactive stance on crypto regulation positions the country as a frontrunner within the European Union. Notably, the country is implementing its own crypto regulatory framework ahead of the EU-wide MiCA framework coming into effect in late 2025. This preemptive approach underscores Spain&#8217;s commitment to establishing clear regulations within the crypto space. Furthermore, Spanish tax authorities issued over 325,000 warnings in 2023 to residents who failed to declare their crypto holdings, marking a significant increase from the 150,000 warnings issued in 2022. This highlights the government&#8217;s growing focus on ensuring compliance within the crypto tax landscape. Challenges And Considerations While Spain&#8217;s efforts to regulate and tax cryptocurrencies are notable, some potential challenges remain. The rapid implementation of these changes might pose regulatory hurdles, requiring careful calibration to ensure effectiveness and minimize unintended consequences. Additionally, accurately tracking and seizing self-custodied crypto assets, held outside of exchange platforms, could prove difficult due to the inherent anonymity associated with such wallets. Global Implications Spain&#8217;s move could serve as a precedent for other countries seeking to establish frameworks for monitoring and taxing cryptocurrencies. As the global crypto market continues to evolve, Spain&#8217;s proactive approach offers valuable insights for policymakers worldwide navigating the complexities of regulating this dynamic asset class. Related Reading: The $50K Quest: Bitcoin Oracle’s Pre-Halving Proclamation Sparks Excitement Featured image from Pixabay, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-05T19:45:42.000Z",
    "title": "Tether (USDT) Hits $96,000,000,000 in Market Cap Following Record-Breaking Net Profit in Q4 2023",
    "url": "https://dailyhodl.com/2024/02/05/tether-usdt-hits-96000000000-in-market-cap-following-record-breaking-net-profit-in-q4-2023/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/usdt-issuer-rumors.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/usdt-issuer-rumors.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/usdt-issuer-rumors.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/usdt-issuer-rumors.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/usdt-issuer-rumors.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/usdt-issuer-rumors.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/usdt-issuer-rumors.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Stablecoin issuer Tether&#8217;s USDT is closing in on a $100 billion market cap after the firm saw record-breaking profits last quarter. According to Tether&#8217;s last earnings report, the company made $2.85 billion in profits during the fourth quarter of 2023, the highest the firm has ever seen, which was largely driven by interest payments from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/05/tether-usdt-hits-96000000000-in-market-cap-following-record-breaking-net-profit-in-q4-2023/\">Tether (USDT) Hits $96,000,000,000 in Market Cap Following Record-Breaking Net Profit in Q4 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-05T19:41:33.000Z",
    "title": "GoDaddy To Link Website Domains to Ethereum Name Service (ENS) Domains for Free",
    "url": "https://dailyhodl.com/2024/02/05/godaddy-to-link-website-domains-to-ethereum-name-service-ens-domains-for-free/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/top-big-ethereum-correction.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/top-big-ethereum-correction.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/top-big-ethereum-correction.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/top-big-ethereum-correction.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/top-big-ethereum-correction.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/top-big-ethereum-correction.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/top-big-ethereum-correction.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>GoDaddy, a world leader in web hosting and registration, is announcing a partnership with Ethereum Name Service (ENS), a domain naming service built on top of Ethereum (ETH). According to a new press release, users of GoDaddy domains can now link their domains to ENS without any additional costs or technical knowledge. As stated by [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/05/godaddy-to-link-website-domains-to-ethereum-name-service-ens-domains-for-free/\">GoDaddy To Link Website Domains to Ethereum Name Service (ENS) Domains for Free</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]