[
  {
    "source": "Cointelegraph",
    "date": "2024-03-09T01:42:07.000Z",
    "title": " BNB price hit a 2-year high, but what’s backing the bullish momentum?  ",
    "url": "https://cointelegraph.com/news/bnb-price-hits-a-2-year-high-but-whats-backing-the-bullish-momentum",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYWRmMzkwZjYtYWZmNi00OWY5LWIzYTgtZGEzYzg2NjFlYjE3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Despite Binance’s setbacks with regulators, BNB has managed to reach a 2-year high at $489.50.</p>\n                    <p><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) price surged by 62% in 30 days after hitting its highest level in 2 years on March 8 at $489.50. This movement may have been driven by gains in the broader market, but it solidified BNB as the third-largest cryptocurrency by market capitalization, excluding stablecoins. Some traders anticipate that BNB's price breaking above $500 is inevitable, but can the rally be sustained?</p><p>Many investors doubted BNB could ever reclaim the current levels, especially after Binance’s founder and former CEO Changpeng “CZ” Zhao <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\">entered a plea deal</a> with the United States federal court in November 2023 for allowing exchange users involved in illicit activities to transfer “stolen funds” through the exchange. At that time, CZ agreed to step down as CEO, casting doubt on the future of the BNB token given that part of its value stems from the Binance exchange ecosystem.</p><p>CZ’s trial is still pending sentencing, but the fact that <a href=\"https://cointelegraph.com/news/binance-cz-cftc-settlement-court-order-pay-penalty\">Binance settled</a> with the U.S. Commodity Futures Trading Commission (CFTC) in Dec 2023 helped alleviate uncertainty about BNB’s future. Binance was mandated to implement a formalized corporate governance structure, including compliance and audit committees. Meanwhile, CZ was ordered to remain in the U.S. until his sentencing date.</p><p><a href=\"https://cointelegraph.com/news/bnb-price-hits-a-2-year-high-but-whats-backing-the-bullish-momentum\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-09T01:50:00.000Z",
    "title": "Shiba Inu ($SHIB) Sees Meteoric Rise in Daily Active Addresses as It Solidifies Its Position Among Top 10 Cryptos",
    "url": "https://www.cryptoglobe.com/latest/2024/03/shiba-inu-shib-sees-meteoric-rise-in-daily-active-addresses-as-it-solidifies-its-position-among-top-10-cryptos/",
    "description": "The meme-inspired cryptocurrency Shiba Inu ($SHIB) has been seeing its price skyrocket over the last few weeks, to the point it has recently entered the top 10 largest digital assets by market capitalization ahead of Avalanche ($AVAX) and behind Dogecoin ($DOGE). As recently reported, the price of SHIB moved up over 300% in a single […]\n"
  }
]