[
  {
    "source": "CryptoSlate",
    "date": "2023-11-16T23:45:34.000Z",
    "title": "Three arrested in $10M bank fraud, crypto laundering scheme",
    "url": "https://cryptoslate.com/three-arrested-in-10m-bank-fraud-crypto-laundering-scheme/",
    "description": "<p>The U.S. Attorney&#8217;s Office for the Southern District of New York and the FBI announced three arrests related to a $10 million scheme involving cryptocurrency on Nov. 16. The authorities said that Zhong Shi Gao, Naifeng Xu, and Fei Jiang were arrested after participating in a scheme to steal millions of dollars from U.S. banks [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/three-arrested-in-10m-bank-fraud-crypto-laundering-scheme/\">Three arrested in $10M bank fraud, crypto laundering scheme</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-17T00:05:07.000Z",
    "title": "Ripple Introduces AMMs To XRPL, But Is This Good Or Bad For XRP Price",
    "url": "https://www.newsbtc.com/analysis/xrp/ripple-amms-to-xrpl-xrp-price/",
    "description": "Ripple Labs has announced plans to integrate Automated Market Makers (AMMs) into the XRP ledger. The decision has left the XRP community feeling uneasy, as they ponder the potential long-term effects of AMMs on the XRP price.  AMMs To Be Integrated Into XRP Ledger Ripple, a global payments network provider has stated its intentions to incorporate AMMs into the XRP Ledger to help improve liquidity. The introduction of AMMs into the XRP Ledger is expected to further develop the Ripple ecosystem by providing enhanced trading efficiency and liquidity. The initiative also aligns with Ripple’s efforts to continue to optimize and innovate its blockchain infrastructure and network.  Related Reading: Dogecoin Vs. Shiba Inu: Which Meme Coin Is More Profitable For Holders? Although the announcement has been met with skepticism by the XRP community and the broader crypto space, Ripple has stated its desire to push forward its plans, looking at the bigger picture and potential success of AMMs in the ecosystem.  Many crypto community members have expressed their concerns about the impacts of AMMs integrated into XRPL. Some members believe that the XRP price may be affected and cause the token to become stable. Other members have welcomed the announcement with enthusiasm, anticipating the positive effects the initiative would have on the Ripple ecosystem.  An XRP community member and co-founder of Anodos Finance, Panos addressed concerns regarding the potential effect of AMMs on XRP’s price. He stated that AMMs could increase buying pressure and liquidity on XRP while also improving its efficiency and adoption.  “XRPL AMM will potentially add buying pressure on XRP as a significant number is expected to be locked on the AMM, which will also increase the liquidity of XRP and will attract even more traders and will make XRP more efficient for more use cases,” Panos stated.  Bulls struggle to maintain control of price &#124; Source: XRPUSD on Tradingview.com Community Probes Impact Of AMMs On XRP Price Following the announcement of AMMs being introduced into the XRP Ledger, an X (formerly Twitter) influencer, Digital Perspectives PermaBull sparked a series of heated discussions in the XRP community regarding the effects of an AMM on XRP’s value. The X influencer asked a series of controversial questions to the crypto community. One of the questions was if the introduction of AMMs and regulations established by the Bank for International Settlements (BIS) would end up transforming XRP into a stablecoin in the future.  “Are we watching XRP become a Stablecoin with the introduction of AMMs and the Prudential Treatment requirements from the BIS?” the X influencer stated.  Related Reading: Lido DAO (LDO) New All-Time High? One Analyst’s Perfect Setup To $37 He added, “XLS-30D passes and AMMs become an integral part of the XRPL, will it change the Characteristics of XRP and qualify as a Group 1b Asset for BIS and other Banks?” In response to the growing concerns, XRPL advocate Panos reassured community members who had begun worrying about the potential impacts of AMMs on XRP. Panos affirmed that the fundamental characteristics of XRP would never change even with the inclusion of an AMM.  “The characteristics of XRP can NEVER change. It will always remain the native coin of the XRP Ledger, a decentralized digital asset that anyone can trade freely. XRP can never become a stablecoin for that reason, it&#8217;s technically not possible and makes no sense whatsoever,” Panos stated. Featured image from CoinGape, chart from Tradingview.com"
  }
]