[
  {
    "source": "Decrypt",
    "date": "2023-10-18T04:01:02.000Z",
    "title": "Louvre Augmented Reality Exhibit With Snapchat Uncovers Ancient Egypt",
    "url": "https://decrypt.co/202106/louvre-augmented-reality-exhibit-snapchat-uncovers-ancient-egypt",
    "description": "Beginning Wednesday, the Louvre's \"Egypt Augmented\" exhibition offers a new way to learn about Ancient Egypt in partnership with Snap."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-18T03:45:53.000Z",
    "title": "Coinbase lobbying efforts face setback from Hamas’ crypto use: Berenberg analysts",
    "url": "https://cointelegraph.com/news/coinbase-lobbying-setback-hamas-crypto-use-berenberg",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/d98079a4-e0ef-4ae4-a10d-8d9d70b401eb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Reports of Hamas using crypto to fund recent attacks in Israel could make Coinbase’s lobbying efforts more difficult, says Berenberg lead analyst Mark Palmer.</p>\n                    <p><p>The use of cryptocurrency by Hamas militants to fund recent attacks on Israel may have set back Coinbase’s crypto lobbying efforts in the United States, says a new investment report from Berenberg Capital Markets. </p><p>In an Oct. 18 research note, Berenberg lead analyst Mark Palmer said the primary driver of his “cautious stance” towards Coinbase comes from the various regulatory actions being levied against it in the U.S., along with political headwinds emanating from the Israel-Hamas conflict.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/e458b6d7-6b10-4657-ac5a-fbfa664f683f.png\"  /><figcaption style=\"text-align: center;\"><em>Berenberg analysts listed a number of concerns with Coinbases’ future performance. Source: Berenberg Capital Markets</em></figcaption></figure><p>Last week, the Financial Times <a href=\"https://www.ft.com/content/e03a370b-777f-46c2-8576-d1cee731efe2\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that Israeli authorities shut down and seized more than <a href=\"https://cointelegraph.com/news/binance-freezes-hamas-linked-accounts-israeli-request\">100 accounts on Binance and other crypto exchanges</a>which were being used to aid Hamas in its fundraising efforts.</p><p>As part of the crackdown, Israeli authorities seized millions of dollars worth of cryptocurrency.</p><p>“While Hamas announced last April that it would no longer use crypto for fundraising due to the ability of authorities to track its movement on blockchain ledgers, we believe the recent headlines are likely to make clarity around the question of crypto’s legal status even more elusive,” wrote Palmer. </p><p>Over the last few years, <a href=\"https://cointelegraph.com/news/crypto-industry-lobbying-expenses-rose-by-120-in-2022-in-the-us\">Coinbase has drastically upped its lobbying efforts</a> in the U.S. as part of a strategy to see more clear and crypto-friendly regulation introduced in the country. </p><p>Berenberg analysts reiterated their “hold” recommendation on Coinbase (COIN) stock and maintained a price target of $39. </p><p>Coinbase shares were trading at $77.30, up 3% on the day, according to <a href=\"https://www.tradingview.com/symbols/NASDAQ-COIN/\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from TradingView at the time of publication. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/5f007087-2854-4367-9478-61265af11f0b.png\"  /><figcaption style=\"text-align: center;\"><em>The price of Coinbase (COIN) shares are up 3% on the day. Source: TradingView</em></figcaption></figure><p>“We continue to view COIN through a cautious lens, especially after the stock has traded up by more than 112% this year versus ~72% for Bitcoin and ~29% for the tech-heavy Nasdaq,” said Palmer.</p><p>“Our Hold rating on COIN reflects our view that the stock is uninvestable in the near term,” he added. </p><p><strong><em>Related: </em></strong><strong><em><u><a href=\"https://cointelegraph.com/news/coinbase-suspends-80-trading-pairs-improve-liquidity\">Coinbase suspends 80 non-USD trading pairs to improve liquidity</a></u></em></strong></p><p>Palmer added that Coinbase’s ongoing case with the U.S. Securities and Exchange Commission may continue to be an “overhang” for any positive momentum in the company’s share price. </p><p>While Palmer also noted weaker-than-expected trading volumes arising from a “persistent crypto winter,” he said that Berneberg had raised its estimate of the company’s consumer transaction revenue to $240.8 million from $210 million. </p><p>This adjustment was made to reflect his expectation that Coinbase’s consumer take rate “will contract at a slower pace than we had been anticipating.\"</p><p>Additionally, Palmer explained the crypto exchange’s large cash balance provides it with “cushion and flexibility,” and he expects management to continue to reduce expenses and extend its runway moving forward. </p><blockquote>“Given those factors, as well as the fact that COIN is a crowded short, we believe shorting the company’s shares outright represents a risky strategy, especially as the stock could be prone to abrupt upside moves as the company pushes through its legal battle with the SEC.”</blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/\"><strong><em>‘AI has killed the industry’ — EasyTranslate boss on adapting to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]