[
  {
    "source": "CoinDesk",
    "date": "2023-11-13T16:00:00.000Z",
    "title": "Ex-Polygon Veteran Wyatt Joins Optimism Foundation Unit in Growth Role",
    "url": "https://www.coindesk.com/tech/2023/11/13/ex-polygon-veteran-wyatt-joins-optimism-foundation-unit-in-growth-role/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Wyatt, who previously served as president at Polygon Labs and had a stint at YouTube, joins as chief growth officer, where he will be in charge of helping developers build across Optimism’s ecosystem of blockchains."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-13T15:56:55.000Z",
    "title": "Ethereum Wallet Drainer Steals $60M in Six Months",
    "url": "https://www.coindesk.com/business/2023/11/13/ethereum-wallet-drainer-steals-60m-in-six-months/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Hackers that stole more than $60 million worth of crypto in six months are using a piece of code to bypass security alerts after maliciously gaining access to a private key."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-13T15:58:02.000Z",
    "title": "Former Polygon Labs President Ryan Wyatt Joins Ethereum Layer-2 Optimism",
    "url": "https://decrypt.co/205859/former-polygon-labs-president-ryan-wyatt-joins-ethereum-layer-2-optimism",
    "description": "Ryan Wyatt, also the former YouTube Gaming head, will build a team to support adoption of the Ethereum scaling network."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-13T15:45:58.000Z",
    "title": "Bitcoin’s realized profits surge as market braces for 2024 halving",
    "url": "https://cryptoslate.com/bitcoins-realized-profits-surge-as-market-braces-for-2024-halving/",
    "description": "<p>Realized cap offers a unique perspective on market behavior, representing the flow of capital in and out of Bitcoin (BTC). The realized cap is calculated by applying price stamps to each Bitcoin at the time of its last transaction, offering a more nuanced view of the market value than the traditional market cap. At the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoins-realized-profits-surge-as-market-braces-for-2024-halving/\">Bitcoin&#8217;s realized profits surge as market braces for 2024 halving</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T16:01:16.000Z",
    "title": "Genesis XBT: best place for networking and deal flow",
    "url": "https://www.cryptopolitan.com/genesis-xbt-best-place-for-networking-and-deal-flow/",
    "description": "Dubai, UAE – Genesis XBT, EMEA&#8217;s premier Bitcoin/crypto event, will take place from 15-16 November 2023 at Arjaan by Rotana Dubai Media City, which offers a spectacular&#160;Skylight&#160;Ballroom. This prestigious event gathers blockchain entrepreneurs, crypto enthusiasts, and industry leaders from over a hundred countries. Genesis XBT gathers together market-makers, liquidity providers, VCs, family offices, UHNWIs, and ... <a title=\"Genesis XBT: best place for networking and deal flow\" class=\"read-more\" href=\"https://www.cryptopolitan.com/genesis-xbt-best-place-for-networking-and-deal-flow/\" aria-label=\"More on Genesis XBT: best place for networking and deal flow\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-13T16:00:19.000Z",
    "title": "Crypto Analyst Says One Day Left Until XRP Price Blast-Off, What To Expect",
    "url": "https://www.newsbtc.com/analysis/xrp/one-day-xrp-price-blast-off/",
    "description": "The XRP price has had a mixed flow this month in terms of price action. The crypto surged by 25% in the first week of November to cross over $0.73, marking the first cross over this price point since June. However, XRP has since lost some of these gains. The crypto is now trading at $0.6574 at the time of writing and is down by 5.04% in a 7-day timeframe.  According to crypto analyst and enthusiast Will Taylor, known as Cryptoinsightuk on social media, this is quite normal for XRP, and price history has shown it&#8217;s only a matter of time before it catches up.  The analyst made this known while sharing his technical analysis on X (formerly Twitter). According to him, technical indicators point to liquidity rolling into XRP very soon, and a price takeoff is expected in less than two days. Related Reading: Bitcoin Price Hard Crash Or Mega Pump: Why $31,000 Holds The Key Liquidity To Rotate Into XRP Cryptoinsightsuk has predicted a further increase for XRP in the near term, resonating with other analysts observing a positive trajectory for XRP. The asset has mostly interlinked with the wider movements within Bitcoin and Ethereum since October&#8217;s lows. It has now lagged behind, with liquidity flowing to other altcoins like Solana and Cardano. Technical analysis using the RSI indicator shared by Cryptoinsightsuk showed that XRP recently entered overbought territory since it rose a lot in a short period of time. The analyst pointed out that the last time the asset entered the overbought territory on the RSI, it continued to rally around 36%.  Cryptoinsightsuk thinks we&#8217;re seeing the same pattern play out now, and a blast-off is imminent in the next 24 hours. A repeat of this rally from the current price puts a price target of $0.90 for XRP.  $XRP Blast off T-2 days. When we are surging in crypto markets, liquidity gets cycled into different alts. They then respectively pump.$XRP moved similarly in % to most Total 3 (Crypto Market cap &#8211; $BTC and $ETH) from the lows. However, in recent times, it seems $XRP has… pic.twitter.com/f36zzOguXd — Cryptoinsightuk (@Cryptoinsightuk) November 12, 2023 Technical Points To Look At For XRP Price Rally? XRP is ready for a strong rally now that its growth is no longer suppressed by the SEC lawsuit. It has now formed support at the $0.65 level, and the first step will be to break over $0.70. The next resistance is at its yearly high of $0.80. Other bullish analyses have come in for XRP in recent days. A previous X post by Cryptoinsightsuk predicted a strong rally to $10 at least. Related Reading: Crypto Analyst Confirms Dogecoin Price Breakout – Here’s The Target According to analyst ERGAG CRYPTO, XRP appears poised to reach at least $1.3 after breaking out of the current ascending triangle. Then a stronger price move to at least $5.5 dollar before retail investors start to sell off.  There is a good possibility that XRP&#8217;s price may surge above $1 in the near future. However, this might not come to reality until a US judge finally addresses all regulatory uncertainties surrounding Ripple and XRP. The good news is that Ripple seems to have the upper hand at the moment. XRP sees dip to $0.65 &#124; Source: XRPUSD on Tradingview.com Featured image from Crypto Asset Buyer, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-13T16:00:00.000Z",
    "title": "Altcoin Opportunities Surge as Market Sees Signs of Revival",
    "url": "https://coinedition.com/altcoin-opportunities-surge-as-market-sees-signs-of-revival/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Smart-Money-Investor-Prepares-To-Utilize-Altcoin-Market-Downturn.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Altcoin Opportunities Surge as Market Sees Signs of Revival\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Smart-Money-Investor-Prepares-To-Utilize-Altcoin-Market-Downturn.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Smart-Money-Investor-Prepares-To-Utilize-Altcoin-Market-Downturn-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Smart-Money-Investor-Prepares-To-Utilize-Altcoin-Market-Downturn-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Altcoin Opportunities Surge as Market Sees Signs of Revival</p>\n<p>The post <a href=\"https://coinedition.com/altcoin-opportunities-surge-as-market-sees-signs-of-revival/\">Altcoin Opportunities Surge as Market Sees Signs of Revival</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]