[
  {
    "source": "Decrypt",
    "date": "2023-06-18T12:45:00.000Z",
    "title": "Cross the Ages Game Review: A Tough But Rewarding Card Battler",
    "url": "https://decrypt.co/videos/explainers/2PfzFDVY/cross-the-ages-game-review-a-tough-but-rewarding-card-battler",
    "description": "Cross the Ages is a digital collectible card game that challenges players to duel online opponents—and you can even mint your cards as tradable NFTs. It's complex and difficult to grasp at first, but this mobile-first game has some serious strategic upside. GG contributor Ryan Gladwin puts Cross the Ages through its paces."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-18T12:59:44.000Z",
    "title": "Where to put wealth in a complex economic world: Bitcoin?",
    "url": "https://cryptodaily.co.uk/2023/06/where-to-put-wealth-in-a-complex-economic-world-bitcoin",
    "description": "<p>Retail investors with any &lsquo;savings&rsquo; must be wondering where on earth they are going to put them in order to survive the potential armageddon to come.</p>\nFew understand what is coming financially\n<p>The fact probably needs to be faced that the vast majority of the world&rsquo;s citizens still have no clue of the financial maelstrom that will hit them at some point over the next few months or years.</p>\n<p>Governments take advantage of, and it probably could be argued that they encourage, the ridiculously low level of financial education among the citizenry in general.&nbsp;</p>\n<p>If it weren&rsquo;t for various internet platforms even those who do want to know what is really happening would just be stuck with media such as television where even the most benign debates are just a circus show and an excuse for proper economic conversations among experts.</p>\nHolding fiat will not protect you\n<p>So back to the savings, a process once viewed as a perfectly normal and intelligent thing to do. Anyway, people still do it, probably blissfully unaware of how what they have saved has reduced in purchasing power - the more drastically the longer it has been saved.</p>\n<p>It could probably be safely argued that in general keeping one&rsquo;s currency in traditional areas such as bonds, stocks, and even in real estate, will not protect the wealth of the individual if the worst is to happen.</p>\n<p>What could that &lsquo;worst&rsquo; be? That doesn&rsquo;t come into the scope of this article, but suffice to say that a black swan, such as a really bad recession, could lead to governments having the excuse they need to impose their central bank digital currencies (CBDCs), and then also bring in their &lsquo;great reset&rsquo;, which could make the existing fiat currency worthless. That sort of scenario and how it might be survived is indeed food for thought.</p>\nA traditional hedge\n<p>Traditionally, in order to add some measure of protection and insurance to one's portfolio, gold is the asset to have. This is still true today, although with the caveat that the gold price is still arguably manipulated by banks. Even so, gold should at least protect what you have.</p>\nBitcoin even better?\n<p>This finally brings us to Bitcoin, an asset that is similar to gold, in that it has a scarce supply, and cannot be debased, although it must be recognised that gold does have a 2% inflation each year which is equivalent to the newly mined supply that is added to the total of above ground stocks.</p>\n<p>Contrary to this, Bitcoin has a halving every 4 years that is built into the code, and this cuts the supply in 2. Add to this the portability of bitcoin - it recognises no national borders and can be sent to anyone in any country in the world, cheaply and without any bank, regulatory agency or government being able to say no.</p>\n<p>Gold and silver have had their prices manipulated on the Western LBMA and COMEX exchanges for decades, so even though they are sound money they have been able to be controlled by the big banks.</p>\n<p>Bitcoin is outside of the system so the banks and government cannot do much about it. However, the recent Blackrock Bitcoin Spot ETF filing could be a first step for government, through the proxy of the world&rsquo;s largest asset manager, to be able to start exerting some control over Bitcoin should at least one scenario play out.</p>\nNow is a time for decision\n<p>We have arrived at the junction of a new world order and what the average investor does now can go a long way towards protecting them in what is likely to be a very different monetary system.</p>\n<p>Bearing in mind that all fiat currencies in history have always gone to zero, it will be incumbent for every investor to watch their government and central bank very closely and to do their research on the options that might protect them.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-18T12:56:44.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-18T12:53:18.000Z",
    "title": "Network to reward validators, stakers with XRP",
    "url": "https://crypto.news/network-to-reward-validators-stakers-with-xrp/",
    "description": "Root Network is looking to foster the XRP ledger-EVM interoperability issue while also rewarding validators and stakers with XRP"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-18T12:59:24.000Z",
    "title": "Shiba Inu (SHIB) Burn Rate Suffers 87% Decline In Single Week",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-shib-burn-rate-suffers-87-decline-in-single-week/",
    "description": "In recent weeks, the burn numbers of Shiba Inu tokens have not been particularly great, especially in the past seven days. This is despite the growing optimism amongst investors about the ecosystem’s prospects. In fact, there are speculations about a potential bullish run &#8211; as things stand. The price of the SHIB coin has been on a steady rise recently, gaining over 7% in the last seven days. According to data from CoinGecko, SHIB is currently valued at $0.00000716, with a daily trading volume of more than $118.9 million. SHIBUSD trading at $0.00000717 &#124; SHIBUSD chart from TradingView Related Reading: Shiba Inu (SHIB) Positive Social Sentiment Sparks Bullish Speculation SHIB Burn Rate Drops By 87% The amount of SHIB tokens sent to the dead wallet has decreased dramatically in the past seven days. Interestingly, these dwindling burn numbers coincide with the launch of an in-real-life (IRL) component by the popular meme-inspired ecosystem. This positive development capped off what was an overall great week.  That said, the dramatic dip in the amount of Shiba Inu tokens being burnt might be something to worry about. According to data from the Shibburn wallet tracker on Twitter, only 38,673,239 SHIB tokens were transferred to the dead wallet in the last seven days, indicating an 87% overall decrease in the token’s burn rate. It is worth noting that SHIB’s burn rate is on some recovery at the moment, as over a million tokens have been set ablaze in the past day. This represents a whopping 281% burn rate increase in the last 24 hours. Shibacals Launches In Anticipation Of Shibarium Shytoshi Kusama, a prominent Shiba Inu developer, has noted in the past the challenge of moving the SHIB price based on burns only. He, however, said introducing new technologies and utilities and expanding the ecosystem can help boost SHIB’s value. With the falling burn numbers and the launch of Shibarium drawing closer, it is clear that there should be a focus on improving the project’s value through new products and technologies. Hence, it can be said that the launch of Shibacals &#8211; the in-real-life component of Shiba Inu &#8211; is a move in the right direction. This newly-launched product is expected to push the ecosystem beyond the digital space. According to a tweet showing a screenshot of Shytoshi’s message, Shibacals also brings us one step closer to the takeoff of Shibarium &#8211; Shiba Inu’s Layer-2 protocol. Although there is no set date for the launch of the layer-2 protocol, there are strong speculations it will launch in the Q3 of 2023. That said, the Shibarium protocol is expected to undergo a series of tests and audits before it goes live on the mainnet. Related Reading: Shiba Inu Collapses: How Long Can The Meme Coin Climb Back Up? Featured image from Dreamstime.com, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-18T12:59:33.000Z",
    "title": "Bitcoin Set to Challenge US Dollar Dominance: Russian Bank CEO Predicts Rise of Chinese Yuan and BTC",
    "url": "https://www.crypto-news-flash.com/bitcoin-set-to-challenge-us-dollar-dominance-russian-bank-ceo-predicts-rise-of-chinese-yuan-and-btc/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-set-to-challenge-us-dollar-dominance-russian-bank-ceo-predicts-rise-of-chinese-yuan-and-btc",
    "description": "VTB Bank CEO, Andrey Kostin, criticizes actions blocking Russia from accessing gold and foreign exchange reserves. China recognizes the limitations of maintaining the yuan as a non-convertible currency.  During a recent interview with Reuters, Andrey Kostin, the CEO of VTB Bank, Russia&#8217;s second-largest bank, expressed that the actions taken by the United States and its [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-18T12:52:18.000Z",
    "title": "Binance Under French Investigation for KYC and AML Noncompliance, Alleged Money Laundering",
    "url": "https://www.crypto-news-flash.com/binance-under-french-investigation-for-kyc-and-aml-noncompliance-alleged-money-laundering/?utm_source=rss&utm_medium=rss&utm_campaign=binance-under-french-investigation-for-kyc-and-aml-noncompliance-alleged-money-laundering",
    "description": "The Binance cryptocurrency exchange is in trouble again as French authorities launch a fresh investigation into Binance.  The exchange has allegedly failed to comply with Know Your Customer (KYC) and anti-money laundering laws (AML) policies up until 2022.  Binance has been dealt another regulatory blow, but this time, the pushback is coming from France. The [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-18T12:45:36.000Z",
    "title": "InQubeta (QUBE) Defying Gravity as Top Crypto Assets Like Polkadot (DOT) And Internet Computer (ICP) Prices Collapse",
    "url": "https://www.crypto-news-flash.com/inqubeta-qube-defying-gravity-as-top-crypto-assets-like-polkadot-dot-and-internet-computer-icp-prices-collapse/?utm_source=rss&utm_medium=rss&utm_campaign=inqubeta-qube-defying-gravity-as-top-crypto-assets-like-polkadot-dot-and-internet-computer-icp-prices-collapse",
    "description": "The cryptocurrency market constantly evolves, and investors are always seeking viable alternatives for promising projects. InQubeta (QUBE) is one such project recently gaining significant attention and is poised for success with its innovative approach. This boost can be attributed to its token’s viral success in its ongoing presale. Renowned crypto assets like Polkadot (DOT) and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-18T12:42:06.000Z",
    "title": "Revolutionary Ripple: Central Banks Embrace Innovation, Test 30+ CBDC Use Cases, including Offline Payments – Is XRP at the Forefront?",
    "url": "https://www.crypto-news-flash.com/revolutionary-ripple-central-banks-embrace-innovation-test-30-cbdc-use-cases-including-offline-payments-is-xrp-at-the-forefront/?utm_source=rss&utm_medium=rss&utm_campaign=revolutionary-ripple-central-banks-embrace-innovation-test-30-cbdc-use-cases-including-offline-payments-is-xrp-at-the-forefront",
    "description": "The Bank for International Settlements (BIS) and the Bank of England have embarked on Project Rosalind, aiming to harness APIs to facilitate retail payments through Central Bank Digital Currencies (CBDCs). Project Rosalind has successfully developed 33 API functionalities that cater to over 30 CBDC use cases, such as offline payments, peer-to-peer transfers, and retail payments, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-18T12:45:00.000Z",
    "title": "Crypto Analyst: Bitcoin to Rally to $48K ahead of 2024 Halving",
    "url": "https://coinedition.com/crypto-analyst-bitcoin-to-rally-to-48k-ahead-of-2024-halving/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Solo-Bitcoin-Miner-with-Modest-Hash-Rate-Solves-Block-Against-All-Odds-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Solo Bitcoin Miner with Modest Hash Rate Solves Block Against All Odds\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Solo-Bitcoin-Miner-with-Modest-Hash-Rate-Solves-Block-Against-All-Odds-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Solo-Bitcoin-Miner-with-Modest-Hash-Rate-Solves-Block-Against-All-Odds-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Solo-Bitcoin-Miner-with-Modest-Hash-Rate-Solves-Block-Against-All-Odds.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>A Crypto Twitter personality identified as Stockmoney Lizards has predicted that Bitcoin’s price will rally to $48,000 between now and April 2024. That projection is based on a Fibonacci retracement pattern, which played out ahead of the Bitcoin halving of 2020. The analyst considered both periods and showed that a similar price pattern was already [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-analyst-bitcoin-to-rally-to-48k-ahead-of-2024-halving/\">Crypto Analyst: Bitcoin to Rally to $48K ahead of 2024 Halving</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]