[
  {
    "source": "Cointelegraph",
    "date": "2023-10-23T18:22:39.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Several key pieces of crypto legislation are at a standstill as Republican lawmakers struggle to elect a new House speaker in the United States Congress. Meanwhile, Reddit’s r/CryptoCurrency community sacked two moderators involved in insider trading of the Moons (MOON) token, and Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) advocate Jameson Lopp has presented new evidence that could debunk the theory that computer scientist Hal Finney was Bitcoin creator Satoshi Nakamoto. </p><h3>House speaker vacuum leaves Congress paralyzed on crypto bills</h3><p>Key pieces of crypto legislation in the United States remain in limbo as lawmakers <a href=\"https://cointelegraph.com/news/congress-paralyzed-crypto-bills-house-speaker\">struggle to appoint a new House speaker</a>. </p><p>Without a House speaker, crypto bills passed by the Financial Services Committee have nowhere to go. The Financial Innovation and Technology for the 21st Century Act, the Blockchain Regulatory Certainty Act, the Clarity for Payment Stablecoins Act and the Keep Your Coins Act are all on hold until Republicans can agree on a new speaker.</p><p>“In the Speaker race there are several pro-crypto candidates,” said Ron Hammond, the Blockchain Association’s director of government relations. Tom Emmer “is the frontrunner, but as the past few weeks have shown it is far from a guarantee he will become Speaker.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1) This week in Congress and crypto: Another week of House Speaker drama and intense focus on Israel/Hamas. For crypto there is a lot of tangental elements on both issues. Many of the speaker candidates have a strong record on crypto so let&#39;s quickly meet them and fights to come.</p>&mdash; Ron Hammond (@RonwHammond) <a href=\"https://twitter.com/RonwHammond/status/1716453222808727801?ref_src=twsrc%5Etfw\">October 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Contrasting with the pro-crypto candidates is a growing chorus of lawmakers who want to “curtail illicit crypto activity,” according to <a href=\"https://cointelegraph.com/news/crypto-advocacy-groups-rebuttal-links-terrorism\">a letter endorsed by Senator Elizabeth Warren</a> and more than 100 other representatives.</p><h3>Reddit removes moderators involved in alleged insider trading of MOON tokens</h3><p>Reddit’s r/CryptoCurrency community has fired two moderators who were found to be involved in insider trading of the MOON token, Cointelegraph has confirmed.</p><p>At least three wallets linked to Reddit group moderators dumped hundreds of thousands of dollars worth of MOON tokens on Oct. 18, just minutes before the official announcement of the closure of the blockchain-based points program that involved the use of certain cryptocurrencies native to each community. The market dump by the three wallets was highlighted by on-chain analysis accounts on X (formerly Twitter), such as Lookonchain.</p><p>Cointelegraph reached out to r/CryptoCurrency to understand the insider trading allegations and how the investigation went through. U/mellon, a core contributor and MoonDust founder, told Cointelegraph that two moderators were removed while three others are being investigated:</p><blockquote>“Two mods got removed, as they sold their Moons before the official announcement from Reddit: u/rider_of_the_strom u/McGillby.”</blockquote><p>The program allowed participants on the platform to earn points and spend them using community-native crypto tokens such as MOON.</p><h3>New evidence suggests Hal Finney couldn’t possibly be Satoshi Nakamoto</h3><p>For years, it has been commonly speculated that the late Hal Finney, a computer scientist, was the creator of Bitcoin. </p><p>However, a new analysis <a href=\"https://blog.lopp.net/hal-finney-was-not-satoshi-nakamoto/\" target=\"_blank\" rel=\"noopener nofollow\">presented</a> by Jameson Lopp, co-founder of Bitcoin custody firm Casa, argues it couldn’t possibly be the case, as Finney was competing in a 10-mile race at the exact time Satoshi Nakamoto was responding to emails and transacting on Bitcoin.</p><p>“It turns out that early Bitcoin developer Mike Hearn was emailing back and forth with Satoshi during this time,” explained Lopp, referring to archived emails that Hearn had released publicly in the past.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The folks responding to my Hal Finney research with &quot;yeah, we all know Satoshi is ______&quot; clearly missed the point.<br><br>Satoshi should remain a myth, an inspiration, an idea. Because ideas are bulletproof.</p>&mdash; Jameson Lopp (@lopp) <a href=\"https://twitter.com/lopp/status/1715996249139138827?ref_src=twsrc%5Etfw\">October 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“What can we determine from all of this? Satoshi sent the email to Mike at 9:16 AM Pacific time - 2 minutes before Hal crossed the finish line.”</p><p>“For the hour and 18 minutes that Hal was running, we can be quite sure that he was not interacting with a computer,” Lopp added.</p><p>Other evidence presented includes on-chain data showing a Bitcoin transaction confirmed during the race, as well as online activity from Satoshi in August 2010, which would have been very challenging given Finney’s battle with Amyotrophic Lateral Sclerosis (ALS).</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-23T18:30:24.000Z",
    "title": "Worldcoin Adjusts Token Strategy; Shifts Orb Rewards and Alters Market Maker Agreements",
    "url": "https://news.bitcoin.com/worldcoin-adjusts-token-strategy-shifts-orb-rewards-and-alters-market-maker-agreements/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/wldsorb-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Worldcoin Adjusts Token Strategy; Shifts Orb Rewards and Alters Market Maker Agreements\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/wldsorb-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/wldsorb-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/wldsorb-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/wldsorb-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/wldsorb-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/wldsorb-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/wldsorb.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Worldcoin, which uses iris biometrics to create a unique human identity database, said Sunday it is changing the distribution of its circulating WLD token supply and its market maker loan agreements. The project, launched in July, will decrease the loan amounts to market makers and will start rewarding operators with WLD instead of USDC. Worldcoin [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T18:25:01.000Z",
    "title": "World Blockchain Summit in Dubai Set to Unite Global Web3 Innovators and Decision-Makers",
    "url": "https://www.cryptopolitan.com/world-blockchain-summit-dubai-unite-global/",
    "description": "The World Blockchain Summit, scheduled to commence at the esteemed Address Dubai Marina, is poised to bring together more than 2,000 influential web3 decision-makers from across the globe. With a vision to highlight the region&#8217;s dedication to a web3-driven future, the event has garnered substantial attention from blockchain innovators and industry leaders. Leveraging strategic partnerships ... <a title=\"World Blockchain Summit in Dubai Set to Unite Global Web3 Innovators and Decision-Makers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/world-blockchain-summit-dubai-unite-global/\" aria-label=\"More on World Blockchain Summit in Dubai Set to Unite Global Web3 Innovators and Decision-Makers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T18:19:37.000Z",
    "title": "The first international crude oil trade in digital Yuan by PertolChina",
    "url": "https://www.cryptopolitan.com/1st-international-crude-oil-trade-in-yuan/",
    "description": "China has recently reported on achieving a milestone in its developments on transacting its first international trade on crude oil. In the world of financial investment, a groundbreaking development has been realized as China&#8217;s largest gas and oil company, PerthChina uses digital Yuan in its first oil payment.&#160; Digital Yuan, also termed as the Digital ... <a title=\"The first international crude oil trade in digital Yuan by PertolChina\" class=\"read-more\" href=\"https://www.cryptopolitan.com/1st-international-crude-oil-trade-in-yuan/\" aria-label=\"More on The first international crude oil trade in digital Yuan by PertolChina\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T18:19:26.000Z",
    "title": "Next-Gen Gaming Brings an Exciting Universal Industry Shift",
    "url": "https://www.cryptopolitan.com/next-gen-gaming-industry-shift/",
    "description": "Explore the profound transformation in next-gen gaming, highlighting technological innovations, societal impacts, and the evolving roles of gamers, developers, and investors in the gaming industry. "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T18:17:56.000Z",
    "title": "Hong Kong regulator reverses its stance on spot crypto investments",
    "url": "https://www.cryptopolitan.com/hong-kong-reverses-spot-crypto-investments/",
    "description": "Hong Kong’s financial regulator has recently made an important adjustment to its guidance regarding the sale of spot products in the cryptocurrency market. This change allows intermediaries to offer services to a broader range of clients, extending beyond professional investors. The Securities and Futures Commission (SFC) in Hong Kong announced this regulatory update in response ... <a title=\"Hong Kong regulator reverses its stance on spot crypto investments\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hong-kong-reverses-spot-crypto-investments/\" aria-label=\"More on Hong Kong regulator reverses its stance on spot crypto investments\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T18:10:42.000Z",
    "title": "AI-Generated Closing Statements in Legal Trial Spark Controversy",
    "url": "https://www.cryptopolitan.com/ai-generated-legal-trial-spark-controversy/",
    "description": "Musician Pras Michél, a member of the iconic Fugees, is challenging his recent conspiracy conviction, citing his former attorney&#8217;s use of artificial intelligence (AI) in drafting closing statements as a detrimental factor in his defense. The case has brought to the forefront questions about the role of AI in legal practices and the need for ... <a title=\"AI-Generated Closing Statements in Legal Trial Spark Controversy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-generated-legal-trial-spark-controversy/\" aria-label=\"More on AI-Generated Closing Statements in Legal Trial Spark Controversy\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-23T18:30:07.000Z",
    "title": "$35,000 The Next Key Level To Break For Bitcoin, Here’s Why",
    "url": "https://www.newsbtc.com/bitcoin-news/35000-the-next-key-level-break-bitcoin-why/",
    "description": "Bitcoin has now broken the $31,000 mark with its latest rally. According to on-chain data, the level could be the next major milestone for BTC. Bitcoin Realized Price Of 2021 Holders Is $35,000 At The Moment In a new post on X,  analyst James V. Straten has discussed the profit/loss situation of the different yearly Bitcoin buyer cohorts. The indicator of interest here is the &#8220;realized price,&#8221; which keeps track of the average price at which investors in the BTC market bought their coins. When the asset&#8217;s spot price is below this metric, the average holder in the sector is at a loss right now. On the other hand, it being above the indicator suggests the dominance of profits among the investors. Related Reading: Crypto Analyst Points Out Bitcoin Sell Signal That Could Be Triggered Today Here, Straten hasn&#8217;t shared the chart for the ordinary realized price for the entire circulating supply but rather a few versions of the metric that only consider buyers since the start of a particular year. The chart below shows the trend in the Bitcoin realized price for each year since 2017. The data for the different realized price levels &#124; Source: @jimmyvs24 on X As is visible in the graph, the Bitcoin realized price for all years except 2021 is below the current spot price of the cryptocurrency. This implies that the different yearly cohorts of the asset are holding their coins at some net unrealized profit. The latest groups to enter into a state of profit have been the 2022+ and 2023+ ones. The 2021+ group has a realized price of about $35,000 at the moment, which is still a significant distance away, but as Straten has noted, the gap between the spot price and the metric is now the narrowest since the two diverged back at the start of the bear market. Interestingly, during the peak in 2021, this group&#8217;s cost basis was around $48,000. The analyst suggests their realized price, since decreasing significantly, indicates some impressive Dollar-Cost Averaging (DCA) in the market. In on-chain analysis, major cost basis levels have always played an important role, as the BTC spot price has often observed support or resistance on retests of them. The chart shows that the Bitcoin price had found support at the 2023+ realized price back in June. The recent seemingly endless consolidation that BTC saw before the latest rally happened around the 2022+ and 2023+ metrics after they had overlapped. Related Reading: Bitcoin Price’s Next Move Up Will Be Extremely Explosive: Galaxy Given the historical examples, the 2021+ may realize price will cause the price to react somehow when it eventually reaches there. Thus, the $35,000 level would be a significant milestone for the asset, as successfully claiming it could imply clear waters ahead for the cryptocurrency. At the same time, however, the chances of participants buckling and harvesting their gains are increasing with all these groups coming into profits. Such profit-taking can lead to a pullback in the price, at least in the short term. BTC Price At the time of writing, Bitcoin is trading at around $31,200, up 11% in the past week. Looks like BTC has enjoyed some sharp upwards momentum in the last few days &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com"
  }
]