[
  {
    "source": "Cryptopolitan",
    "date": "2024-03-09T09:54:59.000Z",
    "title": "Investors warned of risks as crypto market sees surge in questionable tokens",
    "url": "https://www.cryptopolitan.com/investors-warned-of-risks-as-crypto-market/",
    "description": "Amidst crypto valuation surges, Bitwise chief investment officer Matt Hougan cautions investors to exercise vigilance. Hougan&#8217;s warnings come as various tokens experience rapid price increases, with some potentially lacking fundamental value. Bitcoin surge spurs diversification, but caution urged As Bitcoin soared to new all-time highs, surpassing $70,000 on March 8, investors found themselves with substantial [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-09T09:52:05.000Z",
    "title": "CRO Price Prediction 2024-2033: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2024-2033 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-09T09:44:23.000Z",
    "title": "Cryptopia to return crypto to users following 2019 hack",
    "url": "https://www.cryptopolitan.com/cryptopia-to-return-crypto-to-users/",
    "description": "Cryptopia, a New Zealand-based cryptocurrency exchange, has announced plans to begin returning cryptocurrencies to its account holders. This move comes after the exchange was targeted in a cyberattack in 2019, which led to significant losses. According to an email sent to users, the first round of distribution will involve Bitcoin (BTC) and Dogecoin (DOGE), which [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-09T10:00:23.000Z",
    "title": "Crypto Analyst Says Bitcoin Is Heavily Undervalued Despite ATH, What’s The Fair Value?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-is-heavily-undervalued/",
    "description": "Despite Bitcoin recently hitting a new all-time high (ATH) of over $70,000, crypto analyst Michaël van de Poppe believes that there is still more room for significant moves to the upside. Interestingly, he also expects that this bull cycle will be one like no other. Bitcoin Still Heavily Undervalued Michaël van de Poppe mentioned in an X (formerly Twitter) post that Bitcoin was still “heavily undervalued” despite hitting a new ATH. He added that the value is “way higher” and noted how the flagship crypto can help hedge against inflation and keep one’s purchasing power alive. Meanwhile, the crypto analyst believes there will be “way higher numbers” in this cycle. Related Reading: Crypto Analyst Says XRP Price Could Rocket 2,300% To $14.6, Here’s How Michaël van de Poppe had previously hinted at Bitcoin rising to as high as $150,000 in this bull run. Other analysts have also given similar price predictions, with the consensus that BTC will surely rise above $100,000. Other crypto analysts, including MacronautBTC, have even gone as far as predicting that Bitcoin could rise above $200,000.  There is a growing belief that this bull cycle will be the mother of all past cycles, which could be the reason for such ambitious predictions. Moreover, this cycle has the Spot Bitcoin ETFs, something past bull runs didn’t have. These ETFs have ushered in more institutional demand for the flagship crypto, which has led to an overall increase in the demand for Bitcoin.  Interestingly, NewsBTC previously reported that the demand for Bitcoin is significantly exceeding Miners&#8217; supply. This development is coming at a time when miners&#8217; rewards are set to be cut in half during the Bitcoin Halving. This would likely lead to more imbalance between the demand and supply curve, potentially leading to an exponential surge in Bitcoin’s price.  BTC Still Has Enough Time To Hit New Highs  Bitcoin hitting a new ATH of $70,000 is just the beginning of this bull run, as there is reason to believe this bullish momentum could run into next year. Crypto analyst Ali Martinez noted in an X post that Bitcoin has “consistently taken about 8 to 11 months to hit a market top” whenever it has shattered its previous ATH.    Related Reading: Dogecoin To $100? Crypto Analyst Reveals The Key With Bitcoin currently hitting new highs, the analyst added that historical patterns suggest that the next BTC market top “will be sometime between November 2024 and February 2025.” However,  Alex Thorn, Head of Research at Galaxy Digital, has warned that “bull markets are not straight lines up” and that sharp corrections should be expected along the way.  At the time of writing, Bitcoin is trading at around $68,300, up over 2% in the last 24 hours according to data from CoinMarketCap.  BTC price drops $68,400 &#124; Source: BTCUSD on Tradingview.com Featured image from CNBC, chart from Tradingview.com"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-09T09:53:26.000Z",
    "title": "Ethereum Wallets Overflow: Over 90% Addresses In Profit, Ether To Retest ATH",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-wallets-overflow-over-90-addresses-in-profit-ether-to-retest-ath/",
    "description": "Cryptocurrency enthusiasts are celebrating a bullish weekend for Ethereum (ETH), the world&#8217;s second-largest cryptocurrency by market capitalization. With a price surge of 4.31% in the last day, ETH is inching closer to a critical resistance point: $4,000. This climb comes amidst a wave of optimism surrounding the Ethereum network, fueled by a confluence of factors. Related Reading: Bitcoin Bulls On Alert: Top Analyst Anticipates A Big Spike In The Cards Ethereum Whale Activity, On-Chain Buying Signal Potential Rally Market analysts are attributing the recent surge to a significant rise in Ethereum accumulation. According to data from blockchain tracking company Spot On Chain, wallets linked to PulseChain and PulseX have been aggressively buying ETH, accumulating a staggering 163,295 ETH in just four days. This substantial buying pressure, totaling nearly $621 million DAI, suggests a strong foundation for a potential price increase. Furthermore, more than $10 billion whale trade volume recorded overnight indicates a shift in sentiment among major investors. This hefty trade volume is seen as a bullish signal, suggesting that whales are accumulating ETH in anticipation of a price upswing. Ethereum Investors Buoyed By Profitability, Approaching ATH Adding fuel to the fire, over 94% of ETH addresses are currently in profit. This translates to a significant number of investors holding onto their ETH, creating low selling pressure and potentially paving the way for a price increase. Data from IntoTheBlock (ITB), a cryptocurrency analytics platform, indicates that at this point, ETH is at its best level in nearly a year, but it is clearly trailing the upward trend that Bitcoin experienced once its spot Exchange-Traded Fund obtained approval. Source: IntoTheBlock Moreover, the excitement surrounding Ethereum is palpable as the price approaches its all-time high (ATH) of $4,890. With minimal resistance anticipated, a retest of the ATH seems like a realistic possibility in the near future. This prospect is further amplified by the dwindling number of addresses holding ETH at a break-even point or at a loss. Dencum Upgrade And ETF Speculation Stoke Investor Confidence Beyond the immediate price action, the Ethereum community is buzzing with anticipation about the upcoming Dencum upgrade. This highly anticipated upgrade is designed to address scalability issues, reduce transaction fees on layer networks, and decongest the Ethereum network. A successful Dencum upgrade is expected to significantly improve the overall user experience and potentially attract new investors, bolstering confidence in the long-term viability of the Ethereum network. Total crypto market cap is currently at $2.5 trillion. Chart: TradingView Adding another layer of optimism is the ongoing speculation surrounding a potential Ethereum ETF. While regulatory approval from the SEC is still pending, the very possibility of an ETF has buoyed investor sentiment. An ETF would allow traditional investors to gain exposure to Ethereum without the complexities of directly owning and managing cryptocurrency, potentially leading to a wider investor base and increased demand for ETH. A Look Ahead: Ether Trajectory Hinges On Multiple Factors While the outlook for Ethereum appears bright, there are still factors to consider. The price of ETH remains roughly $1,000 shy of its ATH, and the success of the Dencum upgrade and the approval of an Ethereum ETF are not guaranteed. As with any investment, conducting thorough research and maintaining a cautious approach is crucial. Related Reading: Don’t Miss Out: XRP Bull Flag Signals Explosive Price Movement However, the confluence of rising on-chain activity, whale accumulation, and a profitable investor base paints a promising picture for Ethereum. With the Dencum upgrade on the horizon and the possibility of an ETF, Ethereum appears poised for a potential price rally in the coming months. Featured image from Pexels, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-09T10:00:46.000Z",
    "title": "Ethereum Nears $4.8K ATH: Here’s The Utility Token Analysts Predict Is Poised For A Breakout And 3-5X Surge",
    "url": "https://www.crypto-news-flash.com/ethereum-nears-4-8k-ath-heres-the-utility-token-analysts-predict-is-poised-for-a-breakout-and-3-5x-surge/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-nears-4-8k-ath-heres-the-utility-token-analysts-predict-is-poised-for-a-breakout-and-3-5x-surge",
    "description": "<img width=\"1280\" height=\"853\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-09_12-07-43.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-09_12-07-43.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-09_12-07-43-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-09_12-07-43-1200x800.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-09_12-07-43-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-09_12-07-43-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/photo_2024-03-09_12-07-43-450x300.jpg 450w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Broader cryptocurrency market is trading in green since Bitcoin hit a new all time high at $69,470. The positive sentiment spread across the global crypto market, pushing the market cap nearly $2.6 Trillion. Though the leading cryptocurrency BTC has attained ATH, second biggest cryptocurrency Ethereum (ETH) still lingers around crucial resistance at $4,000 in efforts [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-09T09:52:39.000Z",
    "title": "XRP: The Future of Travel Payments? Ripple Partner Travelex Discusses Cash Preference and Digital Shift",
    "url": "https://www.crypto-news-flash.com/xrp-the-future-of-travel-payments-ripple-partner-travelex-discusses-cash-preference-and-digital-shift/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-the-future-of-travel-payments-ripple-partner-travelex-discusses-cash-preference-and-digital-shift",
    "description": "<img width=\"1792\" height=\"1024\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-06-12.53.02-Visualize-an-artistic-representation-of-Ripples-XRP-Army-Badge-NFTs-as-a-symbol-of-gratitude-from-Uphold-to-its-enthusiastic-supporters.-The-image-fe.webp\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-06-12.53.02-Visualize-an-artistic-representation-of-Ripples-XRP-Army-Badge-NFTs-as-a-symbol-of-gratitude-from-Uphold-to-its-enthusiastic-supporters.-The-image-fe.webp 1792w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-06-12.53.02-Visualize-an-artistic-representation-of-Ripples-XRP-Army-Badge-NFTs-as-a-symbol-of-gratitude-from-Uphold-to-its-enthusiastic-supporters.-The-image-fe-300x171.webp 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-06-12.53.02-Visualize-an-artistic-representation-of-Ripples-XRP-Army-Badge-NFTs-as-a-symbol-of-gratitude-from-Uphold-to-its-enthusiastic-supporters.-The-image-fe-1200x686.webp 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-06-12.53.02-Visualize-an-artistic-representation-of-Ripples-XRP-Army-Badge-NFTs-as-a-symbol-of-gratitude-from-Uphold-to-its-enthusiastic-supporters.-The-image-fe-768x439.webp 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-06-12.53.02-Visualize-an-artistic-representation-of-Ripples-XRP-Army-Badge-NFTs-as-a-symbol-of-gratitude-from-Uphold-to-its-enthusiastic-supporters.-The-image-fe-1536x878.webp 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-06-12.53.02-Visualize-an-artistic-representation-of-Ripples-XRP-Army-Badge-NFTs-as-a-symbol-of-gratitude-from-Uphold-to-its-enthusiastic-supporters.-The-image-fe-150x86.webp 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-06-12.53.02-Visualize-an-artistic-representation-of-Ripples-XRP-Army-Badge-NFTs-as-a-symbol-of-gratitude-from-Uphold-to-its-enthusiastic-supporters.-The-image-fe-450x257.webp 450w\" sizes=\"(max-width: 1792px) 100vw, 1792px\" />The travel industry is evolving at a fast pace with an integration of cash and digital payment modes. XRP with its speed and low cost is fast becoming a crucial alternative for travelers. As the travel industry experiences a robust resurgence post-pandemic, there&#8217;s a notable conversation brewing about the future of travel payments. While digital [...]"
  }
]