[
  {
    "source": "CoinDesk",
    "date": "2023-06-21T14:26:13.000Z",
    "title": "Central Banks Propose CBDC, Stablecoin Standards With Amazon, Grab Running Trials",
    "url": "https://www.coindesk.com/policy/2023/06/21/central-banks-propose-cbdc-stablecoin-standards-with-amazon-grab-running-trials/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Monetary Authority of Singapore (MAS), in collaboration with the IMF and other central banks, is proposing common conditions for retail payments with digital money on a distributed ledger."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T14:13:38.000Z",
    "title": "Singapore MAS proposes digital money standards with major industry players ",
    "url": "https://cointelegraph.com/news/singapore-mas-proposes-digital-money-standards",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/1e12bcf2-fee3-4c35-a8b0-2c0586c5d878.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> The Monetary Authority of Singapore, with input from major tech giants, released a whitepaper on the standards for digital money usage such as CBDCs and stablecoins. </p>\n                    <p><p>The Monetary Authority of Singapore (MAS) released a proposal for a common protocol that would specify the conditions for the use of various types of digital currencies. </p><p>On June 21 MAS <a href=\"https://www.mas.gov.sg/news/media-releases/2023/mas-proposes-standards-for-digital-money\" target=\"_blank\" rel=\"noopener nofollow\">published</a> a whitepaper that covers technical specifications outlining the lifecycle of its new Purpose Bound Money (PBM) concept, along with the names of financial institutions and fintech firms that plan to pilot PBM.  </p><p>PBM plans to enable senders of digital currencies across different systems, such as central bank digital currencies (CBDCs) or stablecoins, to be able to specify conditions of digital currency transactions, including a validity period and types of shops.</p><p>Mr. Sopnendu Mohanty, the chief fintech officer of MAS, commented that these recent developments have enhanced the role of digital currencies in the future financial landscape.</p><blockquote>“This collaboration among industry players and policymakers has helped achieve important advances in settlement efficiency, merchant acquisition, and user experience with the use of digital money.\"</blockquote><p>The paper was developed in collaboration with the International Monetary Fund, Banca d’Italia, and Bank of Korea, among other financial institutions. Fintech firms implementing a trial of PBM include Amazon, DBS and the fintech firm Grab. </p><p>Amazon will specifically trial escrow-like arrangements for online retail payments. It will entail the merchant receiving payment only when the customer receives the items purchased.</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/bis-releases-unified-ledger-proposal-cross-border-tokenized-asset-transactions\"><strong><em>BIS releases unified-ledger proposal for cross-border, tokenized asset transactions</em></strong></a></p><p>Additionally, the whitepaper encourages central banks, financial institutions and fintech companies to conduct more research for digital money use cases. </p><p>This comes as Singapore continues to embrace crypto-related businesses and activity. On June 7, Circle, the USDC stablecoin provider,<a href=\"https://cointelegraph.com/news/circle-is-latest-recipient-of-major-payment-institution-license-in-singapore\"> joined other major payment institutions</a> to receive a license in Singapore. </p><p>A few days prior, <a href=\"https://cointelegraph.com/news/crypto-com-joins-ranks-of-licensed-payment-institutions-in-singapore\">Crypto.com also received its license</a> from MAS for digital payment token services.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/hong-kong-crypto-exchanges-do-kwon-jail-korean-crypto-lenders-contagion-asia-express/\"><strong><em>Korean crypto contagion, Bank of China on Ethereum, HK’s exchange red carpet: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T14:30:00.000Z",
    "title": "Ethereum Network Data shows as PEPE  Accumulation Slows Down Investors are buying DigiToads in bulk.",
    "url": "https://cryptodaily.co.uk/2023/06/ethereum-network-data-shows-as-pepe-accumulation-slows-down-investors-are-buying-digitoads-in-bulk",
    "description": "<p class=\"s7\">Pepe Coin Enthusiasts are taking advantage of the current market correlation to accumulate vast amounts of cryptocurrency. PEPE, the popular meme coin that uses a frog as its mascot gained widespread popularity in 2023 after a successful initial coin offering that sold out. However, PEPE iaccumilation has slowed down and that make space for other coins on the rise, investors have been quick to accumulate large amounts of DigiToads, one of PEPE's rivals that uses the toad as its mascot.</p>\nDigiToads Presale Is Almost Sold Out\n<p class=\"s7\">DigiToads presale, which started a few weeks back, has been one of the hottest presales in 2023. Now in its Lilypad 8 stage, the presale has raised more than 4.85 million after selling more than 90% of the tokens allocated for the presale. As the launch of the $TOADS tokens approaches, investors have continued to show support for the project by purchasing TOADS tokens in chunks.</p>\n<p class=\"s7\">The fast presale growth of the DigiToads presale has led investors to predict a bright future for the token that includes massive growth of more than 1000%. Some market analysts even suggest that TOADs will quickly climb the ranks of cryptocurrencies and soon rank among the top fifty and then the top ten cryptocurrencies by market cap.</p>\n<p class=\"s13\">&gt;&gt; Buy DigiToads Now &lt;&lt;</p>\nWhy are investors so bullish about DigiToads?\n<p class=\"s7\">Well, DigiToads is a meme coin that stands out from the rest of the meme coins in the market, while most meme coins such as PEPE focus fully on the fun aspect and growing a community, DigiToads offers much more utility. This means that, unlike other meme coins that have to rely on community sentiment for value, the value of DigiToads is derived from the utility it offers investors.</p>\n<p class=\"s7\">Some of the features that differentiate DigiToads from other meme coin projects include a robust play-to-earn platform, deflationary nature, NFTS staking, a metaverse, and environmental consciousness.</p>\n<p class=\"s7\">The play-to-earn web3 gaming platform on DigiToads provides TOADs token holders with an immersive gaming experience that also rewards them with TOADs tokens for their efforts. In the game, players can collect, nurture and breed digital pet NFTS. Once a month, players battle their DigiToads against those of other players in a fierce competition where the top 25% of winners get rewards in the form of TOADs tokens. Players can use their rewards to enhance their rewards through staking, purchase more in-game items or buy more NFTs.</p>\n<p class=\"s7\">DigiToads is also getting recognition in the NFT space with the introduction of its NFT staking platform. Users have the opportunity to stake their TOADS NFTS and earn additional rewards. The longer they take their NFTS, the greater the rewards they earn. The staking pool receives funds from 2% of all TOADS transactions, ensuring a steady supply of rewards for participants in the staking process.</p>\n<p class=\"s7\">Another aspect of the DigiToads platform that has continued to attract investors is the monthly trading competitions. &nbsp;Once a month, DigiToads will hold a competition where traders will be required to show their trading skills and expertise. The winners will receive prestigious DigiToads, which give them access to funds in the treasury.</p>\n<p class=\"s7\">There will be 12 DigiToads available each year, and they will serve to ensure that only the top traders have control and access to the treasury, while also motivating other traders to sharpen their trading skills.</p>\n<p class=\"s7\">DigiToads will also play a role in conserving the environment by Donating 2.5% of its profits each month to a charity that is focused on conserving the Amazon rainforest and other natural habitats of wildlife like TOADs. This is a massive step in the right direction for DigiToads as it differentiates the project from other cryptocurrencies that have a rap for leaving a large carbon footprint.</p>\n<p>&gt;&gt; Buy DigiToads Now &lt;&lt;</p>\nFinal Word\n<p class=\"s7\">From an exciting metaverse to a rewarding play-to-earn game, staking and deflationary properties, DigiToads has all it needs to take off fast the most profitable crypto project of 2023, as an investor, this is your chance to hop on the DigiToads bandwagon and prepare yourself for insane growth.</p>\n<p class=\"s7\">If you haven&rsquo;t done so yet, head over to the DigiToads website and grab yourself some $TOADs tokens before it&rsquo;s too late.</p>\n<p class=\"s7\">For more information on DigiToads visit the website, join the presale or join thecommunity for regular updates.</p>\n<p class=\"s7\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T14:30:00.000Z",
    "title": "Bitcoin and Tradecurve technical indicators showing bullish signs",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-and-tradecurve-technical-indicators-showing-bullish-signs",
    "description": "<p>The cryptocurrency market has gone through peaks and valleys, but recent developments indicate potential bullish trends for Bitcoin and Tradecurve. Bitcoin, the pioneer cryptocurrency, and Tradecurve, a promising hybrid trading platform currently in its presale phase, have garnered attention from traders and investors. </p>\n<p>This article will explore the technical indicators that suggest a bullish outlook for these digital assets and what they could mean for the future.</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\nBitcoin (BTC) could see a surge in the making\n<p>After a significant price fall, Bitcoin, sometimes seen as the leading indicator of the cryptocurrency market, has been in a period of consolidation. However, many technical indications suggest that there may be a positive reversal soon.</p>\n<p>Bitcoin is on the verge of a bullish crossover, indicating a potential upward trend. Not only that, but the Bitcoin RSI is also in the buy zone, as it currently has a value of 65.802. With nearly all moving averages and technical indicators for Bitcoin showing buy signals, the future of this token looks bright. </p>\n<p>Currently, Bitcoin has a value of $26,550.91 with a market cap of $515B, which is a rise of 4.06% in the last 24 hours. Moreover, Bitcoin has witnessed a notable increase in trading volume in recent weeks, indicating renewed market activity. Overnight, the trading volume of Bitcoin increased by 29.75% and now sits at $17,289,847,477. Experts have noticed these technical indicators as they forecast a rise to $27,000 once more for Bitcoin by the end of 2023. </p>\n<p></p>\nTradecurve (TCRV) builds momentum for growth\n<p>Tradecurve, a borderless, Ethereum-based trading platform aiming to disrupt the traditional financial landscape, is showing promising signs of growth. Let&rsquo;s go over some key indicators supporting its bullish outlook.</p>\n<p>The number of registered users on Tradecurve has been steadily increasing, reflecting growing interest and adoption of the platform. Recently, the Tradecurve team announced that they had surpassed 10,000 registered users, and for a project that is currently in Stage 4 of its presale, that number is astonishing. As more users join the ecosystem, it creates a network effect that can attract additional traders.</p>\n<p>Tradecurve boasts a robust hybrid infrastructure model that facilitates efficient trading and ensures a seamless user experience. With a focus on security, speed, and user-friendly features, Tradecurve is well-positioned to attract and retain traders. </p>\n<p>The best aspects of DEX and CEX will be implemented on Tradecurve, meaning users will find low latency, access to multiple asset classes, decentralized asset and key control, fast order execution, and more on one platform. </p>\n<p>One of Tradecurve&rsquo;s main selling points is the removal of sign-up KYC checks. Users must frequently produce personal identifying papers, like passports or driver&rsquo;s licenses, to undergo KYC checks and prove their identity on centralized exchanges. This procedure brings up privacy issues and the possible misuse of personal data. Users may keep their privacy and secure their sensitive data by forgoing the necessity for KYC checks.</p>\n<p></p>\n<p>Other notable features that benefit all traders, novice or experienced, will be the ability to trade all derivatives on one account, algorithmic trading, high leverage (beginning at 500:1), negative balance protection, and a Proof of Reserves (PoR) implementation. </p>\n<p>Tradecurve&rsquo;s utility token, TCRV, will be a critical component of this ecosystem and bring holders various perks such as discounts on subscriptions for the AI-powered trading bots, governance voting rights letting you choose how the platform will develop, passive income via staking and more. </p>\n<p>Currently, the TCRV token has a value of only $0.018, up 20% in the last week. If we look at the market cap of Tradecurve, which now sits at $32M as the token supply is 1.8B, we can deduce that it will see a much faster surge than Bitcoin as a lower amount of new funds will be needed. </p>\n<p>Only 40% of the 1.8B token supply will be available during its presale, and with experts predicting a 50x increase by the time it ends, purchasing it now may put you in the proper position before it spikes. </p>\nFor more information about the Tradecurve presale:\n<p>Click Here For Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T14:15:00.000Z",
    "title": "Ride the Wave: 6 Best Cryptos to Buy With 100x Potential",
    "url": "https://cryptodaily.co.uk/2023/06/ride-the-wave-6-best-cryptos-to-buy-with-100x-potential",
    "description": "<p class=\"s5\">Get ready to ride the crypto wave as we delve into the explosive growth of Uwerx, the groundbreaking Web 3 platform poised to revolutionize the freelance industry. </p>\n<p class=\"s5\">In this article, we will explore the potential for a massive increase in the crypto market, with a focus on Dash (DASH), Cosmos (ATOM), Algorand (ALGO), Solana (SOL), Voyager Token (VGX), and Uwerx. </p>\n<p class=\"s5\">Brace yourself for an exhilarating exploration of these six cryptocurrencies and their projected 100x surge in value in 2023.</p>\n<p class=\"s5\">Top 6 Cryptos to Buy: Experts Forecast a 100x Surge in Price In 2023</p>\n<p class=\"s5\">1. Dash (DASH): Empowering Everyday Transactions in Developing Economies</p>\n<p class=\"s5\">2. Cosmos Hub (ATOM): Pioneering Interoperability for the Future of Blockchains</p>\n<p class=\"s5\">3. Algorand (ALGO): Building the Future of Decentralized Applications and Financial Services</p>\n<p class=\"s5\">4. Solana (SOL): Empowering Decentralized Applications with Lightning-Fast Speed and Scalability</p>\n<p class=\"s5\">5. Voyager Token (VGX): Unlocking Rewards and Safe Trading on the Regulated Crypto Broker Platform</p>\n<p class=\"s5\">6. Uwerx (WERX): Revolutionizing the Freelance Landscape with Unprecedented Security</p>\nDash (DASH): Empowering Everyday Transactions in Developing Economies\n<p class=\"s5\">Dash (DASH) is an open-source cryptocurrency dedicated to revolutionizing daily transactions. With the vision of becoming a widely accepted digital currency akin to cash, credit cards, or PayPal, Dash (DASH) aims to facilitate seamless and convenient purchases. </p>\n<p class=\"s5\">By venturing into economically distressed regions like Venezuela, Dash (DASH) has proven its commitment to providing accessible financial solutions in challenging environments. </p>\n<p class=\"s5\">Currently priced at $30.16, with a 24-hour trading volume of $30,669,214, Dash (DASH) has shown steady growth, experiencing a 2.52% increase in the last 24 hours. </p>\n<p class=\"s5\">Encouragingly, reputable market analysts predict a surge in Dash (DASH)'s value, projecting it to reach $54.31 by 2024. This forecast is attributed to the ongoing expansion of Dash (DASH)'s operations in developing countries, further bolstering its global presence.</p>\nCosmos Hub (ATOM): Pioneering Interoperability for the Future of Blockchains\n<p class=\"s5\">Cosmos Hub (ATOM) is a groundbreaking blockchain project revolutionizing the concept of interoperability among different blockchains. </p>\n<p class=\"s5\">With its mission to establish an \"Internet of Blockchains,\" Cosmos Hub (ATOM) enhances connectivity and communication between disparate blockchain networks. </p>\n<p class=\"s5\">As of now, Cosmos Hub (ATOM) is valued at $8.76, with a 24-hour trading volume of $63,578,552. With a remarkable ranking of #20 on CoinMarketCap, Cosmos Hub (ATOM) boasts a market cap of $3,036,246,050.</p>\n<p class=\"s5\">Market experts project that the price of Cosmos Hub (ATOM) could soar to $17.70 by Q4 2024. This optimistic forecast stems from the project's relentless dedication to advancing interoperability, offering increased scalability, and fostering seamless interaction between blockchain ecosystems.</p>\nAlgorand (ALGO): Building the Future of Decentralized Applications and Financial Services\n<p class=\"s5\">Algorand (ALGO) is a revolutionary cryptocurrency and blockchain platform that aims to revolutionize the development of decentralized applications (dApps) and financial services.</p>\n<p class=\"s5\">Currently priced at $0.115308, with a 24-hour trading volume of $27,075,481, Algorand(ALGO) has emerged as a prominent player in the crypto market, securing the #42 ranking on CoinMarketCap. </p>\n<p class=\"s5\">Market experts predict a potential price increase of $0.21 by Q4 2024. This projection is based on Algorand (ALGO)'s solid technological foundations, its ability to address scalability concerns, and the growing demand for decentralized applications and financial services.</p>\nSolana (SOL): Empowering Decentralized Applications with Lightning-Fast Speed and Scalability\n<p class=\"s5\">Solana (SOL) stands as a cutting-edge blockchain platform that delivers unparalleled speed, security, and scalability for decentralized applications (DApps) and crypto assets. </p>\n<p class=\"s5\">By incorporating a unique combination of advanced technologies and strategic design choices, Solana (SOL) tackles the scalability challenges that often plague other blockchain networks.</p>\n<p class=\"s5\">As of today, Solana (SOL) boasts a price of $15.21, accompanied by a robust 24-hour trading volume of $284,354,569. Solana's (SOL) impressive performance has earned it the #11 rank on CoinMarketCap, with a thriving live market cap of $6,068,806,983. </p>\n<p class=\"s5\">Analyzing market trends and conducting in-depth research, crypto analysts have expressed strong confidence in Solana (SOL)'s potential, predicting a potential price surge to $28.40 by the end of 2024.</p>\nVoyager Token (VGX): Unlocking Rewards and Safe Trading on the Regulated Crypto Broker Platform\n<p class=\"s5\">Voyager Token (VGX) stands as the native cryptocurrency token utilized on the Voyager Token (VGX) platform, a regulated crypto broker that facilitates seamless and secure trading of crypto assets.</p>\n<p class=\"s5\">With a current price of $0.101582 and a 24-hour trading volume of $3,107,810, Voyager Token (VGX) has secured the #476 rank on CoinMarketCap, boasting a market cap of $28,288,865. </p>\n<p class=\"s5\">By conducting meticulous market analysis, experts in the field are confident in the potential growth of Voyager Token (VGX), projecting a price surge to $0.22 by the end of 2024.</p>\nUwerx (WERX): Revolutionizing the Freelance Landscape with Unprecedented Security\n<p class=\"s5\">Uwerx, the revolutionary force in the freelance landscape, is set to make an extraordinary impact with its groundbreaking launch. One key aspect that sets Uwerx apart is its unwavering commitment to security and integrity.</p>\n<p class=\"s5\">Investors can find solace in the fact that team tokens are securely locked for nine months, ensuring stability and trust. Additionally, Uwerx plans to lock Token Liquidity for an impressive 25 years, providing long-term protection for investors and reinforcing the platform's credibility.</p>\n<p class=\"s5\">Uwerx has undergone rigorous audits by leading firms such as SolidProof and InterFi Network to further solidify its commitment to security. Following its recent listing on CoinSniper and upcoming plans for Uniswap, Uwerx is actively broadening its horizons, increasing accessibility and market visibility.</p>\nUwerx (WERX): Presale Opportunities and Thriving Community\n<p class=\"s5\">Uwerx's presale is making waves as it enters Stage 5, offering tokens at an enticing price of $0.041 each with a 15% bonus on every purchase. The response has been extraordinary, with Uwerx seamlessly completing presale stages 1 to 4 at an astonishing pace. </p>\n<p class=\"s5\">As the presale draws to a close on July 31st, Uwerx has captivating plans in store, including an exclusive Test Airdrop, providing users with a tantalizing taste of the immense possibilities that lie ahead.</p>\n<p class=\"s5\">The community's feedback is highly valued and has influenced token allocations, showcasing Uwerx's commitment to its users. Share your thoughts and suggestions at feedback@uwerx.network and be part of shaping the future of freelance platforms.</p>\nUwerx (WERX): Revolutionary Platform Features and Exciting Milestones\n<p class=\"s5\">Uwerx has unveiled the Alpha version of its platform, providing users with a glimpse into its innovative capabilities. This initial release showcases Uwerx's commitment to delivering an unparalleled user experience. Continuous updates and improvements are planned to further enhance the platform, setting the stage for an exciting journey of growth.</p>\n<p class=\"s5\">Recently, Uwerx released a comprehensive update on the Alpha platform, presenting users with a detailed and user-friendly PDF spanning ten pages. From the seamless signing-up process to the talent discovery journey, Uwerx ensures a seamless and intuitive user experience. </p>\n<p class=\"s5\">The transition from Alpha to Beta is on the horizon, marking a significant milestone in the project's trajectory and generating anticipation for the platform's future evolution.</p>\n<p class=\"s5\">Token holders of Uwerx can look forward to a meticulously designed 6-week vesting period following the conclusion of the presale. This carefully structured distribution schedule promotes stability and long-term commitment, with increasing percentages over time. By participating in Uwerx's success from day one, token holders become an integral part of the extraordinary journey that lies ahead.</p>\nJoin the Uwerx Revolution now by taking advantage of the 15% bonus in the presale:\n<p>Presale: invest.uwerx.network</p>\n<p>Telegram: https://t.me/uwerx_network</p>\n<p>Twitter: https://twitter.com/uwerx_network</p>\n<p>Website: https://www.uwerx.network/</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-21T14:30:18.000Z",
    "title": "Dollar Reliance Shrinks — China’s LNG Deal With Qatar Challenges ‘Frenemy’ Status With US",
    "url": "https://news.bitcoin.com/dollar-reliance-shrinks-chinas-lng-deal-with-qatar-challenges-frenemy-status-with-us/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/xxxsss33-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Dollar Reliance Shrinks — China&#039;s LNG Deal With Qatar Challenges ‘Frenemy’ Status With US\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/xxxsss33-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/xxxsss33-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/xxxsss33-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/xxxsss33-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/xxxsss33-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/xxxsss33-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/xxxsss33.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />This week, China and Qatar strengthened their bond through a significant development on Tuesday. China National Petroleum Corporation (CNPC) and Qatarenergy inked a 27-year deal, outlining China&#8217;s commitment to procure liquefied natural gas (LNG) from Qatar on an annual basis. Under the agreement, China will import a substantial four million metric tons of LNG per [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T14:37:07.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T14:35:20.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 While the crypto market navigated the fallout from the&#160;collapse&#160;of FTX in late 2022, Ava Labs says it dodged the bullet. Ava Labs founder and CEO Emin Gün Sirer assure its stakeholders that FTX impacts very little the companies and projects operating in the Avalanche ecosystem. The company had an account on ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T14:29:56.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T14:28:25.000Z",
    "title": "Atomic Wallet hackers move millions of stolen XRP tokens via major exchanges",
    "url": "https://www.cryptopolitan.com/atomic-wallet-hackers-move-millions-of-stolen-xrp/",
    "description": "In the aftermath of the infamous Atomic Wallet hack, the repercussions persist as millions of stolen XRP tokens resurface, finding their way into major cryptocurrency exchanges. The incident, which occurred in early June and was allegedly carried out by the notorious North Korean group Lazarus, left a trail of despair among crypto enthusiasts. Recently, a ... <a title=\"Atomic Wallet hackers move millions of stolen XRP tokens via major exchanges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/atomic-wallet-hackers-move-millions-of-stolen-xrp/\" aria-label=\"More on Atomic Wallet hackers move millions of stolen XRP tokens via major exchanges\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T14:27:35.000Z",
    "title": "Can SoftBank CEO Masayoshi Son Raise $10 Billion on Chips in the Coming IPO?",
    "url": "https://www.cryptopolitan.com/softbank-masayoshi-son-10-billion-chips-ipo/",
    "description": "In a bold move to revitalize its investment activities, SoftBank Group founder Masayoshi Son has declared that the world&#8217;s largest tech investment firm is set to make a comeback after a period of relative dormancy. Speaking at the conglomerate&#8217;s annual shareholders meeting, Son expressed his enthusiasm for the potential of artificial intelligence (AI) and revealed ... <a title=\"Can SoftBank CEO Masayoshi Son Raise $10 Billion on Chips in the Coming IPO?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/softbank-masayoshi-son-10-billion-chips-ipo/\" aria-label=\"More on Can SoftBank CEO Masayoshi Son Raise $10 Billion on Chips in the Coming IPO?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T14:09:57.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T14:15:15.000Z",
    "title": "EDX Markets Launches Crypto Exchange Backed by Fidelity, Schwab, and Citadel For Bitcoin, BCH, Litecoin, And Ethereum",
    "url": "https://www.crypto-news-flash.com/edx-markets-launches-crypto-exchange-backed-by-fidelity-schwab-and-citadel-for-bitcoin-bch-litecoin-and-ethereum/?utm_source=rss&utm_medium=rss&utm_campaign=edx-markets-launches-crypto-exchange-backed-by-fidelity-schwab-and-citadel-for-bitcoin-bch-litecoin-and-ethereum",
    "description": "EDX Markets announced that it intends to launch EDX Clearing to settle trades matched on EDX Markets. The exchange recently closed a funding round that included Miami International Holdings, DV Crypto, GTS, GSR Markets LTD, and HRT Technology. The cryptocurrency market in the United States has suddenly taken a different perspective after the SEC charged [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-21T14:25:00.000Z",
    "title": "Trader and Analyst Believes SOL Can Still Increase Another 100%",
    "url": "https://coinedition.com/trader-and-analyst-believes-sol-can-still-increase-another-100/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-51-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A popular crypto trader and analyst Bluntz Capital took to Twitter to share his extremely bullish outlook on Solana (SOL). According to the trader, SOL has witnessed a solid and powerful reaction from a major support level, accompanied by a clear three-wave decline when observed on higher time frames. The post added that there is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/trader-and-analyst-believes-sol-can-still-increase-another-100/\">Trader and Analyst Believes SOL Can Still Increase Another 100%</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]