[
  {
    "source": "Cointelegraph",
    "date": "2024-03-21T02:46:02.000Z",
    "title": " Bitcoin bull cycle is ‘far from over’ thanks to the halving — CryptoQuant research ",
    "url": "https://cointelegraph.com/news/bitcoin-bull-cycle-is-far-from-over-thanks-to-the-halving-cryptoquant-research",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYmQxODdjZTMtZmE3MS00NmI4LTlkZTctNjdhZTczN2RkZmFhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Sharp double-digit corrections in Bitcoin price are par for the course, as data shows BTC remaining in a strong bull cycle.  </p>\n                    <p><p>Over the past 48 hours,Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price dropped 13% from its new all-time high of $73,835 to briefly trade near $60,000. The correction was caused by <a href=\"https://cointelegraph.com/news/bitcoin-price-drops-9-percent-ath-market-shows-signs-overheated\">overheated market conditions</a> in what analysts have christened a “pre-halving retrace” ahead of the Bitcoin halving event that is roughly 30 days away. </p><p>However, a report by CryptoQuant shows that the <a href=\"https://cointelegraph.com/news/4-signs-bitcoin-price-starting-next-bull-run\">Bitcoin bull cycle</a> is not over, given the relatively low level of investment flows from new investors and price valuation metrics still below levels seen in past market tops. </p><p>The on-chain data analytic firm’s Weekly Crypto Report reveals that 48% of Bitcoin investment is coming from short-term holders. The “bull cycle typically ends with 84%-92% of investment” from these new investors, according to CryptoQuant analysts. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-bull-cycle-is-far-from-over-thanks-to-the-halving-cryptoquant-research\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-21T03:00:00.000Z",
    "title": "XRP Analyst Maintains $27 Price Target, Citing Technical Similarities to 2017 Rally",
    "url": "https://www.cryptoglobe.com/latest/2024/03/xrp-analyst-maintains-27-price-target-citing-technical-similarities-to-2017-rally/",
    "description": "A popular cryptocurrency analyst has recently suggested that the price of the native token of the XRP Ledger, XRP, could soon move to the $27 mark within the current market cycle, with his analysis hinging on a perceived similarity between XRP’s current price chart and historical patterns observed in 2017. The analyst, EGRAG Crypto, pointed […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-21T03:00:56.000Z",
    "title": "Coinbase to Provide Key Infrastructure for Blackrock’s Tokenized Investment Fund",
    "url": "https://news.bitcoin.com/coinbase-to-provide-key-infrastructure-for-blackrocks-tokenized-investment-fund/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/coinbase-blackrock-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Coinbase to Provide Key Infrastructure for Blackrock&#039;s Tokenized Investment Fund\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/coinbase-blackrock-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/coinbase-blackrock-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/coinbase-blackrock-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/coinbase-blackrock-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/coinbase-blackrock-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/coinbase-blackrock-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/coinbase-blackrock.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Coinbase has been chosen as a key infrastructure provider for Blackrock&#8217;s newly unveiled tokenized investment fund, the crypto exchange has revealed. &#8220;This is the latest progression of our digital assets strategy,&#8221; said Blackrock’s head of digital assets. &#8220;We are focused on developing solutions in the digital assets space that help solve real problems for our [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-21T02:51:51.000Z",
    "title": "Can Nvidia’s AI-Powered Digital Human Technologies Blur the Lines Between Reality and Virtuality?",
    "url": "https://www.cryptopolitan.com/nvidias-ai-powered-digital-human-tech/",
    "description": "In a groundbreaking display of technological prowess, Nvidia has once again seized the spotlight, this time at the prestigious Game Developers Conference 2024 (GDC). Amidst the fervent atmosphere of innovation, Nvidia&#8217;s showcase centered around its revolutionary AI-powered &#8216;Digital Human Technologies,&#8217; heralding a new era of interactive experiences. As the gaming industry braces for a seismic [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-21T02:45:24.000Z",
    "title": "Galaxy S25: AI-Powered Journey Through Hurdles and Hope in Chipset Evolution",
    "url": "https://www.cryptopolitan.com/samsung-galaxy-s25-ai-powered-journey/",
    "description": "In the relentless pursuit of enhancing smartphone capabilities, Samsung is gearing up to potentially revolutionize its flagship Galaxy series with an emphasis on artificial intelligence (AI). Phone production companies are working at best to integrate AI futures in their production while navigating the inns of new technology. However, as the tech world eagerly anticipates the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-21T02:59:26.000Z",
    "title": "Bitcoin Price Jumps 10% But Can Pump BTC Back To $70K?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-jumps-68k/",
    "description": "Bitcoin price started a strong recovery wave from the $60,800 zone. BTC is up nearly 10% and now facing hurdles near the $68,800 resistance. Bitcoin price started a decent increase from the $60,800 support zone. The price is trading above $64,500 and the 100 hourly Simple moving average. There was a break above a key bearish trend line with resistance at $65,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair must clear the $68,800 resistance zone to start a fresh uptrend. Bitcoin Price Recovers 10% Bitcoin price extended its decline below the $62,500 zone. BTC even spiked below the $61,200 level before the bulls appeared near $60,800. A low was formed near $60,778 and the price is now moving higher. There was a decent increase above the $63,000 and $64,000 resistance levels. The price even cleared the 50% Fib retracement level of the downward move from the $68,898 swing high to the $60,778 low. There was a break above a key bearish trend line with resistance at $65,000 on the hourly chart of the BTC/USD pair. Bitcoin is now trading above $64,500 and the 100 hourly Simple moving average. It is also above the 76.4% Fib retracement level of the downward move from the $68,898 swing high to the $60,778 low. Source: BTCUSD on TradingView.com Immediate resistance is near the $68,000 level. The first major resistance could be $68,800. If there is a clear move above the $68,800 resistance zone, the price could continue to gain strength. In the stated case, the price could even clear the $70,000 resistance zone in the near term. The next key resistance sits at $72,500. Another Decline In BTC? If Bitcoin fails to rise above the $68,800 resistance zone, it could start another decline. Immediate support on the downside is near the $66,800 level. The first major support is $65,500. The next support sits at $64,800. If there is a close below $64,800, the price could start a drop toward the $63,000 level. Any more losses might send the price toward the $62,500 support zone in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 60 level. Major Support Levels – $65,500, followed by $64,800. Major Resistance Levels – $68,000, $68,800, and $70,000."
  }
]