[
  {
    "source": "Decrypt",
    "date": "2023-08-07T20:47:41.000Z",
    "title": "PayPal Stablecoin Fakes Flood Ethereum—Here's How to Find the Real One",
    "url": "https://decrypt.co/151632/scammers-rush-to-exploit-paypals-pyusd-launch-flooding-uniswap-with-fake-tokens",
    "description": "The announcement of PayPal's PYUSD has sparked a wave of imposter tokens on Uniswap, exploiting the hype."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-07T21:00:00.000Z",
    "title": "Bitcoin funds see weekly outflows of $111M, most since March: CoinShares",
    "url": "https://cointelegraph.com/news/bitcoin-funds-weekly-outflows-111m-most-since-march-coin-shares",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/08f81b20-f435-4db1-8570-051e3b8f2bd4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Solana bucked the trend, with its $9.5 million in inflows taking the top spot over the past week. </p>\n                    <p><p>Weekly cryptocurrency asset flows for the week ending Aug. 4 reconciled at $107 million in outflows, continuing a three-week negative trend totaling $134.8 million.</p><p>Once again, the lion’s share of movement was attributed to Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). With $111 million in outflows, Bitcoin funds negated the majority of inflows for the week. </p><p>According to CoinShares’ Digital Asset Fund Flows weekly report, this <a href=\"https://blog.coinshares.com/volume-143-digital-asset-fund-flows-weekly-report-6d46f78754c\" target=\"_blank\" rel=\"noopener nofollow\">indicates</a> further “profit taking” on the heels of the previous cycle’s gains. For the month leading up to the recent spate of outflows, <a href=\"https://cointelegraph.com/news/bitcoin-crypto-investment-funds-fourth-straight-week-inflows-coinshares\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-crypto-investment-funds-fourth-straight-week-inflows-coinshares/amp\">inflows of $742 million</a> into crypto funds were seen, with 99% of that coming from Bitcoin. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f8291574-ab18-4404-a5d0-f662493526ad.jpg\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Source: <a href=\"https://blog.coinshares.com/volume-143-digital-asset-fund-flows-weekly-report-6d46f78754c\" target=\"_blank\" rel=\"noopener nofollow\">CoinShares</a></em></figcaption></figure><p>Weekly trading volumes in investment products saw a dip below the year-to-date average, according to the report, with broader on-exchange market volumes down 62% against the relative average. </p><p>Regionally, only Australia and the United States show inflows with $0.3 million and $0.2 million incoming, respectively. The largest regional outflows came from Canada with $70.8 million and Germany with $28.5 million. </p><p>Despite Bitcoin’s outflows, the weekly total was somewhat buoyed by inflows from Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) in the amount of $9.5 million, up from last week’s total of $0.6 in inflows. XRP (<a href=\"https://cointelegraph.com/xrp-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/xrp-price-index\">XRP</a>) investment products also saw inflows of $0.5 million. </p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) funds continue their negative trend, adding $5.9 million in outflows to the previous week’s $1.9 million. This entirely offsets prior inflows in the amount of $6.6 million and further separates it from Solana’s current bullish trend. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">➡️ <a href=\"https://twitter.com/search?q=%24SOL&src=ctag&ref_src=twsrc%5Etfw\">$SOL</a> recorded the largest inflows, totaling US$9.5m, indicating a growing positive sentiment towards <a href=\"https://twitter.com/hashtag/altcoins?src=hash&ref_src=twsrc%5Etfw\">#altcoins</a>. Other notable mentions include <a href=\"https://twitter.com/search?q=%24XRP&src=ctag&ref_src=twsrc%5Etfw\">$XRP</a> and <a href=\"https://twitter.com/search?q=%24LTC&src=ctag&ref_src=twsrc%5Etfw\">$LTC</a>.<br><br>4/5 <a href=\"https://t.co/0v8V9DjwRQ\">pic.twitter.com/0v8V9DjwRQ</a></p>— CoinShares (@CoinSharesCo) <a href=\"https://twitter.com/CoinSharesCo/status/1688537561319297024?ref_src=twsrc%5Etfw\">August 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While Bitcoin remains up for the year compared to its opening in January, many experts believe some of the perceived sideways movement that’s kept it mostly beneath $30,000 since April is due to market uncertainty.</p><p>As Cointelegraph reported, data from Switzerland-based investment adviser 21e6 Capital AG shows that Bitcoin “hodlers,” those who held funds in BTC, <a href=\"https://cointelegraph.com/news/btc-hodlers-outperformed-crypto-funds-by-69-in-h1-2023-21e6-capital-ag\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/btc-hodlers-outperformed-crypto-funds-by-69-in-h1-2023-21e6-capital-ag/amp\">outperformed crypto funds by 69%</a> in the first half of 2023. </p><p>The <a href=\"https://cointelegraph.com/news/ftx-ftx-us-and-alameda-file-for-chapter-11-bankruptcy-in-us-sbf-resigns\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ftx-ftx-us-and-alameda-file-for-chapter-11-bankruptcy-in-us-sbf-resigns/amp\">2022 implosion of FTX</a> and regulatory and legal uncertainty for numerous other exchanges may have tempted crypto funder investors to increase the amount of cash-on-hand versus invested funds, thus causing the current decay. </p><p>The report from 21e6 Capital AG did note that investor sentiment currently appears to be slightly up versus the first half of 2023. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/european-digital-asset-manager-coinshares-revenue-up-q2\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/european-digital-asset-manager-coinshares-revenue-up-q2/amp\"><strong><em>European digital asset manager CoinShares’ revenue up 33% in Q2</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-07T20:44:57.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting the Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Cryptocurrency trading activity via Telegram bots has surged in recent weeks, according to new research from Binance. PayPal launched a new US dollar-backed stablecoin called PayPal USD (PYUSD) — issued by Paxos Trust Co. Meanwhile, MakerDAO's new crypto lending platform Spark Protocol has garnered the ire of crypto privacy adv after blocking VPN users from accessing its website. </p><h2>Telegram crypto bots see a surge in activity </h2><p>Telegram bots are leaving a dent on the cryptocurrency market, with daily trade volumes from these software applications hitting a record high in recent weeks.</p><p>The cumulative trade volumes of crypto trading bots has reached $190 million as of early August, <a href=\"https://cointelegraph.com/news/telegram-crypto-bots-gain-momentum-binance-research\">according to new research from Binance</a>. The single-day record for crypto trading volumes emanaging from chatbots was $10 million on July 23. According to Binance, user activity also reched a record in July, with more than 6,000 daily unique users. Total chatbot revenues on Telegram have reached 15,500 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), or roughly $28 million, according to report author Jie Xuan Chua.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/17d90783-6265-43a9-aadd-3423fa262549.jpg\"  /><figcaption style=\"text-align: center;\"><em>Year-to-date trading volume on Telegram bots has surged. Source: Binance Research</em></figcaption></figure><p>“By offering users a relatively seamless way to execute transactions, bots have the potential to carve out their own niche in the crypto ecosystem,” Chua wrote, adding that Telegram bots already offer a range of services to crypto users, including trading, airdrop farming and automated token operations. </p><h2>Breaking: Paypal launches PYUSD stablecoin for payment</h2><p>American financial technology company PayPal launched a new crypto stablecoin called PayPal USD (PYUSD) — issued by Paxos Trust Co. and fully backed by United States dollar deposits, short-term Treasuries and similar cash equivalents.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3431d815-6f90-4c9a-88f0-ad66c1a21698.png\"  /><figcaption style=\"text-align: center;\"><em>PayPal USD compatibility with crypto exchanges, WEb3 apps and crypto wallets. Source: PayPal</em></figcaption></figure><p>The payment processor claimed that the new stablecoin will soon be availble as a mode of payment for avrious purchases and will be transferable between PayPal and Venmo.</p><p>The firm claimed that the regulatory environment around stablecoin in the U.S. is gradually “progressing toward more clarity” and thus there is a demand for an alternate stablecoin from what is currently available in the market.</p><h3>Controversy as MakerDAO’s Spark Protocol blocks users with VPNs</h3><p>MakerDAO’s recently launched lending platform, Spark Protocol, has <a href=\"https://cointelegraph.com/news/makerdao-spark-protocol-block-vpn-users-controversy\">sparked criticism after blocking users</a> from using VPNs to access the website. </p><p>Cointelegraph found that attempts to access the Spark Protocol website while a VPN is in use will be met with an error: “Accessing this website via VPN is not allowed.”</p><p>In an Aug. 6 tweet, DeFi analyst Chris Blec was among those <a href=\"https://twitter.com/ChrisBlec/status/1688244725512310785\" target=\"_blank\" rel=\"noopener nofollow\">saying</a> he was “disgusted” with the decision, highlighting it effectively acts as a blanket ban on VPNs across the globe, not just in the U.S.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I rarely get as disgusted as I am right now with MakerDAO&#39;s Spark Protocol.<br><br>It&#39;s one thing to block US residents. <br><br>It&#39;s a whole other thing to block anyone in the entire world who is using a VPN for privacy.<br><br>This isn&#39;t just govt cuckery.<br><br>This is an actual war on privacy. <a href=\"https://t.co/dUbsMeVzbZ\">pic.twitter.com/dUbsMeVzbZ</a></p>&mdash; Chris Blec (@ChrisBlec) <a href=\"https://twitter.com/ChrisBlec/status/1688244517525139456?ref_src=twsrc%5Etfw\">August 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The measure appears to be linked to Maker’s attempt to restrict United States users from accessing the crypto lending platform, <a href=\"https://www.sparkprotocol.io/terms-of-use.html\" target=\"_blank\" rel=\"noopener nofollow\">discussed</a> in a May 9 update to Spark Protocol’s terms of service that warns against the use of VPNs to circumvent the block. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T21:07:57.000Z",
    "title": "Steadefi hacked for $334K – all funds in peril",
    "url": "https://www.cryptopolitan.com/steadefi-hacked-for-334k-all-funds-in-peril/",
    "description": "The decentralized finance (DeFi) application known as Steadefi fell victim to a noteworthy exploit, resulting in a staggering loss of at least $334,000 on August 7th. This ongoing attack has dealt a severe blow to the app&#8217;s security infrastructure, leading to a state of heightened risk for all funds involved. This alarming revelation emerged from ... <a title=\"Steadefi hacked for $334K &#8211; all funds in peril\" class=\"read-more\" href=\"https://www.cryptopolitan.com/steadefi-hacked-for-334k-all-funds-in-peril/\" aria-label=\"More on Steadefi hacked for $334K &#8211; all funds in peril\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T20:56:19.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and platform they need to build blockchain solutions. At this time, we can only make educated guesses about ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T20:54:09.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-07T21:00:41.000Z",
    "title": "These Bitcoin Metrics Are At Important Retests, Will Bullish Trend Prevail?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-metrics-important-retests-bullish-trend-prevail/",
    "description": "On-chain data shows two Bitcoin indicators are currently retesting levels that have historically been relevant for the market&#8217;s course. Bitcoin NUPL For Both Short-Term &#38; Mid-Term Holders Is Neutral Currently As pointed out by an analyst in a CryptoQuant post, the BTC NUPL has been retesting crucial levels recently. The &#8220;Net Unrealized Profit/Loss&#8221; (NUPL) is a metric that keeps track of the net amount of profit or loss that investors are holding currently. This indicator works by looking through the on-chain history of each coin in circulation to see what price it was last moved at. If this previous transfer price for any coin was less than the current spot price of Bitcoin, then that particular coin is holding a profit right now. The NUPL counts this profit that the coin is holding in the unrealized profit. Similarly, the loss that underwater coins are holding gets included in the unrealized loss. The metric then takes the difference between these two numbers to find the net profit/loss status of the entire market. In the context of the current discussion, the entire market isn&#8217;t of interest, however, only specific sections of it are. In particular, two BTC cohorts called the &#8220;short-term holders&#8221; (STHs) and the &#8220;mid-term holders&#8221; (MTHs) are of relevance. The STHs include all investors who bought their coins within the last six months, while the MTHs are those who have been holding their coins since at least six months ago and at most 2 years ago. First, here is a chart that shows the trend in the Bitcoin NUPL specifically for the STHs: Looks like the value of the metric has approached zero recently &#124; Source: CryptoQuant As displayed in the above graph, the Bitcoin STH NUPL has been positive throughout this rally that first started back in January of this year. Generally, this is the case in bullish trends, as the STHs are those who bought relatively recently, so any price rises immediately reflect on their profit/loss status. What&#8217;s more significant, however, is the indicator&#8217;s relationship with the zero mark. At this line, the STHs as a whole are neutral, meaning that their unrealized losses equal their unrealized profits. Usually, whenever the metric retests this line from above during bullish trends, it finds support and the price feels a bullish effect. This could be seen working in action during this rally alone, as the rebounds in March and June both occurred when the STH NUPL approached this line. Related Reading: Bitcoin NVT Shows Bearish Crossover, Price Drop Incoming? From the chart, it&#8217;s visible that the metric has once again fallen to this line recently. This retest may be quite important, as a plunge below could mean a reversal back toward a bearish regime. In the below graph, it&#8217;s also visible that the MTH NUPL is retesting the same line, although this indicator is approaching it from the negative zone. The metric is retesting the break-even line &#124; Source: CryptoQuant The MTHs had been sitting in losses until now, but they are on the verge of transitioning back into profits currently. If the metric can manage to break through the level, then it would be a positive sign for the rally, as the bullish trend has historically continued whenever these investors have come back above water. Related Reading: Will Bitcoin Rebound Anytime Soon? Here’s What On-Chain Data Says The break-even line providing resistance to Bitcoin, however, is also a possibility, in which case the asset would feel a bearish effect. It now remains to be seen how this retest, as well as the one of the STH NUPL, would pan out in the coming days. BTC Price At the time of writing, Bitcoin is trading around $29,000, down 1% in the last week. BTC continues to move sideways &#124; Source: BTCUSD on TradingView Featured image from Michael Förtsch on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  }
]