[
  {
    "source": "Cointelegraph",
    "date": "2024-02-06T02:47:55.000Z",
    "title": " ‘Generated’ fake IDs claimed to pass crypto exchange KYC are selling for $15 ",
    "url": "https://cointelegraph.com/news/ai-generated-fake-ids-pass-crypto-exchange-kyc-onlyfake",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMDkzNWVhOWUtZTRlMy00ZDk0LWIyNDctOTgyYTI0MjNkYjAzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The $15 AI-generated fake IDs are reportedly being used to fool crypto exchange identity checks, potentially giving crypto hackers and scammers a new edge.</p>\n                    <p><p>A new service claiming to use artificial intelligence “neural networks” and “generators” to create fake driver licenses and passports has reportedly succeeded in passing Know Your Customer (KYC) checks on multiple crypto exchanges.</p><p>The cost? Only $15 a pop. </p><p>The site, OnlyFake, generates realistic fake driver’s licenses and passports from 26 countries, including the United States, Canada, Britain, Australia and multiple European Union countries and takes payment in multiple cryptocurrencies through Coinbase’s commercial payments service.</p><p><a href=\"https://cointelegraph.com/news/ai-generated-fake-ids-pass-crypto-exchange-kyc-onlyfake\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-06T03:00:15.000Z",
    "title": "Bitcoin ETFs: Issuers Battle To Attract Investors With Google Ad Campaigns",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-etfs-issuers-battle-to-attract-investors-with-google-ad-campaigns/",
    "description": "After the approval and launch of spot Bitcoin ETFs (Exchange-Traded Funds) by the US Securities and Exchange Commission (SEC), ETF issuers have extensively promoted their products on different media platforms to attract retail investors. Related Reading: Why Is Bitcoin Price Not Going Up Despite The ETFs? Expert Explains Bitcoin ETF Issuers Looking To Attract Retail Investors At the end of January, giant technology company Google changed its advertisement policy to allow crypto fund managers to advertise crypto products in the search engine. Beginning on January 29, the company would “update the Cryptocurrencies and related products policy to clarify the scope and requirements for the advertisement of Cryptocurrency Coin Trusts.” This decision followed the approval of 11 spot Bitcoin ETFs on January 10 by the US SEC, a significant decision that marked a milestone for the crypto industry and investors, as the approval by the US regulator provided more legitimacy to digital assets and the flagship cryptocurrency in the eyes of traditional investor. As several members of the community reported, the asset managers that have issued ETFs launched their ads on Google following the policy change. @BlackRock, @Fidelity, @Grayscale and @vaneck_us are all using google ads to promote their ETFs. The #Bitcoin Spot ETF approval is bigger than you think, we have just got started pic.twitter.com/9WpBenXYwo &#8212; Alessandro Ottaviani (@AlexOttaBTC) February 1, 2024 BlackRock, Fidelity, Grayscale, VanEck, Invesco, and Bitwise are among the ETF issuers that have taken the biggest search platform in the world to advertise their exchange-traded products. The news seems to have fueled a bullish sentiment for crypto investors due to the exponential increase of exposure that Bitcoin ETFs and the cryptocurrency sector will receive from the tech giant’s platform.  Although most issuers have taken an interest in advertising their products on Google after the policy change, it’s worth mentioning that Valkyrie Digital Assets hasn’t taken the same route as its counterparts, and it’s not using Google ads to advertise its ETF. A Financial Times report highlights Invesco’s positive reception to Google’s ads update. A spokesperson told the news media outlet: We believe Google — among other search engines — is an important piece of our larger marketing strategy. Will Facebook And Instagram Follow Google’s Steps? The advertisement battle between the ETF issuers has also taken advantage of traditional media. Bitwise has its “The Most Interesting Man in the World” ad campaign on mainstream TV, and Blackrock projects its Ads on different buildings across the US, including buildings near Wall Street in New York. #BitcoinETF Being Advertised On Mainstream TV 👀 Is the #bullrun officially BACK??🚨📈 pic.twitter.com/dlBw5cjCuz &#8212; Satoshi&#39;s Sip (@SatoshisSip) February 4, 2024 Now, the ads war has broadened as social media platforms have started to show interest in advertising the newly approved crypto-based investment products. Nate Geraci, President of the ETF Store Inc., shared on his X account a fragment of a Wall Street Journal report explaining that Facebook and Instagram may soon allow spot Bitcoin ETF ads. The report highlighted the comments from a spokesman for Alphabet, Google’s parent company, which began approving ads in the US for Bitcoin ETFs on its platforms, including Google Search and YouTube. Similarly, Facebook and Instagram are likely to follow Google’s steps soon. Per the report, a spokesperson for the Parent Company Meta Platforms said that the company is updating its US advertisement policies after the US SEC’s decision. Geraci considers that there’s “no bigger boomer honeypot than Facebook.” Notably, the social media platform could help broaden the reach of Bitcoin ETFs as it holds a large pool of older users. The potential interest of older users in expanding their investment portfolios and being exposed to digital assets like Bitcoin, without the need to self-custody their keys, has been a significant advertisement component of the ad campaigns from the ETF issuers. Related Reading: Analyst Predicts Shocking Bitcoin Price By Year-End Based On ETF Inflows Bitcoin is trading at $42,788.4 in the hourly chart. Source: BTCUSDT on TradingView.com Feature image from Unsplash.com, Chart from TradingView.com"
  }
]