[
  {
    "source": "Decrypt",
    "date": "2024-03-09T00:11:02.000Z",
    "title": "Marilyn Monroe to Be Resurrected With ‘Biological AI’",
    "url": "https://decrypt.co/220927/digital-marilyn-monroe-ai-startup",
    "description": "San Francisco-based Soul Machines brings the Hollywood star to digital life as an interactive avatar."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-09T00:30:13.000Z",
    "title": "Financial Journalist Alan Kohler: Bitcoin Is an ‘Insurrection’",
    "url": "https://news.bitcoin.com/financial-journalist-alan-kohler-bitcoin-is-an-insurrection/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/3f8ca451-2789-49f0-a155-c710cccae377-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Financial Journalist Alan Kohler: Bitcoin Is an &#039;Insurrection&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/3f8ca451-2789-49f0-a155-c710cccae377-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/3f8ca451-2789-49f0-a155-c710cccae377-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/3f8ca451-2789-49f0-a155-c710cccae377-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/3f8ca451-2789-49f0-a155-c710cccae377-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/3f8ca451-2789-49f0-a155-c710cccae377-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/3f8ca451-2789-49f0-a155-c710cccae377-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/3f8ca451-2789-49f0-a155-c710cccae377.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Alan Kohler, an Australian financial journalist, stated Bitcoin is an &#8220;insurrection,&#8221; given the tightly controlled rules that control the conditions behind its operation. Kohler explained that while bitcoin crashed tremendously in 2022, it constituted a &#8220;subversion to the whole basis of free-market financial capitalism&#8221; due to its regulated supply and controlled issuance, Adam Kohler States [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-09T00:31:42.000Z",
    "title": "Coinbase’s talent acquisition approach lauded by Solana founder",
    "url": "https://www.cryptopolitan.com/coinbases-talent-acquisition-approach-lauded-by-solana-founder/",
    "description": "Anatoly Yakovenko, the co-founder of Solana, has publicly praised Brian Armstrong, the CEO of Coinbase, for his innovative approach to hiring practices. This commendation comes in light of Coinbase&#8217;s new policy, which necessitates the approval of either the CEO or COO for every new hire. Yakovenko&#8217;s acknowledgment on social media underscores the significance of leadership [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-09T00:10:54.000Z",
    "title": "Crypto Analyst Says XRP Price Could Rocket 2,300% To $14.6, Here’s How",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-rocket-2300-to-14-6/",
    "description": "The XRP price has now managed to position itself above the $0.6 psychological level, as the entire crypto market waddles in bullish action in the past month. Popular crypto analyst Dark Defender has predicted an interesting price point for XRP, revealing that the crypto could reach $14.61 if the XRP/BTC pair reaches a record high.   XRP Could Skyrocket 2,300% Dark Defender&#8217;s recent analysis of XRP&#8217;s price trajectory is based on its past performance against Bitcoin on the XRP/BTC pair. A deep dive into the XRP/BTC chart shared on X by the analyst reveals that XRP has been underperforming against Bitcoin since the middle of 2023. XRP has been down 60% against Bitcoin since August 2023. Recent market dynamics have further exacerbated its underperformance against Bitcoin, as Bitcoin continues to push against various price levels to reach a new all-time high. Related Reading: 14-Year Old Dormant Bitcoin Wallet Wakes Up To Crash BTC Price Interestingly, Dark Defender noted that the price action of the pair has now reached a support which will determine XRP&#8217;s price trajectory in the coming months. The so-called support has the characteristics of the formation of higher lows since 2015 and is now at the 0.00000914 level. The price chart noted a bounce over this support to usher in an incoming breakout of epic proportions to the current high of 0.00024351. The last time a bounce happened, XRP would go on to overperform Bitcoin by over 5,000% throughout 2017 and early 2018. &#8220;It will be the awakening of 6 years,&#8221; the analyst said. We had the Orange and the Green Arrows on the #XRP/#BTC pair. We reached the Support, Ultimate. The #Purple Arrow is here. It will be the awakening of 6 years. Some can see, &#38; some can&#8217;t. pic.twitter.com/yyqhwjopiX — Dark Defender (@DefendDark) March 6, 2024 When asked for an XRP price point, Dark Defender clarified that the XRP/BTC pair increases only when XRP appreciates against BTC. In the scenario that BTC starts to perambulate around the $60,000 price level, a surge in the XRP/BTC to the 0.00024351 level would relate to XRP reaching $14.61. In the scenario that Bitcoin reaches $100,000 and sticks around this price level, XRP could trade for over $20 with the same all-time high on the XRP/BTC pair.  With XRP now trading at $0.6205, a surge to $14.61 and $20 would mean an increase of 2,250% and 3,120%, respectively, from the current price level.  Continued Bullish Sentiment For XRP Price? Other crypto analysts have predicted bullish price points for XRP in the near future. For example, Crypto analyst Jaydee highlighted XRP breaking out of a six-year trendline which could mean a further move to the upside. Related Reading: Crypto Analyst Uses Historical Data To Show When The Bitcoin Price Will Reach $207,000 In another technical analysis using the Elliott Waves theory, Dark Defender predicted XRP to reach $1 in March, a level that it hasn&#8217;t attained since May 2021. XRP price resumes uptrend &#124; Source: XRPUSDT on Tradingview.com Featured image from CNBC, chart from Tradingview.com"
  }
]