[
  {
    "source": "Cointelegraph",
    "date": "2023-06-27T18:00:00.000Z",
    "title": "Over $204M was lost in Q2 DeFi hacks and scams: Report",
    "url": "https://cointelegraph.com/news/over-204m-was-lost-in-q2-defi-hacks-and-scams-de-fi-rekt-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/f2cb2d98-35a8-43a1-98b5-f19046e0161e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>More than $208.5 million was lost initially, but approximately $4.5 million was recovered, making the total amount of unrecovered funds over $204 million.</p>\n                    <p><p>Over $204 million was lost in decentralized finance (DeFi) hacks and scams in the second quarter of 2023, according to a June 27 report from Web3 portfolio app De.Fi. </p><p>The report, titled “Q2 De.Fi Rekt Report,” was partially based on data from De.Fi’s “Rekt Database.” Over $208.5 million was initially lost during the quarter, but $4.5 million was recovered through prosecutions, deals with hackers and other recovery methods.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/73d43227-5769-48c0-a220-a02c44d4b302.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Funds lost and recovered in Q2 2023. Source: De.Fi</em></figcaption></figure><p>According to the report, the number of DeFi hacks in Q2 rose by “almost 7 times” year-over-year, with 117 incidents during the period compared with only 17 in the same quarter of 2022. A total of over $665 million was lost during the first half of 2023.</p><p>The top five hacks of the second quarter were against Atomic Wallet, Fintoch, MEV-Boost, Bitrue and GDAC. The June 3 Atomic Wallet exploit <a href=\"https://cointelegraph.com/news/atomic-wallet-exploited-users-report-loss-of-entire-portfolios\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/atomic-wallet-exploited-users-report-loss-of-entire-portfolios/amp\">was responsible for $35 million</a>, or around 17% of the total. Fintoch users <a href=\"https://cointelegraph.com/news/project-takes-off-with-31-6m-in-alleged-exit-scam\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/project-takes-off-with-31-6m-in-alleged-exit-scam/amp\">lost $30.6 million</a> from its alleged rug pull, and the MEV-Boost attack <a href=\"https://cointelegraph.com/news/sandwich-trading-bots-lose-bread-and-butter-in-25m-exploit\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sandwich-trading-bots-lose-bread-and-butter-in-25m-exploit/amp\">was responsible for $26.1 million</a>. Together, these three attacks resulted in over 45% of the total losses for Q2.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/defi-protocol-sturdy-finance-offers-100k-bounty-to-hacker-if-funds-are-returned\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/defi-protocol-sturdy-finance-offers-100k-bounty-to-hacker-if-funds-are-returned/amp\"><strong>Sturdy Finance offers $100K bounty to hacker if funds are returned</strong></a></em></p><p>De.Fi reported that the most common cause of losses was “access control issues,” or issues where an attacker gained unauthorized control of a wallet. This was responsible for $75.8 million of losses, or a quarter of the total. The second most common cause was exploits, totaling $55.3 million. Users lost $47.3 million through rug pulls or exit scams in Q2, as well.</p><p>Losses from DeFi hacks and scams were actually smaller in Q2 than in Q1, with CertiK reporting in April that <a href=\"https://cointelegraph.com/news/here-s-how-much-is-lost-to-crypto-hacks-and-exploits-in-q1-2023\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/here-s-how-much-is-lost-to-crypto-hacks-and-exploits-in-q1-2023/amp\">over $320 million was lost</a> from January to March.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-27T18:00:00.000Z",
    "title": "Investors Flock to Uwerx (WERX) & SafePal (SFP) For Gains",
    "url": "https://cryptodaily.co.uk/2023/06/investors-flock-to-uwerx-werx-safepal-sfp-for-gains",
    "description": "<p>The world of cryptocurrency investing is witnessing a surge of interest as investors flock to tokens like Uwerx and SafePal (SFP) in search of profitable opportunities.</p>\n<p>These two tokens have captured the attention of seasoned traders and crypto newbies, drawing them in with the promise of potential gains.</p>\n<p>In this article, we delve into the growing popularity of Uwerx and SafePal (SFP), exploring their unique features and the factors driving investor enthusiasm.</p>\n<p>&gt;&gt;BUY WERX TOKENS NOW&lt;&lt;</p>\nUwerx (WERX) Presale Gains Attracts Investors&rsquo; Appeal\n<p>With a host of groundbreaking features designed to enhance workflow, Uwerx is poised to redefine the freelance landscape and propel the industry to new heights. There are a number ofreasons why investors are flocking to Uwerx for gains.</p>\n<p>The project has strong fundamentals. Uwerx is a well-designed platform with a clear vision for the future of freelancing. The team has a proven track record in the industry. The project has attracted a large and active community with 7,000 sign-ups, over 1,639 Twitter followers, and a robust Telegram community boasting more than 1,803 members.</p>\n<p>The Uwerx presale has been hugely successful, with over 30 million tokens sold through Stages 1 to 4. This shows strong demand for the project and bodes well for the future price of WERX tokens. With Uwerx's presale currently in Stage 5, there is no better time to acquire tokens. WERX tokens are up for $0.041 per token with a 15% bonus on each purchase.</p>\n<p>Investors are also intrigued by the project's potential for growth. The freelancing market is growing rapidly, and Uwerx is well-positioned to capitalize on this growth. The platform offers a number of exclusive features. This has positioned it to become the go-to platform for freelancers and clients.</p>\n<p>The WERX token has a number of attractive features, including a limited supply, a 25-year lockup period, locked team tokens, and the Uwerx Vault that allows users to stake their tokens securely. These features make WERX tokens a valuable asset for investors. If you are looking for a cryptocurrency with the potential to make significant gains, Uwerx is a project worth considering.</p>\n<p>The Uwerx platform is still in development but has already made significant progress with the release of its Alpha platform and the imminent transition to the Beta platform. This shows that the team is committed to the project, and it gives investors confidence in the future of Uwerx.</p>\n<p>&gt;&gt;BUY WERX TOKENS NOW&lt;&lt;</p>\nSafePal (SFP) Price Rise Ignites Investor's Interest \n<p>SafePal (SFP) is a leading provider of hardware wallets, considered the most secure way to store cryptocurrencies. SafePal (SFP) is a hardware wallet that lets users securely store their cryptocurrencies offline.</p>\n<p>SafePal (SFP) has a growing user base. SafePal (SFP) has a growing user base, which is increasing the demand for its tokens. The more users that SafePal has, the more valuable SFP tokens become.</p>\n<p>SafePal (SFP) is a utility token that can be used to pay for fees on the SafePal platform. This gives SFP tokens intrinsic value, as they are needed to use the platform. Additionally, the SafePal(SFP) team has implemented a number of mechanisms to make SafePal (SFP) a deflationary token. This means the SafePal (SFP) token supply constantly decreases, making them more valuable over time.</p>\n<p>Overall, these factors drive investors to SafePal (SFP) and Uwerx. Both projects have strong teams behind them and a rapidly growing user base and have utility tokens. These factors make SafePal (SFP) and Uwerx promising investments for the future.</p>\n<p>SafePal (SFP) is valued at $0.4827, with a trading volume of $11,728,170 and a market cap of $179,131,955. Crypto analysts predict SafePal (SFP) will rise to $0.522 and that Uwerx will cross the $1.5 mark by Q1-Q2 2024.</p>\n<p>Consider participating in the presale now, as the price is expected to rise from $0.0415 to $0.047725. To take advantage of the potential yield, it is recommended to place your orders before Wednesday, 28th at 18:00. Orders submitted after this time will be executed at the corresponding price.</p>\n<p>Take advantage of the 15% Bonus. Join the Uwerx Revolution Now!</p>\n<p class=\"s10\">Presale: &nbsp;invest.uwerx.network</p>\n<p class=\"s10\">Telegram: https://t.me/uwerx_network</p>\n<p class=\"s10\">Twitter: https://twitter.com/uwerx_network</p>\n<p class=\"s10\">Website: https://www.uwerx.network/</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-27T18:00:00.000Z",
    "title": "Bitcoin Price Analysis:  More Advances from 29900 - 28 June 2023",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-price-analysis-more-advances-from-29900-28-june-2023",
    "description": "<p>BTC/USD Advances from 30342 Technicals:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 28 June 2023</p>\n<p>Bitcoin (BTC/USD) sought to add to recent gains early in the Asian session as the pair reached the 30782.06 area before consolidating some advances, the latest renewal of upside pressure that strengthened around the 29900 area.&nbsp; Bulls continue to eye the 30994.30 area as an upside hurdle that represents the 23.6% retracement of the recent appreciating range from 29539.57 to 31443.67.&nbsp; Buying pressure also recently intensified just above the 30198.14 area and 29863.96 area, retracement levels associated with buying pressure that rallied around the 26165.98 and 24750 areas.&nbsp; &nbsp;The pair&rsquo;s recent print around the 31443.67 area was a twelve-month high and test of an upside price objective associated with buying pressure that strengthened around the 26637.41 area.&nbsp; &nbsp;Stops were also recently elected above the 30127.80 area during the ongoing appreciation, an upside price objective associated with historical buying pressure that emerged around the 15460 and 19568.52 areas.</p>\n<p>Stops were also triggered above additional upside price objectives around the 29068, 29159, 29458, 30088, 30200, 30292, and 30477 levels.&nbsp; Additional upside price objectives include the 31737, 32125, and 33569 areas.&nbsp; Stops are cited above additional upside price objectives around the 31674, 32043, 34531, and 34658 areas.&nbsp; Following recent upside price activity, areas of technical support and potential buying pressure include the 30192, 29863, 29423, 28886, 28179, 28096, and 27293 areas.&nbsp; Technicians are closely watching to see how much technical support develops around the 28095.44 area, representing the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bullishly indicating above the 100-bar MA (4-hourly)&nbsp;and&nbsp;above the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bullishly indicating above the 100-bar MA (hourly) and above the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 29365.77 and the&nbsp;50-bar MA&nbsp;(Hourly) at 30400.23.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bearishly below MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bullishly above MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-27T18:00:45.000Z",
    "title": "Ran Neuner Believes Blackrock’s Bitcoin ETF Could Double Price Next Year, Dismisses ‘Malicious Intent’ Speculations",
    "url": "https://news.bitcoin.com/ran-neuner-believes-blackrocks-bitcoin-etf-could-double-price-next-year-dismisses-malicious-intent-speculations/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/br-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ran Neuner Believes Blackrock&#039;s Bitcoin ETF Could Double Price Next Year, Dismisses ‘Malicious Intent’ Speculations\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/br-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/br-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/br-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/br-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/br-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/br-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/br.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Following Blackrock, the largest asset manager globally, filing for a spot bitcoin exchange-traded fund (ETF) with the U.S. Securities and Exchange Commission (SEC), Ran Neuner, host of Crypto Banter, stated during an interview with Michelle Makori, lead anchor for Kitco News, that he believes the asset manager has &#x201C;no malicious intent.&#x201D; Neuner additionally expressed his [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T18:03:42.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T18:02:27.000Z",
    "title": "Geologists Utilize Artificial Intelligence to Enhance Landslide Prediction",
    "url": "https://www.cryptopolitan.com/artificial-intelligence-enhance-landslide-prediction/",
    "description": "Geologists at UCLA have developed a groundbreaking technique that utilizes artificial intelligence (AI) to improve the prediction of landslides. This innovative method, described in a paper published in Communications Earth &#38; Environment, offers enhanced accuracy and interpretability compared to traditional predictive models. By harnessing the power of AI, geologists aim to protect lives and property ... <a title=\"Geologists Utilize Artificial Intelligence to Enhance Landslide Prediction\" class=\"read-more\" href=\"https://www.cryptopolitan.com/artificial-intelligence-enhance-landslide-prediction/\" aria-label=\"More on Geologists Utilize Artificial Intelligence to Enhance Landslide Prediction\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T18:00:10.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T18:00:23.000Z",
    "title": "Meme Coins like LADYS are Pumping Again, Avorak can Tell Us if this is a Good or Bad Sign",
    "url": "https://www.crypto-news-flash.com/meme-coins-like-ladys-are-pumping-again-avorak-can-tell-us-if-this-is-a-good-or-bad-sign/?utm_source=rss&utm_medium=rss&utm_campaign=meme-coins-like-ladys-are-pumping-again-avorak-can-tell-us-if-this-is-a-good-or-bad-sign",
    "description": "Memecoins have earned a place in the crypto market despite their lack of utility. These tokens usually have massive traction and are associated with much hype from their community members. Although they tend to make huge swings, most die out due to a lack of credibility, utility, and real-time applications. A few, like LADYS, have [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T17:53:57.000Z",
    "title": "Breaking News: $195B Banco Santander Embraces Bitcoin – Will We See a New ATH This Year?",
    "url": "https://www.crypto-news-flash.com/breaking-news-195b-banco-santander-embraces-bitcoin-will-we-see-a-new-ath-this-year/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-news-195b-banco-santander-embraces-bitcoin-will-we-see-a-new-ath-this-year",
    "description": "Spain&#8217;s largest bank is exploring Bitcoin, defining digital assets as a transformative technology. The bank has shared an informative article on the fundamentals, benefits, and implications of Bitcoin. Santander, Spain&#8217;s largest bank is taking an interest in Bitcoin. The multinational financial services company that serves 5.2 million customers and with over $147 billion in assets [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-27T18:05:43.000Z",
    "title": "Venture Capitalist That Called Crypto Bottom Predicts Institutional Floodgates Will Open Up As Regulated Systems Appear",
    "url": "https://dailyhodl.com/2023/06/27/venture-capitalist-that-called-crypto-bottom-predicts-institutional-floodgates-will-open-up-as-regulated-systems-appear/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Andreessen-Reveals-Crypto-Playbook-1.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Andreessen-Reveals-Crypto-Playbook-1.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/Andreessen-Reveals-Crypto-Playbook-1.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Andreessen-Reveals-Crypto-Playbook-1.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/Andreessen-Reveals-Crypto-Playbook-1.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/Andreessen-Reveals-Crypto-Playbook-1.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/Andreessen-Reveals-Crypto-Playbook-1.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The investor who accurately called the bottom of the bear market late last year says that large institutions will ultimately arrive at crypto markets sooner than we think. While a bear market and anti-crypto policies have created skepticism that traditional finance firms will ever participate in crypto, Placeholder partner Chris Burniske says the regulatory clarity [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/27/venture-capitalist-that-called-crypto-bottom-predicts-institutional-floodgates-will-open-up-as-regulated-systems-appear/\">Venture Capitalist That Called Crypto Bottom Predicts Institutional Floodgates Will Open Up As Regulated Systems Appear</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]