[
  {
    "source": "Cointelegraph",
    "date": "2024-01-20T17:12:25.000Z",
    "title": " Trezor discloses 66K users affected by phishing attack  ",
    "url": "https://cointelegraph.com/news/trezor-discloses-66k-users-affected-phishing-attack",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNDhjY2Q2YzUtMjU2Ny00Y2YwLTk4NWItYjc0ODdjZDA3Zjc2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Trezor users who have contacted its support team since December 2021 may have been affected by the incident. </p>\n                    <p><p>Hardware wallet Trezor has flagged a security breach that exposed the contact information of nearly 66,000 users, <a href=\"https://blog.trezor.io/trezor-security-update-stay-vigilant-against-potential-phishing-attack-bb05015a21f8\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a Jan. 20 announcement. </p><p>Trezor identified unauthorized access to a third-party support portal on Jan. 17. Users who have interacted with Trezor's support team since December 2021 may have had their data accessed in the incident, said the company.</p><p>\"Although unconfirmed, we consider it our responsibility to inform our affected users of the possibility of their contact details having been exposed, and at risk of a phishing attack,\" noted Trezor. The company said to have emailed all the 66,000 contacts to notify them of the incident.</p><p><a href=\"https://cointelegraph.com/news/trezor-discloses-66k-users-affected-phishing-attack\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-20T17:26:30.000Z",
    "title": "Crypto Analyst Kevin Svenson Predicts 2024 Bitcoin Surge Following S&P 500 Trends",
    "url": "https://www.cryptoglobe.com/latest/2024/01/crypto-analyst-kevin-svenson-predicts-2024-bitcoin-surge-following-sp-500-trends/",
    "description": "In a video published on January 19, 2024, by Kevin Svenson on his YouTube channel, “Kevin Svenson Crypto,” the popular crypto analyst discusses BItcoin’s price action. Current Bitcoin Market Analysis Recent Price Action: Svenson notes that Bitcoin hasn’t seen lower lows since the beginning of December, indicating a relatively stable price action over the past […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-20T17:24:44.000Z",
    "title": "Best Cryptocurrencies Under $1 to Buy As the Crypto Market Evolves",
    "url": "https://cryptodaily.co.uk/2024/01/best-cryptocurrencies-under-1-to-buy-as-the-crypto-market-evolves",
    "description": "Discover the best cryptos under $1 to invest in 2024! Uncover top picks like Cardano, Sei, Blur, Mantle and Bonk, poised for growth in a dynamic crypto landscape shaped by AI integration and tokenization trends. Don’t miss out on these potential game-changers in the evolving world of cryptocurrency!"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-20T17:34:02.000Z",
    "title": "Rollbit Price Prediction 2024-2033:  Is It Time To Buy RLB?",
    "url": "https://www.cryptopolitan.com/rollbit-price-prediction/",
    "description": "Rollbit coin price prediction 2024-2033 Rollbit has quickly become one of the most popular crypto casinos and trading platforms. Launched in 2019, Rollbit offers a wide range of gaming, sports betting, futures trading, and NFT options for users. With no KYC requirements and support for numerous cryptocurrencies, Rollbit provides an easy entry into the world [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-20T17:13:30.000Z",
    "title": "Palworld Dedicated Servers: Easy Setup, Joining, and Customization Guide",
    "url": "https://www.cryptopolitan.com/palworld-dedicated-servers-setup/",
    "description": "Discover the seamless world of Palworld Dedicated Servers and learn how to set up your own server on Steam. "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-20T17:12:51.000Z",
    "title": "Polygon co-founder reveals how to stop inscriptions issues",
    "url": "https://www.cryptopolitan.com/polygon-co-founder-stop-inscriptions-issues/",
    "description": "Blockchain networks, including Arbitrum, zkSync, Avalanche, and others, have encountered performance issues and crashes due to inscriptions—a form of digital collectible created by embedding data into the calldata or witness fields of a blockchain transaction. Polygon’s co-founder, Branden Farmer, suggests that the use of parallelized Ethereum Virtual Machines (EVMs) could potentially resolve these challenges. Polygon [&#8230;]"
  }
]