[
  {
    "source": "NewsBTC",
    "date": "2023-08-31T03:00:01.000Z",
    "title": "Bitcoin To $185,000 if Spot ETF Is Approved: Expert",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-to-185000-if-spot-etf-is-approved-expert/",
    "description": "If the United States Securities and Exchange Commission (SEC) ends up approving a spot Bitcoin exchange-traded fund (ETF) anytime in the coming days or weeks, one expert is confident BTC prices will explode more than 6x to $185,000. As of August 30, BTC is changing hands below $30,000 but remains firm. Bitcoin To $185,000? In a recent CNBC interview, Tom Lee, who regularly comments on Bitcoin prices, said a spot ETF will mop up all daily supply of the world&#8217;s most valuable cryptocurrency, creating an &#8220;imbalance&#8221; that will inevitably drive prices higher. Based on this, demand will significantly outstrip supply, driving prices to $185,000 or higher. Related Reading: Cardano HODLing: Long-Term Holders See 170% Rise In Past Year Bitcoin remains the world&#8217;s largest cryptocurrency by market cap despite the sharp contraction throughout the past 20 months. At peaks, BTC surged to over $69,000 only for sentiment to shift in 2022, triggering a sell-off that saw prices declined more than half, bottoming up from below $16,000 in November 2022. While prices have since recovered, surging over 50% from November 2022 lows to peaking at over $31,000 in late July 2023, the crypto and Bitcoin communities have their eyes on the SEC. The stringent regulator has been adamant, dismissing previous applications for a complex ETF derivative directly tracking Bitcoin prices. While the SEC has approved a Bitcoin Futures ETF that tracks an index aggregating prices from multiple regulated exchanges, the nascent industry demands an spot BTC ETF. SEC Likely To Approve Spot ETF? Following August 29&#8217;s court ruling that supported Grayscale&#8217;s assertion that robust measures are in place for their Bitcoin spot ETF to be free from market manipulation, the community has been ecstatic. The ruling was a loss for the SEC, but the court didn&#8217;t mention or guide the regulator in approving a Bitcoin ETF.  Nonetheless, following the sharp expansion of Bitcoin prices from around $25,800 to as high as $28,000, there is a section of optimists who believe the SEC has little wiggling space and have no option but to greenlight a Bitcoin ETF in the coming weeks if not months. Related Reading: XRP Poised For Bullish Breakout: Inverted Hammer Formation Signals Rise Above $0.8 Resistance On August 30, Eric Balchunas and James Seyffart, two of Bloomberg&#8217;s senior ETF analysts, increased their odds of the SEC approving a spot ETF in 2023 to 75% (up from 65%). If it doesn&#8217;t get approved this year, they estimate that the regulator will likely allow entities to create this product next year since their probability is 95%.  Their confidence stems from the fact that the &#8220;unanimity and decisiveness&#8221; of the recent court ruling in the SEC versus Grayscale case was &#8220;beyond expectations and leaves SEC with &#8220;very little wiggle room.&#8221; Moreover, in their assessment, the SEC has suffered a &#8220;PR&#8221; loss since the ruling was widely covered. Feature image from Canva, chart from TradingView"
  }
]