[
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T11:20:00.000Z",
    "title": "Dev shares how ENS plays a role in decentralized social media",
    "url": "https://cointelegraph.com/news/ens-and-decentralized-social-media-interview",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/18ed1071-ad74-4200-96a4-1eee4e6ea8d0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Makoto Inoue highlighted that Web3 socials are not limited to online platforms but can also be applied offline, putting records of having met people in the blockchain. </p>\n                    <p><p>As decentralized social media becomes one of the central topics at the Buidl Asia event held in South Korea, Cointelegraph spoke with Ethereum Name Service (ENS) developer Makoto Inoue onlineto find out more about Web3 social media, its potential to replace Web2 and the roles of ENS and the metaverse in this new social media paradigm. </p><p>According to Inoue, Web3 is “inherently social and distributed.” The developer highlighted that since it’s built on top of the blockchain, everything is transparent. This makes the blockchain a “social graph,” a graph commonly used to represent the interconnectedness of relationships in an online social network. </p><p>“It's already inherently permissionless and social. That's where ENS fits into. It's transparent but the addresses are human-readable. And by having the ENS name associated, it suddenly becomes a social graph,” he said. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/be00329b-83ef-4698-9c59-9dee6f6b5e37.png\"  /><figcaption style=\"text-align: center;\"><em>ENS developer Makoto Inoue dives deep into Web3 social media. Source: Cointelegraph</em></figcaption></figure><p>The developer added that when there’s a need to make things “easier to understand,” ENS comes in. This leads to the creation of what the developer describes as an “identity trail.” He explained: </p><blockquote>“Wherever people start using blockchain and if you have to use your kinda wallet address, especially in signing, it's your kind of identity. It's your identity trail. And we are making kind of this history of identity more visible.”</blockquote><p>Apart front these, the developer told Cointelegraph that within the paradigm of decentralized social media, there are no entities that could stand in the way of its users. Compared to traditional social media, there is no entity that has the right to stop anyone within their platform. He explained that: </p><blockquote>“When Twitter first came out, there's a vibrant ecosystem of developers building whatever they want. But once they figure out that's actually taking the revenue of Twitter, they have the right to stop it.” </blockquote><p>On Feb. 2, social media giant Twitter <a href=\"https://www.cnbc.com/2023/02/02/twitter-to-start-charging-developers-for-api-access.html\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that they will start charging developers who use the Twitter API and integrate it within their projects. On June 1, social forum Reddit <a href=\"https://www.forbes.com/sites/barrycollins/2023/06/01/death-by-api-reddit-joins-twitter-in-pricing-out-apps/?sh=63e84905606d\" target=\"_blank\" rel=\"noopener nofollow\">started</a> to follow Twitter’s lead in asking for payment for what was once free. According to Inoue, this will not happen in Web3 since it’s inherently permissionless.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/how-to-store-crypto-inside-nfts-erc-6551-interview\"><strong><em>Here’s how developers aim to store crypto inside NFTs</em></strong></a></p><p>Cointelegraph also asked Inoue about the potential of Web3-based social media to replace old Web2 social platforms. However, instead of fully replacing the old systems, the developer shared his belief that Web3 offers a way to enhance and improve them instead. “I would say Web3 technology can enhance what is already there on the Web1 and Web2 rather than Web3 kind of needs to replace it completely,” he explained. </p><p>When asked about the role of Metaverse in decentralized social media, the developer shared that the artificial intelligence hype has already taken over. He explained: </p><blockquote>“Before the Metaverse went mainstream, AI took over. I don't know if we’re ever going to have the same narrative as we had a couple of years ago when Facebook was rebranded to Meta.”</blockquote><p>In 2021, Facebook <a href=\"https://cointelegraph.com/news/breaking-facebook-rebrands-to-meta-as-focus-expands-beyond-social-media\">rebranded into Meta</a>, taking a huge step in focusing on integrating metaverse-based technologies into the world of social media. However, Meta recently reported that it <a href=\"https://cointelegraph.com/news/metaverse-division-s-4b-loss-drags-on-positive-first-quarter-for-meta\">suffered a $4 billion loss</a> in its metaverse unit, but was able to offset the losses through its artificial intelligence unit. </p><p>While a lot of the conversations in Web3 socials hovered around platforms that are online. Inoue argued that Web3 socials are not limited to the metaverse and online platforms. The developer shared his identification card which can be used to link with others with the same card. According to the developer, this can be widely used in events where you can tap each others cards to have a record of the meeting saved in the blockchain</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/decentralized-social-media-next-big-crypto-thing/\"><strong><em>Decentralized social media: The next big thing in crypto?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-06T11:28:25.000Z",
    "title": "Yesterday saw the biggest cascade of long liquidations of 2023",
    "url": "https://cryptoslate.com/insights/yesterday-saw-the-biggest-cascade-of-long-liquidations-of-2023/",
    "description": "<p>Quick Take Yesterday saw the largest cascade of long positions liquidated since April 19, the previous largest long liquidation of 2023, as reported by CryptoSlate. According to Coinglass, over $290 million of longs positions were liquidated, which surpasses the April cascade of $260 million. In addition, the perpetual funding rate has turned negative for the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/yesterday-saw-the-biggest-cascade-of-long-liquidations-of-2023/\">Yesterday saw the biggest cascade of long liquidations of 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-06T11:15:12.000Z",
    "title": "SEC Gensler is dedicated to bringing crypto down",
    "url": "https://cryptodaily.co.uk/2023/06/sec-gensler-is-dedicated-to-bringing-crypto-down",
    "description": "<p>With no thought for the industry or for retail investors Gary Gensler has bombed the crypto market with the suing of Binance.</p>\nGensler&rsquo;s plan\n<p>If there was ever the slightest doubt over SEC Chairman Gensler&rsquo;s strategy towards the cryptocurrency sector, there can now be none. The SEC, with its main mandate to protect retail investors, has dropped another bomb on crypto and sent the market into a tailspin.</p>\n<p>Let&rsquo;s be clear, if Binance has done anything that warrants sanctions and penalties, then there would be a due process for the SEC to make its case. However, it appears that the SEC is tarring the entire crypto industry with the same brush and would bring it to its knees in order to apply the letter of the securities law, or at least the securities law as Gensler sees it.</p>\n<p>It would appear that Gensler&rsquo;s ultimate goal is to force all retail investors out of crypto and back to the embrace of the banking system. He would do this by choking off all on/off ramps to the exchanges, and by entangling all the exchanges in costly litigation.</p>\n<p>The SEC has gone for the jugular by choosing to first attack some of the exchanges working towards full compliance in Coinbase, Kraken, Paxos, and now Binance. Is it the fault of any crypto project that they cannot approach the SEC in order to register, given that even SEC Commissioner Hester Peirce says that this process is almost impossible?</p>\nWhy the SEC is attacking crypto\n<p>It needs to be absolutely clear that what is happening today with the US government, and its enforcement agencies, is that they are systematically attempting to put the entire crypto industry out of business.</p>\n<p>Why would this be the case?</p>\n<p>An industry that is for the people, in that it wants to provide innovation and wealth-making means that will enable everyone to be able to be their own bank and make financial decisions that are outside of the system, is seen as a threat to the system itself.</p>\n<p>Banks have become monstrous entities that seem to have more power than governments now. They have become obsolete and no longer serve the people. Governments are printing more and more fiat currency which is borne by the people in the form of inflation, and reduced purchasing power.</p>\n<p></p>\n<p>A system such as this can do without a competitor right now. Banks are failing and the Federal Reserve just backs them with currency printed out of thin air. Interest rates are high, unemployment is rising, and prices are going through the roof.</p>\n<p>Bitcoin and various strands of the cryptocurrency sector are building another system that each individual can be part of. When the monetary system as we know it comes tumbling down, things are going to be bad beyond imagining. However, with Bitcoin and crypto a new and fairer world can exist.&nbsp;</p>\nAn all-important stand\n<p>It is up to the few to make a stand and resist the likes of Gensler. He talks of everything being a security and has stated that he would like to see a middle man between every crypto project and their customers. He has even resorted to applying enforcement actions against developers of DeFi projects because he can&rsquo;t get at the project itself.</p>\n<p>The fight today between the government, the banks, global financial agencies, and the enforcement agencies on the one side, and the crypto industry on the other, will deeply affect the lives of our children tomorrow. Let us hope that the few will prevail for the benefit of the many.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-06T11:30:49.000Z",
    "title": "More Crypto Holders Now Realize the Importance of Having an Inheritance Plan — Venket Naga, Serenity Shield CEO",
    "url": "https://news.bitcoin.com/more-crypto-holders-now-realize-the-importance-of-having-an-inheritance-plan-venket-naga-serenity-shield-ceo/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_547995751-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"More Crypto Holders Now Realize the Importance of Having an Inheritance Plan — Venket Naga, Serenity Shield CEO\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_547995751-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_547995751-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_547995751-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_547995751-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_547995751-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_547995751-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_547995751.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to Venket Naga, the CEO of Serenity Shield — a privacy-preserving decentralized application — many of today&#8217;s crypto holders understand the importance of not just protecting and preserving their assets but the ability &#8220;to pass them on in case of unexpected events.&#8221; In written answers to questions sent by Bitcoin.com News, Naga also argued [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T11:35:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-06T11:26:27.000Z",
    "title": "Bitcoin Drops Below Support in Typical Pre-Halving Behavior: Analyst",
    "url": "https://coinedition.com/bitcoin-drops-below-support-in-typical-pre-halving-behavior-analyst/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Dubious-Speculation-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Dubious-Speculation-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Dubious-Speculation-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Dubious-Speculation-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Dubious-Speculation-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Dubious-Speculation-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Dubious-Speculation.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The founder of Into The Cryptoverse, Benjamin Cowen, thinks the recent drop in Bitcoin’s price reflects a historical pre-halving behavior. According to Cowen, in the pre-halving year of Bitcoin, the price often behaves in a “half-up, half-down” pattern. During such periods, the market wrecks both the bulls and bears alternatively. Cowen explained that in the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-drops-below-support-in-typical-pre-halving-behavior-analyst/\">Bitcoin Drops Below Support in Typical Pre-Halving Behavior: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]