[
  {
    "source": "Decrypt",
    "date": "2023-11-14T07:54:37.000Z",
    "title": "Reddit Moons Surge 130% as Community Admins Plot 'Plan Forward' for Token",
    "url": "https://decrypt.co/205955/reddit-moons-surge-130-as-community-admins-plot-plan-forward-for-token",
    "description": "Reddit admins are \"renouncing the Moons contract,\" rendering the token fully decentralized, and burning some of the supply."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-14T07:52:01.000Z",
    "title": "Personal Finance Guru Andrei Jikh Explains How BlackRock’s Spot Bitcoin ETF and Spot Ethereum ETF Will Work",
    "url": "https://www.cryptoglobe.com/latest/2023/11/personal-finance-guru-andrei-jikh-explains-how-blackrocks-spot-bitcoin-etf-and-spot-ethereum-etf-will-work/",
    "description": "Andrei Jikh, a renowned personal finance expert, recently released a video to his 2.3 million YouTube subscribers, explaining the intricacies of BlackRock’s proposed spot Bitcoin and Ethereum ETFs. Jikh’s analysis provides a comprehensive understanding of these financial instruments and their potential impact on the cryptocurrency market. Jikh has established himself as a prominent educator in […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-14T08:00:28.000Z",
    "title": "Hex Trust Enables Custody For STASIS EURO (EURS) Stablecoin",
    "url": "https://cryptodaily.co.uk/2023/11/hex-trust-enables-custody-for-stasis-euro-eurs-stablecoin",
    "description": "Hex Trust Enables Custody For STASIS EURO (EURS) Stablecoin"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T08:00:32.000Z",
    "title": "Hex Trust Enables Custody For STASIS EURO (EURS) Stablecoin",
    "url": "https://www.cryptopolitan.com/hex-trust-enables-custody-for-stasis-euro-eurs-stablecoin/",
    "description": "Hong Kong, Hong Kong, November 14th, 2023, Chainwire STASIS, the European fintech company behind the oldest EURO stablecoin EURS, announced the new integration with recognized digital asset custodian Hex Trust today. This integration enables Hex Trust to offer custodial services with EURS to its clients and reinforces Hex Trust&#8217;s ambition to diversify its digital assets ... <a title=\"Hex Trust Enables Custody For STASIS EURO (EURS) Stablecoin\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hex-trust-enables-custody-for-stasis-euro-eurs-stablecoin/\" aria-label=\"More on Hex Trust Enables Custody For STASIS EURO (EURS) Stablecoin\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T07:50:14.000Z",
    "title": "Grok Meme Coin, Named After Musk’s AI Bot, Sees 74% Value Collapse Amid Fraud Allegations",
    "url": "https://www.cryptopolitan.com/grok-meme-coin-ai-bot-sees-74-value-collapse/",
    "description": "The cryptocurrency market has witnessed a dramatic turn of events as Grok, a coin seemingly inspired by Elon Musk&#8217;s AI venture, has seen its value plummet by a staggering 74% following allegations of fraud by blockchain investigator ZachXBT. This cryptocurrency rollercoaster ride highlights the risks associated with meme coins and underscores the importance of due ... <a title=\"Grok Meme Coin, Named After Musk&#8217;s AI Bot, Sees 74% Value Collapse Amid Fraud Allegations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/grok-meme-coin-ai-bot-sees-74-value-collapse/\" aria-label=\"More on Grok Meme Coin, Named After Musk&#8217;s AI Bot, Sees 74% Value Collapse Amid Fraud Allegations\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-14T07:46:47.000Z",
    "title": "COIN360 toplists: how to navigate online services",
    "url": "https://crypto.news/coin360-toplists-how-to-navigate-online-services/",
    "description": "COIN360 toplists can be used as a resource when navigating the online services scene "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-14T07:59:58.000Z",
    "title": "Interview: Elan Future’s CEO Jerome-Olivier Malo on Transforming the Energy Sector",
    "url": "https://www.newsbtc.com/interview/interview-elan-futures-ceo-jerome-olivier-malo-on-transforming-the-energy-sector/",
    "description": "Elan Future is a project that is working towards achieving universal access to energy. Recently, we caught up with its CEO, Jerome-Olivier Malo and asked a few questions to gain some insights about him and the project. Elan &#8211; Unveiling the Vision Q: Let&#8217;s start with the present day. Could you share with our readers what Elan is and what inspired the creation of this innovative company? Elan Future is an uprising against the darkness that blankets millions of lives. Our battle is against the injustice of energy poverty and the passivity in facing the world&#8217;s dire energy crunch. We are here to flip the script on how energy is shared, saved, and savored. Enter Apollo — not your everyday generator, but a maverick of magnetic marvel that&#8217;s redefining efficiency. It&#8217;s our secret sauce in the quest for an electrified planet, a piece of tomorrow&#8217;s technology here to disrupt today&#8217;s energy norms. The spark for Elan? It was the world&#8217;s energy outcry that no one could ignore. As the globe grapples with an energy plight that hits both wallets and resources hard, we saw a beacon of hope in the form of Apollo, ready to lead the charge in this new energy revolution. Our ranks are filled with the best and bravest — physicists defying the status quo, Hydro-Québec engineers with electricity in their veins, financial wizards who see beyond the bottom line, and angel investors with their gaze fixed on a horizon lit by innovation. What inspired Elan&#8217;s inception was a cocktail of frustration and foresight — frustration at a world where energy is a privilege and foresight that sees it as a fundamental right. By welding our state-of-the-art tech with the bedrock of blockchain, we&#8217;re sparking a transparent energy uprising. Elan Future is here to ensure energy is not just consumed but embraced as a universal currency of progress. It&#8217;s not just about keeping the lights on; it&#8217;s about igniting a flame of change in every soul we touch. Inception and Community Impact Q: What was the spark that ignited the idea for Elan Future? How do you envision it making a positive impact on the community and beyond? The spark for Elan Future came from a profound place of need—a need that you can see in the eyes of the millions who live off the grid, and in the strained grids of our cities that barely keep up with our current demands. It struck me during a blackout; as I sat there in the dark, I realized that this was a daily reality for so many people. That moment of frustration lit the fire of creation for Elan. I envision Elan Future as a catalyst for change. With Apollo, we’re proposing a new way of life. It&#8217;s about creating a world where energy is not a luxury but a given. A world where communities can thrive, not just survive, because they have the power—literally—to do so. But the impact doesn&#8217;t stop at the light switch. We&#8217;re talking about empowering communities with the means to grow and sustain themselves. Energy drives education, healthcare, and economic opportunities. Imagine schools that can light up young minds, hospitals that can save lives around the clock, and small businesses that can flourish. That’s the future Elan is dedicated to building. And on a larger scale, by bringing energy to areas that were previously in the dark, we&#8217;re sparking innovation on a global level. We’re contributing to the creation of a more balanced, more connected world, where the flow of energy is as natural and equitable as the flow of information is today The Journey Behind Elan Q: Jerome, you have an extensive background in various endeavors before Elan Future. Could you take our readers on a journey through your experiences and how they&#8217;ve led you to this point? Absolutely, it&#8217;s been quite the adventure, and every step has played a part in leading me to where I am today with Elan Future. My journey started in the tech industry, where I was fascinated by the power of technology to connect people and ideas. I spent years working with dynamic startups, where I learned that at the heart of any successful innovation lies a keen understanding of the human experience. From there, I ventured into the world of finance. I saw how economic systems could either enable growth or create barriers. This experience was eye-opening—it was about understanding risk, recognizing potential, and investing in ideas that could shape the future. But it was my time spent volunteering with non-profits that truly set the stage for Elan Future. I saw firsthand the challenges faced without reliable energy. Schools struggled to stay open after dark, medical clinics couldn&#8217;t preserve life-saving vaccines, and simple tasks were monumental without power. This patchwork of experiences brought clarity. The tech industry taught me about the power of innovation, finance showed me how to turn ideas into reality, and my time in the field revealed the critical need for sustainable energy solutions. The throughline was clear—energy was the key to unlocking potential on an individual and global scale. With Elan Future, I&#8217;ve taken this tapestry of experiences and weaved them into our mission. Every lesson learned, every success and setback, has been a stepping stone to this moment, where we have the opportunity to illuminate lives and empower communities on a scale that truly matters. Meet the Elan Team Q: The team behind a project is often critical to its success. Can you introduce us to the remarkable individuals who make up the Elan Future team and share their unique contributions? Success at Elan Future is truly a team sport, and we have an all-star lineup that&#8217;s hard to beat. Each individual&#8217;s expertise is not just a cog in the machine but a vital organ in the body of our mission—electrifying the future. Dr. Benoit Guay is our scientific maestro, a PhD in Applied Physics with a mind that&#8217;s as brilliant as it is unconventional. His groundbreaking work on the edges of physics—including mass reversals and magnetic susceptibility—puts us leagues ahead in the field of energy innovation. Benoit is the brain behind the science that powers Elan Future&#8217;s technology. Sylvain Roy, Esq, is the guardian of our intellectual arsenal. With a keen eye for technology monetization and a sharp mind for IP valuation, he navigates the complex waters of international law with the finesse of a seasoned captain. His lectures at the IP Business Academy and CEIPI at Université de Strasbourg are just a sliver of the prowess he brings to our legal strategy. Doryne Bourque is the heartbeat of our corporate social responsibility. Her positions on various boards demonstrate her leadership and commitment to sustainable development and responsible finance. Her passion for equitable resource distribution aligns perfectly with our mission, guiding Elan Future&#8217;s strategic decisions with a conscience. Last but not least, Denis Chartrand, eng, is the architect of our infrastructure. His experience at Hydro-Québec, where he was instrumental in developing strategies post-the 1998 ice storm, has given him unparalleled expertise in resilient and smart grid technology. Denis&#8217;s vision shapes the robust and innovative framework that allows our technology to thrive. Together, this dream team&#8217;s diverse skills and passions fuel Elan Future&#8217;s drive to bring sustainable, reliable energy to every corner of the globe. We&#8217;re more than just a company; we&#8217;re a collective force on a mission to electrify the future, and our team&#8217;s expertise is our powerhouse. Elan&#8217;s Milestones Q: Could you highlight some of the noteworthy breakthroughs and milestones that Elan Future has achieved so far? Our journey with the Apollo Generator is a testament to our commitment to innovation and transformative change. Filing several patents for Apollo was just the beginning. These patents are more than documents; they&#8217;re the blueprints for a future where access to energy is universal—a future we&#8217;re actively constructing. Launching our blockchain and introducing our own token was a bold move towards a vision where energy isn&#8217;t just consumed but is part of a transparent, equitable exchange. It&#8217;s about giving power back to the people—literally. We&#8217;ve given away millions in free tokens, not as a promotional stunt, but as a statement of our belief in a community-driven energy revolution. This token isn&#8217;t just a currency; it&#8217;s a new way of connecting people to their power, their community, their environment. The creation of Apollo and our other groundbreaking innovation, the Pathfinder, represent the pinnacle of our achievements. Every step we&#8217;ve taken at Elan Future is a step towards demystifying and democratizing energy. We are a movement powered by the courage to reimagine what&#8217;s possible, making the future accessible, one innovation at a time. A Glimpse of the Future Q: What&#8217;s on the horizon for Elan Future? Can you give us a sneak peek into any exciting announcements or developments that our readers should keep an eye out for in the near future? The future of Elan Future is filled with promise and innovation, including our exciting Cassiopée project. Cassiopée represents a harmonious blend of technology, design, and sustainability, where homes are sanctuaries that provide clean, renewable energy. We&#8217;re creating a community where energy is not just a resource but a way to improve living standards and alleviate poverty. We invite our readers to stay tuned for developments in both our energy innovations and the Cassiopée project, which are set to reshape the way we think about energy and sustainable living. Joining the Initiative Q: For our readers who are eager to get involved, how can they become part of the Elan Future initiative? What opportunities exist for them to contribute or participate? For readers eager to get involved with Elan Future, there are opportunities for collaboration and participation. We welcome discussions on future-focused initiatives, technological solutions, or strategic partnerships. Elan is about creating a community of like-minded visionaries who embrace innovation, sustainability, and collaboration to shape a better future. Reach out via twitter or discord to explore how you can contribute to our mission. Parting Thoughts Q: Is there anything else you&#8217;d like to share with our readers, perhaps a message, a call to action, or a vision that encapsulates Elan Future’s mission and ethos? As we stand at the crossroads of innovation and tradition, Elan Future beckons to a horizon brimming with promise. Our mission has always been clear: to illuminate every corner of the globe with accessible, sustainable energy. But this vision isn&#8217;t just ours to build—it&#8217;s a tapestry woven from the aspirations of every individual, community, and nation we touch. To the readers, our call to action is simple yet profound: join us. Engage with us. Be part of the energy revolution that moves beyond the constraints of the grid to a world where energy flows as freely as information does today. Every token we&#8217;ve shared, every patent we&#8217;ve filed, every innovation we&#8217;ve brought to life like Apollo and Pathfinder, is a step toward this boundless future. We invite you to imagine a planet where energy poverty is history, where clean power fuels not just our homes and devices, but also our dreams and opportunities. This is the future Elan Future is committed to—a future where we aren&#8217;t just passive consumers of energy, but active participants in a vibrant energy ecosystem. So, as we look to the future, let&#8217;s not just be spectators. Let’s be the architects of an electrified tomorrow. Invest in sustainable choices, support clean energy initiatives, and embrace the technologies that prioritize the planet as much as they do profit. Together, we can ensure that our collective tomorrow shines brighter than ever—a testament to what we can achieve when we harness energy not just to power our devices, but to empower our lives. Let&#8217;s take this journey together—for the planet, for our communities, and for the generations to come."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-14T08:01:01.000Z",
    "title": "Judge Torres Sets Important Dates for Ripple vs. SEC Fight in XRP Lawsuit – All Investors Have to Watch",
    "url": "https://www.crypto-news-flash.com/judge-torres-sets-important-dates-for-ripple-vs-sec-fight-in-xrp-lawsuit-all-investors-have-to-watch/?utm_source=rss&utm_medium=rss&utm_campaign=judge-torres-sets-important-dates-for-ripple-vs-sec-fight-in-xrp-lawsuit-all-investors-have-to-watch",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-184.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-184.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-184-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-184-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The SEC vs. Ripple legal battle progresses with a set schedule for remedies briefing and discovery. Key dates to remember: Remedies briefing starts on Feb 12, 2024, and concludes with the SEC&#8217;s reply on Apr 29, 2024. SEC vs. Ripple: Legal Battle Progresses with Remedies Phase Schedule The ongoing legal tussle between Ripple Labs and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-14T07:45:53.000Z",
    "title": "Investment Update: Solana Gains Momentum, a New Cryptocurrency with Potential for 100x Growth Draws Investor Interest",
    "url": "https://www.crypto-news-flash.com/investment-update-solana-gains-momentum-a-new-cryptocurrency-with-potential-for-100x-growth-draws-investor-interest/?utm_source=rss&utm_medium=rss&utm_campaign=investment-update-solana-gains-momentum-a-new-cryptocurrency-with-potential-for-100x-growth-draws-investor-interest",
    "description": "<img width=\"1076\" height=\"556\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Spectra.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Spectra.png 1076w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Spectra-300x155.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Spectra-1024x529.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Spectra-768x397.png 768w\" sizes=\"(max-width: 1076px) 100vw, 1076px\" />While Solana (SOL) has experienced a surge in value following the testnet launch of Firedancer, VC Spectra (SPCT) has attracted investor attention with its innovative solutions and user-friendly platform, showcasing the potential for exponential growth. Let&#8217;s explore why these top crypto coins are must-haves in your investment portfolios &#62;&#62;BUY SPCT TOKENS NOW&#60;&#60; Solana (SOL) Spikes [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-14T07:43:32.000Z",
    "title": "MATIC Flips Major Altcoins To Become 11th Largest Crypto",
    "url": "https://coinedition.com/matic-flips-major-altcoins-to-become-11th-largest-crypto/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Entered_MATIC_for_a_quick_scalp_long_Targeting_a_squeeze_from_here.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon Claims A Top Spot In Terms Of Tokenization And RWAs\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Entered_MATIC_for_a_quick_scalp_long_Targeting_a_squeeze_from_here.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Entered_MATIC_for_a_quick_scalp_long_Targeting_a_squeeze_from_here-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Entered_MATIC_for_a_quick_scalp_long_Targeting_a_squeeze_from_here-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Entered_MATIC_for_a_quick_scalp_long_Targeting_a_squeeze_from_here-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Entered_MATIC_for_a_quick_scalp_long_Targeting_a_squeeze_from_here-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Entered_MATIC_for_a_quick_scalp_long_Targeting_a_squeeze_from_here-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>MATIC, the native token of layer-2 blockchain Polygon, has been one of the biggest winners in the crypto market resurgence that started in October. Since then, the token has seen a remarkable surge in its price and has now flipped major altcoins to become the 11th-ranked cryptocurrency network by market cap.&#160;&#160; Indeed, the rise comes [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/matic-flips-major-altcoins-to-become-11th-largest-crypto/\">MATIC Flips Major Altcoins To Become 11th Largest Crypto</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-14T08:04:05.000Z",
    "title": "Bitcoin Whales Unload About $2,220,000,000 in BTC in Just One Week: Crypto Analyst",
    "url": "https://dailyhodl.com/2023/11/14/bitcoin-whales-unload-about-2220000000-in-btc-in-just-one-week-crypto-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Whales-Scoop-Up-One.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Whales-Scoop-Up-One.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Whales-Scoop-Up-One.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Whales-Scoop-Up-One.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Whales-Scoop-Up-One.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Whales-Scoop-Up-One.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Whales-Scoop-Up-One.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed trader says that deep-pocketed crypto holders have unloaded tens of thousands of Bitcoin (BTC) in just seven days. Trader and on-chain sleuth Ali Martinez says that Bitcoin whales have been selling off their Bitcoin stacks as BTC hit a new 2023 high of about $38,000. &#8220;Bitcoin whales have been booking profits, selling [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/14/bitcoin-whales-unload-about-2220000000-in-btc-in-just-one-week-crypto-analyst/\">Bitcoin Whales Unload About $2,220,000,000 in BTC in Just One Week: Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]