[
  {
    "source": "Cointelegraph",
    "date": "2024-03-30T01:01:49.000Z",
    "title": " US court favors Fed in Custodia Bank case, rejects appeal for review  ",
    "url": "https://cointelegraph.com/news/united-states-court-federal-reserve-bank-kansas-city-custodia-bank",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNWZhY2Q3NzEtZDI4OS00NjIyLWI5NTAtYWI4MjMxZjI5MGFiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Custodia Bank argued that without a master account it is a “second-class citizen” at the mercy of an intermediary bank.</p>\n                    <p><p>The United States district court has ruled against granting Custodia Bank a master account and has also dismissed the digital asset bank's plea for a declaratory judgment. However, Custodia claims it is not backing down and is exploring all possible avenues.</p><p>“We are reviewing the Court’s decision and all of our options, including appeal,” a spokesperson for Custodia Bank <a href=\"https://x.com/EleanorTerrett/status/1773815837851304438?s=20\" target=\"_blank\" rel=\"noopener nofollow\">stated</a>.</p><p>In a March 29 <a href=\"https://www.dropbox.com/scl/fi/e4eik55fl6gfapyb37ctc/show_temp-13.pdf?rlkey=2gh2k2o1emjsd7c4zvldbkq0p&amp;dl=0\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> submitted to the United States District Court of Wyoming, Judge Scott Skavdahl dismissed Custodia’s bid to secure a Federal Reserve master account. The account, often referred to as \"a bank account for banks,\" facilitates financial institutions' access to the Federal Reserve’s payment systems. </p><p><a href=\"https://cointelegraph.com/news/united-states-court-federal-reserve-bank-kansas-city-custodia-bank\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-30T00:56:02.000Z",
    "title": "The Chain Abstraction Strategy Could be the Basis for Crypto’s Expansion",
    "url": "https://www.cryptopolitan.com/the-chain-abstraction-crypto-expansion/",
    "description": "At the BUIDL Asia conference in Seoul, South Korea, Illia Polosukhin emphasized the importance of blockchain abstraction for mainstream cryptocurrency and Web3 technology. As the founder of the Nearkin protocol, he claims that this strategy facilitates user interaction while hiding complex information about blockchain technology. All in all, this allows a more impactful and greater [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-30T01:00:21.000Z",
    "title": "BlockDAG’s $10 Million Presale Miracle In Fifth Batch, Sparking Interest Amongst Investors Amid Bitcoin Vs Altcoins Conversations",
    "url": "https://nulltx.com/blockdags-10-million-presale-miracle-in-fifth-batch-sparking-interest-amongst-investors-amid-bitcoin-vs-altcoins-conversations/",
    "description": "As the dialogue around Bitcoin and other digital currencies evolves, it uncovers a diverse landscape of investment opportunities. Amidst this lively backdrop, BlockDAG stands out in its 5th presale batch, garnering an impressive $10.4 million and distributing more than 5.5 billion coins. This development offers a broad spectrum of promising [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-30T01:00:10.000Z",
    "title": "What’s A Simple Strategy For Buying & Selling Bitcoin? This Analyst Answers",
    "url": "https://www.newsbtc.com/bitcoin-news/simple-strategy-buying-selling-bitcoin-analyst/",
    "description": "An analyst has revealed a simple strategy for buying and selling Bitcoin using the historical pattern followed by two BTC on-chain indicators. These Bitcoin On-Chain Indicators Have Followed A Specific Pattern Historically In a post on X, CryptoQuant author Axel Adler Jr. discussed a simple strategy for timing buying and selling moves for Bitcoin. The strategy is based on the trend witnessed historically in two BTC on-chain metrics: the Net Unrealized Loss (NUL) and Net Unrealized Profit (NUP). As their names suggest, these indicators keep track of the total amount of unrealized loss and unrealized profit that the investors are currently carrying. Related Reading: Coinbase Sees Largest USDC Inflow Ever, What This Could Mean For Bitcoin These metrics work by going through the transaction history of each coin in circulation to see what price it was last transacted at. Assuming that the last transfer of each coin was the last time it changed hands, the price at its instant would act as its current cost basis. If the previous price for any coin was less than the current spot price of the cryptocurrency, then that coin is currently carrying a profit. The NUP subtracts the two to calculate the exact unrealized gain for the coin. Similarly, the NUL does the same for coins that have their cost basis above the latest value of the asset. These indicators then sum up this value for the entire supply and divide the sum by the current market cap. Now, first, here is a chart shared by the analyst for the NUL that reveals a pattern that the metric has been following throughout the history of Bitcoin: The value of the metric seems to have been heading down in recent days &#124; Source: @AxelAdlerJr on X The Bitcoin NUL appears to have historically broken above the 0.5 level when the asset&#8217;s price has traded around bear market lows. According to Axel, the indicator in this territory would be the moment to buy more. Recently, the metric has been floating around the zero mark, meaning that there has been any unrealized loss being held by the investors. This makes sense, as the cryptocurrency has set new all-time highs (ATHs). Naturally, 100% of the supply goes into profit when an ATH is set. Similar to the pattern in the NUL, the NUP has been above the 0.7 level during major tops in the past, suggesting that it may be a good opportunity to sell when the indicator is in this zone. Looks like the value of the indicator has been climbing up recently &#124; Source: @AxelAdlerJr on X As is visible in the chart, the NUP has been marching up with the recent rally in Bitcoin. Still, so far, the indicator hasn&#8217;t broken above the seemingly important 0.7 level, implying that the market may not yet be in an overheated place where selling would be ideal, at least according to this strategy. The graphs of the two indicators, though, show that neither of them flagged the exact tops or bottoms in the asset. It&#8217;s especially prominent in the data of the NUP, where the metric signaled &#8220;sell&#8221; during tops that were merely halfway through the bull run. Related Reading: Bitcoin Bull Flag Could Predict 10% Surge To $77,000, Analyst Explains That said, buying during the points flagged by the NUL and then selling at the overheated NUP values would have historically been profitable. In that sense, this would indeed be a &#8220;simple&#8221; strategy for the asset. It remains to be seen, though, whether these patterns will continue to hold in the current Bitcoin cycle as well. BTC Price At the time of writing, Bitcoin is trading at around $69,400, down 2% over the past 24 hours. The price of the asset appears to have been moving sideways recently &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, CryptoQuant.com, chart from TradingView.com"
  }
]