[
  {
    "source": "Crypto Daily",
    "date": "2023-08-07T08:00:00.000Z",
    "title": "Huobi Faces Insolvency Rumors Amid $USDT Selloff",
    "url": "https://cryptodaily.co.uk/2023/08/huobi-faces-insolvency-rumors-amid-usdt-selloff",
    "description": "<p class=\"md-end-block md-p\">Prominent crypto analyst and investor Adam Cochran has called into question the solvency of Huobi, the 12th largest cryptocurrency exchange globally by spot trading volume.In a series of recent tweets, Cochran pointed to significant discrepancies in Huobi's reported Tether (USDT) holdings, suggesting that the firm might be failing to meet its financial obligations. Cochran bases his assertions on a detailed examination of Huobi's balance sheets and the recent activities of Justin Sun, the founder of Tron. Despite these allegations, Huobi maintains that all operations are proceeding as normal.</p>\n<p class=\"md-end-block md-p\">According to Cochran's investigation, Huobi's own \"Merkle Tree Audit\" indicates a significant discrepancy in the exchange's held assets. He points out that while the audit lists that Huobi users hold $631 million worth of Tether (USDT), Huobi's actual holdings amount to only $90 million. This significant gap, Cochran alleges, is indicative of insolvency. </p>\n<p class=\"md-end-block md-p\">Cochran further argues that Sun has been treating the exchange like a personal piggy bank, transferring funds to his decentralized finance (DeFi) projects and thus leaving the exchange unable to meet its obligations. Specifically, he alleges that Sun is inflating the yield on his DeFi apps to entice more deposits into Huobi.</p>\n<p class=\"md-end-block md-p\">Adding to the concerns, Cochran noted a substantial sell-off of Tether (USDT) on Binance, which he believes is connected to the solvency fears surrounding Huobi. He also raised questions about Sun's recently launched \"stUSDT\", a variant of USDT that Sun claims is backed by government bonds. Cochran alleges that the stUSDT does not have sufficient backing, which further compounds the potential risk.</p>\n<p class=\"md-end-block md-p\">Cochran also pointed out that certain Huobi and Tron executives are reportedly under investigation by Chinese authorities, a development that has fanned the flames of these allegations. These apprehended individuals reportedly include key personnel from both organizations, adding more credibrility to the concerns about Huobi's financial stability.</p>\n<p class=\"md-end-block md-p\">Huobi has denied any wrongdoing and maintains that all operations are running normally. However, Cochran dismissed these assertions, stating that his source, a senior executive at Tron, confirmed that team members are indeed under investigation due to actions related to Huobi.</p>\n<p class=\"md-end-block md-p\">Cochran's analysis, if accurate, paints a worrying picture for Huobi's financial health, adding fuel to rumors of the company's potential insolvency. If Huobi users begin to lose faith in the exchange's financial stability, it could lead to a mass exodus from the platform and significant upheaval in the crypto market.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-07T07:55:00.000Z",
    "title": "Alchemix Reports Return Of Stolen Funds From Curve Exploit",
    "url": "https://cryptodaily.co.uk/2023/08/alchemix-reports-return-of-stolen-funds-from-curve-exploit",
    "description": "<p>Alchemix, a lending platform, has reported that all the funds stolen by the Curve Finance hacker from Alchemix&rsquo;s alETH-ETH pool have been returned.&nbsp;</p>\n<p>Curve Finance had fallen victim to a major heist on the 31st of July, leading to the hacker draining around $61 million from the protocol.&nbsp;</p>\nAlchemix Announces Return Of All Funds&nbsp;\n<p>The Curve Finance exploit had resulted in Alchemix losing around $13.6 million from its alETH-ETH pool. Apart from Alchemix, several other pools also saw their funds drained. These included JPEGd&rsquo;s pETH-ETH pool, which saw outflows of around $11.4 million, and Metronome&rsquo;s sETH-ETH pool, which saw the exploit drain about $1.6 million. The hacker had targeted several stable pools on Curve Finance using a reentrancy bug that impacted the Vyper programming language used on Curve Finance.&nbsp;</p>\n<p>Now, Alchemix has announced on X that the hacker has returned the stolen funds after accepting a bug bounty offer from Curve, Metronome, and Alchemix.&nbsp;</p>\n\n<p>&ldquo;We are extremely happy to announce that all funds stolen by the hacker of the Alchemix @CurveFinance pool have now been returned.&rdquo;</p>\n\nAn Offer The Hacker Couldn&rsquo;t Refuse&nbsp;\n<p>Alchemix, Metronome, and Curve Finance had offered the hacker a 10% bug bounty as a reward, asking them to return the remaining 90% of the stolen funds. The three entities had stated that if the hacker returned the funds, they would not face any further legal or law enforcement actions.&nbsp;</p>\n\n<p>&ldquo;The offer comes with a guarantee of no further legal actions or involvement of law enforcement. We want to resolve this in a civilized manner. You will have no risk of us pursuing this further, no risk of law enforcement issues.&rdquo;</p>\n\n<p>However, the three protocols also told the hacker to view their offer as a final warning, giving them until the 6th of August to accept their offer. They warned that if the hacker refused or ignored their warning, they would be expanding the bounty to the public, offering 10% of the funds to anyone who would help identify the hacker in a way that would lead to conviction in court. The stark warning stated that the hacker would feel the full force of the law should he fail to comply.&nbsp;</p>\n\n<p>&ldquo;If you choose not to partake in the voluntary return and complete the process by the 6th of August at 0800 UTC, we will expand the bounty to the public and offer the full 10% to the person who is able to identify you in a way that leads to your conviction in the courts. We will pursue you from all angles with the full extent of the law.&rdquo;</p>\n\nHacker Accepts Offer And Returns Funds&nbsp;\n<p>On the 4th of August, the hacker posted a message on the Ethereum network directed at Curve Finance and Alchemix development teams. In the not-so-pleasant message, the hacker stated that they would return the funds, but because they did not want to ruin the multiple projects impacted, and not because they were caught or because of the threat of legal action. The hacker stated in his on-chain message,&nbsp;</p>\n\n<p>&ldquo;I&rsquo;m refunding, not because you can find me. It&rsquo;s because I don&rsquo;t want to ruin your project.&rdquo;</p>\n\n<p>At around 11:16 am UTC, the hacker returned 1 alETH to the Curve Finance deployer account. Following the success of the initial transaction, the hacker made three separate transfers two hours later, totaling around 4820.55 alETH, sent to the Alchemix development team&rsquo;s multisig wallet. The funds returned were around $8.9 million worth of crypto assets, making up around 15% of the stolen funds. Alchemix later reported that the hacker returned all of the stolen funds.&nbsp;</p>\n<p>NFT protocol JPEG&rsquo;d, in a separate announcement, also confirmed that they had been refunded, with the perpetrators returning around 5495 ETH. As stated in the bounty offer, the NFT protocol will not be taking any legal action against the hackers. The JPEG&rsquo;d team stated,&nbsp;</p>\n\n<p>​​&ldquo;Any further investigations or legal matters against the entity will end. We view this occurrence as a white-hat rescue.&rdquo;</p>\n\nDeFi Breathes A Sigh Of Relief&nbsp;\n<p>The Curve Finance exploit had put considerable pressure on the larger DeFi ecosystem after the value of the protocol&rsquo;s CRV token plummeted after the hack. Several reports that emerged after the hack stated that Curve founder Michael Egorov had taken several loans, putting up CRV as collateral, putting Egorov&rsquo;s $168 million lending position at risk of liquidation. This put major DeFi protocols Aave, Abracadabra, and several others at risk as well, thanks to a potential domino effect.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T08:02:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T07:57:04.000Z",
    "title": "Attorney John Deaton stands firm on Ripple’s chances in SEC appeal",
    "url": "https://www.cryptopolitan.com/attorney-john-deaton-stands-firm-on-ripples-chances-in-sec-appeal/",
    "description": "The famous attorney and avid XRP supporter, John Deaton, expresses confidence in the Securities and Exchange Commission (SEC) appeal against Ripple (XRP). He believes that Judge Analisa Torres&#8217;s well-reasoned order provides a solid foundation for a negative conclusion for the SEC. Citing a detailed thread that explains the judge&#8217;s decision, Deaton highlights the use of ... <a title=\"Attorney John Deaton stands firm on Ripple&#8217;s chances in SEC appeal\" class=\"read-more\" href=\"https://www.cryptopolitan.com/attorney-john-deaton-stands-firm-on-ripples-chances-in-sec-appeal/\" aria-label=\"More on Attorney John Deaton stands firm on Ripple&#8217;s chances in SEC appeal\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T07:51:32.000Z",
    "title": "NFT Trader Outsmarts Bot, Bags $1.5 Million in Ethereum",
    "url": "https://www.cryptopolitan.com/nft-trader-outsmarts-bot-bags-1-5-million/",
    "description": "In a recent turn of events that has left the crypto community buzzing, a trader named Hanwe Chang has reportedly outsmarted a bot, earning a staggering 800 Ethereum, equivalent to $1.5 million. The incident occurred on the NFT marketplace Blur, where Chang noticed a bot mimicking his bids and decided to use this to his ... <a title=\"NFT Trader Outsmarts Bot, Bags $1.5 Million in Ethereum\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nft-trader-outsmarts-bot-bags-1-5-million/\" aria-label=\"More on NFT Trader Outsmarts Bot, Bags $1.5 Million in Ethereum\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-07T08:02:54.000Z",
    "title": "Bitcoin Price Relatively Muted, Risk of More Downsides Still Exist",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-muted-29k/",
    "description": "Bitcoin price is struggling to climb above $29,500. BTC remains at risk of more downsides if there is a close below the $28,800 support. Bitcoin is still struggling to gain pace above the $29,500 pivot level. The price is trading below $29,200 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance near $29,100 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could attempt a fresh increase toward the $29,500 resistance zone. Bitcoin Price Stuck In Tiny Range Bitcoin price struggled to clear the $29,500 resistance zone. BTC started a fresh decline within the range and traded below the $29,250 level. There was a close below $29,250 and the 100 hourly Simple moving average. However, the bulls protected the range support at $28,800. The price traded as low as $28,800 and recently started a short-term upside correction. There was a move above the 23.6% Fib retracement level of the downward move from the $29,395 swing high to the $28,800 low. However, the bears were active near the $29,200 resistance zone. There is also a key bearish trend line forming with resistance near $29,100 on the hourly chart of the BTC/USD pair. Bitcoin price is trading below $29,200 and the 100 hourly Simple moving average. Immediate resistance is near the $29,100 zone, the trend line, and the 100 hourly Simple moving average. It is close to the 50% Fib retracement level of the downward move from the $29,395 swing high to the $28,800 low. Source: BTCUSD on TradingView.com The first major resistance is near the $29,400 level. The next major resistance is near the $29,500 level, above which the price might rise toward the $29,750 resistance zone. A close above the $29,750 resistance zone could start a decent increase. In the stated case, the price may even surpass the $30,000 resistance. More Losses In BTC? If Bitcoin fails to clear the $29,100 resistance, it could start a fresh decline. Immediate support on the downside is near the $29,000 level. The next major support is near the $28,800 level, below which the price could accelerate lower. The next support is near the $28,400 level. Any more losses might call for a move toward the $28,000 level in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $29,000, followed by $28,800. Major Resistance Levels – $29,100, $29,400, and $29,500."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-07T08:00:06.000Z",
    "title": "Cardano Price Prediction: ADA on a Bullish Trend, DigiToads poised for a 1500% growth",
    "url": "https://www.crypto-news-flash.com/cardano-price-prediction-ada-on-a-bullish-trend-digitoads-poised-for-a-1500-growth/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-price-prediction-ada-on-a-bullish-trend-digitoads-poised-for-a-1500-growth",
    "description": "<img width=\"512\" height=\"319\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T092509.325.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T092509.325.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T092509.325-300x187.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T092509.325-343x215.jpg 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T092509.325-163x102.jpg 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Slight bearish trends are having little impact on the movement of ADA. In 2024, it could rise to $0.49, a potentially impressive feat for a project bogged down by extreme market pressure over the past year. As of this writing, Cardano has been on a slight bearish trend and on a tight range. Meanwhile, pushing [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-07T07:52:14.000Z",
    "title": "Canaccord Genuity: Seize the Opportunity as Bitcoin Enters a New Cycle",
    "url": "https://www.crypto-news-flash.com/canaccord-genuity-seize-the-opportunity-as-bitcoin-enters-a-new-cycle/?utm_source=rss&utm_medium=rss&utm_campaign=canaccord-genuity-seize-the-opportunity-as-bitcoin-enters-a-new-cycle",
    "description": "<img width=\"1920\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-2894068_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-2894068_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-2894068_1920-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-2894068_1920-1024x640.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-2894068_1920-768x480.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-2894068_1920-1536x960.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-2894068_1920-343x215.jpg 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-2894068_1920-326x205.jpg 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-2894068_1920-163x102.jpg 163w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />According to a leading cryptocurrency analyst, market players can take advantage of a bullish signal recently spotted on Bitcoin’s chart.  Despite the push and pull from bulls and bears, Bitcoin has managed to reclaim the $30,000 price level, after clearing recent losses.  A prominent Cryptocurrency analyst has made a very bold bullish statement about the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-07T07:46:37.000Z",
    "title": "Expanding XRP Utility Beyond Cross-Border Payments: Flare Founder Optimistic About Innovative Initiatives After Regulatory Victory",
    "url": "https://www.crypto-news-flash.com/expanding-xrp-utility-beyond-cross-border-payments-flare-founder-optimistic-about-innovative-initiatives-after-regulatory-victory/?utm_source=rss&utm_medium=rss&utm_campaign=expanding-xrp-utility-beyond-cross-border-payments-flare-founder-optimistic-about-innovative-initiatives-after-regulatory-victory",
    "description": "Despite delays due to regulatory issues and competition from stablecoin providers, Ripple is likely to find success in cross-border payments, especially in underserved areas, as per Flare Network founder, Hugo Philion. Innovative initiatives are exploring new uses for XRP and the XRP Ledger, promising diversified utility, albeit with required time for research, development, and market [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-07T08:09:09.000Z",
    "title": "Is Worldcoin (WLD) the Next LUNA? Crypto Influencer Shares His Take",
    "url": "https://coinedition.com/is-worldcoin-wld-the-next-luna-crypto-influencer-shares-his-take/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/This-Altcoin-Is-The-Next-LUNA-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto influencer Jordi Alexander believes that Worldcoin may become the next LUNA. Alexander, who also serves as the chief alchemist of the Mantle Network, expressed concerns about the crypto economics surrounding Worldcoin in addition to its controversial real-world activities, including biometric data collection through retina scans. Alexander recently appeared in an interview with Crypto Banter [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/is-worldcoin-wld-the-next-luna-crypto-influencer-shares-his-take/\">Is Worldcoin (WLD) the Next LUNA? Crypto Influencer Shares His Take</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-07T07:56:38.000Z",
    "title": "Coinfest Asia to Be Attended by Over 3,000 Participants and 100 Notable Speakers in the Web3 Industry",
    "url": "https://coinedition.com/coinfest-asia-to-be-attended-by-over-3000-participants-and-100-notable-speakers-in-the-web3-industry/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/PR-59.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/PR-59.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/PR-59-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/PR-59-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/PR-59-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/PR-59-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/PR-59-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/PR-59-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/PR-59-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/PR-59-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/PR-59-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/PR-59-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/PR-59-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/PR-59-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/PR-59-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/PR-59-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/PR-59-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Coinfest Asia 2023 by Coinvestasi,&#160;will take place on August 24-25 in Jimbaran, Bali. In its second edition, Coinfest Asia will act as a bridge between the web2 and web3 industries, aiming to create a more resilient web3 industry. This event is projected to gather more than 3,000 participants, with the majority coming from abroad. This [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinfest-asia-to-be-attended-by-over-3000-participants-and-100-notable-speakers-in-the-web3-industry/\">Coinfest Asia to Be Attended by Over 3,000 Participants and 100 Notable Speakers in the Web3 Industry</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-07T07:46:58.000Z",
    "title": "European Edition Global Blockchain Congress by Agora Group Took Place at London Bankside",
    "url": "https://coinedition.com/european-edition-global-blockchain-congress-by-agora-group-took-place-at-london-bankside/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/PR1-154.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/PR1-154.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/PR1-154-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/PR1-154-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/PR1-154-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/PR1-154-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/PR1-154-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/PR1-154-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/PR1-154-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/PR1-154-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/PR1-154-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/PR1-154-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/PR1-154-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/PR1-154-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/PR1-154-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/PR1-154-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/PR1-154-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The European Edition of the prominent Global Blockchain Congress by Agora Group that took place on July 24th &#38; 25th, 2023 at Hilton London Bankside, UK, was a huge success. This edition’s main theme was: DeFi, Gaming, Metaverse, and NFTs, which brought an A-list speakers, some of the industry’s top-level experts, providing the most reliable [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/european-edition-global-blockchain-congress-by-agora-group-took-place-at-london-bankside/\">European Edition Global Blockchain Congress by Agora Group Took Place at London Bankside</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-07T07:45:57.000Z",
    "title": "Shiba Inu (SHIB) Could Create Millionaires if It Reaches $0.0001: Expert",
    "url": "https://coinedition.com/shiba-inu-shib-could-create-millionaires-if-it-reaches-0-0001-expert/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Shiba-Inu-Could-It-Hit-1-and-Make-You-a-Millionaire-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The recent hype surrounding Shiba Inu (SHIB) had many cryptocurrency experts exploring the theory that the meme coin could make traders millionaires, according to a Twitter post shared by influencer Keyur Rohit earlier today. These theories were mostly fueled by the fact that SHIB’s price surged by more than 16% over the past three days [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/shiba-inu-shib-could-create-millionaires-if-it-reaches-0-0001-expert/\">Shiba Inu (SHIB) Could Create Millionaires if It Reaches $0.0001: Expert</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]