[
  {
    "source": "Cointelegraph",
    "date": "2023-08-31T05:43:00.000Z",
    "title": "Crypto may see second wind in the US as courts 'rein in the SEC' — Lawyer",
    "url": "https://cointelegraph.com/news/sec-losses-could-reignite-crypto-industry-us-says-lawyer",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/f226fe3e-a1ae-4dd5-a685-3c92869710b8.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Crypto-focused lawyer Jeremy McLaughlin said the U.S. digital asset industry may re-ignite as the country's securities regulator racks up court losses.</p>\n                    <p><p>There are hopes that the United States could see a new crypto resurgence after several rulings this year have seen court judges “rein in the SEC,” according to a digital asset lawyer from K&amp;L Gates.</p><p>On Aug. 31, Jeremy McLaughlin, a partner at the global law firm, noted that multiple U.S. court cases have stomped on arguments from Securities and Exchange Commission chair <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/gary-gensler\">Gary Gensler</a> — who has said that <a href=\"https://cointelegraph.com/news/crypto-lawyers-flame-gensler-over-claims-that-all-crypto-are-securities\">almost all</a> digital assets are securities.</p><p>McLaughlin was speaking on a panel at Intersekt23 in Melbourne alongside payment services firm Novatti chief Effie Dimitropoulos and Invest Hong Kong <a href=\"https://cointelegraph.com/news/hong-kong-turns-to-japan-for-advice-after-mind-boggling-web3-influx\">fintech head King Leung</a>.</p><p>He said early crypto regulation happened at the state level and was “pretty clear what you needed to do” but after the SEC and the Commodity Futures Trading Commission got involved “a lot of the market started to close up.”</p><p>“People delisted tokens, some companies pulled out of the U.S. because they saw how aggressive the SEC was being, and continues to be,” McLaughlin said.</p><blockquote>“Now that the courts are starting to rein in the SEC a bit, I think there's some hope that the industry is kind of igniting again in the U.S.”</blockquote><p>In recent months the SEC has been handed a loss in a suit it brought against a crypto firm and also lost a suit a crypto firm brought against it.</p><p>On Aug. 29 a U.S. District Court judge ruled against the SEC over Grayscale Investments being denied its application to convert its flagship Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) fund into an exchange-traded fund. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2dee84b6-a518-4797-985d-6b1f89fa143c.JPG\"  /><figcaption style=\"text-align: center;\"><em>Dimitropoulos (center-left), McLaughlin (center-right) and Leung (right) speaking on a panel regarding crypto regulation. Source: Tom Mitchelhill/Cointelegraph</em></figcaption></figure><p>In July, the SEC also took a partial loss in its case against Ripple Labs over XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) sales when a <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">judge ruled</a> it wasn’t a security when sold to retail traders.</p><p>“To be a lawyer in the space, it’s quite difficult to advise clients,” McLaughlin remarked. He added he it was also frustrating that he couldn’t give clients clear answers.</p><p>He does see hope, however, that crypto regulations are emerging from the “pit of chaos.”</p><p>“Finally, there are cases that are being filed and the decisions have been going strongly in the favor of the digital asset industry,” McLaughlin added.<em></em></p><h3>Aussies ‘lagging’ while others gain</h3><p>In another part of the discussion, the panelists were asked about their thoughts on the state of Australia’s crypto legislation, compared to others. Novatti’s Dimitropoulos had one word: “Lagging.”</p><p>Dimitropoulos pointed to new regulatory frameworks <a href=\"https://cointelegraph.com/news/hong-kong-welcomes-first-licensed-retail-crypto-exchange-hashkey\">in Hong Kong</a> and the European Union as proof Australia’s crypto regulations were falling behind.</p><blockquote>“It's very clear to say that Australia is lagging. What that means [...] Is how that affects on-the-ground businesses that are operating with digital assets.”</blockquote><p>She highlighted the overhead needed for local crypto firms to get legal advice “that could be defunct in three minutes' time.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinbase-stock-surges-after-favorable-federal-ruling-for-grayscale\"><strong><em>Coinbase stock surges after favorable federal ruling for Grayscale</em></strong></a></p><p>“We hear the Treasurer is going to come out with regulation, [the Australian Securities and Investments Commisson] is going to do something, Senator Bragg's bill in play,” she said.</p><blockquote>“There are so many pieces that are still in play with no clear resolution as to when it's going to happen. So that supports my word: ‘Lagging.’”</blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T06:02:52.000Z",
    "title": "Security Concerns Arise as AI Chatbots Gain Popularity, UK Cybersecurity Agency Cautions",
    "url": "https://www.cryptopolitan.com/security-concerns-to-the-use-of-ai-chatbots/",
    "description": "The National Cyber Security Center (NCSC) of the United Kingdom has issued a significant advisory to companies exploring the integration of AI-powered chatbots into their operations. The center&#8217;s experts have discovered a pressing issue: These advanced AI chatbots, or large language models (LLMs), can be manipulated to perform harmful tasks, raising substantial security concerns. The ... <a title=\"Security Concerns Arise as AI Chatbots Gain Popularity, UK Cybersecurity Agency Cautions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/security-concerns-to-the-use-of-ai-chatbots/\" aria-label=\"More on Security Concerns Arise as AI Chatbots Gain Popularity, UK Cybersecurity Agency Cautions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T05:57:31.000Z",
    "title": "Polygon’s MATIC to undergo revolutionary transformation into POL token",
    "url": "https://www.cryptopolitan.com/polygons-matic-transformation-into-pol-token/",
    "description": "In a recent revelation that has sent ripples through the cryptocurrency community, Sandeep Nailwal, the founder of Polygon Labs, announced a significant upgrade to Polygon&#8217;s native token, MATIC. The token is set to metamorphose into POL, a groundbreaking &#8220;third-generation&#8221; cryptocurrency. This transformation is not merely a rebranding exercise but represents a massive technical leap forward ... <a title=\"Polygon&#8217;s MATIC to undergo revolutionary transformation into POL token\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygons-matic-transformation-into-pol-token/\" aria-label=\"More on Polygon&#8217;s MATIC to undergo revolutionary transformation into POL token\">Read more</a>"
  }
]