[
  {
    "source": "Cointelegraph",
    "date": "2023-09-28T12:58:08.000Z",
    "title": "Coinbase International launches perpetual futures trading for retail customers ",
    "url": "https://cointelegraph.com/news/coinbase-starts-perpetual-futures-trading-retail-customers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/7f18b308-8290-4842-86ad-74386644126d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The recent regulatory approval for the international subsidiary of Coinbase comes within a month of getting the NFA nod to offer crypto derivatives services to institutional clients in eligible US states. </p>\n                    <p><p>Coinbase International Exchange, a class F license holder from the Bermuda Monetary Authority (BMA), <a href=\"https://www.coinbase.com/blog/coinbase-receives-regulatory-approval-to-enable-retail-perpetual-futures\" target=\"_blank\" rel=\"noopener nofollow\">announced </a>that it has received additional regulatory approval, allowing the platform to offer perpetual futures trading to non-US retail customers.</p><p>Launched in May 2023, Coinbase International already offered crypto derivates services to institutional clients. With the latest regulatory approval, the crypto platform will begin to offer eligible customers access to regulated perpetual futures contracts on the Coinbase Advanced platform in the coming weeks. The exchange notified that the Perpetual Futures accounts are maintained by Coinbase Bermuda Limited regulated by the BMA. </p><p>The crypto exchange claimed in its announcement that nearly 75% of crypto trading volume comes from the derivatives market, and the recent regulatory approval would help retail traders access the crypto derivatives market primarily dominated by the institutions.</p><p>The crypto platform also noted that Coinbase does not engage in market making, and said the liquidity on the exchanges is provided by established, independent liquidity providers who have undergone thorough compliance reviews.</p><p>Coinbase claimed its platform would prove the right gateway for retail traders to access the derivatives market in a secure, compliant manner. Only non-US consumers in a few countries can use Coinbase International Exchange, and customers are tested to evaluate their eligibility for this product before they can open a Coinbase Advanced trading account. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinbase-gains-legal-support-as-scholars-file-amicus-brief\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinbase-gains-legal-support-as-scholars-file-amicus-brief/amp\"><strong><em>Legal scholars file amicus brief in support of Coinbase</em></strong></a></p><p>The recent approval for Coinbase International to offer perpetual futures to retail customers comes just a month after the platform received approval from the National Futures Association (NFA) to offer <a href=\"https://cointelegraph.com/news/coinbase-wins-approval-to-offer-crypto-futures-in-us\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinbase-wins-approval-to-offer-crypto-futures-in-us/amp\">investments in crypto futures to eligible institutional clients</a> in the United States.</p><p>Coinbase has continued to make strides outside the U.S. despite facing a regulatory battle with the U.S. Securities and Exchange Commission over its services. The regulator <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-sues-coinbase-crypto-exchange/amp\">filed a lawsuit against Coinbase</a> in early June, alleging that the exchange violated local securities laws by selling unregistered securities.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-did-the-nsa-create-bitcoin/\"><strong><em>Big Questions: Did the NSA create Bitcoin?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-28T12:53:50.000Z",
    "title": "Unlocking $16 Trillion: First Tokenized Property Successfully Registered in EU Land Registry, Setting New Standards",
    "url": "https://cryptodaily.co.uk/2023/09/unlocking-16-trillion-first-tokenized-property-successfully-registered-in-eu-land-registry-setting-new-standards",
    "description": "Leading the Way in Secure Real Estate Tokenization, Blocksquare Redefines Property Ownership Through Notarized Transactions"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-28T12:46:58.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: ETH Moves to 1-Week High, as BTC Consolidates Recent Gains",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-eth-moves-to-1-week-high-as-btc-consolidates-recent-gains/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2124116891-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: ETH Moves to 1-Week High, as BTC Consolidates Recent Gains\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2124116891-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2124116891-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2124116891-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2124116891-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2124116891-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2124116891-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2124116891.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Ethereum climbed to a fresh one-week high on Thursday, as bulls kept price above a key resistance level. The move comes despite cryptocurrencies mostly consolidating in today&#x2019;s session, following Wednesday&#x2019;s rally. Bitcoin was marginally lower, retreating from recent gains. Bitcoin Bitcoin edged marginally lower on Thursday, as crypto markets consolidated, following strong gains the day [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T12:45:08.000Z",
    "title": "Meta Unveils genAI Tools to Revive Metaverse Strategy",
    "url": "https://www.cryptopolitan.com/meta-unveils-genai-tools-to-revive-metaverse-strategy/",
    "description": "In an ambitious move to reignite interest in its metaverse endeavors, Meta has unveiled a set of generative artificial intelligence (genAI) tools. These tools include celebrity-voiced AI-powered assistants and personalized digital characters that users can interact with, marking a significant leap into the world of generative AI. The announcement was made during Meta&#8217;s Connect conference ... <a title=\"Meta Unveils genAI Tools to Revive Metaverse Strategy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/meta-unveils-genai-tools-to-revive-metaverse-strategy/\" aria-label=\"More on Meta Unveils genAI Tools to Revive Metaverse Strategy\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-09-28T13:00:27.000Z",
    "title": "Boost Your Crypto Returns With Strong Investments Like Bitcoin Spark and XRP",
    "url": "https://nulltx.com/boost-your-crypto-returns-with-strong-investments-like-bitcoin-spark-and-xrp/",
    "description": "With the next crypto bull run fast approaching, industry watchers suggest you boost your crypto returns with strong investments like Bitcoin Spark (BTCS) and XRP. What is Bitcoin Spark? Bitcoin Spark is an exciting new entrant in the cryptocurrency space, aiming to bring the next generation of digital transactions by introducing cutting-edge technologies to the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-28T13:09:07.000Z",
    "title": "FOMC, BRICS de-dollarization, and the future of crypto",
    "url": "https://crypto.news/fomc-brics-de-dollarization-and-the-future-of-crypto/",
    "description": "With the BRICS nation exploring de-dollarization to minimize the impact of FOMC policies on the global market, does crypto have a role to play?"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-28T13:07:17.000Z",
    "title": "Everlodge plans for real estate ownership, Cardano development spikes ahead of Polkadot upgrade",
    "url": "https://crypto.news/everlodge-plans-for-real-estate-ownership-cardano-development-spikes-ahead-of-polkadot-upgrade/",
    "description": "Everlodge plans to reshape real estate ownership. ELDG presale is ongoing and has attracted Polkadot and Cardano investors"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-28T13:00:11.000Z",
    "title": "Dogecoin Price Revival: How Increasing Demand At $0.060 Matters",
    "url": "https://www.newsbtc.com/news/dogecoin-price-revival-how-increasing-demand-at-0-060-matters/",
    "description": "Dogecoin (DOGE) has recently displayed resilience as it found substantial buying support at the $0.059 level, a zone that has remained unbreached on a daily candle close for nearly a year.  This newfound buying activity hints at a potential challenge to the overhead resistance, marking a crucial juncture for the popular meme coin&#8217;s price trajectory. The cryptocurrency market often witnesses sideways trends, characterized by a lack of significant upward or downward movement. DOGE appears to be embracing this sideways movement, oscillating between the overhead trendline and the $0.059 mark. This kind of price action typically indicates indecision among investors, with buyers and sellers locked in a tug of war. Related Reading: Shiba Inu At $0.0000072: Sellers Push For Breakout From Compact Zone At the time of writing, DOGE stands at $0.060772 on CoinGecko, displaying a minor 0.1% decline over the past 24 hours and a 3.7% dip in the last seven days. The $0.06 price level carries more weight than just a numerical value; it represents a psychological threshold that has repeatedly seen DOGE rebound from its depths. The question on everyone&#8217;s mind is whether it can maintain its reliability this time. Dogecoin Battle With Resistance In the midst of this lateral price movement, DOGE is on a collision course with a downward-sloping resistance trendline. This trendline has already repelled the price on three separate occasions, signifying a formidable defense by sellers at this level. Price analysis shows that should this resistance intensify, DOGE could find itself revisiting the $0.059 support level, reaffirming its significance. Dogecoin is selling at $0.060 today. Chart: TradingView.com Both the $0.059 horizontal level and the overhead resistance are pivotal factors influencing Dogecoin&#8217;s price trajectory. Until one of these levels is decisively breached, the price is likely to remain within a relatively tight range, keeping traders and investors on their toes. Consistent Support And Potential Catalysts A separate report highlights DOGE&#8217;s consistent trading volume and network activity, indicating a robust support level. This sustained stability could serve as a catalyst for future price movements, potentially propelling DOGE to new heights or solidifying its reputation for stability. DOGE seven-day price action. Source: Coingecko Related Reading: Solana Bulls Struggle To Break $21 Barrier – What Lies Ahead? However, it&#8217;s important to remember that the cryptocurrency market is notoriously volatile. While past performance can offer insights, it&#8217;s by no means a guarantee of future results. Thus, investors should exercise caution, conduct thorough due diligence, and remain vigilant as DOGE navigates its current price territory. Dogecoin&#8217;s recent price action at the $0.059 support level and its ongoing battle with overhead resistance offer critical insights into its near-term trajectory. As the market keeps a close watch on DOGE&#8217;s performance, its ability to maintain stability could hold the key to its future price movements, with the $0.06 threshold serving as a psychological frontier that investors and traders continue to monitor closely. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T12:50:21.000Z",
    "title": "Ripple’s XRP Set for a Remarkable 7,918% Rally to $39, Analyst Predicts",
    "url": "https://www.crypto-news-flash.com/ripples-xrp-set-for-a-remarkable-7918-rally-to-39-analyst-predicts/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-xrp-set-for-a-remarkable-7918-rally-to-39-analyst-predicts",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />A crypto analyst identifies a potential 7,918% rally for XRP, targeting a $39 valuation based on a recurring historical pattern and Z-score analysis. The Z-score analysis elucidates the statistical relationship of XRP&#8217;s price point to its mean, mirroring a similar trend from 2017 which led to a noteworthy price rally. As the blockchain ecosystem continues [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T12:48:37.000Z",
    "title": "Bitcoin Faces Potential Risk as US Dollar Index Surges",
    "url": "https://www.crypto-news-flash.com/bitcoin-faces-potential-risk-as-us-dollar-index-surges/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-faces-potential-risk-as-us-dollar-index-surges",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T095615.302.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T095615.302.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T095615.302-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T095615.302-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The US dollar&#8217;s strength is at a 10-month high, worrying some about its effects on Bitcoin and cryptocurrencies. Economic factors like inflation and investor behavior are influencing the dollar&#8217;s rise. The Dollar Strength Index (DXY) recently saw a significant surge, reaching its highest point in nearly a year. This suggests a strong preference for the [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-28T13:05:07.000Z",
    "title": "How the Blockchain Has Helped Change Casino Games?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-the-blockchain-has-helped-change-casino-games/",
    "description": "<p>You might have seen crypto casino games mentioned and wondered what these are. This isn’t as complicated a subject as some people want you to believe. So, let’s take a look at the different parts of these games to understand what you need to know and see how the blockchain has changed casinos so far, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-the-blockchain-has-helped-change-casino-games/\">How the Blockchain Has Helped Change Casino Games?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-28T12:55:00.000Z",
    "title": "An Approved Futures ETF for Ethereum Would Be Game-Changing: Expert",
    "url": "https://coinedition.com/an-approved-futures-etf-for-ethereum-would-be-game-changing-expert/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Ethereum-Price-Analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum-Price-Analysis\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Ethereum-Price-Analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Ethereum-Price-Analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Ethereum-Price-Analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Ethereum-Price-Analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Ethereum-Price-Analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Ethereum-Price-Analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Dr. Julian Hosp, CEO of Cake Group, an approved Futures Exchange Trust Fund (ETF) for Ethereum would be a game-changing development for the cryptocurrency market. Hosp noted that an Ethereum ETF would significantly impact the market because there are no institutional rails into Ethereum, unlike Bitcoin, where several institutional investors are already involved. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/an-approved-futures-etf-for-ethereum-would-be-game-changing-expert/\">An Approved Futures ETF for Ethereum Would Be Game-Changing: Expert</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]