[
  {
    "source": "CoinDesk",
    "date": "2024-01-11T22:41:22.000Z",
    "title": "The Biggest Bitcoin ETF Threat No One Is Talking About",
    "url": "https://www.coindesk.com/consensus-magazine/2024/01/11/the-biggest-bitcoin-etf-threat-no-one-is-talking-about/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A majority of bitcoin ETF issuers have chosen Coinbase as a custodian, which is a concentration of risk. Even if that is the safest option, new cybersecurity standards are needed for making crypto custody truly safe."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-11T23:00:01.000Z",
    "title": "Valkyrie Exec Expects SEC To Approve XRP ETF, Can This Push Price To $100?",
    "url": "https://www.newsbtc.com/analysis/xrp/valkyrie-exec-xrp-etf-price-100/",
    "description": "With the advent of Spot Bitcoin ETFs which were approved by the United States Securities and Exchange Commission (SEC) on Wednesday, crypto investors have quickly turned their attention to the next big thing which might be XRP ETFs. This is picking up steam as Steve McClurg, Chief Investment Officer (CIO) for Valkyrie, has lent his voice to the cause. Valkyrie Exec Says XRP ETF Could Be Next In an interview with Bloomberg, McClurg reveals that with the approval of Spot Bitcoin ETFs, the expectation is that altcoins will soon follow the same path. He explains that attention could be turned to Ethereum, which is currently the second-largest cryptocurrency in the space. McClurg figures that a lot of filings are going to be submitted for Ethereum ETFs after this. Related Reading: Coinbase Expects A Repeat Of 2018-2022 Bitcoin Cycle, What This Means For Crypto Beyond the expected ETF filings for Ethereum, the Valkyrie CIO mentions that the likes of Ripple’s XRP could be the next in line to get approved for an ETF. “It wouldn’t surprise me if we saw Ripple or Ethereum spot ETFs out there,” McClurg said during the interview. Although McClurg showed optimism regarding a possible XRP ETF, he revealed that there was no indication of whether Valkyrie was going to get involved in it or not. Valkyrie, who has been heavily involved in Bitcoin and Ethereum ETFs, has not shown any interest in the altcoin so far. However, the CIO explained that crypto can be incredibly unpredictable. Given this, it is impossible to know where the market will end up swinging and what asset managers will take an interest in next. Token price resumes price rally &#124; Source: XRPUSD On Tradingview.com ETF Talks For Altcoins Heat Up The discussions for a possible XRP ETF are not new, especially as the arguments for Bitcoin Spot ETFs heated up. As a result, crypto researcher, ABS, who is part of the 3T Warrior Academy gave a rundown of what the impact of a possible XRP ETF would be. ABS explains that this could give rise to more interest from institutional investors as they could easily gain exposure to the asset with an ETF. Additionally, it would also propel XRP into the mainstream as marketing would take off. This would obviously increase interest around the world, and finally, XRP ETF would give the crypto a liquidity life-off. Related Reading: Crypto Analyst Identifies XRP Bear Flag To Trigger A Massive Crash To $0.07 The effect that an ETF would have on the price of the asset can be gauged by what happened in November when rumors emerged that BlackRock had applied for an XRP ETF. As the rumor spread, the XRP price surged rapidly, before correcting back downward once the rumors were dispelled. Nevertheless, this performance from the altcoin showed the readiness of the market for an XRP ETF. In the case of the altcoin’s price reaching as high as $100, it is likely not happening in the next few years. However, there is no doubt that the approval of an XRP spot ETF would help propel it faster toward this goal. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Coinmarketcap, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-11T23:01:29.000Z",
    "title": "Coinbase Expanding to Africa by Teaming Up With Leading African Stablecoin Exchange Yellow Card",
    "url": "https://dailyhodl.com/2024/01/11/coinbase-expanding-to-africa-by-teaming-up-with-leading-african-stablecoin-exchange-yellow-card/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Granted-Operating-License.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" /><p>The top US-based crypto exchange platform is venturing into Africa after announcing that will be teaming up with Yellow Card, a leading African stablecoin exchange. In a new blog post, Coinbase says that as part of its plan to reach 20 countries on the continent, it&#8217;s partnering up with Yellow Card to provide millions of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/11/coinbase-expanding-to-africa-by-teaming-up-with-leading-african-stablecoin-exchange-yellow-card/\">Coinbase Expanding to Africa by Teaming Up With Leading African Stablecoin Exchange Yellow Card</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]