[
  {
    "source": "CoinDesk",
    "date": "2023-06-20T17:47:40.000Z",
    "title": "EU Commission’s Digital Euro Bill Back on Track for June 28, Lead Official Says",
    "url": "https://www.coindesk.com/policy/2023/06/20/eu-commissions-digital-euro-bill-back-on-track-for-june-28-lead-official-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The European Commission is back on track to publish legislation on a digital euro on June 28, after the controversial topic was previously removed from the executive’s agenda, the bloc’s lead financial services official said on Tuesday."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-20T17:47:18.000Z",
    "title": "University of Nicosia Lets Students Become ‘Masters of the Metaverse’",
    "url": "https://www.coindesk.com/web3/2023/06/20/university-of-nicosia-lets-students-become-masters-of-the-metaverse/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Cyprus-based university is building on its roster of blockchain degrees, teaching students how to design and manage virtual worlds with its Master of Science (MSc) in Metaverse degree."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-20T18:00:00.000Z",
    "title": "BIS releases unified ledger proposal for cross-border, tokenized asset transactions",
    "url": "https://cointelegraph.com/news/bis-releases-unified-ledger-proposal-cross-border-tokenized-asset-transactions",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/ba080e5f-36d0-414d-8235-84ffd70964bd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Like the IMF’s single ledger proposal released a day earlier, BIS' unified ledger uses familiar concepts, such as tokenization, without the blockchain. </p>\n                    <p><p>The Bank for International Settlements (BIS) has released a chapter of its annual report early. That chapter, on the future of the monetary system, discussed “a new type of financial market infrastructure – a unified ledger.” The chapter was published June 20, one day after the International Monetary Fund (IMF) released a paper describing its “single ledger” cross-border payments concept.</p><p>The BIS proposal harnesses central bank digital currency (CBDC) and tokenized assets into “a new type of financial market infrastructure,” that is, the unified ledger, which would be powered by application programming interfaces (APIs). The authors of the proposal critiqued existing financial technology. They <a href=\"https://www.bis.org/publ/arpdf/ar2023e3.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a>:</p><blockquote>“The collapse of crypto and the faltering progress of other tokenisation projects underline a key lesson. The success of tokenisation rests on the foundation of trust provided by central bank money and its capacity to knit together key elements of the financial system.” </blockquote><p>One drawback of current tokenization schemes is that they exist in silos, the proposal claimed. A unified ledger would incorporate the ledgers of the counterparties, programmed reconciliation and messaging, enabling faster transactions and atomic (simultaneous) settlement in a “partitioned data environment” where privacy and transparency are controlled. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/digitalization-won-t-displace-commercial-bank-money-any-time-soon-moody-s\">Digitalization won’t displace commercial bank money any time soon: Moody’s</a></em></strong></p><p>A unified ledger system would allow for considerable disintermediation in transactions with securities. Cross-border transactions would require more coordination, assuming an intermediated system with the presence of both central banks and private payment service providers. </p><p>BIS general manager Agustín Carstens <a href=\"https://cointelegraph.com/news/bis-head-describes-ideal-unified-ledger-for-central-banks-and-other-financial-users\">first mentioned unified ledger technology</a> at the Singapore FinTech Festival in February. Like the IMF “single ledger” <a href=\"https://cointelegraph.com/news/imf-new-class-cross-border-payment-platform-single-ledger\">introduced a day earlier</a>, the unified ledger uses concepts and technology familiar in the cryptocurrency community. The IMF proposal <a href=\"https://cointelegraph.com/news/imf-cbdc-gets-feedback-from-crypto-community\">was met with immediate pushback</a> from the crypto community. </p><p>Neither the single ledger nor the BIS unified ledger crucially rely on blockchain technology. Project Rosalind, undertaken by the BIS and the Bank of England, <a href=\"https://cointelegraph.com/news/uk-cbdc-closer-after-project-rosalind-tests\">also depended on API</a> technology. The full BIS annual report is due out on June 25.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/georgia-crypto-crucial-tool-for-refugees-escaping-war/%5d\">In Georgia, crypto is a crucial tool for refugees escaping the war</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-20T17:57:06.000Z",
    "title": "Bitcoin rallies past $27k, while ETH/BTC ratio sinks",
    "url": "https://cryptoslate.com/insights/bitcoin-rallies-past-27k-while-eth-btc-ratio-sinks/",
    "description": "<p>Quick Take Bitcoin has surpassed the $27,000 mark for the first time since June 7, indicating a notable recovery from previous challenges. It&#8217;s noteworthy that this resurgence comes in the wake of significant regulatory pressures faced by Bitcoin concerning the SEC lawsuits against major platforms Coinbase and Binance. In a more optimistic development, the prospect [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-rallies-past-27k-while-eth-btc-ratio-sinks/\">Bitcoin rallies past $27k, while ETH/BTC ratio sinks</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-20T17:54:38.000Z",
    "title": "Crypto.com Trading Practices Called into Question",
    "url": "https://cryptodaily.co.uk/2023/06/cryptocom-trading-practices-called-into-question",
    "description": "<p>A recent report by the Financial Times revealed Crypto.com operates proprietary trading and market-making teams. </p>\n<p>A report by the Financial Times revealed that Singapore-based crypto exchange Crypto.com has teams trading tokens for profit. Citing five unnamed people with direct knowledge of the company&rsquo;s trading practices, the report indicates that the exchange operates proprietary trading and market-making teams.</p>\n<p>One of the persons with direct knowledge about the exchange&rsquo;s trading teams said executives at Crypto.com gave external trading houses &ldquo;absolutely dramatic sworn statements that Crypto.com was in no way involved in trading.&rdquo; Another person said employees at the exchange were asked to &ldquo;say there is no internal market maker type operation.&rdquo;</p>\n<p>Crypto.com denied these claims and said employees were not asked to lie to other trading houses. The exchange conceded that it does have an internal market maker but said, &ldquo;This is not a controversial practice.&rdquo;</p>\n\n<p>We have an internal market maker that operates on the Crypto.com exchange and that internal market maker is treated exactly the same as third-party market makers that identically facilitate tight spreads and efficient markets on our platform.</p>\n\nExchange Revenue Is Derived from Its Retail Trading App\n<p>The exchange told media publication Decrypt that it does not rely on proprietary trading as a source of revenue, as the Financial Times reported. In an email, the exchange said:</p>\n\n<p>This market making activity is a regulated practice, as long as there is a level playing field, i.e. all market makers have to follow the same ruleset, that assures market fairness &amp; integrity.</p>\n\n<p>The company further told the Financial Times that most of its revenue comes from its retail trading app, where the exchange was traders&rsquo; counterparty for transactions and which operated as a broker model.</p>\n\n<p>As such, the Crypto.com trading team ensures that Crypto.com is risk neutral by hedging these positions on a number of venues, including the Crypto.com exchange, the exchange said.</p>\n\n<p>One of the people familiar with the matter said the company&rsquo;s proprietary trading desk trades on Crypto.com&rsquo;s exchange and other venues. Another person added that the proprietary trading team&rsquo;s sole objective is the make money &ldquo;and not facilitating an exchange.&rdquo;</p>\n<p>The exchange&rsquo;s trading practices have been called into question during intense regulatory scrutiny in the US. The SEC recently accused crypto exchange Binance and its rival Coinbase of securities violations. In response to the lawsuits, SEC Chairman Gary Gensler told CNBC:</p>\n\n<p>These trading platforms, they call themselves exchanges, are commingling a number of functions.</p>\n\n<p>He added:</p>\n\n<p>In traditional finance, we don&rsquo;t see the New York Stock Exchange also operating a hedge fund, making markets.</p>\n\nCrypto.com Shutters US Institutional Exchange Services\n<p>Following the news of the SEC&rsquo;s lawsuits against Binance and Coinbase, Crypto.com announced that it would shut down its institutional exchange services for US customers. The exchange explained that demand is drying up due to the current market landscape in the US.</p>\n<p>The company did not specifically reference the regulatory action, but it was undoubtedly a concern for the exchange.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T17:56:35.000Z",
    "title": "Top Cryptocurrency Exchanges that Don’t Require KYC, Are They Better?",
    "url": "https://www.cryptopolitan.com/top-cryptocurrency-exchanges-that-dont-require-kyc/",
    "description": "In the realm of cryptocurrencies, privacy and freedom are paramount. Many investors turn to digital assets to enjoy financial autonomy, a cornerstone of which is anonymity. Yet, this is often compromised by Know Your Customer (KYC) regulations on many cryptocurrency exchanges.&#160; However, for those yearning for the sanctity of privacy, there are exchanges that stand ... <a title=\"Top Cryptocurrency Exchanges that Don&#8217;t Require KYC, Are They Better?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-cryptocurrency-exchanges-that-dont-require-kyc/\" aria-label=\"More on Top Cryptocurrency Exchanges that Don&#8217;t Require KYC, Are They Better?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T17:50:28.000Z",
    "title": "How to Find the Next Free NFT Giveaway?",
    "url": "https://www.cryptopolitan.com/how-to-find-the-next-free-nft-giveaway/",
    "description": "NFTs are like unique digital treasures that are making waves across the internet, with everyone from artists to sports stars jumping aboard the NFT train.  But did you know that you can also get your hands on NFTs for free through giveaways? Yes, that&#8217;s right! In this guide, we&#8217;re going to walk you through how ... <a title=\"How to Find the Next Free NFT Giveaway?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-to-find-the-next-free-nft-giveaway/\" aria-label=\"More on How to Find the Next Free NFT Giveaway?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T17:47:04.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s&#160;Solana price&#160;is $15.98 with a 24-hour trading volume of $130,897,839.&#160;Solana is up 2.68% in the last 24 hours.&#160;The current CoinMarketCap ranking is #10, with a live market cap of $1,273,881,101.&#160;It has a circulating supply of 394,890,490 SOL coins&#160;and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T18:00:37.000Z",
    "title": "Cardano $ADA, Tron $TRX, and Hollywood X PEPE $HXPE: A Comparative Review of Cryptocurrencies with an Emphasis on HXPE’s Superiority",
    "url": "https://www.crypto-news-flash.com/cardano-ada-tron-trx-and-hollywood-x-pepe-hxpe-a-comparative-review-of-cryptocurrencies-with-an-emphasis-on-hxpes-superiority/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-ada-tron-trx-and-hollywood-x-pepe-hxpe-a-comparative-review-of-cryptocurrencies-with-an-emphasis-on-hxpes-superiority",
    "description": "In the bustling world of cryptocurrencies, it can be a daunting task to identify the best performing and promising digital assets. In this blog post, we’ll compare three diverse cryptocurrencies, namely Cardano $ADA, Tron $TRX, and Hollywood X PEPE $HXPE. While each of these coins has unique features and advantages, there are compelling reasons to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T18:00:20.000Z",
    "title": "BNB may be in danger, but Avorak could bring new life to BNB Smart Chain",
    "url": "https://www.crypto-news-flash.com/bnb-may-be-in-danger-but-avorak-could-bring-new-life-to-bnb-smart-chain/?utm_source=rss&utm_medium=rss&utm_campaign=bnb-may-be-in-danger-but-avorak-could-bring-new-life-to-bnb-smart-chain",
    "description": "The recent SEC lawsuit against Binance and its CEO has undeniably shaken the cryptocurrency world, particularly its US arm. In the face of this uncertainty, a rejuvenating solution emerges. Avorak AI, built on the Binance Smart Chain network. offers a potential avenue for revitalizing the ecosystem and restoring confidence among traders and investors. Binance Coin [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-20T18:05:51.000Z",
    "title": "Billionaire Chamath Palihapitiya Warns Massive ‘Debt Wall’ To Hit Corporate America and Incinerate Equity Values",
    "url": "https://dailyhodl.com/2023/06/20/billionaire-chamath-palihapitiya-warns-massive-debt-wall-to-hit-corporate-america-and-incinerate-equity-values/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/seven-wallets-initiated.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/seven-wallets-initiated.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/seven-wallets-initiated.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/seven-wallets-initiated.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/seven-wallets-initiated.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/seven-wallets-initiated.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/seven-wallets-initiated.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Social Capital CEO and early Bitcoin investor Chamath Palihapitiya is issuing a warning that many of America&#8217;s biggest firms could be ransacked by growing debt burdens. The investor tells his 1.6 million Twitter followers that the biggest secret hiding in plain sight right now is the &#8220;massive debt wall&#8221; about the hit Corporate America. Says [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/20/billionaire-chamath-palihapitiya-warns-massive-debt-wall-to-hit-corporate-america-and-incinerate-equity-values/\">Billionaire Chamath Palihapitiya Warns Massive ‘Debt Wall’ To Hit Corporate America and Incinerate Equity Values</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]