[
  {
    "source": "Crypto Daily",
    "date": "2023-07-02T10:04:35.000Z",
    "title": "LBank Launches Global First Unlimited Crypto Credit Card, Breaking Boundaries in Cryptocurrency Payments",
    "url": "https://cryptodaily.co.uk/2023/07/lbank-launches-global-first-unlimited-crypto-credit-card-breaking-boundaries-in-cryptocurrency-payments",
    "description": "<p>Road Town, BVI, July 2nd, 2023, Chainwire</p><p>LBank, the world-leading cryptocurrency exchange, is soon to launch the world's first unlimited cryptocurrency credit card, aiming to break down the barriers of cryptocurrency payments. The card, available in both virtual and physical forms, allows users to make any consumer payments directly with cryptocurrency through LBank's credit, and also supports local cash withdrawals.&nbsp;</p><p>LBank's nearly 9 million users are expected to begin using this card in Q3 2023, and the exchange's VIP users will be granted the exclusive right to early access. The credit card will connect to LBank users' digital assets and can be used on various payment platforms like Google Pay. Upon acquiring the card, the app allows detailed viewing of each recharge and consumption record, enabling users to stay on top of their financial status at all times.&nbsp;</p><p>By using this card, LBank users can consume their assets within the exchange or withdraw assets in the form of fiat currency. The card does not have the quota limitations of ordinary credit cards; both consumption and withdrawals are unlimited. LBank's technical team indicated that more detailed information about payment options, such as fee tiers, will be announced as the card's launch date approaches.&nbsp;</p><p>Users who wish to obtain the LBank credit card can order it from the exchange's website. The card comes in different options, including a metal version. Certain users can also acquire a specially offered VIP version that provides up to 2% cashback when used.&nbsp;</p>\"For us, an important point is that users from all over the world can order and use our credit card. Our vision is to make crypto assets safer and circulation freer. Launching our own credit card is a significant step towards achieving this goal,\" stated Eric He, the founder of LBank.<p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge platform that ensures the integrity of users&rsquo; funds and aims to contribute to the global adoption of cryptocurrency.</p><p>Start Trading Now:&nbsp;lbank.com</p><p>Community &amp; Social Media:&nbsp;l&nbsp;Telegram&nbsp;l&nbsp;&nbsp;Twitter&nbsp;l&nbsp;&nbsp;Facebook&nbsp;l&nbsp;&nbsp;LinkedIn&nbsp;l&nbsp;&nbsp;Instagram&nbsp;l&nbsp;&nbsp;YouTube</p>ContactLBK Blockchain Co. Limitedpress@lbank.info"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-02T10:04:41.000Z",
    "title": "LBank Launches Global First Unlimited Crypto Credit Card, Breaking Boundaries in Cryptocurrency Payments",
    "url": "https://www.crypto-news-flash.com/lbank-launches-global-first-unlimited-crypto-credit-card-breaking-boundaries-in-cryptocurrency-payments/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-launches-global-first-unlimited-crypto-credit-card-breaking-boundaries-in-cryptocurrency-payments",
    "description": "Road Town, BVI, July 2nd, 2023, Chainwire LBank, the world-leading cryptocurrency exchange, is soon to launch the world&#8217;s first unlimited cryptocurrency credit card, aiming to break down the barriers of cryptocurrency payments. The card, available in both virtual and physical forms, allows users to make any consumer payments directly with cryptocurrency through LBank&#8217;s credit, and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-02T10:00:52.000Z",
    "title": "Blockchain Association: After SEC Chair Gary Gensler Sued Ripple (XRP), Binance, and Coinbase, Chair Has to Step Back",
    "url": "https://www.crypto-news-flash.com/blockchain-association-after-sec-chair-gary-gensler-sued-ripple-xrp-binance-and-coinbase-chair-has-to-step-back/?utm_source=rss&utm_medium=rss&utm_campaign=blockchain-association-after-sec-chair-gary-gensler-sued-ripple-xrp-binance-and-coinbase-chair-has-to-step-back",
    "description": "Industry veterans are now calling on SEC Chair Gary Gensler to step away from crypto enforcement actions. There have been allegations of the top cop favoring TradFi players. The entire digital asset industry feels under intentional attack from the Chairman of the United States Securities and Exchange Commission (SEC) Gary Gensler. Therefore, crypto lawyers and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-02T10:00:24.000Z",
    "title": "Top 5 Cryptocurrencies With Massive Growth Potential in 2023",
    "url": "https://www.crypto-news-flash.com/top-5-cryptocurrencies-with-massive-growth-potential-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=top-5-cryptocurrencies-with-massive-growth-potential-in-2023",
    "description": "Cryptocurrencies have transformed the financial environment, giving investors fresh opportunities and networks for profitable investments. While Bitcoin (BTC) and Ethereum (ETH) remain the most popular cryptocurrencies, there are other less prominent ones like Cardano (ADA), Golteum (GLTM) and more with enormous development potential.  In this article, we will dive into the world of hidden crypto [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-02T10:01:00.000Z",
    "title": "Bitcoin Leads Other Major World Assets With 83.8% Gain in H1 2023",
    "url": "https://coinedition.com/bitcoin-leads-other-major-world-assets-with-83-8-gain-in-h1-2023/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/The-average-returns-for-Bitcoin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin Leads Other Major World Assets With 83.8% Gain in H1 2023\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/The-average-returns-for-Bitcoin.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/The-average-returns-for-Bitcoin-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/The-average-returns-for-Bitcoin-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/The-average-returns-for-Bitcoin-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/The-average-returns-for-Bitcoin-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/The-average-returns-for-Bitcoin-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Reported data shows that Bitcoin’s value increased by 83.8% in the first half of 2023, ranking first and exceeding other major world assets by a significant margin. In the second position is the Nasdaq index, whose value increased by 31.7%. A 37% drop in value puts natural gas in the bottom position following the fall [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-leads-other-major-world-assets-with-83-8-gain-in-h1-2023/\">Bitcoin Leads Other Major World Assets With 83.8% Gain in H1 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]