[
  {
    "source": "NewsBTC",
    "date": "2023-07-12T02:00:02.000Z",
    "title": "Crypto Thief Busted: DOJ Files Charges Against 25-Year-Old For OpenSea NFT Heist",
    "url": "https://www.newsbtc.com/news/crypto-thief-busted-doj-files-charges-against-25-year-old-for-opensea-nft-heist/",
    "description": "The United States Department of Justice (DOJ) announced on July 10 the unsealing of a four-count indictment against Soufiane Oulahyane for a scheme to impersonate the OpenSea marketplace to obtain unauthorized access to cryptocurrency and non-fungible tokens (NFTs).  Oulahyane, currently in custody in Morocco for foreign charges, allegedly has stolen approximately $450,000 worth of cryptocurrency and NFTs. OpenSea NFT Theft According to the indictment filed by the US Department of Justice, Soufiane Oulahyane, the alleged hacker who stole $450,000 worth of cryptocurrency NFTs from a victim in Manhattan, sold several NFTs that belonged to the victim.  The NFTs sold by Oulahyane included pieces from popular series like &#8220;Bored Ape Yacht Club,&#8221; &#8220;Meebit,&#8221; &#8220;Bored Ape Kennel Club,&#8221; and &#8220;CryptoDad.&#8221; Per the press release, Oulahyane allegedly used a scheme to &#8220;spoof&#8221; the login page to the OpenSea marketplace by creating a fake website that looked like the real one. He used paid advertisements on a popular search engine to direct users to his fake website, where he tricked them into entering their login credentials or other private information.  Related Reading: BNB Whale Moves $35 Million To Binance Ahead Of Arkham (ARKM) Sale The information was automatically sent to an email account controlled by Oulahyane, who used it to gain unauthorized access to the victims&#8217; cryptocurrency wallets. Oulahyane is charged with wire fraud, use of an unauthorized access device, affecting transactions with an access device to receive something of value equal to or greater than $1,000, and aggravated identity theft.  If convicted, Oulahyane could face up to 20 years in prison for wire fraud, 10 years for using an unauthorized access device, 15 years for affecting transactions with an access device, and a mandatory consecutive sentence of two years for aggravated identity theft. Moreover, according to the press release, the DOJ emphasizes that digital assets, such as cryptocurrency and NFTs, are not immune from cyber fraudsters.  The charges against Oulahyane serve as a reminder that cybercrime techniques such as &#8220;spoofing&#8221; are still in use and can be adapted for use in the cryptocurrency space. The DOJ is committed to prosecuting these fraudsters in the US and abroad. Related Reading: ConsenSys To Launch Linea, Its ZK-Rollup Network, On Main Ethereum Network This indictment shows that law enforcement agencies are taking cybercrime in the cryptocurrency space seriously and are prepared to pursue individuals who engage in fraudulent activities. It is essential for users to exercise caution when dealing with digital assets and to take necessary security measures to protect their cryptocurrency wallets and NFTs from cyber criminals. Featured image from Unsplash, chart from TradingView.com "
  }
]