[
  {
    "source": "Cointelegraph",
    "date": "2023-06-26T18:45:25.000Z",
    "title": "Singapore central bank reports on tokenized asset network models after trials ",
    "url": "https://cointelegraph.com/news/mas-singapore-central-bank-reports-tokenized-asset-network-models-after-trials",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/c96c9db9-92e7-459d-b0ee-da22edcc295f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Three trial use cases have been completed as part of the project, and the report uses them as a “framework for consideration” of financial market infrastructure.</p>\n                    <p><p>As asset tokenization continues at a rapid pace, the Monetary Authority of Singapore (MAS) and 11 financial institutions examined infrastructure models to facilitate tokenized asset trading. The key to unlocking the full benefits of the technology is open and interoperable digital asset networks, the MAS said in its Project Guardian report <a href=\"https://www.mas.gov.sg/-/media/mas-media-library/development/fintech/project-guardian/project-guardian-open-interoperable-network.pdf\" target=\"_blank\" rel=\"noopener nofollow\">released</a> June 26.</p><p>Project Guardian identified options for platform type, asset type and network access with an eye to best practices. It used three test cases and drew observations on them while carefully noting that it does not endorse any of them.</p><p>The first use case was over-the-counter (OTC) foreign exchange transactions. A detailed examination <a href=\"https://cointelegraph.com/news/jp-morgan-executes-first-defi-trade-on-public-blockchain\">highlighted a collaboration</a> between DBS Bank and SBI Digital Asset Holdings. It concluded:</p><blockquote>“Trading in a permissioned liquidity pool protocol achieves greater efficiency by reducing friction and minimising risks, while the tokenised assets bring the benefits of atomic settlement.” </blockquote><p>The second use case was trade finance and focused on Standard Chartered Bank’s asset-backed securities tokenization. In this model, tokenized trade finance receivable assets are repackaged as natively issued fungible tokens and divided into two tranches with differing risk exposures. Trading in the “senior,” less risky tokens would “broaden the investor base for real economy assets,” the report concluded.  </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/tokenization-of-illiquid-assets-to-reach-16t-by-2030-report\">Tokenization of illiquid assets to reach $16T by 2030: Report</a></em></strong></p><p>The third use case was OTC-structured notes, which are “a popular wealth management product with substantial traction and demand in Asian wealth centres.” Currently, issuance of such notes is  labor-intensive and has manual elements, and the notes require a high level of servicing. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">.<a href=\"https://twitter.com/MAS_sg?ref_src=twsrc%5Etfw\">@MAS_sg</a> published a report proposing a framework for designing open, interoperable networks for <a href=\"https://twitter.com/hashtag/digitalassets?src=hash&amp;ref_src=twsrc%5Etfw\">#digitalassets</a>. MAS also announced an expansion of Project Guardian to test the potential of asset tokenisation across more financial asset classes.<br><br>READ: <a href=\"https://t.co/KXZ8FTqlUp\">https://t.co/KXZ8FTqlUp</a> <a href=\"https://t.co/jSnVO9APLM\">pic.twitter.com/jSnVO9APLM</a></p>&mdash; MAS (@MAS_sg) <a href=\"https://twitter.com/MAS_sg/status/1673274184955469825?ref_src=twsrc%5Etfw\">June 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>A network created by HSBC, Marketnode and United Overseas Bank produces OTC-structured notes in a “token factory” by whitelisting parties on a public, permissionless platform, resulting in greater efficiency in creating and distributing the notes. Those institutions are part of an industry-wide effort to establish common standards for asset issuance and exchange.</p><p>Project Guardian <a href=\"https://cointelegraph.com/news/singapore-to-explore-digital-asset-tokenization-on-public-chains\">was launched in May 2022</a>. It will continue to examine “other focused themes of Trust Anchors and Institutional DeFi.”</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/block-by-block-blockchain-technology-transforming-real-estate-market/\">Block by block: Blockchain technology is transforming the real estate market</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-26T19:08:28.000Z",
    "title": "Democrat lawmaker requests SEC, Treasury feedback over Republican-led crypto bill",
    "url": "https://cryptoslate.com/democrat-lawmaker-requests-sec-treasury-feedback-over-republican-led-crypto-bill/",
    "description": "<p>Congresswoman Maxine Waters requested the SEC and the Treasury Department to submit in writing their views and feedback on a recently submitted legislative proposal related to regulating digital assets. The letters were issued on June 26 and addressed to Treasury Secretary Janet Yellen and SEC chair Gary Gensler and pertained to the Digital Asset Market [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/democrat-lawmaker-requests-sec-treasury-feedback-over-republican-led-crypto-bill/\">Democrat lawmaker requests SEC, Treasury feedback over Republican-led crypto bill</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-26T18:41:52.000Z",
    "title": "Bitcoin Cash surged 108% over the last week after EDX Markets opened",
    "url": "https://cryptoslate.com/bitcoin-cash-surged-108-over-the-last-week-as-edx-markets-opened-for-business/",
    "description": "<p>Bitcoin Cash (BCH) has seen a dramatic surge in value, rising by 108% over the past seven days, following BlackRock&#8217;s application for a Bitcoin spot ETF with the SEC and the launch of EDX Markets. BlackRock&#8216;s application to the SEC for a Bitcoin spot ETF has triggered a wave of similar applications, creating a bullish [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-cash-surged-108-over-the-last-week-as-edx-markets-opened-for-business/\">Bitcoin Cash surged 108% over the last week after EDX Markets opened</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-06-26T18:40:52.000Z",
    "title": "FTX Owes its Customers A lot of Money: Internal Audit",
    "url": "https://cryptobriefing.com/ftx-owes-customers-billions/?utm_source=feed&utm_medium=rss",
    "description": "FTX, the infamous exchange that collapsed in November, is reportedly in debt to its customers for $8.7 billion, resulting from the mishandling and commingling deposits, according to an investigative report..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T18:56:48.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T18:55:27.000Z",
    "title": "Why is the crypto market down today? BTC at $30k",
    "url": "https://www.cryptopolitan.com/why-is-crypto-market-down-today-btc-at-30k/",
    "description": "The Bitcoin (BTC) price has reached a new annual peak, while the Crypto Market Cap is close to doing the same. The crypto markets are at an all-time high, although sentiment appears to be negative. Despite the price reaching a new yearly high, the proportion of the Bitcoin supply that has not changed in over ... <a title=\"Why is the crypto market down today? BTC at $30k\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-is-crypto-market-down-today-btc-at-30k/\" aria-label=\"More on Why is the crypto market down today? BTC at $30k\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T18:40:33.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-26T18:44:24.000Z",
    "title": "Azuki set to launch ‘Azuki Elementals’ NFT collection with 20k tokens",
    "url": "https://crypto.news/azuki-set-to-launch-azuki-elementals-nft-collection-with-20000-tokens/",
    "description": "Azuki's official Twitter account announced that the Azuki Elementals sale will commence on Tuesday, June 27 at 9:00 AM PT."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-26T19:00:27.000Z",
    "title": "Kaspa (KAS) Takes Altcoin Market By Storm With 60% Growth",
    "url": "https://www.newsbtc.com/altcoin/kaspa-kas-takes-altcoin-market-by-storm-with-60-growth/",
    "description": "Kaspa (KAS) has been making waves in the altcoin market lately, with its impressive surge of over 60% in the past 14 days, according to CoinGecko data.  The cryptocurrency is based on the GHOSTDAG protocol, which is a generalization of the Bitcoin Consensus. This protocol offers several advantages over traditional blockchain consensus mechanisms, including higher throughput and faster confirmation times. Kaspa Emerges As Top Performer Recently, the Kaspa team announced a significant new feature that is set to go live on the KAS testnet.  The 10BPS feature promises to deliver &#8220;unmatched&#8221; transaction speeds of up to 10,000 transactions per second (TPS). This is a massive improvement over the current transaction speeds of other major cryptocurrencies like Bitcoin and Ethereum, which typically offer only a fraction of this throughput. Related Reading: Lightning Network Hits Record Highs In Bitcoin And US Dollar Capacity According to the announcement, the 10BPS feature is currently being stress-tested on the KAS testnet, where it is setting new records for crypto BPS. 🚀Groundbreaking 10BPS will be live and public on the $KAS testnet at 7AM UTC. Stress testing block and transaction rates &#38; setting new records for #crypto #BPS. More on how to participate soon. Witness this milestone live: https://t.co/ZjXVeSwUKY#POW #RustyKas #rustlang pic.twitter.com/hjxXXhc5fo — Kaspa (@KaspaCurrency) June 26, 2023 This considerable jump in transaction speed could be a game-changer for the Kaspa protocol, as it looks to gain more market share from established Layer 1 protocols such as Ethereum, Cardano, and Solana. In addition to the 10BPS feature, the Kaspa blockchain offers several other impressive features that make it a compelling choice for developers and users alike. One of the key features of the Kaspa blockchain is its scalability. The protocol is designed to support a high throughput of transactions, which makes it well-suited for use cases that require fast and efficient processing.  This scalability is achieved through the use of the GHOSTDAG consensus mechanism, which allows for a high degree of parallelism and concurrency in the processing of transactions. Another key feature of the Kaspa blockchain is its security. The protocol is designed to be highly resistant to attacks, with a robust set of cryptographic algorithms and other security measures built in. This ensures that the network remains secure and reliable, even in the face of potential threats. Will KAS Bullish Momentum Continue? The cryptocurrency market has been on an upward trend lately, with many cryptocurrencies posting impressive gains over the past week.  Among these is KAS, which has seen a price increase of 28.90% in the last 7 days, outperforming both the global cryptocurrency market (up 9.80%) and similar Layer 1 (L1) cryptocurrencies (up 12.90%). As of today, KAS is trading at $0.02558, with a 24-hour trade volume of $9 million. While the price has declined slightly by 0.83% in the last 24 hours, the overall trend is positive, with the cryptocurrency market showing signs of recovery after a period of consolidation. Related Reading: Bitcoin Bullish Signal: Exchange Whale Ratio Plunges  In the short term, KAS is facing resistance at $0.02609, which it has struggled to break through since Saturday. However, if the token manages to overcome this resistance level and attract more players to its ecosystem, its bullish momentum may continue and new all-time highs could be within reach. Conversely, in the event of a further price drop, the $0.02449 level may serve as a support floor for KAS. This means that if the price falls to this level, it may find some buying support from investors looking to enter the market at a lower price. According to Coingecko, KAS has a total supply of 19 billion tokens, with a market capitalization of $495,310,928.  Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-26T18:51:00.000Z",
    "title": "Korean Authorities Ban Travel for Haru Invest, Delio, B&S Holdings Execs",
    "url": "https://coinedition.com/korean-authorities-ban-travel-for-haru-invest-delio-bs-holdings-execs/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/South-Koreas-Metaverse-Cities-and-NFT-Citizenship-Fascinate-Users.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Korean Authorities Ban Travel for Haru Invest, Delio, B&amp;S Holdings Execs\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/South-Koreas-Metaverse-Cities-and-NFT-Citizenship-Fascinate-Users.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/South-Koreas-Metaverse-Cities-and-NFT-Citizenship-Fascinate-Users-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/South-Koreas-Metaverse-Cities-and-NFT-Citizenship-Fascinate-Users-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/South-Koreas-Metaverse-Cities-and-NFT-Citizenship-Fascinate-Users-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/South-Koreas-Metaverse-Cities-and-NFT-Citizenship-Fascinate-Users-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Seoul authorities impose travel restrictions on individuals associated with Haru Invest, Delio, and B&#038;S Holdings. Haru Invest and Delio suspended withdrawals due to issues with service partner B&#038;S Holdings. Concerned users express worry about lack of information from Haru, leading to legal action. According to local reports from Digital Asset, the Seoul Southern District Prosecutors&#8217; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/korean-authorities-ban-travel-for-haru-invest-delio-bs-holdings-execs/\">Korean Authorities Ban Travel for Haru Invest, Delio, B&amp;S Holdings Execs</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-26T18:45:23.000Z",
    "title": "Robert F. Kennedy Jr. Says CBDCs Are Instruments of Oppression, Plans To Create Policies To Support Bitcoin",
    "url": "https://dailyhodl.com/2023/06/26/robert-f-kennedy-jr-says-cbdcs-are-instruments-of-oppression-plans-to-create-policies-to-support-bitcoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Catalyst-Could-Drive-Bitcoin-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Catalyst-Could-Drive-Bitcoin-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Catalyst-Could-Drive-Bitcoin-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Catalyst-Could-Drive-Bitcoin-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Catalyst-Could-Drive-Bitcoin-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Catalyst-Could-Drive-Bitcoin-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Catalyst-Could-Drive-Bitcoin-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Presidential candidate Robert F. Kennedy Jr. is making his stance on central banking digital currencies (CBDCs) clear, while also signaling support for Bitcoin (BTC). In a new interview with the New York Post, the nephew of former President John F. Kennedy says that if given power, he&#8217;d make policies that would support Americans&#8217; freedom to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/26/robert-f-kennedy-jr-says-cbdcs-are-instruments-of-oppression-plans-to-create-policies-to-support-bitcoin/\">Robert F. Kennedy Jr. Says CBDCs Are Instruments of Oppression, Plans To Create Policies To Support Bitcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-26T18:41:54.000Z",
    "title": "Largest Bank in Hong Kong HSBC Launches Bitcoin and Ethereum ETF Trading Services for Clients: Report",
    "url": "https://dailyhodl.com/2023/06/26/largest-bank-in-hong-kong-hsbc-launches-bitcoin-and-ethereum-etf-trading-services-for-clients-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/trading-giant-listed-challenger.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/trading-giant-listed-challenger.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/trading-giant-listed-challenger.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/trading-giant-listed-challenger.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/trading-giant-listed-challenger.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/trading-giant-listed-challenger.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/trading-giant-listed-challenger.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The largest bank in Hong Kong is reportedly now allowing clients to trade Bitcoin (BTC) and Ethereum (ETH) exchange-traded funds (ETFs). Crypto journalist Colin Wu reports that British multinational bank HSBC is now allowing BTC and ETH ETF trading on the Hong Kong exchange. &#8220;SCOOP: HSBC, the largest bank in Hong Kong, today allows its customers to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/26/largest-bank-in-hong-kong-hsbc-launches-bitcoin-and-ethereum-etf-trading-services-for-clients-report/\">Largest Bank in Hong Kong HSBC Launches Bitcoin and Ethereum ETF Trading Services for Clients: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]