[
  {
    "source": "Cointelegraph",
    "date": "2023-12-18T15:39:57.000Z",
    "title": " Warren’s surveillance legislation is tailor-made to help big banks ",
    "url": "https://cointelegraph.com/news/elizabeth-warren-surveillance-legislation-help-big-banks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTEvZmRhNWQzZjctYThlMC00ODAxLWJhZWEtN2ExYjUzMzk1NWUwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Warren's Digital Asset Anti-Money Laundering Act would shut crypto providers down — playing into the hands of the banking industry.</p>\n                    <p><p>It seems that every time Massachusetts Senator Elizabeth Warren fails to get an anti-crypto bill passed, she introduces a new draft. She has the strategy of messaging bills — legislation introduced for the purposes of media attention and fundraising more than actual passage — down to a science.</p><p>Warren's latest legislation, the Digital Asset Anti-Money Laundering Act, threatens to undermine crypto’s core principles of freedom and personal sovereignty. While Warren argues that her bill is necessary to combat illicit activities, a closer look reveals its potential to stifle innovation, endanger user privacy, and play right into the hands of big banks.</p><p>The bill, co-sponsored by Kansas Senator Roger Marshall, is based on a premise that digital assets are increasingly being used for criminal activities such as money laundering, ransomware attacks, and terrorist financing. While some bad actors exploit digital assets, the bill's approach of treating all developers and wallet providers as potential criminals is not only impractical but also dangerous.</p><p><a href=\"https://cointelegraph.com/news/elizabeth-warren-surveillance-legislation-help-big-banks\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-18T16:08:19.000Z",
    "title": "Why Polygon (MATIC) and Polkadot (DOT) Might Be the Smartest Crypto Investment? Revealing Analysis Inside",
    "url": "https://cryptodaily.co.uk/2023/12/why-polygon-matic-and-polkadot-dot-might-be-the-smartest-crypto-investment-revealing-analysis-inside",
    "description": "Join StealthEX's exciting giveaway and dive into our comprehensive article exploring the latest developments in the cryptocurrency market, focusing on MATIC (Polygon) and DOT (Polkadot). Discover how Polygon's shift to advanced cryptography and Polkadot's strategic industry partnerships are shaping their future price predictions. Stay ahead in the crypto world with our in-depth analysis and expert insights."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T15:57:28.000Z",
    "title": "NFT market indices show resilience despite major hack",
    "url": "https://www.cryptopolitan.com/nft-market-indices-show-resilience/",
    "description": "In the aftermath of a major hack on the NFT Trader platform, which resulted in the theft of nearly $3 million worth of Non-Fungible Tokens (NFTs), the crypto community has witnessed a swift and successful recovery of the stolen assets.&#160; The Bored Ape Yacht Club (BAYC) and Mutant Ape Yacht Club (MAYC) NFTs were returned [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T15:55:16.000Z",
    "title": "Hut 8’s Strategic Expansion: Developing a New Mining Site in Texas",
    "url": "https://www.cryptopolitan.com/hut-8s-expansion-a-new-mining-site-in-texas/",
    "description": "Canadian Bitcoin mining firm Hut 8 has announced an interim agreement to establish a new mining site in Cedarvale, Texas. The development, announced on December 18, is part of the ongoing proceedings surrounding the bankruptcy of the Celsius Network and represents a strategic expansion for Hut 8. The Cedarvale site is set to become a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T15:47:30.000Z",
    "title": "Solana memecoin jackpot: Trader turns $226K into $1.69m in lightning-fast gamble",
    "url": "https://www.cryptopolitan.com/solana-memecoin-jackpot-trader-turns-226k/",
    "description": "In the midst of the ongoing Solana memecoin frenzy, one intrepid trader has made headlines by turning a modest $226,000 investment into a staggering $1.69 million windfall in a mere five days.&#160; The key to this astonishing success? A beanie-wearing dog-themed cryptocurrency known as Dogwifhat (WIF). This remarkable feat has captured the attention of the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T15:43:07.000Z",
    "title": "Nvidia Faces Concerns Over AI Bias and Diversity Issues",
    "url": "https://www.cryptopolitan.com/nvidia-faces-concerns-over-ai-bias/",
    "description": "Former Nvidia employees, Masheika Allgood and Alexander Tsado, raised concerns about AI bias and its impact on minorities during a 2020 meeting with CEO Jensen Huang. The duo, representing Nvidia&#8217;s Black employees group, presented a warning about the potential dangers of AI, emphasizing the need to address unintended consequences affecting marginalized communities. Feeling unheard, both [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T16:06:47.000Z",
    "title": "Hut 8 signs interim deal for Texas mining amid Celsius bankruptcy",
    "url": "https://crypto.news/hut-8-signs-interim-deal-for-texas-mining-amid-celsius-bankruptcy/",
    "description": "As part of the Celsius Network's bankruptcy proceedings, Hut 8's mining operation is set to accommodate 66,000 miners and be powered by over 215 MW of energy upon completion."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T15:57:26.000Z",
    "title": "Altcoins lead day’s top cryptocurrency gainers",
    "url": "https://crypto.news/altcoins-lead-days-top-cryptocurrency-gainers/",
    "description": "According to CoinMarketCap, Astar, Stacks, and Helium were reported as today's top cryptocurrency gainers."
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-18T15:59:20.000Z",
    "title": "Circle Launches EURC on Solana for European Remittances",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/circle-launches-eurc-on-solana-for-european-remittances/",
    "description": "<p>As the leading euro-backed stablecoin, EURC&#8217;s goal is to lead European remittance corridors. With this development, Solana became the fourth blockchain to host EURC natively. Joining the ranks of Avalanche, Ethereum, and Stellar. Let&#8217;s discover more about this important news. EURC on Solana: Circle Expands Stablecoin Reach in Europe The integration allows seamless building and [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/circle-launches-eurc-on-solana-for-european-remittances/\">Circle Launches EURC on Solana for European Remittances</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-18T16:05:00.000Z",
    "title": "AVAX’s Price at Risk of Dropping Despite Surge in Network Activity ",
    "url": "https://coinedition.com/avaxs-price-at-risk-of-dropping-despite-surge-in-network-activity/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/avax6.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"AVAX’s Price at Risk of Dropping Despite Surge in Network Activity\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/avax6.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/avax6-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/avax6-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/avax6-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/avax6-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/avax6-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/avax6-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/avax6-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/avax6-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/avax6-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/avax6-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/avax6-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/avax6-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/avax6-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/avax6-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/avax6-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>72.3% of the gas consumed by the network was attributed to inscription activity. AVAX was testing a key support level and technicals suggested it may continue to drop. Wu Blockchain revealed that gas consumption for Avalanche’s C-Chain reached more than $20 million. Wu Blockchain revealed in an X post earlier today that gas consumption for [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/avaxs-price-at-risk-of-dropping-despite-surge-in-network-activity/\">AVAX’s Price at Risk of Dropping Despite Surge in Network Activity </a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]