[
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T21:30:00.000Z",
    "title": "Crypto Biz: Coinbase-Circle re-alignment, Binance fiat hurdles, and USDC at Shopify",
    "url": "https://cointelegraph.com/news/crypto-biz-coinbase-circle-re-alignment-binance-fiat-hurdles-and-usdc-at-shopify",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/9c922286-e413-4c8b-8cc3-ea8c5b74db49.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This week's Crypto Biz explores the latest on Binance's global on-ramps and off-ramps, Coinbase-Circle re-alignment, Shopify's take on USDC and China's blockchain data exchange. </p>\n                    <p><p>Global regulatory landscapes are once again proving to be a turning point for crypto companies, demanding constant adaptation to navigate shallow regulatory waters across the world, particularly in the United States.</p><p>In the latest developments, Coinbase and Circle decided to dissolve the Centre Consortium in a strategic realignment driven by demand for regulatory clarity on stablecoins, possibly as an anticipation of upcoming legislation coming from the U.S. Congress. </p><p>A legal alternative to remaining operational was also sought by Binance.US this week. The exchange announced a partnership with MoonPay featuring the dollar-pegged stablecoin Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) as its new “base asset” for all transactions, allowing a path for users to transact in U.S. dollars while possibly sidestepping potential regulatory hurdles.</p><p>In the meantime, global Binance continues facing challenges with on and off-ramps. Almost 30 days before Paysafe ends its support for fiat transactions in Europe, its users in the region are reporting difficulties with fiat withdrawals.</p><p>In this environment, fast adaptation is more than a strategy, it's a survival skill. For now, crypto firms dance to songs that are yet to be written.</p><p>This week's Crypto Biz explores the latest on Binance's global on-ramps and off-ramps, Coinbase-Circle re-alignment, Shopify's take on USDC and China's blockchain data exchange.</p><h2>Binance limits withdrawals in Europe, cites payment processor issues</h2><p>Customers of crypto exchange Binance <a href=\"https://cointelegraph.com/news/binance-limits-withdrawals-in-europe\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-limits-withdrawals-in-europe/amp\">are allegedly facing troubles with fiat withdrawals</a> in Europe due to issues related to Single Euro Payments Area (SEPA) transfers. The news comes a few months after Binance informed users that its euro banking partner, Paysafe Payment Solutions, would <a href=\"https://cointelegraph.com/news/binance-loses-support-of-euro-banking-partner\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-loses-support-of-euro-banking-partner/amp\">discontinue support</a> for the crypto exchange by Sep. 25. After this date, users will have to update banking information and may be required to accept new terms and conditions to continue using SEPA services, the exchange said. Meanwhile, in the United States, Binance.US <a href=\"https://cointelegraph.com/news/binance-usd-deposits-withdrawals-moonpay-usdt\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-usd-deposits-withdrawals-moonpay-usdt/amp\">announced a new partnership</a> with crypto payments firm MoonPay to make the dollar-pegged stablecoin Tether (USDT) its new “base asset” for all transactions, allowing a path for users to transact in U.S. dollars. Binance.US recently suffered a breakdown with its banking partners in the country, which saw fiat deposits on the exchange disabled since June.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, we're excited to introduce a new <a href=\"https://twitter.com/search?q=%24USD&src=ctag&ref_src=twsrc%5Etfw\">$USD</a> on-ramp!<br><br>✔️ Buy <a href=\"https://twitter.com/search?q=%24USDT&src=ctag&ref_src=twsrc%5Etfw\">$USDT</a> on <a href=\"https://t.co/AZwoBOgsqS\">https://t.co/AZwoBOgsqS</a> through payment partners like <a href=\"https://twitter.com/moonpay?ref_src=twsrc%5Etfw\">@moonpay</a>, which supports debit & credit card, Apple Pay, and Google Pay.<br><br>✔️ Sell USDT for USD to withdraw via bank transfer.<br><br>Learn more & get started ⤵️</p>— Binance.US  (@BinanceUS) <a href=\"https://twitter.com/BinanceUS/status/1694040010482135262?ref_src=twsrc%5Etfw\">August 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Coinbase takes equity stake in Circle as Centre Consortium shuts down</h2><p>Coinbase and Circle <a href=\"https://cointelegraph.com/news/coinbase-takes-equity-stake-circle-usdc-centre-consortium-shuts-down\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinbase-takes-equity-stake-circle-usdc-centre-consortium-shuts-down/amp\">have redefined their relationship</a> as the Centre Consortium is being shut down for \"growing regulatory clarity for stablecoins\" in the United States. The two organizations jointly launched the USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) stablecoin in 2018 and have, since then, governed the token through the Centre Consortium. As the organization comes to an end, Circle will have enhanced responsibilities, including holding smart contract keys and regulatory compliance, while Coinbase takes an equity stake in Circle. Interest revenue will continue to be shared between them based on their holdings of the stablecoin. With a view to expanding its chain reach, USDC is also set to launch into Polkadot, Optimism, Near, Arbitrum and Cosmos networks.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ Some major news from <a href=\"https://twitter.com/circle?ref_src=twsrc%5Etfw\">@circle</a> and <a href=\"https://twitter.com/coinbase?ref_src=twsrc%5Etfw\">@coinbase</a> on the future of <a href=\"https://twitter.com/search?q=%24USDC&src=ctag&ref_src=twsrc%5Etfw\">$USDC</a> in this joint blog post from <a href=\"https://twitter.com/brian_armstrong?ref_src=twsrc%5Etfw\">@brian_armstrong</a> and I (<a href=\"https://twitter.com/jerallaire?ref_src=twsrc%5Etfw\">@jerallaire</a>).   <a href=\"https://t.co/uHuxeRJtiI\" data-amp=\"https://www-circle-com.cdn.ampproject.org/c/s/www.circle.com/blog/ushering-in-the-next-chapter-for-usdc?hs_amp=true\">https://t.co/uHuxeRJtiI</a></p>— Jeremy Allaire (@jerallaire) <a href=\"https://twitter.com/jerallaire/status/1693719963565969654?ref_src=twsrc%5Etfw\">August 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Shopify to accept USDC payments with Solana</h2><p>E-commerce giant Shopify <a href=\"https://cointelegraph.com/news/shopify-to-accept-usdc-payments-with-solana-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/shopify-to-accept-usdc-payments-with-solana-report/amp\">has added Solana Pay</a> to its pool of options for payment, allowing millions of merchants to use the platform to accept crypto transactions, kicking off with USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) stablecoin payments. Solana reportedly plans to add other altcoins to the platform in the coming months, including its native SOL (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) token and the meme token Bonk (BONK). Shopify estimates that 10% of all e-commerce transactions in the United States, or $444 billion of the world’s e-commerce market, are made through its platform. The network’s average charge is $0.00025 per transaction, while credit card fees range from 1.5% to 3.5%. In the last epoch, Solana’s users paid an average transaction fee of 0.000009664 SOL.</p><h2>China launches blockchain-powered data exchange</h2><p>Chinese government officials <a href=\"https://cointelegraph.com/news/china-launches-blockchain-powered-data-exchange\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/china-launches-blockchain-powered-data-exchange/amp\">unveiled a new data exchange</a> powered by blockchain technology with over 300 enterprises — including Alibaba Cloud and Huawei — participating in the exchange’s debut. According to local news reports, the new Hangzhou Data Exchange will facilitate trading of enterprise information technology data, ensuring exchange trades are immutable and traceable. Despite <a href=\"https://cointelegraph.com/news/multichain-victims-search-for-answers-in-billion-dollar-exploit-as-new-evidence-emerges\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/multichain-victims-search-for-answers-in-billion-dollar-exploit-as-new-evidence-emerges/amp\">cracking down harshly</a> on private blockchain enterprises for much of the year, China is a staunch supporter of government-controlled Web3 initiatives. </p><p><em>Crypto Biz is your weekly pulse of the business behind blockchain and crypto, delivered directly to your inbox every Thursday.</em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-08-25T21:36:34.000Z",
    "title": "Colombian peso-backed stablecoin debuts on Polygon with yield benefits",
    "url": "https://crypto.news/colombian-peso-backed-stablecoin-debuts-on-polygon-with-yield-benefits/",
    "description": "Num Finance launches nCOP, a Colombian Peso-pegged stablecoin on Polygon, offering users an 8% yield and promising a fresh take on remittances in Latin America. Num Finance, a Latin America-based stablecoins issuer, has introduced its latest stablecoin, nCOP. This new&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T21:30:47.000Z",
    "title": "XRP Epic Price Setup: Accumulation Surge Paves The Way For Imminent Price Blast",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-epic-price-setup-accumulation-surge-paves-the-way-for-imminent-price-blast/",
    "description": "After a highly anticipated partial victory for Ripple Labs and XRP investors, the fifth-largest cryptocurrency has succumbed to the overall market downward trend, dampening the excitement following its July 13 triumph against the US Securities and Exchange Commission. Over the past 30 days, XRP has retraced by more than 26%. Despite experiencing significant price fluctuations since its 16% drop on August 16, the token has recovered 4% of those losses within the past seven days. As the market approaches the monthly close and witnesses liquidity re-entering, there is a growing possibility that XRP will continue its upward trend. Potential Price Explosion For XRP Following Extended Accumulation Phase In cryptocurrency, few phenomena captivate investors and traders more than anticipating a price explosion fueled by a prolonged accumulation phase.  Such is the case for XRP, which shows a setup that mirrors previous patterns that led to significant price surges.  Related Reading: Economic Reset Alert: Bloomberg Analyst Predicts Bitcoin Crash Below $10,000 Crypto analyst and trader, known by the pseudonym &#8220;Crypto Bull,&#8221; has caught the attention of market participants with its bold prediction that XRP could be on the brink of a major upward rally. According to Crypto Bull, historical data reveals a recurring pattern for XRP, where explosive price movements have consistently followed extended periods of upward accumulation.  Crypto Bull&#8217;s analysis suggests that XRP is currently in its longest accumulation phase in history, further strengthening the potential for a significant price surge.  Examining the weekly chart provided by Crypto Bull, it becomes evident that XRP has previously undergone notable price explosions in 2020 and 2021, making this its third accumulation phase. XRP&#8217;s Bullish Momentum During the first uptrend in 2020, XRP surged by an impressive 220%, starting below the $0.250 level and reaching a high of $0.774 in November. Following a typical price correction, XRP embarked on another upward trend merely months later, in February 2021, aiming to surpass its previous all-time high. In April 2021, XRP experienced a remarkable bull run, aligning with the overall market trend, and skyrocketed from $0.540 to its current all-time high of $1.946. Subsequently, the token attempted to retest this pinnacle but fell short of reclaiming it. These historical patterns in XRP&#8217;s price action following significant surges are noteworthy; however, whether the cryptocurrency will follow its established trajectory or surpass its all-time high remains uncertain. What is certain is that the ongoing accumulation phase, coupled with potential positive developments in the US courts and growing investor excitement, positions XRP for a possible major breakout.  Related Reading: JPMorgan Shares Prediction On Bitcoin’s Next Move: What You Need To Know Despite briefly surpassing its macro range between $0.548 and $0.295 on July 13, XRP is currently within this range again, possibly establishing a new base or awaiting the ideal conditions for its next uptrend. As the cryptocurrency ecosystem eagerly awaits further developments, XRP&#8217;s future trajectory holds considerable intrigue.  Whether it will reiterate its historical patterns or embark on an unprecedented journey remains to be seen. Nonetheless, the current accumulation phase and the optimistic sentiment surrounding XRP set the stage for potential growth and renewed excitement among investors. At the time of writing, XRP is traded at $0.5231, reflecting a 1.3% increase over the past 24 hours. Featured image from iStock, chart from TradingView.com"
  }
]