[
  {
    "source": "CoinDesk",
    "date": "2023-07-11T13:00:00.000Z",
    "title": "NFT Lender Gondi Goes Live, Raises $5.3M Round Led by Hack.vc",
    "url": "https://www.coindesk.com/web3/2023/07/11/nft-lender-gondi-goes-live-raises-53m-round-led-by-hackvc/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Developer Florida Street's seed round features Hack.vc, Foundation Capital, Dragonfly Capital, Pantera Capital, 6th Man Ventures and others."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-11T13:00:00.000Z",
    "title": "Cross-Chain Protocol Axelar to Develop Web3 Services With Microsoft Azure",
    "url": "https://www.coindesk.com/tech/2023/07/11/cross-chain-protocol-axelar-to-develop-web3-services-with-microsoft-azure/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Axelar said further plans with Microsoft include connecting private and public blockchains that use OpenAI services to create Web3 products."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-11T12:45:35.000Z",
    "title": "First Mover Americas: GBTC Discount Narrows to Lowest Since May 2022 ",
    "url": "https://www.coindesk.com/markets/2023/07/11/first-mover-americas-gbtc-discount-narrows-to-lowest-since-may-2022/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for July 11, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-11T13:05:03.000Z",
    "title": "Layer-2 DeFi Project Rodeo Finance Hacked for 472 Ethereum",
    "url": "https://decrypt.co/148068/layer-2-defi-project-rodeo-finance-hacked-472-ethereum",
    "description": "An exploiter was able to run away with roughly $888,000 in Ethereum from Rodeo’s interest-bearing USDC pool."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-11T13:01:09.000Z",
    "title": "You Can Now Earn Bitcoin for Playing Minecraft—Here’s How",
    "url": "https://decrypt.co/148037/you-can-now-earn-bitcoin-playing-minecraft-heres-how",
    "description": "The Satlantis Mineraft server is now giving out over 1 million satoshis per week in partnership with Bitcoin payments startup Zebedee."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-11T13:01:02.000Z",
    "title": "Magic Johnson-Backed SimWin Sports Infuses Fantasy Football With AI and NFTs",
    "url": "https://decrypt.co/148033/magic-johnson-fantasy-football-ai-nft-simwin-sports",
    "description": "The platform aims to bridge eSports and fantasy sports with a 24/7 virtual football league."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-11T12:48:29.000Z",
    "title": "Bitcoin ATMs are Numbered As UK Financial Watchdog Cracks Down",
    "url": "https://cryptobriefing.com/bitcoin-atms-are-numbered-in-uk/?utm_source=feed&utm_medium=rss",
    "description": "The Financial Conduct Authority (FCA) of the United Kingdom continues its crackdown on unlicensed crypto ATMs. Conducting a series of inspections in May and June, the FCA got rid of..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-11T13:00:00.000Z",
    "title": "3 Promising Crypto Projects To Watch For The Next Bull Run",
    "url": "https://cryptodaily.co.uk/2023/07/3-promising-crypto-projects-to-watch-for-the-next-bull-run",
    "description": "<p class=\"s3\">In this article, we&rsquo;ll be highlighting three remarkable crypto projects that are expected to make waves in the upcoming bull run - according to crypto analysts. Delve into the world of futuristic investments with InQubeta, the crypto crowdfunding platform transforming AI startup investments. </p>\n<p class=\"s3\">Additionally, explore the dynamic potential of Ethereum, the pioneering smart contract platform, and Polkadot, the creative multi-chain ecosystem, as they emerge as the top contenders in the competitive realm of blockchain technology. </p>\nInQubeta: Taking AI Startup Investment To The Next Level\n<p class=\"s3\">A lot of investors are tired of the same opportunities and want to add some excitement to their portfolio, now, they need to look no further than InQubeta. InQubeta is not an average crypto crowdfunding platform - it&rsquo;s here to shake the space up. This project proves that traditional investment methods can be a thing of the past, as the world's first crypto crowdfunding platform that enables fractional investment in AI startups using $QUBE tokens is introduced.</p>\n<p class=\"s3\">With InQubeta, individuals can dive into the world of AI startups and invest in a manner that suits their budget. The NFT marketplace of InQubeta is buzzing with opportunities where AI startups raise funds and offer reward and equity-based NFTs. The intriguing aspect is that each investment opportunity is minted into an NFT and fractionalized, allowing individuals to participate without incurring significant costs.</p>\n<p class=\"s3\">InQubeta has even taken things a step further with their deflationary ERC20 token, $QUBE. This is not just an ordinary token; it is a deflationary currency that becomes even more valuable over time. A 2% tax on all buy and sell transactions is directed to a burn wallet, resulting in the token becoming scarcer. Additionally, a 5% sell tax is allocated to a dedicated reward pool, providing an opportunity for individuals to earn rewards by staking their tokens. InQubeta offers a project that holds great potential, and AI fans should definitely take note.</p>\n<p></p>\nEthereum: Unleashing the Power of Smart Contracts and Decentralized Applications\n<p class=\"s3\">When it comes to blockchain platforms, Ethereum stands tall as the original pioneer and a force to be reckoned with. Born in 2015, Ethereum introduced the concept of smart contracts, which transformed the way transactions are executed on the blockchain. This decentralized platform allows developers to build and deploy their own applications without relying on intermediaries, offering a level of transparency and security that traditional systems can only dream of.</p>\n<p class=\"s3\">One of Ethereum's major strengths lies in its vast network and active community. Developers from all corners of the world have flocked to Ethereum, creating a vibrant ecosystem of decentralized finance (DeFi) projects, non-fungible tokens (NFTs), and inventive dApps that cover a wide range of industries. This rich ecosystem has solidified Ethereum's position as the go-to platform for creating and launching new tokens, conducting initial coin offerings (ICOs), and experimenting with novel financial instruments.</p>\n<p class=\"s3\">Scalability has been a challenge for Ethereum, as increased usage has resulted in network congestion and high fees. However, Ethereum is addressing these issues through the implementation of Ethereum 2.0, a major upgrade that introduces a new consensus mechanism called Proof of Stake (PoS) and shard chains. This upgrade aims to significantly enhance scalability, security, and energy efficiency, making Ethereum even more robust and attractive to developers and users alike.</p>\nPolkadot: Unlocking a New Era of Blockchain Interoperability and Scalability\n<p class=\"s3\">Polkadot emerges as a remarkable project that seeks to bridge the gap between different blockchains. Founded by one of Ethereum's co-founders, Polkadot introduces a multi-chain framework that enables interoperability, allowing various blockchains to perfectly communicate and share information with each other.</p>\n<p class=\"s3\">Polkadot's architecture revolves around a relay chain that serves as the heart of the network, coordinating communication and consensus between connected blockchains, known as parachains. These parachains operate independently, each with its own unique features, governance models, and specialized functionalities. This modular approach provides flexibility and scalability, as new parachains can be added without disrupting the entire network.</p>\n<p class=\"s3\">By facilitating interoperability, Polkadot opens up a world of possibilities for cross-chain applications and collaborations. Developers can create decentralized applications that can interact with multiple blockchains, harnessing the strengths and features of each chain to enhance functionality and efficiency. This interoperability also paves the way for secure asset transfer between different chains, enabling new use cases and driving invention in areas such as decentralized finance, supply chain management, and gaming.</p>\n<p class=\"s3\">Polkadot's governance model, based on on-chain voting and a nominated proof-of-stake consensus mechanism, ensures that decisions regarding network upgrades and the addition of new parachains are made in a transparent and decentralized manner. This community-driven approach fosters inclusivity and empowers stakeholders to actively participate in shaping the future of the Polkadot ecosystem.</p>\nConclusion\n<p class=\"s3\">Respected crypto analysts recognize the immense potential of these projects and believe they are well-positioned to thrive in the evolving crypto landscape. As the market gears up for the next bull run, investors should pay close attention to InQubeta, Ethereum, and Polkadot, as they represent exciting opportunities for growth and creativity in the crypto space.</p>\n<p>Visit InQubeta Presale</p>\n<p class=\"s13\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T13:00:40.000Z",
    "title": "NFT Lender Gondi Launches With $5.35M Funding Round From Major Investors",
    "url": "https://www.cryptopolitan.com/nft-lender-gondi-launches-with-5-35m-funding-round-from-major-investors/",
    "description": "New York, USA, July 11th, 2023, Chainwire Florida Street&#8217;s seed round features Hack.vc, Foundation Capital, Dragonfly Capital, Pantera Capital, 6th Man Ventures and others Cutting-edge NFT lending protocol Gondi launched July 11 with support from a $5.35 million seed round by some of the most notable firms in crypto. Lenders and borrowers can now capitalize ... <a title=\"NFT Lender Gondi Launches With $5.35M Funding Round From Major Investors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nft-lender-gondi-launches-with-5-35m-funding-round-from-major-investors/\" aria-label=\"More on NFT Lender Gondi Launches With $5.35M Funding Round From Major Investors\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T12:55:24.000Z",
    "title": "How to Buy Bitcoin on eToro, A Friendly Platform With Comprehensive Cryptocurrency Offerings",
    "url": "https://www.cryptopolitan.com/how-to-buy-bitcoin-on-etoro/",
    "description": "The pioneering cryptocurrency has become a popular investment choice for individuals seeking exposure to the digital asset market. With its potential for high returns and market volatility, many traders are eager to participate in Bitcoin&#8217;s growth. One platform that has gained recognition for its user-friendly interface and comprehensive cryptocurrency offerings is eToro. This guide will ... <a title=\"How to Buy Bitcoin on eToro, A Friendly Platform With Comprehensive Cryptocurrency Offerings\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-to-buy-bitcoin-on-etoro/\" aria-label=\"More on How to Buy Bitcoin on eToro, A Friendly Platform With Comprehensive Cryptocurrency Offerings\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T12:53:21.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) stands at $0.0935, accompanied by a 24-hour trading volume of $442,273. With a market capitalization of $35.71 million, WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has experienced a positive growth of 0.5%. ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-11T12:55:45.000Z",
    "title": "Crypto Update: Top 3 Altcoins To Watch This Week",
    "url": "https://www.newsbtc.com/news/crypto-update-top-3-altcoins-watch-this-week/",
    "description": "While the Bitcoin price is currently stuck in a sideways trend, a few altcoins on the crypto market are currently showing a strong momentum. These three altcoins are currently attracting the attention of investors and traders alike: Shiba Inu (SHIB), Solana (SOL), and Polygon (MATIC). Let&#8217;s dive into the technical chart analysis of these altcoins and examine the potential price moves that could unfold this week. Shiba Inu (SHIB) &#8211; A Make-or-Break Moment SHIB finds itself at a critical juncture, where the next move could determine its trajectory for the rest of the year. After experiencing a remarkable rally earlier this year, SHIB entered a descending trend channel at the beginning of February, dragging its price below the yearly opening level. However, a breakthrough from this channel occurred over the weekend, signaling a potential reversal. Related Reading: Arkham’s New Crypto Intel Trading Platform: A Game Changer For Traders? As the SHIB bulls attempt to validate this breakout, their success could propel the price upwards by 30%, as NewsBTC reported yesterday. This would bring SHIB towards the resistance area between $0.00000969 (200-day EMA) and $0.00000977 (38.2% Fibonacci), with a significant psychological milestone of $0.00001 within reach. Nonetheless, a confirmation of the breakout is still pending. While the Shiba Inu price managed to stay above the trend channel yesterday, the bulls are still hesitant to make an impulsive move higher towards the 23.6% Fibonacci level at $0.00000834. A breakout above this can be seen as confirmation of a trend change. Solana (SOL) &#8211; Rising Against The Crypto Odds Solana (SOL) made a splash in the crypto market last week, recording an impressive 39% price increase over the last 12 days. This surge propelled SOL to the critical resistance level represented by the 200-day exponential moving average (EMA). Breaking through this level has been a persistent challenge for SOL since April 2022, but recent developments offer hope for a potential breakthrough. At press time, the SOL price overcame the 200-EMA at $21.98, trading at 22.07. A daily close above this price level would be massively bullish. SOL&#8217;s rally is particularly noteworthy, considering the setbacks it faced due to the FTX drama and the SEC&#8217;s classification of it as a security. Should the 200-day EMA be breached, the 50% Fibonacci retracement level and the yearly high at $27.00 could serve as the next targets for an extended rally, which could give investors another 22% profit, as detailed in our last analysis. Related Reading: Hackers Have Stolen $30 Billion In Crypto Since 2012, SlowMist Report Finds Polygon (MATIC) &#8211; New Momentum Recent developments have sparked interest and potential opportunities for investors. The announcement of former Chief Legal Officer Marc Boiron as the new CEO has generated positive sentiment within the community. On-chain data indicates a significant spike in social volume following the news, suggesting increased attention and potential bullish sentiment for MATIC&#8217;s price.  From a technical standpoint, MATIC has seen a 40% increase since its local bottom in June. The price currently sits below the 23.6% Fibonacci retracement level, and a breakout above this level could potentially drive MATIC towards the 200-day EMA and the 38.2% Fibonacci retracement level, offering a 22% rally. However, breaking the resistance at the first Fibonacci level at $0.756 is a crucial step to watch for potential upward momentum. Please note: The analysis and observations in this article should not be considered financial advice. Cryptocurrency investments carry inherent risks, and readers are urged to conduct thorough research before making any investment decisions. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-11T13:00:31.000Z",
    "title": "As Polkadot (DOT) Faces Resistance, InQubeta (QUBE) and Aave (AAVE) Garner Interest from Crypto Whales",
    "url": "https://www.crypto-news-flash.com/as-polkadot-dot-faces-resistance-inqubeta-qube-and-aave-aave-garner-interest-from-crypto-whales/?utm_source=rss&utm_medium=rss&utm_campaign=as-polkadot-dot-faces-resistance-inqubeta-qube-and-aave-aave-garner-interest-from-crypto-whales",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-93.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-93.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-93-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-93-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Polkadot is regarded as an established blockchain, but it has struggled in recent weeks to reach the high levels of the past. In June, the blockchain witnessed a massive rise in NFT volume but has struggled to compete for active users. In addition, DOT has failed to surpass the $5.5 resistance barrier in recent months.  [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-11T13:00:10.000Z",
    "title": "NFT Lender Gondi Launches With $5.35M Funding Round From Major Investors",
    "url": "https://www.crypto-news-flash.com/nft-lender-gondi-launches-with-5-35m-funding-round-from-major-investors/?utm_source=rss&utm_medium=rss&utm_campaign=nft-lender-gondi-launches-with-5-35m-funding-round-from-major-investors",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Seed2x_1689015095cahqks5Jmi.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Seed2x_1689015095cahqks5Jmi.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Seed2x_1689015095cahqks5Jmi-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Seed2x_1689015095cahqks5Jmi-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Seed2x_1689015095cahqks5Jmi-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />New York, USA, July 11th, 2023, Chainwire Florida Street&#8217;s seed round features Hack.vc, Foundation Capital, Dragonfly Capital, Pantera Capital, 6th Man Ventures and others Cutting-edge NFT lending protocol Gondi launched July 11 with support from a $5.35 million seed round by some of the most notable firms in crypto. Lenders and borrowers can now capitalize [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-11T12:55:00.000Z",
    "title": "Data Analyst Reveals an Individual Made $2.6M by Trading PEPE",
    "url": "https://coinedition.com/data-analyst-reveals-an-individual-made-2-6m-by-trading-pepe/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/This_guy_that_made_1408_ETH_2_6M_on_PEPE_spent_400K_USDC_to-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Lookonchain, a Web3 data analysis tool, highlighted shared intricate details of how an individual acquired huge profits by trading PEPE tokens. In particular, the person made 1408 ETH, equivalent to $2.6 million, by spending 400K $USDC to buy 263B $PEPE at $0.000001519. Moreover, this very person spent 46 $ETH to buy 1.66T $PEPE via three [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/data-analyst-reveals-an-individual-made-2-6m-by-trading-pepe/\">Data Analyst Reveals an Individual Made $2.6M by Trading PEPE</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]