[
  {
    "source": "Decrypt",
    "date": "2023-11-30T20:51:14.000Z",
    "title": "Sanctioned Bitcoin Mixer Blender Relaunched as Sinbad—It’s Been Sanctioned Again",
    "url": "https://decrypt.co/208160/sanctioned-bitcoin-mixer-blender-relaunch-sinbad-sanctioned-again",
    "description": "If at first you don't shut down the coin mixer, sanction again."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-30T20:42:38.000Z",
    "title": "Nintendo Switch 2 Preview: Everything You Need to Know",
    "url": "https://decrypt.co/197793/nintendo-switch-2-rumors-leaks-latest-news",
    "description": "UPDATE: Ready for a brand new Super Mario 3D game at launch and then Mario Kart X in 2025? A leaker says they're coming to Nintendo Switch 2."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-30T20:54:36.000Z",
    "title": " Mastercard launches generative AI chatbot to help you shop online ",
    "url": "https://cointelegraph.com/news/mastercard-launches-generative-ai-chatbot-artificial-intelligence-shop-online",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTEvMDQxYmJkMGEtZTQwNi00Njg2LTg0YWQtODM1OGQ5OTU5NTI0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Digital personalization company Dynamic Yield by Mastercard was purchased from McDonalds in 2022.</p>\n                    <p><p>Dynamic Yield by Mastercard, a digital personalization and artificial intelligence subsidiary of Mastercard, <a href=\"https://www.mastercard.com/news/press/2023/november/dynamic-yield-by-mastercard-unveils-shopping-muse-the-next-generation-personal-retail-assistant/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> the launch of its Shopping Muse generative AI chatbot assistant for ecommerce on Nov. </p><p>The AI system was revealed in a company blog post. </p><h2>Shopping Muse generative artificial intelligence</h2><p>Generative AI systems, such as OpenAI’s ChatGPT and DALL-E, are designed to convert colloquial user commands into text, video, audio, or even computer code. </p><p>In the case of Shopping Muse, users can make plain language requests in the context of an online marketplace and the AI system will generate personalized recommendations via a process Dynamic Yield refers to as algorithmic content matching. </p><p>As Ori Bauer, CEO of Dynamic Yield by Mastercard, describes it:</p><blockquote>“Personalization gives people the shopping experiences they want, and AI-driven innovation is the key to unlocking immersive and tailored online shopping. By harnessing the power of generative AI in Shopping Muse, we’re meeting the consumer’s standards and making shopping smarter and more seamless than ever.” </blockquote><h2>Dynamic Yield by Mastercard</h2><p>Mastercard acquired digital personalization firm Dynamic Yield in 2022 from then-owner McDonalds. </p><p>It boasts hundreds of clients for its personalization and data services with a <a href=\"https://www.marketingtechnews.net/news/2022/apr/05/mastercard-acquires-dynamic-yield-to-strengthen-consumer-engagement-services/\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> 400 rands represented. </p><p><a href=\"https://cointelegraph.com/news/mastercard-launches-generative-ai-chatbot-artificial-intelligence-shop-online\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-30T21:05:35.000Z",
    "title": "SEC opens comment period for Fidelity’s proposed Ethereum ETF",
    "url": "https://cryptoslate.com/sec-opens-comment-period-for-fidelitys-proposed-ethereum-etf/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) began to accept comments on Fidelity&#8217;s proposed spot Ethereum ETF through a Nov. 30 filing. That filing indicates that the securities agency is now soliciting comments on a proposed rule change from Cboe BZX. If approved, that rule change will allow the exchange to list and trade Fidelity&#8217;s [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sec-opens-comment-period-for-fidelitys-proposed-ethereum-etf/\">SEC opens comment period for Fidelity&#8217;s proposed Ethereum ETF</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-30T20:57:22.000Z",
    "title": "Argentina declines BRICS invitation under new leadership",
    "url": "https://www.cryptopolitan.com/argentina-declines-brics-invitation/",
    "description": "Argentina has announced its decision to reject the invitation to join the BRICS bloc, an influential group comprising Brazil, Russia, India, China, and South Africa. This decision aligns with the incoming president Javier Milei&#8217;s strategic orientation toward the United States and signifies a noteworthy shift in Argentina&#8217;s international positioning. Diana Mondino, appointed Foreign Affairs Minister ... <a title=\"Argentina declines BRICS invitation under new leadership\" class=\"read-more\" href=\"https://www.cryptopolitan.com/argentina-declines-brics-invitation/\" aria-label=\"More on Argentina declines BRICS invitation under new leadership\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-11-30T21:07:59.000Z",
    "title": "The Growth of GameFi: NuggetRush, Decentraland, and GALA in Comparison",
    "url": "https://nulltx.com/the-growth-of-gamefi-nuggetrush-decentraland-and-gala-in-comparison/",
    "description": "TLDR NuggetRush (NUGX) leads the decentralized crypto scene, blending meme coin status with real-time revenue and impact gaming in the GameFi sector. Gamers earn by mining in-game assets, with NUGX characters doubling as NFTs. Decentraland (MANA) announced a partnership with Smiley for an NFT collection on November 9, boosting MANA&#8217;s [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-30T21:00:07.000Z",
    "title": "Bitcoin Spot ETF In January 2024: A New Player Just Joined The Game",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-spot-etf-january-2024/",
    "description": "In the ongoing Spot Bitcoin ETF mania, Pando has joined the race aiming to seize the opportunities that may arise following the potential approval of BTC Spot ETFs by the US SEC.  Pando Submits Spot Bitcoin ETF Filing Switzerland-based asset management company, Pando Asset has become the latest entrant into the Spot Bitcoin Exchange Traded Fund (ETF) race. The investment firm officially submitted its Spot BTC ETF filing to the United States Securities and Exchange Commission (SEC) on November 29. Related Reading: Crypto Analyst Who Sold The Bitcoin Top Reveals How To Buy And Sell At The Perfect Time The news of the late filing comes as a surprise to the crypto space, as the final dates for the SEC’s decision on the Spot Bitcoin ETF approval approach.  In the filing, Pando Asset provided a lengthy outline of its Spot BTC ETF, PBTC, highlighting its purpose, offerings, net asset value, regulatory compliance, tax considerations, and other factors.  “The Trust was formed as a Delaware statutory trust on November 16, 2023. The purpose of the Trust is to own bitcoin transferred to the Trust in exchange for Shares issued by the Trust. Each Share represents a fractional undivided beneficial interest in the net assets of the Trust. The assets of the Trust consist primarily of bitcoin held by the Bitcoin Custodian on behalf of the Trust,” the filing stated.  Pando’s BTC Spot ETF brings the total number of filed Spot Bitcoin ETFs in the crypto space to 13. Among them are applications from prominent financial institutions such as Grayscale, BlackRock, Ark Invest, WisdomTree, and others. The crypto space is presently anticipating the approval of these ETFs, as many crypto experts have predicted that a Bitcoin Spot ETF debut could result in massive inflows for BTC which may trigger a bull run.  Spot ETF Approval Prediction While the crypto community awaits the US SEC’s final verdict on Spot Bitcoin ETF approval, a Bloomberg analyst, James Seyffart has predicted a favorable approval outcome for BTC Spot ETFs. Related Reading: XRP Price Prediction: Analyst Identifies 3 Key Factors That Will Trigger Parabolic Move According to Seyffart, Spot Bitcoin ETFs could see potential approval by January 10, 2024. His prediction has also been backed by another ETF specialist, Senior Bloomberg analyst, Eric Balchunas who gives a strong 90% likelihood for the approval of Spot Bitcoin ETFs.  “People asking me if we changed the odds. No, we are still holding the line at 90% odds of approval by Jan 10 (aka this cycle), the same odds we&#8217;ve had for months (before it was cool/safe). What we are watching for now: more amended/final filings to roll in and clarity on in-kind vs cash creates,” Balchunas stated. BTC price makes its way toward $38,000 &#124; Source: BTCUSD on Tradingview.com Featured image from Coinpedia, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-30T21:00:43.000Z",
    "title": "Crypto Strategist Says Breakout Rally ‘Very Likely’ To Occur for Bitcoin, Predicts Monster Move for Ethereum",
    "url": "https://dailyhodl.com/2023/11/30/crypto-strategist-says-breakout-rally-very-likely-to-occur-for-bitcoin-predicts-monster-move-for-ethereum/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/says-very-occur-monster.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/says-very-occur-monster.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/says-very-occur-monster.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/says-very-occur-monster.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/says-very-occur-monster.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/says-very-occur-monster.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/says-very-occur-monster.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says that Bitcoin (BTC) is setting the stage for a major breakout. Crypto analyst Michaël van de Poppe tells his 674,900 followers on the social media platform X that Bitcoin remains in a bullish uptrend, printing higher low prices. “Another higher low is established on Bitcoin. The trend remains to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/30/crypto-strategist-says-breakout-rally-very-likely-to-occur-for-bitcoin-predicts-monster-move-for-ethereum/\">Crypto Strategist Says Breakout Rally ‘Very Likely’ To Occur for Bitcoin, Predicts Monster Move for Ethereum</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-30T20:55:00.000Z",
    "title": "Crypto Trader Says Bitcoin (BTC) Retracement Could Lead to ‘Parabolic Uptrend’ – Here’s What He Means",
    "url": "https://dailyhodl.com/2023/11/30/crypto-trader-says-bitcoin-btc-retracement-could-lead-to-parabolic-uptrend-heres-what-he-means/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/Parabolic-Move-Up-BTC.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/Parabolic-Move-Up-BTC.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/Parabolic-Move-Up-BTC.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/Parabolic-Move-Up-BTC.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/Parabolic-Move-Up-BTC.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/Parabolic-Move-Up-BTC.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/Parabolic-Move-Up-BTC.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says that Bitcoin (BTC) backtracking before the halving could actually be a good thing. Pseudonymous crypto trader Rekt Capital dives deep into pre-halving BTC activity for his 372,100 followers on the social media platform X. The Bitcoin halving occurs approximately every four years. The pre-programmed event reduces the reward for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/30/crypto-trader-says-bitcoin-btc-retracement-could-lead-to-parabolic-uptrend-heres-what-he-means/\">Crypto Trader Says Bitcoin (BTC) Retracement Could Lead to ‘Parabolic Uptrend’ – Here’s What He Means</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]