[
  {
    "source": "Decrypt",
    "date": "2024-02-18T14:33:34.000Z",
    "title": "This Week on Crypto Twitter: Bitcoin Is So Hot, Even Elizabeth Warren Wants In",
    "url": "https://decrypt.co/217950/this-week-on-crypto-twitter-bitcoin-is-so-hot-even-elizabeth-warren-wants-in",
    "description": "With direct HODLers, ETF investors, and even Bitcoin-adjacent stocks flying high, it’s cool how much people don’t care."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-18T14:12:01.000Z",
    "title": "'Free Money': These Are the Hottest Airdrops Around Right Now",
    "url": "https://decrypt.co/209179/free-money-hottest-airdrops-around-right-now",
    "description": "UPDATED: Here's our expand list of the biggest upcoming airdrops, from Starknet to Pixels, Wormhole, Blast, and beyond."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-18T14:27:47.000Z",
    "title": "Market trends explained: Why Ethereum (ETH) & Solana (SOL) investors look into Pushd (PUSHD) presale for 20x gains",
    "url": "https://cryptodaily.co.uk/2024/02/market-trends-explained-why-ethereum-eth-solana-sol-investors-look-into-pushd-pushd-presale-for-20x-gains",
    "description": "Ethereum (ETH) remains steady in the face of market fluctuations, targeting a possible increase above $2,800 and Solana (SOL) holds the fifth position in terms of market capitalization."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-18T14:22:32.000Z",
    "title": "February Market Boom shows Binance Coin (BNB) & Tether (USDT) holders pump into Pushd (PUSHD). Discover why.",
    "url": "https://cryptodaily.co.uk/2024/02/february-market-boom-shows-binance-coin-bnb-tether-usdt-holders-pump-into-pushd-pushd-discover-why",
    "description": "February's market rise noticed Binance Coin (BNB) and Tether (USDT) investors diverting their emphasis toward Pushd (PUSHD). While Tether (USDT) claims significant earnings in spite of regulatory scrutiny, Binance Coin (BNB) confronts liquidation concerns in the midst of its ascent."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-18T14:18:05.000Z",
    "title": "Kelexo (KLXO) Presale attracts Chainlink (LINK) & Bitcoin Cash (BCH) holders from its lending solutions",
    "url": "https://cryptodaily.co.uk/2024/02/kelexo-klxo-presale-attracts-chainlink-link-bitcoin-cash-bch-holders-from-its-lending-solutions",
    "description": "The Kelexo (KLXO) token presale has attracted a lot of investment in the past couple of days. Now in stage two of presale activities, Kelexo (KLXO)"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-18T14:13:35.000Z",
    "title": "February Inflation Across The Board Sees Cardano (ADA) & Chainlink (LINK) Investors Diversify Into Deestream (DST) Presale",
    "url": "https://cryptodaily.co.uk/2024/02/february-inflation-across-the-board-sees-cardano-ada-chainlink-link-investors-diversify-into-deestream-dst-presale",
    "description": "This week has been a roller coaster moment for investors in both the traditional and crypto markets. Today, the value of several coins was affected by the February inflation that weighed on interest rate cuts."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-18T14:22:33.000Z",
    "title": "Canada’s Political Campaigns Lag Behind the U.S. in Using AI",
    "url": "https://www.cryptopolitan.com/canadas-political-campaigns-ai/",
    "description": "Explore the cautious approach Canada is taking towards integrating AI in political campaigns, contrasting with the rapid adoption in the U.S."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-18T14:11:46.000Z",
    "title": "Worldcoin Gains Over 80% In profits On The Back Of A Solid 106% Rally – Details",
    "url": "https://www.newsbtc.com/news/worldcoin-gains-over-80-in-profits-on-the-back-of-a-solid-106-rally-details/",
    "description": "Worldcoin, the ambitious project aiming to establish a universal digital identity through iris scanning, has grabbed headlines once again. This time, it&#8217;s not for its controversial practices, but for an 80% price surge in its native token, WLD, within a week. However, digging deeper reveals a multifaceted story marked by triumphs, challenges, and lingering concerns. Related Reading: Chainlink Bulls Brace For Explosive Growth Following $216 Million Whale Accumulation Soaring App Usage Drives Growth On the positive side, Worldcoin boasts significant milestones. Its World App, launched in May 2023, has witnessed a surge in users, registering a record 16,000 daily Orb verifications &#8211; their unique eye-scanning tool. This indicates growing interest in their core proposition: providing a decentralized identity solution accessible to everyone. Additionally, Worldcoin secured $115 million in a Series C funding round, demonstrating investor confidence despite past controversies. But the recent spike in WLD&#8217;s price also brings with it a warning. The parabolic rise in the price of Worldcoin (WLD) is one of the latest milestones that the Altman-led company has experienced. At the time of writing, WLD was trading at $5.27, up 20% in the last 24 hours, and tallying a solid 106% rally in the last seven days, data from Coingecko shows. Notably, Worldcoin, within the last week, recorded more than 80% in profits. WLD price action today. Source: Coingecko Worldcoin: Big Whale Moves  In the meantime, big transactions that have added millions to the revenues of an unknown whale wallet in a matter of days have brought it to light. With the digital asset market a flurry of activity, people are paying close attention to and analyzing the emergence of WLD and its ramifications. Source: Etherscan The crypto market had a notable disruption when a well-known Worldcoin whale wallet, known as &#8220;0x0007&#8221;, executed an incredible maneuver. Leading on-chain data tracking tool Spot On Chain disclosed that the whale took out an astounding 2.09 million WLD tokens from Binance, valued at $5.82 million. The whale now owns an astounding $8.03 million in assets, having gained $2.15 million due to the recent spike in the price of WLD. It&#8217;s important to note that attributing the price surge solely to this single wallet&#8217;s activity is impossible without further information and expert analysis. However, its presence highlights the broader issue of market concentration and its potential impact on price stability. WLD currently trading at $5.2029 on the daily chart: TradingView.com Moving forward, transparency from Worldcoin regarding large token holders and their intentions, alongside robust regulations to mitigate manipulation risks, will be crucial to ensuring a healthy and sustainable ecosystem for WLD and the wider cryptocurrency market. Navigating Regulatory Headwinds And Privacy Concerns However, Worldcoin&#8217;s journey is not without hurdles. The company faced pushback in several countries, including France, India, and Brazil, where they had to halt iris scanning due to privacy concerns. These controversies raised questions about the ethical implications of collecting biometric data and its potential misuse. Additionally, their initial promise of offering free cryptocurrency in exchange for scans drew criticism for potentially exploiting vulnerable populations in developing countries. Related Reading: UNI Jumps Over 12% – Here’s Why Investors Flock To This Token Moving Forward: Transparency And Community Dialogue Hold The Key Worldcoin&#8217;s future trajectory hinges on its ability to navigate these complexities. Addressing privacy concerns with robust data security measures and clear opt-in processes is crucial. Transparency about project goals, tokenomics, and potential risks is essential for building trust within the wider community. Open dialogue with regulators and users will be key to securing social acceptance and navigating the legal landscape. While Worldcoin&#8217;s recent successes are noteworthy, they are accompanied by significant challenges and ethical considerations. Only through addressing these concerns and fostering open communication can Worldcoin hope to achieve its ambitious vision of a universal digital identity solution in a responsible and sustainable manner. Featured image from Adobe Stock, chart from TradingView"
  }
]