[
  {
    "source": "Decrypt",
    "date": "2023-11-02T11:22:49.000Z",
    "title": "MicroStrategy Buys More Bitcoin as Q3 Loss Widens",
    "url": "https://decrypt.co/204091/microstrategy-buys-more-bitcoin-as-q3-loss-widens",
    "description": "With the latest addition of Bitcoin to its balance sheet, MicroStrategy now holds approximately 0.75% of Bitcoin's circulating supply."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-02T11:15:30.000Z",
    "title": "Hong Kong issues rules for asset tokenization as interest mounts",
    "url": "http://cointelegraph.com/news/hong-kong-issues-asset-tokenization-rules",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/553b2267-3b79-4702-9aed-dd429cdfab46.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Hong Kong's securities regulator, the SFC, treats tokenized securities like traditional securities, subject to the same legal and regulatory norms.</p>\n                    <p><p>Hong Kong’s securities regulatory authority has issued two circulars to regulate digital asset tokenization in its pursuit of becoming a prominent Web3 hub in Asia.</p><p>The Securities and Futures Commission (SFC), in these circulars, <a href=\"https://apps.sfc.hk/edistributionWeb/gateway/EN/circular/doc?refNo=23EC52\" target=\"_blank\" rel=\"noopener nofollow\">offered</a> instructions to intermediaries participating in tokenized securities activities and outlined the criteria for tokenizing investment products authorized by the SFC.</p><p>The SFC considers tokenized securities as traditional securities with a tokenization layer. As a result, the exact legal and regulatory requirements that apply to conventional securities markets also pertain to tokenized securities.</p><p>The regulator specified that tokenized securities offerings must adhere to the Companies Ordinance’s prospectus regime and the Securities and Futures Ordinance’s offers of investments regime. Additionally, intermediaries providing advice on tokenized securities, managing tokenized funds, and facilitating secondary market trading on virtual asset trading platforms must comply with the existing conduct requirements for securities-related activities.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/02d41b0a-1c82-4f6e-bdd8-84921366e4cc.JPG\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of the tokenized security circular    Source: Securities and Futures Commission</em></figcaption></figure><p>The recent guidance from the regulator coincides with Hong Kong’s exploration of tokenization. In February, the Hong Kong Monetary Authority, acting as the de facto central bank,<a href=\"https://cointelegraph.com/news/hong-kong-issues-hk-800m-in-tokenized-green-bonds\"> issued the world’s inaugural tokenized green bond,</a> successfully raising approximately $100 million.</p><p>According to the circular, trading platforms with licenses must establish SFC-approved compensation arrangements to safeguard against potential security token losses. To illustrate, operators of cryptocurrency trading platforms can show their adoption of protective measures like transfer restrictions or whitelisting to ensure the security of tokenized securities.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/jpex-scandal-wont-impact-hong-kong-crypto-vision-financial-secretary\"><strong><em>​​JPEX scandal won’t hurt Hong Kong crypto vision: Financial Secretary</em></strong></a></p><p>Conversations about tokenization have recently surged, and the SFC noted a heightened interest from financial institutions in tokenizing traditional financial instruments within the global financial markets. </p><p>The regulatory body clarified that it has been reviewing different suggestions regarding tokenizing SFC-authorized investment products, including those related to the primary offering and secondary trading of tokenized products on SFC-licensed virtual asset trading platforms. It added:</p><blockquote>“The SFC sees the potential benefits of tokenization to the financial markets, particularly in increasing efficiency, enhancing transparency, reducing settlement time and lowering costs for traditional finance, but it is also aware of the new risks arising from using this technology.” </blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-city-guide-osaka-japan/\"><strong><em>Crypto City: Guide to Osaka, Japan’s second-biggest city</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-02T11:38:00.000Z",
    "title": "PayPal received SEC subpoena regarding its USD stablecoin reports Reuters",
    "url": "https://cryptoslate.com/paypal-received-sec-subpoena-regarding-its-usd-stablecoin-reports-reuters/",
    "description": "<p>PayPal has disclosed it received a subpoena from the Securities and Exchange Commission (SEC) tied to its U.S. dollar stablecoin, PYUSD, marking yet another milestone at the intersection of traditional finance and digital currencies, according to reports. As Reuters reported, this significant development follows PayPal&#8217;s pioneering move in August, when the tech giant became the first [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/paypal-received-sec-subpoena-regarding-its-usd-stablecoin-reports-reuters/\">PayPal received SEC subpoena regarding its USD stablecoin reports Reuters</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-02T11:18:07.000Z",
    "title": "IOG CEO Charles Hoskinson Tells Cardano ($ADA) Community: ‘We Need To Stop Being Drama Queens’",
    "url": "https://www.cryptoglobe.com/latest/2023/11/iog-ceo-charles-hoskinson-tells-cardano-ada-community-we-need-to-stop-being-drama-queens/",
    "description": "In a recent exchange that highlights the internal dynamics of the Cardano community, a user on social media platform X expressed a sentiment that has been simmering within the group: a perceived aversion to growth. The user’s post, which questioned the community’s critical stance towards developmental strides in the ecosystem, caught the attention of Charles […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-02T11:26:34.000Z",
    "title": "Vernissage at kanvas: First Viewing of Immersive NFTs",
    "url": "https://www.newsbtc.com/blockchain-art/vernissage-at-kanvas-first-viewing-of-immersive-nfts/",
    "description": "Dear Crypto fam, today we are looking into an event put on by an amazing couple, coming up in the Dubai NFT scene. Team VESA and Vernissage have become fast friends, as the two entities share a similar vision for fine art NFTs and maturing of the market. VESA co-Founder Lotta has also helped Vernissage in storifying their message, some of which is showcased here. It has been an absolute delight to see Vernissage grow and this article is our token of appreciation in anticipation of their debut exhibit. &#160; Vernissage was born out of the electric crackle between art lineage value, molten paint dripped onto canvases over centuries, and the brooding engine room of new technologies. Lifetime entrepreneurs Richard and Tatiana wanted to see art nurtured and valued in the age of the internet, not trampled by the metallic onslaught of ironic pop culture references and diminished prestige. We forsake value at our own peril, a manic risk like pouring gasoline on a fragile artefact. NFTs are the anvil, Vernissage wielding the hammer. The underlying technology, the facilitator, the potential, like on that night when two artists knocked on Richard and Tatiana’s door and presented them with a box full of rolled up canvases. &#160; &#160; Richard and Tatiana Zalan   Even though the platform is preparing for their first exhibition, Vernissage team Richard and Tatiana Zalan are no strangers to new technologies. Their interest piqued already in 2016, when they hosted meetups for people interested in blockchain technology and cryptocurrencies. Art, as their passion, they approached via the high effort, fine art type of digital art, rather than art that was focused on utilities and marketing. They saw blockchain technology as a vehicle to safeguard artists copyright and transition in the third age of the Internet. True admirers of genuine art, Vernissage origin story started forming when one night, travelling artists knocked on Richard and Tatiana’s door, with a box full of rolled up canvases. It amazed them how these artists were willing to go to such great lengths to connect with their potential buyers, and this set the wheels in motion in utilizing technology to continue our fine art legacy in Web3. There it was, value laden, curated fine art in a fast-paced, snappy medium that was brought to the market by people decorated with experience, who were not in their twenties anymore. Unusual and quirky? Yes. Desperately needed? Also, yes. Vernissage had started to take shape. &#160; &#160; V is for Vernissage Vernissage means an exclusive, first viewing of an artwork before a public showing. The name perfectly fits the platform’s mission to support emerging artists specifically. It reminds of something exciting, quite intimate, but also distinguished and steeped in tradition and value. Vernissage is striving for something quite extraordinary. The platform has functions of a marketplace and a social network. The emphasis is on the social aspects of the community, and thus Vernissage community members can interact with each other and vote. Richard and Tatiana want to see their artists become financially successful, therefore nurturing collector relationships within the community is of utmost importance in Vernissage. Their social consciousness runs deep, as Vernissage will allocate resources for young artists’ education and personal development in the future. This focus, they feel, is represented also in the wider context of our society, where socially we live in crucial times. Art can serve a pivotal role once again, especially if new technologies are utilized boldly and innovatively. This is why Dubai has served Vernissage well since the local government has passed relevant laws to make the city a leader in the sector. Get to know the Vernissage platform here: https://www.vernissage.network/ &#160; &#160; Immersion explosion on November 8th Soon it will be time. Vernissage is gearing up for its maiden voyage exhibition with a brand-new armada of artists that they successfully held and open call for in September. Vernissage has secured an impressive venue for the event; the kanvas Gallery in an artistically relevant neighbourhood near Alserkal Avenue. Kanvas Gallery lends itself to some spectacular immersion, opening the entire view for the artists use and pushing the boundaries of sensory overload. Kanvas wants to explore how human relationships, nature and art interact specifically mediated through technology. Fittingly, the topic of the night is Technology and Humanity Canvas. &#160; &#160; The experience is on 8th Nov, 6pm &#8211; 9pm, Opening night by invitation only. 9th Nov &#8211; 12th Nov, 10am till 6pm open to public. kanvas Dubai Unit 1, Al Khayat Art Avenue, 19 Street, Al Quoz 1, Dubai &#160; Don’t miss out on this night of artists, collectors, and community. &#160; &#160; Vernissage had carefully drawn a line in the sand, expertly prescribed the burn around its own kind, a place for artists to time and time again become the spark.  Successful, financially competent, a worthy opponent. &#160; Team VESA wishes Vernissage a successful exhibition and looks forward to catching up in Dubai again! &#160;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-02T11:29:24.000Z",
    "title": "Report: El Salvador Allegedly Used COVID Relief Funds to Buy Bitcoin",
    "url": "https://www.crypto-news-flash.com/report-el-salvador-allegedly-used-covid-relief-funds-to-buy-bitcoin/?utm_source=rss&utm_medium=rss&utm_campaign=report-el-salvador-allegedly-used-covid-relief-funds-to-buy-bitcoin",
    "description": "<img width=\"509\" height=\"339\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/istockphoto-1340083999-170667a.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/istockphoto-1340083999-170667a.jpg 509w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/istockphoto-1340083999-170667a-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/istockphoto-1340083999-170667a-104x69.jpg 104w\" sizes=\"(max-width: 509px) 100vw, 509px\" />President Nayib Bukele of El Salvador is accused of allocating over $200 million from COVID-19 relief funds for Bitcoin infrastructure, defying loan agreements. Criticism arises as reports indicate a low adoption rate of Bitcoin in El Salvador, with significant public opposition to the use of tax money for cryptocurrency investments. Following up the updates from [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-02T11:11:43.000Z",
    "title": "Global Wartime Inflation Could Propel XRP Price to $16, Analyst Predicts – Here’s Why",
    "url": "https://www.crypto-news-flash.com/global-wartime-inflation-could-propel-xrp-price-to-16-analyst-predicts-heres-why/?utm_source=rss&utm_medium=rss&utm_campaign=global-wartime-inflation-could-propel-xrp-price-to-16-analyst-predicts-heres-why",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-20.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-20.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-20-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-20-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Arthur Hayes says the Israeli-Palestine war will lead to an implosion in safe assets like treasury bonds, and investors will flee to BTC, XRP, Ether and other crypto. He predicted BTC would hit $1 million in this post-war world, and if XRP were to record such gains, it would hit $16. Since Hamas&#8217; surprise attack [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-02T11:10:14.000Z",
    "title": "4 Meme Coins That Can Be Sanctioned as Fraud by the SEC",
    "url": "https://www.altcoinbuzz.io/spotlight/4-meme-coins-that-can-be-sanctioned-as-fraud-by-the-sec/",
    "description": "<p>As the popularity of meme coins continues to surge, regulatory bodies like the SEC are increasingly scrutinizing their activities. Recently, SafeMoon, one of the prominent meme coins, faced allegations of being a fraudulent investment. This raises the question: which other meme coins could potentially face a similar fate? In this article, we will discuss the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/spotlight/4-meme-coins-that-can-be-sanctioned-as-fraud-by-the-sec/\">4 Meme Coins That Can Be Sanctioned as Fraud by the SEC</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-02T11:35:49.000Z",
    "title": "XRP Price Prediction: What to Expect in the Next 48 Hours",
    "url": "https://coinedition.com/xrp-price-prediction-what-to-expect-in-the-next-48-hours/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Ripple’s CEO Brad Garlinghouse recently put the spotlight on the performance of XRP Ledger’s decentralized exchange (DEX) platform following its substantial growth in the third quarter of this year. According to Garlinghouse, the platform recorded a threefold increase in its trading volume on a quarter-over-quarter basis. XRP Current Market Standing Ripple (XRP) is ranked as [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xrp-price-prediction-what-to-expect-in-the-next-48-hours/\">XRP Price Prediction: What to Expect in the Next 48 Hours</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-02T11:25:00.000Z",
    "title": "Expert Says Altcoins Breaking Out, Buy Dip, Amid Solana 31% Week Surge",
    "url": "https://coinedition.com/expert-says-altcoins-breaking-out-buy-dip-amid-solana-31-week-surge/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Altcoins Not Make States Youtuber\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto market is gradually entering the much-anticipated bullish market with sustained green days since last week. Digital assets aside from Bitcoin have made significant gains. For instance, Solana (SOL) achieved a surprising 31% growth in the last seven days, alongside XRP and Cardano (ADA). Amid the bullish rallies rocking the market, led by Bitcoin, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/expert-says-altcoins-breaking-out-buy-dip-amid-solana-31-week-surge/\">Expert Says Altcoins Breaking Out, Buy Dip, Amid Solana 31% Week Surge</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-11-02T11:37:00.000Z",
    "title": "Bitfinex’s Trading Platform Launched in Vietnamese",
    "url": "https://blog.bitfinex.com/media-releases/bitfinexs-trading-platform-launched-in-vietnamese/",
    "description": "<p>ROAD TOWN, British Virgin Islands, [November 2 , 2023] – Bitfinex (www.bitfinex.com/), a state-of-the-art digital token trading platform, today announced that it is now available in Vietnamese, providing greater accessibility for the exchange’s growing base of Vietnamese-speaking customers. This latest integration further illustrates Bitfinex’s ongoing...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/media-releases/bitfinexs-trading-platform-launched-in-vietnamese/\">Bitfinex’s Trading Platform Launched in Vietnamese</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]