[
  {
    "source": "Cointelegraph",
    "date": "2023-10-19T10:54:27.000Z",
    "title": "Finland works on instant payments system, embraces digital euro ",
    "url": "https://cointelegraph.com/news/cbdc-finland-instant-payments-system-embraces-digital-euro",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/9b833afc-1828-4862-a564-fd81adcb8b08.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Bank of Finland actively promotes the development of new forms of payment.</p>\n                    <p><p>Bank of Finland (BOF) is coordinating the creation of a Finnish instant payment solution compatible with European standards. BOF board member and member of the Governing Council of the European Central Bank (ECB) Tuomas Välimäki made the announcement on Oct. 19. </p><p>Välimäki revealed that the Bank of Finland is actively promoting the development of new forms of payment. The official called the digital euro “the most topical project” in the European payment sector:</p><blockquote>“The possible introduction of a digital euro would give consumers the option of paying with central bank money wherever electronic payment is accepted.”</blockquote><p>According to Välimäki, the Bank of Finland and the European Payments Council are also involved in creating a Finnish instant payment solution. This payment solution will be based on credit transfer and not depend on payment card rails. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/international-financial-group-finds-gaps-digital-euro-legislative\"><strong><em>International financial group finds gaps in digital euro legislative package</em></strong></a></p><p>In February 2023, Finnish company Membrane Finance released a fully reserved stablecoin <a href=\"https://cointelegraph.com/news/euro-stablecoin-launched-in-finland-claims-to-be-first-approved-in-the-eu\">backed by the euro</a>. Membrane Finance CEO Juha Viitala expressed hope that the regulated EUROe coin would encourage more Europeans to grow their wealth through <a href=\"https://cointelegraph.com/defi-101/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> applications.</p><p>This week, the governing council of the European Central Bank (ECB) has announced the <a href=\"https://cointelegraph.com/news/ecb-preparation-phase-digital-euro\">beginning of the ”preparation phase”</a> for the digital euro project. The preparation phase will last two years and focus on finalizing rules for the digital currency as well as selecting possible issuers.</p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/ethereum-restaking-blockchain-dangerous/\"><strong><em>Ethereum restaking. Blockchain innovation or dangerous house of cards?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-19T10:48:05.000Z",
    "title": "UAE emirate launches new free zone for digital assets, Web3 and AI",
    "url": "https://cointelegraph.com/news/web3-digital-assets-ai-uae-emirate-launches-new-free-zone",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/4f89bc2c-fbd0-49b1-b45b-f29e8aeef229.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ras Al Khaimah, known for its rich cultural sites, is turning to the virtual assets sector to diversify its economy away from traditional avenues such as tourism.</p>\n                    <p><p>Ras Al Khaimah ruler Sheikh Saud bin Saqr Al Qasimi inaugurated the new RAK Digital Assets Oasis (RAK DAO), an economic free zone dedicated to supporting companies involved in digital and virtual assets, blockchain, Web3, and artificial intelligence (AI), on Oct. 19.</p><p>As previously <a href=\"https://cointelegraph.com/news/uae-emirate-to-launch-free-zone-for-digital-and-virtual-asset-firms\">reported</a> by Cointelegraph, the free zone will be dedicated to digital and virtual assets service providers in emerging technologies, such as the metaverse, blockchain, utility tokens, virtual asset wallets, nonfungible tokens (NFTs), decentralized autonomous organizations (DAOs), decentralized applications (DApps) and other Web3-related businesses.</p><p>RAK DAO and its ecosystem partners will also run grant programs, and specialized support in various areas of technology, marketing, and business development.</p><p>“When we embarked on this… journey, our vision was to create a hub where digital assets could thrive, innovation could flourish, and groundbreaking ideas could come to light,” Sheikh Saud said in his opening remarks. “We wanted to provide a platform to foster its growth and success. He added:</p><blockquote>“We observed that global trends and data point to the incredible opportunity digital assets offer, and we felt… that Ras Al Khaimah could and should benefit from being a first adopter.” </blockquote><p>A memorandum of understanding (MoU) was also signed between the Securities and Commodities Authority (SCA) CEO Maryam Buti Al Suwaidi and RAK DAO chief executive Sameer Al Ansari.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/middle-east-regulatory-clarity-drives-crypto-industry-growth-binance-fze-head\">Middle East regulatory clarity drives crypto industry growth — Binance FZE head</a></em></strong></p><p>Cointelegraph reached out to RAK DAO for further comments but didn’t get an immediate response.</p><p>Ras Al Khaimah, known for its rich cultural sites, is turning to the virtual assets sector to diversify its economy away from traditional avenues such as tourism. However, the new free zone has entered a space where more popular technology hubs in Abu Dhabi and Dubai are already attracting global crypto firms.</p><p>RAK DAO joins the UAE’s list of Web3-friendly free zones — areas where entrepreneurs have 100% ownership of their businesses and have their own tax schemes and regulatory frameworks, except for the UAE’s criminal law — including the Abu Dhabi Global Market (ADGM), Dubai Multi Commodities Centre (DMCC) and Dubai International Financial Centre, among others.</p><p>Sheikh Saud issued Law No 2 of 2023, which decrees the establishment of RAK DAO as part of its economic diversification efforts and attempts to attract global players, the Emirates News Agency <a href=\"https://wam.ae/en/details/1395303140578\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> in March. The legislation grants the free zone financial, administrative, and legislative independence, allowing it to function as a purpose-built, innovation-enabling free zone for the virtual assets sector.</p><p>RAK DAO has since added several partners to help grow its ecosystem, including the <a href=\"https://cointelegraph.com/news/uae-free-zone-teams-up-with-hbar-foundation-to-support-web3-startups\">HBAR Foundation</a>, local bank <a href=\"https://ar.cointelegraph.com/news/uae-free-zone-for-digital-assets-secures-first-banking-partnership\">RAKBANK</a>, and Romanian AI firm <a href=\"https://ar.cointelegraph.com/news/uae-free-zone-inks-deal-with-romanian-firm-to-support-ai-startups\">Humans.ai</a>.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-19T11:00:56.000Z",
    "title": "OpenAI eyes $86 billion valuation amid insider share sale",
    "url": "https://cryptoslate.com/openai-eyes-86-billion-valuation-amid-insider-share-sale/",
    "description": "<p>Artificial intelligence (AI)-focused startup OpenAI&#8217;s valuation could soon soar to as much as $86 billion as the company is reportedly planning to conduct a tender offer allowing its current employees to sell their shares, Bloomberg reported on Oct. 19. A tender offer allows employees and existing company shareholders to convert their holdings into cash. An [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/openai-eyes-86-billion-valuation-amid-insider-share-sale/\">OpenAI eyes $86 billion valuation amid insider share sale</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-19T11:00:38.000Z",
    "title": "Querio: The Daring Upstart on a Mission to Revolutionize Decentralized Search",
    "url": "https://news.bitcoin.com/querio-the-daring-upstart-on-a-mission-to-revolutionize-decentralized-search/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/38b188ea-28c3-44c8-9c9b-9e3b7da99513-768x432.jpeg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/38b188ea-28c3-44c8-9c9b-9e3b7da99513-300x169.jpeg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/38b188ea-28c3-44c8-9c9b-9e3b7da99513-1024x576.jpeg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/38b188ea-28c3-44c8-9c9b-9e3b7da99513-768x432.jpeg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/38b188ea-28c3-44c8-9c9b-9e3b7da99513-190x107.jpeg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/38b188ea-28c3-44c8-9c9b-9e3b7da99513-380x214.jpeg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/38b188ea-28c3-44c8-9c9b-9e3b7da99513-760x428.jpeg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/38b188ea-28c3-44c8-9c9b-9e3b7da99513.jpeg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Imagine a new internet era with Querio, an ambitious decentralized search engine revolutionizing Web3 exploration. With lightning speed, pinpoint accuracy, and unwavering privacy, Querio serves as a portal to the decentralized technology universe, challenging the status quo and prioritizing user-centric discovery, setting the stage for a blockchain innovation-powered future. The Driving Forces Behind [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-19T11:08:10.000Z",
    "title": "Forbes predicts BlackRock and JPMorgan will drive the next bull run",
    "url": "https://www.cryptopolitan.com/blackrock-jpmorgan-to-drive-bull-run-forbes/",
    "description": "BlackRock and JPMorgan, one of the leading companies in America, are at the forefront of crypto as well. Since its inception, the crypto market has been on a rollercoaster ride, with Bitcoin having the lead charge and being a poster child for the digital revolution.&#160; Bitcoin’s notary has grown over the years, igniting development proceedings ... <a title=\"Forbes predicts BlackRock and JPMorgan will drive the next bull run\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blackrock-jpmorgan-to-drive-bull-run-forbes/\" aria-label=\"More on Forbes predicts BlackRock and JPMorgan will drive the next bull run\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-19T10:52:44.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now: how will this affect our Cosmos Price Prediction? How ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-19T10:44:28.000Z",
    "title": "The dark side of crypto: A story of fraud and political transformation in Florida",
    "url": "https://www.cryptopolitan.com/the-dark-side-of-crypto-in-florida-politics/",
    "description": "Brian Beute is currently running for political office under Andrew Yang’s pro-tech political party. His history on crypto might have affected his decision as well as the ballot in the smallest elections. His decision to join the political world comes from the crypto fraud activities that have pushed many in Florida to losses.&#160; The region ... <a title=\"The dark side of crypto: A story of fraud and political transformation in Florida\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-dark-side-of-crypto-in-florida-politics/\" aria-label=\"More on The dark side of crypto: A story of fraud and political transformation in Florida\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-19T10:42:09.000Z",
    "title": "AI Used in High-Profile Conspiracy Trial Sparks Controversy",
    "url": "https://www.cryptopolitan.com/ai-used-in-high-profile-conspiracy-trial-sparks-controversy/",
    "description": "In a multimillion-dollar conspiracy trial that captivated both the entertainment and political worlds, a surprising player has emerged on the scene – artificial intelligence (AI). Prakazrel &#8220;Pras&#8221; Michel, a member of the iconic hip-hop group Fugees, is now arguing that his trial lawyer&#8217;s use of an &#8220;experimental&#8221; generative AI program was among the many blunders ... <a title=\"AI Used in High-Profile Conspiracy Trial Sparks Controversy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-used-in-high-profile-conspiracy-trial-sparks-controversy/\" aria-label=\"More on AI Used in High-Profile Conspiracy Trial Sparks Controversy\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-19T10:41:54.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? Today&#8217;s Aave price is $61.77, with a 24-hour trading volume of $53,241,324.  Aave is down 1.96% in the last 24 hours. The current CoinMarketCap ranking is #43, with a live market cap of $902,258,435. It has a circulating supply of 14,588,271 AAVE coins and a max. supply of 16,000,000 AAVE ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-19T11:00:41.000Z",
    "title": "FTX Billion-Dollar Fraud: Expert Figures Out Where The Missing $9 Billion Went",
    "url": "https://www.newsbtc.com/ftx/ftx-fraud-missing-9-billion/",
    "description": "The trial of the former CEO of the defunct crypto exchange FTX, Sam Bankman-Fried (SBF), continued on October 18 with the direct examination of the prosecution’s expert witness, Peter Easton, an Accounting Professor who works at the University of Notre Dame.  Expert Testimony Shows Customers’ Funds Were Stolen According to a report by Bloomberg, Easton explained that $9 billion in customers’ funds had already gone missing since June 2022, five months before FTX filed for bankruptcy. He specifically alluded to the customers&#8217; deposits, which were made into Alameda Research’s bank accounts.  Related Reading: When Will Bitcoin Price Reach $1,000,000? Pundit Lays Out A Timeline Having laid a foundation that Bankman-Fried stole FTX’s customers’ funds through Alameda, the next step in the prosecution’s case was to show that these funds were indeed stolen, and that was the role of Easton, who has an expertise in “penetrating the details of financial statements.”  He stated that based on deposits made by customers, Alameda was meant to have held $11.3 billion in FTX customers’ funds, but only $2.3 billion was actually in the trading firm’s bank accounts. According to him, these funds were ultimately used for several purposes. FTT Token bulls struggle to hold $1 &#124; Source: FTTUSDT on Tradingview.com What The Stolen FTX Funds Were Used For Easton further provided details as to where some of these funds went. He alleged that some of these funds were used to invest in companies like Anthony Scaramucci’s SkyBridge Capital, Lily Zhang’s Modulo Capital, Robinhood, Dave and Anthropic.  Specifically, he stated that the investment in Modulo was 100% from customers’ funds, with him being able to trace the transaction from FTX’s database. While giving her testimony, Alameda’s ex-CEO, Caroline Ellison, also revealed that Alameda, with SBF’s permission, used FTX’s customers&#8217; funds to repay its lenders. Easton corroborated this statement as he mentioned that some of the missing funds were used to repay lenders like Celsius, Abra, Maple, and Anchorage.  Related Reading: Analyst Predicts XRP Price To Hit $100: Here’s How To Become A Millionaire His testimony didn’t stop there, though, as, according to him, some of the funds were also used to fund political campaigns, charity foundations, and real estate purchases. Part of these political contributions included the $1 million that FTX’s Director of Engineering Nishad Singh had donated to Mind The Gap (MTG), a Political Action Committee (PAC) that SBF’s mum Barbara Fried co-founded.  Additionally, $96 million of these customers’ funds is said to have been spent on real estate purchases, of which a property owned by SBF’s parents happens to be among them, going by the evidence tendered by the prosecution.  The professor mentioned that all these discoveries were made following his analysis of Alameda’s statements, information from the FTX database, documents from lenders, and on-chain data. Featured image from Financial Times, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-19T11:05:04.000Z",
    "title": "Shiba Inu Unveils Game-Changing Upgrade: All Details for Investors",
    "url": "https://www.crypto-news-flash.com/shiba-inu-unveils-game-changing-upgrade-all-details-for-investors/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-unveils-game-changing-upgrade-all-details-for-investors",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shibarium\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-2048x1152.jpg 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Bad Idea AI, in partnership with Shiba Inu, has launched an upgrade known as version 2.0 Release Notes. As part of the Shiba Inu community, BAD proposed the creation of a digital art gallery where artists can sell their work in the form of NFTs, with BAD tokens enabling users to make purchases. Bad Idea [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-19T11:00:37.000Z",
    "title": "Lido Reconsiders Blockchain Terrain: Halts Solana and Eyes Exit from Polygon",
    "url": "https://www.crypto-news-flash.com/lido-reconsiders-blockchain-terrain-halts-solana-and-eyes-exit-from-polygon/?utm_source=rss&utm_medium=rss&utm_campaign=lido-reconsiders-blockchain-terrain-halts-solana-and-eyes-exit-from-polygon",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-116.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-116.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-116-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The Lido community contemplates ending its project on Polygon due to financial concerns and evolving uncertainties. This consideration follows closely on the heels of Lido&#8217;s recent halt to new Solana token staking. Navigating the Blockchain Crossroads: Lido&#8217;s Dilemma In the ever-shifting landscape of blockchain and cryptocurrencies, adaptability becomes paramount. The Lido community stands at this [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-19T10:52:00.000Z",
    "title": "$25K to $30K is a Crucial Demand Bucket For Bitcoin: Analyst",
    "url": "https://coinedition.com/25k-to-30k-is-a-crucial-demand-bucket-for-bitcoin-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"People Holding Bitcoin for the Last 5 Years Are Now in 34% Loss\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A renowned crypto data analyst identified as Ali on X (formerly Twitter) has advised crypto users to ignore calls asking them to wait for Bitcoin to drop to $20,000 before buying. According to Ali, the crucial demand bucket in Bitcoin history is between $25,000 and $30,000. In a recent post, Ali noted that $25,000 to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/25k-to-30k-is-a-crucial-demand-bucket-for-bitcoin-analyst/\">$25K to $30K is a Crucial Demand Bucket For Bitcoin: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]