[
  {
    "source": "Decrypt",
    "date": "2023-09-14T10:01:02.000Z",
    "title": "Ralph Lauren, Burberry Alum Launches Digital Fashion Platform SYKY",
    "url": "https://decrypt.co/156644/ralph-lauren-burberry-alum-launches-digital-fashion-platform-syky",
    "description": "The platform, which will offer both digital and physical fashion items, seeks to coax the traditional fashion industry onto the blockchain."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-14T10:00:38.000Z",
    "title": "Circle integrates Web3 platform into Singapore ‘Super App’ Grab",
    "url": "https://cryptoslate.com/circle-integrates-web3-platform-into-singapore-super-app-grab/",
    "description": "<p>In a significant move towards realizing the potential of digital asset innovation, Circle is set to pilot Web3 customer experiences in Singapore through a strategic partnership with Grab, Southeast Asia&#8217;s super app for transport, deliveries, payments, and more. Circle&#8217;s latest offering, a new Web 3 Services platform, is slated for integration in the Grab app [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/circle-integrates-web3-platform-into-singapore-super-app-grab/\">Circle integrates Web3 platform into Singapore &#8216;Super App&#8217; Grab</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-14T09:43:09.000Z",
    "title": "Large and small-scale investors show divergent reactions to Bitcoin downturn",
    "url": "https://cryptoslate.com/insights/large-and-small-scale-investors-show-divergent-reactions-to-bitcoin-downturn/",
    "description": "<p>Quick Take Recent data analysis reveals a fascinating trend within the Bitcoin investing landscape. For almost a month, there&#8217;s been a significant influx of Bitcoin to exchanges, particularly from investors in the $10M or more bracket. This surge comes in the wake of Bitcoin&#8217;s retracement from $30,000 to $25,000, suggesting that this cohort may have [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/large-and-small-scale-investors-show-divergent-reactions-to-bitcoin-downturn/\">Large and small-scale investors show divergent reactions to Bitcoin downturn</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-14T10:00:48.000Z",
    "title": "Yellow Card’s Partnership With Moonpay Set to Enhance Nigerian Users’ Crypto Trading Experience",
    "url": "https://news.bitcoin.com/yellow-cards-partnership-with-moonpay-set-to-enhance-nigerian-users-crypto-trading-experience/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Yellow Card&#039;s Partnership With Moonpay Set to Enhance Nigerian Users&#039; Crypto Trading Experience\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Yellow Card, the Africa-focused crypto exchange, recently said it had joined forces with Moonpay in an arrangement which is expected to help &#8220;enhance the crypto purchasing experience for Nigerians by leveraging local bank transfers.&#8221; According to Uzoma James, Yellow Card&#8217;s West Africa regional manager, the partnership is expected to &#8220;make crypto trading easy, intuitive, and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T10:08:49.000Z",
    "title": "Malaysia’s central bank expected to hold rates as inflation outlook improves",
    "url": "https://www.cryptopolitan.com/malaysia-central-bank-expected-to-hold-rates/",
    "description": "Aligning with the consensus among most economists, BMI, a Fitch Solutions company, anticipates that Bank Negara Malaysia (BNM) will maintain the overnight policy rate (OPR) at 3% for the remainder of this year and through 2024. The decrease influences this projection in year-on-year headline inflation, which eased to 2% in July 2023, down from 2.8% ... <a title=\"Malaysia&#8217;s central bank expected to hold rates as inflation outlook improves\" class=\"read-more\" href=\"https://www.cryptopolitan.com/malaysia-central-bank-expected-to-hold-rates/\" aria-label=\"More on Malaysia&#8217;s central bank expected to hold rates as inflation outlook improves\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T10:08:39.000Z",
    "title": "My Hero Academia Meets Fortnite: Harnessing Quirks and Superpowers",
    "url": "https://www.cryptopolitan.com/my-hero-academia-meets-fortnite-harnessing/",
    "description": "The students of U.A. High School have returned for another exhilarating training mission in the world of Fortnite. As Shoto Todoroki, Eijiro Kirishima, and Mina Ashido make their debut in the Item Shop, players are in for a thrilling experience like never before. Among the exciting offerings, Todoroki&#8217;s Ice Wall stands out as a game-changer. ... <a title=\"My Hero Academia Meets Fortnite: Harnessing Quirks and Superpowers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/my-hero-academia-meets-fortnite-harnessing/\" aria-label=\"More on My Hero Academia Meets Fortnite: Harnessing Quirks and Superpowers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T10:04:11.000Z",
    "title": "The AI Perspective Ranking of the Biggest Football Clubs in History",
    "url": "https://www.cryptopolitan.com/the-ai-ranking-of-biggest-football-clubs/",
    "description": "The age-old debate of determining the biggest football clubs in the world has raged on for years, fueled by passionate fans defending their team&#8217;s honor, even in the absence of recent silverware. Chat GPT, a language processing tool backed by artificial intelligence technology, has taken a shot at identifying the top 10 football clubs in ... <a title=\"The AI Perspective Ranking of the Biggest Football Clubs in History\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-ai-ranking-of-biggest-football-clubs/\" aria-label=\"More on The AI Perspective Ranking of the Biggest Football Clubs in History\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T09:53:55.000Z",
    "title": "Is AI’s Impact on Future Employment Trends Inevitable?",
    "url": "https://www.cryptopolitan.com/ais-impact-future-employment-trends/",
    "description": "The rapid advancement of artificial intelligence (AI), particularly generative AI applications like ChatGPT, is capturing the world&#8217;s imagination and raising profound questions about its impact on future employment trends. While AI promises to contribute trillions to global GDP and boost productivity, concerns about job displacement and the evolving nature of work are becoming increasingly palpable. ... <a title=\"Is AI&#8217;s Impact on Future Employment Trends Inevitable?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ais-impact-future-employment-trends/\" aria-label=\"More on Is AI&#8217;s Impact on Future Employment Trends Inevitable?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T09:42:40.000Z",
    "title": "ETH and BTC stall amid inflation in August",
    "url": "https://www.cryptopolitan.com/eth-and-btc-stall-amid-inflation-in-august/",
    "description": "August was an unfavorable month across the USA, with soaring inflation. However, crypto prices have stalled without forming any distinct trends. Bitcoin continues to flirt with the 30,000 mark, as Ethereum shows an upward trend. The inflation levels in August have slightly decreased from a staggering nine percent in June but are still above the ... <a title=\"ETH and BTC stall amid inflation in August\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eth-and-btc-stall-amid-inflation-in-august/\" aria-label=\"More on ETH and BTC stall amid inflation in August\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-14T09:51:46.000Z",
    "title": "Sui Network adds Google, Twitch, and Facebook logins for dapps",
    "url": "https://crypto.news/sui-network-adds-google-twitch-and-facebook-logins-for-dapps/",
    "description": "The Sui Network aims to simplify web3 access, enabling user registrations on its apps without having to manage an external crypto wallet or seed phrase."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-14T09:50:27.000Z",
    "title": "Solana Gains 5% Despite CPI Latest Data And FTX Liquidation Approval – Here Could Be Why",
    "url": "https://www.newsbtc.com/news/solana/solana-gains-5-despite-cpi-latest-data-and-ftx-liquidation-approval-here-could-be-why/",
    "description": "Solana (SOL) has recorded a 5% gain in the last 24 hours amidst certain concerning developments in the crypto space. On Wednesday, the United States published its Consumer Price Index (CPI) data for August, which shows that inflation rose from 3.2% to 3.7%, higher than the predicted outcome by analysts. In addition, the bankrupt FTX exchange obtained court approval to liquidate its crypto holdings worth $3.4 billion as it looks to offset its debt. Normally, developments such as this are expected to induce a selling pressure on crypto assets.  However, the majority of the market is staying afloat with slight gains in the last few hours, while Solana has even embarked on a rally, drawing much attention from investors.  Interestingly, popular crypto analyst Michaël van de Poppe has given possible reasons as to why the crypto market may not be moving as widely expected.  Most of FTX’s Solana Are Staked And Inaccessible &#8211; Analyst Explains According to an X post on Wednesday, Michaël van de Poppe states that there should not be much reaction from the crypto market despite the latest CPI data and the court approval for FTX’s liquidation. Related Reading: Solana Potential Rebound: Can Bulls Hit Their $30 Target? The analyst explains that most of the Solana, which makes up the bulk of the FTX crypto holdings, with a value of $1.2 billion, is currently staked and thus cannot be liquidated. Van de Poppe states that only 7 million SOL is available to FTX for liquidation, and most of these tokens have been sold in the past week. Given these circumstances, the analyst predicts a “sell the rumor, buy the news” scenario would likely occur. In relation to the other crypto holdings of FTX, Michaël van de Poppe states the exchange is only allowed to sell $200 million worth of assets per week.  Furthermore, the current market prices have been factored on during the calculation of this liquidation rate; thus, it will likely not produce a high level of selling pressure.  In addition to Solana, FTX also looks to liquidate other assets such as Bitcoin (BTC), Ethereum (ETH), Aptos (APT), and XRP, among others. Van De Poppe’s Take On CPI Report Explaining the crypto market’s response to the latest CPI data, Michaël van de Poppe explains that while inflation rates rose higher than predicted in August, the core CPI value was 4.3% as expected, which is lower than July’s value of 4.7% Related Reading: SOL Price Prediction: Solana Takes Hit and Could Dive To $15 Therefore, the analyst postulates that the US Federal Reserve would likely not be introducing any interest rate hike. This is because the Fed is known to focus more on core CPI data, which provides a long-term outlook on the nation’s inflation rate.  At the time of writing, Solana trades at $18.69, with a loss of 0.29% in the last hour based on data from CoinMarketCap. Meanwhile, the token’s trading volume is up by 47.89% and is now valued at $446.52 million.  Solana (SOL) trading at $18.77 on the hourly chart &#124; Source: SOLUSDT chart on Tradingview.com Featured image from The Economic Times, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-14T10:00:13.000Z",
    "title": "Dogecoin (DOGE) to Surge in Value Following Speculation of X Integration, Pepe (PEPE) Aims to Recover, Everlodge (ELDG) Upswing Continues",
    "url": "https://www.crypto-news-flash.com/dogecoin-doge-to-surge-in-value-following-speculation-of-x-integration-pepe-pepe-aims-to-recover-everlodge-eldg-upswing-continues/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-doge-to-surge-in-value-following-speculation-of-x-integration-pepe-pepe-aims-to-recover-everlodge-eldg-upswing-continues",
    "description": "<img width=\"512\" height=\"242\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T102849.595.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T102849.595.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T102849.595-300x142.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Dogecoin (DOGE) is getting a lot of attention following speculation of its integration on top of the X platform. Moreover, Pepe (PEPE) is another meme-coin that was developed in the theme of the popular internet meme, Pepe the Frog and is trying to recover from the losses experienced in August. A dominant upcoming project is [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-14T10:00:04.000Z",
    "title": "Crypto.com Hosts the First Apac Hackathon.",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/crypto-com-hosts-the-first-apac-hackathon/",
    "description": "<p>Crypto.com has announced the start of its first APAC Hackathon. Academic partners like Singapore Management University and Melbourne Business School support the Hackathon. The Hackathon invites participants from all over the APAC zone to submit ideas that use Web3 and AI-powered solutions. The idea is to address the most pressing needs in support of the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/crypto-com-hosts-the-first-apac-hackathon/\">Crypto.com Hosts the First Apac Hackathon.</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]