[
  {
    "source": "Cointelegraph",
    "date": "2023-06-30T04:40:56.000Z",
    "title": "Federal Reserve's banking bailouts reach a new weekly high of $103B",
    "url": "https://cointelegraph.com/news/federal-reserve-bank-bailout-fund-new-high",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a8c82464-6879-4109-8699-7b48ed5d80b1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Fed’s emergency loan facility has reached new highs as embattled banks are needing a central bank bailout.</p>\n                    <p><p>The American central bank’s emergency fund for embattled banks has seen its highest level of distressed asset redemptions since its inception three months ago.</p><p>The emergency lending program — known as the <a href=\"https://cointelegraph.com/news/us-fed-announces-25b-in-funding-to-backstop-banks\">Bank Term Funding Program (BTFP)</a> — was introduced in March amid the United States banking crisis which saw the collapse of Silicon Valley Bank, among others. The fund essentially is aimed at backstopping banks and other depository firms. </p><p>According to data from the Federal Reserve Bank of St. Louis, the Fed's Bank Term Funding Program (BTFP) has reached a record <a href=\"https://fred.stlouisfed.org/series/H41RESPPALDKNWW\" target=\"_blank\" rel=\"noopener nofollow\">level</a> of $103.08 billion in loans for the week ending June 28.</p><p>The milestone figure means that the Fed is still bailing out banks despite its attempts to reassure investors that the banking crisis is over. </p><p>Market analyst Joe Consorti also opined on the latest figures, claiming that the “Fed's shadow liquidity is propping up risk-taking behavior across markets.”</p><p>This may encourage investors to take larger risks as evidenced by increases in stock markets such as the S&amp;P 500, he said. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Emergency loans from the Fed&#39;s BTFP facility rose to $103.1 billion this week — a new high.<br><br>No surprise, as usage of BTFP rises (and banks&#39; UST losses are erased) the S&amp;P 500 rises too.<br><br>BTFP = Buy The F*cking Ponzi <a href=\"https://t.co/MZCr5oO7aY\">pic.twitter.com/MZCr5oO7aY</a></p>&mdash; Joe Consorti ⚡ (@JoeConsorti) <a href=\"https://twitter.com/JoeConsorti/status/1674538392900517893?ref_src=twsrc%5Etfw\">June 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Imho the Fed will definitely have to create a new facility to buy distressed CRE loans and maybe even CMBS,” said Consorti, referring to commercial real estate and commercial mortgage-backed securities.</p><p>According to <a href=\"https://www.msn.com/en-ca/money/other/us-regulators-ask-lenders-to-work-with-stressed-commercial-real-estate-firms/ar-AA1ddWB3\" target=\"_blank\" rel=\"noopener nofollow\">Reuters</a>, U.S. banking regulators have been asking lenders to work with credit-worthy borrowers that are facing stress as commercial real estate lending remains under pressure. </p><p>Furthermore, the BTFP peak has come in the same week that the Federal Reserve announced its <a href=\"https://cointelegraph.com/news/major-banks-pass-federal-reserve-stress-test\">banking stress test results</a>, passing the top 23 lenders in the country. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/concern-over-banking-crisis-reaches-levels-unseen-since-2008-poll\"><strong><em>Concern over banking crisis reaches levels unseen since 2008 — Poll</em></strong></a></p><p>American banks are not the only ones in trouble. According to a Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-06-26/bundesbank-may-need-bailout-on-ecb-bond-buying-auditor-says\" target=\"_blank\" rel=\"noopener nofollow\">report</a> earlier this week, Germany’s Bundesbank may need a bailout for losses on bonds acquired as part of the European Central Bank asset-purchase programs.</p><p>The Telegraph reported that it is a wider problem as after “trillions of dollars of such central bank money-printing worldwide, the chickens are coming home to roost,” as banks are drowning in debts amid rising interest rates. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-home-loan-bitcoin-mortgage-risky/\">Home loans using crypto as collateral: Do the risks outweigh the reward?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]