[
  {
    "source": "Cointelegraph",
    "date": "2024-02-07T04:04:57.000Z",
    "title": " BlockFi and 3AC settlement deal gets judge’s go-ahead but remains sealed ",
    "url": "https://cointelegraph.com/news/blockfi-three-arrows-capital-deal-gets-judges-nod-but-remains-sealed",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMjZiZGJiYTQtM2ZkNi00ZmNmLWI2MzQtYTg2M2M0ZWYzNzliLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A settlement between crypto lender BlockFi and defunct crypto hedge fund 3AC can proceed, but details will remain sealed. </p>\n                    <p><p>A United States judge has approved a settlement resolving claims and disputes between crypto lender BlockFi and defunct crypto hedge fund Three Arrows Capital (3AC), but ordered thathe details remain sealed.</p><p>In a Feb. 6 hearing, New Jersey Bankruptcy Court Judge Michael Kaplan approved a settlement between the companies to prevent further legal dueling as BlockFi claimed 3AC owed it $129 million, while the hedge fund claimed BlockFi owed it $280 million. </p><p>Judge Kaplan declined to unseal the settlement agreement, stating it would be “counter-intuitive” to do so and rebutted the U.S. Trustee’s objection to the seal that argued the terms should be disclosed  because the debtors had not justified the need to seal the settlement. </p><p><a href=\"https://cointelegraph.com/news/blockfi-three-arrows-capital-deal-gets-judges-nod-but-remains-sealed\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T03:57:01.000Z",
    "title": "Yellen calls for a unified regulatory approach to address risks in the digital asset market",
    "url": "https://www.cryptopolitan.com/yellen-calls-for-in-digital-asset-market/",
    "description": "In a recent hearing before the House Financial Services Committee, United States Treasury Secretary Janet Yellen emphasized the urgent need for federal oversight of stablecoins, calling for a unified regulatory approach applicable across all U.S. states.&#160; Yellen&#8217;s remarks underscored concerns over potential risks to investors and the financial system posed by the burgeoning digital asset [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T03:56:25.000Z",
    "title": "Glif Garners $4.5 Million in Seed Funding, Revolutionizing Filecoin Ecosystem",
    "url": "https://www.cryptopolitan.com/glif-4-5-mill-seed-fund-filecoin-ecosystem/",
    "description": "In an ambitious move set to redefine the decentralized finance (DeFi) landscape within the Filecoin ecosystem, Glif, the pioneering liquid leasing protocol, has successfully secured $4.5 million in a seed funding round.&#160; The financial injection, led by the esteemed Multicoin Capital, positions Glif at the forefront of innovation, offering Filecoin FIL holders and storage providers [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T03:49:18.000Z",
    "title": "How Do AI-Generated IDs Challenge Traditional Authentication Methods?",
    "url": "https://www.cryptopolitan.com/ai-generated-ids-challenge-authentication/",
    "description": "In a groundbreaking development, an underground service known as OnlyFake has emerged, utilizing basic AI technology to produce counterfeit IDs with unprecedented realism. Dubbed &#8220;AI-generated IDs,&#8221; these falsified documents are being sold for a mere $15, promising to circumvent stringent know-your-customer (KYC) measures and facilitate a myriad of illicit activities. This revelation poses profound ethical [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T03:44:39.000Z",
    "title": "MicroStrategy hits $8B Bitcoin holdings in record acquisition",
    "url": "https://www.cryptopolitan.com/microstrategy-hits-8b-bitcoin-holdings/",
    "description": "In its latest earnings report, MicroStrategy, the prominent business software firm, revealed a significant increase in its Bitcoin holdings, acquiring an additional 850 BTC in January. This move brings the company&#8217;s total Bitcoin holdings to an impressive 190,000 BTC, valued at $8.1 billion. MicroStrategy has continued to assert its position as the largest publicly traded [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-07T04:00:48.000Z",
    "title": "Bittensor (TAO) Surges 100%, Eyeing $3 Billion Market Cap: Analyzing The Propelling Factors",
    "url": "https://www.newsbtc.com/news/bittensor-tao-surges-100-eyeing-3-billion-market-cap-analyzing-the-propelling-factors/",
    "description": "Among the digital currencies focused on artificial intelligence (AI), Bittensor (TAO) has recently gained significant attention as the best-performing asset, soaring by an impressive 109% over the past 30 days and achieving a market capitalization of $2.9 billion.  To comprehend the driving forces behind this growth, it is essential to understand what underpins the platform and the catalysts that have captured investors&#8217; attention, enabling it to reach an almost $3 billion market cap in record time. Bittensor ‘Game-Changing’ Upgrade?  According to Sami Kassab, a researcher at Messari, Bittensor has transitioned from being a niche crypto-AI project to gaining widespread recognition within the open-source AI community.  Notably, a significant network upgrade proposal called Dynamic TAO has been pivotal in this surge. Bittensor operates as an ecosystem of specialized networks, known as subnets, each dedicated to a specific machine learning use case or resource provision. These subnets offer diverse services, including conversational AI platforms similar to ChatGPT, prediction tools for financial markets, pre-trained and fine-tuned models, synthetic data, and data storage solutions.  The Root Network, specifically subnet 0, functions as Bittensor&#8217;s governing body, where Root validators vote on the allocation of emissions to the various subnets. However, two key issues have been identified with the current system: Concentration of Influence Over Emissions: The top five Root validators control over 60% of the token supply. Scalability Issues: The manual process of setting emissions for each subnet becomes increasingly impractical as the number of subnets grows. Related Reading: Bitcoin, Solana Take Center Stage In $721 Million In Institutional Inflows The foundation has proposed a network upgrade known as Dynamic TAO to address these issues. This upgrade aims to replace the Root Network with an automated, market-driven mechanism for emission distribution, shifting away from a subjective, manual process dominated by a few validators. Furthermore, according to the researcher, under Dynamic TAO, each subnet would have its unique token and native liquidity pool paired with TAO.  Emissions would be allocated based on the relative market price of these subnet tokens. Subnets that generate the most value would see their subnet tokens in high demand from validators, signaling the protocol to allocate more emissions to them. Bullish Demand For TAO To prevent potential dilution of TAO, subnet tokens are designed to be non-transferable outside the Bittensor system.  The conversion between subnet tokens and TAO would occur through the protocol&#8217;s intrinsic liquidity pools (LP), treated as a staking activity. According to Kassab, acquiring subnet tokens would thus require purchasing and staking TAO within a subnet pool for validation or speculation. This design is expected to create bullish demand for TAO, as the need for subnet tokens would drive an increased demand for TAO.  For instance, the research shows that if subnets achieve a collective valuation of $1 billion, assuming a 10% weekly trading volume relative to their market cap, the demand for TAO could witness a 2 &#8211; 4x surge, driven by the requirement to purchase TAO before acquiring subnet tokens. Ultimately, Kassab believes that the Dynamic TAO proposal sets the stage for an &#8220;AI Casino&#8221; within Bittensor, a development with positive implications for the platform and the token’s price growth. Related Reading: Whale Rapidly Accumulating Chainlink: What’s Going On With LINK? Overall, Bittensor&#8217;s solutions and proposals demonstrate an intriguing approach to drive growth within its ecosystem. These initiatives aim to attract investors, stakers, and developers focusing on artificial intelligence, all while leveraging the potential of its native token, TAO. At the time of writing, the TAO token is trading at $481, reflecting an increase of over 12% within 24 hours. Furthermore, TAO has demonstrated a sustained upward trend over significant time frames, with an 8% growth in the past 7 days and an 85% growth over the past 14 days. Moving forward, it remains to be seen how the protocol will continue to attract new investors and developers, potentially driving TAO&#8217;s price beyond its current all-time high of $521, achieved on February 6.  Featured image from Shutterstock, chart from TradingView.com"
  }
]