[
  {
    "source": "CryptoSlate",
    "date": "2023-07-03T12:40:24.000Z",
    "title": "Asia crypto hubs introduce new bans to lending, staking for retail investors",
    "url": "https://cryptoslate.com/singapores-central-bank-bans-lending-and-staking-for-retail-investors/",
    "description": "<p>The Asian crypto hub Singapore and neighboring Thailand have released new directives over the handling of digital assets in two announcements on July 3. Singapore&#8217;s six new requirements for crypto businesses The Monetary Authority of Singapore (MAS) issued six new requirements for crypto firms to protect crypto investors. In addition to the new rules, MAS [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/singapores-central-bank-bans-lending-and-staking-for-retail-investors/\">Asia crypto hubs introduce new bans to lending, staking for retail investors</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-03T12:45:00.000Z",
    "title": "NFT Collection Fang Gang Price, Stats, and Review13123123",
    "url": "https://cryptodaily.co.uk/2023/07/nft-collection-fang-gang-price-stats-and-review13123123",
    "description": "What is an Fang Gang?\n<p>Fang Gang are a non-fungible tokens collection built on the Ethereum network launched in 28 August, 2021. 8,886 items of the Fang Gang collection can now be viewed at OpenSea.</p>\nHow many owners does the Fang Gang collection have?\n<p>The total number of owners has reached 4141 within 673 days since its release.</p>\nNFT Collection Fang Gang Price and Sales\n<p>The market capitalization of Fang Gang NFT collection is 202.56 ETH. Since created the Fang Gang, 23,226 collections sales were made at an average price of 0.27 ETH (~$524.42 at the time of writing). This created a total volume in 6,212.415 ETH. The floor price of Fang Gang is 0.0211 and the 30-day trading volume is kept at 2.50 ETH. The payment tokens of the Fang Gang collection are ETH, DAI, WETH, USDC, APE.</p>\nWhy are some NFTs expensive and others not?\n<p>NFTs are very new to the blockchain ecosystem and are still in their infancy. It is an emerging market meaning there is no historical data or precedence that can assist in determining the value of an NFT. NFT projects that started at the beginning of the market boom have garnered legitimacy purely because they had a first-mover advantage. These &ldquo;established&rdquo; NFT projects have also had the opportunity to improve and learn from the issues that have plagued the NFT market and have, in such a way, made themselves more valuable. When the NFT boom took flight, many people realized profits beyond their wildest dreams, creating a space for opportunists to take advantage of the market growth. While some NFTs can be considered digital art, created by an artist who recognizes the value NFTs can add to the creative space, others have been made purely out of greed and a need to exploit the immense market growth. NFT projects that stem from greed and exploitation often have no value and are ultimately garbage.</p>\nIs the Fang Gang Collection Over or Underpriced?\n<p>It is difficult to determine whether NFTs from the Fang Gang collection is overpriced or underpriced. Making such an assessment will become clearer when the market for NFTs and metaverses develops more actively. The price is also influenced by how the Fang Gang collection is developed and promoted by its creators and community.</p>\nFang Gang NFT Collection Examples\n\n<p class=\"nft-card-txt\">Fangster 0</p>\n\n\n<p class=\"nft-card-txt\">Fangster 1</p>\n\n\n<p class=\"nft-card-txt\">Fangster 2</p>\n\n\n<p class=\"nft-card-txt\">Fangster 3</p>\n\nFang Gang fees\n<ul>\n<li>Buyer fee to dev: 0 basis points</li>\n<li>Seller fee to dev: 500 basis points</li>\n<li>Buyer fee to opensea.io: 0 basis points</li>\n<li>Seller fee to opensea.io: 250 basis points</li>\n<li>Buyer fee: 0 basis points</li>\n<li>Seller fee: 750 basis points</li>\n</ul>\nFang Gang editors list\n<p>The approved editor's accounts of Fang Gang collection are 0x5e697c6f5cbebd6ca17bde80d684c226a1e223be.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-03T13:06:41.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: ETH Nears $2,000, Ahead of US Independence Day",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-eth-nears-2000-ahead-of-us-independence-day/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2062151393-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: ETH Nears $2,000, Ahead of US Independence Day\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2062151393-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2062151393-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2062151393-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2062151393-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2062151393-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2062151393-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2062151393.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Ethereum moved closer to $2,000 on Monday, as markets prepared for a short, but busy week of U.S. economic data. This is due to the fourth of July Independence Day celebrations, which will see some markets in the United States closed. Once reopened, the FOMC minutes, and non-farm payrolls report will be some of the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T12:49:48.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? Today&#8217;s live Aave price is $70.30, with a 24-hour trading volume of $126,165,904. Aave is down 2.60% in the last 24 hours. The current CoinMarketCap ranking is #41, with a live market cap of $1,016,217,817 USD. It has a circulating supply of 14,458,390 AAVE coins and a max. supply of ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T12:44:32.000Z",
    "title": "Huobi fixes data breach involving sensitive information for 4,960 users",
    "url": "https://www.cryptopolitan.com/huobi-fixes-data-breach-affecting-1490-users/",
    "description": "Crypto exchange Huobi has fixed its data breach after a massive data leak that allegedly put users&#8217; funds at risk since June 2021. The data leak had information on almost all the over-the-counter (OTC) transaction information from 2017 to 2021, with some of the data being VIP user data and information on the technical infrastructure ... <a title=\"Huobi fixes data breach involving sensitive information for 4,960 users\" class=\"read-more\" href=\"https://www.cryptopolitan.com/huobi-fixes-data-breach-affecting-1490-users/\" aria-label=\"More on Huobi fixes data breach involving sensitive information for 4,960 users\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-03T13:07:06.000Z",
    "title": "Litecoin $100 Milestone Indicates Promising Bullish Trends – Here’s Why",
    "url": "https://www.newsbtc.com/news/litecoin-shows-solid-bullish-trends/",
    "description": "Litecoin (LTC) has been on a remarkable run in the past three days, emerging as one of the most impressive performers among cryptocurrencies this week. But what&#8217;s causing this sudden surge in its price?  The answer lies in the anticipation of a major event that&#8217;s just around the corner: the impending halving of Litecoin, set to take place on August 2. Similar to Bitcoin, Litecoin undergoes halvings after a specific number of blocks are mined, roughly every four years.  As the halving approaches, investors and enthusiasts are left wondering: will Litecoin&#8217;s price continue to soar, or is there more to this story than meets the eye? LTC trading at $112.35. Source: Coingecko Litecoin Price Rally And Resistance Breakthrough LTC has demonstrated a strong performance in recent days, currently trading at $112.35 according to CoinGecko. Over the past 24 hours, LTC experienced a notable rally of 5.1%, and within a seven-day timeframe, it surged by an astonishing 29.0%. Related Reading: Solana Firedancer: 15% Rally Fueled By Ongoing Network Improvements Over the weekend, LTC managed to surpass the crucial $100 mark, and since then, it has sustained trading above this key level of resistance. This resilience indicates bullish tendencies and raises the possibility of a significant breakthrough, with the potential for the $100 resistance to transform into support. Such a development could pave the way for a sustained bull run, potentially propelling the token to reach $130 in the near future. Social Activity Volume And Halving Event Hype The surge in LTC&#8217;s price has coincided with heightened social activity volume, as observed by the blockchain analytics firm Santiment. This suggests a correlation between price spikes and increased interest and engagement surrounding the crypto. LTC market cap nears the $8 billion level. Chart: TradingView.com The anticipation of Litecoin&#8217;s upcoming halving event has generated a surge in demand for the asset, driving its price upward. ⚡ #Litecoin is under 5 weeks away from its #halving, taking place on August 3rd. Prices have suddenly soared for $LTC, blasting off for a +26% in just over a day. Watch for mainstream #FOMO, as this usually foreshadows local tops until crowds calm down. https://t.co/KljBpjVy3C pic.twitter.com/7kDqEpyZjz — Santiment (@santimentfeed) July 1, 2023 Litecoin&#8217;s halving events have historically been associated with significant price movements. In the months leading up to previous halvings, Litecoin experienced notable price surges. These halvings have been pivotal moments for the crypto asset, often triggering a period of increased market activity and bullish sentiment. Related Reading: Why AVAX Price Rumble Stalls Despite Surge In Daily Activity The underlying principle behind the price surge observed before halving events is the anticipation of reduced supply coupled with sustained or growing demand. As the number of new coins entering the market decreases, if demand remains steady or increases, the scarcity of Litecoin can drive up its price. This scarcity narrative has been a driving force behind the previous bull runs experienced by Litecoin, and the upcoming halving event is expected to generate similar dynamics. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Master The Crypto"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T13:00:26.000Z",
    "title": "Bitcoin Bulls Expect Retest of $70k, DigiToads Meme Token Holders Target $1",
    "url": "https://www.crypto-news-flash.com/bitcoin-bulls-expect-retest-of-70k-digitoads-meme-token-holders-target-1/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-bulls-expect-retest-of-70k-digitoads-meme-token-holders-target-1",
    "description": "Market sentiment has ignited in a fierce blaze as TradFi makes its move. TradFi has gone from disparaging crypto as a scam to wanting part of the action. Institutional money has arrived, and the coming cycle promises to blow all prior cycles out of the water. Prominent institutional players race to get a Bitcoin Spot [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T12:50:51.000Z",
    "title": "Bitcoin Price to Reach $310,000 When This Happens: Analyst Unveils Massive Secret",
    "url": "https://www.crypto-news-flash.com/bitcoin-price-to-reach-310000-when-this-happens-analyst-unveils-massive-secret/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-price-to-reach-310000-when-this-happens-analyst-unveils-massive-secret",
    "description": "Crypto analyst predicts that Bitcoin can hit $310k providing eight institutions put 5 percent of their Asset Under Management into it.  Ark Invest&#8217;s Cathie Wood is also bullish on Bitcoin, predicting that the asset can hit $1 million.  Bitcoin (BTC) has currently triggered a bullish market sentiment to trade at $30,655.06 after surging by 1 [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-03T12:59:30.000Z",
    "title": "Chainalysis Spotlights How S.Korean New Act Combats Integrity Concerns",
    "url": "https://coinedition.com/chainalysis-spotlights-how-s-korean-new-act-combats-integrity-concerns/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Data-Shows-Correlation-Between-Crypto-Prices.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Data Shows Correlation Between Crypto Prices\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Data-Shows-Correlation-Between-Crypto-Prices.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Data-Shows-Correlation-Between-Crypto-Prices-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Data-Shows-Correlation-Between-Crypto-Prices-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Data-Shows-Correlation-Between-Crypto-Prices-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Data-Shows-Correlation-Between-Crypto-Prices-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Data-Shows-Correlation-Between-Crypto-Prices-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Leading data analytics firm, Chainalysis, brought attention to the groundbreaking development in South Korea&#8217;s crypto landscape. The data analytics firm took to Twitter to highlight the implication of the Virtual Asset User Protection Act passed by the South Korean National Assembly last week. The act assigns the Financial Services Commission (FSC) the responsibility of supervising [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/chainalysis-spotlights-how-s-korean-new-act-combats-integrity-concerns/\">Chainalysis Spotlights How S.Korean New Act Combats Integrity Concerns</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]