[
  {
    "source": "CoinDesk",
    "date": "2023-07-11T15:49:59.000Z",
    "title": "Why Threads Got 100 Million Users When Other Twitter Rivals Could Not",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/11/why-threads-got-100-million-users-when-other-twitter-rivals-could-not/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Network effects and ease of use rule the day. And, a lot of people clearly don’t care about decentralization and privacy all that much, says CoinDesk’s Emily Parker."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-11T15:44:52.000Z",
    "title": "Near Foundation treasury drops to $900M as token price plunges",
    "url": "https://cointelegraph.com/news/near-foundation-treasury-drops-900m-token-price-plunges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/11fec929-e8ba-45ee-954d-0a2e2492d3ac.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The $200 million decline was mostly due to a drop in the price of Near tokens, in line with the crypto bear market. </p>\n                    <p><p>At the end of Q2 2023, layer-one blockchain Near Protocol's (NEAR) treasury had <a href=\"https://near.org/blog/near-foundation-transparency-report-q2-2023\" target=\"_blank\" rel=\"noopener nofollow\">declined</a> to $900 million, led by a fall in the price of NEAR tokens from $1.99 to $1.38 apiece.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">At the <a href=\"https://twitter.com/hashtag/NEAR?src=hash&amp;ref_src=twsrc%5Etfw\">#NEAR</a> Foundation, transparency is at our core.<br><br>Check out the Foundation&#39;s Q2 &#39;23 Transparency Report below for all the details on treasury, strategy, OKRs, and more! <a href=\"https://t.co/EXZcmhC7sA\">https://t.co/EXZcmhC7sA</a> <a href=\"https://t.co/twxiSffiWM\">pic.twitter.com/twxiSffiWM</a></p>&mdash; NEAR Foundation (@NEARFoundation) <a href=\"https://twitter.com/NEARFoundation/status/1678488245955358727?ref_src=twsrc%5Etfw\">July 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the July 10 report, the Near Treasury currently consists of $349 million in fiat, 315 million NEAR, and $90 million in loans and investments. A net total of $16 million and 1 million NEAR were distributed to the ecosystem in Q2. In comparison, the Near Treasury totaled $1.1 billion in Q1 2023. Developers wrote:</p><blockquote>\"The NEAR Foundation has continued to adopt a highly responsible approach to treasury management in order to minimize the risk of loss in a turbulent market, while continuing capital deployment to fulfill its mission. Exposure to non-NEAR assets therefore has been limited, with fiat reserves held in highly rated Swiss bank accounts.\"</blockquote><p>Near developers also noted that in the face of industry headwinds, such as the U.S. Securities and Exchange Commission's <a href=\"https://cointelegraph.com/news/cex-crypto-trading-hits-2-7t-june-amid-sec-lawsuits-blackrock-etf-filing\">lawsuits against Binance and Coinbase</a>, the Near Foundation has shifted its focus to three core strategies:</p><ol><li> Enhancement of its blockchain operating system</li><li>Continued building of its decentralized ecosystem</li><li>Onboard Web2 users to Web3</li></ol><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/e3127108-2126-4c82-b744-f3b51fcb7b25.png\"  /><figcaption style=\"text-align: center;\">Near Protocol's treasury summary in Q2 2023.</figcaption></figure><p>Throughout Q2, the Near ecosystem saw 1.1 million monthly active accounts. For Q3, the Near team said it would focus on growing partnerships and supporting projects in the Near Horizon ecosystem. Previously in Q4 2021, Near Protocol <a href=\"https://pages.near.org/blog/near-foundation-transparency-report/\" target=\"_blank\" rel=\"noopener nofollow\">established</a> an $800 million ecosystem fund split into decentralized finance grants, foundation grants, startup funds, and funds for regional hubs.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/\">Cryptocurrency trading addiction: What to look out for and how it is treated</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-11T15:49:12.000Z",
    "title": "Minecraft and Zebedee collab enables bitcoin payments for players",
    "url": "https://cryptodaily.co.uk/2023/07/minecraft-and-zebedee-collab-enables-bitcoin-payments-for-players",
    "description": "<p>Satoshis are now being given out as rewards on Satlantis, a unique Bitcoin-themed Minecraft server. This involves the collaboration of Bitcoin payments startup Zebedee and the Minecraft server to fuse the world of cryptocurrency with gaming.</p>\nRewards in bitcoin\n<p>While offering over 1 million satoshis per week to winning players, their earnings may not be extravagant. However, it&rsquo;s a nifty bonus for playing one of the world's most popular video games. Appealing to the most dedicated gamers, this Bitcoin initiative adds a real twist to gameplay.&nbsp;</p>\n<p>Players are inspired by gameplay elements resembling Bitcoin mining rigs and mining pool collectives, with an added excitement of amping up their mining \"hash rate\" to win Bitcoin rewards in the game.&nbsp;</p>\n<p>It may not offer substantial rewards, but this new trend connects the budding world of cryptocurrency with exciting gaming experiences.&nbsp;</p>\n<p>Beyond Minecraft, Zebedee's cutting-edge gaming tech has been implemented in numerous mobile games as well as premier traditional games like Valve&rsquo;s Counter-Strike: Global Offensive. Their technology has also enabled Bitcoin betting and won players Bitcoin rewards throughout 2021.</p>\nMinecraft NFT ban?\n<p>However, the relationship between the gaming world and cryptocurrency has experienced some turbulence. Minecraft's hinted NFT ban has led some servers and derivative initiatives to shift gears or close operations. For instance, NFT Worlds, which used to sell NFT-based land sections for a specific Minecraft server, ended up creating its own autonomous game.</p>\n<p>Despite the prospective cryptocurrency ban, the likes of Satlantis are continuing their Bitcoin initiative. Whether they would continue unfazed in the face of an official ban remains unclear, as Zebedee representatives have not commented on any foreseeable implications.&nbsp;</p>\n<p>The gaming industry and cryptocurrency may be charting unexpected courses according to Minecraft's potential restrictions, but it&rsquo;s clear that the intersection of these two worlds is ever-evolving, creating a fascinating and dynamic landscape.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T16:05:02.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-11T16:00:12.000Z",
    "title": "This Bitcoin Rally Is Similar To Genesis Points Of Historical Uptrends: Glassnode",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-rally-similar-genesis-points-uptrends-glassnode/",
    "description": "Data from Glassnode reveals that the structure of the current Bitcoin rally is looking similar to the genesis points of historical uptrends. Bitcoin Recovery Since November Lows Is Reminiscent Of Past Rallies In its latest weekly report, the on-chain analytics firm Glassnode has looked into how the current Bitcoin rally lines up against similar rallies that the cryptocurrency observed during the previous cycles. To make this comparison, the analytics firm has taken the data for the performance of the coin starting from the all-time high in each cycle. Here is a chart that shows how the past bear market rallies have looked like in terms of this metric: The bear market rally performance throughout the different cycles &#124; Source: Glassnode's The Week Onchain - Week 28, 2023 Note that only the upwards performance of Bitcoin is being considered here, and the drawdown has been excluded. From the chart, it&#8217;s visible that during all the cycles, gains after the ATH was set disappeared in time as the bear market went into full gear. Soon after the bear bottom formation took place, these cycles saw the asset experiencing a recovery rally. In the current cycle so far, it&#8217;s not completely certain yet if the November 2022 low seen after the FTX crash was indeed the cyclical bottom. However, if it&#8217;s assumed that this low was indeed the bottom, then the rally that has been going on in the past few months would take the role of the recovery rally in the current cycle. Related Reading: Bitcoin NVT Golden Cross Says BTC Is Overpriced, Decline Soon? Interestingly, so far, the cryptocurrency has seen an uplift of 91% since the aforementioned bottom, which is very similar in scale to the recovery rallies of the past cycles. &#8220;With the exception of 2019, all prior cycles which experienced a similar magnitude move off the bottom, were in fact the genesis point of a new cyclical uptrend,&#8221; explains Glassnode. The reason 2019 was different is that the April 2019 rally (which may have normally acted as the recovery rally from the bear market bottom) ran out of steam before long and the price subsequently declined. The drawdown was then extended in March 2020 as the crash due to the emergence of COVID-19 took place. It&#8217;s the recovery rally from this crash that ended up leading to the 2021 bull market. Naturally, if the pattern of the first two Bitcoin cycles is anything to go by, the current recovery rally structure may mean that the asset is now on its way toward a cyclical uptrend. Related Reading: XRP FUD Spikes, Will This Trigger A Price Reversal? The analytics firm has also looked at the rally from another angle: this time in terms of the drawdown (that is, the negative performance). The drawdowns across the bull markets &#124; Source: Glassnode's The Week Onchain - Week 28, 2023 As displayed in the graph, the Bitcoin rally has seen a peak drawdown of just 18% so far, which is clearly much less than what the previous bull markets saw. &#8220;This perhaps suggests a relatively strong degree of demand underlies the asset,&#8221; suggests Glassnode. BTC Price At the time of writing, Bitcoin is trading around $30,400, down 2% in the last week. BTC has continued its sideways movement recently &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-11T16:03:22.000Z",
    "title": "Shiba Inu to Grow Massively after Shibarium Launch as More Projects Await in the Pipeline – Can It Drive SHIB Price to $0.0001? Report",
    "url": "https://www.crypto-news-flash.com/shiba-inu-to-grow-massively-after-shibarium-launch-as-more-projects-await-in-the-pipeline-can-it-drive-shib-price-to-0-0001-report/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-to-grow-massively-after-shibarium-launch-as-more-projects-await-in-the-pipeline-can-it-drive-shib-price-to-0-0001-report",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920-48x27.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Shiba Inu and Shibarium are helping to drive optimism in the memecoin world. With the Shibarium mainnet in view, hopes for a surge to $0.0001 for SHIB are renewed. Shiba Inu (SHIB), the popular decentralized community project, has been making waves in the crypto space in recent times. With the recent Testnet launch of Shibarium, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-11T16:02:00.000Z",
    "title": "Arkham Intel Mocked: Called ‘Dox to Earn,’ Accused of Leaking Email Ids",
    "url": "https://coinedition.com/arkham-intel-mocked-called-dox-to-earn-accused-of-leaking-email-ids/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Arkham Intel Mocked\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Arkham-Intel-Mocked-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Arkham’s Intel Exchange has faced an onslaught of criticism with many scornfully calling it the “dox to earn” and “snitch to earn” marketplace. Blockchain intelligence platform Akham Intelligence revealed plans to launch what it calls the world’s first on chain “intelligence exchange” earlier yesterday and since then has been the talk of the crypto town. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/arkham-intel-mocked-called-dox-to-earn-accused-of-leaking-email-ids/\">Arkham Intel Mocked: Called ‘Dox to Earn,’ Accused of Leaking Email Ids</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]