[
  {
    "source": "CoinDesk",
    "date": "2024-03-12T14:31:59.000Z",
    "title": "Rapper Drake Posts Michael Saylor's Bitcoin Video To His 146M Instagram Followers",
    "url": "https://www.coindesk.com/business/2024/03/12/rapper-drake-posts-michael-saylors-bitcoin-video-to-his-146m-instagram-followers/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Michael Saylor said that bitcoin will “eat gold” in an interview with CNBC on Monday."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-12T14:26:23.000Z",
    "title": "U.S. CFTC's Behnam Says Agency Writing New Policy on Prediction Markets",
    "url": "https://www.coindesk.com/policy/2024/03/12/us-cftcs-behnam-says-agency-writing-new-policy-on-prediction-markets/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "U.S. Commodity Futures Trading Commission Chair Rostin Behnam said his agency will propose a rule in the coming months to establish new regulations for prediction markets."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-12T14:13:20.000Z",
    "title": "Sweden’s Central Bank Chief Wants 'as Little Bitcoin as Possible' in Country's Financial System: Bloomberg",
    "url": "https://www.coindesk.com/policy/2024/03/12/swedens-central-bank-chief-wants-as-little-bitcoin-as-possible-in-countrys-financial-system-bloomberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Sweden's central bank governor said he wants \"as little bitcoin as possible in the Swedish financial system.\""
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-12T14:26:12.000Z",
    "title": "Crypto Picks of the Week: ScapesMania, Optimism, and SUI",
    "url": "https://cryptodaily.co.uk/2024/03/crypto-picks-of-the-week-scapesmania-optimism-and-sui",
    "description": "Unleash the potential of your crypto portfolio with our top picks of the week! Dive into the surging world of Optimism (OP) and Sui (SUI), set to ride the current bullish wave in the crypto market. Don't miss out on these hot altcoins as they're primed to soar alongside Bitcoin's remarkable surge past $72,000!"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-12T14:28:29.000Z",
    "title": "Zeus Network Reveals Angel Investor Lineup: Featuring Solana Co-Founder Anatoly Yakovenko, Mechanism Capital Co-Founder Andrew Kang, and Stacks Co-Creator Muneeb Ali",
    "url": "https://cryptodaily.co.uk/2024/03/zeus-network-reveals-angel-investor-lineup-featuring-solana-co-founder-anatoly-yakovenko-mechanism-capital-co-founder-andrew-kang-and-stacks-co-creator-muneeb-ali",
    "description": "First dApp APOLLO: Pioneering Native BTC Staking"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-12T14:26:26.000Z",
    "title": "MetaMask and Mastercard Unite to Launch  On-Chain Payment Card.",
    "url": "https://www.cryptopolitan.com/metamask-mastercard-chain-payment-card/",
    "description": "MetaMask, a leading cryptocurrency wallet, is pioneering the integration of blockchain technology into everyday financial transactions through its collaboration with Mastercard. The partnership marks a significant milestone in the fusion of traditional finance and the burgeoning world of cryptocurrencies. The initiative involves the testing of a groundbreaking payment card, entirely based on blockchain technology, and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-12T14:26:10.000Z",
    "title": "From Months to Weeks: How AI is Speeding Up the Future of Proteins",
    "url": "https://www.cryptopolitan.com/how-ai-is-speeding-up-the-future-of-proteins/",
    "description": "California-based synthetic biology company Tierra Biosciences is shaking up the protein development landscape with its innovative AI-guided platform.&#160; Using AI technology, the company created a new platform that promises to significantly accelerate the creation of custom proteins, potentially impacting various sectors like pharmaceuticals, agriculture, and industrial applications. AI Quickens Custom Protein Production Traditionally, developing new [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-12T14:23:02.000Z",
    "title": "Insights from Ripple CTO: XRP’s volatility and AMMs in cryptocurrency investment",
    "url": "https://www.cryptopolitan.com/xrps-volatility-and-amms-in-cryptocurrency/",
    "description": "In a recent statement, Ripple’s Chief Technology Officer, David Schwartz, addressed queries regarding the XRP token’s appreciation potential and its role in passive income generation. The discourse comes at a time when the crypto community actively discusses the XRP Ledger&#8217;s automated market maker (AMM) and its implications. XRP&#8217;s volatility and long-term appreciation Schwartz highlighted XRP [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-12T14:13:24.000Z",
    "title": "Shaping the Future of Finance: Hong Kong’s Regulatory Framework for Stablecoin Issuers",
    "url": "https://www.cryptopolitan.com/finance-hong-kong-regulatory-stablecoin/",
    "description": "In an era where the digital economy and traditional financial systems are becoming increasingly intertwined, the Hong Kong Monetary Authority (HKMA) is taking proactive steps to establish a regulatory framework for stablecoin issuers within the region.&#160; Recognizing the potential risks and opportunities presented by the burgeoning virtual asset market, the HKMA&#8217;s initiative aims to ensure [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-12T14:37:55.000Z",
    "title": "Binance founder Changpeng Zhao ordered to surrender Canadian passport",
    "url": "https://crypto.news/changpeng-zhao-canada-passport-binance/",
    "description": "A U.S. district court has changed the bail conditions for Binance cryptocurrency exchange founder Changpeng Zhao and ordered him to surrender his Canadian passport."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-12T14:21:54.000Z",
    "title": "Hong Kong’s central bank launches stablecoin regulatory sandbox",
    "url": "https://crypto.news/stablecoin-hong-kong-regulatory/",
    "description": "Hong Kong has initiated a sandbox arrangement for stablecoin issuers to establish regulations for future operations."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-12T14:30:40.000Z",
    "title": "Next Big Thing In Crypto: Analyst Spotlights Top 2 Altcoins For Web 3.0",
    "url": "https://www.newsbtc.com/news/crypto-top-2-altcoins-for-web-3-0/",
    "description": "Crypto analyst Michaël van de Poppe recently cast a spotlight on two altcoins poised to significantly impact the Web 3.0 ecosystem. In a detailed exposition shared on X (formerly Twitter), Van de Poppe introduced &#8220;modular blockchains&#8221; and &#8220;DePin&#8221; as emerging concepts set to redefine the crypto landscape. Emphasizing the need for tangible use cases, Van de Poppe stated, &#8220;I&#8217;m advocating for investing into projects that fulfill actual use cases. Hence why I&#8217;m not that much focused on projects within the Gaming, Metaverse, NFT or Meme space, [&#8230;] I&#8217;d rather want to focus on projects that have an actual use case within the financial Web 3.0 ecosystem.” Crypto + Web 3.0: Modular Blockchains The conversation around scalability and efficiency in blockchain has led to the emergence of modular blockchains, according to Van de Poppe. He described modular blockchains as &#8220;a solution from the previous cycle,&#8221; aiming to address the high transaction fees and scalability challenges that have hampered platforms like Ethereum. &#8220;Remember the high gas fees we were paying during the bull run on Ethereum? Yes, that&#8217;s where Layer 2&#8217;s and modular blockchains started to come from as a potential solution for this problem,&#8221; Van de Poppe explained. By splitting traditional processes handled by a single layer, modular blockchains promise a substantial improvement in transactions per second, addressing the core scalability trilemma of decentralization, scalability, and security without compromising on any. Spotlight On TIA And CQT Among the projects leading the charge in this new era, Celestia (TIA) and Covalent (CQT) emerged as favorites of Van de Poppe. Related Reading: Crypto Analyst Unveils 7 Memecoins To Turn $1,000 Into $1 Million TIA, according to Van de Poppe, stands out as a frontrunner in the modular blockchain space. &#8220;One of my favorites is TIA, which enhances the potential of modular blockchains,&#8221; Van de Poppe states, underscoring the project&#8217;s ambition to redefine scalability and efficiency in blockchain technology. Covalent, in particular, is praised for its comprehensive toolkits for developers, which include Block Explorer Kits named GoldRush and analytics dashboards like Increment. &#8220;Covalent aims to build on the DePIN ecosystem, which means decentralized physical infrastructure networks, essentially laying the foundational layer of the entire financial Web 3.0 Ecosystem,&#8221; Van de Poppe remarked. Delving deeper into Covalent&#8217;s contributions, Van de Poppe highlighted the project&#8217;s ambition to secure a structured dataset from over 215 blockchains and integrate AI through the analysis of 100 billion transactions. This integration is aimed at fostering AI consumption, training, and product development. Related Reading: Crypto Analyst Identifies 8 Altcoins To Turn $1,000 Into $1 Million &#8220;Promoting decentralized indexing, Covalent enhances network resilience and reduces reliance on central entities,&#8221; he noted, underscoring the project&#8217;s commitment to decentralization. Furthermore, the activation of a Revenue Fee Switch connected to the Premium API since February signifies Covalent&#8217;s economic model&#8217;s maturity and its efforts to achieve complete Ethereum Virtual Machine (EVM) state data retrievability. Price Analyses The CQT price rose above the 20- and 100-week EMA in mid-February, generating bullish momentum. The price is now targeting the 0.236 Fibonacci retracement level at $0.53 on the 1-week chart. However, it is worth noting that the price is still around 80% away from its all-time high despite the bullish sentiment in the crypto market. For Celestia (TIA), the situation looks quite different. The price is only 20% below its all-time high and is trading above the 0.236 Fibonacci retracement level on the 1-day chart. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-12T14:13:45.000Z",
    "title": "XRP’s Role in Financial Transformation: Ripple Unlocks Liquidity in Tokenized Economy",
    "url": "https://www.crypto-news-flash.com/xrps-role-in-financial-transformation-ripple-unlocks-liquidity-in-tokenized-economy/?utm_source=rss&utm_medium=rss&utm_campaign=xrps-role-in-financial-transformation-ripple-unlocks-liquidity-in-tokenized-economy",
    "description": "<img width=\"1200\" height=\"628\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Ripple.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Ripple-300x157.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Ripple-768x402.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Ripple-150x79.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Ripple-450x236.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Ripple delves into the complexities surrounding liquidity in the evolving tokenized economy, highlighting its dual role as both a challenge and an opportunity for businesses. Ripple emphasizes the potential of tokenization to enhance liquidity and foster market growth amidst the rapid evolution of digital assets. Blockchain startup Ripple delves into the complexities surrounding liquidity in [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-12T14:23:41.000Z",
    "title": "VanEck’s Zero-Fee Bitcoin ETF Sparks 20X Inflow Surge",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/vanecks-zero-fee-bitcoin-etf-sparks-20x-inflow-surge/",
    "description": "<p>Effective immediately, this bold move has sparked a 20x surge in the fund&#8217;s inflows. The decision to waive the fee on the Bitcoin ETF comes at a pivotal moment for the cryptocurrency market. VanEck&#8217;s Fee Elimination: A Catalyst for Unprecedented Inflows Despite volatility, Bitcoin attracts investors for its high return potential and status as digital [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/vanecks-zero-fee-bitcoin-etf-sparks-20x-inflow-surge/\">VanEck&#8217;s Zero-Fee Bitcoin ETF Sparks 20X Inflow Surge</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-12T14:30:18.000Z",
    "title": "Ethereum Layer-2 Skyrockets After Earning Surprise Support From Crypto Exchange Binance",
    "url": "https://dailyhodl.com/2024/03/12/ethereum-layer-2-skyrockets-after-earning-surprise-support-from-crypto-exchange-binance/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/skyrockets-After-Earning-Surprise.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/skyrockets-After-Earning-Surprise.jpg 1748w, https://dailyhodl.com/wp-content/uploads/2024/03/skyrockets-After-Earning-Surprise.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/skyrockets-After-Earning-Surprise.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/skyrockets-After-Earning-Surprise.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/skyrockets-After-Earning-Surprise.jpg?resize=1536,900 1536w, https://dailyhodl.com/wp-content/uploads/2024/03/skyrockets-After-Earning-Surprise.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/03/skyrockets-After-Earning-Surprise.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>One Ethereum (ETH) layer-2 altcoin project is soaring after a sudden listing by Binance, the world’s largest crypto trading platform by volume. As Binance announced on Monday spot trading support for ETH scaling solution Metis (METIS), the token rallied by double digits. Says Binance, “Binance will list Metis (METIS) and open trading for these spot [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/12/ethereum-layer-2-skyrockets-after-earning-surprise-support-from-crypto-exchange-binance/\">Ethereum Layer-2 Skyrockets After Earning Surprise Support From Crypto Exchange Binance</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2024-03-12T14:27:22.000Z",
    "title": "The Fortunes of Monero",
    "url": "https://blog.bitfinex.com/education/the-fortunes-of-monero/",
    "description": "<p>While the crypto community&#8217;s gaze was fixed on Bitcoin reaching a new all time high in price this week, a significant yet underreported development unfolded with privacy coin, Monero. It saw a delisting from Binance last month, which resulted in a sharp drop in its...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/education/the-fortunes-of-monero/\">The Fortunes of Monero</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]