[
  {
    "source": "Cointelegraph",
    "date": "2023-06-29T22:52:43.000Z",
    "title": "Crypto offers Africans a ‘lifeline’ from inflation and corruption, say execs",
    "url": "https://cointelegraph.com/news/crypto-offers-africa-lifeline-inflation-corruption",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/92db8506-aa7a-4b9c-9abe-959f0d017140.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Chris Maurice, founder and CEO of crypto exchange Yellow Card said in Africa, crypto isn't the \"casino\" that it can sometimes feel like in the West.</p>\n                    <p><p>While many investors in the West may look to crypto to speculate the next biggest trend, blockchain technology is actually solving “real-world problems” in Africa such as hyperinflation and \"corruption,\" executives told Cointelegraph.</p><p>Speaking to Cointelegraph, Chris Maurice, founder and CEO of Yellow Card — Africa’s largest cryptocurrency exchange — said crypto in Africa “is growing at the speed of light” because it allows many Africans to escape from the<a href=\"https://cointelegraph.com/news/we-don-t-like-our-money-the-story-of-the-cfa-and-bitcoin-in-africa\"> traditional financial system’s failures</a> and transact more freely.</p><blockquote>“Crypto solves real-world problems with banking and currencies on the continent, and it isn't the casino that it can feel like sometimes in the West.”</blockquote><p>Maurice said the most common use cases in Africa are to make international payments, to send money to friends and family and to “save money against inflation.”</p><p>“Crypto in Africa lives closer than any other part of the world to the original mission of the technology,” he added.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Africa has more crypto users than North America or Europe.<br><br>6 of the top 20 countries in the world for crypto are in Africa.<br><br>Africa is the crypto continent. <a href=\"https://t.co/NzodcOkMYn\">https://t.co/NzodcOkMYn</a></p>&mdash; Chris Maurice⚜️ (@chrismaurice) <a href=\"https://twitter.com/chrismaurice/status/1650503764724293635?ref_src=twsrc%5Etfw\">April 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Kevin Imani, the founder and CEO of Sankore 2.0 — an affiliate of layer-1 Near Protocol — believes blockchain-based payments can act as a human rights technology:</p><blockquote>“It’s important to recognize the human rights protections that it provides to people in underdeveloped nations. In many developing countries, hyperinflationary pressure and corruption have left citizens with few options.”</blockquote><p>“Cryptocurrencies offer a lifeline to these individuals, providing greater financial inclusion and control over their money,” he added.</p><p>According to Statistica, inflation rates in Sub-Saharan Africa reached an estimated 14.5% in 2022 — which marks the region’s largest annual change since the 2008 recession.</p><p>Imani said the “ability to counter weak national currencies and corruption” and increase financial inclusion makes peer-to-peer crypto transactions a no-brainer for many Africans.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">From Lagos to Nairobi, Accra to Cape Town, Africa is emerging as a powerhouse of tech innovation.<br><br>Watch this space! <a href=\"https://twitter.com/hashtag/BlockchaininAfrica?src=hash&amp;ref_src=twsrc%5Etfw\">#BlockchaininAfrica</a> <a href=\"https://t.co/LYGZCQ0u9Z\">pic.twitter.com/LYGZCQ0u9Z</a></p>&mdash; NEAR Kenya | NEAR is Now (@NearKenya) <a href=\"https://twitter.com/NearKenya/status/1670710510193635329?ref_src=twsrc%5Etfw\">June 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“I personally see Crypto as Africa's next shot at life, another opportunity to be part of something great, as opposed to the internet revolution of the 2000s, when most Africans weren't as exposed as today,” added Okoye Kevin Chibuoyim, the founder and CEO of crypto education platform GIDA, based in Nigeria.</p><p>“Africans are used to bad governments that aren't accountable and transparent, but here, the blockchain flashes its transparent nature here and makes everyone trust the system,” he said.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/africa-the-next-hub-for-bitcoin-crypto-adoption-and-venture-capital\"><strong><em>Africa: The next hub for Bitcoin, crypto adoption and venture capital?</em></strong></a></p><p>In April, Block — a U.S. digital payments firm led by Jack Dorsey — <a href=\"https://www.youtube.com/watch?v=JvkFtCJRDHY\" target=\"_blank\" rel=\"noopener nofollow\">partnered</a> with Yellow Card to facilitate cross-border payments in Africa based on Block’s infrastructure. </p><p>After the number of cryptocurrency users <a href=\"https://cointelegraph.com/news/crypto-users-in-africa-grew-by-2-500-in-2021-report\">increased by 2,500% in 2021,</a> the region experienced an 11-fold explosion in <a href=\"https://cointelegraph.com/news/venture-funding-for-african-crypto-startups-grew-11x-in-2022-report\">venture capital funding</a> in 2022.</p><p>Maurice said Nigerians have adopted cryptocurrency “like no one else” in the region — with one local publication <a href=\"https://businesspost.ng/economy/47-of-nigerians-use-crypto-survey/\" target=\"_blank\" rel=\"noopener nofollow\">reporting</a> in May that 47% of Nigerians own or transact with crypto on a daily basis.</p><p>While Maurice said Botswana has the “most legal and regulatory clarity,” cryptocurrency is now reportedly illegal in Cameroon, Central African Republic, Gabon, Guyana, Lesotho, Libya and Zimbabwe, <a href=\"https://www.investopedia.com/articles/forex/041515/countries-where-bitcoin-legal-illegal.asp\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Investopedia. </p><p><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/bitcoin-senegal-why-how-african-country-using-btc/\"><strong><em>Bitcoin in Senegal: Why is this African country using BTC?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-29T22:58:31.000Z",
    "title": "Vodafone confirms rumors of Cardano NFT plans",
    "url": "https://cryptoslate.com/vodafone-announces-cardano-nft-plans-following-earlier-rumors/",
    "description": "<p>Vodafone Germany, a major telecom company, announced plans to launch a series of Cardano-based non-fungible tokens on June 28. Vodafone plans to release NFTs On the company&#8217;s Discord channel, a representative stated: &#8220;Yes, we are planning to release an NFT collection this year and want to utilise the Cardano chain for this.&#8221; The representative said [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/vodafone-announces-cardano-nft-plans-following-earlier-rumors/\">Vodafone confirms rumors of Cardano NFT plans</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  }
]