[
  {
    "source": "Cointelegraph",
    "date": "2023-07-22T20:49:20.000Z",
    "title": "Solana's Parrot Protocol submits proposal to go tokenless, investors risk face -89% returns",
    "url": "https://cointelegraph.com/news/parrot-protocol-submits-proposal-to-go-tokenless",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/d7b06cdf-8ffc-4d1a-b65c-1acafa785fc4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The proposal calls for the redemption of PRT tokens for liquid treasury value, and the transition to a no-token protocol. Community members referred to the move as a \"financial crime\". </p>\n                    <p><p>A recent proposal from Parrot Protocol's team, a Solana-based liquidity network, has sparked controversy among its community members. The <a href=\"https://app.realms.today/dao/8YDTzT86Tv3JF7SvHwF3EEu4bsiPf8LTUz6ukqVHuoKR/proposal/FWTCFkn8sSccSUL3UXKfGUfcR91hqNbNh8vsU92LATJm\" target=\"_blank\" rel=\"noopener nofollow\">proposal</a>, up for vote until July 27, calls for the redemption of its PRT tokens for liquid treasury value, and the transition to a no-token protocol.</p><p>Based on the proposal, the PRT redemption price was established at $0.0045 per token. <a href=\"https://cryptorank.io/ico/parrot-protocol\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to data from CryptoRank, the protocol raised over $89 million since its inception in 2021, with a current return on investment (ROI) of -89% for investors in its Initial DEX Offering (IDO) and initial exchange offering (IEO). Having a negative ROI indicates that investors have lost money on their investment.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today in governance was a mistake news: <a href=\"https://twitter.com/gopartyparrot?ref_src=twsrc%5Etfw\">@gopartyparrot</a> team takes their $72m remaining in ICO funds and attempts to split it $12m to the token holders, $60m to the team.<br><br>Oh they also early unlocked their tokens and will be voting it through regardless of what anybody else says <a href=\"https://t.co/vmhDXJochQ\">pic.twitter.com/vmhDXJochQ</a></p>&mdash; Spreek (@spreekaway) <a href=\"https://twitter.com/spreekaway/status/1682390046824091648?ref_src=twsrc%5Etfw\">July 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The protocol's plan does not explain the reasons behind the move, only mentioning that \"many PRT holders would like to redeem their PRT tokens for their treasury value.\" The proposal also follows changes in Parrot's tokenomics from November 2022, when the protocol<a href=\"https://gopartyparrot.medium.com/prt-vesting-tokens-accelerated-unlock-7f41ef3e439e\" target=\"_blank\" rel=\"noopener nofollow\"> shortened</a> its token locking period from 12 months to 7 days, claiming it would \"create more flexibility for stakeholders to enter or exit their positions.\" </p><p>Comments from community members indicate that 81% of tokens are controlled by the team. However, Parrot's team has refuted these claims by <a href=\"https://twitter.com/gopartyparrot/status/1682579035631816705\" target=\"_blank\" rel=\"noopener nofollow\">stating</a> on Twitter that treasury tokens are never touched or used for governance purposes. A breakdown provided by CryptoRank indicates that 35% of tokens were distributed as Protocol Incentives, 20% as Team &amp; Angels, 10% as public sales, 20% as Seed rounds, and 15% as Others.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/91db382f-e7a3-4558-99c2-65102a821c29.png\"  /><figcaption style=\"text-align: center;\"><em>Parrot Protocol Token Sale. Source: CryptoRank.</em></figcaption></figure><p>Additionally, the proposal does not clarify what would be the fate of unclaimed funds after the 8-week redemption period, with community members suggesting the funds could be cashed out by insiders.</p><p>\"The community has already explained in painstaking detail why we're not interested in this. The pro-rata value is an extreme lowball and fails to account for many of the team's misuses of the treasury without the community's consent. The team also prematurely unlocked the team and VCs' vesting tokens, so they are the majority token holders, making this vote meaningless and a total farce,\" wrote one community member on the proposal discussion.</p><p><a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\"><strong><em>Magazine: Tornado Cash 2.0 — The race to build safe and legal coin mixers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-22T21:07:05.000Z",
    "title": "Crypto experts say the new bill will not affect the DeFi sector",
    "url": "https://www.cryptopolitan.com/crypto-experts-say-bill-will-not-affect-defi/",
    "description": "U.S. lawmakers recently introduced a highly anticipated digital assets bill, aiming to address the crypto industry’s grievances about an allegedly hostile regulatory environment. However, some experts argue that the bill’s ambiguous language, particularly a provision that could impact the DeFi (Decentralized Finance) market, may not effectively curb the SEC’s regulatory approach to cryptocurrencies. Crypto experts ... <a title=\"Crypto experts say the new bill will not affect the DeFi sector\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-experts-say-bill-will-not-affect-defi/\" aria-label=\"More on Crypto experts say the new bill will not affect the DeFi sector\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-22T21:01:34.000Z",
    "title": "ECB explains why it asked banks for weekly liquidity stats",
    "url": "https://www.cryptopolitan.com/ecb-asked-banks-for-weekly-liquidity-stats/",
    "description": "In an ongoing effort to fortify the financial landscape and reinforce banking resilience in Europe, the European Central Bank (ECB) has outlined a strategic move to heighten its monitoring of banks&#8217; liquidity. Beginning in September, banks will need to supply their liquidity data on a weekly basis, rather than monthly as currently mandated. The aim ... <a title=\"ECB explains why it asked banks for weekly liquidity stats\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ecb-asked-banks-for-weekly-liquidity-stats/\" aria-label=\"More on ECB explains why it asked banks for weekly liquidity stats\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-22T20:54:26.000Z",
    "title": "Tech CEOs urge US to rethink China restrictions",
    "url": "https://www.cryptopolitan.com/tech-ceos-us-to-rethink-china-restrictions/",
    "description": "In a bid to potentially reshape the United States&#8217; stance on export restrictions to China, top tech executives recently aired their concerns to key Biden administration officials. Executives from Intel, Nvidia, and Qualcomm highlighted the potential risks to America&#8217;s leadership position in the chip industry and encouraged the administration to reconsider the ramifications of these ... <a title=\"Tech CEOs urge US to rethink China restrictions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tech-ceos-us-to-rethink-china-restrictions/\" aria-label=\"More on Tech CEOs urge US to rethink China restrictions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-22T20:49:33.000Z",
    "title": "Custodia CEO allays controversy surrounding FedNow launch",
    "url": "https://www.cryptopolitan.com/custodia-ceo-allay-controversy-fednow-launch/",
    "description": "On the same day the Federal Reserve announced the launch of its FedNow instant payment service, an intriguing revelation caught the attention of Caitlin Long, CEO of Custodia Bank. FedNow allows real-time, always-on money transfers within its interbank system, but Long noticed an unusual aspect among the list of early adopters. Adyen, an Amsterdam-based company, ... <a title=\"Custodia CEO allays controversy surrounding FedNow launch\" class=\"read-more\" href=\"https://www.cryptopolitan.com/custodia-ceo-allay-controversy-fednow-launch/\" aria-label=\"More on Custodia CEO allays controversy surrounding FedNow launch\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-22T20:44:59.000Z",
    "title": "Making sense of Bitcoin reward halving",
    "url": "https://www.cryptopolitan.com/making-sense-of-bitcoin-reward-halving/",
    "description": "The Bitcoin community is pulsing with anticipation. In less than 280 days, the Bitcoin blockchain will go through its fourth reward halving event, an occasion where the reward for mining new blocks, called the block subsidy, drops from 6.25 to 3.125 BTC. This event, along with the string of reductions slated to unfold over the ... <a title=\"Making sense of Bitcoin reward halving\" class=\"read-more\" href=\"https://www.cryptopolitan.com/making-sense-of-bitcoin-reward-halving/\" aria-label=\"More on Making sense of Bitcoin reward halving\">Read more</a>"
  }
]