[
  {
    "source": "Decrypt",
    "date": "2023-11-02T01:42:24.000Z",
    "title": "Celebs Like Scarlett Johansson Declare War on AI Deep Fakes—Are They Doomed?",
    "url": "https://decrypt.co/204069/scarlett-johansson-celebrity-deepfakes-laws-lawsuits-international",
    "description": "A lack of international and cross-platform consensus on AI laws could make it tough to stamp out the swarm of AI-generated doppelgangers."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-02T02:00:45.000Z",
    "title": "SafeMoon Executives Face DOJ Arrests And SEC Charges – SFM Plummets More Than 50%",
    "url": "https://www.newsbtc.com/news/safemoon-executives-face-doj-arrests-and-sec-charges-sfm-plummets-more-than-50/",
    "description": "The US Securities and Exchange Commission (SEC) recently announced charges against SafeMoon, its creator Kyle Nagy, the company’s CEO, John Karony, and CTO, Thomas Smith.  The SEC alleges that these individuals orchestrated a &#8220;massive fraudulent scheme&#8221; involving the unregistered sale of SafeMoon (SFM), a &#8220;crypto asset security&#8221; as defined by the SEC.  Per the complaint, instead of delivering the promised profits and taking the token &#8220;Safely to the Moon,&#8221; the defendants allegedly wiped out billions in market capitalization, misappropriated investor funds, and withdrew over $200 million in crypto assets for personal use. On this matter, David Hirsch, Chief of the SEC Enforcement Division&#8217;s Crypto Assets and Cyber Unit, emphasized the need for caution in the decentralized finance (DeFi). SEC Charges SafeMoon And Executives  According to the complaint, Kyle Nagy assured investors that funds in SafeMoon’s liquidity pool were safely locked and inaccessible to anyone, including the defendants.  However, according to the SEC’s investigations, large portions of the liquidity pool were never locked, and the defendants allegedly misappropriated millions of dollars, indulging in extravagant purchases such as McLaren cars, luxury homes, and lavish travel. Related Reading: XRP Ledger Market Cap Soars On Regulatory Success: 59% YTD Growth Achieved The SEC&#8217;s complaint reveals that SFM’s price skyrocketed by over 55,000 percent before plummeting nearly 50 percent when the public discovered that the liquidity pool was not locked as claimed.  Notably, Karony and Smith allegedly used misappropriated assets to manipulate the market and prop up SafeMoon’s price through wash trading. The SEC&#8217;s complaint, filed in the US District Court for the Eastern District of New York, charges the defendants with violating registration and anti-fraud provisions of the Securities Act of 1933 and the Securities Exchange Act of 1934.  Indictment Unsealed Against Executives For Securities Fraud An indictment was also unsealed in federal court in Brooklyn, charging Braden John Karony, Kyle Nagy, and Thomas Smith with conspiracy to commit securities fraud, wire fraud, and money laundering conspiracy. Breon Peace, United States Attorney for the Eastern District of New York, announced the arrests and charges. United States Attorney Peace emphasized the commitment to pursuing fraudsters in the digital asset space, stating that their “ill-gotten gains” would not protect them from justice.  Ivan J. Arvelo, Special Agent-in-Charge of Homeland Security Investigations, New York, highlighted the “relentless pursuit” of individuals exploiting investors and the financial system for personal gain.  Related Reading: Bull Season: Analyst Outlines Breakout That Could Send Solana To $100 It is noteworthy that the charges in the indictment are allegations, and the defendants are presumed innocent until proven guilty. SFM Token Crashes To Lowest Trading Price Since Launch Following the recent disclosure of the news, SFM has experienced a significant crash, plummeting by over 52%. Currently, the token is trading at $0.00009142, marking its lowest trading price since its launch in 2022. This substantial decline of over 72% within the past year underscores the severity of the case. Furthermore, when examining other time frames, the token has seen declines of 49%, 34%, and 24% over the past seven, fourteen, and thirty days, respectively. These figures highlight the ongoing downward trend and emphasize the magnitude of the situation. Featured image from Shutterstock, chart from TradingView.com"
  }
]