[
  {
    "source": "Decrypt",
    "date": "2023-12-12T00:02:04.000Z",
    "title": "Google Cloud to Run Validator on Crypto Gaming Network XPLA",
    "url": "https://decrypt.co/209336/google-cloud-run-validator-crypto-gaming-network-xpla",
    "description": "Google Cloud will be the first “volunteer validator” on the XPLA gaming chain, adding to Google's growing list of crypto allies."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-11T23:45:23.000Z",
    "title": "Tether looks to seize millions in USDT as it freezes 161 wallets",
    "url": "https://cryptobriefing.com/tether-looks-to-seize-millions-in-usdt-as-it-freezes-161-wallets/?utm_source=feed&utm_medium=rss",
    "description": "Tether implements new policy to freeze crypto wallets linked to sanctioned individuals and entities, enhancing compliance with OFAC."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-12T00:00:37.000Z",
    "title": "Crypto Sentiment Index Stays Bullish Despite Corrections, Report Reveals Positive Outlook",
    "url": "https://www.newsbtc.com/news/crypto-sentiment-index-stays-bullish-despite-corrections-report-reveals-positive-outlook/",
    "description": "In a recent blog post, ETC Group&#8217;s Head of Research, Andre Dragosh, provided a comprehensive analysis of the current state of the crypto market. Dragosh’s findings shed light on the market&#8217;s performance dynamics, profit-taking activity, and derivative trends. High-Risk Appetite In Crypto Market According to Dragosh’s analysis, crypto assets showcased their resilience as they outperformed traditional assets like equities, supported by a significant repricing in monetary policy expectations and short futures liquidations at the beginning of last week.  However, this outperformance encountered some limitations in the short term due to stronger-than-expected US jobs data, which began to dampen the recent rally. The US non-farm payroll growth and unemployment rate surpassed consensus estimates, leading to a reversal in US Treasury yields and a decrease in overall risk appetite across traditional financial markets. Related Reading: Bitcoin $42,000 Support Under Pressure As Short Position Inflows Soar Notably, altcoin outperformance gained momentum during the period, with Avalanche (AVAX) and Cardano (ADA) returning over 50% each. Among the top 10 crypto assets, Avalanche, Cardano, and Polkadot (DOT) stood out as the relative outperformers.  According to Dragosh, this surge in altcoin outperformance compared to Bitcoin (BTC) indicates a “high-risk appetite” within the crypto market. On the other hand, on-chain data for Bitcoin suggests that investors are increasingly taking profits, evidenced by the rising number of coins in profit being sent to exchanges. ETC Group&#8217;s in-house Crypto Asset Sentiment Index remained relatively elevated compared to the previous week, indicating positive market sentiment. However, major reversals to the downside were observed in the Crypto Dispersion Index and the BTC 25-delta 1-month option skew.  The Crypto Fear &#38; Greed Index continued to reside in &#8220;Greed&#8221; territory, reflecting ongoing market optimism. Although ETC Group&#8217;s Cross Asset Risk Appetite (CARA) measure declined slightly, it remained in positive territory, signaling a decrease in risk appetite in traditional financial markets. Performance dispersion among digital assets decreased compared to the previous week but remained relatively high. This implies that correlations among crypto assets have decreased, and investments are driven by coin-specific factors, highlighting the importance of diversification among digital assets. Short-Term Holders Cash In The market remains in a strong profit environment, with a significant percentage of BTC and ETH addresses in profit. According to Dragosh, profit-taking activity, particularly among short-term holders, has increased as Bitcoin approaches recent highs, leading to higher selling pressure.  Long-term holders have also increased their transfers of profitable coins to exchanges, potentially hindering short-term price increases. However, it is worth noting that there is no evidence of older coins being spent, which would indicate a larger price correction. Related Reading: Avalanche Rules Top 10 Ranking With 61% Weekly Gain – Here’s The Scoop On the other hand, aggregate open interest in BTC futures and perpetual remained stable, with notable futures short liquidations recorded. BTC option open interest saw a significant increase, accompanied by relative put-buying and an increase in the put-call open interest ratio.  The 25-delta BTC option skews also increased, indicating higher demand for puts compared to calls. However, overall at-the-money (ATM) implied volatilities did not change significantly. At the time of writing, BTC has lost its $42,000 support line, trading at $41,600, down 5% in the last 24 hours. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-11T23:59:16.000Z",
    "title": "How To Take A Long And Short Position In Crypto",
    "url": "https://www.newsbtc.com/crypto/what-is-a-short-position-long-crypto/",
    "description": "In crypto trading, mastering a long and short position is crucial for success. This guide dives into the essentials like &#8220;what is a short position&#8221; and &#8220;what is covering shorts&#8221; as well as strategies for both long &#38; short crypto trading, tailored for traders at all levels. Uncover the strategies behind long positions, aimed at growth and value appreciation, and delve into the subtleties of &#8220;going short.&#8221; The Basics Of Long/Short Position Crypto Trading Before diving into the specific strategies of long and short crypto trading, it&#8217;s essential to grasp the fundamental concepts that govern the cryptocurrency market. Crypto trading, at its core, involves the buying and selling of cryptocurrencies like Bitcoin, Ethereum, and others, with the aim of generating profit from market fluctuations. Unlike traditional stock markets, the crypto market operates 24/7, offering continuous opportunities but also presenting unique challenges due to its volatility. The Market&#8217;s Volatility The cryptocurrency market is known for its high volatility. Prices can dramatically increase or decrease over short periods, making it a potentially lucrative but risky market. This volatility stems from various factors, including market sentiment, regulatory news, technological advancements, and global economic events. Supply And Demand Dynamics Just like any market, crypto trading is driven by supply and demand. The limited supply of certain cryptocurrencies, coupled with increasing demand, can lead to price surges. Conversely, oversupply or waning interest can cause prices to plummet. Understanding these dynamics is crucial for any trader aiming to capitalize on market movements. Trading Platforms And Wallets Crypto traders can use a variety of online platforms to execute their trades. These platforms vary in terms of security, fees, available cryptocurrencies, and user experience. Additionally, traders can trade Bitcoin and crypto in different forms and on different markets. Options are the spot market, the futures and options market, Exchange Traded Funds (ETFs) and Exchange Traded Products (ETP) as well as Contracts For Difference (CFDs). Understanding these basic distinctions provides a foundation upon which traders can build more complex strategies, including long and short positions. As we delve deeper into these strategies, keep in mind that crypto trading requires not only an understanding of market trends and behaviors but also a basic technical understanding in order to recognize the value proposition of the respective cryptocurrencies and thus market trends. What Is A Long Position In Crypto? A long position in crypto, often simply referred to as &#8220;going long,&#8221; is a fundamental strategy where traders invest in a cryptocurrency with the expectation that its value will rise over time. This approach is grounded in a positive outlook on the market&#8217;s future performance, making it a cornerstone of traditional investment strategies adapted for the crypto world. When a trader takes a long position, they purchase a cryptocurrency at a certain price, aiming to sell it at a higher price in the future. The difference between the purchase price and the selling price represents the profit. This strategy requires patience and a keen eye for market trends, as the appreciation in value may occur over varying timeframes, from short-term spikes to long-term growth. Successful long positions often depend on thorough market analysis. Traders need to assess various factors, including technological advancements in blockchain, changes in regulatory landscapes, market sentiment, and broader economic indicators that could influence the price of a cryptocurrency. By understanding these factors, traders can make more informed decisions about when to enter a long position. While long positions are generally considered less risky than short positions due to the inherent nature of markets to rise over time, they are not without risks. The volatile nature of the crypto market means that long-term investments can be subject to significant fluctuations. Effective risk management strategies, such as setting stop-loss orders and diversifying portfolios, are crucial in mitigating potential losses. What Is A Short Position In Crypto? Understanding a short position in crypto trading is crucial for traders looking to capitalize on market declines. This strategy, often referred to as &#8220;going short,&#8221; involves betting against a cryptocurrency&#8217;s value, offering a contrast to the more traditional long position approach. When traders go short, they sell a cryptocurrency they don&#8217;t own with the expectation of buying it back at a lower price. This begins with borrowing the asset and selling it at the current market price. If the price drops as expected, the trader repurchases the cryptocurrency at this lower rate, returns the borrowed amount, and keeps the difference as profit. This process is commonly known as selling short. The mechanics of a short position are inherently riskier than long positions. The potential for losses is theoretically limitless, as cryptocurrency prices can surge unexpectedly. Thus, short selling demands a deep understanding of market trends and constant vigilance. Timing is crucial in going short. Traders must accurately predict downturns, which can be influenced by various factors, including market sentiment, technical indicators, or external events. However, the volatile and unpredictable nature of the crypto market makes this a challenging endeavor. Notably, a stop loss is also a key instrument for risk-management. A short position in the crypto context signifies a trader&#8217;s belief in an impending decrease in a cryptocurrency&#8217;s value. It&#8217;s not just a defensive strategy to hedge against potential losses but also a proactive approach to profit from market downturns. Despite its risks, seasoned traders often employ short positions as part of a diversified trading strategy, enabling them to leverage opportunities in all market conditions. What Is Covering Shorts? Covering shorts is a critical concept in crypto trading, particularly for those who engage in short selling. It refers to the process of buying back the borrowed cryptocurrency to close out a short position. This action is taken when a trader believes that the price of the cryptocurrency will no longer continue to decline, or to cut losses if the market moves against their prediction. When a trader covers their shorts, they are essentially reversing the initial transaction. They buy the same amount of the cryptocurrency they initially borrowed and sold, aiming to do so at a lower price than they sold it for. This transaction concludes the short selling cycle. If the price is indeed lower, the trader profits from the difference; if higher, the trader incurs a loss. “Market shorts” refer to the collective short positions held in the market. High levels of market shorts can indicate bearish sentiment, suggesting that many traders expect prices to fall. However, this can also lead to a “short squeeze,” where a sudden price increase triggers widespread covering of shorts, further driving up the price. Long Position Vs. Short Position: When To Take It Deciding between a long and a short position in crypto trading depends on several factors, including market analysis, risk tolerance, and investment horizon. Traders should consider the current market trends and potential future developments. A long position might be more suitable in a bullish market or when positive developments are expected in the cryptocurrency space. On the other hand, a short position could be more effective during bearish market conditions or when negative news or trends are anticipated. Short positions generally carry more risk due to the potential for unlimited losses. Traders with a lower risk tolerance may prefer long positions. Conversely, those willing to take on higher risk for potentially greater rewards might opt for short positions. The choice between long and short positions also depends on the trader’s investment timeframe. Long positions are typically associated with a longer-term outlook, while short positions are often suited for short-term trading strategies. Risk Management When Going Short Risk management is particularly crucial when engaging in short selling due to the inherently high-risk nature of this strategy. Stop-Loss-Orders: One of the most important tools in managing risk while short selling is the use of stop-loss orders. These orders can help limit potential losses by automatically closing out a position if the cryptocurrency&#8217;s price moves unfavorably to a certain point. Hedging: Traders may also employ hedging strategies to mitigate risks associated with going short. This might involve diversifying their investment portfolio or using financial instruments like options or futures to provide a safety net against potential losses. Capital Management: Effective capital management is essential. This involves only allocating a portion of one’s capital to high-risk strategies like short selling, ensuring that a single bad trade does not significantly impact the overall trading capital. Long/Short Strategies In the volatile arena of crypto trading, long/short strategies are essential for traders to understand. These strategies, which involve navigating between long and short positions, are key to leveraging market movements and managing risk effectively. Comparison: Long Position Vs Short Position In Trading The decision to go long or short in crypto trading fundamentally depends on a trader&#8217;s market outlook and strategy. Long Vs. Short Position: A long position is taken with the expectation of a cryptocurrency&#8217;s price rising, reflecting a bullish outlook. In contrast, a short position is based on the anticipation of a price decline, indicative of a bearish market perspective. Risk Tolerance: The risk profiles of these positions differ significantly. Long positions, subject to market downturns, have a maximum loss limit (the asset can only drop to zero). Short positions, however, carry potentially unlimited risk, as there&#8217;s no cap on how high a cryptocurrency&#8217;s price can climb. Shorts vs Longs: The proportion of short positions versus long positions in the market can offer insights into overall market sentiment. A dominance of short positions might indicate bearish sentiment, whereas a prevalence of long positions suggests a bullish market. Leverage When Going Short And Long Leverage is a critical concept in crypto trading, especially when implementing long or short strategies. It allows traders to amplify their trading position beyond their actual capital, potentially increasing profits. However, it also escalates the risks, including the risk of liquidation. Leverage in crypto trading means using borrowed funds to increase a trade&#8217;s exposure. For instance, using 10x leverage, a trader can open a position ten times the value of their actual investment. This can significantly amplify profits if the market moves in the trader’s favor. However, it also means that losses are magnified if the market moves against them. A key risk when using leverage is liquidation. Liquidation occurs when the market moves against the leveraged position and the losses exceed the trader&#8217;s initial margin (the amount invested in the trade). If a trader’s position is close to being liquidated, they may be required to add more funds to their margin (a “margin call”) or risk having their position automatically closed by the exchange. Long And Short Squeeze A crucial aspect of long/short strategies is understanding the phenomena of long and short squeezes. Short Squeeze: This occurs when a sharp rise in the cryptocurrency&#8217;s price compels short sellers to buy back the asset to close their positions, often at a loss. This buying action can further drive up the price, amplifying the squeeze. Long Squeeze: Conversely, a long squeeze happens when a sudden drop in prices forces traders in long positions to sell their holdings, usually to limit losses. This selling pressure can further depress the cryptocurrency&#8217;s price. These squeezes are significant market events that can lead to rapid and substantial price movements, impacting both individual trading strategies and overall market dynamics. Position Trader Strategy In Crypto Markets This strategy plays a unique role, often focusing on longer-term trends and strategies. Position Trader Strategies: These traders typically hold their positions over extended periods, basing decisions on long-term market trends rather than short-term fluctuations. This approach requires a deep understanding of market fundamentals and a patient, disciplined investment philosophy. Longer Position Approaches: In taking longer positions, position traders often weather short-term market volatility in anticipation of long-term gains. This strategy demands not only a thorough analysis of the cryptocurrency&#8217;s potential but also a steadfast approach to riding out market highs and lows. Practical Guide To Long &#38; Short Crypto Successfully trading cryptocurrencies involves more than understanding market trends; it requires knowing how to effectively execute long and short positions. This practical guide provides insights into the mechanisms of long and short crypto trading, recommends platforms for these trades, and offers a detailed guide to short selling in the crypto world. How To Long And Short Crypto? The process of going long or short in crypto involves several key steps: Market Analysis: Before taking any position, conduct thorough research. Analyze market trends, news, technical indicators, and any other relevant information that could impact the price of the cryptocurrency. Choosing A Position: If your analysis suggests an upcoming rise in the crypto’s value, you would buy (or &#8216;go long on&#8217;) the crypto with the intention of selling it later at a higher price. Conversely, if you anticipate a decrease in value, you would sell the crypto (or &#8216;go short&#8217;), ideally repurchasing it later at a lower price to profit from the difference. Order Execution: Use a crypto trading platform to place your order. For long positions, this will typically be a &#8216;buy&#8217; order; for short positions, a &#8216;sell&#8217; order. Advanced traders might use market, limit, or stop orders based on their strategy. Risk Management: Always implement risk management strategies like setting stop-loss orders or only investing what you can afford to lose, especially important in the highly volatile crypto market. Close The Position: Monitor the market closely and close your position when you have achieved your target profit or want to cut a loss. For long positions, this means selling your crypto; for short positions, buying back. Best Crypto Platforms To Long &#38; Short Choosing the right platform is crucial for effective long and short trading. Here’s a list of the most renowned platforms: Binance Futures: Known as the most liquid crypto contract trading platform, Binance Futures offers futures contracts for a wide range of cryptocurrencies. It provides options of cross margin and isolated margin modes, with up to 125x leverage on selected trading pairs. Bybit: This global cryptocurrency exchange focuses on crypto futures contracts and also offers options trading and spot trading. It has futures settled in USDC and USDT stablecoins, as well as in the underlying cryptocurrency. BitMEX: A pioneering platform in crypto contract trading, BitMEX caters to experienced traders and provides access to perpetual swaps and futures contracts margined in BTC, USDT, and ETH. OKX: OKX offers a comprehensive suite of trading products including perpetual swaps, futures, and options. It also features competitive fees and a trading bot marketplace. Deribit: Dominant in crypto options contracts, especially for Bitcoin and Ethereum, Deribit is the preferred platform for institutional-grade crypto derivatives trading. BingX: This platform lists both perpetual and standard futures contracts settled in USDT, covering a wide selection of cryptocurrencies. Phemex: Phemex provides stablecoin-settled futures, coin-settled futures, and USD-settled futures. It also features a &#8220;hedge mode,&#8221; allowing traders to hold long and short positions simultaneously on the same contract. FAQ: Long And Short Positions What Is A Short Position? A short position in crypto trading refers to selling a cryptocurrency that the trader does not own, with the expectation of buying it back later at a lower price. This strategy is used when the trader believes the price of the crypto will decrease. What Is A Long Position? A long position in crypto trading is when a trader buys a cryptocurrency with the expectation that its value will increase. It&#8217;s a strategy based on optimism about the asset&#8217;s future performance. What Is The Difference Between A Long And Short Position? The primary difference is in the market outlook. A long position reflects a bullish stance, expecting the asset&#8217;s value to rise. A short position, however, is bearish, predicting a decline in the asset&#8217;s value. Selling Short Explained? Selling short involves borrowing a cryptocurrency and selling it at the current market price. The trader then aims to buy it back at a lower price, return the borrowed coins, and keep the difference as profit. Explain The Term &#8216;Short Position Meaning&#8217; In The Context Of Crypto? In the context of crypto, a short position means taking a trading stance where you anticipate a decrease in the cryptocurrency&#8217;s value. It involves selling the crypto now to buy it back at a lower price later. What Is The Difference Between Long Vs Short Position? The difference lies in market speculation. Going long is speculating on a price rise, while going short is speculating on a price drop. Both strategies have different risk profiles and market approaches. What Are Long And Short Positions? Long and short positions are trading strategies in cryptocurrencies. A long position bets on a price increase, while a short position bets on a price decrease. How Do Long &#38; Short Positions Affect The Crypto Market? These positions can significantly impact market liquidity and price movements. A predominance of long positions can indicate bullish market sentiment, while a majority of short positions may signal a bearish outlook. What Is The Difference Between Short Selling And Long Selling? Short selling is selling a borrowed cryptocurrency with the plan to repurchase it at a lower price. Long selling, however, is simply selling a cryptocurrency that you own, expecting that its price will not rise further. What Are Long Positions? Long positions in crypto trading are when traders buy and hold a cryptocurrency, expecting its value to increase over time. What Is A Short In Trading? A short in trading refers to the practice of selling a borrowed asset (like a cryptocurrency) with the intention of buying it back at a lower price. What Does &#8216;In Short Order&#8217; Mean? &#8216;In short order&#8217; typically means accomplishing something quickly or within a short period. In trading, it might refer to rapidly executed trades or market movements. What Is Short In Trading? In trading, going short means taking a position that profits from the decline in the price of an asset. How To Long And Short Crypto? To long crypto, buy and hold it expecting an increase in value. To short crypto, sell a borrowed cryptocurrency anticipating a decrease in its price. Both strategies require careful market analysis and risk management. What Are Platforms To Short Crypto? Platforms like Binance Futures, Bybit, BitMEX, OKX, and others offer the ability to short crypto. This is possible through various trading instruments like futures and options contracts. Featured image from iStock"
  }
]