[
  {
    "source": "CoinDesk",
    "date": "2023-06-27T06:00:00.000Z",
    "title": "Crypto Exchange OKX Goes Live With ‘Nitro Spreads,’ Allowing One-Click Basis Trading",
    "url": "https://www.coindesk.com/markets/2023/06/27/embargo-2am-est-on-tuesday-june-27th-7am-in-london-crypto-exchange-okx-goes-live-with-nitro-spreads-allowing-one-click-basis-trading/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Basis traders attempt to earn returns by trading the difference in an asset’s price on two separate markets."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-27T06:06:46.000Z",
    "title": "OKX Liquid Marketplace Launches 'Nitro Spreads' Enabling One-Click Basis Trading for Institutional Clients",
    "url": "https://cryptodaily.co.uk/2023/06/okx-liquid-marketplace-launches-nitro-spreads-enabling-one-click-basis-trading-for-institutional-clients",
    "description": "<p>Dubai, UAE, June 27th, 2023, Chainwire</p><p>OKX, the second-largest crypto exchange by trading volume and a leading Web3 technology company, today launched its new 'Nitro Spreads' feature on its institutional Liquid Marketplace, an OTC, futures spreads and options liquidity network, allowing traders to make complex basis trades with simple one-click execution.</p><p>Basis trading is a strategy built around trading the difference between an asset's price on two separate markets, such as spot vs. futures, and can generate returns when executed properly. It typically requires both legs of the trade to be managed simultaneously, which can be cumbersome. OKX's Nitro Spreads automates this complex trade into one click, leveraging the platform's superior liquidity and low latency for maximum user benefit.</p><p>Nitro Spreads is also one of the only basis trading tools in the crypto market in which the two legs of the trade are executed via a central orderbook, eliminating leg risk between markets. Before execution, traders can also select a guaranteed spread for a trade, mitigating unexpected price slippage. Trades are then matched and settled immediately.</p>OKX Global Chief Commercial Officer Lennix Lai said: \"In the current complex market environment, institutions demand reliability, predictable returns and genuine innovation when choosing a trading venue. This is especially true in basis trading, where precision is paramount. Nitro Spreads raises the bar for the industry for efficient basis trading, and we invite institutional traders everywhere to see how it can enhance their strategies and contribute to their success.\"<p>A variety of basis trading strategies can be executed by institutional traders through Nitro Spreads' easy-to-use interface. Institutional traders can employ popular delta one spread strategies like calendar spreads, future rolls and funding rate farming - all in an orderbook format.</p><p>The on-demand OKX Liquid Marketplace provides access to deep institutional liquidity and a number of crypto trading strategies, including futures spreads, large options block trades or spot OTC, to run at scale. In April, OKX announced that the Liquid Marketplace exceeded USD1 billion in trading volume during the first three months of 2023.</p><p>About OKX</p><p>OKX is the second-largest global crypto exchange by trading volume and a leading Web3 ecosystem. Trusted by more than 50 million global users, OKX is known for being the fastest and most reliable crypto trading app for traders everywhere.</p><p>As a top partner of English Premier League champions Manchester City FC, McLaren Formula 1, Olympian Scotty James and F1 driver Daniel Ricciardo, OKX aims to supercharge the fan experience with new engagement opportunities. OKX is also the top partner of the Tribeca Festival as part of an initiative to bring more creators into web3.</p><p>Beyond OKX&rsquo;s exchange, the OKX Wallet is the platform's latest offering for people looking to explore the world of NFTs and the metaverse while trading GameFi and DeFi tokens.</p><p>OKX is committed to transparency and security and publishes its Proof of Reserves on a monthly basis.</p><p>To learn more about OKX, download our app or visit: okx.com</p><p>Disclaimer</p><p>THIS ANNOUNCEMENT IS PROVIDED FOR INFORMATIONAL PURPOSES ONLY. IT IS NOT INTENDED TO PROVIDE ANY INVESTMENT, TAX, OR LEGAL ADVICE, NOR SHOULD IT BE CONSIDERED AN OFFER TO PURCHASE, SELL, OR HOLD DIGITAL ASSETS. DIGITAL ASSETS, INCLUDING STABLECOINS, INVOLVE A HIGH DEGREE OF RISK, CAN FLUCTUATE GREATLY, AND CAN EVEN BECOME WORTHLESS. OKX IS NOT REGULATED BY THE FCA, THUS, PROTECTIONS SUCH AS THE FINANCIAL OMBUDSMAN SERVICE OR FINANCIAL SERVICES COMPENSATION SCHEME WILL NOT BE AVAILABLE. YOU SHOULD CONSIDER WHETHER YOU UNDERSTAND HOW CRYPTO WORKS AND WHETHER TRADING OR HOLDING DIGITAL ASSETS IS SUITABLE FOR YOU IN LIGHT OF YOUR FINANCIAL CONDITION. THE VALUE OF YOUR DIGITAL ASSETS, INCLUDING STABLECOINS, CAN INCREASE OR DECREASE AND PROFITS MAY BE SUBJECT TO CAPITAL GAINS TAX. PAST PERFORMANCE DOES NOT INDICATE FUTURE RESULTS. PLEASE CONSULT YOUR LEGAL/TAX/INVESTMENT PROFESSIONAL FOR QUESTIONS ABOUT YOUR SPECIFIC CIRCUMSTANCES.</p>ContactPressmedia@okx.com"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-27T06:00:00.000Z",
    "title": "HSBC Hong Kong Expands Support For Bitcoin and Ethereum ETFs",
    "url": "https://cryptodaily.co.uk/2023/06/hsbc-hong-kong-expands-support-for-bitcoin-and-ethereum-etfs",
    "description": "<p class=\"md-end-block md-p\">HSBC Hong Kong, a subsidiary of one of the world's largest banking and financial services organizations, has recently added support for Bitcoin and Ethereum futures Exchange Traded Funds (ETFs).</p>\n<p class=\"md-end-block md-p md-focus\">This move expands access to digital asset derivatives in the flourishing Asian crypto hub. Jeff Feng, co-founder of Sei Labs, believes that ETFs deliver \"simplicity and convenience\" for newcomers to the crypto space.</p>\nBroader Exposure to Digital Assets\n<p class=\"md-end-block md-p\">As of Monday, HSBC Hong Kong customers are now able to trade ETFs that offer exposure to Bitcoin and Ethereum futures based on derivative contracts listed on commodity exchanges. These ETFs, treated as securities, were listed on HSBC Hong Kong's mobile app \"Easy Invest.\"</p>\n<p class=\"md-end-block md-p\">HSBC Hong Kong has confirmed to Decrypt that the specific offerings are CSOP Bitcoin Futures ETF, CSOP Ethereum Futures ETF, and Samsung Bitcoin Futures Active ETF. The news was initially reported by Chinese crypto journalist Colin Wu, who underscored that HSBC, the largest bank in Hong Kong, is the first lender in the region to grant its customers access to digital asset ETFs.</p>\n<p class=\"md-end-block md-p\">According to Jeff Feng, including ETFs on its investment platform provides HSBC Hong Kong investors with access to derivatives, which they might otherwise seek on unregulated exchanges. This new offering represents a clear opportunity for the bank to take the lead and fulfill a clearly identified customer need.</p>\n<p class=\"md-end-block md-p\">The CSOP Bitcoin Futures ETF and CSOP Ethereum Futures ETF are managed by CSOP Asset Management. This firm listed the two products on the Hong Kong Stock Exchange in December of last year, marking the first time ETFs in Asia had tracked digital asset futures. Both ETFs invest in futures contracts trading on the Chicago Mercantile Exchange (CME), providing a straightforward way for investors to participate in the performance of Bitcoin and Ethereum.</p>\nSafer Path Through Regulatory Scrutiny\n<p class=\"md-end-block md-p\">Despite the strong demand for spot access to crypto among retail investors in Hong Kong, Feng noted that the demand for derivatives is equally high, if not higher. ETFs offer companies a way to provide crypto exposure without exposing themselves to regulatory risk in a rapidly evolving industry. Hong Kong's financial authorities have recently signaled a shift toward a more open stance on cryptocurrencies.</p>\n<p class=\"md-end-block md-p\">The regulatory scrutiny around centralized exchanges has led to caution in launching new platforms.</p>\n\n<p class=\"md-end-block md-p\">\"If all of the centralized exchanges are getting this much regulatory scrutiny, it wouldn't be too wise to go out and try to launch another,\" Feng stated. \"It's much safer to do what's already been proven. There's a clear playbook.\"</p>\n\n<p class=\"md-end-block md-p\">In the United States, futures ETFs related to the performance of digital assets have become more common. Despite the U.S. Securities and Exchange Commission (SEC) not yet approving a spot-based Bitcoin ETF, ProShares' Bitcoin futures ETF was launched on the New York Stock Exchange in 2021.</p>\n\n<p class=\"md-end-block md-p\">\"When you have simplicity, what you eventually will get is volume,&rdquo; he said. \"People will eventually speculate because it&rsquo;s just so easy,\" Feng said.</p>\n\n<p class=\"md-end-block md-p\">According to Feng, the \"simplicity and convenience\" offered by ETFs make them an attractive option for retail traders, particularly compared to other derivatives like options, which require an understanding of more complex concepts.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T06:02:04.000Z",
    "title": "OKX Liquid Marketplace Launches ‘Nitro Spreads’ Enabling One-Click Basis Trading for Institutional Clients",
    "url": "https://www.cryptopolitan.com/okx-liquid-marketplace-launches-nitro-spreads-enabling-one-click-basis-trading-for-institutional-clients/",
    "description": "Dubai, UAE, June 27th, 2023, Chainwire OKX, the second-largest crypto exchange by trading volume and a leading Web3 technology company, today launched its new &#8216;Nitro Spreads&#8217; feature on its institutional Liquid Marketplace, an OTC, futures spreads and options liquidity network, allowing traders to make complex basis trades with simple one-click execution. Basis trading is a ... <a title=\"OKX Liquid Marketplace Launches &#8216;Nitro Spreads&#8217; Enabling One-Click Basis Trading for Institutional Clients\" class=\"read-more\" href=\"https://www.cryptopolitan.com/okx-liquid-marketplace-launches-nitro-spreads-enabling-one-click-basis-trading-for-institutional-clients/\" aria-label=\"More on OKX Liquid Marketplace Launches &#8216;Nitro Spreads&#8217; Enabling One-Click Basis Trading for Institutional Clients\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T05:56:25.000Z",
    "title": "SEC Chair Gary Gensler to Share Views on Crypto Draft Bill with US House Committee",
    "url": "https://www.cryptopolitan.com/sec-gary-gensler-views-on-crypto-draft-bill/",
    "description": "In a move to gain insights into the legislative proposal to revise the market structure related to digital assets, US Representative Maxine Waters has requested Securities and Exchanges Commission Chair Gary Gensler and Treasury Secretary Janet Yellen to provide their views. The proposal, introduced by leaders of the House Financial Services Commission and Agriculture Committee, ... <a title=\"SEC Chair Gary Gensler to Share Views on Crypto Draft Bill with US House Committee\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-gary-gensler-views-on-crypto-draft-bill/\" aria-label=\"More on SEC Chair Gary Gensler to Share Views on Crypto Draft Bill with US House Committee\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T06:08:05.000Z",
    "title": "OKX Liquid Marketplace Launches ‘Nitro Spreads’ Enabling One-Click Basis Trading for Institutional Clients",
    "url": "https://www.crypto-news-flash.com/okx-liquid-marketplace-launches-nitro-spreads-enabling-one-click-basis-trading-for-institutional-clients/?utm_source=rss&utm_medium=rss&utm_campaign=okx-liquid-marketplace-launches-nitro-spreads-enabling-one-click-basis-trading-for-institutional-clients",
    "description": "Dubai, UAE, June 27th, 2023, Chainwire OKX, the second-largest crypto exchange by trading volume and a leading Web3 technology company, today launched its new &#8216;Nitro Spreads&#8217; feature on its institutional Liquid Marketplace, an OTC, futures spreads and options liquidity network, allowing traders to make complex basis trades with simple one-click execution. Basis trading is a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T06:00:45.000Z",
    "title": "Discovering Meme Coin Gold: A Guide to Finding the Best Presale Opportunities",
    "url": "https://www.crypto-news-flash.com/discovering-meme-coin-gold-a-guide-to-finding-the-best-presale-opportunities/?utm_source=rss&utm_medium=rss&utm_campaign=discovering-meme-coin-gold-a-guide-to-finding-the-best-presale-opportunities",
    "description": "Cryptocurrency has rapidly expanded over the past decade, creating a myriad of digital currencies that cater to different user bases. Meme coins, inspired by popular internet memes, have emerged as a new class of cryptocurrencies offering unique investment opportunities. Discovering a promising meme coin during its presale stages can potentially yield significant returns, given its [...]"
  }
]