[
  {
    "source": "CryptoGlobe",
    "date": "2024-02-24T12:41:18.000Z",
    "title": "Andrew Tate Launches Savage Attack on Crypto Nerds",
    "url": "https://www.cryptoglobe.com/latest/2024/02/andrew-tate-launches-savage-attack-on-crypto-nerds/",
    "description": "Andrew Tate is a controversial public figure known for his varied career and polarizing online presence. Initially gaining fame as a professional kickboxer, Tate is a four-time world champion in kickboxing, which laid the foundation for his public persona. After his kickboxing career, he ventured into business, accumulating wealth through various endeavors, including casinos, digital […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-24T13:04:44.000Z",
    "title": "Ritual and EigenLayer Partnership: Pioneering AI-Native Blockchain Security",
    "url": "https://www.cryptopolitan.com/ritual-eigenlayer-ai-blockchain-security/",
    "description": "Ritual, an ambitious decentralized AI network project, has announced a strategic partnership with EigenLayer, a pioneering re-staking protocol.  This collaboration marks a significant milestone in Ritual&#8217;s journey toward building its innovative AI-native Autonomous Verification System (AVS) designed to bolster the security and decentralization of both the Ritual Chain and Infernet. Ritual bridging AI and blockchain [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-24T13:03:37.000Z",
    "title": "Blast’s BIG BANG Competition: Celebrating Innovation in Ethereum Layer 2 Ecosystem",
    "url": "https://www.cryptopolitan.com/blast-big-bang-ethereum-layer-2-ecosystem/",
    "description": "The Ethereum Layer 2 network, Blast, has recently unveiled the winners of its highly anticipated BIG BANG competition, marking a significant milestone in the network&#8217;s journey towards fostering innovation and development.&#160; The competition, which drew in a staggering number of over 3,000 participating teams, has highlighted the burgeoning talent and creativity within the Ethereum Layer [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-24T13:03:16.000Z",
    "title": "Frankfurt to host EU’s new anti-money laundering authority for crypto oversight",
    "url": "https://www.cryptopolitan.com/frankfurt-eu-anti-money-laundering-authority/",
    "description": "The European Union has announced the establishment of its new Anti-Money Laundering Authority (AMLA) in Frankfurt, Germany. This decision positions Frankfurt at the forefront of the EU&#8217;s efforts to regulate the crypto sector to ensure uniform compliance across its 27 member states. Establishing a unified regulatory framework The AMLA, structured to include both the authority [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-24T13:02:30.000Z",
    "title": "Curve Finance Expands DeFi Offerings with New Lending Contracts",
    "url": "https://www.cryptopolitan.com/curve-finance-defi-lending-contracts/",
    "description": "Curve Finance, a leading player in the decentralized finance (DeFi) space, has recently made a significant announcement via Twitter regarding the deployment of its lending contracts. The development marks a pivotal expansion of Curve&#8217;s services, traditionally known for its liquidity pools and stablecoin trading.  The introduction of lending contracts opens up new avenues for arbitrage [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-24T12:59:54.000Z",
    "title": "Blueberry Protocol Responds to Attack with User Compensation and Security Enhancements",
    "url": "https://www.cryptopolitan.com/blueberry-protocol-compensation-security/",
    "description": "In a recent development within the DeFi sector, the Blueberry Protocol, a leading decentralized finance (DeFi) lending platform, has confirmed its commitment to compensating its users following a vulnerability attack. The protocol&#8217;s team has been actively coordinating with the relevant attackers to mitigate the damage and ensure the security of user funds.&#160; Despite the setback, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-24T12:57:46.000Z",
    "title": "Craig Wright confesses to editing Bitcoin Whitepaper for court",
    "url": "https://www.cryptopolitan.com/craig-wright-confesses-to-editing-bitcoin/",
    "description": "In a recent development within the ongoing legal proceedings against the Coalition for Patent and Trademark Office Procedures (COPA), Craig Wright, the Australian computer scientist who claims to be Satoshi Nakamoto, the pseudonymous creator of Bitcoin, has admitted to making revisions to the Bitcoin whitepaper documents that were submitted in court. This acknowledgment came to [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-24T12:49:00.000Z",
    "title": "The potential impact of Bitcoin halving on the cryptocurrency market | Opinion",
    "url": "https://crypto.news/the-potential-impact-of-bitcoin-halving-on-the-cryptocurrency-market-opinion/",
    "description": "While past trends point to potential growth, the current market's complexity and the global economic landscape could moderate the post-halving boom seen in past cycles."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-24T13:00:23.000Z",
    "title": "Uniswap 71% Single-Day Rally Raises Eyebrows – Can DeFi Maintain Momentum?",
    "url": "https://www.newsbtc.com/news/uniswap-71-single-day-rally-raises-eyebrows-can-defi-maintain-momentum/",
    "description": "The cryptocurrency market witnessed a significant shift in momentum on February 23rd, as Uniswap native token, UNI, skyrocketed by an impressive 71%. This surge marks the token&#8217;s highest price point since March 2022, sending shockwaves through the crypto landscape and reigniting interest in the decentralized finance (DeFi) sector. Source: Coingecko Related Reading: Siacoin Balloons To 65% in Value On Network Upgrades – Details Uniswap Proposes Fee-Sharing Feast For Stakers The primary catalyst behind this astronomical rise appears to be a pivotal proposal unveiled by the Uniswap Foundation. This proposition advocates for the implementation of a novel fee-sharing mechanism, fundamentally altering the token&#8217;s utility and incentivizing long-term participation within the Uniswap ecosystem. Under the proposed system, UNI holders who stake their tokens will be rewarded with a portion of the fees generated by the Uniswap protocol. This not only grants them a direct financial incentive but also empowers them to choose delegates who vote on governance proposals, shaping the future direction of Uniswap. This revolutionary approach resonates with a broader trend of resurgent interest in DeFi. According to on-chain data provider Santiment, assets associated with decentralized lending, borrowing, and cryptocurrency exchange, like $COMP, $SUSHI, and $AAVE, have all experienced notable value increases, mirroring UNI&#8217;s upward trajectory. Trade Volumes On A Roll Further bolstering this trend, trading volumes across these protocols have also seen explosive growth. For instance, the COMP price jumped alongside a staggering 400% increase in trading volume, reaching over $175 million. Similarly, SushiSwap (SUSHI) witnessed a 27% price surge coupled with a 153% increase in trading volume. This shift in investor focus is further underscored by a corresponding decline in the value of AI-related coins, indicating a potential capital rotation within the market. UNI currently trading at $12.16 on the daily chart: TradingView.com Uniswap v4 Upgrade On The Horizon: Efficiency And Customization Beckon Adding fuel to the fire is the impending arrival of the highly anticipated Uniswap v4 upgrade, slated for release in Q3 2024. This transformative update promises to enhance the protocol&#8217;s efficiency and customizability, catering to the evolving needs of the DeFi space. While the direct impact of v4 on the current price surge remains debatable, its potential to revolutionize the Uniswap experience undoubtedly contributes to the overall bullish sentiment surrounding UNI. Related Reading: Ethereum Bullish Run: Analyst Eyes $4,500 After ETH Breached $3K Beyond Uniswap: DeFi Dominance On The Rise? The Uniswap fee-sharing proposal and upcoming v4 upgrade have not only revitalized the UNI token but also cast a spotlight on the broader DeFi landscape. Analysts predict that other DeFi protocols like Blur and Lido Finance could witness similar surges in the wake of Uniswap&#8217;s bold move. This potential domino effect underscores the growing importance of DeFi within the cryptocurrency ecosystem, attracting investors seeking innovative financial solutions beyond traditional centralized systems. Featured image from Adobe Stock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-24T12:57:23.000Z",
    "title": "As Chainlink (LINK) and Avalanche (AVAX) Struggle, Algotech (ALGT) Leads the Way",
    "url": "https://www.crypto-news-flash.com/as-chainlink-link-and-avalanche-avax-struggle-algotech-algt-leads-the-way/?utm_source=rss&utm_medium=rss&utm_campaign=as-chainlink-link-and-avalanche-avax-struggle-algotech-algt-leads-the-way",
    "description": "<img width=\"954\" height=\"537\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Algotech.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Algotech.jpg 954w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Algotech-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Algotech-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Algotech-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Algotech-450x253.jpg 450w\" sizes=\"(max-width: 954px) 100vw, 954px\" />Amid increased market volatility, Chainlink (LINK) and Avalanche (AVAX) have experienced a price decline in the past week. Fortunately for investors, Algotech (ALGT) is the new presale coin poised to skyrocket by 275% once ALGT tokens are launched on major crypto exchanges. Discover how Algotech (ALGT) outshines Chainlink (LINK) and Avalanche (AVAX). Chainlink (LINK) Experiences [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-24T12:45:47.000Z",
    "title": "This Blue-Chip Ethereum Rival Will Explode by Over 150% in the Short Term, Says Coin Bureau Host Guy Turner",
    "url": "https://dailyhodl.com/2024/02/24/this-blue-chip-ethereum-rival-will-explode-by-over-150-in-the-short-term-says-coin-bureau-host-guy-turner/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/Says-Coin-Bureau-Host.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/Says-Coin-Bureau-Host.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2024/02/Says-Coin-Bureau-Host.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/Says-Coin-Bureau-Host.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/Says-Coin-Bureau-Host.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/Says-Coin-Bureau-Host.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/02/Says-Coin-Bureau-Host.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The host of the Coin Bureau YouTube channel, Guy Turner, is bullish on an Ethereum (ETH) rival that’s more than tripled in price since October of 2023. In a new video, Turner tells the 2.41 million subscribers of the Coin Bureau channel that the native token of the layer-1 blockchain NEAR Protocol (NEAR) could go [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/24/this-blue-chip-ethereum-rival-will-explode-by-over-150-in-the-short-term-says-coin-bureau-host-guy-turner/\">This Blue-Chip Ethereum Rival Will Explode by Over 150% in the Short Term, Says Coin Bureau Host Guy Turner</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]