[
  {
    "source": "Cointelegraph",
    "date": "2023-09-10T12:30:05.000Z",
    "title": "Bitcoin UTXOs echoing March 2020 'black swan' crash — New research",
    "url": "https://cointelegraph.com/news/bitcoin-utxo-march-2020-crash-new-research",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/ba3f1737-57d5-479c-be6c-c9edef2d21bc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price performance may be weathering a storm not seen since COVID-19 sparked a 60% drawdown three-and-a-half years ago.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is recovering from a “black swan” event last rivaled by the March 2020 COVID-19 crash, data suggests.</p><p>In one of its <a href=\"https://cryptoquant.com/insights/quicktake/64f9adf378b98c08bc934a32-UTXOs-in-Loss-A-Precursor-to-the-Next-Black-Swan-Event\" target=\"_blank\" rel=\"noopener nofollow\">Quicktake</a> posts on Sep. 7, on-chain analytics platform CryptoQuant revealed a major spike in loss-making unspent transaction outputs (UTXOs).</p><h2>CryptoQuant: Bitcoin UTXOs in Loss \"mirror\" March 2020</h2><p>Bitcoin may be <a href=\"https://cointelegraph.com/news/bitcoin-bids-lowest-since-march-btc-price-dips\">worrying market participants</a> with current BTC price weakness, but on-chain data paints an intriguing picture of activity “under the hood.”</p><p>UTXOs represent BTC left over after an on-chain transaction is executed. CryptoQuant’s UTXOs in Loss metric tracks when large numbers of these UTXOs are worth more than they were when the BTC was originally bought.</p><p>Currently, more of these are in loss compared to their original acquisition price than at any time since March 2020.</p><p>At the time, BTC/USD dropped 60% to its lowest levels since March 2019 — lows which were never seen again.</p><p>Considering the current data from UTXOs in Loss, CryptoQuant contributor Woominkyu ventured that, like March 2020, Bitcoin may be seeing, or already bouncing back from, a curveball selling event.</p><p>He summarized:</p><blockquote>“Given that the current level of the ‘UTXOs in loss’ indicator mirrors that of the Black Swan event between March and April 2020 (due to the Coronavirus), those anticipating another Black Swan event might want to consider whether we are already in the midst of the event they are waiting for.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/ffc25ce2-f84d-471d-9631-f76e3f009b66.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin UTXOs in loss chart. Source: CryptoQuant</em></figcaption></figure><p>In percentage terms, 38% of UTXOs were in loss at the end of August, a figure last seen in April 2020.</p><p>“When many UTXOs are in loss, investors might be more inclined to sell, hinting at market anxiety. Conversely, when most UTXOs are profitable, it suggests an optimistic outlook and a stronger holding sentiment among investors,” Woominkyu added.</p><h2>Underwater Bitcoin speculators grow</h2><p>Bitcoin meanwhile remains locked in a tight range amid a lack of overall BTC price trend.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-speculators-btc-since-69k-all-time-highs\">Bitcoin speculators now own the least BTC since $69K all-time highs</a></em></strong></p><p>With neither a breakout nor breakdown willing to complete, cost basis data likewise shows current spot price caught between the acquisition prices of various investor cohorts.</p><p>This “Realized Price” — the price at which the supply last moved, divided by age group — shows that short-term holders fall into aggregate loss when BTC/USD is below around $27,000.</p><p>A full capitulation event, however, has yet to be recorded on-chain.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/b4e59be3-90a0-45a3-8ad9-8ae80f4c7e5a.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Realized Price chart (screenshot). Source: CryptoQuant</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-10T12:37:34.000Z",
    "title": "Chandrayaan-3’s Moon Robots Brave Lunar Cold Without Heaters – A Gamble of Survival",
    "url": "https://www.cryptopolitan.com/chandrayaan-3s-moon-robots-brave-lunar-cold/",
    "description": "India&#8217;s Chandrayaan-3 mission faces a daunting challenge following a groundbreaking two-week exploration of the moon&#8217;s south pole. Its robotic explorers, including the lander Vikram and rover Pragyan, are dormant during the frigid lunar night. Uniquely, Chandrayaan-3 is without the typical heating systems found on lunar missions, and its potential reactivation upon sunrise remains uncertain.&#160; The ... <a title=\"Chandrayaan-3&#8217;s Moon Robots Brave Lunar Cold Without Heaters &#8211; A Gamble of Survival\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chandrayaan-3s-moon-robots-brave-lunar-cold/\" aria-label=\"More on Chandrayaan-3&#8217;s Moon Robots Brave Lunar Cold Without Heaters &#8211; A Gamble of Survival\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-10T12:32:01.000Z",
    "title": "Coinbase eyes overseas markets amid U.S. regulatory uncertainty",
    "url": "https://www.cryptopolitan.com/coinbase-eyes-overseas-markets-amid-u-s-regulatory-uncertainty/",
    "description": "Coinbase CEO Brian Armstrong recently joined CNBC&#8217;s Power Lunch to discuss the company&#8217;s global ambitions. Armstrong highlighted that 83% of G-20 nations adopt or craft cryptocurrency laws. He cited Coinbase&#8217;s recent forays into Canada and the launch of an international derivatives exchange as evidence of the company&#8217;s commitment to overseas markets. In the face of ... <a title=\"Coinbase eyes overseas markets amid U.S. regulatory uncertainty\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-eyes-overseas-markets-amid-u-s-regulatory-uncertainty/\" aria-label=\"More on Coinbase eyes overseas markets amid U.S. regulatory uncertainty\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-10T12:23:10.000Z",
    "title": "Manchester’s AI and Robotics Research Thrives with Government Investment",
    "url": "https://www.cryptopolitan.com/manchesters-ai-and-robotics-research-thrives/",
    "description": "The city of Manchester in the United Kingdom is rapidly becoming a hub for cutting-edge AI and robotics research, thanks to substantial investments from both the private sector and the government. Researchers at Manchester University, led by Professor Lennox, are at the forefront of this transformative work, seeking to automate robot tasks through AI technology. ... <a title=\"Manchester&#8217;s AI and Robotics Research Thrives with Government Investment\" class=\"read-more\" href=\"https://www.cryptopolitan.com/manchesters-ai-and-robotics-research-thrives/\" aria-label=\"More on Manchester&#8217;s AI and Robotics Research Thrives with Government Investment\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-10T12:18:54.000Z",
    "title": "Is Ark Invest’s Shift from Nvidia to The Trade Desk the Right AI Investment Move?",
    "url": "https://www.cryptopolitan.com/ark-invests-trade-desk-ai-investment-move/",
    "description": "In a strategic move reflecting its strong belief in the future of artificial intelligence (AI), Cathie Wood&#8217;s Ark Invest has made notable adjustments to its investment portfolio. While maintaining a positive outlook on Nvidia, a prominent player in the AI hardware space, Ark Invest has trimmed its position in the company, reallocating capital to other ... <a title=\"Is Ark Invest&#8217;s Shift from Nvidia to The Trade Desk the Right AI Investment Move?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ark-invests-trade-desk-ai-investment-move/\" aria-label=\"More on Is Ark Invest&#8217;s Shift from Nvidia to The Trade Desk the Right AI Investment Move?\">Read more</a>"
  }
]