[
  {
    "source": "Decrypt",
    "date": "2023-07-28T20:02:42.000Z",
    "title": "What is Solana? A Scalable, Decentralized Network for Dapps",
    "url": "https://decrypt.co/resources/what-is-solana-a-scalable-decentralized-network-for-dapps",
    "description": "Solana boasts impressive speeds and a burgeoning dapp ecosystem, but it's still on the proving grounds. "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-28T20:00:00.000Z",
    "title": "Cannabis and NFT? Live minting hosted at NYC Dispensary",
    "url": "https://cryptodaily.co.uk/2023/07/cannabis-and-nft-live-minting-hosted-at-nyc-dispensary",
    "description": "<p>NFT art gallery Bright Moments held its live minting event at the Gotham store, one of New York City's \"luxury\" cannabis dispensaries.&nbsp;</p>\nWhere Art Is Born\n<p>Bright Moments is a digital art gallery which started as a group of volunteers in Venice Beach, California, and is now promoting its generative art experiences all over the world. The company is currently on their ten city tour around the world with the aim to mint 10k NFTs of their CryptoCitizens collection in different parts of the planet. Bright Moments has already held their live IRL minting events in Berlin, London, Mexico City, Tokyo, among other cities on the list. &ldquo;Where Art Is Born&rdquo; is the slogan of the DAO.</p>\nPremium Cannabis and Digital Art at New York&rsquo;s Gotham\n<p>Last year, the state of New York legalized the sale of cannabis for recreational use. Gotham is considered one of the first and most luxury cannabis dispensaries open in New York City. Apart from marijuana, the store sells lifestyle products in the areas of beauty and fashion. Gotham&rsquo;s mezzanine space is used for hosting events including karaoke nights, LGBTQ pride parties, and the live NFT minting events.</p>\n<p>On Tuesday, July 25, Bright Moments&rsquo; artist-in-residence, Jimena Buena Vida, showcased pieces of her Ethereum project called &ldquo;Epiphanies&rdquo; in the form of generative art experience at Gotham. The attendees had the opportunity to both claim NFTs and purchase some of the store&rsquo;s high-end goods.&nbsp;</p>\n\n<p>Gotham&rsquo;s Chief Creative Officer Billy Richards commented on the collaboration, &ldquo;We align with the idea of bringing different experiences, art forms, and people together. Both our teams are constantly on the forefront of new ideas and ways to engage our consumers.&rdquo;</p>\n\nWhat Do Crypto and Cannabis Have in Common?&nbsp;\n<p>Unfortunately, the Bright Moments exhibit in New York drew only less than a dozen guests. One of the attendees, Omkar Lewis, suggested that people now have less interest in purchasing NFTs due to high interest rates. Besides, he also mentioned that NFTs are highly criticized and not socially acceptable yet, just like cannabis was some years ago. Lewis then drew comparison between the two:&nbsp;</p>\n\n<p>&ldquo;They're both on the edge of something that wasn't culturally accepted,&rdquo; he said. &ldquo;NFTs are not quite socially acceptable yet, but in 20 years they will be.&rdquo;</p>\n\n<p>This was the second time Bright Moments held their physical art minting event at Gotham. An artist and software engineer called Ngozi also presented their 'Dream Logic' NFT collection at the NYC dispensary last month.&nbsp;</p>\n<p>Companies in California and Canada have already attempted to use the blockchain technology to track growth of the medicinal plants. Some artists have also created cannabis-themed NFT collections. One of the latest examples is Crypto Cannabis Club.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T20:01:02.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-28T20:00:51.000Z",
    "title": "XRP Ledger’s L2 Smart Contract Development Reaches Key Stage",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-ledgers-l2-smart-contract-development-reaches-key-stage/",
    "description": "Evernode, the XRP Ledger (XRPL) Layer 2 platform, has shared a series of updates on its journey toward launch, offering insights into its progress and the challenges it has faced. XRP Ledger Layer 2 Platform Audit Scheduled For Mid-August Evernode is a Layer 2 platform that seeks to bring smart contracts to the XRP Ledger ecosystem via Hooks. The platform is being developed by a team of experienced developers working to enhance the XRP Ledger network with advanced functionalities. Related Reading: Data Shows: Bitcoin Traders Going Long, Blast Above $30,000 Looming? In the first update, Evernode announced that the audit of their three hooks is tentatively scheduled to begin in mid-August. However, the team is still waiting for paperwork and funding from Ripple to confirm the audit, just like other XRPL Grants Grantees. In the second update, the Evernode team shared that the Nomad contract proved more challenging than expected. The contract did not persist on the betanet, which helped the development team identify bugs and areas for improvement. The team has been working hard to resolve these issues and remains optimistic that they will overcome the obstacles soon. Ultimately, Evernode appreciated the approximately 104 betahosts who have provided invaluable feedback in testing and improving the platform in a near-live environment. These updates highlight the complexity of developing a Layer 2 platform for XRP Ledger and the importance of thorough testing and auditing. It also emphasizes the dedication and hard work of the Evernode team throughout the development process. However, upon successful launch, Evernode&#8217;s platform will enable developers to build and deploy smart contracts on the XRP Ledger network, opening up new use cases and applications for the ecosystem. This will enable XRP Ledger to compete with other smart contract platforms such as Ethereum, which has gained significant traction in decentralized finance (DeFi). Moreover, Evernode&#8217;s platform will help drive the adoption of XRP Ledger by attracting more developers to the ecosystem. As the number of developers grows, the network&#8217;s capabilities will expand, leading to more use cases and applications, ultimately driving adoption and value. The development of Evernode&#8217;s Layer 2 platform for XRP Ledger is a significant milestone for the XRP Ledger community. It showcases the continued innovation and development within the ecosystem, which are critical for its growth and success. Related Reading: Bitcoin Rally May Not Resume Until This Happens Overall, Evernode&#8217;s updates on the progress toward launching a Layer 2 platform for XRP Ledger demonstrate the importance of rigorous testing and auditing in developing complex systems.  The successful launch of the platform will open up new opportunities for developers, potentially driving adoption and growth in the XRP Ledger ecosystem.  At the time of writing, XRP has encountered a sideways price movement since Monday. As the fourth largest cryptocurrency in the market regarding trading volume and market capitalization, it is currently trading at $0.7119, representing a decrease of 1.6% over the last 24 hours. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-28T20:00:35.000Z",
    "title": "Polkadot and Its Test Network Kusama Continue To Outrun Crypto Space in Terms of Development Activity: Santiment",
    "url": "https://dailyhodl.com/2023/07/28/polkadot-and-its-test-network-kusama-continue-to-outrun-crypto-space-in-terms-of-development-activity-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/polkadot-test-network-kusama.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/polkadot-test-network-kusama.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/polkadot-test-network-kusama.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/polkadot-test-network-kusama.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/polkadot-test-network-kusama.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/polkadot-test-network-kusama.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/polkadot-test-network-kusama.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Interoperability blockchain Polkadot (DOT) and its canary test network Kusama (KSM) continue to outrun the rest of the crypto space in terms of development activity, according to the crypto analytics firm Santiment. Santiment notes that Polkadot and Kusama both registered 527.7 notable GitHub commits in the past 30 days, leading all other crypto projects. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/28/polkadot-and-its-test-network-kusama-continue-to-outrun-crypto-space-in-terms-of-development-activity-santiment/\">Polkadot and Its Test Network Kusama Continue To Outrun Crypto Space in Terms of Development Activity: Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-28T19:55:19.000Z",
    "title": "Crypto Quant Analyst Does a Deep Dive Into Sam Altman’s Hot New Worldcoin (WLD) Project",
    "url": "https://dailyhodl.com/2023/07/28/crypto-quant-analyst-does-a-deep-dive-into-sam-altmans-hot-new-worldcoin-wld-project/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/10/biggest-exchange-hack.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/10/biggest-exchange-hack.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/10/biggest-exchange-hack.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/10/biggest-exchange-hack.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/10/biggest-exchange-hack.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/10/biggest-exchange-hack.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/10/biggest-exchange-hack.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The co-founder and CEO of CryptoQuant says that Sam Altman&#8217;s new altcoin project is &#8220;attempting to create colonies.&#8221; Crypto analyst Ki Young Ju tells his 327,800 Twitter followers that Open AI founder Sam Altman&#8217;s Worldcoin (WLD) project definitely has global aspirations. &#8220;The reason why English has become a global language is that the British Empire had many [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/28/crypto-quant-analyst-does-a-deep-dive-into-sam-altmans-hot-new-worldcoin-wld-project/\">Crypto Quant Analyst Does a Deep Dive Into Sam Altman’s Hot New Worldcoin (WLD) Project</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]