[
  {
    "source": "Crypto Briefing",
    "date": "2024-03-18T14:51:27.000Z",
    "title": "A new record: crypto products hit $2.9 billion in weekly inflows",
    "url": "https://cryptobriefing.com/crypto-weekly-inflows-record/",
    "description": "Record $2.9 billion inflows into digital assets this week, with Bitcoin comprising 97% of 2023's total inflows."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-18T14:41:31.000Z",
    "title": "Standard Chartered Foresees Bitcoin Soaring to $150K by Year End and Ethereum Surging to $14K by End of 2025",
    "url": "https://www.cryptoglobe.com/latest/2024/03/standard-chartered-foresees-bitcoin-soaring-to-150k-by-year-end-and-ethereum-going-to-14k-by-end-of-2025/",
    "description": "Standard Chartered has made headlines with its latest investment note, significantly adjusting its year-end Bitcoin (BTC) price forecast from $100,000 to an astounding $150,000. According to a report published by CoinDesk, citing “an emailed investment note” sent out earlier today, this revision reflects the bank’s growing optimism about Bitcoin’s value trajectory, further predicting that BTC […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-18T15:15:12.000Z",
    "title": "AI Tool Developed to Track Emerging COVID-19 Variants",
    "url": "https://www.cryptopolitan.com/ai-tool-to-track-emerging-covid-19-variants/",
    "description": "Researchers from The Universities of Manchester and Oxford have unveiled a groundbreaking artificial intelligence (AI) tool aimed at enhancing the detection and monitoring of new COVID-19 variants. This innovative approach, outlined in a study published in the journal PNAS, could revolutionize our ability to respond swiftly to emerging viral threats, potentially mitigating the impact of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-18T14:50:16.000Z",
    "title": "Controversy Surrounds STAR WARS Battlefront Classic Collection Release",
    "url": "https://www.cryptopolitan.com/controversy-surrounds-star-wars-battlefront/",
    "description": "The recent launch of the STAR WARS Battlefront Classic Collection by Aspyr Media has sparked significant controversy within the gaming community. Allegations have surfaced regarding the uncredited usage of mods developed by independent modders without acknowledgment or compensation.&#160; These claims have ignited a firestorm of criticism directed towards Aspyr Media, with notable figures within the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-18T14:47:21.000Z",
    "title": "India’s Unique Approach to AI Emphasizes Opportunities Over Risks",
    "url": "https://www.cryptopolitan.com/indias-unique-to-ai-emphasizes-over-risks/",
    "description": "India&#8217;s approach to artificial intelligence (AI) diverges from the predominant discourse in the West, focusing on the abundant opportunities rather than fixating on potential risks, emphasized Debjani Ghosh, the president of Nasscom, the apex body of the IT industry in India. Opportunity-centric approach Ghosh advocated for a distinct approach tailored to India&#8217;s context, highlighting the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-18T14:45:51.000Z",
    "title": "Drones Are Becoming More Than Just Flying Cameras With AI",
    "url": "https://www.cryptopolitan.com/drones-are-becoming-more-with-ai/",
    "description": "In the past, drones were seen as flying devices with cameras controlled remotely by people. However, they are gradually becoming much more advanced and intelligent with the infusion of AI technology. One could say that the integration of AI is essentially giving drones a brain. They&#8217;re no longer just flying machines; they&#8217;re becoming capable of [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-18T14:58:28.000Z",
    "title": "New Fezoo Coin attracts Ripple and Cardano investors",
    "url": "https://crypto.news/new-fezoo-coin-attracts-ripple-and-cardano-investors/",
    "description": "The capabilities of the new Fezoo Coin are already appealing to many cryptocurrency investors. Despite being in its presale stage, Fezoo attracts investors from traditional picks like Ripple and Cardano. #partnercontent"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-18T15:00:09.000Z",
    "title": "Shiba Inu Price Soars 10% In Reaction To Explosive 2,367% SHIB Burn Surge",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-price-soars-10-in-reaction-to-explosive-2367-shib-burn-surge/",
    "description": "Shiba Inu (SHIB), a prominent Ethereum-based cryptocurrency, witnessed a substantial rally, bolstering the interest of crypto enthusiasts worldwide. The nearly 10% surge in price on Monday has been attributed to a wave of market optimism, coinciding with a significant burn surge revealed by Shibburn, the meme coin&#8217;s burn tracker. The recent rally of meme coins can be attributed to various factors. Firstly, the growing market sentiment and excitement surrounding meme coins have attracted investors seeking high-risk, high-reward opportunities. Additionally, the influence of social media platforms, viral marketing, and endorsements from celebrities and influencers have played a significant role in driving up the prices of meme coins. Related Reading: Forget Dogecoin, Shiba Inu Set To Become The Top Dog: Expert Predicts $100 Billion Market Cap Shiba Inu Burn Surge Analysis According to Shibburn&#8217;s data, the burn rate for Shiba Inu skyrocketed by a staggering 2,367% over the past 24 hours, resulting in the destruction of a whopping 186 million coins. This surge in burning activity has further heightened market optimism surrounding the meme token, as the Shiba crypto community continues to make remarkable efforts to enhance the SHIB tokenomics. Source: Shibburn The continuous depletion of SHIB&#8217;s supply through burning activities has triggered discussions about the dynamics of supply and demand, igniting a hurricane of bullish sentiments for Shiba Inu. Notably, it is the community&#8217;s concerted efforts, including significant transfers to a dead wallet, that have primarily contributed to the rise in the burn rate. Shibburn&#8217;s insights shed light on two massive transactions by the Shiba crypto community, both involving transfers to a dead wallet. The first transaction saw a transfer of 168 million coins, while the second involved the transfer of 16.68 million SHIB. These actions reflect the community&#8217;s determination to bolster the tokenomics of Shiba Inu and have further contributed to the burn surge witnessed recently. Bitcoin price action. Chart: TradingView SHIB Price Climbs Amid Optimism The positive momentum extends beyond burning activity, as Shiba Inu&#8217;s price experienced a substantial uptick of 10% over the past 24 hours, reaching a current trading value of $0.0000287. This surge in price has been accompanied by a surge in trading volume by nearly 23% and a market cap increase of 10%, firmly establishing a bullish stance for SHIB. However, it is important to note that the recent correction in Bitcoin&#8217;s price led to a temporary dip for Shiba Inu, which reached a low of $0.0000238. Related Reading: Bitcoin Threatens To Retreat To $60,000 As Bulls Seek Solid Ground With the recent upward movement, there is growing optimism that SHIB may breach the $0.00003 mark, potentially paving the way for a recovery trend that could push prices above the previous swing high of $0.000045 and even surpass the $0.00005 milestone. Market observers are particularly encouraged by the burning chronicles of the meme coin, which further contribute to the prevailing market optimism. Featured image from Pexels, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-18T14:42:53.000Z",
    "title": "Crypto Tax Debate: Pakistan and IMF Wrangle Over Capital Gains Tax Implementation",
    "url": "https://www.crypto-news-flash.com/crypto-tax-debate-pakistan-and-imf-wrangle-over-capital-gains-tax-implementation/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-tax-debate-pakistan-and-imf-wrangle-over-capital-gains-tax-implementation",
    "description": "<img width=\"1792\" height=\"1024\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-28-18.21.38-Create-an-image-that-features-only-the-texts-IMF-Report-Fuels-XRP-Rally-Amid-Legal-Challenges-and-Spot-ETF-News-prominently-displayed.-The-backgro.webp\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-28-18.21.38-Create-an-image-that-features-only-the-texts-IMF-Report-Fuels-XRP-Rally-Amid-Legal-Challenges-and-Spot-ETF-News-prominently-displayed.-The-backgro.webp 1792w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-28-18.21.38-Create-an-image-that-features-only-the-texts-IMF-Report-Fuels-XRP-Rally-Amid-Legal-Challenges-and-Spot-ETF-News-prominently-displayed.-The-backgro-300x171.webp 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-28-18.21.38-Create-an-image-that-features-only-the-texts-IMF-Report-Fuels-XRP-Rally-Amid-Legal-Challenges-and-Spot-ETF-News-prominently-displayed.-The-backgro-1200x686.webp 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-28-18.21.38-Create-an-image-that-features-only-the-texts-IMF-Report-Fuels-XRP-Rally-Amid-Legal-Challenges-and-Spot-ETF-News-prominently-displayed.-The-backgro-768x439.webp 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-28-18.21.38-Create-an-image-that-features-only-the-texts-IMF-Report-Fuels-XRP-Rally-Amid-Legal-Challenges-and-Spot-ETF-News-prominently-displayed.-The-backgro-1536x878.webp 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-28-18.21.38-Create-an-image-that-features-only-the-texts-IMF-Report-Fuels-XRP-Rally-Amid-Legal-Challenges-and-Spot-ETF-News-prominently-displayed.-The-backgro-150x86.webp 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-28-18.21.38-Create-an-image-that-features-only-the-texts-IMF-Report-Fuels-XRP-Rally-Amid-Legal-Challenges-and-Spot-ETF-News-prominently-displayed.-The-backgro-450x257.webp 450w\" sizes=\"(max-width: 1792px) 100vw, 1792px\" />IMF advises Pakistan to expand its tax net to cover cryptocurrencies and real estate gains for increased revenue. Proposed measures include taxing gains from cryptocurrency investments and tightening regulations on real estate transactions. The International Monetary Fund (IMF) has issued a decisive call for Pakistan to implement capital gains tax (CGT) on cryptocurrency investments as [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-18T15:17:24.000Z",
    "title": "$10M Burned by Mistake: The $SLERF Token Presale Failure",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/10m-burned-by-mistake-the-slerf-token-presale-failure/",
    "description": "<p>Presale investors sent funds hoping to secure $SLERF, but their money vanished in a major presale mistake. This marked a catastrophic event in the coin&#8217;s early phase. Let&#8217;s discover more about the $SLERG token presale. $SLERF Presale Blunder: Funds Vanish in Digital Misstep This blunder sheds light on the inherent risks associated with token presales, [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/10m-burned-by-mistake-the-slerf-token-presale-failure/\">$10M Burned by Mistake: The $SLERF Token Presale Failure</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-18T14:49:40.000Z",
    "title": "An Introduction to the xRaise Wallet",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/an-introduction-to-the-xraise-wallet/",
    "description": "<p>A bull run is the perfect time to discover great projects that have been under the radar during the bear market. We’ve been covering a lot of awesome projects lately with huge potential. Our latest discovery, xRaise, is solving one of the biggest problems in Web3. In simple terms, xRaise is a smart contract wallet [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/an-introduction-to-the-xraise-wallet/\">An Introduction to the xRaise Wallet</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-18T14:46:54.000Z",
    "title": "Solana’s Daily Wallets Hit Record 2M, Signaling Major Growth",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/solanas-daily-wallets-hit-record-2m-signaling-major-growth/",
    "description": "<p>This milestone highlights Solana&#8217;s rising influence and user confidence in its technology. Solana stands out as a top platform for dApps, DeFi, and NFTs, thanks to its high speed and low fees. Solana: Speed and Affordability Drive dApp and DeFi Growth Surpassing 2 million daily active wallets reflects Solana&#8217;s growing impact and support for diverse [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/solanas-daily-wallets-hit-record-2m-signaling-major-growth/\">Solana&#8217;s Daily Wallets Hit Record 2M, Signaling Major Growth</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-18T14:53:00.000Z",
    "title": "Breaking Boundaries: Vanar Chain Joins Forces with NVIDIA Inception Program",
    "url": "https://coinedition.com/revolutionizing-blockchain-vanar-chain-and-nvidia-inception-join-forces/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Nvidia_cites_limited_visibility_into_crypto_minings_impact_on_Q2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Breaking Boundaries: Vanar Chain Joins Forces with NVIDIA Inception Program\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Nvidia_cites_limited_visibility_into_crypto_minings_impact_on_Q2.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Nvidia_cites_limited_visibility_into_crypto_minings_impact_on_Q2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Nvidia_cites_limited_visibility_into_crypto_minings_impact_on_Q2-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Nvidia_cites_limited_visibility_into_crypto_minings_impact_on_Q2-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Nvidia_cites_limited_visibility_into_crypto_minings_impact_on_Q2-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Vanar Chain and  NVIDIA Inception come together to elevate their technological capabilities. Vanar in synergy with NVIDIA to transform entertainment and mainstream blockchain adoption. Through NVIDIA Inception, Vanar gains access to vital resources required to create immersive experiences. Vanar Chain, a leading player in the blockchain arena, has announced its latest partnership with NVIDIA Inception [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/revolutionizing-blockchain-vanar-chain-and-nvidia-inception-join-forces/\">Breaking Boundaries: Vanar Chain Joins Forces with NVIDIA Inception Program</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]