[
  {
    "source": "Decrypt",
    "date": "2023-09-05T23:05:55.000Z",
    "title": "MrBeast-Promoted 'Creator League' Postponed After Gamers Bail Amid NFT Backlash",
    "url": "https://decrypt.co/155041/mrbeast-promoted-creator-league-postponed-after-gamers-bail-amid-nft-pushback",
    "description": "Influencers in the gaming league say they were misled about the blockchain aspect. Now eFuse is pausing the program and laying off staff."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T22:48:31.000Z",
    "title": "Base suffers first major outage since launch",
    "url": "https://cointelegraph.com/news/coinbase-base-network-major-outage",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/cca0a5d8-3cc8-4c4a-821b-248679c2d27d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Block production on Base abruptly halted for 43 minutes as developers rushed to implement a fix. </p>\n                    <p><p>Coinbase's Ethereum layer-2 network Base has suffer its first major outage since its public launch on Aug. 9. </p><p>For approximately 45 minutes on Sept. 5, no new blocks were produced on the Base chain. Its developers first identified the \"stalled\" block production at 9:36 pm UTC, according to the Base status <a href=\"https://status.base.org/\" target=\"_blank\" rel=\"noopener nofollow\">site</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/ea79785a-bea3-4023-a27a-cfdbd0bb9748.png\"  /><figcaption style=\"text-align: center;\"><em>Block production on the Base network stalled at 9:36pm Sept. 5. Source: BaseScan</em></figcaption></figure><p>“We identified a delay in block production due to part of our internal infrastructure requiring a refresh. We’ve implemented a fix and are seeing widespread recovery,” Coinbase told Cointelegraph in response to a query on the outage. </p><p>Base claims the issue has since been identified with the team now deployed a fix which has seen a \"widespread recovery\" of block production. It's continuing to monitor the chain for further issues. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/d3a58d39-f921-405b-9ca5-f83cc5f08112.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Base developers said the cause of the outage has been identified and fixed. Source: Base</em></figcaption></figure><p>Matt Willemsen, head of research at crypto education platform Collective Shift, highlighted the differences in using Ethereum's Layer 2 networks and claimed they aren't as \"battle tested\" as Ethereum's mainnet.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Coinbase&#39;s Base chain just had its first major outage, lasting for 43 minutes. Blocks have just started to be produced again.<br><br>Another reminder that using Ethereum L2s (e.g. Arbitrum One, OP Mainnet, zkSync Era, Base) is NOT the same as using Ethereum mainnet, which is more… <a href=\"https://t.co/JbUNQUGNwu\">pic.twitter.com/JbUNQUGNwu</a></p>&mdash; Matt Willemsen (@matt_willemsen) <a href=\"https://twitter.com/matt_willemsen/status/1699185849546744222?ref_src=twsrc%5Etfw\">September 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/joe-lubin-the-truth-about-eth-founders-split-and-crypto-google/\">Joe Lubin — The truth about ETH founders split and ‘Crypto Google’</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T22:40:17.000Z",
    "title": "Crypto bull run predicted by Bernstein because of this",
    "url": "https://www.cryptopolitan.com/crypto-bull-run-predicted-by-bernstein/",
    "description": "The winds of change are sweeping through the cryptocurrency landscape. With the dust settling from Grayscale&#8217;s pivotal court victory against the SEC, there&#8217;s a palpable shift in the dynamics of the market. And it&#8217;s not just the casual trader who&#8217;s watching this space; the titans of institutional finance are taking center stage. The Rise of ... <a title=\"Crypto bull run predicted by Bernstein because of this\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-bull-run-predicted-by-bernstein/\" aria-label=\"More on Crypto bull run predicted by Bernstein because of this\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-05T23:00:13.000Z",
    "title": "Ethereum Whales Send $486 Million To Coinbase, Time To Exit?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-whales-exit/",
    "description": "Ethereum has seen the price of its native token ETH drop alongside Bitcoin as the bear market continues to gain group. This has triggered fear among investors, leading to high selling pressure on the digital asset. Even the Ethereum whales are now dancing to the tune of the bear market as they have begun to send large amounts of ETH to centralized exchanges. Ethereum Whales Push Toward Selling A recent Santiment report posted on the X (formerly Twitter) platform has shown that Ethereum whales may be looking to exit stage left at this time. The chart which was posted by the on-chain data tracker shows that whales were moving 300,000 ETH to centralized exchange Coinbase. Related Reading: Why The Shiba Inu Price Cannot Realistically Get To $0.001 The transfer took place across two transactions carrying 150,000 ETH each. At the time, each of the transactions was carrying ETH worth $243 million to the exchange. So in total, both transactions saw a total of $486 million in ETH moved to Coinbase. Whales send 300,000 ETH to Coinbase &#124; Source: Santiment on X Despite being such closely watched transactions, there have been no indications of what the whales intend to do. Usually, coins moving toward centralized exchanges means sell-offs, especially for large investors, who do so to minimize the impact of their selling as much as possible. However, the price of Ethereum is still trading close to where it was on Monday, and if these whales were looking to sell, then such activities would’ve led to a fast plunge in the price of ETH. There is also the fact that once the ETH was transferred to Coinbase’s hot wallet, they would be further broken down into smaller chunks of 4,282 ETH, which were then moved to other wallets. But even this doesn’t paint a clear picture of why the ETH was moved to Coinbase in the first place. Bears Take Over With Negative Sentiment The selling pressure that the Ethereum price has been under recently has not come out of nowhere. The Crypto Fear &#38; Greed Index had moved into the fear territory following the market crash. This meant that investors were more likely to sell their holdings than put new money into the market. Related Reading: On-chain Sleuth Potentially Unveils Shiba Inu Founder With Shocking Affiliates For ETH, it has now become a battle for the bulls given that the bears have successfully dragged the price below the 50-day moving average. This points toward more bearish momentum for the asset in the short term. However, it is not all bad. ETH price maintains $1,600 despite large transactions &#124; Source: ETHUSD on Tradingview.com Usually, when indicators have dropped so low, it can often be a bounce-off point for a recovery. So while ETH may be looking toward more bear movement for the near term, the digital asset could be close to another rally, possibly pushing its price above $1,700 once more. ETH’s price is changing hands at $1,624 at the time of this writing. It’s down 0.90% and 1.31% on the daily and weekly charts, respectively. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-05T22:48:00.000Z",
    "title": "Stablecoins Are The True Killer App of Crypto, Says Peter Johnson",
    "url": "https://coinedition.com/stablecoins-are-the-true-killer-app-of-crypto-says-peter-johnson/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/Despite_the_bear_market_in_2022_stablecoins_on_several_Layer_1s-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Co-Head of Venture Investments at Brevean Howard Digital Peter Johnson, stablecoins like Tether (USDT) and USD Coin (USDC) are evolving into the &#8220;killer app&#8221; of cryptocurrency. In a recent video interview with Anthony Pompliano, Johnson analyzed data showing relentless growth in stablecoin adoption despite market conditions. While volatility limits cryptocurrencies like Bitcoin for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/stablecoins-are-the-true-killer-app-of-crypto-says-peter-johnson/\">Stablecoins Are The True Killer App of Crypto, Says Peter Johnson</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]