[
  {
    "source": "Cointelegraph",
    "date": "2023-08-11T04:45:58.000Z",
    "title": "Bitcoin ETFs to push US slice of crypto ETF trading volume to 99.5% — Analyst",
    "url": "https://cointelegraph.com/news/bitcoin-spot-push-us-trading-volumes-crypto-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/ce7b4ea7-1065-43c7-9c89-1c453302023f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Approval of spot Bitcoin ETFs in the United States will likely push the country's share of crypto ETF trading volumes even higher, says a Bloomberg analyst.</p>\n                    <p><p>The United States could make up for 99.5% of the global trading volume for crypto-related exchange-traded funds (ETF) — but only if spot Bitcoin ETFs are approved, according to a Bloomberg ETF analyst.</p><p>Currently, North America accounts for 97.7% of all crypto ETF trading volume, Bloomberg senior ETF analyst Eric Balchunas <a href=\"https://twitter.com/EricBalchunas/status/1689656052483010560\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> in an Aug. 10 X (Twitter) post. </p><p>“If/when spot ETFs come out in the U.S. this will likely go to like 99.5%,” he speculated. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/c4efccc9-811b-45d8-9040-1aa67319daad.jpg\"  /><figcaption style=\"text-align: center;\"><em>Global crypto ETF trading volume: Source: Eric Balchunas on X (Twitter)</em></figcaption></figure><p>There is currently a long list of spot Bitcoin ETF applications awaiting approval from the Securities and Exchange Commission. The regulator is scheduled to give its decision on Ark Invest’s and 21Share’s joint ARKB fund by Aug. 13, though a delay has been widely expected. </p><p>During a Bloomberg interview on Aug. 7, Ark CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/cathie-wood\">Cathie Wood</a> <a href=\"https://cointelegraph.com/news/cathie-wood-predicts-sec-simultaneously-allowing-multiple-spot-crypto-etf\">speculated</a> the regulator could be waiting to approve multiple funds at the same time. </p><p>On Aug. 10 Bitwise filed an updated prospectus to change its BITC fund from a Bitcoin futures ETF to the \"Bitwise Bitcoin and Ether Equal Weight Strategy ETF\". The move mirrors one by Valkyrie on Aug. 5 changing its BTC Futures ETF (BTF) to include Ethereum Futures.</p><p>“Cannonball Run in effect,” <a href=\"https://twitter.com/EricBalchunas/status/1689748662954364929\" target=\"_blank\" rel=\"noopener nofollow\">commented</a> Balchunas on Aug. 11. </p><h3>Crypto-related ETFs top performance charts</h3><p>Meanwhile, Balchunas also noted that the top 15 exchange-traded funds in terms of performance all have exposure to crypto and blockchain. </p><blockquote>“Every single one of the Top 15 best-performing equity ETFs this year is crypto-related.”</blockquote><p>The <a href=\"https://cointelegraph.com/news/valkyrie-submits-btc-spot-etf-application-to-go-with-its-futures-miners-etfs\">Valkyrie</a> Bitcoin Miners ETF was the top performer with a return of 227% since the beginning of 2023. WGMI is an actively managed fund available through Nasdaq that invests in public companies in the Bitcoin mining industry such as Marathon Digital, Riot, and Cipher Mining.</p><p>Many of the top-listed mining firms have seen their stocks outperform Bitcoin this year which could explain the stellar performance of products such as WGMI.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-approval-chances-65\"><strong><em>ETF analyst raises spot Bitcoin ETF approval chances in the US to 65%</em></strong></a></p><p>The VanEck digital transformation ETF was second on the list with a return of 182% so far this year. The DAPP fund also tracks a number of crypto mining and technology firms. These include Coinbase, MicroStrategy, Galaxy Digital, Canaan, and Hive. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Every single one of the Top 15 best performing equity ETFs this year is crypto-related. <a href=\"https://twitter.com/search?q=%24WGMI&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$WGMI</a> leading way w +227%. Finally attracting flows too, altho pretty modest considering these perf numbers. This is part of our monthly Crypto ETF Report via <a href=\"https://twitter.com/JSeyff?ref_src=twsrc%5Etfw\">@JSeyff</a> &amp; <a href=\"https://twitter.com/SirYappityyapp?ref_src=twsrc%5Etfw\">@SirYappityyapp</a> <a href=\"https://t.co/iPIHhH82Jr\">pic.twitter.com/iPIHhH82Jr</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1689655154470232064?ref_src=twsrc%5Etfw\">August 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Other leading crypto-related ETPs included the Global X Blockchain ETF (BKCH) with 168% YTD, Bitwise Crypto Industry Innovators ETF (BITQ) also returning 168%, and Invesco’s Alerian Galaxy Crypto Economy ETF (SATO) with 162% so far in 2023. </p><p><strong><em>Asia Express: <a href=\"https://cointelegraph.com/magazine/chinas-risky-bitcoin-court-decision-is-huobi-in-trouble-or-not-asia-express/\">China’s risky Bitcoin court decision, is Huobi in trouble or not?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-08-11T05:00:00.000Z",
    "title": "Polkadot to change parachain auctions, investors exploring DigiToads’ potential",
    "url": "https://crypto.news/polkadot-to-change-parachain-auctions-investors-exploring-digitoads-potential/",
    "description": "Polkadot's parachain auctions are shifting to a space-based model while investors are exploring opportunities in DigiToads "
  }
]