[
  {
    "source": "CryptoSlate",
    "date": "2023-11-23T12:02:28.000Z",
    "title": "After FTX shock, Bitcoin holders brace for the long haul with record dormancy",
    "url": "https://cryptoslate.com/insights/after-ftx-shock-bitcoin-holders-brace-for-the-long-haul-with-record-dormancy/",
    "description": "<p>Quick Take Over 70% of the existing Bitcoin supply has remained unmoved for a year, marking a significant rise. This uptick is primarily attributed to the wave of buyers who emerged after the FTX collapse in November last year when Bitcoin fell to $15,500. The 14-day change in this unmoved supply is one of the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/after-ftx-shock-bitcoin-holders-brace-for-the-long-haul-with-record-dormancy/\">After FTX shock, Bitcoin holders brace for the long haul with record dormancy</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-23T12:08:10.000Z",
    "title": "Altcoins take a breather as Bitcoin stalls at resistance",
    "url": "https://cryptodaily.co.uk/2023/11/altcoins-take-a-breather-as-bitcoin-stalls-at-resistance",
    "description": "Altcoins are struggling to continue their increase of the last day, and look to be on pause, as bitcoin decides whether it can break the big resistance at $38,000."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-23T11:44:41.000Z",
    "title": "Evernode Announces Airdrop For XRP Holders, Sets Launch Date",
    "url": "https://www.newsbtc.com/xrp-news/evernode-airdrop-xrp-holders-launch-date/",
    "description": "Evernode, a layer-2 network developed on the XRP Ledger (XRPL), has recently provided crucial updates concerning its airdrop for XRP holders. The project, which integrates smart contract capabilities with XRPL, has revised its launch to December 18, 2023, following technical challenges. On the same day, the airdrop is expected to take place. Evernode Launch Date Announced The revised launch date of December 18, 2023, is primarily due to delays with the XUMM wallet’s integration in supporting account cloning on the Xahau network. This network is a recent addition as a sidechain to the XRPL. Situated within this new framework is Evernode, a pioneering project on Xahau. Evernode is the first major project built on Xahau, marking the first major initiative developed using the Hooks feature that Xahau introduces to the broader XRP Ecosystem. Regarding the launch, Evernode stated, “We’re now targeting launch on 18 December 2023&#8230; XUMM has been unexpectedly delayed in supporting the cloning of XRPL Accounts on Xahau. We can’t finalize our airdrop until this happens. We believe this will be ready by 18 December, but it is obviously beyond our control and may still change.” Related Reading: Ripple Integration With ISDA Ushers In $1.2 Quadrillion Market, Can XRP Breach $100? Besides that, Evernode informed the community about a notable achievement. The project’s three Hooks have been successfully audited, an important milestone in ensuring the network&#8217;s security and functionality. Additionally, the project has established the Xahau address for issuing Evers tokens: rEvernodee8dJLaFsujS6q1EiXvZYmHXr8. For users and airdrop participants, it is crucial to verify this address to avoid scams. Snapshot Details And Eligibility For XRP Holders The airdrop&#8217;s eligibility was determined by a snapshot taken on September 1, 2023, at Ledger #82237135. This snapshot recorded the XRP balances on the mainnet at 6:00 PM AEST (8:00 AM UTC). Eligibility for the airdrop includes XRP holders who held up to 50,000 XRP in a non-custodial wallet or used Bitrue or Uphold at the snapshot time. Related Reading: Pro-XRP Lawyer Deaton Picks His Top 10 Cryptos For The Year Ahead Evers tokens will be airdropped into the Xahau account based on XRP holdings in the corresponding XRPL account on the snapshot date. Moreover, the projects’ update further mentioned the commencement of the &#8220;formal process&#8221; of airdrop preparation on November 27, along with the promise of a tool to assist users in registering and calculating their Evers token allocation based on XRP holdings at the time of the snapshot. The Evers token (EVRS) has a maximum supply of 72,253,440. The airdrop will distribute 20,643,840 Evers among various stakeholders, including 5,160,960 to XRP holders, 5,160,960 to founders, 5,160,960 to beta testers, and 5,160,960 to the Evernode project itself. The remaining 51,609,600 EVRS tokens will be held inside the Evernode Registry Hook. They will be distributed as rewards to hosts in 10 epochs of 5,160,960 Evers over 118 years. Evernode&#8217;s launch is anticipated to be a major addition to the XRPL ecosystem. The introduction of a layer-2 network and sidechain could expand development possibilities, leading to more advanced dApps and potentially increasing user engagement with XRPL. At press time, the XRP price has posted a bullish breakout from its downtrend channel in the shorter timeframe, trading at $0.6185. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-23T11:52:43.000Z",
    "title": "BlackRock and Ark Invest Seek Tax Savings for Investors in Bitcoin ETF Talks with SEC",
    "url": "https://www.crypto-news-flash.com/blackrock-and-ark-invest-seek-tax-savings-for-investors-in-bitcoin-etf-talks-with-sec/?utm_source=rss&utm_medium=rss&utm_campaign=blackrock-and-ark-invest-seek-tax-savings-for-investors-in-bitcoin-etf-talks-with-sec",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Nate Geraci, ETF expert, expects low demand for Ethereum futures ETFs but sees potential in combined BTC+ETH futures ETFs. \" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />BlackRock and Ark Invest are advocating for in-kind redemptions in their proposed Bitcoin ETFs, potentially offering tax benefits for investors. The SEC&#8217;s stance on cash redemptions is a critical point in the ongoing discussions about the structure and operation of Bitcoin ETFs. The pursuit of a spot Bitcoin exchange-traded fund (ETF) has brought asset managers [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-23T11:40:51.000Z",
    "title": "MATIC Slips Below Critical Area, Making a Way for Bears to Strike",
    "url": "https://coinedition.com/matic-slips-below-critical-area-making-a-way-for-bears-to-strike/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Massive-Transfers-of-MATIC-from-Robinhood-to-Coinbase-and-Binance.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Massive Transfers of MATIC from Robinhood to Coinbase and Binance\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Massive-Transfers-of-MATIC-from-Robinhood-to-Coinbase-and-Binance.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Massive-Transfers-of-MATIC-from-Robinhood-to-Coinbase-and-Binance-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Massive-Transfers-of-MATIC-from-Robinhood-to-Coinbase-and-Binance-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto analyst Ali Martinez posted that Polygon (MATIC) has dropped below a vital supply as the token price dropped to $0.77. Martinez, in his post on X, noted that the $0.84 to $0.86 zone marked the threshold where a substantial number of addresses had accumulated approximately 4.13 billion MATIC. The analyst also added that if [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/matic-slips-below-critical-area-making-a-way-for-bears-to-strike/\">MATIC Slips Below Critical Area, Making a Way for Bears to Strike</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]