[
  {
    "source": "Decrypt",
    "date": "2024-04-09T00:01:02.000Z",
    "title": "Ethereum Card Game 'Gods Unchained' Crosses Over With 'Guild of Guardians' in New Expansion",
    "url": "https://decrypt.co/225331/ethereum-game-gods-unchained-crossover-guild-guardians-expansion",
    "description": "The new Gods Unchained expansion, Dread Awakening, is a mash-up with Immutable’s upcoming Guild of Guardians franchise."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-08T23:58:22.000Z",
    "title": "Ethereum-based products record negative outflows for the fourth consecutive week",
    "url": "https://www.cryptopolitan.com/ethereum-prodct-negative-outflow-fourth-week/",
    "description": "Ethereum-based crypto investment products have witnessed a negative outflow for the fourth week in a row. According to data from CoinShares, Ethereum saw a $22.5 million worth of outflow last week with most altcoins experiencing an opposite trend. The report found that other crypto-based investment products experienced positive inflows. Ethereum-based investment products record negative outflows [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-08T23:48:57.000Z",
    "title": "Detained Binance official in Nigeria denies money laundering accusations: Report",
    "url": "https://www.cryptopolitan.com/binance-official-denies-money-laundering/",
    "description": "A senior official at Binance, Tigran Gambaryan, was reported to have pled not guilty to allegations of money laundering in a recent court appearance, said a local media report Legal challenges for Binance executives in Nigeria Gambaryan was detained in Nigeria since February together with his colleague Nadeem Anjarwalla, following the claim by Nigerian authorities [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-09T00:05:39.000Z",
    "title": "Crypto Expert Reveals What To Expect For Bitcoin, Dogecoin, And XRP In 12-16 Months",
    "url": "https://www.newsbtc.com/analysis/xrp/bitcoin-dogecoin-xrp-months/",
    "description": "Crypto expert Ash Crypto has outlined his price predictions for several crypto tokens, including Bitcoin (BTC), Dogecoin (DOGE), and XRP, heading into this bull run. He also suggested that these price levels could be attained in the next 12 to 16 months.  How High Will Bitcoin, Dogecoin, And XRP Rise? Ash Crypto predicted in an X (formerly Twitter) that BTC would rise between $100,000 and $250,000 by 2025. This prediction aligns with those made by other notable crypto analysts. One of them is Skybridge Capital CEO Anthony Scaramucci, who predicted in January that Bitcoin would rise to $170,000 18 months after the Bitcoin Halving. Related Reading: Ripple CEO Makes Bold Prediction For Crypto Market – $5 Trillion In 2024 Source: X Meanwhile, some other crypto analysts will argue that Bitcoin hitting $100,000 could even happen this year rather than 2025. This includes Tom Dunleavy, the Chief Investment Officer (CIO) at MV Capital, who claims that Bitcoin will rise to $100,000 by the end of this year. Tom Lee, Managing Partner and Head of Research at Fundstrat Global Advisors, also predicted that Bitcoin would rise to as high as $150,000 this year.  Regarding his price target for DOGE, Ash Crypto predicted that the meme coin would rise to $1 in the next 12 to 16 months. This prediction is also a common sentiment shared by several other crypto analysts and members of the crypto community. Specifically, crypto analyst DonAlt once mentioned that “it isn’t too unlikely for Dogecoin to go to $1,” while crypto analyst Altcoin Sherpa stated that DOGE could do “something silly like go to $1 this cycle eventually.” Ash Crypto also shared his price target for XRP, stating that the crypto token could rise between $3 and $5. This price prediction, however, seems conservative, considering other predictions that crypto analysts have made for the XRP token.  Crypto analyst CrediBULL Crypto recently mentioned that XRP could rise to as high as $20 in this market cycle. Meanwhile, Crypto analyst Egrag Crypto has repeatedly stated that XRP hitting $27 is possible. Undervalued Altcoins Make The List Crypto expert Michaël van de Poppe recently included Chainlink (LINK), Celestia (TIA), and Polkadot (DOT) in a list of ten crypto tokens he believes are undervalued. Interestingly, these three altcoins also made their way into Ash Crypto’s list of coins, for which he outlined price targets.  Related Reading: $115-Million Bitcoin Whale Wakes Up From 10-Year Slumber – What’s Next? For LINK, Ash Crypto predicted that the crypto token could rise to between $250 and $500 by next year. LINK’s rise to such levels would undoubtedly be massive, considering it currently trades at around $17. Ash Crypto also predicted a parabolic surge in TIA and DOT’s prices, as he believes they could rise to as high as $150 and $120, respectively.  DOGE price rises above $0.2 resistance &#124; Source: DOGEUSDT on Tradingview.com Featured image from CoinGape, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-04-09T00:00:23.000Z",
    "title": "Trader Predicts Fresh Rallies for Dogecoin and One Ethereum-Based Altcoin, Updates Outlook on Two Crypto Assets",
    "url": "https://dailyhodl.com/2024/04/08/trader-predicts-fresh-rallies-for-dogecoin-and-one-ethereum-based-altcoin-updates-outlook-on-two-crypto-assets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Crypto-Different-Than-Other.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Crypto-Different-Than-Other.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Crypto-Different-Than-Other.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Crypto-Different-Than-Other.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Crypto-Different-Than-Other.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Crypto-Different-Than-Other.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Crypto-Different-Than-Other.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto strategist believes that top meme token Dogecoin (DOGE) looks bullish even after last week&#8217;s marketwide correction. Pseudonymous analyst Altcoin Sherpa tells his 214,100 followers on the social media platform X that DOGE has managed to stay above a key support level on the weekly chart even after dropping to a seven-day [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/04/08/trader-predicts-fresh-rallies-for-dogecoin-and-one-ethereum-based-altcoin-updates-outlook-on-two-crypto-assets/\">Trader Predicts Fresh Rallies for Dogecoin and One Ethereum-Based Altcoin, Updates Outlook on Two Crypto Assets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]