[
  {
    "source": "CryptoSlate",
    "date": "2023-09-07T22:20:07.000Z",
    "title": "JP Morgan considering a new blockchain-based settlement token",
    "url": "https://cryptoslate.com/jp-morgan-considering-a-new-blockchain-based-settlement-token/",
    "description": "<p>JP Morgan Chase &#38; Co. could soon create a new blockchain-based digital deposit token, according to reports from Bloomberg on Sept. 7. The new token would allow for faster cross-border payments and settlements. In fact, JP Morgan has reportedly built the infrastructure needed to handle transactions for the token, based on statements from anonymous sources [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/jp-morgan-considering-a-new-blockchain-based-settlement-token/\">JP Morgan considering a new blockchain-based settlement token</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-07T22:30:00.000Z",
    "title": "$XRP Ledger to Boost Transaction Throughput to 3,400 TPS with Upcoming Upgrades",
    "url": "https://www.cryptoglobe.com/latest/2023/09/xrp-ledger-to-boost-transaction-throughput-to-3400-tps-with-upcoming-upgrades/",
    "description": "The transaction throughput of the $XRP Ledger is set to soon surge from around 1,500 transactions per second to an impressive 3,400 transactions per second (TPS), bolstered by upgrades that are soon set to be deployed. The transaction throughput’s upcoming increase was first spotted by Kevin Cage, an Investment Advisor at Iron Key Capital, who […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-07T22:25:39.000Z",
    "title": "SBF’s Ryan Salame will plead guilty in FTX case",
    "url": "https://www.cryptopolitan.com/sbfs-ryan-salame-will-plead-guilty-ftx-case/",
    "description": "In a not-all-that-dramatic twist to the cryptocurrency saga that has captivated Wall Street, former FTX executive Ryan Salame is set to publicly admit guilt this week. This development is happening right on the eve of the much-anticipated trial against FTX founder Sam Bankman-Fried. The Dominoes Start to Fall Salame&#8217;s admission of guilt is not the ... <a title=\"SBF&#8217;s Ryan Salame will plead guilty in FTX case\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sbfs-ryan-salame-will-plead-guilty-ftx-case/\" aria-label=\"More on SBF&#8217;s Ryan Salame will plead guilty in FTX case\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-07T22:10:42.000Z",
    "title": "Survey reveals the exact salary Americans need for comfort",
    "url": "https://www.cryptopolitan.com/the-exact-salary-americans-need-for-comfort/",
    "description": "The gnawing feeling of financial anxiety, the constant tossing and turning in the dead of night, fearing the looming student loan payments, and skyrocketing credit card balances. These are the dark thoughts 3 out of 4 Americans grapple with, thanks to our fragile economy. So, just how much do Americans need to shelve those worries ... <a title=\"Survey reveals the exact salary Americans need for comfort\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-exact-salary-americans-need-for-comfort/\" aria-label=\"More on Survey reveals the exact salary Americans need for comfort\">Read more</a>"
  }
]