[
  {
    "source": "Decrypt",
    "date": "2023-07-18T17:49:13.000Z",
    "title": "Bitcoin Cools and Drops Below $30,000—But XRP, Chainlink Surging",
    "url": "https://decrypt.co/149014/bitcoin-cools-and-drops-below-30000-but-altcoins-xrp-link-surge",
    "description": "Bitcoin has again dropped below $30,000 per coin. But these altcoins are surging. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-18T18:01:30.000Z",
    "title": "Bitcoin rally will lead to \"speculative blow-off top\" in 2024, Mark Yusko predicts. ",
    "url": "https://cointelegraph.com/news/bitcoin-btc-rally-will-lead-speculative-blow-off-top-in-2024-mark-yusko-predicts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/0922dda6-1366-418d-a9c6-b82e8d43ffd7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BlackRock's application for a spot Bitcoin ETF have kicked off the next Bitcoin bull run which will culminate in 2024 with a speculative parabolic run, according to Morgan Creek Capital CIO, Mark Yusko. </p>\n                    <p><p>BlackRock’s application for a Bitcoin ETF has sparked the beginning of a new crypto bull market, which will go parabolic at some point closer to the halving scheduled for April 2024, according to Mark Yusko, the CIO and Founder of Morgan Creek Capital. </p><p>“Based on Metcalfe's law model, fair value for Bitcoin is around $55K. So I think we drift upwards toward that level”, said Yusko in a recent interview with Cointelegraph. \"</p><p>After that, Yusko predicts, speculators will come into the market en masse pushing the Bitcoin price beyond its fair value to new all time highs. </p><p>\"We probably will have a speculative blow off top sometime in 2024. That leads to the next downturn and the next crypto winter\", Yusko predicts. </p><p>Yusko is highly confident that BlackRocks’s Bitcon ETF application will be approved by the SEC, thus becoming one of the catalysts for the next parabolic bull run. </p><p>“I think it's a done deal. I think it's been a done deal for years. They've just been waiting for the right time,\" he said, commenting on the application. </p><p>To find out more about Yusko’s Bitcoin price outlook for the next months, don’t miss the full interview and subscribe to our YouTube channel! </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/XkC4Gm5u5qM\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-18T18:00:50.000Z",
    "title": "Coinbase CEO will meet with US lawmakers to discuss crypto legislation: Report",
    "url": "https://cointelegraph.com/news/coinbase-ceo-meet-lawmakers-discuss-crypto-legislation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/cead3c0e-87ac-4c92-ab96-d4f795dd2724.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto exchange is currently involved in a legal battle with the U.S. Securities and Exchange Commission over allegedly offering unregistered securities. </p>\n                    <p><p>Brian Armstrong, the CEO of United States-based cryptocurrency exchange Coinbase, is reportedly planning to meet with members of Congress to discuss digital asset legislation and related issues.</p><p>According to a July 17 Bloomberg report, Armstrong <a href=\"https://www.bloomberg.com/news/articles/2023-07-17/coinbase-ceo-brian-armstrong-set-to-meet-with-house-democrats\" target=\"_blank\" rel=\"noopener nofollow\">has</a> a scheduled meeting with the New Democrat Coalition, a group of roughly 100 Democrats in the House of Representatives focused on advancing “innovative, inclusive, and forward-looking policies”. The Coinbase CEO will reportedly speak with the lawmakers on digital asset legislation as well as how the technology could potentially impact national security, privacy and the climate.</p><p>The meeting, reportedly to be held behind closed doors on July 19, will come amid different proposals in the House and Senate to legislate different aspects of the crypto space. On July 12, Senators Cynthia Lummis and Kirsten Gillibrand reintroduced legislation aimed at <a href=\"https://cointelegraph.com/news/senators-reintroduce-crypto-bill-comprehensive-regulation\">creating a comprehensive regulatory framework</a> for digital assets, while lawmakers in the House Financial Services Committee are currently considering a draft of a market structure bill.</p><p>Coinbase is currently <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">involved in a legal battle</a> with the U.S. Securities and Exchange Commission over the exchange allegedly offering unregistered securities. The two parties <a href=\"https://cointelegraph.com/news/what-to-expect-from-coinbase-sec-first-hearing\">had their first pre-motion hearing</a> on July 13.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Good questions. <a href=\"https://t.co/zNO6OxQRNu\">https://t.co/zNO6OxQRNu</a></p>&mdash; Faryar Shirzad (@faryarshirzad) <a href=\"https://twitter.com/faryarshirzad/status/1681317541363486722?ref_src=twsrc%5Etfw\">July 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinbase-pauses-staking-services-following-regulators-orders\"><strong><em>Coinbase pauses staking services in four US states following regulators’ orders</em></strong></a></p><p>As an industry leader, Armstrong has previously <a href=\"https://cointelegraph.com/news/coinbase-ceo-invites-dc-residents-over-for-ice-cream-and-crypto-talk\">called for discussions</a> between U.S. lawmakers and Coinbase following the crypto market crash and the events surrounding FTX. The CEO said the exchange would be <a href=\"https://cointelegraph.com/news/coinbase-ceo-calls-for-action-in-electing-pro-crypto-lawmakers-following-sec-wells-notice\">calling on crypto users</a> to “elect pro-crypto candidates” across the United States — the country will have a presidential election in 2024.</p><p>Cointelegraph reached out to Coinbase for comment, but did not receive a response at the time of publication.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/binance-coinbase-head-to-court-and-the-sec-labels-67-crypto-securities-hodlers-digest-june-4-10/\"><strong><em>Binance, Coinbase head to court, and the SEC labels 67 crypto-securities: Hodler’s Digest, June 4-10</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-18T17:39:38.000Z",
    "title": "Bitcoin’s unique correlation profile suggests an emerging pattern in financial landscapes",
    "url": "https://cryptoslate.com/insights/bitcoins-unique-correlation-profile-suggests-an-emerging-pattern-in-financial-landscapes/",
    "description": "<p>Quick Take A review of year-to-date data demonstrates a clear trend of decreasing correlation between Bitcoin and major assets. This finding is in accordance with Ecoinometrics&#8216; analytics, highlighting a sustained monthly trend of Bitcoin diverging from traditional financial assets. Key examples of this trend include significant assets like the S&#38;P 500, Gold (XAU), Nasdaq, Eurodollar, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-unique-correlation-profile-suggests-an-emerging-pattern-in-financial-landscapes/\">Bitcoin&#8217;s unique correlation profile suggests an emerging pattern in financial landscapes</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-18T18:01:47.000Z",
    "title": "UK’s FCA Could Soon Make Crypto Boring",
    "url": "https://cryptobriefing.com/uks-fca-could-soon-make-crypto-boring/?utm_source=feed&utm_medium=rss",
    "description": "The Financial Conduct Authority (FCA) in the UK has identified a new area of potential regulatory concern: cryptocurrency memes. The financial watchdog warned that non-compliant crypto memes might not just..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-18T18:00:00.000Z",
    "title": "Chainlink Debuts CCIP Across Multiple Mainnets $LINK",
    "url": "https://cryptodaily.co.uk/2023/07/chainlink-debuts-ccip-across-multiple-mainnets-link",
    "description": "<p class=\"md-end-block md-p\">Chainlink has launched its Cross-Chain Interoperability Protocol (CCIP) for early adopters, with a full roll-out soon to follow. The protocol is designed to serve and facilitate cross-chain transactions across a number of blockchains currently operating from within and alongside the Ethereum and EVM ecosystems.</p>\n<p class=\"md-end-block md-p\">Notably, this innovative protocol is now live on several major blockchain platforms, namely Avalanche, Ethereum, Optimism, and Polygon. </p>\n<p class=\"md-end-block md-p\">The integration of this service has already stimulated the market, evidenced by the near 10% uptick in the price of Chainlink's native token, LINK, which soared to a high of $7.30 in the wake of the announcement.</p>\nBoosting Blockchain Connectivity with CCIP\n<p class=\"md-end-block md-p\">Earlier this week, Chainlink's official blog post unveiled the CCIP's early access availability on multiple blockchain platforms. This development not only enhances the potential for interconnectivity among various blockchain ecosystems but also empowers developers by providing a robust platform to create custom cross-chain solutions.</p>\n<p class=\"md-end-block md-p\">A key advantage that the CCIP brings to the table is its \"Simplified Token Transfers\" feature. This functionality empowers protocols to expedite the process of sending tokens across chains, all under the assurance of audited token pool contracts.</p>\n<p class=\"md-end-block md-p\">This cross-chain protocol is a collaborative undertaking involving Swift, the esteemed global financial messaging network. The CCIP leverages Swift's advanced messaging infrastructure, facilitating seamless token transfers across an array of public and private blockchains.</p>\nKey Elements of The Protocol\n<p class=\"md-end-block md-p\">The Chainlink Cross-Chain Interoperability Protocol (CCIP) has been designed to cater to developers' needs by providing them with flexible tools to create custom cross-chain solutions. An example of this is its Arbitrary Messaging feature, which opens up the possibility for unique cross-chain applications. Additionally, Simplified Token Transfers, which utilize audited token pool contracts, streamline the process of moving tokens across chains. This feature saves development time by eliminating the need for writing custom code.</p>\n<p class=\"md-end-block md-p\">A key element of CCIP's implementation strategy is its collaboration with established financial messaging network Swift (stylized in some cases as SWIFT), along with several financial institutions. This collaboration focuses on utilizing existing messaging infrastructures to facilitate token transfers across diverse blockchain environments.</p>\n<p class=\"md-end-block md-p\">By enabling traditional finance to connect with decentralized networks, this innovative approach lays a foundation for a new phase of collaborative advancement between these two sectors. The integration of CCIP into multiple major blockchains marks a significant stride in improving blockchain interoperability, fostering greater connectivity, and utility in decentralized networks. Chainlink is also partnered with Coinbase Cloud, which is designated as a node operator.</p>\n<p class=\"md-end-block md-p\">Chainlink's co-founder, Sergey Nazarov, pointed out that the CCIP serves in such a way that it [functions to]:</p>\n\n<p class=\"md-end-block md-p\">\"connect the fragmented public blockchain landscape and the growing bank ecosystem into a single Internet of Contracts.\" </p>\n\n<p class=\"md-end-block md-p\">Nazarov further emphasized that such a technological advancement would be vital in shaping and sustaining a society powered by blockchain.</p>\n<p class=\"md-end-block md-p\">Various prominent financial institutions and enterprises, including the Australia and New Zealand Banking Group (ANZ), BNP Paribas, BNY Mellon, Citi, Euroclear, and Lloyds Banking Group, are currently exploring the possibilities and benefits presented by the CCIP.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T17:51:34.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T17:47:45.000Z",
    "title": "Top banks are bearish on the US dollar – Here is why",
    "url": "https://www.cryptopolitan.com/top-us-banks-are-bearish-on-the-dollar/",
    "description": "With leading U.S. banks including Morgan Stanley, JPMorgan Chase, Goldman Sachs, and HSBC projecting a bearish outlook on the dollar, the financial world is anticipating the shift. The predicted &#8220;soft&#8221; economic landing, characterized by the stabilization of the economy after a period of expansion without it tipping into a recession, seems to diminish the urgency ... <a title=\"Top banks are bearish on the US dollar &#8211; Here is why\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-us-banks-are-bearish-on-the-dollar/\" aria-label=\"More on Top banks are bearish on the US dollar &#8211; Here is why\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T17:41:36.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-18T18:02:12.000Z",
    "title": "Coinbase CEO Brian Armstrong set to speak to House Democrats privately",
    "url": "https://crypto.news/coinbase-ceo-brian-armstrong-set-to-speak-to-house-democrats-privately/",
    "description": "Coinbase CEO Brian Armstrong is set to discuss digital asset legislation with US House Democrats amid SEC lawsuits according to the latest round of reports on the firms legal situation."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-18T18:00:38.000Z",
    "title": "ARK Invest CEO Says Firm Is Still Bullish On Coinbase Despite Selling COIN Stocks",
    "url": "https://www.newsbtc.com/coinbase/ark-invest-ceo-still-bullish-on-coinbase/",
    "description": "Cathie Wood, the CEO of ARK Investment Management, has reaffirmed her bullish stance on Coinbase, one of the leading cryptocurrency exchanges, despite ARK&#8217;s recent sale of COIN stocks. Wood&#8217;s optimism comes in the wake of Ripple&#8217;s partial victory over the Securities and Exchange Commission (SEC) on July 13. This ruling, while not entirely in favor of Ripple, has been viewed as a positive development for the broader crypto industry, particularly for crypto exchanges. Moreover, Wood&#8217;s confidence aligns with other experts who believe that this ruling could have significant implications for Coinbase and its ongoing legal battles with regulatory authorities. Ripple Court Ruling: A Boost for Crypto Exchanges and Coinbase The recent court ruling in favor of Ripple against the SEC has sparked reactions within the crypto industry. Cathie Wood, along with several industry pundits, has lauded the ruling, recognizing its potential positive impact on Coinbase and other exchanges. Related Reading: 29% Of Bitcoin’s Circulating Supply Is Now Presumed Lost Forever The court found that XRP tokens sold to retail investors on crypto exchanges were not securities, setting a precedent that could favor Coinbase and Binance in their legal disputes with the SEC. Wood, in a video posted on Bloomberg&#8217;s Twitter handle, emphasized that despite receiving a Wells notice in March and facing a lawsuit from the SEC in June, Coinbase&#8217;s share price demonstrated resilience, suggesting the robustness of its stock value. The CEO’s bullish comments come after ARK Investment Management recently sold a significant number of Coinbase shares, with three of its ETFs cashing in on the exchange&#8217;s rally. Despite these sales, Wood&#8217;s bullish outlook on Coinbase remains unshaken.  COIN price sitting at $106.75 &#124; Source: Coinbase Global, Inc. on TradingView.com The cryptocurrency exchange&#8217;s share price, which started the year at $33.60, has surged over 184%, reaching $105.55 at the time of publication. However, while industry players increasingly express optimism toward Coinbase, analysts from Berenberg Capital Markets caution that various regulatory challenges for crypto exchanges are yet to be fully resolved. Regulatory Concerns Linger Despite Coinbase&#8217;s Resilience Despite Coinbase&#8217;s strong performance and Wood&#8217;s optimism, regulatory uncertainties persist within the crypto exchange sector. Berenberg Capital Markets analysts highlight unresolved aspects of crypto exchange regulation, including concerns about Coinbase Earn, a product that offers yield on crypto staking.  The comments made by Judge Analisa Torres raise questions about the potential classification of Coinbase Earn as a security, signaling the need for further clarity in this area.  Related Reading: USDC Market Cap Drops As Redemptions Climb To $1.4 Billion Nevertheless, Wood&#8217;s continued bullish stance on Coinbase following the Ripple court ruling reflects her confidence in the exchange&#8217;s ability to navigate regulatory challenges successfully.  It is also crucial to acknowledge that the evolving regulatory landscape and ongoing legal battles with the SEC require careful monitoring. Achieving clarity and resolution in crypto exchange regulation remains essential to ensure the long-term stability and growth of the industry. Featured image from Bankrate, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-18T18:05:51.000Z",
    "title": "Senator Elizabeth Warren Demands SEC Probe Into Elon Musk’s Tesla –  Does Crypto’s Fate Hanging in Balance",
    "url": "https://www.crypto-news-flash.com/senator-elizabeth-warren-demands-sec-probe-into-elon-musks-tesla-does-cryptos-fate-hanging-in-balance/?utm_source=rss&utm_medium=rss&utm_campaign=senator-elizabeth-warren-demands-sec-probe-into-elon-musks-tesla-does-cryptos-fate-hanging-in-balance",
    "description": "<img width=\"1280\" height=\"943\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/elon-musk-7159200_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/elon-musk-7159200_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/elon-musk-7159200_1280-300x221.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/elon-musk-7159200_1280-1024x754.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/elon-musk-7159200_1280-768x566.png 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Senator Warren has sent SEC Chair Gensler a letter calling for an investigation into Elon Musk&#8217;s Tesla over its Twitter ties. The lawmaker alleges misappropriation of assets and conflict of interest after Musk purchased Twitter and appointed himself as its CEO.  US Senator Elizabeth Warren has written a letter to the Securities and Exchange Commission [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-18T18:00:53.000Z",
    "title": "Pink Moon Studios Ignites Web3 Gaming Future with Groundbreaking KMON Trading Card Game",
    "url": "https://www.crypto-news-flash.com/pink-moon-studios-ignites-web3-gaming-future-with-groundbreaking-kmon-trading-card-game/?utm_source=rss&utm_medium=rss&utm_campaign=pink-moon-studios-ignites-web3-gaming-future-with-groundbreaking-kmon-trading-card-game",
    "description": "<img width=\"1280\" height=\"640\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/zzzzzzzzzzzz.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/zzzzzzzzzzzz.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/zzzzzzzzzzzz-300x150.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/zzzzzzzzzzzz-1024x512.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/zzzzzzzzzzzz-768x384.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/zzzzzzzzzzzz-1200x600.png 1200w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Pink Moon Studios, a cutting-edge architect of the Web3 gaming landscape, is set to thrill enthusiasts with an announcement that beautifully meshes nostalgia with innovation: the launch of the KMON Trading Card Game. This groundbreaking endeavor elevates the enchantment of beloved classics like Pokémon and Yugioh into the Web3 realm, effectively combining traditional gaming experiences [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-18T18:05:07.000Z",
    "title": "Crypto Whales Send Hundreds of Millions of Dollars Worth of Bitcoin and Altcoins to Exchanges As Markets Pause",
    "url": "https://dailyhodl.com/2023/07/18/crypto-whales-send-hundreds-of-millions-of-dollars-worth-of-bitcoin-and-altcoins-to-exchanges-as-markets-pause/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Mysterious-Shiba-Inu-Whale-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Mysterious-Shiba-Inu-Whale-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Mysterious-Shiba-Inu-Whale-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Mysterious-Shiba-Inu-Whale-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Mysterious-Shiba-Inu-Whale-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Mysterious-Shiba-Inu-Whale-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Mysterious-Shiba-Inu-Whale-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto whales have suddenly come to life in the last 24 hours, with massive amounts of coins being sent to exchanges as markets start to show signs of possible weakness. Blockchain monitoring service Whale Alert has spotted numerous large entities sending large stacks of Bitcoin (BTC) and other digital assets to various crypto exchanges. Whale [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/18/crypto-whales-send-hundreds-of-millions-of-dollars-worth-of-bitcoin-and-altcoins-to-exchanges-as-markets-pause/\">Crypto Whales Send Hundreds of Millions of Dollars Worth of Bitcoin and Altcoins to Exchanges As Markets Pause</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]