[
  {
    "source": "CryptoSlate",
    "date": "2023-11-24T21:41:18.000Z",
    "title": "Coinbase stock surges to highest since April 2022",
    "url": "https://cryptoslate.com/coinbase-stock-surges-to-highest-since-april-2022/",
    "description": "<p>Coinbase&#8217;s COIN stock has rallied to its highest point since late April 2022 at $115, representing a 216% growth on the year-to-date metric, according to Tradingview data. Observers have linked COIN’s price performance to the generally positive trend observed in the crypto space, where flagship digital assets like Bitcoin, Ethereum, and Solana have recorded more than 100% gains [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/coinbase-stock-surges-to-highest-since-april-2022/\">Coinbase stock surges to highest since April 2022</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-24T21:39:53.000Z",
    "title": "$ADA: Cardano SPO Rick McCracken on ‘Potential Applications of Midnight Across Diverse Global Industries’",
    "url": "https://www.cryptoglobe.com/latest/2023/11/ada-cardano-spo-rick-mccracken-on-potential-applications-of-midnight-across-diverse-global-industries/",
    "description": "Midnight represents an emerging initiative in the blockchain space, positioned to address critical data protection needs in sectors like finance, insurance, and e-commerce. As a platform still in development, it promises to introduce selective data disclosure for Decentralized Applications (DApps), a significant departure from the traditional public ledger model prevalent in blockchain technology. A notable […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T21:53:36.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-24T22:00:22.000Z",
    "title": "Valour XRP ETP Set To Begin Trading, Can Institutional Inflows Drive Price To $10?",
    "url": "https://www.newsbtc.com/analysis/xrp/valour-xrp-etp-price-10/",
    "description": "The XRP price may be gearing towards a bullish momentum with the potential release of multiple ETPs and the anticipated launch of Valour’s XRP ETP into the European markets next month.  Valour XRP ETP To Enter European Markets Valour, a publicly traded company backed by DeFi Technologies, a crypto-based software organization, has announced a new XRP Exchange Traded Product (ETP). In a press release published on Wednesday, DeFi Technologies disclosed the launch of Valour’s XRP ETP in December 2023.  Related Reading: Shiba Inu Community Project Calls Out Founders For Refusing To Burn 103 Trillion SHIB A popular YouTuber, Zack Rector has stated in a recent YouTube video that the token is positioned to take advantage of a large flow of liquidity driven by the initiation of multiple XRP ETPs.  Including Valour’s ETP, there have been many other ETPs launched by industry-leading crypto companies. 21 Shares, a Swiss financial institution, is one of the prominent companies that issued its XRP ETP (AXRP) in 2019. Since its launch, AXRP has recorded approximately $49 million in assets under its control and the ETP earns a year-to-date return of +69%.  Rector disclosed that the growing number of ETPs could trigger significant institutional inflows that could push the adoption of the token and possibly drive its price upwards. Furthermore, the integration of an XRP ETP has the potential to significantly advance the ecosystem by enhancing liquidity and improving accessibility for retail and institutional investors.  ETP Influence On The Price The announcement of Valour’s XRP ETP comes as a positive development for the community and the broader crypto space. Various crypto investors have expressed their optimism about the significant impacts these ETPs could have on the XRP market. Just as the news of Spot Bitcoin ETF applications propelled Bitcoin’s price above $37,000, institutional flows from Valour’s XRP ETP could drive the token’s price to $10.  Related Reading: Analyst Says Ethereum Is Seeing ‘Systemic Buying’, What This Means The ETP issued by 21 Shares Ripple is a prime example of how XRP ETPs have performed in the past. After being traded 447 times on the market, this particular ETP generated $5 million in revenue.  Valour’s upcoming ETP has become a focal point for investors seeking strategic investment opportunities. Crypto investors are closely monitoring the market to assess the potential gains that may follow the ETP’s debut.  The anticipated launch of Ripple’s IPO and the final resolution of the lawsuit between Ripple and the United States Securities and Exchange Commission (SEC) are also major events that could help drive the price of the token to higher levels.  Token price falls tot $0.619 &#124; Source: XRPUSD On Tradingview.com Featured image from Analytics Insight, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-24T22:04:35.000Z",
    "title": "$102,178,826,000 Added To US Debt in Just 15 Days As Heritage Foundation Warns America Could Default ‘Sooner Rather Than Later’",
    "url": "https://dailyhodl.com/2023/11/21/102178826000-in-us-debt-added-in-15-days-as-heritage-foundation-warns-america-could-default-sooner-rather-than-later/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/dollar-debt-usa.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/dollar-debt-usa.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/dollar-debt-usa.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/dollar-debt-usa.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/dollar-debt-usa.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/dollar-debt-usa.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/dollar-debt-usa.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The US government&#8217;s balance sheet is ballooning, with more than a hundred billion dollars in debt added in just 15 days. The latest numbers from the government&#8217;s FiscalData system show the national debt grew from $33.637 trillion at the start of November to $33.740 trillion on November 16th – an increase of more than $102.17 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/21/102178826000-in-us-debt-added-in-15-days-as-heritage-foundation-warns-america-could-default-sooner-rather-than-later/\">$102,178,826,000 Added To US Debt in Just 15 Days As Heritage Foundation Warns America Could Default ‘Sooner Rather Than Later’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]