[
  {
    "source": "CoinDesk",
    "date": "2023-08-30T09:43:36.000Z",
    "title": "Genesis Lender Group Opposes ‘Wholly Insufficient’ DCG Deal",
    "url": "https://www.coindesk.com/business/2023/08/30/genesis-lender-group-opposes-wholly-insufficient-dcg-deal/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Creditors with $2.4 billion in claims against the bankrupt crypto lender could scupper an agreement made after months of wrangling."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-30T10:00:42.000Z",
    "title": "Bankrupt BlockFi proposes client asset conversion into stablecoins for trade-only wallets",
    "url": "https://cryptoslate.com/bankrupt-blockfi-proposes-client-asset-conversion-into-stablecoins-for-trade-only-wallets/",
    "description": "<p>Cryptocurrency lender BlockFi has filed a proposed court order seeking approval to convert certain client assets into withdrawable funds as part of its ongoing bankruptcy proceedings. The company applied to bankruptcy court on Aug. 30, requesting authorization to exchange limited cryptocurrency holdings known as &#8220;trade only&#8221; assets into stablecoins. According to the filing, the trade-only [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bankrupt-blockfi-proposes-client-asset-conversion-into-stablecoins-for-trade-only-wallets/\">Bankrupt BlockFi proposes client asset conversion into stablecoins for trade-only wallets</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-30T10:01:03.000Z",
    "title": "DOJ Files Motion to Exclude Sam Bankman-Fried’s Expert Witnesses in FTX Trial",
    "url": "https://www.cryptoglobe.com/latest/2023/08/doj-files-motion-to-exclude-sam-bankman-frieds-expert-witnesses-in-ftx-trial/",
    "description": "The U.S. Department of Justice (DOJ) has submitted a legal filing to prevent all of Sam Bankman-Fried’s proposed expert witnesses from testifying in his forthcoming trial scheduled for October. According to the documents filed by the DOJ, the defense’s proposed experts have multiple shortcomings that justify their exclusion from the trial. Per Decrypt’s article, the […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-30T10:00:28.000Z",
    "title": "Crypto Exchanges Bybit and Okx Drop Cards of Sanctioned Russian Banks",
    "url": "https://news.bitcoin.com/crypto-exchanges-bybit-and-okx-drop-cards-of-sanctioned-russian-banks/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1425570257-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Exchanges Bybit and Okx Drop Cards of Sanctioned Russian Banks\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1425570257-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1425570257-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1425570257-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1425570257-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1425570257-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1425570257-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1425570257.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Cryptocurrency exchanges Bybit and Okx have discontinued support for payment cards issued by sanctioned banks from Russia. The moves follow in the footsteps of Binance, the world’s largest exchange for digital assets, which recently removed such cards from its peer-to-peer (P2P) platform. Bybit and Okx Stop Operations With Sanctioned Russian Banks Bybit and Okx, two [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T10:00:18.000Z",
    "title": "Bank of Japan board member sees inflation goal in sight, policy shifts loom",
    "url": "https://www.cryptopolitan.com/bank-of-japan-inflation-goal-in-sight/",
    "description": "Japan&#8217;s inflation is &#8220;clearly in sight&#8221; with the central bank&#8217;s target, board member Naoki Tamura has highlighted, which suggests a potential discontinuation of negative interest rates at the beginning of the year. The statement marks the most explicit indication thus far from a Bank of Japan (BOJ) policymaker that increasing inflation and wages might prompt ... <a title=\"Bank of Japan board member sees inflation goal in sight, policy shifts loom\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bank-of-japan-inflation-goal-in-sight/\" aria-label=\"More on Bank of Japan board member sees inflation goal in sight, policy shifts loom\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T09:47:09.000Z",
    "title": "Rep. McHenry backs Grayscale’s court victory over SEC, calls for regulatory clarity",
    "url": "https://www.cryptopolitan.com/rep-mchenry-backs-grayscales-court-victory-over-sec-calls-for-regulatory-clarity/",
    "description": "In a landmark decision, a three-judge panel for the DC Circuit Court of Appeals granted Grayscale&#8217;s petition for review, effectively ordering the U.S. Securities and Exchange Commission (SEC) to reevaluate its previous denial of Grayscale&#8217;s application to convert its Bitcoin Trust into a spot bitcoin exchange-traded fund (ETF). The ruling has garnered significant attention from ... <a title=\"Rep. McHenry backs Grayscale&#8217;s court victory over SEC, calls for regulatory clarity\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rep-mchenry-backs-grayscales-court-victory-over-sec-calls-for-regulatory-clarity/\" aria-label=\"More on Rep. McHenry backs Grayscale&#8217;s court victory over SEC, calls for regulatory clarity\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-30T09:40:00.000Z",
    "title": "Renowned Economist Explains Why Grayscale’s Win Is Not Good For Bitcoin Price",
    "url": "https://www.newsbtc.com/bitcoin-news/grayscale-bitcoin-price/",
    "description": "One of the major highlights of Grayscale’s victory over the US Securities and Exchange Commission (SEC) was its positive effect on Bitcoin’s price. However, renowned economist Peter Schiff has explained why Grayscale’s win may not be good for Bitcoin in the long run.  A GBTC ETF ‘Bearish’ For Bitcoin Schiff tweeted that the GBTC fund becoming a spot ETF (Exchange-traded Fund) is “actually bearish” for the flagship cryptocurrency as he said this move could potentially increase Bitcoin’s “tradable supply.” Related Reading: Party In The USA: Ripple Gets Ready To Properly Celebrate Triumph Over SEC If approved, investors in the GBTC fund will now be able to redeem their Bitcoin, which Schiff has highlighted is bad for Bitcoin’s price and the market as GBTC will have to sell BTC into the market, thereby increasing the tradable supply.  Schiff’s concern probably stems from the fact that GBTC reportedly owns over 3% of Bitcoin’s circulating supply, so a sell-off due to redemptions could significantly impact the market, causing Bitcoin’s price to reduce. However, other X (formerly Twitter) users quickly pointed out that other ETF applications will likely be approved alongside Grayscale’s application. As such, there will be enough demand to balance out the increase in supply that could result from Grayscale’s redemptions.  Grayscale had applied to the SEC to convert its GBTC fund into a Spot Bitcoin ETF. However, the regulator rejected the application, leading Grayscale to file a lawsuit against the SEC, stating that the Commission acted arbitrarily and capriciously in its disapproval order.  Following the Appeal court’s ruling in favor of Grayscale, the SEC now has to review the asset manager’s application again with the possibility of an approval higher this time. This is because Grayscale has been able to establish before the court that it should enjoy the same treatment given to Bitcoin Futures ETF which the Commission has had no problem approving.  BTC price holds above $27,400 as euphoria spreads &#124; Source: BTCUSD on Tradingview.com The SEC’s Next Steps Legal expert Jake Chervinsky also chimed in to state that the court delivered a “huge embarrassment” for the SEC. As to the next steps that the regulator might take, Chervinsky highlighted four theories. Firstly, he believes the SEC could just pick another reason to deny Grayscale’s proposal, which could lead to another long-running legal battle between both parties. Apparently, the court had ruled that the Commission didn’t provide sufficient reason to deny Grayscale’s application as it faulted the “significant market” test size as wrong.  His second theory is that the SEC will choose to abide by the court’s decision and use that as an excuse to drop its “anti-ETF position.”  Related Reading: Bloomberg Expert Analyst Explains Why A Fall To $10,000 Isn’t Bad For Bitcoin Furthermore, the legal expert noted that the SEC may have no choice but to approve the pending ETF applications as there is “political pressure” on the SEC. According to him, the world’s largest asset manager, BlackRock, and its CEO, Larry Fink, are lobbying for their application to be approved.   Lastly, Chervinsky believes that the SEC’s Chair Gary Gensler could use this to spin the anti-crypto narrative by approving these ETFs to show that the Commission is willing to approve products that abode by their regulations.  Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-30T10:05:08.000Z",
    "title": "dYdX’s (DYDX) DeFi Dominance – How Pomerdoge (POMD) Might Just Outshine It",
    "url": "https://www.crypto-news-flash.com/dydxs-dydx-defi-dominance-how-pomerdoge-pomd-might-just-outshine-it/",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-164.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-164.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-164-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-164-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The popularity of the crypto market has skyrocketed in recent years. Therefore, more people have entered the industry to make investments, and earn big profits. Pomerdoge is currently the most attractive cryptocurrency for its high growth potential. The platform has also raised more than $630,000 within two weeks of its launch. Meanwhile, dYdX has shown [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-30T09:51:28.000Z",
    "title": "Top 3 SLEEPING GIANT Altcoins on our Radar",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-sleeping-giant-altcoins-on-our-radar/",
    "description": "<p>Imagine if you had magical powers to have one of your wishes granted. What would you wish for? I bet you’ll want to find the next Bitcoin in the crypto market. I do too! Getting your hands on some crypto before the next bull run is one way to amplify your portfolio. And the good thing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-sleeping-giant-altcoins-on-our-radar/\">Top 3 SLEEPING GIANT Altcoins on our Radar</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]