[
  {
    "source": "CoinDesk",
    "date": "2024-02-20T15:47:35.000Z",
    "title": "Galaxy Digital Stock Started at Buy at Canaccord",
    "url": "https://www.coindesk.com/business/2024/02/20/galaxy-digital-stock-started-at-buy-at-canaccord/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The investment bank said that the company represents one of the most diversified ways to play digital assets."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-20T16:02:27.000Z",
    "title": " Lawyer running to unseat Elizabeth Warren doesn’t mention crypto in campaign launch ",
    "url": "https://cointelegraph.com/news/lawyer-unseat-elizabeth-warren-crypto-campaign",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvN2VkYjUzY2QtYzk5NS00ZmU5LWFkOGUtMWMyMmM3NGM3NWQyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Senator Elizabeth Warren reportedly called for donations for her 2024 reelection by calling John Deaton a “big cheerleader for crypto interests” ahead his campaign launch.</p>\n                    <p><p>John Deaton, an attorney who has advocated for the crypto industry, officially launched his run for a United States Senate seat in Massachusetts — without explicitly mentioning digital assets as a campaign issue.</p><p>In a video released from his X account on Feb. 20, Deaton <a href=\"https://twitter.com/JohnEDeaton1/status/1759950501855088912\" target=\"_blank\" rel=\"noopener nofollow\">said</a> his campaign would be focused on “taking on the Washington elites,” claiming that Senator Elizabeth Warren “gets nothing done” for Massachusetts. The video included a photo of a Rhode Island Lawyers Weekly headline <a href=\"https://rilawyersweekly.com/blog/2023/12/15/lawyers-of-the-year-for-pi-attorney-win-vs-sec-a-big-victory-for-all-cryptocurrency/\" target=\"_blank\" rel=\"noopener nofollow\">mentioning</a> Deaton’s role in advocating for crypto against the U.S. Securities and Exchange Commission (SEC) and the lawyer wearing an <a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a> shirt. Otherwise, the launch video focused on domestic issues, including inflation and border security.</p><p>“I am running for U.S. Senate to continue my life’s mission to shake things up for the people who need it most,” said Deaton. </p><p><a href=\"https://cointelegraph.com/news/lawyer-unseat-elizabeth-warren-crypto-campaign\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-20T15:41:51.000Z",
    "title": " MetaMask boosts security with alerts for 30M users on major chains ",
    "url": "https://cointelegraph.com/news/metamask-extends-security-alerts-amid-user-growth",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZDczNWQ5YWItMWVmNy00M2MyLTk3ZjAtOTRkNDY2ZTkwMmJkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The noncustodial wallet started working on the security alert feature in April 2023 and integrated it with Ethereum mainnet in January 2024, </p>\n                    <p><p>MetaMask, a popular Ethereum-based self-custody crypto wallet, announced it would extend its default security alerts to web extension and mobile app users for multiple blockchains: Linea, BNB Chain, Polygon, Arbitrum, Optimism and Avalanche.</p><p>The new security features come amid significant user growth for the wallet, nearing its peak in 2022. The monthly active users grew from 19 million in September 2023 to 30 million in January 2024. The user growth momentum was attributed to its mainstream partnerships with the likes of <a href=\"https://fr.cointelegraph.com/news/metamask-and-robinhood-join-forces-to-democratise-access-to-crypto-assets\">popular trading platforms such as Robinho</a></p><p>The security alert feature was first integrated on the Ethereum mainnet via an extension on Jan. 29, 2024. The security alerts warn users at transaction time whenever they interact with a known threat. The feature simulates the transaction being requested, recognizes malicious patterns and flags users if a transaction is expected to result in fund loss. </p><p><a href=\"https://cointelegraph.com/news/metamask-extends-security-alerts-amid-user-growth\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-20T16:06:24.000Z",
    "title": "Pushd (PUSHD) looks like hot stock as Ethereum (ETH) Binance Coin (BNB) holders add presale to wallets for big gains",
    "url": "https://cryptodaily.co.uk/2024/02/pushd-pushd-looks-like-hot-stock-as-ethereum-eth-binance-coin-bnb-holders-add-presale-to-wallets-for-big-gains",
    "description": "Ethereum (ETH) and Binance Coin (BNB) holders are always on the lookout for the best token to get into their wallets as the next bullish market arrives."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-20T16:05:18.000Z",
    "title": "Bitrue to List Hummingbot Governance Token (HBOT)",
    "url": "https://cryptodaily.co.uk/2024/02/bitrue-to-list-hummingbot-governance-token-hbot",
    "description": "Bitrue, a tier 1 digital asset exchange, is set to list HBOT on February 20, the native token of the Hummingbot open-source crypto algo trading operating system. The upcoming listing is HBOT’s debut on a centralized exchange (CEX), a move anticipated to significantly bolster the growth and dynamics of the Hummingbot community."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-20T15:52:55.000Z",
    "title": "Bitcoin (BTC) Price Surge Slow Down Sees DeeStream (DST) Venture Explode As Binance Coin (BNB) Holders Scramble To Get In Early",
    "url": "https://cryptodaily.co.uk/2024/02/bitcoin-btc-price-surge-slow-down-sees-deestream-dst-venture-explode-as-binance-coin-bnb-holders-scramble-to-get-in-early",
    "description": "DeeStream (DST) has experienced a windfall in its presale these last couple of weeks the crypto market seemed to experience a big burst of rebound courtesy of the trickle-down effect"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-20T15:43:16.000Z",
    "title": "Binance Coin (BNB) & Cardano (ADA) Short Term Gains Move into DeeStream (DST) Revolution as 40x Looks Achievable",
    "url": "https://cryptodaily.co.uk/2024/02/binance-coin-bnb-cardano-ada-short-term-gains-move-into-deestream-dst-revolution-as-40x-looks-achievable",
    "description": "Success in crypto investing often requires a blend of intuition, thorough research, and an appetite for risk. Investors who thrive are those who can adapt quickly to new information and changing market conditions."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T16:09:12.000Z",
    "title": "China Cracks Down on Crypto-Enabled Geopolitical Data Leaks",
    "url": "https://www.cryptopolitan.com/china-crypto-enabled-geopolitical-data-leaks/",
    "description": "The Chinese Ministry of National Security (MNS) has issued a stark warning against a sophisticated scheme by overseas map companies designed to illicitly gather sensitive geopolitical data from Chinese users in exchange for cryptocurrency rewards.&#160; The alarming trend poses a direct threat to national security, leveraging the allure of digital currencies to compromise critical infrastructural [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T16:08:44.000Z",
    "title": "U.S. Army Adopts AI-Powered Wearable Computers for Better Battlefield Medicine",
    "url": "https://www.cryptopolitan.com/us-army-adopts-ai-powered-wearable-computers/",
    "description": "Discover how the U.S. Army's latest venture with Tomahawk Robotics introduces wearable AI technology to revolutionize battlefield medicine."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T16:07:46.000Z",
    "title": "MetaMask Enhances User Security with Blockaid Integration Across Multiple Chains",
    "url": "https://www.cryptopolitan.com/metamask-security-blockaid-integration-chain/",
    "description": "In a significant advancement for cryptocurrency wallet security, MetaMask has announced the integration of Blockaid security alerts into its platform, becoming a default feature for both its extension and mobile app users across multiple blockchain networks.&#160; The latest update, which follows a successful beta phase, aims to provide MetaMask users with real-time alerts on potentially [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T16:07:12.000Z",
    "title": "Tezos Price Prediction 2024-2033: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2024-2033 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T16:04:52.000Z",
    "title": "CME Group Set to Launch Innovative Micro Euro-Denominated Bitcoin and Ether Futures",
    "url": "https://www.cryptopolitan.com/cme-group-micro-euro-bitcoin-ether-futures/",
    "description": "In a significant expansion of its cryptocurrency derivatives portfolio, CME Group, the world&#8217;s leading derivatives marketplace, has announced its plans to introduce Micro Euro-denominated Bitcoin and Ether futures.  Scheduled to debut on March 18, subject to regulatory approval, these new offerings aim to cater to the growing global demand for more nuanced financial instruments in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T15:49:29.000Z",
    "title": "Rollbit Price Prediction 2024-2033:  Is It Time To Buy RLB?",
    "url": "https://www.cryptopolitan.com/rollbit-price-prediction/",
    "description": "Rollbit coin price prediction 2024-2033 Rollbit has quickly become one of the most popular crypto casinos and trading platforms. Launched in 2019, Rollbit offers a wide range of gaming, sports betting, futures trading, and NFT options for users. With no KYC requirements and support for numerous cryptocurrencies, Rollbit provides an easy entry into the world [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-20T15:53:10.000Z",
    "title": "SOLANA PRICE ANALYSIS & PREDICTION (February 20) – Sol Reinitiates Drop After Facing Resistance, Has Recovery Ended?",
    "url": "https://nulltx.com/solana-price-analysis-prediction-february-20-sol-reinitiates-drop-after-facing-resistance-has-recovery-ended/",
    "description": "Sol recovered well in the past month but appeared to be losing buzz due to a slight rejection. Failure to resume positive actions may trigger a bearish move. The price is currently up 30% in the past month. Following the late January bounce off the $80 level, Sol made an [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-20T15:43:29.000Z",
    "title": "BINANCE COIN PRICE ANALYSIS & PREDICTION (February 20) – BNB Faces Multiple Rejections After Reaching A New Milestone, Potential Retracement",
    "url": "https://nulltx.com/binance-coin-price-analysis-prediction-february-20-bnb-faces-multiple-rejections-after-reaching-a-new-milestone-potential-retracement/",
    "description": "BNB appeared a bit weak on the intraday trading following multiple rejections in the past few days. However, its bullish trajectory remains intact as it may resume buying once it finds a key level for a rebound. After establishing base support above $290 last month, BNB initiated a surge and [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-20T16:04:45.000Z",
    "title": "MetaMask integrates Blockaid security alerts into platform",
    "url": "https://crypto.news/metamask-blockaid-security-integration/",
    "description": "MetaMask integrates Blockaid security alerts by default to protect users against malicious transactions."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-20T15:53:36.000Z",
    "title": "Ethereum hits $3k on Dencun, spot ETH ETF anticipation",
    "url": "https://crypto.news/ethereum-dencun-spot-eth-etf/",
    "description": "Ethereum’s native token reached $3,000 on Feb. 20, following a week-long rally as cash poured into several cryptocurrencies in 2024."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-20T16:00:44.000Z",
    "title": "The Bitcoin “Big Money Algos” Are Here: Will BTC Breach $70,000?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-big-money-algos-btc-breach-70000/",
    "description": "Mike Alfred, a Bitcoin investor and crypto commentator, thinks the &#8220;big money algos&#8221; are back and predicts the world&#8217;s most valuable cryptocurrency will rally to record fresh February 2024 highs but retest all-time highs. This uptick, Alfred says, is before the network finally halves its miner rewards.  The &#8220;Big Money Algos&#8221; As BTC Retests $53,000 Taking to X on February 20, the investor notes that &#8220;big money algos just flipped on&#8221; and that the uptrend remains. By the time Alfred posted on X, BTC was headed towards the $53,000 before slipping back slightly to around the $59,000 level. However, the uptrend remains when looking at the candlestick arrangement in the daily chart. Bitcoin has been increasing, defying gravity for the better part of February. At spot rates, analysts, including Alfred, expect the coin to push higher, breaking above $53,000, a stubborn resistance level. If this happens, and considering the sharp breakout, it is likely that buyers will push prices higher towards $60,000 and potentially towards $70,000, as the investor predicts.   Related Reading: Solana, Chainlink Among Coins With Overheating Open Interest: Data Even so, it remains to be seen whether the uptrend will be sustained. When writing, the breakout has been met with solid rejection. Notably, there appear to be &#8220;sell walls,&#8221; which are large sell orders parked at around $53,000. Still, optimistic bulls expect a triumph, marked by a comprehensive close above this psychological round number. The crypto community, including the investors, is bullish on Bitcoin. So far, anticipation has been building up for even more gains ahead of halving. Bitcoin halving, an event set at the protocol level, will half miner rewards, possibly inducing a supply shock, assuming the current demand increases. Presently, Bitcoin supporters believe the network will continue to find more adoption as a medium of exchange and a store of value. With the coin becoming deflationary after halving, the consensus is that prices, guided by historical performance, will rise.  Bitcoin Traders Are Bullish As Billions Flow To The Industry While optimism reigns, Bitcoin remains volatile despite recent institutional participation. Through the spot Bitcoin exchange-traded funds (ETFs), Wall Street players have found a regulated product to channel billions into Bitcoin, reading from the amount of coins scooped in the recent past. Related Reading: Ethereum Receives Nod Of Approval From Berstein: ETH Price Will Reach $10,000 Still, whether the uptrend will continue depends on other macro factors, including monetary policy status in the United States. In March, the United States Federal Reserve (Fed) will guide the interest rate regime. It is a decision that may lift BTC to new levels as a store-of-value asset or force prices lower as capital rotates that to the greenback. Feature image from Shutterstock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-20T16:02:09.000Z",
    "title": "BlackRock’s Game-Changing Ad: BTC at $51,938 Labeled as ‘Progress’",
    "url": "https://www.crypto-news-flash.com/blackrocks-game-changing-ad-btc-at-51938-labeled-as-progress/?utm_source=rss&utm_medium=rss&utm_campaign=blackrocks-game-changing-ad-btc-at-51938-labeled-as-progress",
    "description": "<img width=\"1792\" height=\"1024\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-10.22.49-Illustrate-a-dynamic-and-engaging-financial-scene-that-depicts-the-concept-of-BlackRocks-Bitcoin-ETF-becoming-a-major-player-in-the-global-ETF-market.webp\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-10.22.49-Illustrate-a-dynamic-and-engaging-financial-scene-that-depicts-the-concept-of-BlackRocks-Bitcoin-ETF-becoming-a-major-player-in-the-global-ETF-market.webp 1792w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-10.22.49-Illustrate-a-dynamic-and-engaging-financial-scene-that-depicts-the-concept-of-BlackRocks-Bitcoin-ETF-becoming-a-major-player-in-the-global-ETF-market-300x171.webp 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-10.22.49-Illustrate-a-dynamic-and-engaging-financial-scene-that-depicts-the-concept-of-BlackRocks-Bitcoin-ETF-becoming-a-major-player-in-the-global-ETF-market-1200x686.webp 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-10.22.49-Illustrate-a-dynamic-and-engaging-financial-scene-that-depicts-the-concept-of-BlackRocks-Bitcoin-ETF-becoming-a-major-player-in-the-global-ETF-market-768x439.webp 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-10.22.49-Illustrate-a-dynamic-and-engaging-financial-scene-that-depicts-the-concept-of-BlackRocks-Bitcoin-ETF-becoming-a-major-player-in-the-global-ETF-market-1536x878.webp 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-10.22.49-Illustrate-a-dynamic-and-engaging-financial-scene-that-depicts-the-concept-of-BlackRocks-Bitcoin-ETF-becoming-a-major-player-in-the-global-ETF-market-150x86.webp 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-10.22.49-Illustrate-a-dynamic-and-engaging-financial-scene-that-depicts-the-concept-of-BlackRocks-Bitcoin-ETF-becoming-a-major-player-in-the-global-ETF-market-450x257.webp 450w\" sizes=\"(max-width: 1792px) 100vw, 1792px\" />BlackRock has dropped a new spot ETF ad labeling Bitcoin simply as “progress” as it looks to take the lion&#8217;s share of the market. BlackRock holds more than $6 billion in BTC as institutional inflows continue to increase and the digital asset finds stability above $51,000. BlackRock has just released a new advertisement for its [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-20T15:47:00.000Z",
    "title": "Kaspa (KAS) Hits New All-Time High, Can It Climb Higher? Indicators Weigh In",
    "url": "https://coinedition.com/kaspa-kas-hits-new-all-time-high-can-it-climb-higher-indicators-weigh-in/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Kaspa Price Records ATH with 32% Weekly Surge\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Kaspa-All-Time-High-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Kaspa (KAS) has made headlines for its outstanding performance in the cryptocurrency market, especially after it set an all-time high. Moreover, in the last week, Kaspa has gained 32.10%, outperforming the broader cryptocurrency market, which rose by 6.70%, and L1 cryptocurrencies, which grew by 5.70%.  This rally is the most extended series of gains for [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/kaspa-kas-hits-new-all-time-high-can-it-climb-higher-indicators-weigh-in/\">Kaspa (KAS) Hits New All-Time High, Can It Climb Higher? Indicators Weigh In</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-20T15:44:53.000Z",
    "title": "Web3 Greatest Startup Competition Hits $10M in Prizes",
    "url": "https://coinedition.com/web3-greatest-startup-competition-hits-10m-in-prizes/",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://coinedition.com/wp-content/uploads/2024/02/photo_2024-02-20_17-31-53_1708443197ShnyboF2zK.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2024/02/photo_2024-02-20_17-31-53_1708443197ShnyboF2zK.jpg 1200w, https://coinedition.com/wp-content/uploads/2024/02/photo_2024-02-20_17-31-53_1708443197ShnyboF2zK-300x180.jpg 300w, https://coinedition.com/wp-content/uploads/2024/02/photo_2024-02-20_17-31-53_1708443197ShnyboF2zK-1024x614.jpg 1024w, https://coinedition.com/wp-content/uploads/2024/02/photo_2024-02-20_17-31-53_1708443197ShnyboF2zK-380x228.jpg 380w, https://coinedition.com/wp-content/uploads/2024/02/photo_2024-02-20_17-31-53_1708443197ShnyboF2zK-768x461.jpg 768w, https://coinedition.com/wp-content/uploads/2024/02/photo_2024-02-20_17-31-53_1708443197ShnyboF2zK-148x89.jpg 148w, https://coinedition.com/wp-content/uploads/2024/02/photo_2024-02-20_17-31-53_1708443197ShnyboF2zK-742x445.jpg 742w, https://coinedition.com/wp-content/uploads/2024/02/photo_2024-02-20_17-31-53_1708443197ShnyboF2zK-412x247.jpg 412w, https://coinedition.com/wp-content/uploads/2024/02/photo_2024-02-20_17-31-53_1708443197ShnyboF2zK-400x240.jpg 400w, https://coinedition.com/wp-content/uploads/2024/02/photo_2024-02-20_17-31-53_1708443197ShnyboF2zK-275x165.jpg 275w, https://coinedition.com/wp-content/uploads/2024/02/photo_2024-02-20_17-31-53_1708443197ShnyboF2zK-352x211.jpg 352w, https://coinedition.com/wp-content/uploads/2024/02/photo_2024-02-20_17-31-53_1708443197ShnyboF2zK-117x70.jpg 117w, https://coinedition.com/wp-content/uploads/2024/02/photo_2024-02-20_17-31-53_1708443197ShnyboF2zK-125x75.jpg 125w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /><p>Paris, France, February 20th, 2024, Chainwire We’re thrilled to announce the return of the highly anticipated Startup Competition at Paris Blockchain Week. With a staggering array of prizes totaling over $10 million, encompassing funding, grants, credits, accelerations, listing, and more, this competition has become a cornerstone event within the blockchain startup ecosystem.   Partners include industry [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/web3-greatest-startup-competition-hits-10m-in-prizes/\">Web3 Greatest Startup Competition Hits $10M in Prizes</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]