[
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T16:15:05.000Z",
    "title": "What is Gala Games and how to buy GALA coin?",
    "url": "https://cointelegraph.com/news/gala-games-how-to-buy-gala-coin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/f11d7eb6-2dd8-41f3-a6d7-ffc153118d29.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Gala Games is a blockchain-based gaming platform enabling players to create, own, and trade in-game assets using cryptocurrencies.</p>\n                    <p><p>Echoing the momentum of <a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-the-gamefi-ecosystem\">GameFi (gaming and finance)</a> and the great success of <a href=\"https://cointelegraph.com/learn/axie-infinity-axs-a-beginners-guide-to-the-gaming-metaverse-project\">Axie Infinity</a>, Gala Games was launched in 2019 to pursue technology development and innovation in <a href=\"https://cointelegraph.com/explained/play-to-earn-vs-move-to-earn-explained#:~:text=Play%2Dto%2Dearn%20(P2E)%20crypto%20games%20are%20giving,websites%20like%20Minecraft%20and%20Roblox.\">play-to-earn (P2E)</a> blockchain gaming. The global market size of blockchain gaming exceeded $4.6 billion in 2022 and is expected to reach around $65.7 billion by 2027, establishing itself as one of the most promising sectors revolutionized by <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-everything-there-is-to-know\">blockchain technology</a>.</p><p>Gala Games offers players a plethora of blockchain games that encourage players to gain in-game rewards and earn <a href=\"https://cointelegraph.com/learn/what-is-a-cryptocurrency-a-beginners-guide-to-digital-money\">cryptocurrency</a> and <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a>.</p><p>For the first time, through the use of NFTs, blockchain games offer players the ability to own in-game items, such as strategic tools, physical accessories and land. All items can be acquired in Gala Games using the GALA native token (<a href=\"https://cointelegraph.com/gala-price-index\">GALA</a>). GALA is also used for governance voting and to incentivize node operators.</p><p>This article takes readers through an understanding of the Gala ecosystem, how Gala Games works, and what the incentives are for using it.</p><h2>What is Gala Games (GALA)?</h2><p>Gala Games is a blockchain gaming platform that participants can use to play, stake and sell assets and compete with one another. The platform uses blockchain technology to secure the network and offers decentralized video games to allow players to have fun while earning rewards like NFT prizes.</p><p>Developed on the <a href=\"https://cointelegraph.com/learn/what-is-ethereum-a-beginners-guide-to-eth-cryptocurrency\">Ethereum</a> blockchain, Gala Games offers players P2E games, an NFT marketplace, and the possibility to store and distribute music and film products. It relies on a network of distributed user-owned <a href=\"https://cointelegraph.com/learn/what-is-a-bitcoin-node-a-beginners-guide-on-blockchain-nodes\">nodes</a> necessary for the platform’s security and to boost its development.</p><p>Players and user-owned nodes are rewarded with the GALA <a href=\"https://cointelegraph.com/explained/erc-20-tokens-explained#:~:text=ERC%2D20%20is%20the%20universal,to%20be%20traded%20with%20another.\">ERC-20 token</a> for playing and contributing to the network. It is the necessary currency to participate in the platform’s games, trade NFTs on the marketplace, and cast a <a href=\"https://cointelegraph.com/news/what-are-governance-tokens-and-how-do-they-work\">governance vote</a>.</p><h2>How does Gala Games work?</h2><p>The Gala Games ecosystem offers a multitude of blockchain games developed by in-house developers and external partners, including Ember Entertainment, Kung Fu Factory, Gamedia, Certain Affinity and 22cans. It launched as a platform for users who want to play and have fun rather than a platform that only uses incentives to attract customers. </p><p>Gala Network users can enjoy real-time strategy (RTS), multiplayer online battle arena (MOBA) and role-playing game (RPG) titles all while being rewarded with the GALA cryptocurrency and NFTs for using the platform.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/783c111e-9915-4534-91b3-317e80f441f8.jpg\"  /></figure><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/4c1b2707-59b0-4e52-81fe-d770de04881d.jpg\"  /></figure><p>NFTs represent in-game items, such as weapons, tools and skins, that users actually own and can trade on the Gala Store — also known as its nonfungible marketplace — and OpenSea, one of the world’s largest NFT marketplaces.</p><p>Gala Games’ platform was developed on Ethereum; however, the Gala team launched its own blockchain (Project GYRI) in February 2022. Initially <a href=\"https://cointelegraph.com/learn/permissioned-blockchain-vs-permissionless-blockchain-key-differences\">permissioned</a>, the Gala blockchain aims to transition to a more decentralized platform for maximum autonomy in the <a href=\"https://cointelegraph.com/learn/what-are-peer-to-peer-p2p-blockchain-networks-and-how-do-they-work\">peer-to-peer</a> transfer of value.</p><p>One of the features the Gala team promotes is incentivizing players to run their own nodes for an opportunity to earn the GALA cryptocurrency, limited edition NFTs and the chance to contribute to the growth of the ecosystem. To operate their own node, users must buy a license for roughly $100.</p><h3>Gala Nodes</h3><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/74e85732-2076-414a-bbf0-b8b3517b8bfa.jpg\"  /></figure><p>The Gala Games platform is run by a distributed network of nodes ensuring decentralization rather than a central server controlled by a single entity. These nodes offer their computational resources to contribute to the ecosystem, vote on community proposals, and help guide the network’s development. There are four different types of nodes, as follows:</p><ul><li>Founder Nodes are necessary to secure the network from fraudulent activities and vote on the project’s development using the GALA cryptocurrency. There are only 50,000 Founder Nodes available that can be purchased from the platform with the GALA token.</li></ul><ul><li>Game Nodes are specially dedicated gaming servers that can access specific allowances, such as NFTs, the ability to invite other players, etc., in the games they support.</li></ul><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/789c9b10-c551-41f0-b375-b2ee42ca172f.jpg\"  /></figure><ul><li>Player Nodes are decentralized music players that allow participants to play and share their music as NFTs.</li></ul><ul><li>Film Nodes, like Player Nodes, are for film experiences and entertainment.</li></ul><h2>History of Gala Games</h2><p>The founders of Gala Games are Eric Schiermeyer, Michael McCarthy and Wright Thurston, who launched the project in 2019. Schiermeyer had previously co-founded Zynga, an online gaming platform that developed popular games, such as Farmville, Mafia Wars and many others. Also, McCarthy worked at Zynga as a director before moving on to Gala.</p><p>Gala Games entered the market in 2019, and since its launch, Gala has secured some significant partnerships with Flare, Mazer Gaming, Bitrue, Brave, Ember Games and AMC, which helped promote the project and increase its market penetration.</p><h2>What is GALA used for?</h2><p>The primary use case for the GALA token is to be a medium of exchange between participants in the Gala Games ecosystem and to purchase digital assets, including NFTs.</p><p>The GALA token can be an Ethereum-based ERC-20 token or a <a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-the-bnb-chain-the-evolution-of-the-binance-smart-chain\">BNB Smart Chain-based</a> BEP-20 token and is used in various ways across the Gala platforms. It can be a reward incentive for Founder Node operators or a governance token that allows its owners to vote on the project’s future developments.</p><p>It can also be in the form of in-game player rewards and can be used to purchase NFTs from the Gala Store. Users can also spend it to buy a license required to operate a Gala node.</p><h2>How to buy GALA</h2><p>While Gala Games has been developed to run mainly on Ethereum, the GALA token can be used on platforms such as <a href=\"https://cointelegraph.com/learn/polygon-blockchain-explained-a-beginners-guide-to-matic\">Polygon</a> and bridged to the BNB Smart Chain so that users can enjoy better trading fees when transferring value. </p><p>Gala’s total supply is approximately 50 billion, and each day, a pre-determined amount of new GALA tokens are distributed to the Founder Nodes and the Gala Games Conservatorship, which is Gala Games’ treasury. The daily issuance is cut in half every year, and in July 2023, it was slightly fewer than 4.3 million tokens.</p><p>Players can earn GALA in games, and investors can buy GALA from a number of cryptocurrency providers, including major exchanges such as Kraken and Binance. Kraken offers to trade GALA with the United States dollar and euro only, while Binance provides a broader choice of cryptocurrencies — other than Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) — that can be exchanged with the GALA token. Coinbase only allows you to buy Gala with a Coinbase wallet from a decentralized exchange.</p><p>Investors must have an account with their provider of choice and verify their identity to start acquiring GALA; select the currency that will buy the token, click “buy,” and once the transaction has gone through, they can either store the token within the exchange (not recommended) or withdraw it to store it in a private and secure wallet.</p><h2>Is Gala Games a good investment?</h2><p>As the blockchain-based gaming industry keeps expanding, it is fair to predict that GameFi will play a significant role in the future of entertainment. In 2021, Gala Games sealed a partnership with crypto investment firm C2 Ventures to form a $100-million fund to invest in advancing the play-to-earn gaming and metaverse markets. Gala Games also received funding from Binance’s Accelerator Fund for its development. </p><p>Such funding was a positive outcome for Gala Games investors looking for the project’s reliability, opportunities and innovation. Whether Gala Games is a good investment or not is up to the investor to decide after proper research and assessment. Indeed, from a future perspective, GameFi is a promising branch of finance that uses blockchain technology to leverage security and decentralization, encouraging widespread optimism across the financial world.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-18T16:30:27.000Z",
    "title": "BRC-20 developer Domo praises tokens for 6% of Bitcoin activity milestone",
    "url": "https://cryptoslate.com/podcasts/brc-20-developer-domo-praises-tokens-for-6-of-bitcoin-activity-milestone/",
    "description": "<p>In a recent Bitcoin Startup Lab podcast episode, anonymous developer Domo spoke about the origins and future potential of the BRC-20 token standard he created for Bitcoin. Launched on March 8, 2023, BRC-20 tokens, which were developed using ordinal inscriptions of JSON data, are used to deploy token contracts, mint tokens, and carry out other related [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/podcasts/brc-20-developer-domo-praises-tokens-for-6-of-bitcoin-activity-milestone/\">BRC-20 developer Domo praises tokens for 6% of Bitcoin activity milestone</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-18T16:15:13.000Z",
    "title": "AX1 Unveils Comprehensive Research on the Web3 Landscape",
    "url": "https://news.bitcoin.com/ax1-unveils-comprehensive-research-on-the-web3-landscape/",
    "description": "<img width=\"768\" height=\"420\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/8941e16e-10ae-4695-a589-d213a1c79447-768x420.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/8941e16e-10ae-4695-a589-d213a1c79447-300x164.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/8941e16e-10ae-4695-a589-d213a1c79447-1024x560.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/8941e16e-10ae-4695-a589-d213a1c79447-768x420.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/8941e16e-10ae-4695-a589-d213a1c79447.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. In a rapidly evolving digital landscape, the crypto industry stands as a beacon of innovation and opportunities. AX1 takes a deep dive into this dynamic world, focusing on the pivotal role of Trust Wallet in the DeFi and DEX sectors. The research offers a rounded perspective on the regulatory landscapes steering the crypto [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T16:35:05.000Z",
    "title": "Pioneering “AI Bill of Rights in Education” Aims to Shape Ethical Use of AI",
    "url": "https://www.cryptopolitan.com/pioneering-ai-bill-of-rights-in-education/",
    "description": "A recent article published by Kathryn Conrad, a University of Kansas professor of English, introduces a compelling proposal for an &#8220;AI Bill of Rights in Education.&#8221; The article, released as a sneak preview in July 2023 by the journal Critical AI, offers a comprehensive framework to foster responsible AI integration into education. This development comes ... <a title=\"Pioneering &#8220;AI Bill of Rights in Education&#8221; Aims to Shape Ethical Use of AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pioneering-ai-bill-of-rights-in-education/\" aria-label=\"More on Pioneering &#8220;AI Bill of Rights in Education&#8221; Aims to Shape Ethical Use of AI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T16:13:55.000Z",
    "title": "Ray Dalio Predicts AI Transformation Could Lead to a 3-Day Workweek",
    "url": "https://www.cryptopolitan.com/ray-predicts-ai-could-lead-to-3-work-days/",
    "description": "Billionaire investor Ray Dalio has ignited a conversation about the future of work with his bold prediction that artificial intelligence (AI) could lead to a three-day workweek. Dalio, the founder of Bridgewater Associates, the world&#8217;s largest hedge fund, made this assertion at the Milken Institute&#8217;s Asia Summit. He believes that AI if managed correctly, has ... <a title=\"Ray Dalio Predicts AI Transformation Could Lead to a 3-Day Workweek\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ray-predicts-ai-could-lead-to-3-work-days/\" aria-label=\"More on Ray Dalio Predicts AI Transformation Could Lead to a 3-Day Workweek\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T16:12:29.000Z",
    "title": "5 reasons why governments don’t accept web3",
    "url": "https://crypto.news/5-reasons-why-governments-dont-accept-web3/",
    "description": "With recent advancements in technology bringing web3 closer to becoming a reality, some governments may be unwilling to cede control to the people."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T16:30:48.000Z",
    "title": "Bitcoin ($BTC) Price Projection: $30k Rally Possible, While Alternatives $QUBE and $OP Set To Explode",
    "url": "https://www.crypto-news-flash.com/bitcoin-btc-price-projection-30k-rally-possible-while-alternatives-qube-and-op-set-to-explode/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-btc-price-projection-30k-rally-possible-while-alternatives-qube-and-op-set-to-explode",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-77.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-77.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-77-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As the cryptocurrency market recovers from its recent downturn, Bitcoin ($BTC) is prominently at the forefront of this resurgence. The remarkable performance of this pioneering cryptocurrency shows its potential to deliver a breathtaking $30,000 rally, a development that could reshape the portfolios of its eager investors. Amid this digital frenzy, it&#8217;s worth noting that Bitcoin [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T16:29:26.000Z",
    "title": "Polygon Leads the Pack as Base Network Achieves 1.88 Million Daily Transactions",
    "url": "https://www.crypto-news-flash.com/polygon-leads-the-pack-as-base-network-achieves-1-88-million-daily-transactions/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-leads-the-pack-as-base-network-achieves-1-88-million-daily-transactions",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-70.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Base\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-70.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-70-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-70-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Base set a record with 1.88 million transactions on September 14, surpassing competitors. Base&#8217;s ecosystem is flourishing with various decentralized protocols, the flagship social app, and Friend.Tech. Coinbase&#8217;s Layer 2 solution, Base, is consistently establishing groundbreaking benchmarks. On September 14, it achieved an unprecedented milestone as its daily transaction volume soared remarkably. Impressively, this emerging [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T16:23:36.000Z",
    "title": "Bybit Unveils New Reward Program to Trigger Demand for Crypto Debit Card",
    "url": "https://www.crypto-news-flash.com/bybit-unveils-new-reward-program-to-trigger-demand-for-crypto-debit-card/?utm_source=rss&utm_medium=rss&utm_campaign=bybit-unveils-new-reward-program-to-trigger-demand-for-crypto-debit-card",
    "description": "<img width=\"711\" height=\"400\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bybit.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bybit.jpg 711w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bybit-300x169.jpg 300w\" sizes=\"(max-width: 711px) 100vw, 711px\" />Bybit has launched a reward program to enable crypto debit cardholders to unlock a wide range of benefits through their spending.  Users who spend Bitcoin, Ethereum, Tether, XRP, or USD Coin would be accumulating points to win in the program.  Bybit, the third most visited crypto exchange has unveiled a new reward program dubbed Rewards [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T16:23:32.000Z",
    "title": "Revolutionizing cloud mining with leading super computing power: Tokencoin’s user-centric approach and diverse product plans",
    "url": "https://www.crypto-news-flash.com/revolutionizing-cloud-mining-with-leading-super-computing-power-tokencoins-user-centric-approach-and-diverse-product-plans/?utm_source=rss&utm_medium=rss&utm_campaign=revolutionizing-cloud-mining-with-leading-super-computing-power-tokencoins-user-centric-approach-and-diverse-product-plans",
    "description": "<img width=\"1221\" height=\"587\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Screenshot-2023-09-18-182148.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Screenshot-2023-09-18-182148.jpg 1221w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Screenshot-2023-09-18-182148-300x144.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Screenshot-2023-09-18-182148-1024x492.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Screenshot-2023-09-18-182148-768x369.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Screenshot-2023-09-18-182148-702x336.jpg 702w\" sizes=\"(max-width: 1221px) 100vw, 1221px\" />In the fast-moving world of digital money, there&#8217;s a platform shaking things up &#8211; Tokencoin, which is like a rising star in the world of cloud mining. And it&#8217;s getting noticed for doing things differently. Imagine coming with us on an exciting journey into Tokencoin, where they put users first. They&#8217;ve got cool perks like [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T16:16:57.000Z",
    "title": "Bitcoin Price Stability Sparks Interest in MKR, AAVE, RUNE, and RNDR",
    "url": "https://www.crypto-news-flash.com/bitcoin-price-stability-sparks-interest-in-mkr-aave-rune-and-rndr/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-price-stability-sparks-interest-in-mkr-aave-rune-and-rndr",
    "description": "<img width=\"960\" height=\"573\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-300x179.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-768x458.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-336x200.jpg 336w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-36x21.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-48x29.jpg 48w\" sizes=\"(max-width: 960px) 100vw, 960px\" />The price of Bitcoin faces resistance at various levels, including $26,700 and $26,850. Maker (MKR) is exhibiting a bullish trend with the formation of an ascending triangle pattern. Following three consecutive weeks of forming Doji candlestick patterns on the weekly chart. Bitcoin (BTC) has declined to $26,708, indicating a potential positive conclusion for the week. [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-18T16:35:05.000Z",
    "title": "Xsolla Launches Mall, an Online Destination for Video Games",
    "url": "https://dailyhodl.com/2023/09/18/xsolla-launches-mall-an-online-destination-for-video-games/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Xsolla-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Xsolla-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/08/Xsolla-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/08/Xsolla-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Xsolla-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/08/Xsolla-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>September 18, 2023 – Sherman Oaks, United States Xsolla, a global video game commerce company, has announced a new online destination called Xsolla Mall. This platform allows video games to host multiple landing pages where players can access exclusive in-game items, game discounts and premium experiences directly from developers and publishers or via campaigns with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/18/xsolla-launches-mall-an-online-destination-for-video-games/\">Xsolla Launches Mall, an Online Destination for Video Games</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]