[
  {
    "source": "Decrypt",
    "date": "2023-08-03T16:59:41.000Z",
    "title": "Bitfinex Hacker Revealed: Razzlekhan's Husband Admits He Stole Billions in Bitcoin",
    "url": "https://decrypt.co/151168/bitfinex-hacker-revealed-razzlekhan-husband-billions-bitcoin",
    "description": "It's long been suspected the couple hacked the crypto exchange, but only now been confirmed by Lichtenstein's admission in court."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-03T16:50:09.000Z",
    "title": "Bitfinex 2016 Hack Culprit Caught, Pleads Guilty to Money Laundering",
    "url": "https://cryptobriefing.com/2016-bitfinex-hack-culprit-caught/?utm_source=feed&utm_medium=rss",
    "description": "Ilya Lichtenstein pleaded guilty to a conspiracy to launder stolen Bitcoin, originally acquired through the 2016 Bitfinex hack, in a federal court in Washington, D.C. The amount, worth $70 million..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-03T17:00:00.000Z",
    "title": "Hashkey Becomes First Licensed Crypto Exchange In Hong Kong",
    "url": "https://cryptodaily.co.uk/2023/08/hashkey-becomes-first-licensed-crypto-exchange-in-hong-kong",
    "description": "<p class=\"md-end-block md-p\">Hong Kong's Hashkey Exchange has become the first cryptocurrency platform in the city-state to upgrade its type 1 and type 7 licenses, thus obtaining approval to serve retail customers.</p>\n<p class=\"md-end-block md-p\">This landmark achievement followed what is, by contrast, a fairly simple process facilitated by existing licenses, making Hashkey Exchange the first licensed trading platform in Hong Kong to offer services to retail users. </p>\n<p class=\"md-end-block md-p\">Hong Kong issued the crypto license to Hashkey just two months after regulators implemented a Virtual Asset Service Provider registration policy. This strategic move is part of a broader push to establish Hong Kong as a competitive global hub for digital asset businesses.</p>\n<p class=\"md-end-block md-p\">The Hashkey Exchange, part of the broader Hashkey Group which provides cryptocurrency financial services, had prior licenses that enabled it to serve professional investors. The latest upgrade allows it to significantly expand its services and meet the increasing demand from retailk consumers in the city-state, a market that has expanded after Hong Kong enacted legislation designed to foster crypto activity and attract digital asset businesses.</p>\n<p class=\"md-end-block md-p\">In a press statement, Livio Weng, COO of HashKey Group, expressed his excitement at becoming the first licensed trading platform in Hong Kong committed to serving retail users. </p>\n\n<p class=\"md-end-block md-p\">\"With the establishment of licenced trading platforms and the further clarity of regulatory frameworks in Hong Kong, the industry as a whole will witness increased transparency, leading to a significant boost in investor confidence,\" the HashKey exec said.</p>\n\n<p class=\"md-end-block md-p\">In addition to its licensing upgrade, Hashkey Exchange has undergone a brand revamp to ensure that both professional investors and retail users are offered more secure and convenient virtual asset trading experiences. The exchange prioritizes safety, segregating user funds from platform operations, with 98% stored in cold storage and 2% in hot wallets.</p>\n<p class=\"md-end-block md-p\">To supplement its offering, HashKey Exchange has also launched its over-the-counter (OTC) trading service, HashKey Brokerage, the first compliant OTC trading platform in Hong Kong since the implementation of the new regulatory framework. This new service offers high liquidity bulk trading for investors and high-net-worth clients, providing a secure and reliable channel for fund circulation.</p>\n<p class=\"md-end-block md-p md-focus\">Hong Kong's inaugural licensing of a crypto platform to serve retail customers heralds a new era for the city-state as it positions itself as a preferred location for digital asset businesses.</p>\n<p class=\"md-end-block md-p\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p class=\"md-end-block md-p\">&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T16:58:51.000Z",
    "title": "Worldcoin Price Prediction 2023 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, ... <a title=\"Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldcoin-price-prediction/\" aria-label=\"More on Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-03T16:58:26.000Z",
    "title": "Israel-based bourse teams up with Fireblocks",
    "url": "https://crypto.news/israel-based-bourse-teams-up-with-fireblocks/",
    "description": "The Tel Aviv Stock Exchange collaborates with Fireblocks to enhance institutional-grade digital asset services"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-03T16:45:36.000Z",
    "title": "Coinbase to release Base layer-2 for public access",
    "url": "https://crypto.news/coinbase-to-release-base-layer-2-for-public-access/",
    "description": "On Aug. 9, Coinbase, the cryptocurrency exchange, will release its Base layer-2 platform for public access without restrictions"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-03T17:00:28.000Z",
    "title": "Shiba Inu Notches New Adoption Record In Anticipation Of Shibarium Launch",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-notches-new-adoption-record-in-anticipation-of-shibarium-launch/",
    "description": "Shiba Inu (SHIB) has been garnering attention in recent weeks, with its price showing a good recovery after reaching a yearly low in June. This coincides with the excitement around the upcoming launch of Shibarium, a layer-2 blockchain network for the second-largest meme token. It appears that the forthcoming Shibarium launch has propelled SHIB to a significant milestone, as the number of addresses holding the token has hit a new all-time record.  Shiba Inu Sets New All-Time High In Addresses Data from IntoTheBlock reveals that the number of SHIB addresses at a given time has reached a new peak of 3.51 million. The previous all-time high was set in May 2022, when the number of addresses stood at 3.23 million. The number of addresses holding the SHIB token has been steadily rising in the past few months, but this rate of adoption notably surged in July. This is reflected in last week’s figure, as the number of addresses holding the token spiked by more than 22%. Related Reading: Over $28 Million In SHIB Withdrawn From Exchanges Ahead Of Shibarium Launch A steady increase in the number of SHIB addresses suggests a growing interest in the meme token. This can be attributed to a combination of various factors, including the upcoming Shibarium launch, the token’s price performance, and the recent resurgence of DOGE &#8211; the poster boy for meme coins. The recent market activity of Shiba Inu whales further amplifies the optimism surrounding the SHIB token. On Wednesday, August 2, NewsBTC reported that the cryptocurrency’s large volume transactions reached approximately 1.13 trillion SHIB. SHIB Price Hovers Around Critical Level &#8211; Price Overview The price of the Shiba Inu appears to be slowing down after displaying bullish strength before the end of July. The token rallied nearly 12% between July 28 and July 30 to break above the $0.000008 level. However, this recent momentum appears to be waning, as the token’s price has not made any notable action in the past few days. With a 0.9% price dip in the last 24 hours, the SHIB token continues to trade within the $0.00000831 zone. SHIBUSDT trading within the $0.0000083 zone on daily timeframe &#124; Source: SHIBUSDT chart from TradingView Investors should keep an eye on the meme coin in the coming week, as a break out of this zone could see it visit the $0.0000087 mark again. Moreover, with the Shibarium mainnet launch roughly 10 days away, a bullish scenario may be on the cards. Related Reading: Shiba Inu Price Prediction: Is Shibarium The Key To A Trend Reversal? According to CoinGecko data, the SHIB token is currently valued at $0.0000082, representing a 4.5% price increase in the past week. With a market cap of roughly $4.86 billion, Shiba Inu ranks as the 15th-largest cryptocurrency in the market. Featured image from Unsplash, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-03T17:00:26.000Z",
    "title": "Crypto Market Outlook: Borroe AmongTop 3 Altcoins set to Explode in August",
    "url": "https://www.crypto-news-flash.com/crypto-market-outlook-borroe-amongtop-3-altcoins-set-to-explode-in-august/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-market-outlook-borroe-amongtop-3-altcoins-set-to-explode-in-august",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T103103.475.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T103103.475.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T103103.475-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T103103.475-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T103103.475-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T103103.475-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As July 2023 draws to a close, investors are looking for the best altcoins to invest in for the rest of the year. Investors expect Maker’s (MKR) bull run to continue into August. Also, Stellar (XLM) has retained its bullish gains from the past few weeks.  Also, Borroe ($ROE) is currently in its first presale [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-03T16:55:03.000Z",
    "title": "Big Four Accounting Firm KPMG Touts Bitcoin Benefits, Including Payments, Social Causes and Financial Inclusion",
    "url": "https://dailyhodl.com/2023/08/03/big-four-accounting-firm-kpmg-touts-bitcoin-benefits-including-payments-social-causes-and-financial-inclusion/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/big-four-firm-touts.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/big-four-firm-touts.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/big-four-firm-touts.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/big-four-firm-touts.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/big-four-firm-touts.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/big-four-firm-touts.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/big-four-firm-touts.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>One of the world&#8217;s largest accounting firms just published a new report highlighting use cases for Bitcoin (BTC). According to the Big Four accounting firm KPMG, the flagship cryptocurrency consistently provides value despite being an often-misunderstood technology and asset class. “There’s a variety of impactful use cases that Bitcoin offers that have a track record [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/03/big-four-accounting-firm-kpmg-touts-bitcoin-benefits-including-payments-social-causes-and-financial-inclusion/\">Big Four Accounting Firm KPMG Touts Bitcoin Benefits, Including Payments, Social Causes and Financial Inclusion</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-03T16:40:25.000Z",
    "title": "Introducing the CoinMarketCap’s Crypto Fear and Greed Index – A Comprehensive Crypto Market Sentiment Tracker",
    "url": "https://dailyhodl.com/2023/08/03/introducing-the-coinmarketcaps-crypto-fear-and-greed-index-a-comprehensive-crypto-market-sentiment-tracker/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/CoinMarketCap-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/CoinMarketCap-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/08/CoinMarketCap-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/08/CoinMarketCap-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/08/CoinMarketCap-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/08/CoinMarketCap-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>August 3, 2023 – London, United Kingdom CoinMarketCap, the leading platform for cryptocurrency data, announces the launch of its groundbreaking CMC Crypto Fear and Greed Index. Designed to meet a crucial market need, this innovative index provides a wide-ranging and quantifiable assessment of fear and greed for the entire cryptocurrency industry. Amid recent market turbulence, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/03/introducing-the-coinmarketcaps-crypto-fear-and-greed-index-a-comprehensive-crypto-market-sentiment-tracker/\">Introducing the CoinMarketCap’s Crypto Fear and Greed Index – A Comprehensive Crypto Market Sentiment Tracker</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]