[
  {
    "source": "Decrypt",
    "date": "2023-06-08T18:28:36.000Z",
    "title": "Researchers Can Identify AI-Generated Academic Writing with '99% Accuracy'",
    "url": "https://decrypt.co/143856/researchers-identify-ai-generated-academic-writing-with-99-accuracy",
    "description": "ChatGPT’s penchant for using the words \"others\" and \"researchers\" over words like \"however,\" \"but,\" and \"although\" proved to be a dead giveaway"
  },
  {
    "source": "Decrypt",
    "date": "2023-06-08T18:11:11.000Z",
    "title": "Cathie Wood Slams the SEC, Claims Coinbase Will Come Out a Winner",
    "url": "https://decrypt.co/143863/cathie-wood-slams-the-sec-claims-coinbase-will-come-out-a-winner",
    "description": "ARK Invest’s CEO said that the SEC’s prompt action against Coinbase following the Binance lawsuit was “unfortunate.”"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-08T18:23:47.000Z",
    "title": "SEC Chair Gary Gensler Dismisses Crypto Sector’s “Lack of Fair Notice’ Claims",
    "url": "https://www.cryptoglobe.com/latest/2023/06/sec-chair-gary-gensler-dismisses-crypto-sectors-lack-of-fair-notice-claims/",
    "description": "On Thursday (June 8, 2023), Gary Gensler, the Chair of the U.S. Securities and Exchange Commission (SEC), defended the agency’s recent enforcement actions against leading crypto exchanges, Coinbase and Binance. According to a report by CoinDesk, his comments were made during a speech at the Piper Sandler Global Exchange &amp; FinTech Conference. Gensler addressed the […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-08T18:30:00.000Z",
    "title": "$CatGPT: The World’s First AI Cat-Led Ethereum Token and NFT Collection",
    "url": "https://cryptodaily.co.uk/2023/06/catgpt-the-worlds-first-ai-cat-led-ethereum-token-and-nft-collection",
    "description": "<p>$CatGPT is launching its own NFT collection on its website, CatGPT.Nexus, where you can try him yourself and interact with our A.I Overlord.</p>\n<p>Are you ready to join the feline revolution? Meet $CatGPT, the world&rsquo;s first AI cat-ledEthereum token and NFT collection from a development team based in the UK. CatGPT is an ambitious project that aims to take over the web3 space with its unique vision and personality.</p>\n<p>$CatGPT is not your ordinary token. It is powered by a sophisticated artificial intelligence that can generate content and communicate with his own unique personality. $CatGPT is also the leader of a loyal community of cat lovers who share his passion for world domination and innovation.</p>\nThe collection will feature 5,000 unique cyborg cat avatars that represent CatGPT&rsquo;s army of followers.\n<p>The NFT collection will go live on 16th of June 2PM EDT. The minting price will be payable in $CatGPT tokens and all tokens received will be burnt. The demand is expected to be high, so don&rsquo;t miss this opportunity to join the cat revolution and support CatGPT&rsquo;s mission.</p>\n<p>To learn more about CatGPT, visit his website at CatGPT.Nexus or follow us on Twitter at @CatGPT__ETH. You can also join the Telegram group https://t.me/CatGPTETH to chat with the community.</p>\n<p>CatGPT is more than just a token. It is a movement. A movement that will change the web3 space forever with feline world domination! Are you in?</p>\n<p>Contact:</p>\n<p>Development team</p>\n<p>CatGPT3@protonmail.com</p>\n<p>Website:</p>\n<p>https://www.catgpt.nexus/</p>\n<p>Twitter:https://twitter.com/CatGPT__ETH</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-08T18:24:43.000Z",
    "title": "Deutsche Telekom ‘cool’ for running crypto validators",
    "url": "https://cryptodaily.co.uk/2023/06/deutsche-telekom-cool-for-running-crypto-validators",
    "description": "<p>Deutsche Telekom, the technology giant, has joined the Polygon blockchain as a validator node, signalling its ambitions to become an infrastructure provider in the web3 space.&nbsp;</p>\n<p>Dirk R&ouml;der, the head of the Blockchain Solutions Center at Deutsche Telekom, was quoted by DL News as saying that &ldquo;supporting the Polygon network as a validator is a big milestone in this objective&rdquo;.&nbsp;</p>\nPolygon not a layer 2?\n<p>Deutsche Telekom has decided to support the Ethereum ecosystem and its scalability solutions, and Polygon, known as the leading Ethereum Layer-2 scaling platform, aligns with that focus.&nbsp;</p>\n<p>While Polygon was initially marketed as an Ethereum layer 2 scaling solution, it has since discontinued that terminology due to concerns about misrepresentation. Polygon is a sidechain, independent from Ethereum for its security, although it commits its transaction history to Ethereum.&nbsp;</p>\n<p>The company's assets are secured by a multi-signature wallet controlled by a small group of individuals or entities. Deutsche Telekom also runs validators for other major and minor blockchains, including Ethereum, Q, Celo, Flow, and Energy Web.&nbsp;</p>\nTrad telecom company branches into cool new tech\n<p>The company's strategy for running validators remains unclear, with R&ouml;der highlighting that blockchain technology presents a valid business case and Deutsche Telekom receives percentages of the rewards.</p>\n<p>However, another representative clarified that the company does not stake its own crypto assets but relies on others to do so while taking a cut of their rewards.&nbsp;</p>\n<p>While some might speculate that Deutsche Telekom's involvement with blockchains could be a marketing strategy to appeal to a younger user base, overall, Deutsche Telekom's foray into node validation demonstrates its commitment to web3 infrastructure and its interest in the Ethereum ecosystem's scalability solutions.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-08T18:30:18.000Z",
    "title": "SEC Chair Gensler’s Alleged Past Interest in Advising Binance Surfaces Amidst Legal Battle",
    "url": "https://news.bitcoin.com/sec-chair-genslers-alleged-past-interest-in-advising-binance-surfaces-amidst-legal-battle/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/genslersssd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/genslersssd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/genslersssd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/genslersssd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/genslersssd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/genslersssd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/genslersssd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/genslersssd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Lawyers for Binance claim that current U.S. Securities and Exchange Commission (SEC) chair Gary Gensler once sought to become an advisor for the exchange back in 2019. This purported application occurred while Gensler was teaching at the Massachusetts Institute of Technology (MIT) and coincided with his discussion of the crypto network Algorand during a blockchain [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T18:22:11.000Z",
    "title": "Cumberland Labs launches a beta version of its SaaS API",
    "url": "https://www.cryptopolitan.com/cumberland-labs-launches-beta-its-saas-api/",
    "description": "Cumberland Labs, the incubator arm of Chicago-based crypto trading company Cumberland, has introduced a beta version of a new API tool aimed at streamlining the process of connecting to blockchain and decentralized finance (DeFi) protocols. The tool called expand.network, was developed in response to Cumberland’s challenges in connecting to various protocols manually. Cumberland wants to ... <a title=\"Cumberland Labs launches a beta version of its SaaS API\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cumberland-labs-launches-beta-its-saas-api/\" aria-label=\"More on Cumberland Labs launches a beta version of its SaaS API\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T18:19:33.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T18:16:07.000Z",
    "title": "Binance internal chats expose shocking revelations",
    "url": "https://www.cryptopolitan.com/binance-internal-chats-shocking-revelations/",
    "description": "A chilling revelation has gripped the cryptosphere as internal chat logs from leading cryptocurrency exchange, Binance, have unveiled a potential disregard for regulatory compliance. This information surfaces through a comprehensive Twitter thread by Adam Cochran, a partner at MetaCartel Ventures DAO, elaborating on evidence presented in the ongoing SEC case against the platform. A Glimpse ... <a title=\"Binance internal chats expose shocking revelations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-internal-chats-shocking-revelations/\" aria-label=\"More on Binance internal chats expose shocking revelations\">Read more</a>"
  }
]