[
  {
    "source": "Cointelegraph",
    "date": "2024-04-04T22:57:00.000Z",
    "title": " Here are the next biggest crypto court cases with the SBF saga over ",
    "url": "https://cointelegraph.com/news/next-crypto-court-cases-after-sam-bankman-fried",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvZTY2OGJhNzEtOTRkMy00ZTg0LTgyYWItNTNmNTllNTE3YjgzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Binance ex-boss CZ will be sentenced in April and the ring of FTX executivies that admitted to fraud are also set to soon be sentenced.</p>\n                    <p><p>The cryptocurrency “trial of the century” wrapped up a week ago with the 25-year sentencing of FTX co-founder Sam Bankman-Fried, but there’s plenty of crypto action still to come throug the United States courts.</p><p>At the end of this month, Binance co-founder Changpeng “CZ” Zhao will <a href=\"https://cointelegraph.com/news/binance-founder-changpeng-zhao-sentencing-date-april\">know what jail time</a>, if any, he’ll serve.</p><p>Bankman-Fried may also appeal his sentence at some point, which his lawyers said was in the works since he was found guilty last November. His 25-year sentence on March 28 now allows that to happen.</p><p><a href=\"https://cointelegraph.com/news/next-crypto-court-cases-after-sam-bankman-fried\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-04-04T23:00:54.000Z",
    "title": "Morgan Stanley, UBS on the verge of approving Bitcoin ETF exposure",
    "url": "https://cryptoslate.com/major-global-banks-on-the-verge-of-approving-bitcoin-etf-exposure/",
    "description": "<p>Morgan Stanley and UBS are actively competing to become the first major banks to offer their clients access to spot Bitcoin exchange-traded funds (ETFs), according to people familiar with the matter. Sources said that Morgan Stanley wants to be the first major bank to offer its clients full access to spot BTC ETFs and will [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/major-global-banks-on-the-verge-of-approving-bitcoin-etf-exposure/\">Morgan Stanley, UBS on the verge of approving Bitcoin ETF exposure</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-04T22:53:08.000Z",
    "title": "Wormhole’s 2022 hacker was briefly eligible for its airdrop",
    "url": "https://www.cryptopolitan.com/wormhole-added-2022-bridge-hacker-airdrop/",
    "description": "The hacker behind the huge $320 million hack on wormhole bridge in 2022 was briefly added to a list of eligible users for its W token airdrop. In an April 4 post by pseudonymous researcher Pland on X (formerly known as Twitter), the team had forgotten to remove wallets tied to some wallet addresses connected [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-04T23:00:39.000Z",
    "title": "Bitcoin NFT Market Thrives, Franklin Templeton Remains Bullish, Binance Ends Support",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-nft-market-thrives-franklin-templeton-remains-bullish-binance-ends-support/",
    "description": "Franklin Templeton&#8217;s digital assets division has released a note to its investors introducing Bitcoin-based non-fungible tokens (NFTs), highlighting a surge in activity within the Bitcoin ecosystem.  The asset manager attributes this increased momentum to various factors, including the emergence of Bitcoin (BTC) NFTs called Ordinals, the development of new fungible standards like BRC-20 and Runes, the growth of Bitcoin Layer 2 (L2s) solutions, and the expansion of decentralized finance (DeFi) applications built on the Bitcoin network. Bitcoin Ordinals Shine According to the Bitcoin ETF issuer&#8217;s report, activity in the Bitcoin NFT space is gaining momentum. In particular, Ordinals have seen a significant increase in trading volume over the past few months.  This growth is evident in Bitcoin&#8217;s dominance in terms of trading volume, which surpassed Ethereum (ETH) in December 2023, as shown in the accompanying chart.  Related Reading: Trouble Ahead? Binance Coin Futures Market Under Pressure With Negative Funding Rates In addition, several collections of Bitcoin Ordinals are emerging as dominant players in the NFT market, both in terms of trading volume and market capitalization.  These collections include NodeMonkes, Runestone, and Bitcoin Puppets, which have an aggregate market cap of $353 million, $339 million, and $168 million, respectively. They are the most notable collections.  In terms of trading volume over the past 30 days, the report shows that these three collections recorded trading volumes of $81 million, $85 million, and $38 million, respectively, over the past month.  The asset manager further claimed that what distinguishes BTC Ordinals from NFTs on other blockchains, such as Ethereum or Solana, is that they contain raw data recorded directly on the Bitcoin blockchain. This feature contributes to the attractiveness and growing popularity of Bitcoin Ordinals, as evidenced by market cap and trading volume figures. Franklin Templeton, known for its involvement in the ETF market, was one of the issuers that launched a spot BTC  ETF in the United States earlier this year. Its ETF, which trades under the ticker name &#8220;EZBC,&#8221; has seen total inflows of 281.8 million since its January 11 launch, according to BitMEX research data as of April 3.  Despite its zero-fee structure, Franklin Templeton&#8217;s ETF has seen a significant difference in flows compared to the leading players in the newly approved ETF market, such as Blackrock (IBIT) and Fidelity (FBTC), which have seen flows of over 14 billion and 7.7 billion, respectively. Binance To Discontinue Support For BTC NFTs In a recent blog post, crypto exchange Binance announced it would discontinue support for Bitcoin-based NFTs on its marketplace. Less than a year after their introduction, Binance will no longer facilitate airdrops, benefits, or utilities associated with BTC NFTs, citing a need to streamline its product offerings in the NFT space. Related Reading: Injective Whales Go On $24.8 Million Buying Spree, Is This The Next Solana? Binance states that users who own Bitcoin NFTs are advised to withdraw them from the Binance NFT marketplace via the Bitcoin network before May 18, 2024.  Effective April 18, 2024, users can no longer purchase, deposit, bid, or list NFTs via the BTC network on the Binance NFT Marketplace. Any existing listing orders affected by this change will be automatically canceled simultaneously. Currently, BTC is trading at $68,300, up a modest 3% in the last 24 hours. It is approaching the significant milestone of $70,000, a level the cryptocurrency has struggled to maintain several times. Featured image from Shutterstock, chart from TradingView.com"
  }
]