[
  {
    "source": "CryptoSlate",
    "date": "2023-11-09T14:57:31.000Z",
    "title": "Coinbase-backed Base TVL decline 30% from September peak",
    "url": "https://cryptoslate.com/coinbase-backed-base-tvl-decline-30-from-september-peak/",
    "description": "<p>Coinbase-backed Base has seen a substantial drop in decentralized finance activities on the network, with the total value of assets locked (TVL) dropping by around 30% in the last two months. Data from DeFillama shows that the Ethereum (ETH) layer2 network&#8217;s TVL has dropped by more than 30% to $284.59 million from its September peak [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/coinbase-backed-base-tvl-decline-30-from-september-peak/\">Coinbase-backed Base TVL decline 30% from September peak</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T14:48:30.000Z",
    "title": "Ark Invest and 21Shares Launch New Digital Asset ETFs Amidst Crypto Growth",
    "url": "https://www.cryptopolitan.com/ark-invest-and-21shares-launch-digital-asset-etfs/",
    "description": "Ark Invest, steered by the visionary Cathie Wood, in collaboration with 21Shares, has revealed the initiation of a new series of digital asset ETFs. These ETFs notably include the ARK 21Shares Active Bitcoin Futures Strategy ETF (ARKA) and ARK 21Shares Active Ethereum Futures Strategy ETF (ARKZ). These funds will distinguish themselves by investing in futures ... <a title=\"Ark Invest and 21Shares Launch New Digital Asset ETFs Amidst Crypto Growth\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ark-invest-and-21shares-launch-digital-asset-etfs/\" aria-label=\"More on Ark Invest and 21Shares Launch New Digital Asset ETFs Amidst Crypto Growth\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-09T15:00:34.000Z",
    "title": "21Shares collaborates with ARK on digital asset ETF suite",
    "url": "https://crypto.news/21shares-collaborates-with-ark-on-digital-asset-etf-suite/",
    "description": "ARK Invest, the investment management firm spearheaded by prominent Bitcoin advocate Cathie Wood, has teamed up with 21Shares, an exchange-traded product (ETP) provider, to introduce users to a suit that will give users exposure to Bitcoin and Ethereum futures contracts."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-09T14:58:44.000Z",
    "title": "Is the UK ready to embrace the new dawn of crypto regulations?",
    "url": "https://crypto.news/is-the-uk-ready-to-embrace-the-new-dawn-of-crypto-regulations/",
    "description": "The UK's aggressive stance on crypto could redefine the UK's crypto market, but will innovation pay the price?"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T15:00:24.000Z",
    "title": "Polygon (MATIC) Jumps Another 6% As Whales Show High Activity",
    "url": "https://www.newsbtc.com/matic/polygon-matic-jumps-6-whales-high-activity/",
    "description": "Polygon has continued its recent bullish momentum in the past day, jumping a further 6%, as on-chain data shows the whales are highly active currently. Polygon Is Now Up More Than 21% In The Past Week The past month has been a great time for Polygon investors as the cryptocurrency has observed a substantial uplift. Earlier in this period, the growth had been slower, but recently the asset has really stepped up. Here is a chart that shows how MATIC&#8217;s rally has looked over the last 30 days: Looks like the value of the asset has seen an explosion during this period &#124; Source: MATICUSD on TradingView With the latest leg in the surge, Polygon has reclaimed the $0.80 level for the first time since July of this year. Earlier in the day, the coin had spiked to as high as $0.84, but since then it has registered a pullback towards the current price levels. Related Reading: Dogecoin In Tight Zone: Why A Rally Will Happen If DOGE Clears $0.076 Nonetheless, even with the retrace, the asset is up a net 6% during the last 24 hours. As it stands, MATIC&#8217;s profits of 21% in the past week are among the best in the sector, with only Chainlink (LINK) showing a better performance inside the top 20 assets by market cap. It would appear that the whales may be playing a major role in this latest rally if on-chain data is anything to refer to. Polygon Whale Transaction Count Is At Elevated Levels Currently As pointed out by the on-chain analytics firm Santiment, whales have been quite active in the market recently. The relevant indicator here is the &#8220;whale transaction count,&#8221; which keeps track of the total number of Polygon transactions that are carrying at least $100,000 in value. The below chart shows the trend in this MATIC metric over the past few months: The value of the metric seems to have been quite high in recent days &#124; Source: Santiment on X As displayed in the above graph, the Polygon whale transaction count has been at high levels recently. To be more particular, the whales have been making more than 161 transactions per day, which is the highest the metric has been since July. Generally, high activity from the whales can be a predictor of volatility, as a large number of moves of these humongous holders together can have the power to move the market. Naturally, such volatility can take the cryptocurrency in either direction, as the whale transaction count metric merely tells us about the number of transfers that the whales are making, and not whether these are buying or selling transactions. Related Reading: Solana Whale Deposits $11M In SOL To Binance, Bearish Signal? In the chart, Santiment has also attached the data for another metric: the combined supply held by the 100,000 to 10 million MATIC addresses. As is visible in the graph, the sharks and whales have been accumulating since 24th October, suggesting that their buying may have been providing support to the rally. The supply of these key holders may be one to watch for in the coming days, especially given the high transaction activity that the whales in particular are making currently. If the indicator observes a significant drawdown, then it would be a sign that the group has decided to take their profits. Featured image from Todd Cravens on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-09T14:55:56.000Z",
    "title": "Ripple’s (XRP) Metaco Partners with HSBC for Institutional-Grade Security Token Custody",
    "url": "https://www.crypto-news-flash.com/ripples-xrp-metaco-partners-with-hsbc-for-institutional-grade-security-token-custody/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-xrp-metaco-partners-with-hsbc-for-institutional-grade-security-token-custody",
    "description": "<img width=\"1920\" height=\"1275\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/12/blockchain-g57474f4f2_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/12/blockchain-g57474f4f2_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/blockchain-g57474f4f2_1920-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/blockchain-g57474f4f2_1920-1024x680.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/blockchain-g57474f4f2_1920-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/blockchain-g57474f4f2_1920-1536x1020.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/blockchain-g57474f4f2_1920-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/blockchain-g57474f4f2_1920-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/blockchain-g57474f4f2_1920-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/blockchain-g57474f4f2_1920-48x32.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />HSBC has announced the launch of a new digital asset custody service for its institutional clients interested in tokenized securities as it ramps up crypto offerings. The European banking giant has tapped Metaco, a Ripple-owned tech firm, for the offering and will be integrating the firm&#8217;s Harmonize digital asset platform. European banking conglomerate HSBC has [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-09T15:07:00.000Z",
    "title": "Binance Launches New Loanable Assets, Perpetual Contract, and More",
    "url": "https://coinedition.com/binance-launches-new-loanable-assets-perpetual-contract-and-more/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Binances_latest_integration_can_have_this_impact_on_BNB_in_2023-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance Launches New Loanable Assets\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Binances_latest_integration_can_have_this_impact_on_BNB_in_2023-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Binances_latest_integration_can_have_this_impact_on_BNB_in_2023-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Binances_latest_integration_can_have_this_impact_on_BNB_in_2023-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Binances_latest_integration_can_have_this_impact_on_BNB_in_2023-2-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Binances_latest_integration_can_have_this_impact_on_BNB_in_2023-2-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Binances_latest_integration_can_have_this_impact_on_BNB_in_2023-2-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Multinational cryptocurrency exchange Binance has recently added more loanable assets and margin pairs to its portfolio through its support page. Concurrently, its crypto derivatives exchange, Binance Futures, has just launched its newest USDⓈ-M BADGER Perpetual Contract. Binance&#8217;s latest loanable and borrowable assets are GNO, AST, and ORDI in Cross Margin and Isolated Margin. The pairs [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/binance-launches-new-loanable-assets-perpetual-contract-and-more/\">Binance Launches New Loanable Assets, Perpetual Contract, and More</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]