[
  {
    "source": "Cointelegraph",
    "date": "2023-08-14T10:41:24.000Z",
    "title": "13% of applications approved: British regulator discloses crypto registration stats",
    "url": "https://cointelegraph.com/news/crypto-13-per-cent-of-applications-approved-british-regulator-discloses-crypto-registration-stats",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/f0f418a5-ef88-4ae6-91d2-5873f0be6916.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Since January 2020, almost 300 crypto companies have applied for registration with the Financial Conduct Authority, 38 of which were approved. </p>\n                    <p><p>Since January 2020, almost three hundred crypto companies have applied for registration with the principal financial regulator of the United Kingdom, the Financial Conduct Authority (FCA). Only 13% of them successfully obtained a permit to operate in the country. </p><p>On August 11, the FCA <a href=\"https://www.fca.org.uk/freedom-information/information-crypto-asset-businesses-october-2022\" target=\"_blank\" rel=\"noopener nofollow\">published</a> a response to a right-to-know request, whose author remains unnamed. The request considered four questions about the registration statistics of cryptoasset businesses. </p><p>The regulator revealed that since 2020 it has received 291 applications for registration and approved only 38 of them. The majority of applications, 155, were withdrawn by the firms themselves, as the FCA encourages them to resubmit applications later if not all the criteria have been met. As the regulator’s explanation goes:</p><blockquote>“Firms are required to provide the minimum information set out under regulation 57 of the MLRs, any firm that has not provided the required information will have their application rejected.”</blockquote><p>In the U.K., firms permitted to “carry out crypto asset activities” must either be registered with the FCA or have been granted temporary status to operate. Previously the FCA <a href=\"https://cointelegraph.com/news/uk-financial-watchdog-orders-binance-to-halt-regulated-activity-in-the-country\">ordered Binance Markets Limited</a> to halt its operations in the country and issued “shut down or face further action“ orders for local crypto ATM operators. By press time, the FCA’s list of registered crypto asset providers includes 42 entities, with such companies as Skrill, eToro and Gemini among them. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/uk-fca-shuts-down-26-illegal-crypto-atms\"><strong><em>UK FCA shuts down 26 crypto ATMs following coordinated investigation</em></strong></a></p><p>In July, the FCA reminded to all crypto asset firms in the country to <a href=\"https://cointelegraph.com/news/uk-financial-watchdog-reminds-crypto-firms-october-deadline-marketing-compliance\">bring their marketing strategies in compliance</a> with its financial promotions regime by October 2023. Previously it suggested crypto firms adopt a marketing approach that <a href=\"https://cointelegraph.com/news/uk-financial-watchdog-reminds-crypto-firms-october-deadline-marketing-compliance#:~:text=announced%20the%20October%20deadline\">allows customers a “cooling-off period”</a> to consider the risks of investing in digital assets. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\"><strong><em>Blockchain games aren’t really decentralized… but that’s about to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-14T11:00:35.000Z",
    "title": "Bitcoin bear market sees 4 million coins at a loss",
    "url": "https://cryptoslate.com/insights/bitcoin-bear-market-sees-4-million-coins-at-a-loss/",
    "description": "<p>Quick Take In the dynamic world of cryptocurrency, long-term holders (LTHs) of Bitcoin currently possess approximately 4 million coins that are held at a loss. This figure becomes notably significant when viewed through the prism of cyclical market movements. This latest cycle, distinguished by its severity, witnessed a peak where 6 million Bitcoins were held [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-bear-market-sees-4-million-coins-at-a-loss/\">Bitcoin bear market sees 4 million coins at a loss</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-14T10:48:10.000Z",
    "title": "Op-ed: Is Trump’s $500k crypto wallet just his own NFT trading card collection?",
    "url": "https://cryptoslate.com/op-ed-is-trumps-500k-crypto-wallet-just-his-own-nft-trading-card-collection/",
    "description": "<p>Former U.S. President Donald Trump, well-known for his skepticism towards cryptocurrencies, has been revealed to hold between $250,001 and $500,000 in an Ethereum (ETH) wallet, according to his financial disclosure form filed in April 2023. The wallet&#8217;s contents remain undisclosed, leaving the potential for it to encompass Ethereum, ERC20 tokens, or potentially NFTs. The news [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/op-ed-is-trumps-500k-crypto-wallet-just-his-own-nft-trading-card-collection/\">Op-ed: Is Trump&#8217;s $500k crypto wallet just his own NFT trading card collection?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-14T10:53:31.000Z",
    "title": "Ethereum-Based BTCX Token Raises $1.5M to Build the World’s First Bitcoin Xin Blockchain",
    "url": "https://cryptodaily.co.uk/2023/08/ethereum-based-btcx-token-raises-15m-to-build-the-worlds-first-bitcoin-xin-blockchain",
    "description": "<p>Granite city, U.S. Outlying Islands, August 14th, 2023, Chainwire</p><p>BTCX Token, a revolutionary platform inspired by the rebranding of Twitter and the visionary influence of Elon Musk, has secured $1.5 million in pre-seed and seed funding to address inefficiencies in the cryptocurrency market. With the aim of upgrading Bitcoin by introducing hyper-deflationary features, BTCX Token seeks to redefine the future of cryptocurrency, tackling key challenges such as volatility, inefficiency, scalability, and sustainability.</p><p>The recently concluded funding, with a valuation of $10 million, is backed by prominent names in the industry by following the steps of the early-staged Bitcoin, enabling BTCX Token to fully enhance its technological foundation and expand both within and outside the cryptocurrency ecosystem. The involvement of experienced Advisory Board members ensures that BTCX Token will solidify its innovative presence in the market.</p><p>BTCX Token's unique approach in the form of the combustion model represents a systematic means of controlling supply. By permanently reducing the circulating supply through burning, it creates a scarcity that drives value, echoing transformative moves by tech giants and industry leaders. Unlike arbitrary burning mechanisms, BTCX Token's strategy is thoughtfully aligned with its core ideology, crafting a stable and thriving cryptocurrency ecosystem that promises future appreciation.</p><p>The BTCX Token also introduces a novel concept in staking, offering investors a chance to earn BTCX tokens passively by holding them using BTCX's disrupting algorithm. This simplification and democratization of staking marks a significant milestone, setting it apart from more traditional and volatile avenues. By rewarding stakers, BTCX Token aligns user interests with network growth, creating a mutually beneficial environment. This alignment of incentives fosters community participation and engagement, a crucial factor for enduring success in the rapidly changing crypto world.</p><p>The Tokenomics of BTCX Token are intricately woven into the fabric of its design, ensuring long-term viability and a deep commitment to growth. With a total supply of 21,000,000 BTCX Token, the structure includes 5,250,000 BTCX Token for presale, 8,610,000 BTCX Token for burning, 5,040,000 BTCX Token as a reward for staking, and 2,100,000 BTCX Token for liquidity. The presale of BTCX Token Token allowed investors to buy at attractive prices, reflecting the community's confidence in this groundbreaking project. By staying attuned to market needs and trends, BTCX Token demonstrates adaptability, a vital factor in the rapidly evolving crypto landscape.</p><p>The platform's ideology is firmly rooted in inspiration and innovation, and it's poised to pave the way for the next Bitcoin era, offering solutions, opportunities, and a vision for the future. By focusing on adaptability, security, and performance, BTCX Token connects diverse liquidity hubs without fragmentation, ensuring relevance and resilience. The revolution has begun, and BTCX Token is leading the charge.</p><p>After months of development and testing, BTCX Token is ready to embark on a new chapter in crypto history, signifying a leap in thinking and evolution in the cryptocurrency space. As the project's public mainnet is set to open, the world watches with anticipation, recognizing BTCX Token as more than just a new Token; it's the beginning of a new era.</p><p>For more information about BTCX Token, please visit: BTCX.IO</p><p>About BTCX Token</p><p>BTCX Token is more than just a cryptocurrency; it signifies a leap in thinking and an evolution inspired by innovative leadership. By addressing industry needs and introducing innovations in staking, combustion, and presale strategies, BTCX Token is poised to pave the way for the next Bitcoin era.</p><p>Website | Twitter | Telegram</p>ContactPRMason CallahanBitcoin Xinpr@btcx.io"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-14T11:00:17.000Z",
    "title": "WPAY: Revolutionizing P2P Payments Through Cryptographic Proof",
    "url": "https://news.bitcoin.com/wpay-revolutionizing-p2p-payments-through-cryptographic-proof/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/fc2bad8c-f857-4587-8885-abc33bac3f20-768x432.jpeg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/fc2bad8c-f857-4587-8885-abc33bac3f20-300x169.jpeg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/fc2bad8c-f857-4587-8885-abc33bac3f20-1024x576.jpeg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/fc2bad8c-f857-4587-8885-abc33bac3f20-768x432.jpeg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/fc2bad8c-f857-4587-8885-abc33bac3f20-190x107.jpeg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/fc2bad8c-f857-4587-8885-abc33bac3f20-380x214.jpeg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/fc2bad8c-f857-4587-8885-abc33bac3f20-760x428.jpeg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/fc2bad8c-f857-4587-8885-abc33bac3f20.jpeg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. The global financial system has undergone multiple changes throughout its lifetime. First, with the introduction of the gold standard, then with advancements in banking communications, digitized international trade and investment, and remittances. All of these inventions have made the world economy more efficient. In recent years, this trend hasn’t stopped. World-leading entrepreneurs still [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T11:05:25.000Z",
    "title": "Coinbase inundated with legal backing- Your move SEC",
    "url": "https://www.cryptopolitan.com/coinbase-inundated-with-legal-backing/",
    "description": "The tides are turning against the SEC as Coinbase, the renowned crypto exchange, faces legal scrutiny. With the crypto giant backed by a deluge of amicus briefs, the message is clear. It&#8217;s a formidable challenge to question the boundaries of an &#8216;investment contract&#8217; when dealing with digital assets. Now, everyone&#8217;s waiting for the SEC&#8217;s next ... <a title=\"Coinbase inundated with legal backing- Your move SEC\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-inundated-with-legal-backing/\" aria-label=\"More on Coinbase inundated with legal backing- Your move SEC\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T10:59:39.000Z",
    "title": "Google-Backed Anthropic Secures $100 Million Investment from SK Telecom to Advance AI Endeavors",
    "url": "https://www.cryptopolitan.com/anthropic-100-million-investment-in-ai/",
    "description": "In a groundbreaking development at the intersection of technology and investment, Anthropic, a prominent artificial intelligence (AI) firm headquartered in the United States, has solidified its position in the AI landscape by securing a monumental investment of $100 million from South Korea&#8217;s telecom giant, SK Telecom. This strategic collaboration has set the stage for intensified ... <a title=\"Google-Backed Anthropic Secures $100 Million Investment from SK Telecom to Advance AI Endeavors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/anthropic-100-million-investment-in-ai/\" aria-label=\"More on Google-Backed Anthropic Secures $100 Million Investment from SK Telecom to Advance AI Endeavors\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T10:51:41.000Z",
    "title": "SEC non-ruling sets stage for more Bitcoin ETF filings",
    "url": "https://www.cryptopolitan.com/sec-non-ruling-more-bitcoin-etf-filings/",
    "description": "In an era where cryptocurrencies relentlessly demand global attention, the recent non-decision by the SEC regarding Bitcoin ETFs further fuels the anticipation and sets the stage for more filings. This move could be seen as an unsurprising trademark action by the regulatory body, but its implications echo with impact. A Bitter Pill to Swallow Yet ... <a title=\"SEC non-ruling sets stage for more Bitcoin ETF filings\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-non-ruling-more-bitcoin-etf-filings/\" aria-label=\"More on SEC non-ruling sets stage for more Bitcoin ETF filings\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T10:44:13.000Z",
    "title": "U.S. realizes national and economic security’s bond",
    "url": "https://www.cryptopolitan.com/us-realizes-national-economic-security-bond/",
    "description": "For years, the U.S. operated under a seemingly clear distinction: national security was one pillar, and economic stability was another. Yet, the blurring lines between economic and national interests now challenge this compartmentalized view. The United States is waking up to a reality that other major players, particularly China, have recognized for a long time: ... <a title=\"U.S. realizes national and economic security&#8217;s bond\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-realizes-national-economic-security-bond/\" aria-label=\"More on U.S. realizes national and economic security&#8217;s bond\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T10:43:09.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? The live Aave price today is $66.30, with a 24-hour trading volume of $60,743,355 USD. Aave is up 0.62% in the last 24 hours. The current CoinMarketCap ranking is #44, with a live market cap of $962,309,034 USD. It has a circulating supply of 14,513,556 ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-14T11:05:14.000Z",
    "title": "Position Yourself for 20x Gains With Decentraland, Sui, and Pomerdoge",
    "url": "https://www.crypto-news-flash.com/position-yourself-for-20x-gains-with-decentraland-sui-and-pomerdoge/?utm_source=rss&utm_medium=rss&utm_campaign=position-yourself-for-20x-gains-with-decentraland-sui-and-pomerdoge",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-26.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-26.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-26-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-26-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The number of tokens coming to the crypto market is constantly increasing, but there are a few projects with the potential to generate significant returns in the months ahead. Decentraland (MANA), Sui (SUI), and Pomerdoge (POMD) are three such projects that are worth paying attention to. They have utility, strong teams, and are addressing real-world [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-14T11:04:22.000Z",
    "title": "Stellar on the Way to Reach $1 with Massive New Developments – This Is What the Future Holds for XLM",
    "url": "https://www.crypto-news-flash.com/stellar-on-the-way-to-reach-1-with-massive-new-developments-this-is-what-the-future-holds-for-xlm/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-on-the-way-to-reach-1-with-massive-new-developments-this-is-what-the-future-holds-for-xlm",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Swift integration\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />With increased need and growth for micropayments and remittances, Stellar (XLM) has widened its utility and markets. With a clearer crypto regulatory framework in the United States pertaining to Stablecoins and digital assets, XLM price has rallied over 78% YTD. The Stellar (XLM) network has been one of the best-performing top digital assets following the [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-14T10:44:45.000Z",
    "title": "How Many Banks are Adopting Ripple so Far?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-many-banks-are-adopting-ripple-so-far/",
    "description": "<p>The crypto market has taken different forms since its emergence over a decade ago. We’ve seen different projects, but only a few of the old-timers have managed to remain. Projects like Bitcoin, Litecoin, and Ripple have been able to stabilize and are being integrated into different financial institutions and industry communities. Ripple in particular has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-many-banks-are-adopting-ripple-so-far/\">How Many Banks are Adopting Ripple so Far?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-14T10:50:00.000Z",
    "title": "Zunami Protocol Suffers $2.1M Loss in Classic Price Manipulation",
    "url": "https://coinedition.com/zunami-protocol-suffers-2-1m-loss-in-classic-price-manipulation/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/It-appears-that-zStables-have-encountered-an-attack-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Zunami Protocol&#8217;s core liquidity pool, hosted on the decentralized exchange Curve Finance, has become the target of the latest attack in the decentralized finance space. The exploit, which resulted in a loss of more than $2.1 million, was detected and reported by blockchain security firms PeckShield and Ironblocks. Zunami Protocol, a platform specializing in yield [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/zunami-protocol-suffers-2-1m-loss-in-classic-price-manipulation/\">Zunami Protocol Suffers $2.1M Loss in Classic Price Manipulation</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]