[
  {
    "source": "CoinDesk",
    "date": "2024-04-03T14:00:00.000Z",
    "title": "Central Bank Group Starts Tokenization Project to Enhance Monetary System ",
    "url": "https://www.coindesk.com/policy/2024/04/03/central-bank-group-starts-tokenization-project-to-enhance-monetary-system/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The project will investigate the integration of tokenized commercial bank deposits with central bank money using smart contracts and programmability, the Bank for International Settlements said."
  },
  {
    "source": "CoinDesk",
    "date": "2024-04-03T13:54:50.000Z",
    "title": "Texas Takedown: Nic Carter and David Hoffman Square Off for Karate Combat at Consensus",
    "url": "https://www.coindesk.com/consensus-magazine/2024/04/03/texas-takedown-nic-carter-and-david-hoffman-square-off-for-karate-combat-at-consensus/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The influencers, representing Bitcoin and Ethereum, will enter the pit at the Consensus festival May 30, 2024. Fyre Festival’s Billy McFarland is also on the fight card."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-03T13:47:37.000Z",
    "title": " First VR developer integrates with OpenAI setting stage for no-code VR development  ",
    "url": "https://cointelegraph.com/news/vr-developer-openai-no-code-vr-development",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvNjAwMWQ5YjktNjFhMC00ZjQ4LWI0YjUtNzA4NWM4OGQ2MTliLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Victoria VR’s new AI builder platform enables users to create virtual reality experiences and entire metaverses, without any programming skills.</p>\n                    <p><p data-ct-non-breakable=\"true\">Virtual reality (VR) developer Victoria VR has announced its integration with artificial intelligence (AI) giant OpenAI, the creator of the popular generative AI tool ChatGPT.</p><p>The new implementation will enable users to experience the first AI integration through Victoria VR’s AI builder platform, which allows the development of virtual reality experiences through AI algorithms, according to Adam Bém, CEO and co-founder of Victoria VR, who told Cointelegraph:</p><p>Victoria VR’s AI builder enables users to design their own 3D virtual reality experiences, games, and applications without requiring programming knowledge. The OpenAI integration will enable a variety of new content-building, from in-game items and virtual accessories to metaverse platforms.</p><p><a href=\"https://cointelegraph.com/news/vr-developer-openai-no-code-vr-development\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-04-03T14:07:44.000Z",
    "title": "Solana’s stablecoin supply surges past $3 billion, USDC leads the charge",
    "url": "https://cryptoslate.com/solanas-stablecoin-supply-surges-past-3-billion-usdc-leads-the-charge/",
    "description": "<p>Stablecoin supply on the layer-1 blockchain network Solana has increased steadily since the beginning of the year, crossing the $3 billion mark during the past week. Data from the blockchain analytical platform Artemis shows that the stablecoin supply on the network has increased by 55.72% in the last three months to reach $3.12 billion. Notably, [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/solanas-stablecoin-supply-surges-past-3-billion-usdc-leads-the-charge/\">Solana&#8217;s stablecoin supply surges past $3 billion, USDC leads the charge</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-04-03T14:00:27.000Z",
    "title": "Binance launches support for ARC-20 tokens on its inscription marketplace",
    "url": "https://cryptobriefing.com/binance-arc-20-token-support/",
    "description": "Binance Inscription Marketplace launches ARC-20 token support, offering users new trading opportunities and a simplified way to manage asset."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-03T13:52:15.000Z",
    "title": "CrowdSwap launches first decentralized crypto ETF bull run dETF",
    "url": "https://www.cryptopolitan.com/crowdswap-launches-first-decentralized-crypto-etf-bull-run-detf/",
    "description": "CrowdSwap in the decentralized finance (DeFi) space has announced that the first decentralized crypto exchange-traded fund (ETF), Bull Run dETF, has been launched. The novel financial instrument allows investors to access the crypto market using one crypto token to invest in a diversified portfolio. This is one of the fundamental points of cryptocurrency asset use [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-03T13:50:56.000Z",
    "title": "Malaysia’s Border Security Takes Leap Forward with AI and Drone Implementation",
    "url": "https://www.cryptopolitan.com/malaysias-border-security-ai-and-drone-used/",
    "description": "Perlis Raja Muda Ti is passionate about combining Artificial Intelligence (AI), drones, and advanced CCTV (Closed Circuit Television) systems to enhance security at strategic locations throughout the country to protect the Malaysia border security.  Malaysia&#8217;s border security advancements His Highness elaborated on the essence of this feature at the Wang Kelian Border Checkpost, that these [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-04-03T14:04:14.000Z",
    "title": "BTC, ETH see dip; Pullix platform’s rise offers new opportunities ",
    "url": "https://crypto.news/btc-eth-see-dip-pullix-platforms-rise-offers-new-opportunities/",
    "description": "As Bitcoin and Ethereum face significant dips, falling below key price thresholds, the new Pullix platform emerges as a lead option for investors looking for growth opportunities. #sponsored"
  },
  {
    "source": "BTCManager",
    "date": "2024-04-03T14:02:28.000Z",
    "title": "Koala Coin’s 100x potential has Litecoin and Filecoin investors jumping in",
    "url": "https://crypto.news/koala-coins-100x-potential-has-litecoin-and-filecoin-investors-jumping-in/",
    "description": "The Koala Coin presale is attracting Filecoin and Litecoin investors, thanks to its 100x surge potential#partnercontent"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-03T14:00:24.000Z",
    "title": "Fear Grips XRP Market As Liquidations Top $6 Million – Details",
    "url": "https://www.newsbtc.com/analysis/xrp/fear-grips-xrp-market-as-liquidations-top-6-million-details/",
    "description": "The cryptocurrency market continues to feel the tremors of a brutal April Fools&#8217; Day price crash, with XRP taking a significant hit. In the last 24 hours, a staggering $6 million in XRP contracts were liquidated, according to Coinglass data. This liquidation frenzy can be attributed to the sharp price decline experienced by XRP on April 1st. The new month began with XRP trading around $0.61. However, a domino effect triggered by Bitcoin&#8217;s plunge below $67,000 sent shockwaves through the market, dragging down XRP along with other major cryptocurrencies. Related Reading: Canine Comeback? KNINE Brushes Off 50% Loss, Gets Listed On Major Exchange Looking deeper into the liquidation data, a clear trend emerges. A whopping $5.6 million of the liquidated contracts were long positions, indicating that traders who bet on XRP&#8217;s price increasing were forced out of their positions. Conversely, short positions, which profit from price decreases, saw a significantly smaller liquidation value of $324,200. Market Contrasts: XRP&#8217;s Uncertain Path Interestingly, the situation on the spot market, where actual cryptocurrency is bought and sold, presented a contrasting picture. XRP&#8217;s trading volume surged by nearly 60% during the same period when these hefty liquidations occurred. While a surge in volume might suggest increased buying activity, a closer look reveals a dominance of selling pressure. The price action suggests that a significant portion of this volume resulted in selling rather than accumulation. XRP price down in the last week. Source: CoinMarketCap This trend of rising volume alongside a falling price indicates that the downward momentum for XRP might persist. If this selling pressure continues unabated, analysts predict a potential drop in XRP&#8217;s price towards the $0.55 support level. With these conditions in play, XRP&#8217;s future appears uncertain. The token faces the risk of getting caught in a market bloodbath. However, it&#8217;s important to acknowledge dissenting viewpoints. Some analysts hold a different perspective and predict a potential short-term upside for XRP, with a price target of $0.74. Bitcoin is now trading at $66.117. Chart: TradingView XRP&#8217;s Stable Funding Rate Amidst Bearish Sentiment Meanwhile, amidst the bearish sentiment, a glimmer of optimism emerges from technical analysis. Despite the high liquidation value, XRP&#8217;s funding rate has remained stable. In simpler terms, a positive funding rate implies that traders holding long positions (expecting a price increase) are currently paying a premium to those holding short positions (expecting a price decrease). Source: Coinglass This can be interpreted in two ways. It could suggest that some traders still believe in a potential XRP price increase, or it could indicate that short sellers are willing to pay a premium to maintain their bearish positions. Related Reading: Shiba Inu Fires Up With 4,000% Burn – Price Rebound Coming? NewsBTC&#8217;s analysis indicates that XRP&#8217;s Funding Rate currently sits at 0.030, slightly higher than the predicted rate of 0.029. Should the Funding Rate hold positive while the price continues to decline, those holding long positions might not receive the usual funding payments. This scenario could further exacerbate the bearish bias and empower aggressive sellers. Featured image from Pexels, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-04-03T14:07:37.000Z",
    "title": "Cardano ADA Plummets 10.4% as Support at $0.62 Crumbles: What’s Next for ADA Price?",
    "url": "https://www.crypto-news-flash.com/cardano-ada-plummets-10-4-as-support-at-0-62-crumbles-whats-next-for-ada-price/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-ada-plummets-10-4-as-support-at-0-62-crumbles-whats-next-for-ada-price",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-24T094738.208.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-24T094738.208.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-24T094738.208-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-24T094738.208-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-24T094738.208-450x300.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cardano (ADA) suffers a 10% fall to trade below a crucial support level in the ongoing broad market pullback. In the last 30 days, ADA has fallen below this support level thrice but bounced back on the first two occasions.  Investors&#8217; hope of seeing Cardano (ADA) extending its bullish trend fades as the asset slips [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-04-03T13:40:06.000Z",
    "title": "Ethena Soars on Bullish Prediction and Binance Promotion – Can It Reach $10?",
    "url": "https://coinedition.com/ethena-soars-on-bullish-prediction-and-binance-promotion-can-it-reach-10/",
    "description": "<img width=\"512\" height=\"288\" src=\"https://coinedition.com/wp-content/uploads/2024/04/Bull.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethena Soars on Bullish Prediction and Binance Promotion - Can It Reach $10?\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/04/Bull.png 512w, https://coinedition.com/wp-content/uploads/2024/04/Bull-300x169.png 300w, https://coinedition.com/wp-content/uploads/2024/04/Bull-380x214.png 380w, https://coinedition.com/wp-content/uploads/2024/04/Bull-127x70.png 127w, https://coinedition.com/wp-content/uploads/2024/04/Bull-159x89.png 159w, https://coinedition.com/wp-content/uploads/2024/04/Bull-255x143.png 255w, https://coinedition.com/wp-content/uploads/2024/04/Bull-313x175.png 313w, https://coinedition.com/wp-content/uploads/2024/04/Bull-440x247.png 440w, https://coinedition.com/wp-content/uploads/2024/04/Bull-414x233.png 414w, https://coinedition.com/wp-content/uploads/2024/04/Bull-293x165.png 293w, https://coinedition.com/wp-content/uploads/2024/04/Bull-375x211.png 375w, https://coinedition.com/wp-content/uploads/2024/04/Bull-328x185.png 328w, https://coinedition.com/wp-content/uploads/2024/04/Bull-144x81.png 144w, https://coinedition.com/wp-content/uploads/2024/04/Bull-123x70.png 123w, https://coinedition.com/wp-content/uploads/2024/04/Bull-129x73.png 129w, https://coinedition.com/wp-content/uploads/2024/04/Bull-355x200.png 355w\" sizes=\"(max-width: 512px) 100vw, 512px\" /><p>Ethena’s native cryptocurrency, ENA, surged significantly within a few hours of going live. The token launched on Tuesday and rallied from a listing price of $0.57 to $0.92 in less than 24 hours, according to data from TradingView. The surge reflects a 68% gain amid consolidation in the crypto market. Although ENA’s price surge is [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ethena-soars-on-bullish-prediction-and-binance-promotion-can-it-reach-10/\">Ethena Soars on Bullish Prediction and Binance Promotion &#8211; Can It Reach $10?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]