[
  {
    "source": "BTCManager",
    "date": "2023-10-12T23:49:14.000Z",
    "title": "SBF trial day 7: FTX lost $100m in Terra/UST crash",
    "url": "https://crypto.news/sbf-trial-day-7-ftx-lost-100m-in-terra-ust-crash/",
    "description": "Defense attorney Mark Cohen cross-examined former Alameda Research CEO Caroline Ellison after the witness said Sam Bankman-Fried cajoled her into making misleading social media statements and ordered loan repayments funded with stolen customer crypto."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-13T00:00:12.000Z",
    "title": "Analyst Expects The Worst For Bitcoin: Will Bears Force Prices To $17,000?",
    "url": "https://www.newsbtc.com/bitcoin-news/trader-bitcoin-will-bears-force-prices-to-17000/",
    "description": "Taking to X on October 12, Zoran Kole, a trader, said reasonable bids for Bitcoin stand at around $17,000 and $18,000. Though Kole didn&#8217;t provide timelines for retraining these levels, the prediction means the coin could slide 35% to around December 2022 territory if the prediction comes true. Will BTC Drop To December 2022 Levels? The position the trader takes appears contrarian and opposes every optimistic preview laid out by bulls. Bitcoin finds itself in a precarious position and is primarily bearish at spot rates. Looking at the daily chart, the coin is down approximately 17% from July peaks and trickling lower at spot rates. As it is, there could be more drawdown, considering that the coin has been performing in the past few hours. To illustrate, Bitcoin breached the $27,000 support on October 11 and is edging lower at spot rates, confirming the losses from early this week. Related Reading: Bitcoin Finds Rejection At This Historical Line, Bear Market Back On? From a top-down preview, it also appears that BTC bulls are under pressure and have failed to unwind losses of August 17. The flash crash in mid-August saw the coin breach critical support&#8211;now resistance around $28,300. Bitcoin has since failed to break out above this level. There was an attempt on October 2, but bears flew in, reversing all gains.  Bitcoin is within the August 17 and 18 trade range while trading volume, or participation, remains relatively suppressed. From volume analysis, this is bearish. However, how fast the coin can recover or break even lower depends on how prices react at immediate support at around $25,000 registered in mid-September. Bulls Expect Bitcoin Halving And ETFs To Drive Prices The odds of Bitcoin dropping to the $17,000 and $18,000 zone, subsequently confirming Kole&#8217;s prediction, will be elevated if sellers press on, breaching $25,000. Bulls remain confident, citing fundamental factors mostly revolving around 2024&#8217;s Bitcoin halving event, where the network will slash miner rewards by half from 6.25 BTC. At the same time, supporters expect the Securities and Exchange Commission (SEC) to approve the country&#8217;s first spot Bitcoin Exchange-Traded Fund (ETF). Related Reading: What To Expect This Month For XRP Price According To Historical Data In a recent X post, the chief policy officer at Blockchain Association, Jake Chervinsky, expressed optimism about the SEC approving a spot Bitcoin ETF. The policy expert said there are all signs of the agency preparing for the derivatives product. This is especially considering recent revisions made by ARK Investment Management on its prospectus. Eric Balchunas, an ETF analyst, said ARK appeared to have changed its Net Asset Value (NAV), which the agency had commented on. ARK further clarifies that their Trust&#8217;s assets are segregated and stored by a qualified custodian. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-13T00:00:04.000Z",
    "title": "Bitcoin (BTC) Will Shatter Both Silver and Gold’s Market Cap, According to Crypto Analyst – Here’s His Timeline",
    "url": "https://dailyhodl.com/2023/10/12/bitcoin-btc-will-shatter-both-silver-and-golds-market-cap-according-to-crypto-analyst-heres-his-timeline/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/btc-shatter-gold-silver.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/btc-shatter-gold-silver.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/btc-shatter-gold-silver.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/btc-shatter-gold-silver.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/btc-shatter-gold-silver.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/btc-shatter-gold-silver.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/btc-shatter-gold-silver.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto analyst says that Bitcoin (BTC) will soon unseat gold and silver as the world’s leading safe haven assets. In a new video, the anonymous host of the YouTube channel InvestAnswers tells his 447,000 subscribers that the price of Bitcoin cannot be easily manipulated unlike those of the precious metals. “People have been [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/12/bitcoin-btc-will-shatter-both-silver-and-golds-market-cap-according-to-crypto-analyst-heres-his-timeline/\">Bitcoin (BTC) Will Shatter Both Silver and Gold’s Market Cap, According to Crypto Analyst – Here’s His Timeline</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]