[
  {
    "source": "CoinDesk",
    "date": "2023-06-14T00:44:28.000Z",
    "title": "First Mover Asia: Actually, Hong Kong Would Be a Terrible Home for Coinbase",
    "url": "https://www.coindesk.com/markets/2023/06/14/first-mover-asia-actually-hong-kong-would-be-a-terrible-home-for-coinbase/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Hong Kong's rules for crypto would mean plenty of restrictions for Coinbase."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-14T00:50:11.000Z",
    "title": "SEC asks for more time to respond to Coinbase call for crypto clarity",
    "url": "https://cointelegraph.com/news/sec-120-days-respond-coinbase-crypto-clarity",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/5a1f6584-3576-40fb-8316-cbc6a4d7f3c0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The securities regulator said it would make a recommendation within 120 days on Coinbase’s rulemaking request, but says the action has “no merit.”</p>\n                    <p><p>The United States securities regulator has asked for four more months to provide a response to Coinbase’s request for crypto regulatory clarity.</p><p>In a June 13 <a href=\"https://www.courtlistener.com/docket/67273468/30/in-re-coinbase-inc/\" target=\"_blank\" rel=\"noopener nofollow\">letter</a> submitted to the U.S. Court of Appeals for the Third Circuit, the Securities and Exchange Commission (SEC) said it needs an additional 120 days to reply to <a href=\"https://cointelegraph.com/news/coinbase-continues-effort-to-get-mandamus-for-sec-response-to-rulemaking-petition\">Coinbase’s request that</a> it adopt new rules and provide further clarity on the laws governing crypto.</p><p>The letter was in response to the court’s June 6 <a href=\"https://www.courtlistener.com/docket/67273468/28/in-re-coinbase-inc/\" target=\"_blank\" rel=\"noopener nofollow\">order</a> to the SEC which asked the regulator to address if it’s denying the rulemaking or if it needs more time to respond.</p><p>The SEC said it “has not decided what action to take on that petition in whole or in part” and claimed Coinbase’s <a href=\"https://cointelegraph.com/news/sec-has-10-days-to-respond-to-coinbase-complaint-legal-exec\">request for a writ of mandamus</a> has “no merit.”</p><p>The regulator claimed that the mandamus petition “should be denied” but anticipated it would be able to make a recommendation on Coinbase’s petition for rulemaking “within the next 120 days.”</p><p>In response to the letter, Coinbase chief legal officer Paul Grewal informed his 40,000 Twitter followers that the SEC had repeated the “fallacy” that it was yet to decide on any new regulation.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/hinman-documents-suggest-sec-is-the-wrong-agency-to-govern-digital-assets-crypto-lawyer-says\"><strong><em>Hinman documents suggest SEC is the wrong agency to govern digital assets, crypto lawyer says</em></strong></a><strong><em> </em></strong></p><p>He added the letter ignored <a href=\"https://cointelegraph.com/news/sec-s-gary-gensler-takes-another-swipe-at-crypto-in-educational-video\">clear statements</a> from SEC chair <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/gary-gensler\">Gary Gensler</a> that the SEC has “no intent to issue new rules.”</p><p>“[The SEC] instead conflate the evidence of a decision those statements provide with an argument that the statements are themselves a decision,” Grewal said.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">4) they ignore the clear statements of the Chair that confirm they have no intent to issue new rules, and instead conflate the evidence of a decision those statements provide with an argument that the statements are themselves a decision. 3/5</p>&mdash; paulgrewal.eth (@iampaulgrewal) <a href=\"https://twitter.com/iampaulgrewal/status/1668742693529190401?ref_src=twsrc%5Etfw\">June 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“They refuse to commit to any deadline despite the Court's explicit order,” Grewal added.</p><p>The court’s order to the SEC came the same day the <a href=\"https://cointelegraph.com/news/sec-lawsuit-sheds-light-on-coinbase-s-management\">regulator sued Coinbase</a> for offering unregistered securities and operating an unregistered securities exchange.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/joe-lubin-the-truth-about-eth-founders-split-and-crypto-google/\"><strong><em>Joe Lubin — The truth about ETH founders split and ‘Crypto Google’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-14T01:00:00.000Z",
    "title": "Binance Coin Whale Cashes Out $2.3 Million in $BNB After Two Years of Dormancy",
    "url": "https://www.cryptoglobe.com/latest/2023/06/binance-coin-whale-cashes-out-2-3-million-in-bnb-after-two-years-of-dormancy/",
    "description": "A major holder of BNB Chain’s native token, Binance’s $BNB, has reawakened after two years and sold a portion of their holdings on the market, raking in substantial profits and signaling an intriguing shift in the behavior of crypto whales. According to data from on-chain analytics service Lookonchain, the whale liquidated 10,000 BNB tokens at […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-14T00:56:06.000Z",
    "title": "Don’t Look Down: Why It’s Now Or Never For An Ethereum Rally",
    "url": "https://www.newsbtc.com/news/ethereum/down-look-down-ethereum-rally/",
    "description": "Ethereum is finding itself in a very dangerous position, with its fate possibly in the hands of the US SEC: Is it a security, or is it a commodity? Is it decentralized enough?  While the industry figures itself out,  it is now or never for an ETHUSD rally, or there is heightened risk of a catastrophic breakdown in the second-largest cryptocurrency by market cap.  Will Carnage Across Crypto Cause Ethereum To Collapse? Ethereum and most other altcoins have taken a brutal beating lately, brought on by enforcement actions taken by the US SEC against top crypto exchanges. While Ether hasn’t been caught up in the list of cryptocurrencies labeled securities, the market is skeptical that it wont also find itself among the SEC’s list.  Related Reading: Ethereum Forms Weekly Golden Cross, But Is It Enough To Save Crypto? Ethereum isn’t quite as “safe” as Bitcoin from regulatory scrutiny due to its recent change to proof-of-stake. However, it is arguably decentralized enough, which could turn out to be a key measure of what does or doesn’t make a security, according to the recent Hinman docs.  The drop from here looks treacherous &#124; ETHUSD on TradingView.com Why ETHUSD Is At A Critical Inflection Point A technical price bounce in ETHUSD is necessary at this point, or else it could find itself at risk of total collapse. That is if the long term rising wedge pattern breaks down from this level. In contrast, if the level holds, the top trend line of the wedge is located at roughly $10,000 per token.  From a risk versus reward standpoint, the stakes are high — stratospheric new all-time highs at some point, or unprecedented new lows and the worst bear market in Ethereum’s history.  And it all comes down to this pattern.  Related Reading: Bitcoin “Throwback” Could Trigger Flawless Technical Bottom Formation With such little liquidity in crypto, a clouded regulatory climate, and economic turmoil everywhere, a negative ruling in the loosely related XRP case could ultimately push Ether off the cliff it’s hanging from. Meanwhile, returning risk appetite and a pause in interest rate hikes combined with a positive ruling in the XRP case or elsewhere in the SEC drama, could save Ethereum from certain doom.  Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]