[
  {
    "source": "CoinDesk",
    "date": "2023-08-28T08:02:39.000Z",
    "title": "Shiba Inu’s Highly Anticipated Shibarium Bridge is Now 'Fully Functional'",
    "url": "https://www.coindesk.com/tech/2023/08/28/shiba-inus-highly-anticipated-shibarium-bridge-is-now-fully-functional/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Withdrawals can take anywhere from 45 minutes to a week, depending on the token, developers said in a Monday update."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-28T07:52:39.000Z",
    "title": "Indian PM Modi calls for global cryptocurrency framework at G20 Summit ",
    "url": "https://cointelegraph.com/news/india-modi-global-cryptocurrency-framework-g20-summit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/72ef3eb4-5017-4e70-a002-b931e6a3ad1b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>India has advocated for a global crypto framework for years, however, back home, the crypto ecosystem is still looking for a clear regulatory framework and simpler taxation. </p>\n                    <p><p>Indian Prime Minister Narendra Modi called for a global collaboration on formulating crypto regulations during the Group of 20 (G20) summit. G20 President India has taken up the task of advocating for a comprehensive global framework for regulating cryptocurrencies.</p><p>G20 is the premier forum for international economic cooperation that plays a critical role in strengthening global architecture and governance on all major international economic issues. India currently holds the Presidency of the G20.</p><p>During an <a href=\"https://www.businesstoday.in/interactive/photo-essay/bt-exclusive-this-g20-reflects-the-voice-of-the-global-south-says-pm-narendra-modi-83-26-08-2023\" target=\"_blank\" rel=\"noopener nofollow\">interview </a>with a local daily, the Indian PM talked about the role of emerging technologies such as blockchain and cryptocurrency. Modi noted that the nature of such emerging technologies will have an impact on the global scale. Thus, the rules, regulations and framework around it should not belong to one country or a group of countries. </p><p>Modi cited the example of the aviation industry and said just like air traffic control or air security have common global rules and regulations, emerging technologies like cryptocurrency should also see a worldly consensus. He further added that India is doing its part in the crypto regulatory conversation:</p><blockquote>“India’s G20 presidency expanded the crypto conversation beyond financial stability to consider its broader macroeconomic implications, especially for emerging markets and developing economies. Our presidency also hosted enriching seminars and discussions, deepening insights into crypto assets.”</blockquote><p>India released its <a href=\"https://cointelegraph.com/news/crypto-india-puts-forward-suggestions-for-g20-crypto-roadmap\">presidency note that included its input on the global framework for crypto</a>. The suggestions on the crypto framework were aligned with the guidelines written by the Financial Stability Board FSB, the Financial Action Task Force (FATF) and the International Monetary Fund (IMF). The note also contained additional suggestions with a focus on developing economies.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/india-central-bank-negotiates-cross-border-cbdc-payments-with-digital-rupee\"><strong><em>India negotiates cross-border CBDC payments with global central banks</em></strong></a></p><p>India has been <a href=\"https://cointelegraph.com/news/indian-minister-wants-global-crypto-rules-to-curtail-money-laundering-risk\">advocating for a global crypto framework</a> for quite some time, however, back home, the crypto regulatory environment is still shrouded in complexities, lack of clarity and high taxations. The country imposed a <a href=\"https://cointelegraph.com/news/30-crypto-tax-becomes-law-in-india-following-finance-bill-approval\">30% tax on crypto gains in 2022, quite akin to its gambling taxation</a> leading to a <a href=\"https://cointelegraph.com/news/brain-drain-india-s-crypto-tax-forces-budding-crypto-projects-to-move\">mass exodus of budding crypto companies</a> and a <a href=\"https://cointelegraph.com/news/indian-crypto-exchanges-volume-plunges-down-as-30-tax-goes-into-effect\">sharp decline in crypto trading activity</a>.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/elegant-and-ass-backward-jameson-lopps-first-impression-of-bitcoin/\"><strong><em>‘Elegant and ass-backward’. Jameson Lopp’s first impression of Bitcoin</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-08-28T07:52:39.000Z",
    "title": "Indian PM Modi calls for global cryptocurrency framework at G20 Summit",
    "url": "https://cointelegraph.com/news/india-modi-global-cryptocurrency-framework-g20-summit",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/72ef3eb4-5017-4e70-a002-b931e6a3ad1b.jpg\"></p><p>India has advocated for a global crypto framework for years despite its own crypto ecosystem still lacking a clear regulatory framework and simpler taxation.</p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-28T07:58:00.000Z",
    "title": "\n                        dYdX Founder: Crypto Industry Should “Give Up” On US Markets\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/dydx-founder-crypto-industry-should-give-up-on-us-markets",
    "description": "\n                        <p dir=\"ltr\">dYdX founder Antonio Juliano has suggested that the crypto space should &ldquo;give up&rdquo; on the US markets for the next five to ten years and focus on other markets.</p>\n<p dir=\"ltr\">Juliano argued that crypto projects could scale faster by not serving the US markets because they would not have to deal with a hostile regulatory climate.&nbsp;</p>\nPrioritize Markets Outside The US&nbsp;\n<p dir=\"ltr\">In a thread posted on X on the 25th of August, Juliano put forward his argument that builders in the crypto space must look to prioritizing markets and customers outside of the United States. He added that doing so will ensure the project&rsquo;s growth, given that developers will face fewer regulatory hurdles and will be able to focus on user adoption and platform growth. Juliano primarily addressed startup projects rather than fully established players and emphasized that they could scale faster overseas in friendlier markets.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;Crypto builders should just give up serving US customers for now and try to re-enter in 5-10 years. It&rsquo;s not really worth the hassle/compromises. Most of the market is overseas anyway. Innovate there, find PMF [product market fit], then come back with more leverage. The only thing that matters for all of us is crypto finding 10x stronger product market fit.&rdquo;</p>\n\n<p dir=\"ltr\">He further added,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;In the grand scheme of things, barely anyone uses or cares about crypto today. I personally don&rsquo;t care about any outcome except growing crypto 100x+ long term.&rdquo;</p>\n\nLack Of Clear Rules A Major Concern&nbsp;\n<p dir=\"ltr\">Many in the crypto space have stated that the United States needs more clarity when it comes to rules and regulations around crypto. A key example of this need for more clarity is the gray area surrounding the jurisdiction of the United States Securities Exchange (SEC) and the Commodity Futures Trading Commission (CFTC) over the crypto space. The United States government has continued to drag its heels on crypto regulations, and the dYdX founder has suggested that the crypto space needs to grow further in order to have greater sway over US policy.&nbsp;</p>\n<p dir=\"ltr\">Juliano argued that it makes more sense for startups and builders to focus on finding product market fits overseas before returning to the US with the added leverage of large user bases.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;This does not mean crypto US policy work is not important. It absolutely is, as it takes a really long time (must be ready for the re-entry), and much of the world will follow the US&rsquo;s lead. Crypto not yet having world-scale usage/product market fit means we don&rsquo;t yet have much influence in policy. We need to have products with massive usage where users (voters) say, &lsquo;wait, I need this.&rsquo;&rdquo;</p>\n\nA Different Perspective&nbsp;\n<p dir=\"ltr\">The CEO of Coinbase, Brian Armstrong, responded to the post and offered a different perspective to the argument. Armstrong struck a much more optimistic note, stating that the situation would get better in due time.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;I see your point - but I think it will be better in a much shorter time. Probably by next year, if I had to guess. The US always gets it right after exhausting every other option. It will heal from these wounds, no matter how hard a small group of people try to stop progress.&rdquo;</p>\n\n<p dir=\"ltr\">Antonio responded with similar optimism but highlighted in his reply that the situation is different for fully scaled businesses and startups.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;I&rsquo;m optimistic! And we&rsquo;re helping our small part with policy, too. I just think it&rsquo;s different for startups vs. scaled businesses. If you haven&rsquo;t yet found a strong product market fit, the tradeoff to move faster &amp; more freely seems worth the somewhat smaller market size.&rdquo;</p>\n\n<p dir=\"ltr\">Wintermute CEO Evgeny Gaevoy also chimed in, agreeing with Juliano&rsquo;s view, stating things would get better in 2-3 years, or never if not.&nbsp;</p>\nLack Of Regulatory Clarity Hurting US&nbsp;\n<p dir=\"ltr\">The ambiguity regarding regulations only hurts the US markets as big crypto firms look at other markets with regulatory clarity. Coinbase has made several efforts to influence crypto policy in the US. However, the firm is also expanding its global footprint, establishing operations in Ireland, Germany, the Netherlands, and Italy. Additionally, it is also considering a permanent move to the UK or Dubai. Binance, the world&rsquo;s largest cryptocurrency exchange, is also attempting to be regulated in the UK. This comes despite the UK regulator issuing a ban on the exchange.&nbsp;</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T08:02:04.000Z",
    "title": "New phishing attacks target FTX users following Kroll data breach",
    "url": "https://www.cryptopolitan.com/new-phishing-attacks-target-ftx-users/",
    "description": "In a recent development that has sent shockwaves through the cryptocurrency community, Changpeng ‘CZ’ Zhao, the CEO of Binance, one of the world&#8217;s leading crypto exchanges, has issued a stark warning to users of the now-defunct FTX platform. The alert pertains to a new wave of phishing attacks that have been unleashed in the wake ... <a title=\"New phishing attacks target FTX users following Kroll data breach\" class=\"read-more\" href=\"https://www.cryptopolitan.com/new-phishing-attacks-target-ftx-users/\" aria-label=\"More on New phishing attacks target FTX users following Kroll data breach\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T07:51:51.000Z",
    "title": "Shibarium goes live: Shiba Inu’s layer-2 solution ready for action",
    "url": "https://www.cryptopolitan.com/shibarium-goes-live-shiba-inus-layer-2-solution-ready-for-action/",
    "description": "Shytoshi Kusama, the lead developer of Shiba Inu, recently announced that Shibarium, the layer-2 scaling solution for the Shiba Inu blockchain, is officially live and “ready for prime time.” This announcement marks a significant milestone in the Shiba Inu ecosystem, as Shibarium aims to address scalability issues and enhance the overall user experience. Kusama acknowledged ... <a title=\"Shibarium goes live: Shiba Inu&#8217;s layer-2 solution ready for action\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shibarium-goes-live-shiba-inus-layer-2-solution-ready-for-action/\" aria-label=\"More on Shibarium goes live: Shiba Inu&#8217;s layer-2 solution ready for action\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T07:40:26.000Z",
    "title": "Binance’s bold move: Lie Detector test on football legend Cristiano Ronaldo",
    "url": "https://www.cryptopolitan.com/binance-lie-detector-test-cristiano-ronaldo/",
    "description": "In an unprecedented move, Binance, the world-renowned cryptocurrency exchange, recently subjected its football ambassador and NFT creator, Cristiano Ronaldo, to a lie detector test. The event has since sent ripples across the crypto and sports communities, sparking a myriad of reactions and speculations. Ronaldo&#8217;s tweet ignites curiosity Cristiano Ronaldo, the iconic footballer known for his ... <a title=\"Binance&#8217;s bold move: Lie Detector test on football legend Cristiano Ronaldo\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-lie-detector-test-cristiano-ronaldo/\" aria-label=\"More on Binance&#8217;s bold move: Lie Detector test on football legend Cristiano Ronaldo\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-28T07:45:58.000Z",
    "title": "Friend.tech activity plunges, crypto community calls it ‘dead’",
    "url": "https://crypto.news/friend-tech-activity-plunges-crypto-community-calls-it-dead/",
    "description": "The decentralized social media platform, Friend.tech, has witnessed sharp transaction volume and fee income declines over the past week.&#160; According to data provided by the analytics platform Dune, Friend.tech’s transaction volume dropped to $883,000 on Aug. 27. It is a&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-28T07:59:01.000Z",
    "title": "Nicholas Merten Forecasts Uncertain Future For BTC & ETH; LTC, XMR and ROE Ascend in Popularity",
    "url": "https://www.crypto-news-flash.com/nicholas-merten-forecasts-uncertain-future-for-btc-ltc-xmr-and-roe-ascend-in-popularity/",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-141.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-141.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-141-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-141-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-141-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-141-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Nicholas Merten, a prominent figure in the crypto space, has shared his views on the current state of affairs for the top two crypto assets by market cap—Bitcoin (BTC) and Ethereum (ETH). With a substantial following of 511,000 subscribers on DataDash, Merten doesn&#8217;t mince words when he suggests that the bulls for BTC and ETH [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-28T07:41:00.000Z",
    "title": "Sideways Price Movement May Continue for the Next Few Months",
    "url": "https://coinedition.com/sideways-price-movement-may-continue-for-the-next-few-months/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/btc1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/btc1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/btc1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/btc1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/btc1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/btc1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/btc1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/btc1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/btc1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/btc1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/btc1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/btc1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/btc1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/btc1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/btc1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/btc1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/btc1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Michael van de Poppe, a renowned cryptocurrency trader and analyst, recently took to Twitter to address investors’ concerns and shed light on the current quiet state of the cryptocurrency market. In his insightful tweet, he delved into the historical context of Bitcoin&#8217;s cycles and provided his perspective on the current bear market. Van de Poppe [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sideways-price-movement-may-continue-for-the-next-few-months/\">Sideways Price Movement May Continue for the Next Few Months</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]