[
  {
    "source": "CoinDesk",
    "date": "2023-07-11T14:00:00.000Z",
    "title": "Data Startup Space and Time Creates Chatbot Powered by ChatGPT for Database Querying",
    "url": "https://www.coindesk.com/tech/2023/07/11/data-startup-space-and-time-creates-chatbot-powered-by-chatgpt-for-database-querying/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "ChatGPT will enable users to query the decentralized data warehouse using natural language prompts."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-11T13:52:22.000Z",
    "title": "EU’s Metaverse Vision Focuses on Standards, Governance and Funding",
    "url": "https://www.coindesk.com/policy/2023/07/11/eus-metaverse-vision-focuses-on-standards-governance-and-funding/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The EU isn’t proposing new laws but could spend hundreds of millions on research into virtual worlds."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-11T13:49:39.000Z",
    "title": "What Are Play-to-Earn (P2E) Games?",
    "url": "https://decrypt.co/resources/what-are-play-to-earn-p2e-games",
    "description": "Unlike in regular games, where in-game items are held on walled-off data networks and owned by the companies that created the game, NFTs enable players to own the unique assets that they purchase."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-11T13:51:44.000Z",
    "title": "DeFi Protocol Rodeo Finance Hacked; $1.53M of ETH Stolen",
    "url": "https://cryptobriefing.com/defi-protocol-rodeo-finance-hacked-1-53m-of-eth-stolen/?utm_source=feed&utm_medium=rss",
    "description": "Rodeo Finance, a DeFi protocol residing on the Arbitrum blockchain, suffered its second significant exploit on July 11, resulting in a loss of 472 ETH, equating to approximately $888,000 million...."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-11T13:58:00.000Z",
    "title": "Arkham Has Been Doxxing Users",
    "url": "https://cryptodaily.co.uk/2023/07/arkham-has-been-doxxing-users",
    "description": "<p>Crypto data firm Arkham Intelligence is under fire after privacy-conscious users discovered that the firm has been irresponsible about user data.&nbsp;</p>\nArkham&rsquo;s Privacy Problem\n<p>It is never a good idea to be negligent with customer data, especially in the crypto and blockchain space, where users value their security and privacy above everything else. Looks like crypto data firm Arkham Intelligence has learned this the hard way. The company committed multiple gaffes when it revealed its latest service that would uncover the identities of digital wallet owners. Privacy-conscious crypto advocates rose up in arms about this new service when they realized the firm had already been inadvertently leaking private customer information through its referral program.&nbsp;</p>\nFaulty Referral Program Doxxed User Emails\n<p>Under this program, users could invite others to the Arkham platform by sharing a unique referral URL. At quick glance, these URLs appeared to be a random string of characters. But under deeper inspection, it was uncovered that they could be easily deciphered to reveal the user&rsquo;s email address, encrypted with Base64.&nbsp;</p>\n<p>The company&rsquo;s biggest product allows tracking crypto transactions and identification of wallet owners. Its latest product, &ldquo;Intel Exchange,&rdquo; has raised even more eyebrows in the privacy-focused corners of the cryptoverse.&nbsp;</p>\n<p>The uncovering of the weblink slip-up has already added to the company&rsquo;s reputation of not following a more privacy-focused approach in its services and operations.&nbsp;</p>\nM4gicpotato Comments On Privacy Breach\n<p>A privacy advocate known as m4gicpotato, who has been involved in crypto under various aliases since 2017 and is a contributor to the privacy blockchain Beam, shed light on the matter via Twitter.&nbsp;</p>\n<p>They wrote,&nbsp;</p>\n\n<p>&ldquo;All Arkham referral links shared on Twitter is doxxing everyone because the email is in the referral URL.&rdquo;</p>\n\n<p>The post quickly gained viral attention, with m4gicpotato expressing concerns about the infringement on user privacy. They have also criticized Arkham's decision to encode user emails using Base64, emphasizing that this additional layer of obfuscation compounded the privacy concerns surrounding the company.</p>\n<p>The full extent of the number of affected users remains unclear. In theory, anyone who generated and shared a referral link may have inadvertently disclosed their email address. Some users even posted their links on Twitter, further exacerbating the potential privacy risks.</p>\nCEO Responds\n<p>The company&rsquo;s CEO, Miguel Morel, responded to the controversy, claiming that the coding of the referral program was done in this manner in the beta stage to allow Arkham to identify and reward users who were referring others. He claimed that the change has already been made to the code to encrypt user email properly to prevent reverse engineering.&nbsp;</p>\n<p>He tweeted,&nbsp;</p>\n\n<p>&ldquo;Our industry has been plagued with bad actors who survive by hiding in the shadows. Crypto intelligence brings them into the light, and that&rsquo;s what our platform and our research have always done.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-11T14:00:27.000Z",
    "title": "India’s External Affairs Minister Shuns BRICS Currency Talks, Prioritizes Rupee’s Strength Instead",
    "url": "https://news.bitcoin.com/indias-external-affairs-minister-shuns-brics-currency-talks-prioritizes-rupees-strength-instead/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/india-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"India’s External Affairs Minister Shuns BRICS Currency Talks, Prioritizes Rupee&#039;s Strength Instead\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/india-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/india-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/india-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/india-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/india-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/india-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/india-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Members of the BRICS alliance are meeting at a summit in Johannesburg, South Africa, in August, focusing attention on the potential for the BRICS bloc to create a gold-backed reserve currency. However, Subrahmanyam Jaishankar, India&#8217;s external affairs minister, said India isn&#8217;t interested in issuing a common BRICS currency. Instead, he said India is more concerned [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T14:02:57.000Z",
    "title": "Secret code in Brazil’s CBDC allows govt manipulation",
    "url": "https://www.cryptopolitan.com/code-in-brazil-cbdc-allows-govt-manipulation/",
    "description": "The world of finance was recently abuzz following a shocking discovery in the Central Bank Digital Currency (CBDC) of Brazil. It seems that the supposed beacon of decentralization might contain some not-so-secret code enabling a centralized authority to freeze funds or even diminish balances at their discretion. Discovering hidden powers in Brazil&#8217;s digital currency The ... <a title=\"Secret code in Brazil&#8217;s CBDC allows govt manipulation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/code-in-brazil-cbdc-allows-govt-manipulation/\" aria-label=\"More on Secret code in Brazil&#8217;s CBDC allows govt manipulation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T13:52:57.000Z",
    "title": "Regulatory overreach: SEC’s misguided crackdown on crypto",
    "url": "https://www.cryptopolitan.com/secs-misguided-crackdown-on-crypto/",
    "description": "The U.S. Securities and Exchange Commission (SEC) has come under fire for its recent lawsuit against Bittrex, a U.S.-based crypto exchange. Rodrigo Seira, Special Counsel at Paradigm, a crypto investment firm, lambasted the SEC for its alleged overreach and &#8220;unreasonable&#8221; application of the Howey test. This news comes in the wake of Paradigm&#8217;s amicus brief ... <a title=\"Regulatory overreach: SEC&#8217;s misguided crackdown on crypto\" class=\"read-more\" href=\"https://www.cryptopolitan.com/secs-misguided-crackdown-on-crypto/\" aria-label=\"More on Regulatory overreach: SEC&#8217;s misguided crackdown on crypto\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T13:40:37.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-11T14:00:33.000Z",
    "title": "MATIC Gains 10% In One Day, Is A Price Rally Coming?",
    "url": "https://www.newsbtc.com/matic/matic-gains-10-in-one-day-is-a-price-rally-coming/",
    "description": "MATIC, the native token of the Polygon network, has witnessed a significant price gain in the last day, drawing much attention from investors. According to data by CoinMarketCap, MATIC gained by 10.44% over the last 24 hours, representing a better market performance than most top assets, including Bitcoin (BTC), Ethereum (ETH), Solana (SOL), etc. MATIC&#8217;s Price Overview In July  Since the beginning of the month, the MATIC market has experienced a series of gains and losses, which, so far, have been in line with the general crypto market. Related Reading: BNB Price at Make-or-Break Levels As The Bulls Aim Big Above This Resistance MATIC began the month trading around $0.66 before witnessing a steady price rise to hit the $0.71 resistance zone on July 4. However, after failing to break past this barrier, the ERC-20 token saw its price fall by 7%, returning to the $0.66 price mark the following day. On July 6, MATIC attempted another bullish run but was followed by a sharp price decline. But since then, the token has seen a steady price increase since then, leading up to its recent price boost.  In the early hours of today, MATIC‘s price shot up by 10%, breaking past the $0.71 resistance level to attain a peak price of $0.74, and has since remained in that zone. This price increase moves MATIC&#8217;s total gain in July to 12.12% as of this writing. In addition, blockchain analytics firm Santiment also reported the Polygon utility token to have recently witnessed “some positive on-chain signs.&#8221; These included an increase in new daily addresses, declining exchange supply, and low-profit taking. According to data by CoinMarketCap, MATIC is currently exchanging hands at $0.74, with a 0.86% gain in the last hour. The token’s trading volume is up by 93.17% and is now sitting at $543.19 million. With a market cap of $6.9 billion, MATIC ranks as the 12th-largest cryptocurrency. Is A Bullish Run On For MATIC? Following MATIC’s price hike today, there is likely much speculation on the token’s next movement. Looking at its 4-hour chart, the Relative Strength Index (RSI) has just dipped below the overbought zone indicating a bearish trend on the horizon.  However, its Moving Average Convergence Divergence (MACD) is well-placed above the signal line, so the bullish run may still be on. According to MATIC’s price movement, the token appears to be in an ascending channel recording higher highs and lows in the last month. If MATIC manages to break out of its current consolidation zone, it is expected to only trade as high as $0.77, which represents its next resistance level. Related Reading: MATIC Price Prediction: Polygon Bulls Aim For $0.80 On the other hand, if the bears do assume control of the market,  they could push the price of MATIC as low as $0.69, which marks the token’s next support level.  In other news, the general crypto market has witnessed an upturn from its form yesterday, with the total crypto market cap having increased by 1.4% in the last 24 hours.  MATIC Trading At $0.7385 On The 4-Hour Chart &#124; Source: MATICUSD Chart On Tradingview.com Featured Image From Investeek, Chart From Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-11T14:00:46.000Z",
    "title": "Top 3 Cryptocurrencies to Buy Right Now: Kusama, Stepn, Tradecurve",
    "url": "https://www.crypto-news-flash.com/top-3-cryptocurrencies-to-buy-right-now-kusama-stepn-tradecurve/?utm_source=rss&utm_medium=rss&utm_campaign=top-3-cryptocurrencies-to-buy-right-now-kusama-stepn-tradecurve",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-11T103717.304.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-11T103717.304.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-11T103717.304-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency market continues to provide exciting investment opportunities for seasoned traders and newcomers. As we navigate the ever-evolving landscape of digital assets, it&#8217;s essential to stay informed about the best projects with significant potential. In this article, we will explore three cryptocurrencies that are generating buzz and could be excellent additions to your portfolio [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-11T13:50:00.000Z",
    "title": "Bitcoin Users Purchased 3.45% of BTC Circulating Supply at $30.2K",
    "url": "https://coinedition.com/bitcoin-users-purchased-3-45-of-btc-circulating-supply-at-30-2k/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Bank_of_America_Bitcoin_Rally_To_Continue_As_Investors_Move_Tokens.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Bank_of_America_Bitcoin_Rally_To_Continue_As_Investors_Move_Tokens.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Bank_of_America_Bitcoin_Rally_To_Continue_As_Investors_Move_Tokens-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Bank_of_America_Bitcoin_Rally_To_Continue_As_Investors_Move_Tokens-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Bank_of_America_Bitcoin_Rally_To_Continue_As_Investors_Move_Tokens-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Bank_of_America_Bitcoin_Rally_To_Continue_As_Investors_Move_Tokens-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Bank_of_America_Bitcoin_Rally_To_Continue_As_Investors_Move_Tokens-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Data from Glassnode, the onchain and financial metrics platform, shows that around 592,000 Bitcoins, equivalent to 3.45% of the circulating supply, have purchasing prices of $30,200. This suggests small price fluctuations in either direction could send 3.45% of the circulating supply into a position of profit or loss, respectively. Glassnode’s tweet also reported that 3.71% [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-users-purchased-3-45-of-btc-circulating-supply-at-30-2k/\">Bitcoin Users Purchased 3.45% of BTC Circulating Supply at $30.2K</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-11T13:42:07.000Z",
    "title": "PancakeSwap (CAKE) Price Prediction 2023-2030: Will CAKE Price Reach $10 Soon?",
    "url": "https://coinedition.com/pancakeswap-cake-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/PancakeSwap-CAKE-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Pancake Swap (CAKE) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/PancakeSwap-CAKE-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/PancakeSwap-CAKE-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/PancakeSwap-CAKE-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/PancakeSwap-CAKE-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/PancakeSwap-CAKE-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>PancakeSwap (CAKE) is the most popular decentralized exchange on the BNB Chain. PancakeSwap allows you to trade directly from your wallet without using a centralized exchange. On this exchange, you can swap BEP-20 tokens, stake CAKE in Syrup Pools, lend and offer liquidity on the automated market maker (AMM), participate in IFOs (Initial Farm Offerings), [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/pancakeswap-cake-price-prediction/\">PancakeSwap (CAKE) Price Prediction 2023-2030: Will CAKE Price Reach $10 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]