[
  {
    "source": "Decrypt",
    "date": "2023-10-25T00:03:05.000Z",
    "title": "Binance Execs Are Deserting The Company–Here’s Who They Are",
    "url": "https://decrypt.co/203181/who-are-the-executives-leaving-binance",
    "description": "Although the reasons varied, sixteen executives have left the company over the past few years."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-25T00:03:51.000Z",
    "title": "BlackRock's iShares Bitcoin ETF mysteriously disappears — then reappears — on DTCC site",
    "url": "https://cointelegraph.com/news/blackrock-bitcoin-etf-ibtc-relisted-dtcc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/d434426c-11d5-4a8b-8ee2-383fd8fccf60.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BlackRock’s Bitcoin ETF listing staged a sudden reappearance on the DTCC’s website after disappearing for a few hours.</p>\n                    <p><p>The ticker for BlackRock's spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) IBTC has reappeared on the Depository Trust and Clearing Corporation’s (DTCC) website after disappearing for a few hours.</p><p>The price of Bitcoin <a href=\"https://cointelegraph.com/news/bitcoin-btc-price-breaks-34000-etf-excitement-grows\">surged to new yearly highs</a> following the Oct. 23 <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-nasdaq-clearing-firm\">surprise appearance of IBTC on the website</a> with markets frenzied over the sign of a potential soon-to-come spot ETF approval.</p><p>When the ticker quietly disappeared from the site a few hours later, Bitcoin‘s price slumped nearly 3%, indicating that much of the trading activity seems to be hinged on watching ETF-related developments.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/1094ff9b-8dd0-449c-a67e-50f80bc46694.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>BlackRock’s iShares IBTC ETF is back on the DTCC's site. Source: DTCC</em></figcaption></figure><p>Senior Bloomberg ETF analyst Eric Balchunas pointed out the drama around the IBTC listing seemed to be responsible for briefly crashing the DTCC website.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Looks like the DTCC website has crashed <a href=\"https://t.co/UyrrfAl2Eu\">pic.twitter.com/UyrrfAl2Eu</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1716856174325248362?ref_src=twsrc%5Etfw\">October 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The DTCC doesn’t typically witness this level of attention, Balchunas explained — which “speaks to the uniqueness and intensity of this entire saga.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-nasdaq-clearing-firm\"><strong><em>BlackRock’s spot Bitcoin ETF now listed on Nasdaq trade clearing firm — Bloomberg analyst</em></strong></a></p><p>Upon IBTC’s re-listing, one X (Twitter) user highlighted that the previous listing showed a “Y” under the “create/redeem” column while the new listing had an “N.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">One significant change in the DTCC iShares Bitcoin Trust (IBTC) listing I see here. The original listing (on the right) had a &quot;Y&quot; under create/redeem. This one has an &quot;N.&quot; What does that mean <a href=\"https://twitter.com/EricBalchunas?ref_src=twsrc%5Etfw\">@EricBalchunas</a> <a href=\"https://twitter.com/JSeyff?ref_src=twsrc%5Etfw\">@JSeyff</a> ? <a href=\"https://t.co/Y89rK2TqlI\">pic.twitter.com/Y89rK2TqlI</a></p>&mdash; Joe Light (@joelight) <a href=\"https://twitter.com/joelight/status/1716938062159294510?ref_src=twsrc%5Etfw\">October 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Bloomberg ETF analyst James Seyffart responded to the query saying he believes it indicates BlackRock is “getting everything ready to launch if and when they get an SEC approval.”</p><p>“The ‘N’ just means it’s not open for create redeem because it’s not live yet,” Seyffart added. </p><p>“It is standard practice for DTCC to add securities to the NSCC security eligibility file in preparation for the launch of a new ETF to the market,” a DTCC spokesperson said in a statement. “Appearing on the list is not indicative of an outcome for any outstanding regulatory or other approval processes.\"</p><p>Bitcoin has held steady following IBTC’s reappearance and is up 0.15% in the last hour according to CoinMarketCap data.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/11613f57-9971-4f01-8d68-06a2e0a7211c.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin’s price held firm following IBTC’s reappearance — up 0.15% in the last hour. Source: CoinMarketCap</em></figcaption></figure><p>Bitcoin is trading at $33,940 marking a 19.1% gain over the past week. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-24T23:50:05.000Z",
    "title": "Coinbase Seeks Dismissal of SEC Lawsuit Over Crypto Trading",
    "url": "https://cryptobriefing.com/coinbase-seeks-dismissal-sec-lawsuit/?utm_source=feed&utm_medium=rss",
    "description": "Coinbase calls SEC lawsuit regulatory overreach, saying traded crypto tokens are commodities not securities, as it seeks case dismissal."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-24T23:44:00.000Z",
    "title": "Crypto Advocate Tom Emmer Ends Bid for Speaker of the House",
    "url": "https://www.cryptopolitan.com/crypto-advocate-tom-ends-bid-for-speaker/",
    "description": "Minnesota Congressman Tom Emmer, a staunch advocate for cryptocurrency, has withdrawn his candidacy for Speaker of the United States House of Representatives. His decision came after failing to secure the necessary support among Republican lawmakers, leaving the race wide open for other candidates. This marks the third unsuccessful bid for the position since the removal ... <a title=\"Crypto Advocate Tom Emmer Ends Bid for Speaker of the House\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-advocate-tom-ends-bid-for-speaker/\" aria-label=\"More on Crypto Advocate Tom Emmer Ends Bid for Speaker of the House\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-24T23:42:34.000Z",
    "title": "BlackRock’s iShares Bitcoin Trust gets relisted on DTCC",
    "url": "https://www.cryptopolitan.com/blackrock-ishares-bitcoin-trust-on-dtcc/",
    "description": "BlackRock&#8217;s turbulent day began with its iShares Bitcoin Trust facing a sudden delisting, followed by an unanticipated relisting on the Depositary Trust and Clearing Corporation (DTCC) platform. All this commotion, combined with the DTCC website&#8217;s technical issues, has thrust the world&#8217;s largest asset manager back into the limelight. But for those keenly tracking cryptocurrency dynamics, ... <a title=\"BlackRock&#8217;s iShares Bitcoin Trust gets relisted on DTCC\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blackrock-ishares-bitcoin-trust-on-dtcc/\" aria-label=\"More on BlackRock&#8217;s iShares Bitcoin Trust gets relisted on DTCC\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-24T23:42:24.000Z",
    "title": "Coinbase challenges SEC’s Authority files motion to dismiss securities case",
    "url": "https://www.cryptopolitan.com/coinbase-challenges-secs-authority-files/",
    "description": "Cryptocurrency exchange Coinbase has filed a motion to dismiss the case brought against it by the U.S. Securities and Exchange Commission (SEC), arguing that the agency overstepped its boundaries.&#160; The SEC had charged Coinbase for failing to register as a securities exchange, broker, and clearing agency. In response, Coinbase contends that the SEC&#8217;s authority is ... <a title=\"Coinbase challenges SEC&#8217;s Authority files motion to dismiss securities case\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-challenges-secs-authority-files/\" aria-label=\"More on Coinbase challenges SEC&#8217;s Authority files motion to dismiss securities case\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-25T00:00:01.000Z",
    "title": "Bitcoin Spot ETF Approval: Why Price Could Be Set For 300% Surge",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-spot-etf-300-surge/",
    "description": "Bitcoin&#8217;s (BTC) price could be set to experience a 300% surge if a Spot Bitcoin ETF is finally approved by the United States Securities and Exchange Commission (SEC). BTC Could Surge 300% When A Spot ETF Is Approved The predictions of Bitcoin experiencing a 300% surge in its price from analysts can be traced back to the growth of Gold over the years after a Spot Gold ETF (SPDR Gold Shares) was approved back in November 2004, and listed on the New York Stock Exchange (NYSE). Related Reading: This Shibarium Milestone Could Rocket Shiba Inu To August Highs The price of Gold had experienced an eight-year consecutive bull run following its first spot gold ETF. Before the listing, the price of Gold as of November 2004, was around $430/oz, and 3 years later, the numbers had doubled. Fast-forward to the end of 2011, the price of gold was already trading at $1,800/oz indicating a 300% surge in price. Currently, the price of gold is closely gaining on its highest peak price of $1,977/oz, bolstered by geopolitical tensions in the Middle East.  Gold moves slowly and steadily, and it is significantly less volatile than Bitcoin, but analysts anticipate the price of Bitcoin is likely to reach $120,000 in the next couple of years if the digital asset manages to reiterate the movement of Gold since its spot gold ETF approval. If the Bitcoin price were to follow this same pattern, then it could hit $100,000. Recently, Bitcoin has achieved its highest price peak of $35,000 since May 2022. The recent increase in price can be traced back to the propaganda and excitement encompassing a spot Bitcoin ETF approval. However, the digital asset is still 50% down from its all-time high in 2021. Last week, Bitcoin experienced a whirlwind rise of over 10% within minutes after a false report was released by Cointelegraph that a spot Bitcoin ETF had been approved by the SEC. However, the digital asset&#8217;s price later fell almost immediately after the report was proven to be false by Blackrock&#8217;s Chief Executive Officer Larry Fink. Its significant market movement this week has prompted analysts to enter &#8220;price prediction mode.&#8221; The breakout was anticipated by cryptocurrency expert Mags for the end of the year. In addition, a decline below $30,000 is anticipated within the following few months. Analysts believe that this will be the last area of accumulation before a significant breakout that would see the asset rise up to $50,000 prior to the halving.  BTC price corrects downward &#124; Source: BTCUSD on Tradingview.com Bitcoin Spot ETF Boasts Higher Chance Of Approval Recently, analysts have predicted a spot Bitcoin ETF to be approved by January 2024, due to the recent developments following the approval of a Spot Bitcoin ETF by the SEC. Related Reading: Crypto Analyst Lists Reasons Why Cardano (ADA) Will Not Do Well In The Bull Market Bloomberg crypto analyst James Seyffart shared his team&#8217;s prediction of a spot Bitcoin ETF approval on his official X (former Twitter) handle. The team believes that there is a 90% chance of approval of a spot Bitcoin ETF by January 10, 2024. The team&#8217;s prediction came amidst ARK 21Shares Bitcoin ETF filling that had been updated with 5 new pages. The move suggested a &#8220;constructive conversation&#8221; with the SEC, an indication that an investment fund is likely to be approved soon.  Featured image from Leadership News, chart from Tradingview.com"
  }
]