[
  {
    "source": "Decrypt",
    "date": "2023-11-27T22:45:39.000Z",
    "title": "Where in the World Is Hex Founder Richard Heart?",
    "url": "https://decrypt.co/207640/where-world-hex-founder-richard-heart",
    "description": "The SEC has been trying, and apparently failing, to hunt down controversial Hex founder Richard Heart for months."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-27T23:00:00.000Z",
    "title": "Ethereum price falls as regulatory worries and pause in DApp use impact investor sentiment ",
    "url": "http://cointelegraph.com/news/ethereum-price-falls-as-regulatory-worries-and-pause-in-dapp-use-impact-investor-sentiment",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/c3afeedb-68bc-4b4a-9a37-ce03d3f3fdf9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ether price struggles amid regulatory concerns and a drop in DApp usage. </p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) is struggling to maintain the $2,000 support as of Nov. 27, following its third unsuccessful attempt in 15 days to surpass the $2,100 mark. This downturn in Ether's performance comes as the broader cryptocurrency market sentiment deteriorates, thus one needs to analyze whether </p><p>It’s possible that recent developments, such as the U.S. Department of Justice (DOJ) signaling potential severe repercussions for Binance founder Changpeng “CZ” Zhao, have contributed to the negative outlook.</p><p>In a filing on Nov. 22 to a Seattle federal court, U.S. prosecutors sought a review and reversal of a judge’s decision permitting CZ to return to the United Arab Emirates on a $175-million bond. The DOJ argues that Zhao poses an “<a href=\"https://cointelegraph.com/news/cz-a-flight-risk-should-stay-in-us-doj\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cz-a-flight-risk-should-stay-in-us-doj/amp\">unacceptable risk of flight</a> and nonappearance” if allowed to leave the U.S. pending sentencing.</p><h2>Ethereum DApps and DeFi face new challenges </h2><p>The recent $46 million <a href=\"https://cointelegraph.com/news/kyberswap-attacker-used-infinite-money-glitch-drain-funds-defi-expert\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/kyberswap-attacker-used-infinite-money-glitch-drain-funds-defi-expert/amp\">KyberSwap exploit</a> on Nov. 23 has further dampened demand for decentralized finance (DeFi) applications on Ethereum. Despite being previously audited by security experts, including a couple in 2023, the incident has heightened concerns about the safety of the overall DeFi industry. Fortunately for investors, the attacker expressed willingness to return some of the funds, yet the event underscored the sector's vulnerabilities.</p><p>Additionally, investor confidence was shaken by a Nov. 21 blog <a href=\"https://tether.to/en/following-investigations-by-tether-okx-and-the-us-department-of-justice-tether-voluntarily-freezes-225m-in-stolen-usdt-linked-to-international-crime-syndicate/\" target=\"_blank\" rel=\"noopener nofollow\">post</a> from Tether, the firm behind the $88.7 billion stablecoin USD Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>). The post announced the U.S. Secret Service's recent integration into its platform and hinted at forthcoming involvement from the Federal Bureau of Investigation. </p><p>The lack of details in the announcement has led to speculation about an increasingly stringent regulatory landscape for cryptocurrencies, especially with Binance facing heightened scrutiny and Tether's closer collaboration with authorities. These factors are likely contributing to Ether's underperformance, with various on-chain and market indicators suggesting a decline in ETH demand.</p><h2>Investors become cautious as ETH on-chain data reflects weakness </h2><p>Ether exchange-traded products (ETPs) saw only a <a href=\"https://cointelegraph.com/news/inflows-bitcoin-investment-products-reach-1-5-billion-year-to-date\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/inflows-bitcoin-investment-products-reach-1-5-billion-year-to-date/amp\">$34 million inflow in the last week</a>, according to CoinShares. This figure is a modest 10% of the inflow seen by equivalent Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) crypto funds during the same period. The competition between the two assets for spot exchange-traded fund (ETF) approval in the U.S. makes this disparity particularly noteworthy.</p><p>Moreover, the current 7-day average annualized yield of 4.2% on Ethereum staking is less appealing compared to the 5.25% return offered by traditional fixed-income assets. This disparity led to a significant $349 million outflow from Ethereum staking in the previous week, as reported by StakingRewards.</p><p>High transaction costs continue to be a challenge, with the seven-day average transaction fee standing at $7.40. This expense has adversely affected the demand for decentralized applications (DApps), leading to a 21.8% decline in DApps volume on the network in the last week, as per DappRadar.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/f6ed83cc-7d0f-4c60-b99c-2ab8429da40f.png\"><figcaption style=\"text-align: center;\"><em>Top Ethereum Dapps by volume, USD. Source: DappRadar</em></figcaption></figure><p>Notably, while most Ethereum DeFi applications saw a significant drop in activity, competing chains like BNB Chain and Solana experienced an 11% increase and stable activity, respectively.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/judge-stays-decision-changpeng-zhao-leave-us\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/judge-stays-decision-changpeng-zhao-leave-us/amp\">Changpeng Zhao may not leave the US pending court review, says judge</a></em></strong></p><p>Consequently, Ethereum network protocol fees have decreased for four consecutive days, amounting to $5.4 million on Nov. 26, compared to a daily average of $10 million between Nov. 20 and Nov. 23, as reported by DefiLlama. This trend could potentially create a negative spiral, driving users towards competing chains in search of better yields.</p><p> Ether's current price pullback on Nov. 27 reflects growing concerns over regulatory challenges and the potential impact of exploits and sanctions on stablecoins used in DeFi applications. </p><p>The increasing involvement of the DOJ and FBI with Tether elevates the systemic risk for liquidity pools and the entire oracle-based pricing mechanism. While there's no immediate cause for panic selling or fears of a drop to $1,800, the lackluster demand from institutional investors, as indicated by ETP flows, is certainly not a positive sign for the market.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n\n\n\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-27T23:00:01.000Z",
    "title": "Standard Chartered to offer support for China’s digital yuan",
    "url": "https://cryptoslate.com/standard-chartered-to-offer-chinese-digital-yuan-services-to-customers/",
    "description": "<p>Standard Chartered Bank has announced its upcoming participation in China&#8217;s digital yuan, also known as digital renminbi (RMB), with the pilot project set to commence on Nov. 27. The bank said it will provide customers with digital yuan exchange, redemption, and other services. Additionally, the bank indicated it would access the digital currency&#8217;s interconnection platform [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/standard-chartered-to-offer-chinese-digital-yuan-services-to-customers/\">Standard Chartered to offer support for China&#8217;s digital yuan</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-27T23:10:02.000Z",
    "title": "Analyst sees resurgent promise in Terra Classic",
    "url": "https://crypto.news/analyst-sees-resurgent-promise-in-terra-classic/",
    "description": "A crypto analyst observes renewed interest and upside potential for the left-for-dead TerraUSD Classic."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-27T23:00:18.000Z",
    "title": "Ethereum Return To $4,800: Analyst Identifies Pattern To Trigger Rally To ATH",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-return-to-4800-ath/",
    "description": "The Ethereum price has been trading more than 50% below its all-time high of $4,800 for the better part of a year now with no sign of returning to its previous all-time high. However, this slow trend may not continue for much longer as a crypto analyst has identified a pattern that could trigger a rally to its previous highs. Ethereum Stuck Inside A Bullish Triangle In an analysis that was posted on TradingView, crypto analyst FieryTrading identified a unique pattern that the Ethereum price has been trading in for almost two years. This pattern is a bullish triangle pattern and it has persisted for more than one and a half years. Related Reading: Shibarium Transactions Spike 288%, But Why Is Shiba Inu Price Down Today? Looking at the chart, the Ethereum price has not deviated from this bullish triangle and has not had any success breaking out of it. The triangle began toward mid-2022 when the Terra Network collapse triggered a crypto market-wide crash. Then even with multiple major recoveries since then, the altcoin’s price remains inside this triangle. Source: Tradingview.com The lower end of this bullish triangle is at $887 which is the cycle low, and the upper end has been tracked at just above $2,100. Given this range, it suggests that for Ethereum to break out of this bullish triangle, it would have to clear the $2,200 resistance. What Happens If ETH Breaks Out Of This Pattern? As the crypto analyst highlights, a breakout of this pattern would lead to a massive rally. The top of this breakout rally could eventually see the Ethereum price return to its 2021 all-time high levels, reaching above $4,800. ETH price at $2,047 &#124; Source: ETHUSD on Tradingview.com “In my eyes, a break out from this pattern might result in big gains for ETH, since it will burst through an area full of short-trade stop-losses which will be forced to buy back their positions,” FieryTrading said. A move to $4,800 would translate to a 130% increase from its current price levels. Related Reading: Did JPMorgan Secretly Buy 7.5 Million XRP? Here’s What We Know However, the crypto analyst explains that this could be more of a long-term performance, so it is possible that the cryptocurrency will not complete this move until at least the year 2024. But it paints a good, bullish picture for the altcoin going forward. On its own this year, the Ethereum price has performed quite well, especially over the last 30 days. Data from CoinMarketCap shows that ETH’s price has risen 16.53% in one month to break above the $2,000 resistance which has now turned into support. Ethereum remains the second-largest cryptocurrency with a market cap of approximately $250 billion. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Blockchain News, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-27T23:01:04.000Z",
    "title": "Institutions Expecting ETF Spark Largest Capital Inflows to Crypto Since Late 2021: CoinShares",
    "url": "https://dailyhodl.com/2023/11/27/institutions-expecting-etf-spark-largest-capital-inflows-to-crypto-since-late-2021-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/02/market-sentiment-inflows.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/02/market-sentiment-inflows.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/02/market-sentiment-inflows.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/02/market-sentiment-inflows.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/02/market-sentiment-inflows.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/02/market-sentiment-inflows.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/02/market-sentiment-inflows.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says institutional crypto products saw their biggest surge of inflows in two years. In its latest Digital Asset Fund Flows report, CoinShares finds that institutional investors are continuing to invest heavily in digital asset investment products for the ninth week in a row. &#8220;Digital asset investment products saw inflows totaling US $34 6million [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/27/institutions-expecting-etf-spark-largest-capital-inflows-to-crypto-since-late-2021-coinshares/\">Institutions Expecting ETF Spark Largest Capital Inflows to Crypto Since Late 2021: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]