[
  {
    "source": "Cointelegraph",
    "date": "2023-08-23T15:00:00.000Z",
    "title": "Multichain victims search for answers in $1.5B exploit as new evidence emerges",
    "url": "https://cointelegraph.com/news/multichain-victims-search-for-answers-in-billion-dollar-exploit-as-new-evidence-emerges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/039f2a25-7c06-4ee1-a2c4-6d0b68baa8d2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Chinese police may have busted Multichain in a money laundering investigation, but many questions remain, including its CEO’s alleged fake ID. </p>\n                    <p><p>On July 14, developers of the $1.5-billion Chinese cross-chain protocol Multichain confirmed users’ worst fears. The protocol’s CEO, identified only as “Zhaojun He,” was arrested by Chinese authorities in Kunming on May 21 after months of repeated denials on official communication channels. Also allegedly arrested was Multichain’s core team, which was operating in Shanghai. </p><p>It was never disclosed why Zhaojun had been arrested or what the charges were. However, evidence suggests that Multichain funds may have been seized as part of an anti-money laundering operation in the context of a greater crackdown on crypto by Chinese authorities. In addition, an alleged fake ID used by the CEO to register Multichain’s operations only draws more questions. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/4535180a-917c-4db0-917b-d0cb6fce6aca.png\"  /><figcaption style=\"text-align: center;\">Multichain co-founder Alfred Xu assured that the development team was doing “just fine” on May 24 | Source: Telegram</figcaption></figure><h2>Victims demand answers </h2><p>Despite their previous <a href=\"https://docs.multichain.org/getting-started/introduction\" target=\"_blank\" rel=\"noopener nofollow\">assurance</a> of decentralization, the Multichain team revealed that the protocol’s multi-party computation servers and private keys were all under the exclusive control of Zhaojun, which were handed over to police. Without access to such items, the protocol had to shut down, and its team members were nowhere to be found. </p><p>By the time of disclosure on July 14, $1.5 billion in total value locked on Multichain bridge remains inaccessible. An <a href=\"https://cointelegraph.com/news/multichain-mpc-bridge-sees-millions-in-outflows-exploit-feared\">atte</a><a href=\"https://cointelegraph.com/news/multichain-mpc-bridge-sees-millions-in-outflows-exploit-feared\"></a><a href=\"https://cointelegraph.com/news/multichain-mpc-bridge-sees-millions-in-outflows-exploit-feared\">mpt to “rescue”</a> users’ assets earlier that month also resulted in the arrest of Zhaojun’s sister, or so the development team says. Since the arrest began, funds on Multichain have been mysteriously swapped or bridged to unidentified wallets. </p><p>Crypto investor ArkRide, who claims to have over $9,000 stuck in the Multichain protocol, founded a victims group shortly after the incident. The group now has over 300 members. </p><p>ArkRide tells Cointelegraph that when the group formed, the members did not even know the names of key Multichain executives. Subsequently, one member shared a document from the Singapore government’s Accounting and Corporate Regulatory Authority alleged to be a Multichain business filing. The document lists “He Xiaokun,” a resident of Jiangsu Province, China, as the “Director” of the company. After seeing this document, some allege that “Zhaojun He” is in fact a pseudonym for “He Xiaokun.” (Chinese family names are written first.)</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/d916be28-a39f-4df6-a93b-1ddbe7631f29.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>A Singaporean business filing for the principal business entity behind Multichain.</em> <em>Source: Telegram</em></figcaption></figure><p>Several Multichain victims reached out to Chinese embassies and the police in their home countries in an attempt to get further information, but received no response. </p><p>Around the same time as user investigations, they were contacted by the Fantom Foundation, one of the largest users of the Multichain bridge prior to its collapse. Through several Telegram messages, sources at Fantom claimed that it has hired attorneys within China to assist in the recovery process and confirmed Multichain co-founder Zhaojun had been detained by Chinese police. </p><p>“We’ve been gathering info from different parties and have contacted a Chinese law firm to get advice moving forward,” the source also claimed that some of the Multichain funds have been frozen by centralized exchanges and stablecoin issuers and that the foundation is attempting to get these funds distributed to victims. When asked about the possibility of a rug pull, the source wrote: “I do not believe the MC team misappropriated funds.”</p><p>On July 14, Fantom co-founder Andre Cronje <a href=\"https://cointelegraph.com/news/multichain-was-a-big-blow-says-andre-cronje-as-fantom-tvl-slumps\">stated that “Multichain was a big blow”</a> to the network, as much of its total value locked consisted of Multichain derivative stablecoins. Stablecoin issuers Circle and Tether <a href=\"https://cointelegraph.com/news/circle-tether-freezes-over-65m-in-assets-transferred-from-multichain\">have frozen over $65 million in assets</a> associated with the hack, according to blockchain data.</p><p>Cointelegraph reached out to the Fantom Foundation for comments but did not receive a response by the time of publication.</p><p>In a conversation with Cointelegraph, freelance content creator PJ Krypto claimed that he has lost a full month’s paycheck from a client as a result of his funds getting stuck inside the Multichain protocol. According to him, this happened on Aug. 1, nearly a month after the team had announced that the protocol should not be used. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/986b076d-cadc-4f02-8950-36135f3dde47.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Multichain’s user interface gave no warning that it shouldn’t be used. (Aug. 23, 2023)</em></figcaption></figure><p>After his transfer took an unusually long time, PJ checked Multichain’s block explorer and noticed that it had an abnormally large amount of pending transactions. Alarmed, he then checked the protocol’s social media accounts.</p><p>“Nearly, my jaw dropped to the ground when I started reading everything,” he stated, continuing:</p><blockquote>“I don’t know, I guess, sometimes, you just kinda get comfortable. You’ve used something before, and it just works. And you get a little lackadaisical, and I think that’s where I got victimized […] the silly thing is, I could have just sent it to a centralized exchange.”</blockquote><p>The content creator stated that his paycheck is still stuck in the Multichain protocol. As a result, he has been unable to pay his team for subcontracted work they performed for him in July and will likely have to catch up these payments out of revenue from August. “It was a tough pill for them to swallow. I mean, they have bills, right? And I’m behind now on my bills for my content creation.”</p><p>ArkRide lost over $9,000 worth of crypto in Multichain on July 15 under similar circumstances. He expressed relief that his loss from the hack was small and stated that he has met others who fared much worse:</p><blockquote>“My amount that I lost on Multichain is not as much as some people that I talked to lost because there were people who lost nearly half a million. I talked to a couple of guys who lost like $100K each, and there were some people who literally couldn’t stand from their beds, they told me they wanted to commit suicide or something like this.”</blockquote><h2>The investigation continues</h2><p>The Chinese national ID system reveals concerning information on who is the actual director of Multichain. A Chinese national ID is a 15- or 18-digit number containing an individual’s residing jurisdiction, date of birth and gender.</p><p>A query revealed that the individual listed as “He Xiaokun” in Multichain’s Singaporean registration documents was born on May 10, 1955. The same search for “Yang Qiumei,” another director listed on the Multichain registration file, reveals the said individual to have been born on July 20, 1957. Xu Ruduo, the third director of Multichain — possibly referring to co-founder Alfred Xu — registered using a different type of ID. Alfred Xu has been unreachable since the arrest of his colleague. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/90cc1308-f354-4b20-b8e9-ab41db024436.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>The ID search query revealed that “He Xiaokun,” an individual listed as a Multichain director, is currently 68 years ago and lives in a village in Jiangsu.</em> <em>Source: ID Search</em></figcaption></figure><p>By inspection, Zhaojun <a href=\"https://www.fusion.org/en/about-us\" target=\"_blank\" rel=\"noopener nofollow\">appears</a> far too young to fit the profile of either “He Xiaokun,” age 68, or Yang Qiumei, 66. Both individuals had been indicated as residing in the same address at a rural Chinese village. </p><p>A photo of Zhaojun circulated during his participation in the crypto project Fusion, circa 2017, and was previously his profile picture of his official Twitter account. Dejun Qian, co-founder of Fusion, <a href=\"https://twitter.com/djqianfusion/status/1661580864504078336\" target=\"_blank\" rel=\"noopener nofollow\">confirmed</a> Zhaojun was in charge of Multichain during the time of the incident. The two were previously involved in a business dispute regarding Multichain, when it was formerly known as Anyswap. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/25363582-91fc-4ff3-95eb-f8de83895ee6.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Zhaojun He as <a href=\"https://www.fusion.org/en/about-us\" target=\"_blank\" rel=\"noopener nofollow\">listed</a> in Fusion’s developer team. His biography reads: “M</em><em>ore than 10 years of experience in secure Linux R&amp;D. Former technical director of Chinese leading security operating system. Received bachelor of software engineering, Dalian University of Technology.” Source: Fusion</em></figcaption></figure><p>Sources reviewed by Cointelegraph claim that from the very beginning (May 21), Chinese authorities accused Zhaojun of “money laundering” by bridging tainted assets from users via the Multichain protocol. As a result, the police have attempted to seize all protocol assets, user, enterprise or tainted alike, as proceeds of crime. Although some of these seizures were prevented when centralized exchanges or stablecoin issuers froze the funds, the rest have passed into the hands of Chinese authorities, these sources claim.</p><p>Wuwei Liang, a former staff member of crypto exchange CoinXP, <a href=\"https://medium.com/@liangwuwei/%E4%B8%BA%E5%8C%BA%E5%9D%97%E9%93%BE%E5%88%9B%E4%B8%9A%E8%80%85%E6%95%B2%E5%93%8D%E8%AD%A6%E9%92%9F-%E5%88%9B%E5%A7%8B%E4%BA%BA%E8%A2%AB%E5%B8%A6%E8%B5%B0%E5%90%8E-%E5%AE%B6%E5%B1%9E%E5%92%8C%E7%A4%BE%E5%8C%BA%E7%9A%84%E5%BF%AB%E9%80%9F%E9%A2%84%E6%A1%88-a-wake-up-call-for-blockchain-entrepreneurs-a-quick-87581a9fe01d\" target=\"_blank\" rel=\"noopener nofollow\">claims</a> that in 2019, the firm’s entire development team was apprehended by Chinese police, along with the confiscation of protocol funds and shutdown of all relevant operations. Liang Liang, the firm’s CEO, was subsequently charged with operating a “multi-level marketing operation” and a “pyramid scheme,” which could result in the criminal seizure of the projects’ users’ and enterprise’s assets al if convicted. </p><p>During the trial this July, some sources claim that key witnesses and defense attorneys were threatened with legal intimidation. A presiding judge also <a href=\"https://cointelegraph.com/magazine/chinese-police-web3-blockchain-centralization-continues-asia-express/\">reportedly stated</a>, “Presumption of innocence until proven guilty” is “not a correct principle” within Chinese law. The trial has been adjourned. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/23a5e823-d512-4af6-b6ae-8dd54da8e89f.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">CoinXP trial participants allegedly being apprehended by police | Source: Liang Liang</figcaption></figure><p>In a similar incident on May 29, Chinese crypto exchange BKEX suspended withdrawals citing the need to cooperate with police on charges of “money laundering.” The exchange has not been active since, and, like Multichain, its team members are nowhere to be found. Social channels, too, have gone cold. Its website is also offline. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/0852fe1c-ceef-4fcf-9c03-7ce6c4155d2f.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Crypto exchange BKEX’s last message to users before halting withdrawals. </em></figcaption></figure><p>In yet another incident, the entire development team of offshore Hong Kong dollar and Chinese yuan stablecoin issuer Trust Reserve disappeared in May after its office was <a href=\"https://cointelegraph.com/news/cnhc-stablecoin-issuer-detained-by-chinese-police-report\">raided by police</a>. Local sources say that Trust Reserve developers had been detained. Again, the charges are unknown. </p><h2>Allegations of corruption</h2><p>In each of these instances, police have neither informed investors of the charges against protocol developers nor of what process investors can go through to recover their funds. CoinXP’s Liang claims that this is because police are using the legal system as a means of corruption to <a href=\"https://medium.com/@liangwuwei/%E4%B8%BA%E5%8C%BA%E5%9D%97%E9%93%BE%E5%88%9B%E4%B8%9A%E8%80%85%E6%95%B2%E5%93%8D%E8%AD%A6%E9%92%9F-%E5%88%9B%E5%A7%8B%E4%BA%BA%E8%A2%AB%E5%B8%A6%E8%B5%B0%E5%90%8E-%E5%AE%B6%E5%B1%9E%E5%92%8C%E7%A4%BE%E5%8C%BA%E7%9A%84%E5%BF%AB%E9%80%9F%E9%A2%84%E6%A1%88-a-wake-up-call-for-blockchain-entrepreneurs-a-quick-87581a9fe01d\" target=\"_blank\" rel=\"noopener nofollow\">embezzle</a> investors’ capital for their own benefit: </p><blockquote>“Defense lawyers would persuade the parties and their families [of arrested crypto executive] to comply, shut down servers, hand over [private] keys, and cooperate in pleading guilty, claiming that this will result in leniency. Little do they know that this makes it easy for law enforcement to profit from unlawful conduct, ‘legally’ pushing the parties towards prison and, at the same time, ‘legally’ taking away the digital assets that belong to the users, investors and founding team.”</blockquote><p>Whatever the reason, the Chinese government has not yet answered investors’ questions of where the funds have gone and why they have not been returned to users.</p><p>Users such as ArkRide, PJ Krypto and others in the “Multichain Scam” group have so far been unable to get answers as to where their hard-earned money went. But one thing is certain: The Multichain exploit will go down as one of the worst crypto hacks of 2023. Across the world, Multichain users’ assets have mysteriously disappeared. Although some of the funds may be recovered, many are still experiencing the trauma it caused them.</p><p><em>Cointelegraph Editor <a href=\"https://cointelegraph.com/authors/zhiyuan-sun\">Zhiyuan Sun</a> contributed to this story. </em></p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/banning-ransomware-payments-attractive-dangerous-idea/\">Should we ban ransomware payments? It’s an attractive but dangerous idea</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-23T14:44:47.000Z",
    "title": "Thailand’s next prime minister Srettha Thavisin has crypto history",
    "url": "https://cointelegraph.com/news/crypto-thailands-next-prime-minister-srettha-thavisin-has-crypto-history",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/eef465af-3ace-4e19-8325-b7fe1b6533c8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sansiri, one of the largest real estate firms in Thailand, once had Srettha Thavisin as CEO. The firm is known for backing crypto projects like XSpring.</p>\n                    <p><p>Thailand’s parliament on Aug. 22 <a href=\"https://asia.nikkei.com/Politics/Thai-election/Srettha-Thavisin-elected-as-Thailand-s-next-prime-minister\" target=\"_blank\" rel=\"noopener nofollow\">voted</a> for real estate tycoon Srettha Thavisin to be the country’s next prime minister. Thavisin is best known as former president and CEO of Sansiri, one of the largest real estate developers in Thailand, which also has some cryptocurrency background.</p><p>Thavisin, 60, was the only candidate brought to elections by the Pheu Thai Party, receiving 482 votes out of a possible 747 in Thailand’s parliament.</p><p>His victory could potentially have some implications for the cryptocurrency industry in Thailand as his family company, Sansiri, was an active investor in the country’s digital asset industry. Thavisin <a href=\"https://www.bangkokpost.com/business/general/2542885\" target=\"_blank\" rel=\"noopener nofollow\">quit</a> as Sansiri CEO in April 2023 amid speculation that he would be named Thailand’s next PM. He also <a href=\"https://www.nationthailand.com/thailand/politics/40025585\" target=\"_blank\" rel=\"noopener nofollow\">shed</a> his 4.4% stake in Sansiri at the time.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f7d8d12b-2da4-4ca0-bada-4f18bb3ebec0.png\"  /><figcaption style=\"text-align: center;\"><em>Former Sansiri CEO Srettha Thavisin. Source: AP News</em></figcaption></figure><p>In 2021, <a href=\"https://cointelegraph.com/news/thailand-s-xspring-capital-raises-225m-to-build-integrated-financial-marketplace\">Sansiri participated in a $225 million raise</a> for a crypto-friendly investment management firm XSpring Capital. Subsequently, XSpring <a href=\"https://www.bangkokpost.com/life/tech/2407331/xspring-unveils-digital-asset-platform-for-trading\" target=\"_blank\" rel=\"noopener nofollow\">launched</a> a fully integrated cryptocurrency trading platform in 2022. The firm plans to become a top-three company in the crypto exchange market by 2025.</p><p>Apart from backing major crypto projects in Thailand, Thavisin’s Sansiri is also known for issuing and distributing its own tokens through XSpring in 2022. Called “SiriHub Token,” the digital asset is part of a real estate-backed initial coin offering (ICO) which <a href=\"https://www.bangkokpost.com/thailand/pr/2285174/-sirihub-token-to-allocate-the-first-revenue-sharing-to-token-holders-on-april-5\" target=\"_blank\" rel=\"noopener nofollow\">offered</a> a total of 240 million tokens to the general public in 2022.</p><p>The Pheu Thai Party — which Thavisin joined in November 2022 — also previously proposed distributing some money to Thai citizens in case it wins the elections. The party specifically <a href=\"https://cointelegraph.com/news/thai-political-party-looking-at-pm-race-promises-300-in-crypto-upon-victory-report\">promised to give the country’s citizens 10,000 Thai baht</a> ($285) in April 2023 and send the amount using digital currency.</p><p>As Thavisin’s government is <a href=\"https://www.thaipbsworld.com/new-government-expected-to-assume-office-by-end-of-september-wissanu/\" target=\"_blank\" rel=\"noopener nofollow\">expected</a> to assume office by the end of September, it remains to be seen whether his crypto-related background would impact Thailand’s crypto policies.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/thailand-to-seek-shutdown-facebook-crypto-scam-ads\"><strong><em>Thailand threatens Facebook over crypto scams and other fraudulent ads</em></strong></a></p><p>Days ahead of the vote, Thavisin took to X (formerly known as Twitter) to stress that he was participating in the elections because he wanted to “improve the country and the economy.” He <a href=\"https://twitter.com/Thavisin/status/1692410813473341570?s=20\" target=\"_blank\" rel=\"noopener nofollow\">added</a>:</p><blockquote>“My enemies are poverty and the inequality of the people. My goal is the well-being of all Thai people.”</blockquote><p>The news comes a few months after <a href=\"https://cointelegraph.com/news/thailand-to-offer-tax-breaks-for-investment-token-issuers\">Thailand’s cabinet decided to offer tax breaks</a> for corporate income tax and value-added tax for companies that issue investment tokens. Announcing the initiative in March, deputy government spokesman Rachada Dhnadirek said that the government expects investment token offerings to generate 128 billion Thai baht ($3.7 billion) over the next two years.</p><p><a href=\"https://cointelegraph.com/magazine/chinas-risky-bitcoin-court-decision-is-huobi-in-trouble-or-not-asia-express/\"><strong><em>Asia Express: China’s risky Bitcoin court decision, is Huobi in trouble or not?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T14:44:37.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T14:50:16.000Z",
    "title": "Kenya’s 17-Member Committee Officially Kicks Off Investigation Into Worldcoin",
    "url": "https://www.newsbtc.com/altcoin/kenya-investigation-worldcoin/",
    "description": "The Kenyan government has set up a 17-member committee to investigate the operations of American-based cryptocurrency firm Worldcoin, due to its collection of biometric data not satisfying Kenya&#8217;s data privacy laws of the country. The process requires a user to give his iris scans in exchange for a digital ID known as global ID and get free Worldcoin tokens as part of plans to create a new identity and financial network, and the Kenyan government saw this as a security risk. Joint Ad-hoc Committee Investigation In Kenya Kenya&#8217;s National Assembly Speaker Rt Hon. (Dr.) Moses Wetang&#8217;ula, has ordered the Joint Ad Hoc Committee to investigate the activities of Worldcoin and report back to the House within 42 days. Related Reading: The $20 Billion Delay: Appeal Court Pushes Back Decision On Grayscale Spot Bitcoin ETF The Joint Ad-hoc Committee’s investigations on Worldcoin kicked off on Monday after the movement was set afoot following a meeting to outline its Terms of Reference, and to determine potential experts and witnesses to appear before the legislators during its investigation. Gabriel Tongoyo, head of the 17-member committee, stated that the potential experts and witnesses to appear before the legislators will include The Governor of the Central Bank of Kenya, the Cabinet Secretary for the National Treasury, The National Intelligence Service (NIS), the Directorate of Criminal Investigations (DCI), and the Ministry of Health. These experts and witnesses will have to enlighten the legislators on the relationship between Worldcoin and crypto trading in Kenya, and the potential health hazards resulting from the reported iris scans.  Also, the office of the Attorney General, the Registrar of Companies, and the Data Commissioner are expected to answer MP Gabriel Tongoyo&#8217;s questions on the legal framework of the operations of Worldcoin in Kenya. This is to ensure that due diligence was taken in the registration process of Worldcoin in Kenya. The committee has been given this very limited time to provide all the answers needed by the Legislators, as local media have reported that more than 350,000 Kenyans have signed up for Worldcoin in exchange for a free $49 worth of WLD tokens valued at 7,000 Kenyan shillings before the operation was suspended. WLD price struggles amid regulatory pressures &#124; Source: WLDUSDT on Tradingview.com Worldcoin Fails to Meet Privacy Laws Worldcoin&#8217;s collection of biometrics data in exchange for its tokens reportedly failed to meet regulatory requirements in Kenya due to the requirement that disclosure of personal information should only be done in critical circumstances. Immaculate Kassait, the Data Commissioner for Kenya stated that Worldcoin had not been upfront about its objectives during the registration process. The Kenyan Capital Markets Authority also indicated that Worldcoin’s activities in the country were carried out without regulatory supervision, and this led to skepticism among the citizens in sharing their data with Worldcoin. Related Reading: Rumors Of Robinhood Listing XRP Take Center Stage On Crypto Twitter Due to this, the Interior Cabinet Secretary Kithure Kindiki gave the order to suspend every operation of Worldcoin in the country because of security concerns. Eliud Owalo, the digital counterpart of Kithure Kindiki, has also shared a few warnings about Worldcoin. According to recent reports, a raid on Worldcoin&#8217;s facility in Nairobi was carried out two weeks ago by the Kenyan police, leading to the seizure of documents and equipment from the facility for the purpose of accessing the data that has been collected by Worldcoin so that proper investigations can be conducted. However, Worldcoin stated that the company was willing to work with the authorities and outlined how it would restart its operations following the implementation of crowd-control measures. Featured image from BBC, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T15:01:10.000Z",
    "title": "Bitcoin Stable Above $26,000 – Can BlackRock Drive BTC Price to $30,000, or Is $20,000 Next? Deep Dive",
    "url": "https://www.crypto-news-flash.com/bitcoin-stable-above-26000-can-blackrock-drive-btc-price-to-30000-or-is-20000-next-deep-dive/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-stable-above-26000-can-blackrock-drive-btc-price-to-30000-or-is-20000-next-deep-dive",
    "description": "<img width=\"960\" height=\"573\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-300x179.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-768x458.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-336x200.jpg 336w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-36x21.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-48x29.jpg 48w\" sizes=\"(max-width: 960px) 100vw, 960px\" />Bitcoin&#8217;s recent 11% decline has halted near $26,000, with a potential further drop to $20,000.  Short-term holders face a bleak outlook post-BTC futures decrease. Experiencing an 11% decline over the past week, Bitcoin is currently situated around $26,000, displaying minimal upward movement. Individuals who held Bitcoin for the short term and were already witnessing their [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T15:00:34.000Z",
    "title": "A New Age Of Trading: Fidelity vs Tradecurve – Who Leads the Way?",
    "url": "https://www.crypto-news-flash.com/a-new-age-of-trading-fidelity-vs-tradecurve-who-leads-the-way/?utm_source=rss&utm_medium=rss&utm_campaign=a-new-age-of-trading-fidelity-vs-tradecurve-who-leads-the-way",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-111.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-111.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-111-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-evolving world of finance, trading platforms have become the linchpin for investors seeking to maximize their returns. The rise of cryptocurrencies and decentralized finance has further fueled the need for robust, secure, and versatile trading platforms. Two names that stand out in this competitive landscape are Fidelity and Tradecurve. While Fidelity has been [...]"
  }
]