[
  {
    "source": "CoinDesk",
    "date": "2023-08-04T07:51:35.000Z",
    "title": "Toshi Emerges as Key Meme Coin Play Among Traders on Coinbase’s Base Blockchain",
    "url": "https://www.coindesk.com/markets/2023/08/04/toshi-emerges-as-key-meme-coin-play-among-traders-on-coinbases-base-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Base is officially going live next week, and some small-cap token hunters are already laying bets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T07:49:00.000Z",
    "title": "Binance approves Shiba Inu as collateral asset ",
    "url": "https://cointelegraph.com/news/binance-approves-shiba-inu-as-collateral-asset",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/d3271151-719d-40b8-b5d2-eb13db60896a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The cryptocurrency exchange also announced the addition of 22 cryptocurrencies as loanable assets and collateral assets on its Flexible Loan and VIP Loan services.</p>\n                    <p><p>Crypto exchange Binance on Friday, August 4, said it is adding 22 new loanable assets and new collateral assets to its Flexible Loan and VIP Loan service.</p><p>In its official <a href=\"https://www.binance.com/en/support/announcement/new-loanable-assets-and-collateral-assets-available-on-flexible-loan-vip-loan-2023-08-04-9c8303191b1a4a6bbd7458b3e4ff668d\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, the crypto exchange disclosed several new collateral assets, among them Shiba Inu (<a href=\"https://cointelegraph.com/shiba-inu-price-index\">SHIB</a>), Compound (<a href=\"https://cointelegraph.com/compound-price-index\">COMP</a>) and Theta Network (<a href=\"https://cointelegraph.com/theta-price-index\">THETA</a>). This development has also fueled speculation about the potential listing of BONE token on Binance, coinciding with the upcoming launch of the Layer-2 blockchain, Shibarium, anticipated to take place in August.</p><p>The cryptocurrency exchange concurrently announced the addition of 22 cryptocurrencies as loanable assets and collateral assets on its Flexible Loan and VIP Loan services. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/60cb6490-9024-4017-83fe-7adc500db7a5.JPG\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of Binance's new collateral assets announcement.  Source: Binance</em></figcaption></figure><p>Binance has now expanded its Flexible Loan service by including 8 new loanable assets, which are AUCTION, PYR, ILV, KNC, YGG, GAS, CELO and IRIS. Furthermore, the VIP Loan service has been expanded with 6 new loanable assets, including NKN, FARM, DIA, YGG, OGN and ACA.</p><p>In a separate <a href=\"https://www.binance.com/en/support/announcement/binance-adds-xem-on-cross-margin-70dae2e0c9924fba8d9ff0cfbf3bf14d\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, Binance introduced XEM as a newly available borrowable asset on Cross Margin. The XEM/USDT pair is now supported on the cross-margin trading platform.</p><p>Following the Shibarium testnet PuppyNet launch, BONE has been listed on various cryptocurrency exchanges, including OKX, Huobi and Crypto.com. The milestones achieved by the Shibarium testnet reflect the growing demand for the chain and its associated token, BONE.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/btc-price-risks-binance-fears-bitcoin-bulls\"><strong><em>BTC price risks new sub-$29K dip as Binance fears test Bitcoin bulls</em></strong></a></p><p>Binance is closely considering the listing of the BONE token, and its potential inclusion is contingent upon the forthcoming Shibarium mainnet launch, which fulfills one of the listing prerequisites for new tokens. The lead developer, Shytoshi Kusama, had previously <a href=\"https://cointelegraph.com/news/shibarium-could-go-live-in-august-developer\">disclosed the possibility of the Shibarium launch</a> happening in August.</p><p>Currently, SHIB is<a href=\"https://coinmarketcap.com/currencies/shiba-inu/\" target=\"_blank\" rel=\"noopener nofollow\"> trading</a> at $0.0000083, showing an increase of approximately 2% in the last 24 hours. On the other hand, BONE has <a href=\"https://coinmarketcap.com/community/articles/64c900a0d777d4791d5d9930/\" target=\"_blank\" rel=\"noopener nofollow\">experienced</a> a 1% price rise in the past 24 hours and a notable 24% surge over the past week.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-04T07:53:27.000Z",
    "title": "What Price Could XRP Eventually Reach?",
    "url": "https://cryptodaily.co.uk/2023/08/what-price-could-xrp-eventually-reach",
    "description": "<p>Following Ripple's partial victory over the SEC, it was ruled XRP does not constitute a security concerning programmatic sales. What is a realistic price prediction following this decision, and what is it based on? </p>\n<p>Popular Twitter personality Shannon Thorp was recently asked to give a price prediction for XRP with no time frame or a set idea of circulating supply or the dollar amount it equates to. Thorp has noticed a trend among the XRP followers (the #XRPArmy as they are better known on Twitter) and found the camp to be divided. One side bases their future views and prediction based solely on charts, taking guidance from past price action and trends that Bitcoin &ndash; the biggest crypto by market cap, follows to determine short-term price predictions. The other side bases their views on Ripple and XRP's utility. This camp of XRP supporters is of the opinion that partnerships and the replacement of \"antiquated systems\" will determine XRP's price.</p>\n\n<p dir=\"ltr\" lang=\"en\">People have long asked what will be the price of $XRP, when will this &ldquo;utility&rdquo; come? In my opinion, now more than ever I see a divided #XRPArmy! One side looking at only charts, taking cues from the past and trends that follow Bitcoin to draw short term price predictions. Whilst&hellip;</p>\n&mdash; Shannon Thorp (@thorpshannon87) July 29, 2023\n<p>\n\n</p>\n<p>Thorp believes no side is correct since XRP does not constitute a security. In Ms Thorp's view, it is wrong to continue making price predictions for XRP as a \"security.\"</p>\n<p>After the XRP ruling, the FedNow announcement and the US Congress passing its proposed crypto regulation bill to Senate, estimates of XRP's future price have come under question.</p>\n<p>Vahil Capital released a white paper on XRP's price, which indicates XRP's price could reach anywhere between $3,500 and $21,900. Vahil based its predictions on two years of research and six distinct quantitative models. The VC firm's prediction has been met with shock and scepticism, to say the least, and this apprehension is based on chart analysts stating the chart does not allow for such a prediction.</p>\nMs Thorp was quick to call out an issue with the charts:\n<p>She argues that if a range for XRP is set at $1.00 - $5.00, what it ultimately means is that if one company owned all the XRP tokens in circulation, then yes, it would mean that that company in possession of all 100 billion tokens would have a Liquidity Strength of (LS) anywhere between $100B - $500B - bear in mind that is a burn rate for every transaction regardless of the amount. An LS such as this does not factor for economic growth, messaging and settling and does not account for the benefits of using XRP.</p>\n<p>Thorp explains the situation concerning SWIFT &ndash; SWIFT is one of the systems Ripple aims to improve on. As it stands, SWIFT handles 44.8 million messages in a day, does not include settlements, and at this point, is only half of what Ripple can do. Based on a $7 trillion value for SWIFT in a day (not 24/7 or 365). She suggests that if Ripple, in its ten years of innovation and partnerships, has only gained 30% of SWIFTs value, it would put XRP's daily value at $2.1 trillion (about 13.2 million messages). XRP settles in 1 -5 seconds, and the liquidity would be there. However, settlements are fast, but if a user were to send a $750 million transaction with an LS of $1.00, for argument's sake, it equates to 10% of all that bank's XRP.</p>\nTo determine a price prediction, Thorp follows the following logic:\n<p>Considering all banks globally, all the XRP that has been burnt through other transactions, all the XRP tokens all its holder own, and all the XRP given to other large banks and the XRP tokens awarded to its creators. Then account for the XRP on liquidity hubs and exchanges and present an amount representing a range, using 50B-75B XRP at any one-time support LS. Then spread that across 300 -1000 banks, liquidity providers and governments.</p>\nThe math follows:\n<p>75 billion XRP at $1.00 amounts to $75 billion. Take $75B and divide by 1,000 banks equals $75 million XRP/dollars for each bank or liquidity provider. Further, assume big banks hold more XRP than small banks, and small banks would use liquidity providers. Then consider that Ripple has released all the XRP tokens to reach a circulating supply of 75 billion.</p>\n<p>LS would be $75M per bank, and a top-tier bank such as J.P. Morgan moves more than $8 trillion a day and considers service overlaps with SWIFT and the assumption that Ripple only has 10% of the market ($800 billion). This movement only accounts for cross-border transactions, not CBDCs, derivatives, real estate, NFTs and technical parallels. Vahil Capital's price prediction and logic do not seem so outrageous anymore.</p>\n<p>Thorp finally comes to her own price prediction. The Twitter personality has placed her prediction anywhere from $100 - $500 in the short term of four to seven months. She argues that it all comes down to LS if XRP is $100 at a supply of only 50 billion, which equates to an LS of $5 trillion and at $500 makes an LS of $25 trillion. The logic is that this gives the market room to grow and breathe and ensures that no one company needs to own billions of XRP tokens for day-to-day operation.</p>\nXRP Is On the Rise But Has Not Even Reached $1\n<p>While the ruling was highly bullish for XRP, and the price soared over 100% following Judge Torres's order, it has not continued its momentum. XRP reached a high of $0.84 on July 19 but currently trades at $0.66.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T08:06:18.000Z",
    "title": "MIT Task Force Puts Forth Guidelines for Generative-AI Use in Legal Practice",
    "url": "https://www.cryptopolitan.com/mit-guidelines-generative-ai-legal-practice/",
    "description": "In response to the growing concerns surrounding the ethical use of artificial intelligence (AI) in the legal profession, law.MIT.edu has formed a Task Force dedicated to developing principles and guidelines for the responsible application of generative-AI in legal work. This initiative comes after a New York attorney was fined for submitting a fake, AI-generated brief ... <a title=\"MIT Task Force Puts Forth Guidelines for Generative-AI Use in Legal Practice\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mit-guidelines-generative-ai-legal-practice/\" aria-label=\"More on MIT Task Force Puts Forth Guidelines for Generative-AI Use in Legal Practice\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T08:06:02.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 How much is LTC worth? The current price of Litecoin stands at $82.8. Over the past 24 hours, it has experienced a trading volume of $1.72B and a market capitalization of $6.71B. Litecoin’s market dominance is at 0.55%. However, there has been a decrease in the LTC price by 4.2% within ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T07:58:06.000Z",
    "title": "Block Inc. Reports 34% Increase in Bitcoin Revenue Amid Market Uncertainty",
    "url": "https://www.cryptopolitan.com/block-inc-34-increase-in-bitcoin-revenue/",
    "description": "Block Inc., a leading payment technology company, recently announced its Q2 earnings, revealing a 34% increase in Bitcoin revenue year-on-year. Despite this impressive growth, the company&#8217;s shares experienced a downturn in after-hours trading. This article delves into the details of Block&#8217;s Q2 earnings report, its Bitcoin investments, and the market&#8217;s reaction. Block&#8217;s Bitcoin Revenue Soars ... <a title=\"Block Inc. Reports 34% Increase in Bitcoin Revenue Amid Market Uncertainty\" class=\"read-more\" href=\"https://www.cryptopolitan.com/block-inc-34-increase-in-bitcoin-revenue/\" aria-label=\"More on Block Inc. Reports 34% Increase in Bitcoin Revenue Amid Market Uncertainty\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T07:45:00.000Z",
    "title": "Bridging the AI Digital Divide by Ensuring an Inclusive Future Amidst Rapid Automation",
    "url": "https://www.cryptopolitan.com/bridging-ai-digital-divide-amidst-automation/",
    "description": "Policymakers grapple with the challenge of bridging the AI digital divide to ensure fair distribution of the benefits of artificial intelligence. As the rapid adoption of AI disrupts nonroutine tasks, concerns arise over job security and socio-economic inequalities. Vishal Rana and Bert Verhoeven discuss possible solutions, including a universal basic income, to help individuals cope ... <a title=\"Bridging the AI Digital Divide by Ensuring an Inclusive Future Amidst Rapid Automation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bridging-ai-digital-divide-amidst-automation/\" aria-label=\"More on Bridging the AI Digital Divide by Ensuring an Inclusive Future Amidst Rapid Automation\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-04T08:00:25.000Z",
    "title": "Ethereum Price Recovery at Risk if it Fails to Clear $1,900, Investors Flock to DigiToads Presale Set to 100x by 2024",
    "url": "https://www.crypto-news-flash.com/ethereum-price-recovery-at-risk-if-it-fails-to-clear-1900-investors-flock-to-digitoads-presale-set-to-100x-by-2024/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-price-recovery-at-risk-if-it-fails-to-clear-1900-investors-flock-to-digitoads-presale-set-to-100x-by-2024",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T093349.792.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T093349.792.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T093349.792-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ethereum, the second-largest cryptocurrency by market capitalization, has been on a roller-coaster ride lately. While it managed to bounce back from its recent dip, the price recovery is currently at risk as it struggles to break above the crucial resistance level of $1,900. The price of Ethereum has been on a recovery track in recent [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-04T07:54:11.000Z",
    "title": "Fitch’s US Credit Rating Downgrade: A Potential Trigger for Bitcoin Bull Run? Analysts Speculate on BTC Response",
    "url": "https://www.crypto-news-flash.com/fitchs-us-credit-rating-downgrade-a-potential-trigger-for-bitcoin-bull-run-analysts-speculate-on-btc-response/?utm_source=rss&utm_medium=rss&utm_campaign=fitchs-us-credit-rating-downgrade-a-potential-trigger-for-bitcoin-bull-run-analysts-speculate-on-btc-response",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T141850.259-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T141850.259-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T141850.259-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T141850.259-1-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Fitch&#8217;s recent downgrade of the U.S. credit rating from AAA to AA+ has led to a shift towards perceived safer assets like cash and short-term instruments. Analysts are exploring whether this could potentially trigger a Bitcoin bull run. Key market indicators have remained stable despite the downgrade. While Bitcoin&#8217;s short-term price outlook appears negative, its [...]"
  }
]