[
  {
    "source": "Crypto Daily",
    "date": "2023-08-06T13:22:00.000Z",
    "title": "Crypto Weekly Roundup: Curve Exploit, BALD Drama, And More",
    "url": "https://cryptodaily.co.uk/2023/08/crypto-weekly-roundup-curve-exploit-bald-drama-and-more",
    "description": "<p>The Curve Finance exploit has hit the crypto markets hard, with several stablecoin pools on the platform being drained and unsettling the pricing and liquidity of numerous DeFi services. Let&rsquo;s find out more.&nbsp;&nbsp;</p>\nBitcoin\n<p>Miami Mayor Francis Suarez announced that he is officially accepting Bitcoin for his presidential campaign donations.</p>\n<p>Ilya Lichtenstein admitted to laundering the $4.5B worth of Bitcoin stolen during the 2016 Bitfinex attack; his wife, Heather Morgan, also pleaded guilty.</p>\n<p>Michael Saylor, CEO of Microstrategy, recently said that his company will keep buying more Bitcoin. The company&rsquo;s latest purchase of 467 BTCs has pushed its Q2 profits significantly higher.&nbsp;</p>\n<p>A currency swap with the PBoC and a loan from the Development Bank of Latin America helped the Argentine central bank meet its $3.7 billion obligation to the IMF.</p>\n<p>The Bitcoin bull market is going through the same three steps it has taken in its previous bull markets.</p>\nEthereum\n<p>ProShares has become the eleventh to apply to the U.S. Securities and Exchange Commission (SEC) to register an Ether exchange-traded fund (ETF).</p>\nDeFi\n<p>DeFi platforms Curve Finance, Alchemix, and Metronome have announced a joint initiative to recover the stolen funds in the wake of the recent exploits that hit Curve&rsquo;s pools.&nbsp;&nbsp;</p>\n<p>Curve Finance and CEO Michael Egorov have received support from prominent names in the crypto space, including Justin Sun and DCF God.&nbsp;</p>\n<p>After the Curve exploits, Upbit, the largest cryptocurrency exchange in South Korea, has temporarily suspended CRV withdrawals and deposits.&nbsp;</p>\nAltcoins\n<p>As bitcoin moves sideways and downward, the altcoins are hit harder as usual, with around $40 billion having been wiped off of the combined market cap of all altcoins.&nbsp;</p>\n<p>As Bitcoin approaches its own halving next year, Litecoin&rsquo;s halving has already arrived, as miner block rewards go from 12.5 to 6.25 LTC per block.</p>\n<p>Arkham Intel Exchange&rsquo;s first bounty has unearthed evidence of undisclosed wallets containing $160 million worth of digital assets tied to Do Kwon and Terraform Labs.&nbsp;</p>\nTechnology\n<p>Identity and financial public network, Worldcoin has revealed plans to allow companies and governments everywhere to use its ID system.&nbsp;</p>\nBusiness\n<p>Bankrupt cryptocurrency lending platform BlockFi's restructuring plan has taken a step closer to fruition, as the firm announced that its disclosure statement had received conditional approval from the U.S. Bankruptcy Court in New Jersey.</p>\n<p>Genesis Global Holdco LLC, and FTX Trading Ltd., two crypto companies navigating bankruptcy, have announced an in-principle agreement to resolve a dispute central to their respective Chapter 11 cases.</p>\n<p>Ozzy entrepreneur Russell Ty Wilson has taken his crypto exchange Coinspot to incredible heights despite a huge scam by tracking down perpetrators.&nbsp;</p>\nRegulation\n<p>SEC Chair Gary Gensler has expressed serious concern for AI technology, calling it a serious threat to financial markets.&nbsp;</p>\n<p>Laura Swain, the Chief Judge of the U.S. District Court for the Southern District Of New York, has dismissed a class action lawsuit against USDT issuer Tether and its sister company Bitfinex.&nbsp;</p>\n<p>In light of the evolving regulatory landscape surrounding digital currencies in the US, Revolut has decided to shut down its crypto offerings in the country.&nbsp;</p>\n<p>Hong Kong's Hashkey Exchange has become the first cryptocurrency platform in the city-state to upgrade its type 1 and type 7 licenses, thus obtaining approval to serve retail customers.</p>\n<p>An Australian financial regulator has sued the eToro crypto trading platform over &ldquo;volatile&rdquo; trading products.</p>\n<p>Prominent lawmakers have urged the Biden administration to initiate a crackdown on crypto tax evaders and enforce tax reporting guidelines for users in the crypto space.&nbsp;</p>\n<p>In a nightmare scenario, a report has claimed that DoJ officials are contemplating bringing fraud charges against Binance, the world&rsquo;s largest cryptocurrency exchange.</p>\n<p>A congressional committee in the United States is currently investigating asset management firm BlackRock for its role in facilitating investments into Chinese companies that the U.S. government has blacklisted.&nbsp;</p>\n<p>Bankrupt crypto platform, Voyager Digital Holdings Inc., may have been a victim of a hacking attack during the court-supervised process of liquidating assets to repay its customers.&nbsp;</p>\n<p>Dubai's financial landscape has witnessed a significant development with the awarding of a full crypto license to Laser Digital Middle East FZE, a subsidiary of Nomura Holdings Inc.&nbsp;</p>\n<p>An unsettling rumor is suggesting a potential link between the liquidity pull on the BALD meme coin to the already embattled ex-CEO of FTX, Sam Bankman-Fried.</p>\n<p>Coinbase CEO Brian Armstrong has revealed that the SEC had asked Coinbase to halt all cryptocurrency trading, except that of Bitcoin.&nbsp;</p>\nNFT\n<p>Gaming giant GameStop Corp is set to discontinue its digital wallets owing to the \"regulatory uncertainty of the crypto space,\" the company announced in a notice posted on its website.</p>\nWeb3\n<p>Leading web3 company Yuga Labs has announced its agreement to acquire tech innovator Roar Studios to bolster its ambitions Otherside project.&nbsp;</p>\n<p>Japan&rsquo;s Blockchain Association (JBA) reportedly urged the government to revise tax rules imposed on virtual assets.</p>\n<p>Former smartphone giant BlackBerry&rsquo;s cybersecurity division has identified notorious malware families exclusively targeting cryptocurrencies and the crypto ecosystem.&nbsp;</p>\n<p>A scammer stole $20 million worth of Tether (USDT) on the 1st of August, using a zero transfer phishing attack.&nbsp;</p>\n<p>Decentralized exchange LeetSwap, built on Coinbase&rsquo;s Layer 2 blockchain Base, recently suspended trading due to fears of a potential exploit.&nbsp;</p>\n<p>The Curve Finance exploit has put more than $100 million in cryptocurrency at risk, intensifying security concerns in Ethereum's DeFi ecosystem.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  }
]