[
  {
    "source": "CryptoSlate",
    "date": "2023-07-15T11:11:48.000Z",
    "title": "U.S. presidential candidate Ron DeSantis says he’ll “nix” CBDCs upon election",
    "url": "https://cryptoslate.com/u-s-presidential-candidate-ron-desantis-says-hell-nix-cbdcs-upon-election/",
    "description": "<p>Republican Presidential candidate Ron DeSantis said on July 4 that he will immediately block central bank digital currency (CBDC) if he is elected president. DeSantis said in an interview with Blaze Media: &#8220;If I am the president, on day one, we will nix central bank digital currency — done, dead, not happening in this country [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/u-s-presidential-candidate-ron-desantis-says-hell-nix-cbdcs-upon-election/\">U.S. presidential candidate Ron DeSantis says he’ll “nix” CBDCs upon election</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-15T11:30:27.000Z",
    "title": "Pantera Founder Dan Morehead Predicts Upcoming Bull Market: ‘We Can Rally Now’",
    "url": "https://news.bitcoin.com/pantera-founder-dan-morehead-predicts-upcoming-bull-market-we-can-rally-now/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1436657456-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Pantera CEO Dan Morehead Predicts Upcoming Bull Market: &#039;We Can Rally Now&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1436657456-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1436657456-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1436657456-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1436657456-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1436657456-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1436657456-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1436657456.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Dan Morehead, founder and managing partner of Pantera Capital, a digital assets investment hedge fund, has predicted an upcoming bull market for cryptocurrency. In Pantera&#8217;s latest letter, Morehead states that blockchain-related assets have started to decouple from market indexes and that the time is right for a new crypto rally. Pantera&#8217;s Founder Dan Morehead: Blockchain [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-15T11:14:29.000Z",
    "title": "Ripple CEO calls XRP ruling a win for crypto industry",
    "url": "https://crypto.news/ripple-ceo-calls-xrp-ruling-a-win-for-crypto-industry/",
    "description": "Ripple CEO Brad Garlinghouse has shared his sentiments about a recent ruling that XRP is not a security. On July 13, Federal District judge Analisa Torres ruled that XRP, the native currency of the XRP Ledger (XRP), is not an unregistered security,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-15T11:34:22.000Z",
    "title": "Polygon (MATIC) Flexes Muscles In The Last Week With 27% Gain – Details",
    "url": "https://www.newsbtc.com/matic/polygon-matic-flexes-muscles-in-the-last-week-with-27-gain-details/",
    "description": "Polygon (MATIC) has demonstrated a significant price surge in the past week, rising by 27.39%. This bullish momentum has been further reinforced by a 9.38% increase in the last 24 hours. However, in the most recent hour, the price experienced a slight decline of 1.04%. Currently trading at $0.84 per MATIC, the cryptocurrency remains 71.11% below its all-time high of $2.92. Reasons For The Price Movement Multiple factors have contributed to the recent price movement of the crypto. Firstly, a favorable court ruling for XRP ripple effect on market sentiment, potentially influencing the performance of other cryptocurrencies like MATIC. The court&#8217;s determination that XRP is not a security has provided investors reassurance and positively impacted the overall cryptocurrency market. Related Reading: PEPE Sees Sharp 17% Surge, But Will This Whale Spoil The Party? Furthermore, the increased activity of decentralized applications (Dapps) on the Polygon Network has significantly driven up demand for MATIC. The network&#8217;s reputation as a scalable and efficient solution for the Ethereum network has attracted numerous developers and users to build and interact with Dapps on the platform. This heightened interest in the Polygon Network has increased demand for MATIC tokens. Additionally, the highly anticipated launch of Polygon 2.0 has generated excitement within the community. This proposed upgrade aims to enhance the functionality and scalability of the Polygon Network, allowing for the support of multiple chains without compromising security. If successfully implemented, Polygon 2.0 could further solidify MATIC&#8217;s position as a leading blockchain solution, potentially attracting more investors and driving higher prices. Expectations For Polygon Looking ahead, Polygon holds promising prospects for further growth and development. With a total value locked (TVL) of $1 billion on the Polygon Network, the platform has established itself as a prominent second-layer scaling solution for Ethereum. The increasing TVL, which has grown from $878 million in the previous month, indicates a rising demand for Polygon&#8217;s processing capabilities and underscores its potential for further adoption and expansion. The impending launch of Polygon 2.0 adds a layer of anticipation. This upgrade will introduce new features and improvements, enhancing the network&#8217;s efficiency and functionality. If successfully implemented, Polygon 2.0 could attract even more users, developers, and investors, ultimately driving up the price of MATIC. However, it is essential to exercise caution and closely monitor the market. While the current price movement suggests positive momentum, competition from other scaling solutions, such as Arbirtrum (ARB) and Optimism (OP), should be considered. Additionally, developments in privacy implementations utilizing zero-knowledge proofs could introduce new dynamics to the market. Related Reading: XRP Explodes With 1,300% Surge In Trading Volume As crypto Exchanges Jump On Board Investors and traders should remain attentive to updates regarding the Polygon 2.0 upgrade, ongoing market trends, and any significant announcements within the cryptocurrency ecosystem that may impact the future performance of MATIC. By staying informed and exercising due diligence, market participants can make more informed decisions regarding their investments in Polygon. (This site’s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured Image from istock, chart from TradingView."
  }
]