[
  {
    "source": "CoinDesk",
    "date": "2023-09-27T16:00:39.000Z",
    "title": "ETH Staking Has a Bright Future, Despite Regulatory Uncertainty",
    "url": "https://www.coindesk.com/consensus-magazine/2023/09/27/eth-staking-has-a-bright-future-despite-regulatory-uncertainty/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The SEC’s incoherent approach to the market is having a chilling effect on compliant and regulated investors. But there are workarounds that give investors greater comfort, says Jason Hall, CEO of Methodic Capital."
  },
  {
    "source": "CoinDesk",
    "date": "2023-09-27T15:45:00.000Z",
    "title": "With All Eyes on a Spot Bitcoin ETF Approval, Don’t Sleep on ETH (or ETHE)",
    "url": "https://www.coindesk.com/markets/2023/09/27/with-all-eyes-on-a-spot-bitcoin-etf-approval-dont-sleep-on-eth-or-ethe/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "There’s a better trade than buying Grayscale’s GBTC if you’re optimistic the SEC will approve crypto ETFs."
  },
  {
    "source": "CoinDesk",
    "date": "2023-09-27T15:45:00.000Z",
    "title": "Five Reasons Why the World Needs a Standardized Ethereum Staking Rate",
    "url": "https://www.coindesk.com/business/2023/09/27/five-reasons-why-the-world-needs-a-standardized-ethereum-staking-rate/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "An ether (ETH) staking benchmark could attract institutional investors into the Ethereum ecosystem and unlock a new wave of innovation."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-27T15:59:04.000Z",
    "title": "Former NBA Champion Matthew Dellavedova Joins Swan Bitcoin",
    "url": "https://decrypt.co/198895/former-nba-champion-matthew-dellavedova-joins-swan-bitcoin",
    "description": "The basketball player used to reach out to Bitcoiners to offer them tickets to his NBA games. “Some people thought I was scamming them,” he told Decrypt."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-27T16:00:00.000Z",
    "title": "How AI is changing crypto: Hype vs. reality  ",
    "url": "https://cointelegraph.com/news/how-ai-changing-crypto-hype-reality",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/8ff23536-44c7-4773-a996-337344c2be2e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In the latest Cointelegraph Report, we assessed the value AI is bringing to the crypto industry, by separating the hype from real use cases. </p>\n                    <p><p>In the latest Cointelegraph Report, we sought to find out the real value AI brings to the crypto industry beyond the hype surrounding the technology. To do so, we looked into three main areas where AI is impacting crypto: trading, data analytics, and user experience. </p><p>For many years, trading bots have allowed users to execute trades in an automated way based on certain pre-set parameters. </p><p>With the recent development of Large Language Models such as ChatGPT, AI-powered bots are capable of processing large amounts of historical data, which can be helpful in predicting future price movements. </p><p>However, despite the latest advancements, AI-powered bots are still not sophisticated enough to elaborate complex trading strategies. </p><p>“It's basically like having a bunch of dumb partners who can, who can adhere to very basic commands, but they can't do any like very complicated thinking themselves,” said Eric Crown, a professional crypto trader and YouTuber, sharing his personal experience with AI-powered bots. </p><p>Regarding data analytics, AI tools can process large amounts of public data scattered on the blockchain, providing valuable insights into the dynamics of the crypto ecosystem and assessing potential market risks. </p><p>However, a large amount of market data is kept off-chain by centralized exchanges and therefore is not publicly available. That limits the capability of AI to make accurate assessments. </p><p>To find out more about the real value at the intersection of AI in crypto beyond the hype, watch out full Cointelegraph Report on our YouTube channel and make sure to subscribe! </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/-mBrS_xLh6o\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-27T15:56:00.000Z",
    "title": "US House committee leadership threatens to subpoena SEC over FTX docs",
    "url": "https://cointelegraph.com/news/house-committee-threatens-subpoena-ftx-documents",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/58c4c3d0-9b0f-4c2c-b307-d3036de6773d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Patrick McHenry led efforts starting in February to obtain communication records between SEC and Justice Department staff over the arrest of Sam Bankman-Fried.</p>\n                    <p><p>Rep. Patrick McHenry, who chairs the United States House Financial Services Committee, has suggested that he may try to subpoena the Securities and Exchange Commission (SEC) over documents related to former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a>, or SBF.</p><p>In a Sept. 27 hearing on oversight of the commission, McHenry <a href=\"https://www.youtube.com/watch?v=7tnv9MRh0GM\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> chair SEC <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/gary-gensler\">Gary Gensler</a> had made efforts to “choke off the digital asset ecosystem” in addition to “refus[ing] to be transparent with Congress” in aconnections between the commission, FTX and SBF. The committee chair said the government body had “made multiple requests” for documents <a href=\"https://cointelegraph.com/news/us-lawmakers-question-sec-chair-on-timing-of-sam-bankman-fried-s-arrest\">regarding the timing of SBF’s arrest</a> given a previously scheduled appearance before Congress.</p><p>“Seven months later, the committee has not received a single non-public document that was not part of a [Freedom of Information Act] production,” said McHenry. “As I said, our patience is wearing thin [...] I do not want to be the first chairman of this committee to issue a subpoena to the Securities and Exchange Commission.”</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/7tnv9MRh0GM\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>In February, the committee leadership under McHenry requested the SEC provide documents related to communications between its staff as well as the Justice Department regarding charges filed against Bankman-Fried. McHenry <a href=\"https://cointelegraph.com/news/financial-services-chair-mchenry-send-sec-second-request-for-records-related-to-sbf-arrest\">renewed the request in April</a> and May, after claiming the SEC had only provided publicly available information.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-leaked-docs-revealed\"><strong><em>Sam Bankman-Fried says, ‘I did what I thought was right,' in leaked docs: Report</em></strong></a></p><p>While McHenry’s opening statement at the hearing focused on digital assets and oversight, ranking member Maxine Waters expressed concerns about how a <a href=\"https://cointelegraph.com/news/crypto-bills-delayed-us-government-shutdown\">potential shutdown of the U.S. government</a> could affect the SEC’s capabilities. Gensler said that if U.S. lawmakers were unable to reach an agreement on government spending by Sept. 30, roughly 92-93% of SEC staff would be furloughed.</p><p>Upon questioning from McHenry, Gensler said Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) was “not a security” as it didn’t meet the Howie test over what qualifies as an investment contract. The SEC chair comments seemed to <a href=\"https://cointelegraph.com/news/sec-gary-gensler-in-2018-video-says-btc-eth-not-securities\">affirm the same position</a> on BTC he took during his time as professor with the Massachusetts Institute of Technology in 2018.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-27T16:02:42.000Z",
    "title": "SEC Postpones Verdict on Ark 21shares and Global X Spot Bitcoin ETFs",
    "url": "https://news.bitcoin.com/sec-postpones-verdict-on-ark-21shares-and-global-x-spot-bitcoin-etfs/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd-2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC Postpones Verdict on Ark 21Shares and Global X Spot Bitcoin ETFs\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd-2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd-2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd-2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd-2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd-2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd-2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/dd-2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. securities regulator recently announced a delay in its verdict on the Ark 21shares Bitcoin ETF. Consequently, the U.S. Securities and Exchange Commission (SEC) has marked January 10, 2024, as the decisive day to either greenlight or reject the proposed amendment. SEC Pushes Back Decision on 2 Spot Bitcoin ETFs A statement from the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T15:45:48.000Z",
    "title": "Tecpetrol pioneers gas-driven crypto mining in Argentine Patagonia",
    "url": "https://www.cryptopolitan.com/tecpetrol-pioneers-gas-driven-crypto-mining-in-argentine-patagonia/",
    "description": "Buenos Aires-based oil firm Tecpetrol has rolled out an innovative solution. By mid-fall, the company will launch its first gas-driven crypto mining facility in the Los Toldos 2 Este region, located north of Vaca Muerta in Argentine Patagonia. This endeavor stems from a dual motivation, advancing their crude oil production while capitalizing on otherwise discarded ... <a title=\"Tecpetrol pioneers gas-driven crypto mining in Argentine Patagonia\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tecpetrol-pioneers-gas-driven-crypto-mining-in-argentine-patagonia/\" aria-label=\"More on Tecpetrol pioneers gas-driven crypto mining in Argentine Patagonia\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T15:40:26.000Z",
    "title": "Marvel’s Spider-Man 2 Will Allow Players to Ride Coney Island Attractions",
    "url": "https://www.cryptopolitan.com/spider-man-2-ride-coney-island-attractions/",
    "description": "Get ready, Spider-Man fans! We have less than a month to go before Marvel&#8217;s Spider-Man 2 releases on PlayStation 5. And this time, the game includes a cool and surprising feature: the ability to ride the famous Coney Island attractions! As the release date gets closer, excitement for this game is growing among the fans. ... <a title=\"Marvel&#8217;s Spider-Man 2 Will Allow Players to Ride Coney Island Attractions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/spider-man-2-ride-coney-island-attractions/\" aria-label=\"More on Marvel&#8217;s Spider-Man 2 Will Allow Players to Ride Coney Island Attractions\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-27T15:56:41.000Z",
    "title": "Binance France temporarily expands partnership with Paysafe",
    "url": "https://crypto.news/binance-france-on-the-hunt-for-a-new-partner/",
    "description": "Binance France has temporarily extended its collaboration with Paysafe. The partnership, which was supposed to end on Sep. 25, has been prolonged to ensure smooth operations"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-27T16:00:44.000Z",
    "title": "LINK Price Broke Critical Level, Macro Downtrend Behind? Analyst Forecasts",
    "url": "https://www.newsbtc.com/news/chainlink/link-price-broke-critical-level-macro-downtrend-behind-analyst-forecasts/",
    "description": "The LINK price has been the best performer in the crypto top 20 by market cap over the past week, data from Coingecko shows. The cryptocurrency recently broke out of a critical level and a downtrend and seems poised to re-capture previously lost territory. Related Reading: LINK Price Extends Increase, Will Chainlink Bulls Be Able to Hit $8.5 Milestone? As of this writing, the LINK price trades at $7.70 with a 4% profit in the last 24 hours. Over the previous week, the cryptocurrency recorded a 12% profit while other tokens in the top 20 have mostly seen losses, with Bitcoin Cash (BCH) standing as the exception along with Chainlink. LINK Price About To Start Uptrend? When the LINK price broke below in early 2023, the cryptocurrency began to descend to its current levels. The price struggled to stabilize around $5.5, but once buyers stabilized the cryptocurrency around those levels, the token formed a sideways trend. Since May this year, the LINK price has been moving in this trend with a high of around $8. The chart below shows that trader Rekt Capital believes the token’s recent price action spells good news for LINK holders. The chart above shows that LINK broke above an essential trend after closing a weekly candle above $7. Thus, the cryptocurrency could rise to $10.5 before meeting any critical resistance. If the token can extend its gains, the next target could see LINK hitting $16.5 as an ultimate stand for bears to take back control and prevent a full-on bull run above $20. As of this writing, the crypto market, at least its two most important tokens, Bitcoin (BTC) and Ethereum (ETH), are playing along on short timeframes. These cryptocurrencies recorded a 2% and 2.4% profit in the last 24 hours. Stars Align For Chainlink In addition to the favorable winds in the crypto market, the Chainlink platform is strengthening its fundamentals. Today, the platform launched its Cross-Chain Interoperability Protocol (CCIP) on the Coinbase-backed second-layer network Base. Related Reading: Chainlink (LINK) Spikes 6% On The Weekly Chart As Market Sees Correction This integration is set to onboard more applications and use cases on the Chainlink network. Thus, the underlying asset could benefit from greater appreciation in the long run. John Eid, Chief Business Officer at Chainlink Labs said the following about the integration: Base and Chainlink are both building on the forefront of blockchain development as we work to bring the next wave of millions of new users into our industry. The scalability and technological creativity of Base as a layer 2 solution, combined with an ever increasing number of Chainlink services, is a boon for developers looking to build the next generation of cross-chain applications and services. Cover image from Unsplash, Chart from Tradingview and Rekt Capital"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-27T15:40:35.000Z",
    "title": "Cloud Mining Made Easy with TopHash Hashpower Marketplace",
    "url": "https://www.crypto-news-flash.com/cloud-mining-made-easy-with-tophash-hashpower-marketplace/?utm_source=rss&utm_medium=rss&utm_campaign=cloud-mining-made-easy-with-tophash-hashpower-marketplace",
    "description": "<img width=\"1180\" height=\"600\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/TOPHASH.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/TOPHASH.jpg 1180w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/TOPHASH-300x153.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/TOPHASH-1024x521.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/TOPHASH-768x391.jpg 768w\" sizes=\"(max-width: 1180px) 100vw, 1180px\" />Crypto mining is no longer profitable for several reasons, according to crypto enthusiasts. However, a branch of crypto mining still attracts many miners globally by offering a way to earn consistent passive income. There is only one problem: cloud mining is only available to some. But to change this, TopHash, a hash power marketplace and [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-27T15:48:00.000Z",
    "title": "Bitcoin Will Test $20K Level Again Without Significant Catalysts: Expert",
    "url": "https://coinedition.com/bitcoin-will-test-20k-level-again-without-significant-catalysts-expert/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Bitcoin-Bull-Run.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin Will Test $20K Level\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Bitcoin-Bull-Run.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Bitcoin-Bull-Run-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Bitcoin-Bull-Run-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Bitcoin-Bull-Run-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Bitcoin-Bull-Run-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Bitcoin-Bull-Run-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent interview, market expert Greg Dickerson provided insights into the current state of crypto markets, particularly Bitcoin, amid the U.S. Federal Reserve&#8217;s shifting monetary policies and the broader economic landscape. Dickerson placed the ongoing discussions about interest rates in a historical context, underscoring the impact of past rate hikes and cuts on various [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-will-test-20k-level-again-without-significant-catalysts-expert/\">Bitcoin Will Test $20K Level Again Without Significant Catalysts: Expert</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]