[
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T02:50:24.000Z",
    "title": "AI-coded smart contracts may be flawed and 'fail miserably' when attacked: CertiK",
    "url": "https://cointelegraph.com/news/ai-smart-contracts-flawed-fail-under-attack-certik",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/7e6c7cbd-7639-415a-aae3-25e70f6d696d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>CertiK’s security chief Kang Li thinks inexperienced programmers using AI tools such as ChatGPT to write smart contracts is a recipe for disaster.</p>\n                    <p><p>Artificial intelligence tools such as OpenAI’s ChatGPT will create more problems, bugs and attack vectors if used to write smart contracts and build cryptocurrency projects, says an executive from blockchain security firm CertiK.</p><p>Kang Li, CertiK’s chief security officer, explained to Cointelegraph at Korean Blockchain Week on Sept. 5 that <a href=\"https://cointelegraph.com/news/chatgpt-won-t-replace-developers-ethdubai-devs-weigh-in\">ChatGPT cannot pick up logical code bugs</a> the same way experienced developers can.</p><p>Li suggested ChatGPT may create more bugs than identify them which could be catastrophic for first-time or amateur-level coders looking to build their own projects.</p><blockquote>“ChatGPT will enable a bunch of people that have never had all this training to jump in, they can start right now and I start to worry about morphological design problems buried in there.”</blockquote><p>“You write something and ChatGPT helps you build it but because of all these design flaws it may fail miserably when attackers start coming,” he added.</p><p>Instead, Li believes ChatGPT <a href=\"https://cointelegraph.com/news/use-chat-gpt-like-a-pro\">should be used as an engineer’s assistant</a> because it’s better at explaining what a line of code actually means.</p><blockquote>“I think ChatGPT is a great helpful tool for people doing code analysis and reverse engineering. It's definitely a good assistant and it'll improve our efficiency tremendously.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/88d1726a-2232-4cf7-9eea-6c3dac6a5d9b.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>The Korean Blockchain Week crowd gathering for a keynote. Source: Andrew Fenton/Cointelegraph</em></figcaption></figure><p>He stressed that it shouldn’t be relied on for writing code — especially by inexperienced programmers looking to build something monetizable.</p><p>Li said he will back his assertions for at least the next two to three years as he acknowledged the rapid developments in AI may vastly improve ChatGPT’s capabilities.</p><h3>AI tech getting better at social engineering exploits</h3><p>Meanwhile, Richard Ma, the co-founder and CEO of Web3 security firm Quantstamp, told Cointelegraph at KBW on Sept. 4 that AI tools are becoming more successful at social engineering attacks — many of which are identical to attempts by humans.</p><p>Ma said Quantstamp’s clients are reporting an alarming amount of ever more sophisticated social engineering attempts.</p><blockquote>“[With] the recent ones, it looks like people have been using machine learning to write emails and messages. It's a lot more convincing than the social engineering attempts from a couple of years ago.”</blockquote><p>While the ordinary internet user has been plagued with AI-generated spam emails for years, Ma believes we’re approaching a point where we won’t know if malicious messages are AI or human-generated.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/twitter-hack-social-engineering-attack-on-employee-admin-panels\"><strong><em>Twitter Hack: ‘Social Engineering Attack’ on Employee Admin Panels</em></strong></a></p><p>“It's gonna get harder to distinguish between humans messaging you [or] pretty convincing AI messaging you and writing a personal message,” he said.</p><p><a href=\"https://cointelegraph.com/news/cz-binance-ceo-warns-of-phishing-scams-as-uniswap-founder-gets-hacked\">Crypto industry pundits</a> are already being targeted, while others are being impersonated by AI bots. Ma believes it will only get worse.</p><blockquote>“In crypto, there's a lot of databases with all the contact information for the key people from each project. So the hackers have access to that [and] they have an AI that can basically try to message people in different ways.”</blockquote><p>“It’s pretty hard to train your whole company to not respond to those things,” Ma added.</p><p>Ma said better anti-phishing software is coming to market which can help companies mitigate against potential attacks.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-apple-devloping-pocket-ai-deep-fake-music-deal-hypnotize-gpt-4/\"><strong><em>AI Eye: Apple developing pocket AI, deep fake music deal, hypnotizing GPT-4</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-06T02:50:44.000Z",
    "title": "Machine Learning Exposes Human-Induced Climate Change’s Rainfall Chao",
    "url": "https://www.cryptopolitan.com/machine-learning-human-induced-climate/",
    "description": "Recent research published in Nature, led by international scientists, including two researchers from the University of Hawaiʻi at Mānoa, has harnessed the power of artificial intelligence (machine learning) to unveil the unsettling truth about human-induced climate change. Using machine learning, this groundbreaking study demonstrates that human-produced carbon dioxide emissions are already causing significant disruptions in ... <a title=\"Machine Learning Exposes Human-Induced Climate Change&#8217;s Rainfall Chao\" class=\"read-more\" href=\"https://www.cryptopolitan.com/machine-learning-human-induced-climate/\" aria-label=\"More on Machine Learning Exposes Human-Induced Climate Change&#8217;s Rainfall Chao\">Read more</a>"
  }
]