[
  {
    "source": "CoinDesk",
    "date": "2023-07-21T16:33:23.000Z",
    "title": "MakerDAO’s MKR Soars 28% in a Week as Token Buyback Scheme Goes Live",
    "url": "https://www.coindesk.com/markets/2023/07/21/makerdaos-mkr-soars-28-in-a-week-as-token-buyback-scheme-goes-live/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The lending platform is on track to remove some $7 million of MKR governance tokens from the market in a month, according to blockchain data."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-21T16:27:08.000Z",
    "title": "Bitfinex Hackers Agree to Forfeit Billions in Bitcoin in Plea Deal",
    "url": "https://decrypt.co/149557/bitfinex-hackers-agree-to-forfeit-billions-in-bitcoin-in-plea-deal",
    "description": "Ilya Lichtenstein and his wife, Heather Morgan, will appear before a judge on August 3 and could face up to 20 years in prison. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-21T16:18:46.000Z",
    "title": "McDonald’s debuts McNuggets Land in The Sandbox ",
    "url": "https://cointelegraph.com/news/mcdonalds-debuts-mcnuggets-land-the-sandbox",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/e43e0405-4e6c-45be-8abc-a343f265a6c7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>McDonald's Hong Kong has picked The Sandbox to build its first Web3 experience, the McNuggets Land.</p>\n                    <p><p>McDonald's Hong Kong has picked The Sandbox to build its first Web3 experience, the McNuggets Land, a virtual world dedicated to celebrating Chicken McNuggets' 40th anniversary. </p><p>The experience takes users to a virtual store, with a hidden factory and a tour through the history of the chicken snack, allowing gamers to play and complete quests to win rewards, such as the metaverse utility token SAND, which is used to purchase virtual goods and customize avatars on the platform. </p><p>Hong Kong users can also win 365-day free Chicken McNuggets coupons for redemption at the chain's restaurants. To join the virtual world, users only need an email address.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/06567080-2aa5-41c7-a344-8f0713ca8850.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Chicken McNuggets characters created by Hong Kong-based metaverse studio Pangu by Kenal. Source: The Sandbox.</em></figcaption></figure><p>Metaverse experiences have emerged as a tool for brand-building strategies in the past few years, allowing companies to gamify products and services, as well as establish online loyalty programs.</p><p>Sebastien Borget, co-founder and COO of The Sandbox, noted in a statement shared with Cointelegraph that the partnership with McDonald's takes The Sandbox to \"a new level\" and brings it \"closer to realizing the ultimate goal of mass adoption of the metaverse.”</p><p>The giant fast food chain has chosen Web3 tools to engage customers in the past. In 2021, for instance, McDonald's China <a href=\"https://cointelegraph.com/news/mcdonald-s-china-to-give-away-188-nfts-on-31st-anniversary\">released a set of 188 nonfungible tokens (NFT)</a> to celebrate its 31st anniversary in the local market. </p><p>McDonald's isn't the first global brand to embrace the virtual world through collaborations with The Sandbox. The Web3 firm previously partnered with 400 companies, including Warner Music Group, Ubisoft, Gucci, Adidas, as well as Snoop Dogg, The Smurfs, Care Bears, The Walking Dead and Atari. </p><p>“The launch of self-publishing now allows our partners to realize the true potential and monetise their brand in the metaverse by making their customer experience available to everyone, all the time,” said Borget about the recently released feature that allows brands to launch experiences directly on the platform's map. </p><p><a href=\"https://cointelegraph.com/magazine/4-out-of-10-nft-sales-are-fake-learn-to-spot-the-signs-of-wash-trading/\"><strong><em>Magazine:</em></strong></a><strong><em> </em></strong><a href=\"https://cointelegraph.com/magazine/4-out-of-10-nft-sales-are-fake-learn-to-spot-the-signs-of-wash-trading/\"><strong><em>4 out of 10 NFT sales are fake: Learn to spot the signs of wash trading</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-21T16:35:13.000Z",
    "title": "Conic Finance loses $3.2M to reentrancy attack on ETH Omnipool",
    "url": "https://cryptoslate.com/conic-finance-loses-3-2m-to-reentrancy-attack-on-eth-omnipool/",
    "description": "<p>DeFi protocol Conic Finance confirmed that it was exploited via a reentrancy attack earlier today for an undisclosed sum. A reentrancy attack allows an attacker to drain funds of a vulnerable contract by repeatedly calling the withdraw function before it updates its balance. This attack has been commonly used to exploit several DeFi protocols. Conic [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/conic-finance-loses-3-2m-to-reentrancy-attack-on-eth-omnipool/\">Conic Finance loses $3.2M to reentrancy attack on ETH Omnipool</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-21T16:15:34.000Z",
    "title": "Stablecoins: The New Favourite of Cybercriminals?",
    "url": "https://cryptodaily.co.uk/2023/07/stablecoins-the-new-favourite-of-cybercriminals",
    "description": "<p>An expert on crypto has recently postulated that criminals are leaving Bitcoin in order to use stablecoins, which are considered to be an easier go-to for illegal financial activities.</p>\nFrom Bitcoin to Stablecoins\n<p>It has often been suggested, especially in the mainstream media, that&nbsp; Bitcoin was one of the main currencies in which to transact illicit activities. However, recent insights suggest a shift in this trend. Originally reported by CoinTelegraph, Tara Annison, the former head of technical crypto advisory at Elliptic, stated that the criminal underbelly of the crypto world is now leaning more towards stablecoins, particularly USD Coin (USDC), over Bitcoin.</p>\n<p>Annison, during her presentation at EthCC in Paris, delved into the changing dynamics of crypto-related crimes. She pointed out that Bitcoin's decreasing popularity among criminals can be attributed to the rise of decentralised finance protocols, mixing services, and most notably, stablecoins. These digital assets, especially those pegged to the dollar, offer new, more discreet avenues for illicit transactions.</p>\nWhy the shift to stablecoins?\n<p>Annison explains that assets like USDC offer easy access and can be effortlessly laundered through decentralised exchanges (DEXs). She remarked that in her view the deep liquidity and substantial volume on these platforms make them ideal for such activities.</p>\n<p>However, it's not all gloomy. Annison highlighted a potential advantage for law enforcement agencies. Centralised issuers, such as Circle, have the capability to freeze specific USDC tokens. This means that before these criminals can convert their assets into fiat currencies through DEXs or centralised platforms, their funds can be halted. Annison commented that in her opinion we are witnessing a rise in blacklisted USDC and USDT accounts, effectively freezing assets that criminals can't access.</p>\n$7.8 billion in scams\n<p>Annison went on to say that stablecoins aren't the only concern. Ponzi and pyramid schemes continue to plague the crypto sector. A staggering $7.8 billion has been syphoned off from unsuspecting victims through these scams. Moreover, criminals are constantly innovating, employing techniques like chain swapping and asset swapping to obscure their tracks, using a myriad of tools, from DEXs to mixers, in order to muddy the trail for blockchain analytics firms.</p>\n<p>In the light of crypto scams decreasing by 46% compared to previous years, Annison believes the current bear market in crypto is a significant factor, suggesting that with reduced hype and lower prices, the sector becomes less lucrative for criminals.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T16:37:35.000Z",
    "title": "China’s AIIB gets major World Bank partnership",
    "url": "https://www.cryptopolitan.com/china-aiib-gets-major-world-bank-partnership/",
    "description": "An emblematic partnership has surfaced in the global banking sector. The Asian Infrastructure Investment Bank (AIIB), often considered China&#8217;s alternative to the World Bank, has initiated a high-stakes collaboration. This monumental alliance comes amidst accusations that China&#8217;s Communist party has been manipulating the bank from behind the scenes. A significant accord for AIIB The governing ... <a title=\"China&#8217;s AIIB gets major World Bank partnership\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-aiib-gets-major-world-bank-partnership/\" aria-label=\"More on China&#8217;s AIIB gets major World Bank partnership\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T16:35:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T16:18:21.000Z",
    "title": "Rise of Crypto Betting in the World of Sports",
    "url": "https://www.cryptopolitan.com/rise-of-crypto-betting-in-the-world-of-sports/",
    "description": "The rise of cryptocurrencies, led by Bitcoin, has significantly impacted the world of sports in recent years. Cryptocurrencies are digital or virtual currencies that use cryptography for secure transactions and operate independently of traditional banking systems. Here&#8217;s a brief overview of their rise and impact on sports: Cryptocurrencies gained popularity in the early 2010s, primarily ... <a title=\"Rise of Crypto Betting in the World of Sports\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rise-of-crypto-betting-in-the-world-of-sports/\" aria-label=\"More on Rise of Crypto Betting in the World of Sports\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T16:16:06.000Z",
    "title": "Coinbase  gives loan holders a four-month window to repay loans as it winds down Borrow service",
    "url": "https://www.cryptopolitan.com/coinbase-gives-loan-holders-four-month-window-repay-loans/",
    "description": "Coinbase announced the gradual wind-down of its lending service, Coinbase Borrow, in May. In a new development, the platform notified its users on Thursday that they have until November 20, 2023, to repay any outstanding loan balances. Failure to do so will result in default, leading Coinbase to sell its Bitcoin collateral to settle the ... <a title=\"Coinbase  gives loan holders a four-month window to repay loans as it winds down Borrow service\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-gives-loan-holders-four-month-window-repay-loans/\" aria-label=\"More on Coinbase  gives loan holders a four-month window to repay loans as it winds down Borrow service\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T16:14:54.000Z",
    "title": "The Limitations of Using AI Bots for Investment: Why Human Guidance Still Matters",
    "url": "https://www.cryptopolitan.com/the-limitations-of-ai-bots-for-investment/",
    "description": "Artificial intelligence (AI) and machine learning have proven to be transformative technologies in various industries. However, when managing investments in the financial markets, relying solely on AI for investment using bots may not be the best approach. While AI bots are proficient in pattern recognition, their limitations in interpreting human responses and considering individual circumstances ... <a title=\"The Limitations of Using AI Bots for Investment: Why Human Guidance Still Matters\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-limitations-of-ai-bots-for-investment/\" aria-label=\"More on The Limitations of Using AI Bots for Investment: Why Human Guidance Still Matters\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-21T16:38:15.000Z",
    "title": "Upland launches FIFA Women’s World Cup experience in metaverse",
    "url": "https://crypto.news/upland-launches-fifa-womens-world-cup-experience-in-metaverse/",
    "description": "Upland to bring the FIFA Women's World Cup Australia &#038; New Zealand 2023 to the metaverse"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-21T16:30:47.000Z",
    "title": "Coinbase Exchange Tells Borrowers That They Have Four Months To Pay Back",
    "url": "https://www.newsbtc.com/coinbase/coinbase-borrowers-have-four-months-to-pay-back/",
    "description": "Coinbase, America&#8217;s largest crypto exchange, is winding down its Borrow program and has given borrowers four months to repay their loans.  Coinbase To Shut Down Borrow Program The Coinbase Borrow program allowed eligible Coinbase customers in certain US states to borrow up to $1 million worth of US dollars by putting up bitcoin or other cryptocurrencies as collateral.  Related Reading: Ethereum Monthly Burn Surpasses 146,000 ETH As Total Clears $6.5 Billion Many saw Coinbase Borrow as an easy way to access cash without selling their crypto holdings. Unfortunately, the crypto exchange recently announced it is shutting down the program. Current borrowers have four months left to repay any outstanding loan balances before the program closes for good.  According to a company blog post, the update will only affect customers with existing loans with due dates after November 20, 2023.  After this date, all accounts that still have outstanding loans will be paid off by selling enough BTC collateral to cover the full amount of any outstanding debt.  The exchange initially charges a 2% liquidation fee for borrowers who are unable to pay up their loans before the due date. However, the exchange said the liquidation fee is going to be waived in this case. COIN price sitting at $102 &#124; Source: Coinbase Global, Inc. on Tradingview.com Why Is The Exchange Shutting Down The Program? The closure of Coinbase Borrow was first touted two months ago. In early May, Coinbase announced May 10 as the final day customers can take out new loans through the program. Launched in November 2021 during the height of the crypto bull run, Coinbase&#8217;s borrow program was advertised as a way to get fiat loans quickly without needing to sell bitcoin. With the entire cryptocurrency market now in calmer waters, it seems the borrow program isn&#8217;t gaining as much traction as hoped. According to Coinbase, it is making the decision in order to focus on other products. &#8220;the offerings that our customers care about most.&#8221; “We regularly evaluate our products to ensure we’re prioritizing the offerings that our customers care about most. After much consideration, we have made the decision to wind down Coinbase Borrow,” the blog post read. Related Reading: Binance Burns $480 Million In BNB, Will Price Recover? Regulatory issues could also have played a role in the exchange&#8217;s decision. The California-based exchange has been under scrutiny from US regulators for years. The Securities and Exchange Commission (SEC) recently sued Coinbase on June 6, for its staking program and for making billions of dollars in its role as a middleman for the alleged trading of unregistered securities.  Cryptocurrency regulations on trading, borrowing, and staking remain unclear. However, Coinbase says the SEC can only pursue its claims if cryptocurrencies and staking services have been established as securities. Featured image from CNBC, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T16:24:28.000Z",
    "title": "BREAKING: Conic Finance Hacked! Over $3.2 Million in ETH Lost – Is Your Money Safe?",
    "url": "https://www.crypto-news-flash.com/breaking-conic-finance-hacked-over-3-2-million-in-eth-lost-is-your-money-safe/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-conic-finance-hacked-over-3-2-million-in-eth-lost-is-your-money-safe",
    "description": "<img width=\"1280\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/hacker-g49391eea9_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/hacker-g49391eea9_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/hacker-g49391eea9_1280-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/hacker-g49391eea9_1280-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/hacker-g49391eea9_1280-768x432.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Conic Finance, a DeFi liquidity pool platform, falls victim to a massive hack, losing over $3.2 million in ETH. As DeFi hacks surge, users question the safety of their funds and demand stronger security measures to protect their investments. In a shocking turn of events, the decentralized finance (DeFi) platform, Conic Finance, has fallen victim [...]"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-07-21T16:37:51.000Z",
    "title": "Is Lightning Scaling Bitcoin in a Way Nobody Predicted?",
    "url": "https://blog.bitfinex.com/education/is-lightning-scaling-bitcoin-in-a-way-nobody-predicted/",
    "description": "<p>The Lightning Network is revolutionising Bitcoin scalability by establishing itself as the primary payment rail bridging various Layer Two projects together. This interconnected ecosystem is fostering cross-compatibility, thereby promoting seamless, fast, and low-cost transactions across different Bitcoin Layer Two projects. Did Lightning’s Early Adopters Miss...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/education/is-lightning-scaling-bitcoin-in-a-way-nobody-predicted/\">Is Lightning Scaling Bitcoin in a Way Nobody Predicted?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]