[
  {
    "source": "Decrypt",
    "date": "2023-06-15T14:21:47.000Z",
    "title": "Fedi's Bitcoin Federations Could Onboard Next 1 Billion Users, Says CEO",
    "url": "https://decrypt.co/144599/fedis-bitcoin-federations-could-onboard-next-1-billion-users-says-ceo",
    "description": "Fedi CEO Obi Nwosu has big plans for kickstarting Bitcoin adoption via a unique, Lightning-powered community app called \"Federations.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-15T14:11:14.000Z",
    "title": "Is blockchain technology ready for high-storage applications?",
    "url": "https://cointelegraph.com/news/is-blockchain-technology-ready-for-high-storage-applications",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/7fc028d4-0e48-40d0-84f2-1777f6dc77d8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>What does the blockchain space need to enable the development of high-storage apps?</p>\n                    <p><p>Web3 — the third generation of the internet — refers to a decentralized and distributed version of the web that uses blockchain technology, and other decentralized technologies, to enable greater user control, privacy and data ownership. It aims to redefine how we interact with digital services, moving from traditional centralized models to decentralized peer-to-peer networks.</p><p>At its core, Web3 is built on blockchain technology, which is a distributed ledger that maintains a cryptographically-secured, continuously growing list of records called blocks. This decentralized nature enables direct peer-to-peer interactions.</p><p>Web3 brings several key features and capabilities with the potential to revolutionize high-storage applications. Examples of high-storage applications include content delivery networks (CDNs) to host images and other visual media, online gaming platforms, and blockchain-based websites.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e6bd3a73-3804-4faa-9571-5b54f2f462a7.png\"  /><figcaption style=\"text-align: center;\">A single server distribution scheme (left) versus a CDN distribution scheme (right).</figcaption></figure><p>Unlike traditional centralized systems, Web3 ensures that no single entity has complete control or ownership over data. This decentralized approach makes the data resistant to censorship, manipulation, or single-point-of-failure risks, thereby enhancing data integrity and availability.</p><p>Harrison Hines, CEO and Co-founder of Fleek — a decentralized development platform — told Cointelegraph, “The well-designed protocols powering Web3 ensure decentralization through their network architecture, cryptography and token-economic incentive system.” He added:</p><p>“The benefits of this approach largely center around being trustless, permissionless, tamper-proof and censorship-resistant. These are increasingly important problems/issues, especially on corporate-owned Web2 cloud platforms, and Web3 does a great job addressing them.”</p><p>Ankur Banerjee, chief technology officer at Cheqd — a decentralized payments and identity platform — also weighed in, telling Cointelegraph, “Focusing specifically on decentralization, it provides resiliency away from single providers. There have historically been lots of outages due to cloud providers failing, e.g., only a week ago, Microsoft Outlook was down, and in January, Outlook, Teams, and 365 were all down, which shows the danger of centralization. Facebook’s global outage in 2021 took down not just their services, but large parts of the rest of the web which relied on Facebook’s ad tracking and log in.”</p><p>Another significant aspect of Web3 is interoperability. Blockchains work independently of each other, but there are interoperability protocols that aim to connect different blockchain networks. For example, cross-chain bridges allow users to transfer assets from one blockchain to another. If leveraged correctly, interoperability can play a role in developing high-storage applications by making them accessible on multiple blockchain networks. </p><p>Web3 incorporates distributed file systems, such as the InterPlanetary File System (IPFS) and Swarm, to provide secure and scalable storage solutions for high-storage applications. These distributed file systems break down files into smaller chunks, distribute them across multiple nodes and utilize content-based addressing. In addition, by ensuring data redundancy and efficient retrieval, they enhance the reliability and performance of storage systems.</p><p>For example, Fleek enables users to build websites by hosting their files using the IPFS protocol. When a website is deployed on the network, users get an IPFS hash, and the websites are archived to Filecoin. Users have software development kits and graphical user interfaces to interact with the storage infrastructure.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/real-bedford-soccer-team-puts-bitcoin-on-the-map/\">Peter McCormack’s Real Bedford Football Club puts Bitcoin on the map</a></em></strong></p><p>Moreover, Web3 enables the use of smart contracts. Smart contracts are self-executing contracts with predefined rules and conditions encoded within the blockchain. They facilitate trustless and automated interactions, allowing high-storage applications to enforce rules, handle transactions, and manage access control for data storage and retrieval. </p><p>Web3 also introduces tokenization, where digital assets or tokens represent ownership or access rights. In high-storage applications, tokenization can incentivize participants to contribute their storage resources. Users can earn tokens by sharing unused storage space, creating a cost-effective and scalable decentralized network. Tokenization adds an economic layer to the storage ecosystem, encouraging active participation and resource sharing.</p><p>Web3’s potential for high-storage applications lies in its decentralized nature, interoperability, distributed file systems, smart contracts and tokenization mechanisms. These features provide a secure, scalable, and incentivized infrastructure for storing and retrieving large volumes of data. </p><h2>What blockchain tech needs to be ready</h2><p>In its current form, blockchain technology faces scalability challenges when handling large amounts of data. Traditional blockchain architectures like Bitcoin and Ethereum have limited throughput and storage capacities. </p><p>To support high-storage applications, blockchain networks need to enhance their scalability. This can be achieved by implementing solutions like sharding, layer-2 protocols or sidechains. These techniques enable parallel processing of transactions and data, effectively increasing the capacity and performance of the blockchain network.</p><p>High-storage applications require efficient utilization of storage resources. Therefore, blockchain networks need to optimize data storage to reduce redundancy and improve storage efficiency. Techniques such as data compression, deduplication, and data partitioning can be employed to minimize storage requirements while maintaining data integrity and availability.</p><p>Banerjee noted, “Blockchains aren’t directly used to store heavy files since this would be a non-optimal way of storing and distributing them. Many use cases that require storing large amounts of data achieve this by storing a cryptographic hash or proof on the chain, and storing the file on decentralized storage (like IPFS, Swarm, Ceramic, etc.), or even centralized storage.” He added:</p><p>“That way, the ‘heavier’ files don’t need to be split and stored in blocks, and are available in a form most optimized for distributing large files fast, while ensuring they are tamper-proof by checking against the hash. A good example of this in action is the Sidetree protocol, which uses a combination of IPFS and Bitcoin for storage.” </p><p>Data availability is crucial for high-storage applications. Blockchain networks must ensure that storage nodes are consistently online and accessible to provide data retrieval services. Incentives and penalties can be incorporated to encourage storage nodes to maintain high availability. Additionally, integrating distributed file systems like IPFS or Swarm can enhance data availability by replicating data across multiple nodes.</p><p>Fleek’s Hines told Cointelegraph, “Scalability is still an issue that all Web3 storage protocols need to work on, and it’s an issue we are specifically addressing with Fleek Network. Regarding IPFS and Swarm specifically, I’d put IPFS in a category of its own. In contrast, Swarm is more similar to Filecoin, Arweave, etc., in that those protocols guarantee the storage of files/data,” adding:</p><p>“IPFS, on the other hand, does not guarantee the storage of files/data. A better way to think about IPFS is more similar to HTTP, meaning its primary use is for content addressing and routing.”</p><p>Hines even believes that IPFS can potentially replace the HTTPS protocol: “In the future, we see IPFS being used on top of all storage protocols and eventually replacing HTTP, for the simple reason that content addressing makes more sense than location-based addressing (IP address) for the internet and its growing global user base.”</p><p>“For the other storage protocols like Filecoin, Arweave, Swarm, etc., they guarantee security through their network architecture, cryptography and token-economic incentive system.”</p><p>Since high-storage applications often deal with sensitive data, data privacy and security are paramount. Blockchain networks need to incorporate robust encryption techniques and access control mechanisms to protect stored data. Privacy-focused technologies, such as zero-knowledge proofs or secure multiparty computation, can be integrated to enable secure, private data storage and retrieval.</p><p>Blockchain networks can provide cost-effective storage solutions with decentralized storage networks or implementing token-based economies. In addition, blockchain networks can create a distributed, cost-efficient storage infrastructure by incentivizing individuals or organizations to contribute their unused storage resources.</p><p>Interoperability is crucial for high-storage applications that involve data integration from various sources and systems. Therefore, blockchain networks must promote interoperability between blockchains and external systems. Standards and protocols, such as cross-chain communication protocols or decentralized oracles, can enable seamless integration of data from different sources into the blockchain network.</p><p>Effective governance and consensus mechanisms are essential for blockchain networks that handle large volumes of data. Transparent and decentralized governance models, such as on-chain or decentralized autonomous organizations (DAOs), can be implemented to make collective decisions regarding storage-related policies and upgrades. </p><p>Efficient consensus algorithms like proof-of-stake (PoS) or delegated proof-of-stake (DPoS) can be adopted to achieve faster, more energy-efficient consensus for data storage transactions. Improving the user experience is also crucial for blockchain technology in high-storage applications. </p><p>The complexity and technicality associated with blockchain should be abstracted away to provide a user-friendly interface and seamless integration with existing applications. In addition, tools, libraries, and frameworks that simplify the development and deployment of high-storage blockchain applications should be readily available.</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/eu-s-new-crypto-law-how-mica-can-make-europe-a-digital-asset-hub\">EU’s new crypto law: How MiCA can make Europe a digital asset hub</a></em></strong></p><p>High storage applications may need to adhere to specific regulatory requirements, such as data protection regulations or industry-specific compliance standards. Therefore, blockchain networks must provide features and mechanisms that allow compliance with such regulations. </p><p>This can include built-in privacy controls, auditability features, or integration with identity management systems to ensure regulatory compliance while utilizing blockchain-based storage.</p><p>In summary, to be ready for high-storage applications, blockchain must address several key features, including security and cost-efficiency. By overcoming these challenges and incorporating the necessary improvements, blockchain technology can provide a robust, scalable infrastructure for high-storage applications.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-15T14:30:30.000Z",
    "title": "Parcl Expands Its Real Estate Frontier: Launches Additional Tradable Indexes for Major US Cities Including Austin, Chicago, Seattle, and Boston",
    "url": "https://www.cryptoglobe.com/latest/2023/06/parcl-expands-its-real-estate-frontier-launches-additional-tradable-indexes-for-major-us-cities-including-austin-chicago-seattle-and-boston/",
    "description": "New York, New York, June 15th, 2023, Chainwire Parcl’s market expansion increases access to investors seeking exposure to real estate prices via Real World Asset (RWA) Indexes. Parcl, the leading blockchain-powered real estate trading platform, announced today the launch of Austin, TX, to its ever-growing list of tradable city indexes. In addition to Austin, Parcl […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T14:39:56.000Z",
    "title": "Nigeria’s naira shake-up could trigger crypto market shift",
    "url": "https://www.cryptopolitan.com/naira-shake-up-trigger-crypto-market-shift/",
    "description": "A groundbreaking development in Nigeria’s financial landscape, the floating of the national currency, the Naira, has the potential to shape a pivotal shift in the crypto market dynamics. Nigeria, a nation witnessing a growing influx of cryptocurrencies such as Bitcoin, now permits banks and other forex market participants to freely trade the Naira. This shift, ... <a title=\"Nigeria&#8217;s naira shake-up could trigger crypto market shift\" class=\"read-more\" href=\"https://www.cryptopolitan.com/naira-shake-up-trigger-crypto-market-shift/\" aria-label=\"More on Nigeria&#8217;s naira shake-up could trigger crypto market shift\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T14:39:06.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution that has gained popularity recently among Ethereum users for ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T14:29:08.000Z",
    "title": "Hong Kong government pushes banks to embrace crypto",
    "url": "https://www.cryptopolitan.com/hong-kong-govt-pushes-banks-embrace-crypto/",
    "description": "The financial nerve center of Hong Kong is nudging its banking sector to adopt a more crypto-friendly approach. Regulatory authorities have urged financial heavyweights like HSBC, Standard Chartered, and the Bank of China to foster relationships with crypto exchanges. This move signals an effort to fortify Hong Kong&#8217;s position as a global nexus for the ... <a title=\"Hong Kong government pushes banks to embrace crypto\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hong-kong-govt-pushes-banks-embrace-crypto/\" aria-label=\"More on Hong Kong government pushes banks to embrace crypto\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T14:14:29.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T14:29:13.000Z",
    "title": "Understanding the security measures in Coinbase’s multiparty computation implementation",
    "url": "https://crypto.news/understanding-the-security-measures-in-coinbases-multiparty-computation-implementation/",
    "description": "In the realm of digital asset management, the challenge of creating a secure and user-friendly wallet service has been a persistent hurdle. "
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T14:22:36.000Z",
    "title": "Trader sentiment falls to a three-year low",
    "url": "https://crypto.news/trader-sentiment-falls-to-a-three-year-low/",
    "description": "Amidst the United States' crackdown on cryptocurrencies, bitcoin, and other cryptos have experienced a significant price decline."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-15T14:30:06.000Z",
    "title": "Bitcoin Price On Shaky Ground: Market Analysts Warn Of Potential Fall To $20,000 Level",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-on-shaky-ground-market-analysts-warn-potential-fall/",
    "description": "Bitcoin, the world&#8217;s largest crypto by market cap, is currently under pressure, as it broke the significant $25,000 mark in the last 24 hours. This development has spurred a sense of urgency among traders and market analysts who are bracing for a possible further dip in the value of Bitcoin (BTC). At the time of writing, BTC is trading at $24,872. The past week has been less than favorable for the cryptocurrency. The asset has plunged 4.2% in the past 24 hours, pushing its price to trade below $25,000. This downward trend has negatively impacted Bitcoin&#8217;s weekly performance, resulting in a 6% loss. Traders And Analysts Voice Concerns Several traders and analysts have shared their predictions for the leading cryptocurrency in response to its downturn. Notably, a trader identified as Bluntz conveyed that the critical test for Bitcoin would be to reclaim the $25,600 mark in the ensuing days.  Related Reading: Bitcoin (BTC) Stored On Exchanges Plummets Amid Regulatory Uncertainties: Santiment In another corner, a trader called Rekt Capital raised concerns about a possible slide of Bitcoin&#8217;s price to lower $20,000. This prediction followed Bitcoin&#8217;s break below another weekly support level situated around $26,600. If Bitcoin faces rejection at this price point in the next few days, Rekt Capital posits that BTC will likely descend to the $20,000 level. Meanwhile, CryptoCon, another analyst, offered his perspective on the Bitcoin situation. In his tweet, CryptoCon pointed out an interesting correlation with the past, stating that Bitcoin found resistance at $31,000, which was also a key resistance level back in 2016. According to his analysis, not only did BTC meet rejection at this resistance level, but it also found support when the price broke below its current all-time high.  Bitcoin Latest Price Action It is worth noting that Bitcoin has been in a notable bearish trend in the past week. The largest crypto asset by market capitalization has recorded a downward movement falling by more than 5% in the past 7 days. BTC has continued the downtrend over the past 24 hours, seeing a 4.2% loss. At the time of writing, BTC trades at $24,925 after moving slightly above $26,000 on Sunday. Bitcoin’s trading volume has spiked over the past 7 days from below $10 billion earlier this Monday to $14 billion in the past 24 hours, indicating massive trading activity, which could turn into a violent sell-off given its current price. However, the asset’s market capitalization has seen a more than $30 billion loss in the past 7 days. BTC’s market cap has plummeted from $518 billion last Thursday to $483 billion. Related Reading: Data Reveals Short-Term Bitcoin Holders Refuse To Sell Despite SEC Crackdown While the regulatory pressure on crypto has continued to intensify, it is important to note that these projections from these traders and market analysts offer a glimpse into the Bitcoin possible potential movements as the regulatory saga unfolds. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T14:20:05.000Z",
    "title": "Uniswap Unveils Version 4 Code Enabling Enhanced Liquidit Optionsy Pool",
    "url": "https://www.crypto-news-flash.com/uniswap-unveils-version-4-code-enabling-enhanced-liquidit-optionsy-pool/?utm_source=rss&utm_medium=rss&utm_campaign=uniswap-unveils-version-4-code-enabling-enhanced-liquidit-optionsy-pool",
    "description": "Uniswap V4 introduces customizable features, revolutionizing decentralized exchanges. Hooks in V4 enable on-chain limit orders and innovative liquidity pool actions. Uniswap Labs Engineer Sara Reynolds anticipates rapid AMM innovation with V4. Uniswap, the world&#8217;s leading decentralized cryptocurrency exchange by volume, is shaking up the industry with its V4 code release. Spearheaded by founder Hayden Adams, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-15T14:21:00.000Z",
    "title": "CRV’s Imbalance Results in the Fall of USDT – Price Drop by 0.25%",
    "url": "https://coinedition.com/crvs-imbalance-results-in-the-fall-of-usdt-price-drop-by-0-25/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Curve-DAO-Token-CRV-Price-Analysis-6-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Curve-DAO-Token-CRV-Price-Analysis-6-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Curve-DAO-Token-CRV-Price-Analysis-6-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Curve-DAO-Token-CRV-Price-Analysis-6.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>According to a recent analysis, the Curve DAO token CRV’s funding rate has fallen to a new yearly low, with a rate of -0.0733% over the past 8 hours. Over the past 24 hours, the token has fallen by more than 10%. Following the imbalance in the Curve ecosystem, there has been a large exchange [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crvs-imbalance-results-in-the-fall-of-usdt-price-drop-by-0-25/\">CRV’s Imbalance Results in the Fall of USDT – Price Drop by 0.25%</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-15T14:30:59.000Z",
    "title": "US Treasury Official Warns Against Privacy Abuse With Incoming CBDC",
    "url": "https://dailyhodl.com/2023/06/15/us-treasury-official-warns-against-privacy-abuse-with-incoming-cbdc/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Warns-Against-Privacy-Abuse.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Warns-Against-Privacy-Abuse.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Warns-Against-Privacy-Abuse.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Warns-Against-Privacy-Abuse.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Warns-Against-Privacy-Abuse.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Warns-Against-Privacy-Abuse.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Warns-Against-Privacy-Abuse.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A US Treasury official is warning of the risk of privacy violations with the potential launch of a central bank digital currency (CBDC). In a new speech at the Transform Payments USA 2023 Conference in Texas, Graham Steele, the US Treasury’s Assistant Secretary for Financial Institutions, says CBDCs present a significant user privacy challenge. “An [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/15/us-treasury-official-warns-against-privacy-abuse-with-incoming-cbdc/\">US Treasury Official Warns Against Privacy Abuse With Incoming CBDC</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]