[
  {
    "source": "Crypto Daily",
    "date": "2023-06-22T00:15:00.000Z",
    "title": "Liquidity Troubles for Shiba Inu; How Can Dogecoin and Caged Beasts Escape The Same Fate?",
    "url": "https://cryptodaily.co.uk/2023/06/liquidity-troubles-for-shiba-inu-how-can-dogecoin-and-caged-beasts-escape-the-same-fate",
    "description": "<p>Shiba Inu, the intriguing token that gained attention during the 2021 bull market, is facing concerns about its liquidity. Despite once boasting a Total Value Locked (TVL) of $1.75 billion, ShibaSwap's TVL has plummeted to a mere $25.16 million. The token's developers made headlines by donating a significant portion to Ethereum's Vitalik Buterin and burning a large number of remaining tokens. However, the ongoing liquidity issue has raised worries among Shiba Inu enthusiasts.</p>\n<p>Liquidity is crucial in the cryptocurrency market, as it signals stability and allows for precise pricing and trading. Unfortunately, the industry has been experiencing a prolonged liquidity crisis, impacting major cryptocurrencies like Bitcoin and Ethereum. The market has seen steep price declines and contentious issues. The duration of the current liquidity problem remains uncertain, leaving many individuals concerned about its resolution.</p>\n<p>Despite Shiba Inu's impressive market capitalization of $5 billion, its popularity has decreased. The cryptocurrency industry's liquidity problem has affected the market's development, efficiency, and future. Analysts continue to debate the impact of this issue and its potential duration.</p>\n<p>Overall, the decline in liquidity and its implications for Shiba Inu and the broader cryptocurrency market have captured the attention of crypto enthusiasts. The resolution of the ongoing liquidity issue remains uncertain, leaving stakeholders eagerly awaiting signs of improvement and stability.</p>\n<p></p>\nHow Dogecoin (DOGE) Avoided the Same Fate\n<p>Dogecoin is the first meme cryptocurrency that was created as a lighthearted and meme-inspired digital asset. Unlike Shiba Inu, which has faced liquidity troubles, Dogecoin has a more established market presence and higher liquidity. Dogecoin's liquidity can be attributed to its widespread acceptance and use, as well as its long-standing presence in the cryptocurrency market.&nbsp;</p>\n<p>Additionally, Dogecoin's active and supportive community plays a significant role in maintaining liquidity by actively trading and promoting the token. As a result, Dogecoin has managed to avoid the liquidity troubles that Shiba Inu has experienced, providing a more stable and liquid investment option for users.</p>\n<p></p>\nCan Caged Beasts (BEASTS) Avoid Shiba Inu's Liquidity Troubles?\n<p>Caged Beasts ($BEASTS) distinguishes itself from other tokens by offering a secure fund-locking mechanism and implementing the concept of \"Caged Liquidity.\" This innovative approach promotes transparency, security, and decentralization in the realm of finance. By securely locking 75% of raised funds until the specified release date, Caged Beasts ensures a solid foundation and mitigates liquidity problems.&nbsp;</p>\n<p>This unique feature sets it apart from tokens like Shiba Inu, demonstrating a commitment to responsible tokenomics. By providing a visible demonstration of securely locked funds, Caged Beasts instills trust and confidence among investors, paving the way for a sustainable and liquid ecosystem.</p>\nWhat Did We Learn?\n<p>The liquidity troubles faced by Shiba Inu highlight the importance of liquidity in the cryptocurrency market. Liquidity refers to the ability to buy or sell an asset quickly and at a stable price without significantly impacting its value. It is a vital aspect of a healthy market as it ensures stability, efficient trading, and precise pricing.&nbsp;</p>\n<p>Dogecoin has avoided liquidity problems due to its widespread acceptance and active community, while Caged Beasts has taken a proactive approach by implementing a secure fund-locking mechanism to prevent liquidity issues. The ongoing liquidity crisis in the cryptocurrency industry emphasizes the need for responsible tokenomics and transparent strategies to maintain a sustainable and liquid market.</p>\n<p>Learn more about Caged Beasts:Website: https://cagedbeasts.com&nbsp;</p>\n<p>Twitter: https://twitter.com/CAGED_BEASTS&nbsp;</p>\n<p>Telegram: https://t.me/CAGEDBEASTS</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-22T00:30:55.000Z",
    "title": "Fantom (FTM) Shows Resilience, Gains 15% In A Single Day",
    "url": "https://www.newsbtc.com/fantom/fantom-ftm-shows-resilience-gains-15-in-a-single-day/",
    "description": "Fantom (FTM) has been underperforming in the past few months, shedding virtually all the profits gained at the beginning of the year. However, the bulls seem to be back in control, as the cryptocurrency price indicates increased buying pressure. Related Reading: Bitcoin Price Breaks Above $30,000: Is The Bull Run Back On? Fantom Price Jumps By 15% In 24 Hours &#8211; Price Overview Since April 18, FTM has displayed downward price action, contributing to the coin&#8217;s negative market sentiment. However, the token’s price is bouncing and showing signs of a recovery by gaining more than 15% in the last 24 hours.  Meanwhile, Fantom has had a generally positive week, showing green on the weekly chart with a 10% price increase. This bullish momentum has slowed the coin’s descent to the yearly low of $0.1997. However, it is worth mentioning that the cryptocurrency is still a long way from its 2023 peak at $0.6345. Fantom reached this price point as far back as February 4 and has declined since, losing more than 53% of its value. According to data from CoinGecko, FTM currently trades at $0.2955, with a 24-hour trading volume of over $121 million. The trading volume experienced a 90.5% increase in the last day, indicating a recent surge in market activity.  FTM Price Approaches Significant Resistance Level During its descent, FTM broke the $0.34 support level, falling to a low of $0.21 on June 10. Interestingly, the FTM price formed an evening star candlestick on the daily chart, indicating a bullish reversal. And the price has been on an upswing since then. In addition to the evening star pattern, technical indicators signal a bullish reversal. For instance, the daily Relative Strength Index (RSI) shows a bullish momentum forming, having moved out of the oversold zone. However, it is yet to confirm the trend reversal, with its line barely crossing above 50. An RSI reading above 50 often indicates that a bullish run might be on the horizon, while the bears have the advantage when the RSI reading is below 50. Meanwhile, the daily Moving Average Convergence Divergence (MACD) line recently crossed above the signal line, another bullish indicator. &#160; FTMUSD trading at $0.302 &#124; Source: FTMUSD chart from TradingView Fantom looks set to target the $0.34 price zone, which is now expected to operate as resistance. Should the FTM price gather enough momentum and break this resistance level, it will likely hit the $0.54 level and perhaps reach a new 2023 peak. On the flip side, if the resistance level holds strong, the FTM bearish trend may continue. The token’s price may fall to a new yearly low beneath $0.1997 in this case. It is worth noting that this analysis is not investment advice. Traders are advised to do their due diligence before risking their funds. Related Reading: Bitcoin Cash Surges 20% In One Day As Market Rebounds, What’s Next? Featured image from iStock, chart from TradingView"
  }
]