[
  {
    "source": "CoinDesk",
    "date": "2024-02-23T09:51:38.000Z",
    "title": "Texas Blockchain Council, Riot Platforms Sue Dept. of Energy, OMB Over 'Emergency' Survey",
    "url": "https://www.coindesk.com/policy/2024/02/23/texas-blockchain-council-riot-platforms-sue-dept-of-energy-omb-over-emergency-survey/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Texas Blockchain Council (TBC) and Riot Platforms, one of the largest crypto miners in the state, sued the U.S. Department of Energy for trying to collect information from many of its members, including Riot."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-23T09:49:07.000Z",
    "title": "Hopes Dashed? Spot Ethereum ETF Approval May Face SEC Delays Beyond 2024",
    "url": "https://www.cryptoglobe.com/latest/2024/02/hopes-dashed-spot-ethereum-etf-approval-may-face-sec-delays-beyond-2024/",
    "description": "The potential for a spot Ethereum exchange-traded fund (ETF) has become a topic of keen interest among investors and industry insiders. During a recent interview with The Block, Steven McClurg, Chief Investment Officer at Valkyrie, shared his insights on the matter, suggesting that while a spot Ethereum ETF may not be imminent, its approval could […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-23T09:40:01.000Z",
    "title": "StarkWare Agrees To Revise STRK Lockup Schedule After Criticism",
    "url": "https://cryptodaily.co.uk/2024/02/starkware-agrees-to-revise-strk-lockup-schedule-after-criticism",
    "description": "The STRK token airdrop began earlier this month, and around 49.9% of the total allocation of the token supply was allocated to core contributors and investors."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T09:50:46.000Z",
    "title": "Chainlink Price Prediction 2024-2033: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2024-2033 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-23T10:00:06.000Z",
    "title": "Crypto CEO Drops Bombshell Discovery Why Bitcoin Price Is Muted Post-ETFs",
    "url": "https://www.newsbtc.com/news/bitcoin/crypto-ceo-bombshell-bitcoin-price-muted-post-etfs/",
    "description": "Despite the landmark launch of spot Bitcoin Exchange-Traded Funds (ETFs) spearheaded by industry behemoths BlackRock and Fidelity—ranking among the top five ETF launches in their initial month of all time—BTC’s price response has been notably subdued. Prior to the launch of these EFTs, BTC soared to a peak of $49,040 on January 11. Fast forward to today and BTC is currently settling at $51,000, marking a modest appreciation of 4.3%. This tepid performance has puzzled market observers, particularly in light of massive net inflows of $5.278 billion into all Bitcoin ETFs within a mere six-week span. These could have been even significantly higher if there would have been $7.398 billion in outflows from Grayscale&#8217;s GBTC. The Bombshell Discovery Yet, CryptoQuant CEO Ki Young Ju may now have found the “real” reason that has had an even bigger impact on Bitcoin&#8217;s price action in recent weeks. Ju&#8217;s analysis highlights the transfer of over 700,000 BTC to Over-The-Counter (OTC) desks predominantly utilized by miners in the weeks succeeding the spot Bitcoin ETF approvals—an equivalent of approximately $35.6 billion at current prices. Related Reading: Analyst: Bitcoin Has Never Been This Bullish, What’s Next? He shared the below chart and stated: “700K BTC has moved to OTC desks used by miners over the past three weeks following spot Bitcoin ETF approval.” This revelation has sparked a reevaluation of the impact of such substantial transfers on the market dynamics of Bitcoin. Ju later corrected his statement slightly and explained, &#8220;Got some questions about the data accuracy. These OTC addresses are not only used by miners. It could be used by other whales. We&#8217;ll let you know what addresses caused this spike,&#8221;acknowledging the complexity and multifaceted nature of these transactions. The Bitcoin OTC Mechanism Explained OTC desks facilitate direct transactions between two parties, unlike open exchanges where orders are matched among various participants. This method of trading can handle large volumes of Bitcoin without immediately affecting the market price. When substantial amounts of BTC are bought or sold on public exchanges, the sudden increase in supply or demand can lead to significant price volatility. By opting for OTC transactions, large buyers, such as ETF issuers, can accumulate Bitcoin in vast quantities without triggering a steep price increase that would inevitably follow if these purchases were made on spot markets. Related Reading: Galaxy CEO Cautions Bitcoin May Fall To $42,000 Ahead Of Major Rally Thus, Ju theorizes that the issuers behind the newly launched Bitcoin ETFs are strategically purchasing Bitcoin via OTC desks. This approach serves a dual purpose: it allows these entities to fulfill the demand from ETF investors by securing enough Bitcoin to back the ETF shares while simultaneously mitigating the immediate price impact that such large-scale purchases would have if conducted on open exchanges. The essence of Ju&#8217;s claim is that if the 700,000 BTC had been bought on the spot market instead of through OTC channels, the influx of demand would have likely propelled Bitcoin&#8217;s price significantly higher than the observed 4.3% increase. This subdued price action, therefore, could be attributed to the strategic use of OTC transactions by ETF issuers and other large-scale buyers. However, there is also a silver lining. What will happen if the miners can only sell half of the current supply following the upcoming BTC halving in April, but the demand remains? Moreover, this constraint isn&#8217;t limited to miners alone. Given that the OTC supply is finite and likely depleting rapidly, it appears inevitable that a supply shock could impact the market once the OTC reserves are fully tapped. When entities like BlackRock and others are compelled to purchase Bitcoin on the open market to back up their ETFs, the BTC price could react swiftly. At press time, BTC traded at $51,030. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-23T10:00:52.000Z",
    "title": "Solana Surges 22% in a Week, Hits New Milestone; Sei & Emerging AI altcoin Poised for Significant Gains",
    "url": "https://www.crypto-news-flash.com/solana-surges-22-in-a-week-hits-new-milestone-sei-emerging-ai-altcoin-poised-for-significant-gains/?utm_source=rss&utm_medium=rss&utm_campaign=solana-surges-22-in-a-week-hits-new-milestone-sei-emerging-ai-altcoin-poised-for-significant-gains",
    "description": "<img width=\"1200\" height=\"799\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-22T101621.343.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-22T101621.343.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-22T101621.343-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-22T101621.343-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-22T101621.343-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-22T101621.343-450x300.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />The crypto market keeps us entertained with plenty of events unfolding in parallel. Solana continues to impress with a weekly surge of 22% that took the price to a new high of $118 this year. The overall L1 sector seems to have benefited from this upside movement, including the likes of Sei. The positive momentum [...]"
  }
]