[
  {
    "source": "CoinDesk",
    "date": "2024-01-17T15:55:38.000Z",
    "title": "Jamie Dimon Bashes Bitcoin Again; 'A Pet Rock'",
    "url": "https://www.coindesk.com/business/2024/01/17/jamie-dimon-bashes-bitcoin-again-a-pet-rock/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The JPMorgan CEO said this will be the last time he airs his opinion on bitcoin."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-17T15:51:11.000Z",
    "title": "‘Embrace AI or Be Left Behind’: Industry Leaders Stress AI Adoption at Davos",
    "url": "https://decrypt.co/213194/embrace-ai-or-be-left-behind-industry-leaders-stress-ai-adoption-at-davos",
    "description": "From domestic tasks to war, CEOs and politicians at the World Economic Forum believe AI will impact most aspects of modern society."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-17T16:00:00.000Z",
    "title": " OpenAI CEO Sam Altman says there’s no way to build future AI without energy breakthrough ",
    "url": "https://cointelegraph.com/news/open-ai-artificial-intelligence-ceo-sam-altman-no-way-build-future-ai-energy-fusion-breakthrough",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYjQzOWZiMWQtNGJkNS00NzEwLWI5ZmUtYTBiNjA5ZTBiODAzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Altman’s touting fusion as the way forward, after investing $375M in a fusion energy company in 2021. </p>\n                    <p><p>The future of artificial intelligence (AI) could depend on an ambitious, yet uncertain form of energy that doesn’t quite exist today, at least according to OpenAI CEO Sam Altman. </p><p>Speaking during events at the World Economic forum in Davos, Altman <a href=\"https://finance.yahoo.com/news/openai-ceo-altman-says-davos-173636736.html\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> that it was his belief that future AI would require massive amounts of power and that “there’s no way to get there without a breakthrough.” </p><p>He went on to explain that this challenge “motivates us to go invest more in fusion.”</p><p><a href=\"https://cointelegraph.com/news/open-ai-artificial-intelligence-ceo-sam-altman-no-way-build-future-ai-energy-fusion-breakthrough\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-17T15:45:21.000Z",
    "title": "Old and HODLed Bitcoin is on the move with whales active",
    "url": "https://cryptoslate.com/old-and-hodled-bitcoin-is-on-the-move/",
    "description": "<p>Launching the spot Bitcoin ETF in the U.S. caused quite a stir in the crypto market. While most of the activity and volatility came from institutions and short-term holders, another significant market segment has begun showing quite bearish signs. CryptoSlate analysis found extraordinarily sharp and aggressive movements and activity from long-term holders and whales. These [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/old-and-hodled-bitcoin-is-on-the-move/\">Old and HODLed Bitcoin is on the move with whales active</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-17T15:44:31.000Z",
    "title": "VanEck closes its Bitcoin Strategy ETF, citing lack of investor interest",
    "url": "https://cryptobriefing.com/vaneck-closes-bitcoin-strategy-etf-citing-performance-nvestor-interest/?utm_source=feed&utm_medium=rss",
    "description": "The decision comes a week after the asset manager received approval from the SEC to list a spot Bitcoin exchange-traded fund (ETF)."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-17T15:59:18.000Z",
    "title": "Shiba Inu (SHIB) and Polygon (MATIC) Turn Red on Charts – Traders Turn to Meme Moguls (MGLS) to Recoup Losses",
    "url": "https://cryptodaily.co.uk/2024/01/shiba-inu-shib-and-polygon-matic-turn-red-on-charts-traders-turn-to-meme-moguls-mgls-to-recoup-losses",
    "description": "Shiba Inu (SHIB) and Polygon (MATIC) have both entered the red zone on the charts, worrying investors."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-17T15:49:39.000Z",
    "title": "Bitcoin (BTC) dominance is weak - altcoins await",
    "url": "https://cryptodaily.co.uk/2024/01/bitcoin-btc-dominance-is-weak-altcoins-await",
    "description": "Bitcoin (BTC) could make one more try for a new local high at $50,000, or it could stay in a range around the current price. The latter scenario could potentially be very positive for altcoins."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T16:01:12.000Z",
    "title": "What Are The 3 Best Altcoins to Buy in January 2024?",
    "url": "https://www.cryptopolitan.com/what-are-the-3-best-altcoins-to-buy-in-january-2024/",
    "description": "Investing in the right cryptocurrencies is easier said than done. There are numerous options to choose from, and no one wants to pick a losing hand. This article points potential investors in the right direction. It reveals the three best altcoins to buy now, including Memeinator (MMTR), a revolutionary meme token on a mission to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T16:00:21.000Z",
    "title": "Media CEOs Advocate for Legislative Action on Generative AI",
    "url": "https://www.cryptopolitan.com/media-ceos-advocate-for-legislative-action-on-generative-ai/",
    "description": "Conde Nast Chief Executive Roger Lynch has emphasized the urgent need for congressional intervention in the face of potential business closures within the media industry due to the slow pace of litigation against generative AI companies. Speaking at a subcommittee hearing in the US Senate, Lynch warned that the protracted legal battles could lead to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T16:00:00.000Z",
    "title": "2 Cheap Alternatives to Solana (SOL) for Quick 10x Profits: Pandoshi (PAMBO) and Shiba Inu (SHIB)",
    "url": "https://www.cryptopolitan.com/2-cheap-alternatives-to-solana-sol-for-quick-10x-profits-pandoshi-pambo-and-shiba-inu-shib/",
    "description": "Cryptocurrency fanatics and traders are continuously in search of the following large opportunity to maximize their profits. While Solana (SOL) has been an extensive participant in the blockchain space, there are usually options emerging that promise short profits. In this text, we&#8217;re going to discover two such alternatives &#8211; Pandoshi (PAMBO) and Shiba Inu (SHIB) [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T15:56:44.000Z",
    "title": "Bitbot’s 2024 Presale: The Hottest Crypto Event of the Year?",
    "url": "https://www.cryptopolitan.com/bitbots-2024-presale-the-hottest-crypto-event-of-the-year/",
    "description": "With more than $3 billion dollars in trading volume in the Telegram trading bot space in 2023, this has proven to be one of crypto’s fastest growing sectors, fueling unprecedented interest in Bitbot’s presale announcement among crypto communities. Bitbot is already looking like one of the hottest crypto events of 2024 as it launches the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T15:52:31.000Z",
    "title": "Solana Price Prediction 2024-2033: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2024-2033 How much is SOL worth? The live Solana price today is $98.55 USD with a 24-hour trading volume of $5,212,471,771 USD. We update our SOL to USD price in real-time. Solana is down 2.32% in the last 24 hours. The current CoinMarketCap ranking is #5, with a live market cap of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T15:46:23.000Z",
    "title": "Rollbit Price Prediction 2024-2033:  Is It Time To Buy RLB?",
    "url": "https://www.cryptopolitan.com/rollbit-price-prediction/",
    "description": "Rollbit coin price prediction 2024-2033 Rollbit has quickly become one of the most popular crypto casinos and trading platforms. Launched in 2019, Rollbit offers a wide range of gaming, sports betting, futures trading, and NFT options for users. With no KYC requirements and support for numerous cryptocurrencies, Rollbit provides an easy entry into the world [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-17T16:00:16.000Z",
    "title": "CHILIZ PRICE ANALYSIS & PREDICTION (January 17) – CHZ Breaks Out Following A Massive Recovery In A Week, Are The Bulls Back",
    "url": "https://nulltx.com/chiliz-price-analysis-prediction-january-17-chz-breaks-out-following-a-massive-recovery-in-a-week-are-the-bulls-back/",
    "description": "As some low-cap altcoins saw notable recovery overnight, Chilliz&#8217;s price increased significantly and broke into a new monthly high. It currently looks strong and technically set to take more highs on a daily.  Following the late 2023 recovery across the crypto space, CHZ increased steadily and later surged through several [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-17T15:51:02.000Z",
    "title": "Gemini received AMF approval to launch services in France",
    "url": "https://crypto.news/gemini-received-amf-approval-to-launch-services-in-france/",
    "description": "The Gemini exchange, founded by the Winklevoss twins, has obtained approval from regulators to launch its services in France. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-17T16:00:32.000Z",
    "title": "SUI Overtakes Bitcoin, Aptos To Become 13th-Largest DeFi Network",
    "url": "https://www.newsbtc.com/news/defi/sui-overtakes-bitcoin-aptos-defi/",
    "description": "The SUI blockchain has been ramping up since the year 2024 began, and a natural consequence of this rapid growth is that it has now surpassed some major players in the decentralized finance (DeFi) space. This has put it ahead of heavy hitters such as Bitcoin and Aptos as SUI begins to leave its mark on the market. SUI Network TVL Crosses $360 Million The total value locked (TVL) on the SUI network has completely exploded in the last year. The total value locked on the blockchain was sitting at less than $12 million in the middle of 2024. But now, less than a month into the year 2024, the TVL has already crossed the $360 million mark. Related Reading: Bitcoin Gearing Up For Recovery As Large Whales Stop Moving Old Coins While this figure is still far off from the likes of Ethereum and BSC which continue to dominate the DeFi TVL, it puts it ahead of some heavy hitters in the game. For example, the Bitcoin TVL is currently sitting at $298.8 million, which means SUI TVL is much higher than that of Bitcoin. Then again, another network which is currently lagging behind SUI is the Aptos TVL. The Aptos blockchain, which was launched to much fanfare back in 2022, is sitting at a TVL of $133 million. This means that SUI’s TVL is more than 2x higher than that of Aptos. Other DeFi networks which SUI has surged ahead of include the likes of Kava at a TVL of $251 million, Near at a TVL of $94 million, and Metis at a TVL of $124 million. With its TVL figures, SUI is now the 13th-largest DeFi network. SUI price at $0.125 &#124; Source: SUIUSD on Tradingview.com DeFi Making A Comeback After a long stretch of poor performance, the DeFi market looks to be making its comeback in 2024. As DeFiLlama data shows, after the market peaked at a TVL of almost $245 billion in 2022, it dropped more than 50%, spending the majority of 2023 trailing below $70 billion. Related Reading: Analyst Predicts Cardano Future Using Historic Trends, And It’s Very Bullish However, as crypto market sentiment has improved, so has the DeFi TVL. The TVL has grown from its October 2023 lows of $47 billion to more than $72 billion so far in 2024. This is as a result of the likes of SUI gaining more adoption and their token prices also increasing. As expected, Ethereum dominates the majority of this TVL, currently sitting at $43.743 billion. The Tron and BSC networks are the second and third-largest, with TVLs of $8.14 billion and $5.41 billion, respectively. Featured image from The Block, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-17T15:44:13.000Z",
    "title": "Valkyrie Bitcoin ETF (BRRR) Soars 12% After Acquiring 355 BTC",
    "url": "https://www.crypto-news-flash.com/valkyrie-bitcoin-etf-brrr-soars-12-after-acquiring-355-btc/?utm_source=rss&utm_medium=rss&utm_campaign=valkyrie-bitcoin-etf-brrr-soars-12-after-acquiring-355-btc",
    "description": "<img width=\"1200\" height=\"600\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-jonathan-borba-14348489.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin-coin-rests-on-mobile-phone-with-list-of-trading-tickets.\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-jonathan-borba-14348489.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-jonathan-borba-14348489-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-jonathan-borba-14348489-768x384.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-jonathan-borba-14348489-150x75.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/pexels-jonathan-borba-14348489-450x225.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Valkyrie Bitcoin ETF (BRRR) experiences an impressive 12% gain after adding 355 BTC to its portfolio. Competitors, such as GBTC and IBIT, face declines, while Valkyrie&#8217;s BRRR shows an outstanding recovery. In a surprising recovery, the Valkyrie Bitcoin ETF (BRRR) experienced a remarkable 12.64% surge to $13.84 in the pre-market session. This rally follows four [...]"
  }
]