[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T22:47:11.000Z",
    "title": "Crypto scams, hacks, and rug pulls drop dramatically in H1 2023",
    "url": "https://www.cryptopolitan.com/crypto-scams-and-rug-pulls-drop-in-h1-2023/",
    "description": "According to a recent report by Beosin, a Web3 security firm, the total value of cryptocurrencies lost in scams, hacks, and rug pulls during the first half of 2023 amounted to $656 million. This figure includes $471.43 million lost in 108 protocol attacks, $108 million in various phishing scams, and $75.87 million from 110 rug ... <a title=\"Crypto scams, hacks, and rug pulls drop dramatically in H1 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-scams-and-rug-pulls-drop-in-h1-2023/\" aria-label=\"More on Crypto scams, hacks, and rug pulls drop dramatically in H1 2023\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T23:00:52.000Z",
    "title": "Here’s What Caused Bitcoin’s Flash Crash To $29,000",
    "url": "https://www.newsbtc.com/bitcoin-news/heres-what-caused-bitcoins-flash-crash-to-29000/",
    "description": "Bitcoin had been trending over $31,000 for the better part of Friday after reclaiming this support level from the bears. However, this did not last long as the digital asset saw a flash crash that sent its price spiraling toward the $29,000 level. SEC Says ETF Filings Are Inadequate On Friday, the Wall Street Journal released a report that negatively impacted the market. The report revealed that the United States Securities and Exchange Commission thought that the recent barrage of Bitcoin ETH filings that it had received was inadequate in their filings. Related Reading: Litecoin Bull Case Grows Stronger As Hashrate Touches New All Time-High This follows a two-week stretch of positivity after heavy hitters such as BlackRock, WisdomTree, and Fidelity, among others, filed requests for Bitcoin Spot ETFs with the SEC. Following the news of the filings, the price of Bitcoin rallied tremendously, crossing $31,000 for the first time in over one month. However, with the news of the SEC saying that the filings are inadequate, it has quickly eroded investor sentiment. The price of BTC fell to $29,200 on Friday afternoon, before recovering quickly. Although the damage was already done and BTC bulls are now struggling to maintain support at $30,000. Bitcoin In Freefall Bitcoin had been able to establish a reasonably bullish trend over the last couple of weeks. But that did not last long as the SEC came to burst the bubble for investors. As a result, Bitcoin seems to be in freefall with no reasonable support to keep the price from falling lower. BTC struggles to hold $30,000 &#124; Source: BTCUSD on TradingView.com In a matter of hours, the digital asset has lost about $1,000 of its value, turning a previously good day into a bloody day for investors. This rapid decline has shoved the cryptocurrency below its 5-day moving average, which could see BTC become bearish over the weekend. However, in the mid and long-term, the digital asset remains as bullish as ever, ranging above both its 50-day and 100-day moving averages. Both of these levels signal that while bears may have gained temporary control of the price, bulls remain largely in control. And as long as sell pressure remains low, then BTC could recover back above $31,000 over the next couple of days. Related Reading: The Blessing Of July: Can Bitcoin Climb To $36,000 In The Coming Month? At the time of writing, BTC is down 1.59% in the last 24 hours to be trading slightly above $30,000. Although it is currently struggling, its trading volume is sitting above $23.5 billion, showing a significant amount of demand for the digital asset as well. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]