[
  {
    "source": "BTCManager",
    "date": "2023-06-17T11:59:35.000Z",
    "title": "Ripple boss sheds light on SEC and Hinman’s internal documents",
    "url": "https://crypto.news/ripple-boss-sheds-light-on-sec-and-hinmans-internal-documents/",
    "description": "Brad Garlinghouse reveals details about the SEC and Hinman, unveiling cryptic communications and regulatory challenges. Ripple disputes regulator's claim that XRP is a security"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-17T12:06:27.000Z",
    "title": "Binance Coin (BNB) Faces Sideways Movement, Bears Threaten Further Sell-Off",
    "url": "https://www.newsbtc.com/news/binance-coin/binance-coin-bnb-faces-sideways-movement-bears-threaten-further-sell-off/",
    "description": "Binance Coin (BNB), the native token of the Binance exchange, has recently experienced a period of sideways movement. Despite reaching a weekly high of $307 on June 4th, BNB&#8217;s price has encountered resistance and is currently trading at $246.2. This article provides an analysis of the recent price action, discusses the potential reasons behind BNB&#8217;s performance, and explores the future prospects for the coin. The recent decline in BNB&#8217;s price can be attributed to several factors. Firstly, the overall market sentiment has been influenced by a broader correction in the cryptocurrency market. Many altcoins, including BNB, have witnessed a decrease in value as investors take profits and adjust their portfolios. Additionally, concerns over regulatory developments and market uncertainties have added to the selling pressure on BNB. Bearish Threat And Technical Indicators Despite attempts by bulls to regain control, bears pose a significant threat to BNB&#8217;s price stability. The crucial resistance level of $308 has become a battleground for market participants. If the bears manage to break down this level, it could trigger a further sell-off, potentially pushing the price lower.  Technical indicators paint a cautious picture for BNB. The Moving Average Convergence Divergence (MACD) indicator has exhibited a bearish crossover, signaling a continuation of selling pressure in the near term. Furthermore, the Relative Strength Index (RSI) currently stands at 35.63 levels, suggesting that there could be a further downside if buying pressure does not increase. Related Reading: PEPE Jumps Nearly 10% In 24 Hours, Sparking Speculation Of A New Rally Moreover, the 50-Weekly Moving Average positioned below the 200-Weekly MA indicates a bearish trend for BNB. This configuration suggests that the price could continue downward in the coming days unless significant positive developments or market catalysts emerge. What’s Next For BNB? Market participants will closely monitor the price action around the critical resistance level of $308. A successful breach above this level could ignite renewed bullish momentum, potentially leading to a recovery in BNB&#8217;s price. Traders and investors will also pay attention to any regulatory developments and market trends that could influence BNB&#8217;s performance. Despite the current challenges, Binance Coin holds promise as a key player in the cryptocurrency ecosystem. As Binance continues to expand its services and offerings, including its decentralized exchange (DEX) and various partnerships, there is potential for increased adoption of BNB, which could positively impact its price in the long run. Related Reading: Percentage Of ETH Addresses In Profit Reaches 5-Month Low It is important to note that the cryptocurrency market is highly volatile, and prices can change rapidly. Investors are advised to conduct thorough research, stay informed about market developments, and exercise caution when making investment decisions. At press time, Binance Coin (BNB) was trading at $246.2 with a daily price increase of 2.93%. Featured image from iStock.com, charts from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-17T11:39:51.000Z",
    "title": "Chainlink Leads the Charge: Sustainable Oracle Economics Key to Web3 Success",
    "url": "https://www.crypto-news-flash.com/chainlink-leads-the-charge-sustainable-oracle-economics-key-to-web3-success/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-leads-the-charge-sustainable-oracle-economics-key-to-web3-success",
    "description": "Web3&#8217;s sustainability is paramount as it emerges as a transformative technology, with significant capital markets showing interest in leveraging its power for the tokenization of assets. Chainlink 2.0 leads the charge in creating a sustainable oracle economy, ensuring long-term operability of the Web3 ecosystem by restructuring user fees, cutting operational costs, and strengthening cryptoeconomic security. [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-17T11:53:00.000Z",
    "title": "Here’s List of Coins Celsius Will Dump in July Under Reorganization Bid",
    "url": "https://coinedition.com/heres-list-of-coins-celsius-will-dump-in-july-under-reorganization-bid/",
    "description": "<img width=\"150\" height=\"150\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Tens_of_Celsius_clients_ask_US_court_to_recover_22_5M_in_crypto-150x150.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Tens_of_Celsius_clients_ask_US_court_to_recover_$22_5M_in_crypto\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" /><p>Celsius Network, the troubled crypto lender, has announced its latest move amid the digital asset market’s recovery. In a tweet, Celsius revealed its plan to sell all altcoins held by its customers, except those in Custody and Withhold accounts, beginning July 1, 2023. According to a court report, Celsius Network is currently holding approximately $215 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/heres-list-of-coins-celsius-will-dump-in-july-under-reorganization-bid/\">Here’s List of Coins Celsius Will Dump in July Under Reorganization Bid</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-17T11:45:51.000Z",
    "title": "Analyst Who Called 2022 Crypto Low Says Bitcoin Getting Close to Bottoming Out – But There’s a Catch",
    "url": "https://dailyhodl.com/2023/06/17/analyst-who-called-2022-crypto-low-says-bitcoin-getting-close-to-bottoming-out-but-theres-a-catch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Crypto-Low-Says-Bitcoin-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Crypto-Low-Says-Bitcoin-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Crypto-Low-Says-Bitcoin-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Crypto-Low-Says-Bitcoin-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Crypto-Low-Says-Bitcoin-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Crypto-Low-Says-Bitcoin-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Crypto-Low-Says-Bitcoin-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A top crypto analyst is predicting that Bitcoin’s (BTC) recent market correction might soon come to an end. Pseudonymous analyst DonAlt tells the 51,200 subscribers of the TechnicalRoundup YouTube channel that Bitcoin is likely close to finding the market bottom. However, the analyst says Bitcoin may have to dip by more than 20% from its current [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/17/analyst-who-called-2022-crypto-low-says-bitcoin-getting-close-to-bottoming-out-but-theres-a-catch/\">Analyst Who Called 2022 Crypto Low Says Bitcoin Getting Close to Bottoming Out – But There’s a Catch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]