[
  {
    "source": "CoinDesk",
    "date": "2023-07-12T08:58:42.000Z",
    "title": "MicroStrategy Only Needs to Liquidate Bitcoin in Extreme Price Corrections: Bernstein",
    "url": "https://www.coindesk.com/business/2023/07/12/microstrategy-only-needs-to-liquidate-bitcoin-in-extreme-price-corrections-bernstein/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A more robust bitcoin price means the company has a stronger balance sheet, a higher share price and easier debt repayment without the need to sell down its cryptocurrency holdings, the report said."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-12T08:50:09.000Z",
    "title": "U.S. Senate Finance Committee Asks Crypto Industry for Tax Guidance",
    "url": "https://www.coindesk.com/policy/2023/07/12/us-senate-finance-committee-asks-crypto-industry-for-tax-guidance/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The committee sought input from the cryptocurrency industry to better understand the tax challenges presented by digital assets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T08:45:19.000Z",
    "title": "Russian parliament passes a “digital rouble” bill ",
    "url": "https://cointelegraph.com/news/digital-rouble-russian-parliament-passes-a-digital-rouble-bill",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/bb635407-4bfb-477b-8ed5-66c80cef83b5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Document faces confirmation in the higher chamber of Russian parliament and, afterward, the President’s signature. </p>\n                    <p><p>The central bank digital currency (CBDC) project in Russia made one large step closer to reality. On July 11, Gosduma, the lower chamber of the Russian parliament, <a href=\"https://sozd.duma.gov.ru/bill/270838-8#bh_note\" target=\"_blank\" rel=\"noopener nofollow\">passed</a> a “digital rouble” bill in the third reading. Now the document faces confirmation in the higher chamber and, afterward, the President’s signature. </p><p>The bill, the draft for which was last amended at the end of June, sets the legal definitions of “platform, ” participants” and “users”, as well as the general guidelines for the CBDC ecosystem. </p><p>In the current framework, the Central Bank of Russia (CBR) will become the principal “operator” of the digital rouble infrastructure. It also bears the responsibility for all the stored assets. </p><p>The main aim of CBDC, according to the Central Bank, is to serve as a payment and transfer method. Hence, its users won’t be able to open savings accounts. As the CBR emphasizes, payments and transfers would be totally free for the individual customers and cost 0.3% of the payment for corporate clients. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/belarus-to-decide-on-issuing-cbdc-by-year-s-end-national-bank-chair\"><strong><em>Belarus to decide on issuing CBDC by year’s end: National bank chair</em></strong></a></p><p>The bill was introduced to Gosduma in December 2022 and passed through its first reading in March 2023. In February, a subsidiary of the leading Russian government-owned gas company, Gazprombank, <a href=\"https://cointelegraph.com/news/russia-s-gazprombank-recommends-slow-cbdc-rollout-fearing-loss-of-income\">warned against possible risks for banks</a> in the case of the fast transition to digital money. The Russian branch of McKinsey <a href=\"https://www.rbc.ru/crypto/news/63d958e59a7947a09ac6d71c\" target=\"_blank\" rel=\"noopener nofollow\">estimated</a> the potential losses of traditional banks from the CBDC implementation at around $3.5 billion (250 billion rubles) in five years. At the same time, the consultancy firm estimated the retailers’ profit at $1.1 billion yearly.</p><p>In a recent interview, the deputy chairman of CBR, Olga Skorobogatova, <a href=\"https://www.vedomosti.ru/finance/news/2023/07/11/984805-gosduma-prinyala-zakon-tsifrovogo-rublya#:~:text=%D0%9E%D0%BB%D1%8C%D0%B3%D0%B0%20%D0%A1%D0%BA%D0%BE%D1%80%D0%BE%D0%B1%D0%BE%D0%B3%D0%B0%D1%82%D0%BE%D0%B2%D0%B0%20%D1%80%D0%B0%D0%BD%D0%B5%D0%B5-,%D1%81%D0%BE%D0%BE%D0%B1%D1%89%D0%B0%D0%BB%D0%B0,-%2C%20%D1%87%D1%82%D0%BE%20%D1%86%D0%B8%D1%84%D1%80%D0%BE%D0%B2%D0%BE%D0%B9%20%D1%80%D1%83%D0%B1%D0%BB%D1%8C\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> the mass rollout of the “digital rouble” for “all Russian citizens” by 2025-27. In 2023-24 the CBDC will be tested in a pilot regime. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-miami-2023-shitcoins-for-bitcoin/\"><strong><em>Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-12T09:07:09.000Z",
    "title": "Analysis of Bitcoin ownership over time",
    "url": "https://cryptoslate.com/insights/analysis-of-bitcoin-ownership-over-time/",
    "description": "<p>Quick Take More than 10 years: 14.8% of the total Bitcoin supply is held by individuals or entities who have owned their Bitcoin for over 10 years. Between 7 and 10 years: 5.6% of the total Bitcoin supply is held by individuals or entities who have owned their Bitcoin for a duration falling between 7 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/analysis-of-bitcoin-ownership-over-time/\">Analysis of Bitcoin ownership over time</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-12T08:47:25.000Z",
    "title": "Bitcoin’s Perfect Storm: BlackRock ETF, Halving, and Coins Leaving Exchanges – Are We on the Verge of Bitcoin’s Biggest Surge?",
    "url": "https://www.cryptoglobe.com/latest/2023/07/bitcoins-perfect-storm-blackrock-etf-halving-and-coins-leaving-exchanges-are-we-on-the-verge-of-bitcoins-biggest-surge/",
    "description": "Introduction Bitcoin, the pioneering cryptocurrency, is stirring anticipation as a convergence of factors indicates the potential for a historic surge in its value. With the filing of a Bitcoin exchange-traded fund (ETF) by BlackRock, an upcoming halving event, shifting sentiment, and a notable trend of coins leaving exchanges, the stage is set for a potential […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-12T09:00:00.000Z",
    "title": "ConsenSys Announces Launch Of Linea zkEVM On Ethereum",
    "url": "https://cryptodaily.co.uk/2023/07/consensys-announces-launch-of-linea-zkevm-on-ethereum",
    "description": "<p>ConsenSys has announced the launch of its layer-2 network Linea, as the Ethereum ecosystem welcomed yet another scaling solution.&nbsp;</p>\n<p>Linea incorporates zero-knowledge cryptography and has produced considerable scaling milestones during testing, achieving faster throughput and significantly lower transaction costs compared to the main Ethereum network.&nbsp;</p>\nA New Scaling Solution&nbsp;\n<p>Linea is ConsenSys&rsquo;s new layer-2 scaling solution that enables developers to build or migrate decentralized applications (dApps) for Ethereum. The layer-2 network utilizes zero-knowledge proofs and is EVM-compliant, meaning applications on the network can seamlessly interact with the Ethereum blockchain. Zero-knowledge (zk) cryptography helps facilitate greater scalability and improved transaction speeds, thus helping address network congestion and high gas fees on Ethereum. The rollup network implemented by Linea is commonly known as zkEVM, thanks to its compliance with the Ethereum Virtual Machine (EVM).&nbsp;</p>\nA Highly Successful Testing Phase&nbsp;\n<p>The Linea zkEVM has been launched after a lengthy and highly successful testing phase after it was revealed that the ConsenSys team had been working on the rollup for the past four years. The testing phase began when ConsenSys released a public testnet on the 28th of March, enabling the stress-testing of the new layer-2 technology. The testnet phase saw around 5.5 million unique wallets conduct 46 million transactions. ConsenSys noted several improvements when it came to Linea&rsquo;s performance, transaction costs, and user experience throughout its testing phase.&nbsp;</p>\n<p>ConsenSys has claimed that the fees on the network will be 15 times lower than those prevailing on the Ethereum main network. The alpha phase began on the 11th of July, with over 100 partners involved. Joseph Lubin, the founder and CEO of ConsenSys, talked about the number of layer-2 Ethereum scaling solutions and protocols and highlighted their importance when it came to driving the development of Web3 functionality and applications.&nbsp;</p>\n\n<p>&ldquo;With the Merge to Proof of Stake and the broad traction of the rollup-centric roadmap, Ethereum L2s are set to play a crucial role in making great advances in scalability and usability.&rdquo;</p>\n\n<p>The announcement also highlights several decentralized finance (DeFi) applications migrating to Linea to take advantage of its fast finality, security from the Ethereum mainnet, and capital-efficient bridge. The network also offers users low gas fees, high throughput, and low latency, all of which are critical to power blockchain gaming, non-fungible tokens, and social applications. App developers can deploy their projects and applications on Linea&rsquo;s &ldquo;Alpha&rdquo; network as early as Friday. However, general users will have to wait until next week to access the network.&nbsp;</p>\n<p>The launch of the Alpha mainnet will use several safeguards to protect decentralized applications, users, and the network itself. Measures include allowing only launch partners to execute calls over the network for the first week. ConsenSys plans to further open up the network during ETHCC, which is scheduled to take place in France from the 17th of July. It also plans to hold a bug bounty and monitor performance before opening up the network to end users.&nbsp;</p>\n<p>ConsenSys also announced the launch of its Linea Ecosystem Investment Alliance (EIA). The alliance will see over 30 venture capitalist firms give advisory assistance and lend capital to ecosystem builders. Ethereum layer-2 solutions have become a major talking point in 2023, with Polygon also taking its zkEVM network public in March. Starknet has also highlighted plans to increase the throughput on its network this year. Starknet founder Eli Ben-Sasson is the pioneer behind zk-proofs.&nbsp;</p>\nKey Features&nbsp;\n<p>Linea has seen the introduction of several features and upgrades with its alpha mainnet phase. These include a dynamic fee mechanism and a new outer-proof system. The alpha mainnet phase also introduces a feature called &ldquo;batch conflation.&rdquo; This feature optimizes the number of layer-2 transactions and blocks that can fit into a layer-1 batch. This allows it to reduce fixed costs typically associated with layer-1 and help provide a cost-effective transaction experience. These upgrades will help Linea offer transaction costs that are far lower than Ethereum&rsquo;s main layer.&nbsp;</p>\n<p>Additionally, MetaMask will also offer support for Linea soon, allowing users to access the network through the MetaMask Portfolio and Bridge, Swap, and Buy features. The MetaMask integration can be expected in the next few weeks and allow wallet users to interact with decentralized applications and protocols based on Linea.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T09:05:36.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-12T09:03:19.000Z",
    "title": "7-Eleven offers free NFTs on its 96th birthday",
    "url": "https://crypto.news/7-eleven-offers-free-nfts-on-its-96th-birthday/",
    "description": "7-Eleven, the world’s largest convenience store chain, just tapped into the non-fungible token (NFT) ecosystem on its 96th birthday. According to the press release, the largest convenience store chain launched its “Find Your Slurpee Vibe” collection on Polygon. 7-Eleven allows&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T09:00:43.000Z",
    "title": "Market Analysts Explain Why More Pepe Coin (PEPE) Investors Are Switching to Anarchy (ANA)",
    "url": "https://www.crypto-news-flash.com/market-analysts-explain-why-more-pepe-coin-pepe-investors-are-switching-to-anarchy-ana/?utm_source=rss&utm_medium=rss&utm_campaign=market-analysts-explain-why-more-pepe-coin-pepe-investors-are-switching-to-anarchy-ana",
    "description": "<img width=\"512\" height=\"280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T111529.114.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T111529.114.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T111529.114-300x164.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market has been tense lately, especially in the meme coin sector. But not for Anarchy ($ANA). In fact, the new token is upsetting the league of top-ranking meme coins by pulling their whales and causing all sorts of worries for them. PEPE recently entered the meme coin spotlight, launching in April after a [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-12T08:47:08.000Z",
    "title": "4 Early Crypto Picks For Massive Gains",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/4-early-crypto-picks-for-massive-gains/",
    "description": "<p>By now, we all know the value of getting in early to good crypto projects. But when is early? IDO? Pre-IDO? Post-IDO after the first wave of selling? We don’t look at any of that. We let the price tell us when we are early. Today, we have 4 crypto great projects where you are [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/4-early-crypto-picks-for-massive-gains/\">4 Early Crypto Picks For Massive Gains</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-12T08:50:52.000Z",
    "title": "BAYC NFT Prices Drop Following a Challenging Month for APE",
    "url": "https://coinedition.com/bayc-nft-prices-drop-following-a-challenging-month-for-ape/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/0710.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/0710.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/0710-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/0710-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/0710-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/0710-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/0710-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/0710-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/0710-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/0710-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/0710-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/0710-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/0710-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/0710-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/0710-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/0710-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/0710-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The past month has been extremely hard on ApeCoin (APE) as the crypto’s price decreased by more than 17% during this period alone. In addition to this, APE’s struggles have also been reflected in the performance of the Bored Ape Yacht Club (BAYC) NFT collection. The crypto market tracking website, CoinMarketCap, indicated that APE was [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bayc-nft-prices-drop-following-a-challenging-month-for-ape/\">BAYC NFT Prices Drop Following a Challenging Month for APE</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]