[
  {
    "source": "Cointelegraph",
    "date": "2023-07-24T10:04:12.000Z",
    "title": "Biggest mining difficulty drop of 2023? 5 things to know in Bitcoin this week",
    "url": "https://cointelegraph.com/news/bitcoin-mining-difficulty-drop-2023-5-things-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/75b728d4-415c-487f-afe1-00d047a8f53f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin begins to fulfil traders' downside targets as BTC price action retraces its steps in a crucial macro week.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) enters the last full week of July on an uncertain footing as $30,000 becomes resistance.</p><p>In what promises to be an exciting — but perhaps nerve-racking — week for traders, BTC price action is staring down a combination of volatility triggers.</p><p>Chief among these is the United States Federal Reserve’s decision on interest rates, this headlining an important slew of macro data releases. </p><p>Some hope that these alone will be enough to shake Bitcoin out of its month-long trading range, in which it has barely moved from the $30,000 mark. The market has so far offered little by way of cues as to where it might head next.</p><p>That said, traders have become impatient, and increasingly believe that BTC/USD will ultimately break down from current levels to head toward $25,000 or even lower.</p><p>Cointelegaph takes a look at the main factors in the debate over BTC price performance as July comes to a close.</p><h2>BTC price tags $29,000 in bearish start to week</h2><p>Bitcoin delivered a classic volatility burst into the July 23 weekly close, giving bulls a glimpse of $30,000 support potentially returning.</p><p>This was short lived, however, and with hours still left to go until the weekly candle close, BTC/USD retraced its last-minute gains to end the week at almost exactly $30,000.</p><p>Overnight price action was weaker still, and at the time of writing, Bitcoin was headed toward $29,000, per data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a>.</p><p>Overall, however, the all-too-familiar range continues to endure.</p><p>As the weekend came to a close, Michaël van de Poppe, founder and CEO of trading firm Eight, <a href=\"https://twitter.com/CryptoMichNL/status/1683196280560840707\" target=\"_blank\" rel=\"noopener nofollow\">highlighted</a> what he called the “crucial area” for bulls to break through.</p><p>“The crucial level didn't break for Bitcoin, so we'll continue the sideways chop,” he <a href=\"https://twitter.com/CryptoMichNL/status/1683380041558704129\" target=\"_blank\" rel=\"noopener nofollow\">continued</a> on the day.</p><blockquote>\"The scenarios remain the same; - Longs above $30,200-30,400 - Longs when we get to $29,000.\"</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/329b0923-b5fb-4feb-b0d2-690d7b57fd08.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Michaël van de Poppe/Twitter</em></figcaption></figure><p>Popular trader Daan Crypto Trades noted that the spike to $30,300 had effectively opened up and already closed a CME futures gap. </p><p>“Don’t fall for the weekend deviations,” he <a href=\"https://twitter.com/DaanCrypto/status/1683357913580969985\" target=\"_blank\" rel=\"noopener nofollow\">told</a> Twitter followers.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/9242a800-bb93-4c47-98cc-b2af60028757.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Daan Crypto Trades/Twitter</em></figcaption></figure><p>A cautiously optimistic take on the past month’s range came from fellow trader Credible Crypto, who suggested that Bitcoin could avoid more significant losses.</p><p>“For the last 30 days price has been within a tight range and aggregate OI has oscillated between 2 key levels,” he <a href=\"https://twitter.com/CredibleCrypto/status/1683316250993393664\" target=\"_blank\" rel=\"noopener nofollow\">summarized</a>. </p><blockquote>“Price ranges, OI builds, then we see a flush up/down which resets OI before the cycle repeats. If it continues, downside should be limited here at the lows.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/f997b6a4-bf19-4203-8c6e-775b5cc1167f.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>Fed rate hike decision leads \"action packed week\"</h2><p>One event dominates the macro landscape this week, and not only in crypto.</p><p>The Fed’s Federal Open Market Committee (FOMC) will meet on July 26 to decide how far — if at all — to raise benchmark interest rates.</p><p>Markets have little doubt that a hike is to come — unlike last month, language from Fed officials has led them to practically unanimously predict a 0.25% increase.</p><p>According to the latest data from CME Group’s <a href=\"https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html\" target=\"_blank\" rel=\"noopener nofollow\">FedWatch Tool</a>, the odds of that occurring currently stand at 99.8%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/0545b5a8-12ef-4cf0-af0a-7243a049501b.png\"  /><figcaption style=\"text-align: center;\"><em>Fed target rate probabilities chart. Source: CME Group</em></figcaption></figure><p>The week’s macro data releases will only come after FOMC, leaving no room for these to sway a decision in time. The releases are no less important, however, and include Q2 GDP, as well as the Personal Consumption Expenditures (PCE) Index print.</p><p>“Nothing like an action packed week in the markets. 20% of S&amp;P 500 companies reporting earnings along with a Fed meeting and inflation data to top it off,” financial commentary resource The Kobeissi Letter <a href=\"https://twitter.com/KobeissiLetter/status/1683256240632221696\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in part of a Twitter summary.</p><blockquote>“After a couple weeks of low volatility, things should get interesting this week. It’s a great week to be a trader.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Key Events This Week:<br><br>1. Consumer Confidence data - Tuesday<br><br>2. New Home Sales data - Wednesday<br><br>3. Fed Interest Rate Decision - Wednesday<br><br>4. Q2 2023 GDP data - Thursday<br><br>5. PCE Inflation data - Friday<br><br>6. ~20% of S&amp;P 500 companies report earnings<br><br>Action packed week ahead.</p>&mdash; The Kobeissi Letter (@KobeissiLetter) <a href=\"https://twitter.com/KobeissiLetter/status/1683122592083845120?ref_src=twsrc%5Etfw\">July 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Fellow financial commentator Tedtalksmacro noted that overall global central bank liquidity conditions, despite the potential incoming hike, appeared to be at macro lows.</p><p>“After free falling since March, global CB liquidity could have found a bottom here,” he <a href=\"https://twitter.com/tedtalksmacro/status/1681980350187094016/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">commented</a> alongside comparative charts.</p><blockquote>“Historically that's been good for BTC + risk.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/6393f364-6061-4a2b-bb7a-35d04543a6e3.png\"  /><figcaption style=\"text-align: center;\"><em>Global central bank liquidity vs. BTC/USD chart. Source: Tedtalksmacro/Twitter</em></figcaption></figure><h2>Fundamentals due a dip in Hash Ribbons \"capitulation\"</h2><p>Bitcoin’s stubborn trading range is taking its toll once again on network fundamentals, as fervent competition among miners cools.</p><p>According to the latest estimates from <a href=\"https://btc.com/stats/diff\" target=\"_blank\" rel=\"noopener nofollow\">BTC.com</a>, Bitcoin’s mining difficulty will decrease by around 4% at its next automated readjustment on July 26.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-mining-difficulty-hits-all-time-high-as-btc-miner-selling-peaks\">Currently at all-time highs</a>, difficulty has seen only a handful of drops this year, and this week’s could be the largest of 2023 so far.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/d3ad7d63-0878-4fdd-bcc0-225cc660bbba.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin network fundamentals overview (screenshot). Source: BTC.com</em></figcaption></figure><p>Hash rate tells a similar story of consolidation after hitting its own all-time highs this month. Analyzing the Hash Ribbons metric, Charles Edwards, founder of crypto asset manager Capriole Investments, flagged a new “capitulation” phase.</p><p>While absent from the market since late 2022, when Bitcoin was still suffering the consequences of the FTX meltdown, a capitulation is nothing for traders to fear, Edwards argued.</p><p>Despite this, he called the explosive growth in hash rate of the past seven months “unsustainable.”</p><p>“We have a Hash Ribbon capitulation. AKA a slowing in Bitcoin's Hash Rate growth after what has been an incredible (unsustainable) 50% increase in 2023,” he <a href=\"https://twitter.com/caprioleio/status/1681814917500870658/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">commented</a> last week. </p><blockquote>“HR capitulation is not a sell signal, but it's also not bullish. Risk management warranted until growth resumes.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/b4ef6c8c-ed72-4e28-8eb8-f8694af34b90.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Hash Ribbons chart. Source: Charles Edwards/Twitter</em></figcaption></figure><p>Cointelegraph continues to cover extensively the status quo among miners, with various theories emerging over <a href=\"https://cointelegraph.com/news/bitcoin-miners-selling-btc-as-hedge-bitfinex\">recent BTC selling behavior</a>.</p><h2>NVT taps highest since 2019</h2><p>As Bitcoin <a href=\"https://cointelegraph.com/news/bitcoin-800000-block-mined\">mines its 800,000th block</a>, a classic on-chain metric is delivering a similar signal that — at least for the time being — BTC price conditions may be overheated.</p><p>The Network Value to Transaction (NVT) Ratio, which divides the Bitcoin market cap by the U.S. dollar value of daily on-chain transactions, has hit four-year highs.</p><p>NVT seeks to give an indication of when on-chain volume is out of sync with overall network value, but its implications can vary.</p><p>As explained by its creator, analyst Willy Woo, NVT spikes can occur in both bull markets and periods of “unsustainable” price growth.</p><p>“When Bitcoin`s NVT is high, it indicates that its network valuation is outstripping the value being transmitted on its payment network, this can happen when the network is in high growth and investors are valuing it as a high return investment, or alternatively when the price is in an unsustainable bubble,” he wrote in an <a href=\"https://charts.woobull.com/bitcoin-nvt-ratio/\" target=\"_blank\" rel=\"noopener nofollow\">accompanying introduction</a> to the metric on his analytics site, Woobull.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/611afb84-39f4-4c44-8663-be2698ce50a5.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin NVT Ratio chart (screenshot). Source: Woobull</em></figcaption></figure><p>In his <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-interview-charles-edwards\">latest interview</a> with Cointelegraph, meanwhile, Capriole’s Edwards argued that NVT was still in check versus extreme highs, such as those seen during 2021.</p><p>“NVT is currently trading at a normal level,” he said, adding that “given its normalized reading today, it doesn't tell us much; just that Bitcoin is fairly valued according to this metric alone.”</p><h2>Long-term holders control 75% of BTC supply</h2><p>A silver lining in the making? Bitcoin’s available supply continues to shrink behind the scenes.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-can-hit-19k-btc-price-big-move\">Bitcoin can still hit $19K, warns trader ahead of BTC price ‘big move’</a></em></strong></p><p>As noted by various market participants, the amount of BTC on offer for purchase shows enduring conviction among its most ardent hodlers.</p><p>55% of the supply has now remained dormant for <a href=\"https://twitter.com/WClementeIII/status/1681674247805059073\" target=\"_blank\" rel=\"noopener nofollow\">at least two years</a>, and 29% for <a href=\"https://twitter.com/glassnodealerts/status/1683330007316267008\" target=\"_blank\" rel=\"noopener nofollow\">five years or more</a>, data from on-chain analytics firm Glassnode states.</p><p>“The Bitcoin Long-Term Holder Supply has reached a new ATH of 14.52M BTC, equivalent to 75% of the circulating supply,” additional analysis <a href=\"https://twitter.com/glassnode/status/1683401299956465665/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">highlighted</a> this week. </p><blockquote>“This suggests HODLing is the preferred market dynamic amongst mature investors.”</blockquote><p>An accompanying chart showed the amount of BTC in the hands of so-called long-term holders, or LTHs, defined as entities hodling coins for 155 days or more.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/c82e039a-341f-4f0b-87f0-c61e6051a5e3.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Long-Term Hodler Supply annotated chart. Source: Glassnode/Twitter</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/tokenizing-music-royalties-nfts-taylor-swift-3lau-nas-the-weeknd/\">Tokenizing music royalties as NFTs could help the next Taylor Swift</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-24T09:57:44.000Z",
    "title": "Delio the next crypto lender to fall?",
    "url": "https://cryptodaily.co.uk/2023/07/delio-the-next-crypto-lender-to-fall",
    "description": "<p>The South Korean Financial Services Commission's (FSC) decision to seize Delio&rsquo;s assets cast doubts over its future operations.&nbsp;</p>\n<p>South Korea's crypto lending powerhouse, Delio, established in 2018, is currently navigating stormy waters. Its woes began when the FSC, a local financial watchdog, took control of both the company's and its customers' assets. This included not just the tangible assets but also their cold wallets and ledgers. The seizure, a result of an ongoing legal tussle with its depositors, has put Delio in a tight spot, making it challenging for them to offer their regular suite of services.&nbsp;</p>\nA suspension of interest payments\n<p>The firm has emphasised the need to safeguard its assets, especially considering the interests of its depositors. In light of these events, Delio made the tough call to suspend interest payments to its deposit and vault users starting July 24. This move was not isolated; other services that demanded additional expenditures, like operational costs, were also put on hold.&nbsp;</p>\nDeposits and withdrawals stopped\n<p>This decision has understandably heightened concerns among their clientele. Delio's recent actions can be traced back to June 14 when they abruptly stopped deposits and withdrawals on their platform. This move was a protective measure against market volatility, which was exacerbated by similar actions from their sister lending company, Haru Invest. Haru Invest's decision to halt withdrawals was influenced by the discovery of misleading information from its consignment operator, B&amp;S Holdings.</p>\nFSC gets involved&nbsp;\n<p>The FSC's involvement deepened when they initiated an investigation into Delio's sudden transaction suspension. This probe culminated in a lawsuit against Delio, accusing them of fraud, embezzlement, and breach of trust. The fallout from this legal action saw travel restrictions placed on Delio's CEO, Jeong Sang-ho, among others.&nbsp;</p>\nOne of the largest crypto lending platforms\n<p>Despite the shadows currently cast on Delio, it's vital to recognize their significant standing in the crypto realm. They are one of South Korea's premier crypto lending platforms, boasting a vast array of services from custody to staking. Their impressive portfolio includes about $1 billion in Bitcoin, $200 million in Ether, and a staggering $8.1 billion in various other altcoins.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T10:06:15.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.1316, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 5.5% decrease. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T09:51:02.000Z",
    "title": "UK inflation to top Bank of England’s 2% target until end of 2024",
    "url": "https://www.cryptopolitan.com/uk-inflation-to-top-bank-of-england-2-target/",
    "description": "Inflation will exceed the Bank of England&#8217;s (BoE) 2% target for over a year, impeding UK economic development and depleting the workers&#8217; finances. According to consulting firm the EY Item Club, prices are predicted to decrease considerably more slowly than initially anticipated because of the continued high cost of food and energy. Inflation in the ... <a title=\"UK inflation to top Bank of England&#8217;s 2% target until end of 2024\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-inflation-to-top-bank-of-england-2-target/\" aria-label=\"More on UK inflation to top Bank of England&#8217;s 2% target until end of 2024\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-24T09:40:58.000Z",
    "title": "Elon Musk adds Dogecoin symbol to his bio on Twitter",
    "url": "https://crypto.news/elon-musk-adds-dogecoin-symbol-to-his-bio-on-twitter/",
    "description": "As Twitter was rebranded to X on July 24, Elon Musk has surprised the crypto community by adding Dogecoin (DOGE) symbol to his bio. The change came as Twitter&#8217;s iconic logo, a blue bird, changed to X on early July&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-24T09:57:18.000Z",
    "title": "Battle of the Meme coin DigiToads (TOADS) Bullish Surge As Shiba Inu (SHIB) Interest Slows Down",
    "url": "https://www.crypto-news-flash.com/battle-of-the-meme-coin-digitoads-toads-bullish-surge-as-shiba-inu-shib-interest-slows-down/?utm_source=rss&utm_medium=rss&utm_campaign=battle-of-the-meme-coin-digitoads-toads-bullish-surge-as-shiba-inu-shib-interest-slows-down",
    "description": "<img width=\"512\" height=\"313\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T123535.609.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T123535.609.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T123535.609-300x183.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Given their impressive market performance over the past few months, analysts are betting big on meme coins and feel that they are the best cryptocurrency to buy nowadays. Ethereum-based DigiToads (TOADS) is among the recent meme tokens to soar in the crypto market. The crypto project&#8217;s surge has even surpassed that of the popular meme [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-24T09:43:25.000Z",
    "title": "Forget About XRP, Look at This.",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/forget-about-xrp-look-at-this/",
    "description": "<p>Stellar has experienced a surprising surge, becoming a prominent player in the current Ripple-driven crypto market frenzy.  Starting from July 18, XLM&#8217;s price has skyrocketed, leading to a remarkable 68.8% increase over the past week and a 22.1% increase in the last 24 hours. Let&#8217;s understand why Stellar can be a good alternative to XRP. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/forget-about-xrp-look-at-this/\">Forget About XRP, Look at This.</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]