[
  {
    "source": "Decrypt",
    "date": "2023-06-12T12:31:02.000Z",
    "title": "What Is a Decentralized Autonomous Organization (DAO)?",
    "url": "https://decrypt.co/resources/decentralized-autonomous-organization-dao",
    "description": "DAOs use smart contracts and governance tokens to enable participants to make consensus decisions on how the organization's resources are allocated."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-12T12:26:03.000Z",
    "title": "How to Launch a DAO",
    "url": "https://decrypt.co/resources/how-to-launch-decentralized-autonomous-organization-dao",
    "description": "Here's a beginner's guide to the tools and apps you need to start a Decentralized Autonomous Organization."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-12T12:25:35.000Z",
    "title": "Should we fear a deflationary collapse in Bitcoin?",
    "url": "https://cryptoslate.com/insights/should-we-fear-a-deflationary-collapse-in-bitcoin/",
    "description": "<p>Quick Take In a deflationary collapse, a sell-off occurs that first results in leverage being wiped out first before then affecting panic sellers. Bitcoin open interest is minimal, remaining at or below 2% of the market cap since Silicon Valley Bank&#8217;s collapse, while holders remain price agnostic. The current value of the futures open interest [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/should-we-fear-a-deflationary-collapse-in-bitcoin/\">Should we fear a deflationary collapse in Bitcoin?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T12:38:42.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $15.49 with a 24-hour trading volume of $130,897,839. Solana is down 0.26% in the last 24 hours. The current CoinMarketCap ranking is #10, with a live market cap of $1,273,881,101. It has a circulating supply of 394,890,490 SOL coins and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T12:28:09.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T12:26:20.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T12:22:44.000Z",
    "title": "Risky business: Curve founder’s massive deposit in Aave sparks concerns for crypto ecosystem",
    "url": "https://www.cryptopolitan.com/risky-business-curve-founders-massive-deposit-in-aave-sparks-concerns-for-crypto-ecosystem/",
    "description": "In a surprising turn of events, the founder of Curve.fi, a decentralized exchange protocol, has deposited over 33% of Curve&#8217;s circulating CRV tokens into the popular lending platform, Aave. This move has raised eyebrows among industry experts, posing potential risks to Curve&#8217;s ecosystem and Aave. According to reports, the founder took this drastic step after ... <a title=\"Risky business: Curve founder&#8217;s massive deposit in Aave sparks concerns for crypto ecosystem\" class=\"read-more\" href=\"https://www.cryptopolitan.com/risky-business-curve-founders-massive-deposit-in-aave-sparks-concerns-for-crypto-ecosystem/\" aria-label=\"More on Risky business: Curve founder&#8217;s massive deposit in Aave sparks concerns for crypto ecosystem\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-12T12:25:58.000Z",
    "title": "Cardano Price Slumps Further After BTC $25,000 Retest: Can Bulls Charge Back?",
    "url": "https://www.newsbtc.com/news/cardano-price-slumps-further/",
    "description": "Cardano (ADA) has been facing a challenging market environment as the cryptocurrency weakened further amid Bitcoin&#8217;s retest of the $25,000 zone. As one of the top cryptocurrencies in terms of market capitalization, Cardano has been closely impacted by broader market trends.  This setback has raised questions about the future trajectory of Cardano and whether the bulls will be able to regain control. Will the recent market weakness provide an opportunity for the bulls to stage a comeback and propel Cardano toward a new upward trajectory? Bitcoin slightly below the $26K level. Source: Coingecko Cardano Faces Price Volatility As Selling Pressure Persists Cardano (ADA) currently has a price of $0.282786, experiencing a modest 8.1% rally within the past 24 hours, according to CoinGecko data. However, the cryptocurrency has endured a significant decline of 24.3% over the course of the last seven days.  ADA performing poorly on the weekly timeframe. Source: Coingecko This decline follows a retreat from ADA&#8217;s highest price level in 2023, reaching $0.462 in mid-April, before dropping to lows of $0.221 in December. The coin has since managed to partially recover from the losses. The technical indicators for the ADA/USD pair show a significant negative trend developing. The recent breakdown below $0.2779, a critical support level, indicates that further selling pressure is possible. Related Reading: Pepecoin Price Drops, Breaking Key Support Level – Further Downfall Ahead? To analyze the price movement, technical indicators such as the Fibonacci retracement tool and the Relative Strength Index (RSI) provide insights. The Fibonacci retracement tool, plotted between the high point in April and the recent low on June 10, indicates the potential levels for ADA&#8217;s price movement.  Cardano market cap slightly below $10 billion. ADAUSD Chart: TradingView.com Additionally, the RSI has been consistently below the median point since mid-April, further declining into the oversold zone at the time of writing. This indicates a significant increase in selling pressure and suggests a bearish sentiment. ADA Price Outlook Depends On BTC And Market Sentiment The current market conditions for ADA remain uncertain as the cryptocurrency faces selling pressure and price volatility. With increased trading volumes and a decline in price, ADA could potentially be dragged further down to support levels at $0.22 or even $0.164 if the bearish sentiment persists and Bitcoin fails to transition to a bullish trend. Cardano has a 24-hour trading volume of $595 million, placing it seventh on CoinMarketCap. Cardano&#8217;s current market capitalization is $9.3 billion. The circulating supply of this cryptocurrency is 34,903,977,012, while its maximal supply is 45,000,000,000,000,000 ADA coins. Related Reading: BNB Displays Short-Term Bullish Momentum Amidst Massive Binance Outflows Meanwhile, there is a glimmer of hope for ADA bulls if Bitcoin manages to turn bullish, particularly if the Federal Open Market Committee (FOMC) adopts a dovish stance. As the cryptocurrency market continues to be influenced by various factors, including market sentiment, Bitcoin&#8217;s performance, and global economic events, it remains crucial for investors to stay vigilant and monitor the developments closely.  (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from The Coin Republic"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T12:23:31.000Z",
    "title": "Coinbase Seeks Independence from SEC and US, Hong Kong Extends Invitation to Create Crypto Haven, Binance and Ripple Also Welcomed",
    "url": "https://www.crypto-news-flash.com/coinbase-seeks-independence-from-sec-and-us-hong-kong-extends-invitation-to-create-crypto-haven-binance-and-ripple-also-welcomed/?utm_source=rss&utm_medium=rss&utm_campaign=coinbase-seeks-independence-from-sec-and-us-hong-kong-extends-invitation-to-create-crypto-haven-binance-and-ripple-also-welcomed",
    "description": "Hong Kong&#8217;s legislative council extended support to all crypto trading operators, such as Coinbase, to establish a base in the region. Coinbase CEO Brian Armstrong said he expects changes in the US regulatory policies post the 2024 elections, hinting his support for the Republicans. Amid the hostile crypto environment led by the recent crackdown by [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-12T12:28:57.000Z",
    "title": "Macro-Market Structures Need Corrections to Remain Healthy: Youtuber",
    "url": "https://coinedition.com/macro-market-structures-need-corrections-to-remain-healthy-youtuber/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/The-BULL-MARKET-Structure-remains-solid-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/The-BULL-MARKET-Structure-remains-solid-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/The-BULL-MARKET-Structure-remains-solid-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/The-BULL-MARKET-Structure-remains-solid.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a video posted on Youtube, Michael Pizzino, an analyst stated that the bear market is over. He reinforced his arguments based on the macro market structure of cryptocurrency while also taking Bitcoin and some other altcoins into consideration.  Adding more insights into his notion, he stated that people are exiting the market and new [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/macro-market-structures-need-corrections-to-remain-healthy-youtuber/\">Macro-Market Structures Need Corrections to Remain Healthy: Youtuber</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]