[
  {
    "source": "CoinDesk",
    "date": "2023-10-18T13:00:00.000Z",
    "title": "Investment Manager Methodic Unveils Ether Staking Fund Offering Exposure to ETH Price and Yield",
    "url": "https://www.coindesk.com/business/2023/10/18/investment-manager-methodic-unveils-ether-staking-fund-offering-exposure-to-eth-price-and-yield/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Methodic CoinDesk ETH Staking Fund offers institutional exposure to spot ETH price and staking yields."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-18T13:00:00.000Z",
    "title": "Floki Developers Propose Staking and Utility Token Plans",
    "url": "https://www.coindesk.com/tech/2023/10/18/floki-developers-propose-staking-and-utility-token-plans/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The move could help amp up investor interest in FLOKI tokens, which form part of the Floki DAO ecosystem."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-18T12:59:05.000Z",
    "title": "Ether.Fi Rolls Out Liquid Staking Token eETH, That Can be Restaked on EigenLayer",
    "url": "https://www.coindesk.com/business/2023/10/18/etherfi-rolls-out-liquid-staking-token-eeth-that-can-be-restaked-on-eigenlayer/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Decentralized finance (DeFi) protocol ether.fi has rolled out a liquid staking token that allows users to generate rewards through ether (ETH) staking and automatically restake rewards on EigenLayer."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-18T12:57:23.000Z",
    "title": "RareSkills Launches Free Zero-Knowledge Proofs (ZKPs) E-Book",
    "url": "https://decrypt.co/202138/rareskills-launches-free-zero-knowledge-proofs-zkps-e-book",
    "description": "The book is designed to provide programmers with all the information needed to code a prover and verifier from scratch that is usable in modern smart contracts."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-18T13:00:00.000Z",
    "title": "UK tops crypto activity in Central, Northern and Western Europe: Chainalysis",
    "url": "https://cointelegraph.com/news/uk-top-crypto-economy-cnwe-chainalysis",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/a03340ce-ac18-4d00-a255-6424dd3d2c38.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Crypto adoption in the United Kingdom has been growing as the country adopts more regulations targeting crypto and stablecoins, the study shows.</p>\n                    <p><p>The United Kingdom has emerged as a major cryptocurrency economy worldwide and the biggest crypto country in terms of raw transaction volume in Central, Northern and Western Europe (CNWE), according to a new study.</p><p>The blockchain analytics firm Chainalysis on Oct. 18 released two new chapters of its 2023 Geography of Cryptocurrency report, including its brand new CNWE study and the second edition on Eastern Europe.</p><p>According to the CNWE-focused report, the CNWE region was the second-largest crypto economy in the world over the past year, behind only North America. The region accounted for 17.6% of global transaction volume between July 2022 and June 2023, receiving an estimated $1 trillion in on-chain value during the time period.</p><p>The U.K. has topped CNWE’s biggest crypto economies list and also ranked third in the world in terms of transaction volumes after the United States and India. According to Chainalysis, the U.K. received an estimated $252.1 billion in cryptocurrency transactions in the past year.</p><p>Other big crypto economies in the CNWE included Germany and Spain, which received around $120 billion and $110 billion in crypto over the past year, respectively. These countries are followed by major crypto economies like France, Netherlands, Italy, Switzerland, Sweden and others.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/95fdc294-7c01-45bb-98ad-6686fc9dcd63.png\"><figcaption style=\"text-align: center;\"><em>Top countries by cryptocurrency value received between July 2022 and June 2023. Source: Chainalysis</em></figcaption></figure><p>Some crypto analysts have previously hinted at growing crypto adoption in the U.K. before. In February, the crypto tax platform Recap reported that <a href=\"https://cointelegraph.com/news/london-emerges-as-world-s-most-crypto-ready-city-for-business-research\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/london-emerges-as-world-s-most-crypto-ready-city-for-business-research/amp\">London was the world’s most crypto-ready city for business</a>, beating Dubai and New York.</p><p>The significant level of crypto adoption in the U.K. comes amid the country adopting a number of cryptocurrency regulations. The U.K. government has been steadily progressing towards the adoption of the <a href=\"https://cointelegraph.com/news/uk-government-financial-markets-bill-crypto-regulation\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/uk-government-financial-markets-bill-crypto-regulation/amp\">Financial Services and Markets Bill</a>, which adds a definition of crypto assets to the existing financial services legislation while also providing a regulatory framework for stablecoins like Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>).</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-firm-chainalysis-layoff-15-percent-staff-citing-market-conditions\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-firm-chainalysis-layoff-15-percent-staff-citing-market-conditions/amp\"><strong><em>Chainalysis axes another 15% of staff, citing difficult market conditions</em></strong></a></p><p>In October 2023, the U.K. Financial Conduct Authority <a href=\"https://cointelegraph.com/news/binance-okx-comply-crypto-finprom-rules-in-uk\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-okx-comply-crypto-finprom-rules-in-uk/amp\">enforced the Financial Promotions Regime</a>, establishing a regulated standard for crypto firms to promote their business without hurting investors. Previously, the U.K. also adopted the U.K. crypto “Travel Rule” in September 2023, requiring crypto asset businesses in the U.K. to <a href=\"https://cointelegraph.com/news/uk-crypto-travel-rule-comes-into-effect\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/uk-crypto-travel-rule-comes-into-effect/amp\">collect, verify and share certain information</a> about certain crypto asset transfers.</p><p>In addition to the CNWE report, Chainalysis also released a detailed report on Eastern Europe, which is the fourth-largest crypto market, according to the firm. The region received $445 billion in crypto between July 2022 and June 2023, which represents 8.9% of global transaction activity during the analyzed period.</p><p>Chainalysis did not immediately respond to Cointelegraph’s request to tell more about the methodology of its study and what types of crypto transactions were included in the analysis. This article will be updated pending new information.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cuba-bitcoin-revolution-adoption-embargo/\"><strong><em>The Truth Behind Cuba’s Bitcoin Revolution: An on-the-ground report</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-10-18T13:03:42.000Z",
    "title": "Russia bets on crypto adoption as digital assets plan bites the dust",
    "url": "https://crypto.news/russia-bets-on-crypto-adoption-as-digital-assets-plan-bites-the-dust/",
    "description": "Russia&#8217;s Finance Ministry official hopes that liquidity from the crypto market will help the local business to overcome sanctions pressure. Digital financial assets (DFAs), a tokenized form of traditional financial instruments issued by Russian-only companies, appear to have failed to&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-18T13:00:30.000Z",
    "title": "LidoDAO Records Overwhelming 92% Votes To Exit The Solana Network",
    "url": "https://www.newsbtc.com/news/solana/lidodao-92-votes-exit-solana/",
    "description": "In a recently concluded voting program, it was revealed that over 92% of LidoDAO members (Lido token holders) of the decentralized liquid staking protocol Lido Finance, voted in favor of Lido ceasing its operations on the Solana Network. LidoDAO Cut Ties With The Solana Network Following Community Vote The proposal was first introduced by Lido on Solana&#8217;s peer-to-peer (P2P) team on September 5, due to financial limitations. Following the introduction, the voting program began on September 29, 2023, and was concluded a week later on October 6.  Related Reading: Real Reason Behind Ethereum Founder’s Massive ETH ‘Sales’ Exposed The P2P team in charge of the development of Lido on the Solana Network offered the community members two options in the voting program. These included the organization leaving the Solana Network, or providing funds to the organization to sustain its operations on the Solana Network. In the proposal by the P2P team, Lido requested that LidoDAO provide $20,000 per month to fund technical maintenance activities related to sunsetting operations on Solana over the following five months. The proposal also expressed worries about not being able to meet goals in the next year due to the challenging market conditions. “Achieving even 2% of the market share in 2023-2024 seems improbable, particularly in the current Solana market, without any marketing assistance and given Lido DAO’s committee resolution 22 to discontinue all incentives in Solana,” the team’s proposal stated. According to Yuri Mediakov, the P2P team invested a total of $700,000 in Lido on the Solana project to build and support the product in the past year but ended up making $220,000 in revenue, resulting in a net loss of $484,000. Therefore, in order to support the project for the next 12 months, the team would need around $1.5 million. However, at the end of the vote, over 65 million (92.7%) of LDO tokens (voted by token holders) were in favor of sunsetting operations on Solana Network. Meanwhile, 5.1 million (7.2%) of LDO tokens voted in favor of providing funds to the organization to continue its operation on the Solana Network. The total number of Lido (LDO) tokens concluded in the vote was 70.1 million LDO tokens. The organization highlighted in an excerpt that the decision was a necessary one to make despite how difficult it was: Whilst this decision was difficult in the face of numerous strong relationships across the Solana ecosystem, it was deemed a necessity for the continued success of the broader Lido protocol ecosystem. Related Reading: Shiba Inu Whale Moves $32.4 Million In SHIB, Large Sell Incoming? According to LidoDAO, the organization will cease accepting staking requests as of October 16, while users will have to unstake on Solana&#8217;s frontend by February 4, 2024. Failure to unstake before the deadline will result in unstaking through the Command Line Interface (CLI). In addition, Voluntary node operator off-boarding will commence on November 17, 2023. Nonetheless, staked Solana (stSOL) token holders are still expected to receive rewards during the sunsetting process. However, Lido’s staking services are now solely supported on Ethereum and Polygon. The P2P team has been working on Lido’s Solana project since acquiring it from Chorus One in March last year. LDO falls to $1.5 &#124; Source: LDOUSDT on Tradingview.com Featured image from Exodus Wallet, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-18T12:45:02.000Z",
    "title": "Institutional Bullseye: Solana, XRP, and Cardano Emerge as 2023’s Hot Choices",
    "url": "https://www.crypto-news-flash.com/institutional-bullseye-solana-xrp-and-cardano-emerge-as-2023s-hot-choices/?utm_source=rss&utm_medium=rss&utm_campaign=institutional-bullseye-solana-xrp-and-cardano-emerge-as-2023s-hot-choices",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-14.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-14.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-14-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-14-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Solana, XRP, and Cardano are attracting significant institutional investments, overshadowing Ethereum in 2023. XRP maintains a striking 25-week streak of positive inflows, even amidst legal challenges. A Paradigm Shift: Altcoins Take Center Stage Starting the week with a positive uptick, the cryptocurrency market reflects a 2.5% rise in its cumulative value. As Bitcoin and its [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-18T12:57:00.000Z",
    "title": "EU Regulator Warns Crypto Investors of Delayed MiCA Protections",
    "url": "https://coinedition.com/eu-regulator-warns-crypto-investors-of-delayed-mica-protections/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent statement, the European Securities and Markets Authority (ESMA) provided crucial clarifications regarding the timeline for implementing the Markets in Crypto-Assets Regulation (MiCA). The ESMA first highlighted that the impending entry of MiCA represents a significant milestone in developing a unified rulebook for regulating and supervising crypto-asset issuance, trading, and service provision. However, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/eu-regulator-warns-crypto-investors-of-delayed-mica-protections/\">EU Regulator Warns Crypto Investors of Delayed MiCA Protections</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]