[
  {
    "source": "Cointelegraph",
    "date": "2024-02-08T05:45:00.000Z",
    "title": " NBA sued over marketing links with failed crypto lender Voyager Digital ",
    "url": "https://cointelegraph.com/news/nba-sued-promo-links-bankrupt-voyager-digital",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvY2Y1MzYwMTMtNzIxNy00NTkzLWI3NmEtMTg2MWE3OGI0OWFhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A group of disgruntled Voyager investors has sued North America’s top basketball league, alleging it’s implicit and liable for their losses on the failed platform.</p>\n                    <p><p>The National Basketball Association (NBA) is facing a proposed class-action lawsuit over its marketing deals with now-collapsed crypto lender Voyager Digital, which the platform’s users claim led to losses of over $4.2 billion.</p><p>The NBA was “grossly negligent” when it approved Voyager’s promotional deal with the Dallas Mavericks, claimed the over 100-page Feb. 6 suit <a href=\"https://www.courtlistener.com/docket/68229938/1/karnas-v-mccarter-english-llp/\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> in a Miami District Court. The filing details the marketing from the two firms and alleges the NBA was meant to “serve as the ‘gatekeeper.’”</p><p>“This lawsuit simply seeks to hold the NBA liable,” the class group claims. “The NBA’s widespread promotion of Voyager’s unregistered securities renders it liable for any and all resulting damages.” </p><p><a href=\"https://cointelegraph.com/news/nba-sued-promo-links-bankrupt-voyager-digital\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-08T05:40:16.000Z",
    "title": " Deus X, Bridgetower debuts $250M digital asset venture in Middle East ",
    "url": "https://cointelegraph.com/news/deus-x-bridgetower-debuts-250m-digital-asset-venture-middle-east",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNDQwMDdjYzYtOGM0Ni00MWEwLThlZDQtOTExNzFiNThhN2IzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The new entity is aimed at opening the doors for the Middle East’s institutional investors to crypto, staking, and AI. </p>\n                    <p><p>Private equity firms Deus X Capital and Bridgetower Capital are set to launch a new $250 million crypto infrastructure platform, bringing crypto staking, investing, and other digital asset services to institutional investors in the Middle East.</p><p>The new entity, Bridgetower Middle East, will be based in the Abu Dhabi Global Market, a free economic zone within the United Arab Emirates capital, and headed by Deus X and Bridgetower’s respective CEOs, Tim Grant and Cory Pugh, according to a joint statement on Feb. 8.</p><p>Speaking to Cointelegraph, Grant explained that the initiative aims to establish an infrastructure to meet the demand for turnkey staking and AI GPU computing in the Middle East, adding:</p><p><a href=\"https://cointelegraph.com/news/deus-x-bridgetower-debuts-250m-digital-asset-venture-middle-east\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-08T05:48:47.000Z",
    "title": "From Outage To Recovery: Solana Breaches $100 Barrier With Network Restart In Full Swing",
    "url": "https://www.newsbtc.com/news/from-outage-to-recovery-solana-price-bounces-back-with-network-restart-in-full-swing/",
    "description": "Solana, the ambitious blockchain ecosystem, showcased its resilience in the face of adversity, experiencing a significant network outage that temporarily impacted its cryptocurrency value. The recent dip in SOL&#8217;s price, dropping to $93.36 during the outage, highlighted a challenging moment for the blockchain platform. However, the subsequent rapid recovery, with SOL currently trading at $101.80, reflects the network&#8217;s ability to bounce back, marking a notable 6.6% increase in the past 24 hours. Related Reading: Cardano Price Stagnant At $0.48, But Charts Point To Potential Upswing Source: Coingecko Solana: Price Stagnation, Surge, Outage Recovery Amidst weeks of relative price stagnation, where SOL fluctuated between $90 and $99, Solana&#8217;s recent surge contrasts sharply. This period of minimal price change mirrored a cautious sentiment prevailing in the cryptocurrency market, contributing to a 10% correction in Solana&#8217;s value, painting a tentatively bearish picture. The network faced a four-hour and 46-minute outage, causing considerable disruption. Despite the setback, Solana&#8217;s developers swiftly addressed the issue by implementing a new software patch from Solana Labs. The recovery process involved mainnet validators restarting their nodes with the updated software, emphasizing the platform&#8217;s commitment to stability. Block production on Solana mainnet beta resumed at 14:57 UTC, following a successful upgrade to v1.17.20 and a restart of the cluster by validator operators. Engineers will continue to monitor performance as network operations are restored. The outage began at approximately… — Solana Status (@SolanaStatus) February 6, 2024 Though the Solana Foundation has not issued a formal statement regarding the outage&#8217;s cause, a tweet by VanEck&#8217;s Head of Digital Assets Research, Matthew Sigel, suggested a potential bug identified and patched on Solana&#8217;s testnet might be responsible. This tweet gained traction as Solana&#8217;s co-founder, Anatoly Yakovenko, and other notable developers reshared it, underlining its significance. Solana outage, what happened? BPF loader, the “Berkley Packet Filter,” which is the mechanism to deploy upgrade and execute programs on Solana, failed. This seems to relate to a previous SMID (Solana Improvement Proposal) that altered some of the features including the adding a… — matthew sigel, recovering CFA (@matthew_sigel) February 6, 2024 This incident isn&#8217;t the first time Solana faced prolonged network issues; approximately a year ago, a 19-hour blackout occurred after a network upgrade. The Solana Foundation attributed the problem to the extensive use of &#8220;custom block-forwarding software&#8221; by various applications. SOL currently trading at $101.70 on the daily chart: TradingView.com Despite occasional outages, Solana has experienced a surge in activity. Token trading volume on its decentralized exchanges recently surpassed that of Ethereum, signaling growing interest and adoption. The recent network outage may have impacted investor sentiment, but the dynamic nature of the cryptocurrency market means that situations can evolve rapidly. Solana: Price Projections, Stability Concerns Persist Based on the latest price predictions, Solana&#8217;s price is expected to fluctuate between $92 and $119 in February 2024. The price is predicted to rise to $400 in 2025 and reach an all-time high of $445 in 2027. Market analysts and experts predict that Solana is expected to cross a price level of $517 in 2029. However, it is important to note that these predictions are subject to change and may not be entirely accurate. Source: Coincodex Related Reading: Dogecoin Massive Dump: 100 Million DOGE Floods Robinhood, Investors Brace For Price Impact Investors and enthusiasts are closely watching Solana&#8217;s trajectory as it strives to establish itself as a mainstay in blockchain ecosystems. The forthcoming root cause report from the Solana Foundation is eagerly anticipated, offering insights into the outage and potentially addressing concerns about the network&#8217;s stability. As Solana navigates through these challenges, its ability to recover and sustain an upward trajectory will be closely monitored, playing a pivotal role in shaping its future amid the competitive cryptocurrency landscape. Featured image from Adobe Stock, chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-08T05:42:15.000Z",
    "title": "Will Bitcoin (BTC) hit 90k in 2024?",
    "url": "https://coinedition.com/will-bitcoin-btc-hit-90k-in-2024/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/02/PR-78.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/02/PR-78.jpg 730w, https://coinedition.com/wp-content/uploads/2024/02/PR-78-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/02/PR-78-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/02/PR-78-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/02/PR-78-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/02/PR-78-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/02/PR-78-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/02/PR-78-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/02/PR-78-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/02/PR-78-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/02/PR-78-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/02/PR-78-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/02/PR-78-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/02/PR-78-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/02/PR-78-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/02/PR-78-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The world of cryptocurrency is no stranger to the constant debate surrounding Bitcoin&#8217;s future price. Bitcoin, the pioneer of cryptocurrencies, has always managed to maintain its position as the leading digital asset despite its inherent volatility. Recently, Bitcoin&#8217;s price broke above $40,000 back from its retracement, rekindling interest from institutional investors. Standard Chartered Bank&#8217;s Head [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/will-bitcoin-btc-hit-90k-in-2024/\">Will Bitcoin (BTC) hit 90k in 2024?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]