[
  {
    "source": "CoinDesk",
    "date": "2023-08-23T08:57:01.000Z",
    "title": "MoonPay Offers Binance.US a Solution to Crypto Payments Suspension: Bloomberg",
    "url": "https://www.coindesk.com/business/2023/08/23/moonpay-offers-binanceus-a-solution-to-crypto-payments-suspension-bloomberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. exchange's customers now have the option of buying stablecoin USDT using their debit or credit cards, Apple Pay or Google Pay and then converting it into crypto tokens."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-23T09:08:47.000Z",
    "title": "Binance US shifts to ‘crypto-only’ after dropping USD, MoonPay becomes new on-ramp",
    "url": "https://cryptoslate.com/binance-us-shifts-to-crypto-only-after-dropping-usd-moonpay-becomes-new-on-ramp/",
    "description": "<p>Prompted by regulatory pressures, Binance.US is transitioning to a crypto-only exchange, replacing USD with USDT as its base asset. As Binance reported, this move is a strategic response to banking partners suspending USD channels following the Securities and Exchange Commission (SEC) lawsuit. Following the transition, Binance.US has introduced an enhanced Buy &#38; Sell Crypto feature [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-us-shifts-to-crypto-only-after-dropping-usd-moonpay-becomes-new-on-ramp/\">Binance US shifts to &#8216;crypto-only&#8217; after dropping USD, MoonPay becomes new on-ramp</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-23T08:47:38.000Z",
    "title": "\n                        SBF Pleads Not Guilty To New Charges, Complains About Jail Food\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/sbf-pleads-not-guilty-to-new-charges-complains-about-jail-food",
    "description": "\n                        <p dir=\"ltr\">Disgraced FTX founder Sam Bankman-Fried has pleaded not guilty to seven new charges brought against him in a Manhattan federal court on Tuesday.&nbsp;</p>\n<p dir=\"ltr\">The FTX founder was making an appearance in court after spending ten days in jail and also raised complaints about the food being served in jail.&nbsp;</p>\nSBF Pleads Not Guilty To New Fraud And Conspiracy Charges&nbsp;\n<p dir=\"ltr\">The new charges, all related to fraud and conspiracy, were handed down on the 14th of August after prosecutors alleged that Bankman-Fried had used over $100 million of stolen customer funds and assets to donate to electoral candidates and politicians. The court had revoked his earlier bail after the United States Department of Justice alleged that the former CEO had repeatedly tried to influence witnesses and interfere with a fair trial through public shaming and harassment. This was Bankman-Fried&rsquo;s first court appearance since his bail was revoked on the 11th of August. Since then, SBF has been in custody at the Metropolitan Detention Centre in Brooklyn.&nbsp;</p>\n<p dir=\"ltr\">According to data from the Federal Election Commission, Bankman-Fried had reportedly given over $40 million in political donations in 2022. Other big donors from Bankman-Fried&rsquo;s circle included Ryan Salame, former co-CEO, and Nishad Singh, the former director of engineering at FTX. Federal Election Commission data showed that Salame had donated over $23 million almost exclusively to Republican candidates and related PACs. Meanwhile, Nishad Singh had given around $8 million during the 2022 midterm election cycle.&nbsp;</p>\nComplaints About Jail Food&nbsp;\n<p dir=\"ltr\">During his hearing, lawyers representing SBF informed the federal court that jail authorities had failed to provide him with a vegan diet as he had requested. Mark Cohen, the lawyer representing the former billionaire, stated that the lack of adequate food at the Brooklyn Metropolitan Detention Centre was hampering Bankman-Fried&rsquo;s preparations for his trial, which is set to begin in October. Mr. Cohen also told the court that his client was not provided with the attention deficit hyperactive disorder (ADHD) drug Adderall. He also added that his client&rsquo;s supply of Emsam, used to treat depression, was running low.&nbsp;</p>\n<p dir=\"ltr\">Judge Sarah Netburn assured Mr. Cohen that she would ask the United States Justice Department&rsquo;s Bureau of Prisons, which is in charge of running the jail, to address concerns related to SBF&rsquo;s medication. She added that while she was reasonably confident that the prison offered vegetarian food, she was unsure if vegan food was available. Meanwhile, the Bureau of Prisons released a statement saying all inmates had access to appropriate medicines, healthcare, and hot meals. It further added that the facility ensures the provision of nutritionally healthy meals and follows the requirements of a national menu that is analyzed to ensure all dietary requirements are met.&nbsp;</p>\n<p dir=\"ltr\">Following the hearing, Bankman-Fried sought support from his mother, speaking to her at length.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;After the hearing, Bankman-Fried spoke to his mother, Stanford Law School Professor Barbara Fried, across the low partition between the courtroom well and the galley.&rdquo;</p>\n\nPreparations Underway For October Trial&nbsp;\n<p dir=\"ltr\">Meanwhile, Sam Bankman-Fried and his legal team are working hard in preparation for his trial, set to begin in October. Lawyers representing SBF had even requested that he be allowed to stay out of jail on weekdays, arguing that this would allow them to focus on building a defense for the disgraced FTX founder. The judge refused to grant this request.&nbsp;</p>\n<p dir=\"ltr\">However, on the 22nd of August, Bankman-Fried was granted a short release from prison from 8:30 am to 3 pm. During his release, he was present in a supervised courtroom with his lawyers as they prepared for the upcoming trial. Meanwhile, the jury has also been issued guidelines by prosecutors on how to approach the trial. According to the guideline, the jury has to treat each of the seven charges differently. They were also requested not to let their verdict on one charge influence their decision on any of the other six charges.&nbsp;</p>\n<p dir=\"ltr\">FTX was the second-largest cryptocurrency exchange, valued at around $32 billion. However, its bankruptcy sent shockwaves through the crypto and financial world and impacted several projects.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T08:55:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T08:44:00.000Z",
    "title": "FTX and 3AC’s bankruptcy claims contested by BlockFi in ongoing legal drama",
    "url": "https://www.cryptopolitan.com/ftx-and-3acs-bankruptcy-claims-contested-by-blockfi-in-ongoing-legal-drama/",
    "description": "BlockFi, the beleaguered cryptocurrency lender, is pushing back against FTX and Three Arrows Capital (3AC). FTX and 3AC, facing bankruptcy themselves, strive to recover vast sums to satisfy their creditors. However, BlockFi&#8217;s recent court declaration paints a different picture. On Monday, BlockFi asserted its stance as a victim of the FTX platform. They argue that ... <a title=\"FTX and 3AC&#8217;s bankruptcy claims contested by BlockFi in ongoing legal drama\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ftx-and-3acs-bankruptcy-claims-contested-by-blockfi-in-ongoing-legal-drama/\" aria-label=\"More on FTX and 3AC&#8217;s bankruptcy claims contested by BlockFi in ongoing legal drama\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T08:43:06.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T08:50:15.000Z",
    "title": "AVAX Network Activity Down – Will The Planned Token Unlock Bring Back The Energy?",
    "url": "https://www.newsbtc.com/all/avax-network-activity-down-will-the-planned-token-unlock-bring-back-the-energy/",
    "description": "Avalanche (AVAX)  is gearing up for a significant unlock event that has sparked speculation among investors. The past month has witnessed a prevailing bearish sentiment, with volume indicators suggesting that the buying pressure might not be robust enough to counter the crypto&#8217;s prevailing losses.  Despite this recent decline, all eyes are on the impending unlock event, pondering the potential impact it might have on AVAX&#8217;s price trajectory. Scheduled to occur later this week, the unlock event is based on data sourced from Token Unlocks. This data indicates that an impressive 9.54 million AVAX tokens, valued at over $100 million, are set to be unlocked on August 26. Such an event has historically brought about substantial market movements, prompting analysts to closely scrutinize the upcoming developments. Source: Token Unlocks AVAX Price Impact: A Waiting Game However, experts caution against expecting an immediate or substantial price reaction to this unlocking event. Previous instances of similar events have been accompanied by downtrends in AVAX&#8217;s price. In the wake of such trends, there is a possibility that AVAX might breach the psychological support level at $10.  Related Reading: Polygon (MATIC) At June Lows Again – Prospects For Bullish Recovery? A closer examination of the current market data reveals that AVAX is currently priced at $10.24, exhibiting a slight decline of 0.7% according to CoinGecko. Over the span of the past week, the cryptocurrency has undergone a notable seven-day slump of 12.4%, further accentuating the challenges it faces. AVAX price action today. Source: Coingecko A deeper analysis of AVAX&#8217;s price trajectory unveils that the downtrend in its valuation began in July, with the most substantial drop occurring during the course of August. This suggests a cumulative effect of market forces that have impacted the coin&#8217;s value. The looming unlock event introduces an additional layer of complexity to the current market landscape, leaving investors to ponder the potential ramifications. AVAX market cap currently at $3.5 billion. Chart: TradingView.com A Future Uncertain As market participants await the unlock event, the crypto community is divided in its outlook. Some view it as a potential catalyst that could amplify the ongoing bearish trends, while others hold onto the hope that the event might signal a turning point for AVAX&#8217;s fortunes. Related Reading: Shiba Inu Price Challenge: Gunning For $0.00001 After Shibarium Snag Such uncertainty is emblematic of the broader volatility that characterizes the cryptocurrency realm, where events can trigger both rapid appreciation and sudden depreciation. AVAX finds itself in the midst of a challenging period marked by bearish trends and a potential unlocking event. The upcoming release of a substantial number of AVAX tokens introduces an element of suspense as investors wait to see if history will repeat itself with a further dip in price.  (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Toad World Blog"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T09:00:01.000Z",
    "title": "Litecoin Price Prediction: Post-Halving Fallout, $LTC Drops to $80 – Ready for DigiToads Web3 Game Launch?",
    "url": "https://www.crypto-news-flash.com/litecoin-price-prediction-post-halving-fallout-ltc-drops-to-80-ready-for-digitoads-web3-game-launch/?utm_source=rss&utm_medium=rss&utm_campaign=litecoin-price-prediction-post-halving-fallout-ltc-drops-to-80-ready-for-digitoads-web3-game-launch",
    "description": "<img width=\"512\" height=\"269\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-71.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-71.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-71-300x158.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-71-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The third halving of Litecoin, which took place on August 2 2023, has been marked as a significant milestone in the history of Litecoin. As the halving unfolded, the market response was a topic of keen interest. Just after the halving, the price of Litecoin was at $80. Currently, it is trading at $66 reflecting [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-23T09:08:39.000Z",
    "title": "Top 3 Altcoins Under $1 | These Will BLOW UP in Bull Run",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-altcoins-under-1-these-will-blow-up-in-bull-run/",
    "description": "<p>What if I promised you a guaranteed way to find 100x crypto coins in the current market? I would be clearly lying. But what if I tell you I spent hours researching coins under $1? I kept looking for similarities with altcoins that were previously 100xed and their building potential. To finally find 4 coins [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-altcoins-under-1-these-will-blow-up-in-bull-run/\">Top 3 Altcoins Under $1 | These Will BLOW UP in Bull Run</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-23T09:03:00.000Z",
    "title": "SOL Could Sweep Its Lows in the Next Few Days, Predicts Trader",
    "url": "https://coinedition.com/sol-could-sweep-its-lows-in-the-next-few-days-predicts-trader/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/0713.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/0713.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/0713-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/0713-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/0713-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/0713-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/0713-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/0713-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/0713-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/0713-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/0713-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/0713-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/0713-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/0713-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/0713-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/0713-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/0713-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency trader and analyst Benjamin Cowen predicted in a tweet this morning that the price of Solana (SOL) could sweep the lows in the coming few days to set a new price bottom for this bear market. Thereafter, he believes that the altcoin’s price will begin to climb, similar to the price movement seen [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sol-could-sweep-its-lows-in-the-next-few-days-predicts-trader/\">SOL Could Sweep Its Lows in the Next Few Days, Predicts Trader</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-23T09:00:00.000Z",
    "title": "Elevate Blockchain Gaming With Project Seed 2.0: Outland Odyssey, Staking & More!",
    "url": "https://coinedition.com/elevate-blockchain-gaming-with-project-seed-2-0-outland-odyssey-staking-more/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/PR1-3.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/PR1-3.png 730w, https://coinedition.com/wp-content/uploads/2023/08/PR1-3-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/PR1-3-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/PR1-3-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/PR1-3-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/PR1-3-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/PR1-3-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/PR1-3-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/PR1-3-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/PR1-3-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/PR1-3-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/PR1-3-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/PR1-3-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/PR1-3-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/PR1-3-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/PR1-3-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Project SEED, an innovative blockchain gaming ecosystem poised to revolutionize the mobile gaming industry, is set to launch its groundbreaking mobile game ‘Outland Odyssey’ this August, alongside ‘SEED: GROW’ and ‘SEED: Staking’. With an approach that combines blockchain technology, Free-To-Play &#38; Own mechanics, and community-driven governance, Project SEED aims to redefine the gaming landscape going [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/elevate-blockchain-gaming-with-project-seed-2-0-outland-odyssey-staking-more/\">Elevate Blockchain Gaming With Project Seed 2.0: Outland Odyssey, Staking &amp; More!</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]