[
  {
    "source": "CoinDesk",
    "date": "2023-07-24T17:19:44.000Z",
    "title": "Ghost From the Well: Is Crypto Mining With Associated Gas Better for the Environment?",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/24/ghost-from-the-well-is-crypto-mining-with-associated-gas-better-for-the-environment/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Oil and gas companies are keen to use gas that would normally be flared off to run bitcoin mining operations. But environmentalists claim the practice merely perpetuates the use of fossil fuels."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-24T17:18:22.000Z",
    "title": "EU Stablecoin Issuers With Bank Assets in Reserve Will Get Extra Regulation, EBA Draft Says",
    "url": "https://www.coindesk.com/policy/2023/07/24/eu-stablecoin-issuers-with-bank-assets-in-reserve-will-get-extra-regulation-eba-draft-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The EU agency is consulting on new MiCA rules that mean “significant” tokens are centrally supervised with extra capital requirements"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-24T17:30:15.000Z",
    "title": "Innovative Heating Solutions: Bitcoin Miners Turning Heat Into Satoshis",
    "url": "https://news.bitcoin.com/innovative-heating-solutions-bitcoin-miners-turning-heat-into-satoshis/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/hiphop-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Innovative Heating Solutions: Bitcoin Miners Turning Heat Into Satoshis\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/hiphop-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/hiphop-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/hiphop-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/hiphop-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/hiphop-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/hiphop-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/hiphop.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In recent years, bitcoin miners have learned to reuse the heat generated by application-specific integrated circuit (ASIC) mining rigs. Recently, a Twitter account named &#x201C;Rev.Hodl&#x201D; demonstrated how a bitcoin miner was employed to dry laundry. While the clothes dryer serves to dry clean laundry, the machine also compensates the owner in satoshis. Bitcoin Mining&#x2019;s Novel [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T17:17:21.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-24T17:30:42.000Z",
    "title": "Ethereum Whale Transfers To Exchanges Suggest More Selling Pressure For ETH",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-whale-transfers-to-exchanges/",
    "description": "Currently, the crypto market is under fire from bears, and coins like Ethereum (ETH) are already starting to feel the heat. Amid the struggle to recover, there have been massive inflows of ETH into centralized exchanges, which could spell further struggles for the digital asset going forward. Ethereum Whales Move Millions To Centralized Exchanges Multiple reports from the on-chain whale tracking platform Whale Alert have shown that Ethereum whales could be exiting their positions in large volumes. The reports started on Saturday, July 22, when the first transaction was first picked up on the blockchain. Related Reading: Bullish Signal: Whales Accumulate Massive Amounts Of ARB In the first transaction, Whale Alert shows that the whale had moved 15,000 ETH to Gate.io. And at the time, the transaction was worth around $28.28 million. However, this was only the first of many as the whale tracker would go on to report even larger movements to centralized exchanges. The next was a transaction carrying 19,328 ETH worth $36.5 million at the time to Coinbase. Moving forward, the tracker also reported another transaction of 15,000 ETH ($28.1 million) being moved to the Gate.io crypto exchange once more. The fourth transaction was one carrying 19,328 ETH valued at $36.12 million, transferred from another unknown wallet to Coinbase. And last but not least, a large ETH transaction carrying 12,000 ETH ($22.5 million) popped up in the early hours of Monday. ETH price falls following large whale inflows to exchanges &#124; Source: ETHUSD on Tradingview.com What Do These Transactions Mean For ETH? These movements by Ethereum whales could have negative implications for the price of ETH going forward. This is because when crypto investors send coins to exchanges, it is usually because they are looking to sell their coins and take advantage of the deep liquidity that centralized exchanges provide. If this is the case and these whales begin to sell such large amounts of ETH in one go, then it could significantly impact the price of ETH. This could see the altcoin which is already struggling in the market fall even further as the selling pressure climbs. Already, ETH is seeing a decline in its prices, falling toward $1,830 in the early hours of Monday before making a brisk recovery. Such sharp declines could have been triggered by the whales selling, and if there is not enough demand in the market to soak up this new supply, then ETH’s price could return to the low $1,800s once more. Related Reading: Back In The Game: Ripple Joins $54 Million Funding Round For Metaverse Startup For now, the digital asset seems to be holding up against the bears but it has already lost its footing at the $1,850 support. Right now, the next major support lies at $1,800, unless the bulls are able to retain control and reclaim $1,900. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]