[
  {
    "source": "Cointelegraph",
    "date": "2023-07-20T09:51:11.000Z",
    "title": "FedNow Service has no relation with CBDCs, Federal Reserve clarifies",
    "url": "https://cointelegraph.com/news/federal-reserve-service-not-related-to-cbdcs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/538572c7-4480-4db9-be18-b84c9ae50614.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Federal Reserve certified the FedNow Service as “ready,” after it onboarded 41 financial institutions, 15 service providers and the U.S. Department of the Treasury to test out the system, before its launch by the end of July 2023.</p>\n                    <p><p>The Federal Reserve of the United States clarified that its new service for instant payments between organizations — FedNow Service — has no relation with <a href=\"https://cointelegraph.com/learn/what-are-cbdcs-a-beginners-guide-to-central-bank-digital-currencies\">central bank digital currencies (CBDCs)</a>.</p><p>The Federal Reserve certified the FedNow Service as “ready,” after it onboarded 41 financial institutions, 15 service providers and the U.S. Department of the Treasury to test out the system, before its launch by the end of July 2023. However, the central bank had to clarify that the promise of instant fiat payments and real-time gross settlement (RTGS) is not powered by a CBDC.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/FedFAQ?src=hash&amp;ref_src=twsrc%5Etfw\">#FedFAQ</a>: Is the FedNow Service replacing cash? Is it a central bank digital currency?<br><br>Learn more about the <a href=\"https://twitter.com/hashtag/FedNow?src=hash&amp;ref_src=twsrc%5Etfw\">#FedNow</a> Service:<a href=\"https://t.co/ACBjfEhR4A\">https://t.co/ACBjfEhR4A</a>  <a href=\"https://t.co/IXF8dyy46S\">https://t.co/IXF8dyy46S</a> <a href=\"https://t.co/7CUaYZYyM9\">pic.twitter.com/7CUaYZYyM9</a></p>&mdash; Federal Reserve (@federalreserve) <a href=\"https://twitter.com/federalreserve/status/1681714825896787972?ref_src=twsrc%5Etfw\">July 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In a tweet, Federal Reserve stated that FedNow Service is similar to other payment services such as Fedwire and FedACH, which work within the boundaries of the fiat ecosystem. It said:</p><blockquote>“The FedNow Service is not related to a digital currency. The FedNow Service is a payment service the Federal Reserve is making available for banks and credit unions to transfer funds for their customers.”</blockquote><p>The Federal Reserve further confirmed that it has not yet decided on issuing the highly anticipated CBDC and “would only proceed with the issuance of a CBDC with an authorizing law.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/f9af75c8-879a-4fdd-bc4d-adb7290bc6e1.jpg\"  /></figure><p>The table above highlights the initial list of participants. However, the Federal Reserve plans to onboard all 10,000 U.S. financial institutions in time to come.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/major-banks-pass-federal-reserve-stress-test\"><strong><em>Major US banks get passing grade in ‘severe recession’ stress test</em></strong></a></p><p>On May 11, the Federal Reserve announced the integration of Metal Blockchain into the FedNow Service.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/4ce1aa86-cfe0-4441-a914-4a8a2afd9c85.png\"  /><figcaption style=\"text-align: center;\"><em>Metal Blockchain’s listing in the FedNow Service Provider Showcase. Source: FedNow</em></figcaption></figure><p>Metal Blockchain is a crypto network developed by Metallicus, based on a fork of Avalanche's code. According to its documents, the network features a subnet called “X-Chain” that allows developers to enact rules for transferring assets. For example, a token can be issued with the rule that it “can only be sent to US citizens” or “can’t be traded until tomorrow.”</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/tokenizing-music-royalties-nfts-taylor-swift-3lau-nas-the-weeknd/\">Tokenizing music royalties as NFTs could help the next Taylor Swift</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-20T10:00:04.000Z",
    "title": "Bitcoin’s new identity: the evolution into a stablecoin",
    "url": "https://cryptoslate.com/insights/bitcoins-new-identity-the-evolution-into-a-stablecoin/",
    "description": "<p>Quick Take Bitcoin has been behaving much like a stablecoin for the past 30 days, with its price trading around $30,000. This stability comes after a notable rise to $30,000 from $25,000 in mid-June, and it seems that strong consolidation is occurring at the $30,000 level. UTXO Realized Price Distribution (URPD) Analysis The UTXO Realized [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-new-identity-the-evolution-into-a-stablecoin/\">Bitcoin&#8217;s new identity: the evolution into a stablecoin</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-20T09:52:54.000Z",
    "title": "Bitcoin Spot ETFs Could Usher in $30 Billion in Fresh Demand, Says Crypto Trading Firm NYDIG",
    "url": "https://www.cryptoglobe.com/latest/2023/07/bitcoin-spot-etfs-could-usher-in-30-billion-in-fresh-demand-says-crypto-trading-firm-nydig/",
    "description": "In a recent research report, NYDIG, a prominent crypto trading firm, has suggested that the introduction of Bitcoin spot-based exchange-traded funds (ETFs) could potentially generate $30 billion in new demand for Bitcoin, the world’s largest digital asset. CoinDesk reported this information earlier today. NYDIG, a branch of Stone Ridge, is a pioneering holding company with […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-20T10:01:11.000Z",
    "title": "Crypto beats the doldrums and trends higher",
    "url": "https://cryptodaily.co.uk/2023/07/crypto-beats-the-doldrums-and-trends-higher",
    "description": "<p>After hitting the range bottom bitcoin looks to be heading higher once more. Altcoins are following suit.</p>\nBitcoin bounce?\n<p>It is only a week since bitcoin made a new local high for this year and some of the altcoins made some excellent gains from the bottom. A week is a ridiculously short amount of time but it has to be remembered -&nbsp; this is crypto, and large moves up or down can often take place in days, hours, or even minutes.</p>\n<p>Bitcoin did test the nerves at one point though. A wick on the daily time frame took the alpha cryptocurrency down to $29,600 at one point, but this touched a slightly upwards trendline which began on June 22, becoming the third touch of this particular support.</p>\n<p>Now back over $30,000, the bulls are looking to drive bitcoin back to test the $31,000 to $32,000 major resistance once more. In order for the bull market to really be confirmed, this is the equivalent of the Pyrenees mountain range that must be crossed.</p>\nAltcoins bounce better\n<p>With bitcoin taking the initiative again the altcoins have also woken up and some are outdoing bitcoin quite handsomely on the day so far. The Total 3 market cap (total value of all cryptocurrencies after excluding bitcoin and ethereum) has risen $8 billion since Wednesday and is about to test the top of the down channel it has been in since mid-June of 2022.</p>\n<p>A breakout of the channel potentially allows the altcoin market cap to rise to the next resistance at $407 billion, another $47 billion from here. Bitcoin Dominance is a very important factor. This experienced a sharp drop a week ago and has been forming a potential bear flag since then.&nbsp;</p>\nThe dollar continues to show weakness\n<p>USDT Dominance is one more element to the puzzle. USDT fell through the upwards trendline it has been adhering to all the way back to November 2021. It did come back to test the line and make it resistance so it should start to decline from here. Currently at 7.10%, the next support for USDT Dominance is at 6.44%.</p>\n<p>Finally, looking across at traditional markets, the Dollar Index (DXY) has been falling since September last year, as the US stock market heads in the opposite direction. If the DXY confirms 100.2 as resistance, a further decline to 94.5 would be where it will next find support.</p>\n<p>It might seem as though the stars are aligning for bitcoin and the cryptocurrency sector. If the major resistance at $32,000 can finally be broken and bitcoin can hold above, blue skies until $36,000 are beckoning.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T10:00:41.000Z",
    "title": "Google Explores AI Tools to Support Journalists, Engages in Publisher Discussions",
    "url": "https://www.cryptopolitan.com/google-explores-ai-tools-to-journalists/",
    "description": "Google has recently expressed its interest in utilizing artificial intelligence (AI) tools to aid journalists in their work, including the generation of news articles. In discussions with various news organizations, Google aims to collaborate with publishers to explore the integration of these AI tools, as confirmed by a company spokesperson. While the spokesperson did not ... <a title=\"Google Explores AI Tools to Support Journalists, Engages in Publisher Discussions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/google-explores-ai-tools-to-journalists/\" aria-label=\"More on Google Explores AI Tools to Support Journalists, Engages in Publisher Discussions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T09:51:24.000Z",
    "title": "Game of Thrones Fan Uses ChatGPT to End George R.R. Martin’s Book Series",
    "url": "https://www.cryptopolitan.com/game-of-thrones-fan-uses-chatgpt-end-series/",
    "description": "A dedicated Game of Thrones fan, weary of waiting for George R.R. Martin to complete the remaining installments of his A Song of Ice and Fire series, has turned to ChatGPT, an AI-powered language model, to finish the story. Over a decade, HBO&#8217;s Game of Thrones captivated audiences, becoming a cultural phenomenon. However, the TV ... <a title=\"Game of Thrones Fan Uses ChatGPT to End George R.R. Martin&#8217;s Book Series\" class=\"read-more\" href=\"https://www.cryptopolitan.com/game-of-thrones-fan-uses-chatgpt-end-series/\" aria-label=\"More on Game of Thrones Fan Uses ChatGPT to End George R.R. Martin&#8217;s Book Series\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-20T09:46:07.000Z",
    "title": "Shiba inu (SHIB) burn rate soars 393% despite recent drop",
    "url": "https://crypto.news/shiba-inu-shib-burn-rate-soars-393-despite-recent-drop/",
    "description": "Shiba Inu (SHIB) has witnessed a 24-hour surge in its burn rate despite the latest price consolidation plaguing the asset. The asset has continued to trade in a range after the drop below $0.000008.  Shibburn, the unofficial community-driven Shiba Inu&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-20T09:41:25.000Z",
    "title": "Hacker steals 4 MAYC NFTs using less than $15",
    "url": "https://crypto.news/hacker-steals-4-mayc-nfts-using-less-than-15/",
    "description": "While the NFT sales volume shows a downtrend, a hacker called “Fake_Phishing182232” stole four Mutant Ape Yacht Club (MAYC). According to a tweet by the blockchain security and intelligence firm PeckShield, the hacker pocketed the collectibles — MAYC #8265, #6840,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-20T09:50:19.000Z",
    "title": "Solana (SOL) Continues To Shine With Over 20% Surge – What’s Next?",
    "url": "https://www.newsbtc.com/news/solana-sol-smashes-previous-high/",
    "description": "Solana (SOL) offered an attractive chance for buyers to seize a favorable risk-reward ratio as it retraced to test a previous resistance area. At the same time, the market remained under the bulls&#8217; control. Furthermore, the on-chain metrics displayed promising performance. Notably, the number of active users experienced a gradual uptick, and an extraordinary surge in smart contract deployment on the platform was also observed. Could this impressive on-chain performance indicate even more significant potential for Solana in the future? Analyzing SOL&#8217;s Performance According to data from Coingecko, the current trading price of SOL has reached $26.58, marking a 1.0% increase in the past 24 hours. Even more striking is the remarkable seven-day rally, where SOL has surged by an impressive 21.7%. Source: Coingecko These metrics indicate a positive sentiment surrounding the cryptocurrency and suggest potential opportunities for investors and traders. While a slight loss of bullish momentum may have been observed in the lower timeframes, the 1-day chart revealed substantial bullish potential for SOL. A SOL price report suggests that despite minor fluctuations in shorter periods, the overall outlook for SOL remains optimistic, especially considering the strong performance of the bulls throughout July. Strength In Bullish Momentum And Demand Two critical indicators, the Relative Strength Index (RSI) and the On-Balance Volume (OBV), further support the bullish outlook for SOL. The RSI showcased robust bullish momentum, indicating that the buying pressure has been significant during the recent price surge. Related Reading: BNB Chain Unveils Beacon Update – What’s Its Bearing On Price? SOL market cap currently at $10 billion. Chart: TradingView.com Additionally, the uptrend in the OBV signaled a considerable increase in demand for SOL, fueling the impressive rally in its price. Related Reading: XRP Maintains Bullish Run With Nearly 80% Rally – Is $1 Within Reach? With SOL&#8217;s price showing strength and resilience, investors may consider this a positive sign for the cryptocurrency&#8217;s future performance. However, exercising caution and conducting thorough research before making investment decisions is essential, as the crypto market is known for its volatility. Solana&#8217;s New Developer Tool Meanwhile, the Solana blockchain protocol recently announced its latest developer tool, Solang. This innovative tool addresses the fundamental differences between the Solana ecosystem and the Ethereum blockchain network, particularly concerning the programming languages utilized in their designs. 1/ 🎉Introducing Solang: Building on Solana with Solidity Today, @solanalabs announces Solang, a compiler enabling developers to write smart contracts on Solana in Solidity, the primary programming language of Ethereum.https://t.co/X703sAMJBC Learn more👇 — Solana (@solana) July 19, 2023 With Solang, developers can now write Solana programs using the popular Solidity programming language predominantly associated with the Ethereum network. This integration is a direct gateway for launching decentralized applications (dApps) on Solana, providing an excellent opportunity for applications to extend their value beyond their immediate ecosystems. This cross-chain compatibility will likely encourage developers to explore the vast potential of Solana&#8217;s high throughput, low latency, and cost-efficient platform for building sophisticated dApps. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Adobe Stock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T10:08:10.000Z",
    "title": "Innovative Casino Game Providers Worth Your Time",
    "url": "https://www.crypto-news-flash.com/innovative-casino-game-providers-worth-your-time/?utm_source=rss&utm_medium=rss&utm_campaign=innovative-casino-game-providers-worth-your-time",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T110203.735.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T110203.735.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T110203.735-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T110203.735-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The online casino ecosystem has undergone tremendous changes in recent times. The innovation provided by these changes has bridged the gap in the entertainment and technology industry. Game providers have played a significant role in ensuring the new technology developed remains relevant.  They also ensure that the end user derives maximum satisfaction from the experiences [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T09:43:08.000Z",
    "title": "Shiba Inu Ecosystem: Bone and LEASH Skyrocket as SHIB Prepares for Massive Price Move to $0.0001",
    "url": "https://www.crypto-news-flash.com/shiba-inu-ecosystem-bone-and-leash-skyrocket-as-shib-prepares-for-massive-price-move-to-0-0001/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-ecosystem-bone-and-leash-skyrocket-as-shib-prepares-for-massive-price-move-to-0-0001",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T174611.939.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T174611.939.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T174611.939-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T174611.939-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />BONE and LEASH experience significant price surges, with a 5.9% and 5.7% increase, respectively, in the last 24 hours. The spike in value is likely connected to an important announcement for LEASH holders, further fueled by the anticipation of Shiba Inu&#8217;s Shibarium launch. Shiba Inu, a meme coin cryptocurrency, has seen tremendous community interaction and [...]"
  }
]