[
  {
    "source": "Cointelegraph",
    "date": "2024-01-11T05:30:32.000Z",
    "title": " Polymarket punters gambled $12M on the outcome of spot Bitcoin ETFs ",
    "url": "https://cointelegraph.com/news/polymarket-punters-gambled-12m-outcome-of-spot-bitcoin-etfs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYTAyM2I5MzgtZGU0NC00NGE5LWEwMWYtNWU2NDAzZmU0MjAxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Crypto gamblers who bet on \"yes\" for spot Bitcoin ETF approval before Jan. 15 are now counting their winnings, while the losers have been seen quibbling terminology. </p>\n                    <p><p>Over $12 million was placed on a Polygon-based decentralized predictions market to bet on whether the United States would approve a spot Bitcoin exchange-traded fund before mid-January.</p><p>The bets were conducted on Polymarket, a <a href=\"https://cointelegraph.com/explained/prediction-markets-explained\">predictions market</a>, showing a total of $12.6 million in wagers <a href=\"https://polymarket.com/event/bitcoin-etf-approved-by-jan-15?tid=1704949979695\" target=\"_blank\" rel=\"noopener nofollow\">betting</a> either “yes” or “no” to spot Bitcoin ETFs being approved before Jan. 15. </p><p>The bet began in early December and resolved to “yes” as of Jan. 10, when the SEC <a href=\"https://cointelegraph.com/news/sec-spot-bitcoin-etf-approvals\">approved the trading and listing of 11 spot Bitcoin ETFs</a>. </p><p><a href=\"https://cointelegraph.com/news/polymarket-punters-gambled-12m-outcome-of-spot-bitcoin-etfs\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-11T05:28:40.000Z",
    "title": "DOT Price (Polkadot) Pumps 15% As Bulls Aim For Surge To $10",
    "url": "https://www.newsbtc.com/analysis/dot/dot-price-polkadot-pumps-15/",
    "description": "Polkadot (DOT) is gaining pace above the $7.50 resistance against the US Dollar. The price is up nearly 15% and might rise further toward $10.00. DOT is showing heavy bullish signs from the $6.65 support against the US Dollar. The price is trading above the $8.00 zone and the 100 simple moving average (4 hours). There was a break above a key bearish trend line with resistance near $7.80 on the 4-hour chart of the DOT/USD pair (data source from Kraken). The pair could continue to rally unless the bears are able to defend the $8.88 resistance zone. Polkadot Price Restarts Rally After a steady decline, DOT price found support near the $6.65 zone. A low was formed at $6.64 and Polkadot recently started a fresh increase. The price was able to clear the $6.85 and $7.00 resistance levels to move into a positive zone, like Bitcoin and Ethereum. There was a break above a key bearish trend line with resistance near $7.80 on the 4-hour chart of the DOT/USD pair. The pair even surpassed the 50% Fib retracement level of the downward move from the $9.58 swing high to the $6.64 low. DOT is now trading above the $8.00 zone and the 100 simple moving average (4 hours). Immediate resistance is near the $8.45 level. The next major resistance is near $8.88 or the 76.4% Fib retracement level of the downward move from the $9.58 swing high to the $6.64 low. Source: DOTUSD on TradingView.com A successful break above $8.88 could start another strong rally. In the stated case, the price could easily rally toward $9.50 in the near term. The next major resistance is seen near the $10.00 zone. Are Dips Supported in DOT? If DOT price fails to start a fresh increase above $8.45, it could start a fresh decline. The first key support is near the $7.80 level and the same trend line. The next major support is near the $7.50 level, below which the price might decline to $7.00. Any more losses may perhaps open the doors for a move toward the $6.65 support zone. Technical Indicators 4-Hours MACD – The MACD for DOT/USD is now gaining momentum in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for DOT/USD is now above the 50 level. Major Support Levels – $7.80, $7.500 and $7.00. Major Resistance Levels – $8.45, $8.88, and $9.50."
  }
]