[
  {
    "source": "CryptoSlate",
    "date": "2023-06-12T17:35:30.000Z",
    "title": "Bitcoin trades at premium on Binance US as liquidity dries up",
    "url": "https://cryptoslate.com/bitcoin-trades-at-premium-on-binance-us-as-liquidity-dries-up/",
    "description": "<p>Bitcoin (BTC) is trading at a premium of over 1% on Binance.US as the exchange&#8217;s USD trading volume has dropped to new lows after the U.S. SEC&#8217;s lawsuit, according to CryptoCompare data. CryptoCompare data indicates that BTC was trading above $26,000 on Binance.US, surpassing the prices of major rivals like Kraken and Coinbase with over [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-trades-at-premium-on-binance-us-as-liquidity-dries-up/\">Bitcoin trades at premium on Binance US as liquidity dries up</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-12T17:13:46.000Z",
    "title": "Galaxy Digital wins dismissal of BitGo lawsuit, looks to non-US markets amid ‘legislative stalemate’",
    "url": "https://cryptoslate.com/galaxy-digital-wins-dismissal-of-bitgo-lawsuit-looks-to-non-us-markets-amid-legislative-stalemate/",
    "description": "<p>A Delaware court dismissed BitGo&#8217;s lawsuit against Galaxy Digital on June 12 for prematurely backing out of its offer to acquire the former for $1.2 billion. BitGo had argued that the agreement was terminated before it was intended to end and is owed damages under the termination fee clause. However, the court determined that Galaxy [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/galaxy-digital-wins-dismissal-of-bitgo-lawsuit-looks-to-non-us-markets-amid-legislative-stalemate/\">Galaxy Digital wins dismissal of BitGo lawsuit, looks to non-US markets amid &#8216;legislative stalemate&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-12T17:30:29.000Z",
    "title": "Potential Venus Protocol Liquidation Raises Concerns in BNB Community",
    "url": "https://news.bitcoin.com/potential-venus-protocol-liquidation-raises-concerns-in-bnb-community/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/bnb-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/bnb-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bnb-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bnb-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bnb-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bnb-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bnb-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bnb.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Crypto market observers are currently focusing on the Venus Protocol this week as the protocol grapples with a possible liquidation of binance coin (BNB). The hacker who exploited the BNB blockchain managed to secure $150 million in stablecoins through the use of Venus. If the price of BNB slips to $220 per unit, the position [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T17:29:00.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T17:24:31.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T17:10:39.000Z",
    "title": "Crypto giant Galaxy Digital emerges victorious as court dismisses BitGo lawsuit",
    "url": "https://www.cryptopolitan.com/crypto-giant-galaxy-digital-emerges-victorious-as-court-dismisses-bitgo-lawsuit/",
    "description": "In a significant legal development, the Delaware Court of Chancery has ruled in favour of crypto investment firm Galaxy Digital, dismissing the lawsuit filed by digital asset custodian BitGo. The case arose from Galaxy&#8217;s decision to abandon the acquisition of BitGo in 2022, which had been part of a substantial $1.2-billion deal. Vice Chancellor J. ... <a title=\"Crypto giant Galaxy Digital emerges victorious as court dismisses BitGo lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-giant-galaxy-digital-emerges-victorious-as-court-dismisses-bitgo-lawsuit/\" aria-label=\"More on Crypto giant Galaxy Digital emerges victorious as court dismisses BitGo lawsuit\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T17:18:25.000Z",
    "title": "Hong Kong politician extends invitation to Coinbase to operate in the SAR",
    "url": "https://crypto.news/hong-kong-politician-extends-invitation-to-coinbase-to-operate-in-the-sar/",
    "description": "A Hong Kong lawmaker is extending an invitation to Coinbase, despite news of the SEC lawsuit occurring just one week earlier."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-12T17:25:43.000Z",
    "title": "SBI CEO Predicts Massive XRP Price Surge, Expects Ripple Verdict In Few Weeks",
    "url": "https://www.newsbtc.com/analysis/xrp/sbi-predicts-xrp-price-surge-ripple-verdict-in-weeks/",
    "description": "The chairman and CEO of Japanese financial giant SBI Holdings Inc., Yoshitaka Kitao, has made an extremely bullish prediction about the XRP price and Ripple Labs as a company. As is well-known, Kitao is one of Ripple&#8217;s biggest supporters and, remarkably, a former board member of the fintech (replaced by Adam Traidman). In a Japanese speech in front of an audience, Kitao made several statements that are likely to make the XRP community sit up and take notice. According to Kitao, the ongoing legal battle between Ripple Labs and the US Securities and Exchange Commission (SEC) over the classification of XRP as an unregistered security could come to an end as early as the next few weeks. Ripple About To Go Public? In addition, the SBI Holdings CEO stated that he expects XRP prices to rise sharply if the court rules in Ripple&#8217;s favor. He sees this as an event that could increase not only the price of XRP, but also its overall acceptance in the digital finance world, saying (translated from Japanese): If the conclusion is reached and XRP is a coin, I think it will be a very expensive price. Even more surprising to the XRP community, however, may be Kitao&#8217;s statement that he expects Ripple Labs to go public (IPO) as soon as the ruling is handed down by Judge Analisa Torres of the United States Southern District Court of New York. Kitao said: If the conclusion [of the trial] is positive, I think the management will immediately go public. Such a move, according to Kitao, could lead to significant financial benefits for Ripple stakeholders such as SBI Holdings, regardless of whether they decide to sell their XRP holdings or keep them. Related Reading: Former SEC Chairman Deserves Appreciation From Ripple, Alderoty States While the speculation of a Ripple IPO may come as a surprise to many, the rumors are not new. Ripple CEO Brad Garlinghouse said himself during an interview at the World Economic Summit 2020 on the subject of an IPO: &#8220;We won&#8217;t be the first, and we won&#8217;t be the last&#8221;. At the time, the Californian fintech was not yet in litigation with the US Securities and Exchange Commission. Remarkably, back in April 2021, during a presentation of SBI&#8217;s quarterly results, Kitao claimed that the SEC&#8217;s lawsuit was the last hurdle for Ripple before an IPO. XRP Price Ahead Of A Breakout Due To Hinman Docs? Already tomorrow, Tuesday June 13th, the XRP price could experience a major upswing. According to former federal prosecutor James K. Filan, the unsealing of internal SEC Hinman documents in the Ripple case could occur. The Hinman documents may shed light on Ethereum&#8217;s (ETH) previous classification as a non-security and mark a massive partial victory for Ripple. Related Reading: Ripple CEO Blasts SEC Chair For Anti-Innovation Stance, XRP Bulls Remain Optimistic At press time, XRP changed hands for $0.5169, up 2,4% in the last 24 hours. Currently, the most important resistance lies at $0.54. If this resistance is cleared by the XRP bulls, the yearly high of March 29 at $0.5850 could be within reach. Featured image from iStick, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T17:30:12.000Z",
    "title": "Filecoin and AI: The Dynamic Duo for Cost Reduction, Verification, Transparency, and Incentives ",
    "url": "https://www.crypto-news-flash.com/filecoin-and-ai-the-dynamic-duo-for-cost-reduction-verification-transparency-and-incentives/?utm_source=rss&utm_medium=rss&utm_campaign=filecoin-and-ai-the-dynamic-duo-for-cost-reduction-verification-transparency-and-incentives",
    "description": "Artificial intelligence is largely used across different fields but has its challenges. It is believed that blockchain technology offers a solution for this. Artificial Intelligence (AI) is becoming increasingly popular due to its potential to transform various industries including robotics, health, transportation, finance, etc. In a recent article, the biggest decentralized data storage marketplace, protocol, [...]"
  }
]