[
  {
    "source": "Decrypt",
    "date": "2023-07-19T10:24:43.000Z",
    "title": "Genesis Trading Saw 'Uptick' in Altcoin Activity After Ripple SEC Decision",
    "url": "https://decrypt.co/149120/genesis-trading-saw-uptick-in-altcoin-activity-after-ripple-sec-decision",
    "description": "The institutional trading platform’s head of sales explains that the XRP ruling is the latest in a \"series of bullish events\" for crypto. "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T10:24:18.000Z",
    "title": "London’s Argo blockchain secures £5.7 million in funding for expansion",
    "url": "https://www.cryptopolitan.com/londons-argo-blockchain-secures-5-7-million-in-funding-for-expansion/",
    "description": "London-based cryptocurrency mining company, Argo Blockchain (ARB), has successfully raised £5.7 million ($7.5 million) by issuing additional shares. The company, listed on the London Stock Exchange, recently announced its decision to sell shares to raise funds. The public auction yielded £616,000, while the private offering brought a substantial £5.134 million. These funds will be utilized ... <a title=\"London&#8217;s Argo blockchain secures £5.7 million in funding for expansion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/londons-argo-blockchain-secures-5-7-million-in-funding-for-expansion/\" aria-label=\"More on London&#8217;s Argo blockchain secures £5.7 million in funding for expansion\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-19T10:36:44.000Z",
    "title": "Ripple invests in $53m funding round by AI firm Futureverse",
    "url": "https://crypto.news/ripple-invests-in-53m-funding-round-by-ai-firm-futureverse/",
    "description": "Futureverse, a firm leveraging AI and metaverse technology to drive growth in the gaming industry, has completed a $54 million series A funding round."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T10:20:25.000Z",
    "title": "Shiba Inu (SHIB) Prediction: 24% Price Rally Impending By Month End",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-shib-prediction-price-rally-month-end/",
    "description": "The Shiba Inu price has established a promising uptrend in the 1-day chart since June 10, which could catapult the price 24% higher. However, SHIB investors should remain cautious, as NewsBTC reported a few days ago. A downward break of the said uptrend could push the SHIB price back into the longer-term downtrend, which has been in place since early February. A decision is likely to be forthcoming by the end of the month! Shiba Inu Price Prediction From a technical perspective, Shiba Inu has established a new uptrend over the last month which has pushed the price up 29% from the local low at $0.00000597. As can be seen in the 1-day chart, SHIB has so far defended this trend with flying colors. The expectations for the launch of Shibarium at the ETHToronto conference in mid-August could certainly play a role in this. In the meantime, however, SHIB is currently struggling with support at the 20-day EMA line. Over the last two days, SHIB has always managed to close above the support at the end of the trading session. In case the altcoin closes above the technical indicator today as well, the uptrend (black line) would be defended once again. Related Reading: Shiba Inu Encounters Familiar Resistance, Prompting Concerns About Bull Run A new bounce towards the 23.6% Fibonacci retracement level could be possible. So far, SHIB has failed to close above the $0.00000832 resistance on a daily basis in three attempts. But, as explained at the beginning, a decision could be forthcoming by the end of the month. At that time, the resistance line of the 23.6% Fibonacci level and the rising trend line meet. Both lines form an ascending triangle formation, which signals a weakening resistance and an imminent breakout to the upside. The higher lows indicate that bulls are gaining the upper hand in the market. If confirmed, SHIB could rise towards the 200-day exponential moving average (EMA), which currently sits at $0.00000953, close to the psychologically important resistance level of $0.00001. At that point, greater selling pressure should be expected. Based on the current price level, SHIB might have a 24% rally. Related Reading: Shiba Inu (SHIB) Shows Strength With 5% Rally, Reversal Confirmed? If the breakout above the $0.00000832 resistance fails in another attempt, the bulls would have time until around the end of July / beginning of August to validate the ascending triangle formation. Otherwise, a plunge towards support at $0.00007, where the upper line of the longer-term downtrend channel is located, could be imminent. Defending this price level would be crucial. Otherwise, the yearly low at $0.00000597 could be once again on the table. However, with the imminent launch of Shibarium in less than a month, this seems to be the less likely scenario. Disclaimer: The information provided in this article is for informational purposes only and should not be considered as financial or investment advice. Cryptocurrency investments carry inherent risks, and readers are advised to conduct their own research. Featured image from Coin Cloud, chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T10:16:09.000Z",
    "title": "BNB Chain Unveils Beacon Update – What’s Its Bearing On Price?",
    "url": "https://www.newsbtc.com/news/bnb-chain-rolls-out-beacon-update-whats-its-bearing-on-price/",
    "description": "BNB Chain, a distributed blockchain network upon which developers can build decentralized applications (DApps), has taken a remarkable stride forward by introducing updates for its Beacon Chain and the latest layer-2 opBNB.  This announcement has sent waves of anticipation throughout the crypto community, igniting curiosity about the response of the BNB token to this highly positive development.  With the impending launch of the BNB Beacon Chain Mainnet ZhangHeng Upgrade scheduled today (July 19), all eyes are eagerly fixed on the cryptocurrency&#8217;s performance as investors and enthusiasts brace themselves for what lies ahead. BNB Chain Set For Hard Fork Upgrade  BNB Chain is gearing up for an eagerly anticipated hard fork upgrade at block height 328,088,888. This upgrade holds significant potential for the network&#8217;s future growth and development. BNB Chain has partnered strategically with NodeReal, a leading provider of scalable, reliable, and efficient blockchain solutions.  ⚡ BNB CHAIN NEWS: Hackvolution Edition! ⚡ Time to catch-up on everything that happened on our blockchain this past week. Read ahead for the latest updates about: 🔸New projects on BNB Chain 🔸Our brand-new hackathon 🔸Tech and security updateshttps://t.co/yPry7rusXc — BNB Chain (@BNBCHAIN) July 16, 2023 As part of this collaboration, NodeReal&#8217;s platform now grants users access to opBNB&#8217;s explorer, offering enhanced visibility and transparency into the thriving opBNB ecosystem. According to Coingecko, BNB is priced at $241.15. However, recent market fluctuations have resulted in a slight 0.7% decline within the last 24 hours and a modest 2.4% decline over the past seven days.  Related Reading: XRP Flexes Muscles: Ripple Token Unfazed By Crypto Turmoil With 68% Rally Analyzing BNB Chain&#8217;s on-chain metrics indicates a potential continuation of this downward trend. The general mood surrounding BNB has been predominantly negative recently, and the 1-week price volatility has experienced a significant decrease, indicating a bearish market sentiment. Source: Santiment Interestingly, BNB&#8217;s MVRV Ratio has remained relatively stable despite the weakening in price, according to a recent price report. BNB Blockchain Thrives With Impressive Usage Metrics In a positive turn of events, BNB&#8217;s weekly report highlights the blockchain&#8217;s exceptional performance in terms of usage metrics. The blockchain&#8217;s fees remained remarkably low throughout the previous week, providing users with cost-effective transactional experiences. The weekly average users of the platform surpassed an impressive 4-million milestone, reflecting the blockchain&#8217;s popularity and widespread adoption. Moreover, the weekly transactions on BNB exceeded a staggering 22 million, demonstrating the significant activity occurring on the blockchain. BNB market cap currently at $37 billion. Chart: TradingView.com Looking closely at daily metrics, BNB&#8217;s average daily active users surpassed 1 million, indicating a thriving user base actively engaging with the platform&#8217;s offerings daily. Furthermore, the daily transactions soared to an impressive 3.82 million, showcasing the immense transactional volume and the blockchain&#8217;s ability to handle such high throughput. Related Reading: This Under-The-Radar Coin Just Beat The Top 100 Cryptocurrencies With 120% Explosion Source: YCharts Data supporting these impressive usage metrics reveals that BNB&#8217;s Total Value Locked (TVL) has experienced a notable upward momentum over the past few weeks. This surge in TVL further signifies the growing confidence and trust users have in the blockchain ecosystem. These metrics paint a vivid picture of BNB&#8217;s immense usage and adoption, highlighting its position as a prominent blockchain platform catering to a vast and active user base. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from BNB Chain"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-19T10:33:52.000Z",
    "title": "Polygon’s POL: A Game-Changer for Validators, Offering Multiple Chain Validation",
    "url": "https://www.crypto-news-flash.com/polygons-pol-a-game-changer-for-validators-offering-multiple-chain-validation/?utm_source=rss&utm_medium=rss&utm_campaign=polygons-pol-a-game-changer-for-validators-offering-multiple-chain-validation",
    "description": "<img width=\"960\" height=\"540\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-768x432.jpg 768w\" sizes=\"(max-width: 960px) 100vw, 960px\" />Migrating MATIC tokens to POL will involve transferring the MATIC tokens to a specified smart contract. As the initial excitement faded quickly, the number of new addresses joining the Polygon network declined.  Polygon, a layer-2 network constructed upon the Ethereum blockchain, intends to overhaul the tokenomics of its native token, Matic. This move is integral [...]"
  }
]