[
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T16:44:59.000Z",
    "title": " Wemix blockchain to cease block minting rewards ",
    "url": "https://cointelegraph.com/news/wemix-blockchain-cease-block-minting-rewards",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvY2M2N2U5ZjEtODY0My00OGQxLTg5ZWItOTY5MzFkMDkyNTk3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Token rewards will instead be distributed from Wemix Foundation's digital wallets. </p>\n                    <p><p>South Korean gaming blockchain Wemix, with a diluted market cap of $2.6 billion at the time of publication, will discontinue block minting rewards \"to further solidify the fundamentals and practical aspects of WEMIX tokenomics.\"</p><p>According to the Jan. 9 <a href=\"https://www.wemix.com/communication/wemix,-zero-minting-2c58693a149d\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, the total supply of Wemix \"will either remain fixed or be reduced from the block height in which the discontinuation of block minting rewards is implemented\" by the end of Q1 2024. </p><p>Before the announcement, Wemix tokens had an annual inflation rate of 3.15%. Wemix developers say they are committed to \"achieving a deflationary economy\" through the removal of block minting rewards and the token burn of gas fees used on the network. </p><p><a href=\"https://cointelegraph.com/news/wemix-blockchain-cease-block-minting-rewards\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-09T16:58:29.000Z",
    "title": "Bearish Trend for Ethereum (ETH) and Stellar (XLM) as Everlodge (ELDG) Gathers Massive Presale Momentum",
    "url": "https://cryptodaily.co.uk/2024/01/bearish-trend-for-ethereum-eth-and-stellar-xlm-as-everlodge-eldg-gathers-massive-presale-momentum",
    "description": "The recent crypto market downturn has led to various speculations on the future of some cryptos. Some of these tokens, such as Ethereum (ETH) and Stellar (XLM)"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-09T17:00:59.000Z",
    "title": "Less Than 15,000 Blocks to Halving: ETF Hopes and Ordinal Inscriptions Serve as Life Preserver for Bitcoin Miners",
    "url": "https://news.bitcoin.com/less-than-15000-blocks-to-halving-etf-hopes-and-ordinal-inscriptions-serve-as-life-preserver-for-bitcoin-miners/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />As of Jan. 9, 2024, fewer than 15,000 blocks remain before the fourth Bitcoin halving event. This milestone will halve the block reward from 6.25 to 3.125 bitcoins per block. Expected to occur in April 2024, this event will render bitcoin increasingly scarce. However, it may exert considerable pressure on miners, seeing their earnings cut [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T17:06:02.000Z",
    "title": "SKALE Price Prediction 2024-2033: How high can SKL get?",
    "url": "https://www.cryptopolitan.com/skale-price-prediction/",
    "description": "SKALE Price Prediction 2024-2033 Skale aims to solve the major blockchain issues, and the new developments look promising. This SKALE Price Prediction will help you trace the price movement of SKL for possible inclusion in your portfolio. How much is SKALE worth? The current price of SKALE is $0.07923 (at press time) with a 24-hour [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T16:57:27.000Z",
    "title": "BitLicense Oversight Under Scrutiny in New York: A Deep Dive into the Comptroller’s Concerns",
    "url": "https://www.cryptopolitan.com/bitlicense-oversight-new-york-comptrollers/",
    "description": "In the dynamic world of digital currencies, regulatory oversight is a key factor in maintaining market integrity and consumer protection. New York, a frontrunner in cryptocurrency regulation, introduced the BitLicense framework in 2015.&#160; It was a pioneering step by the New York Department of Financial Services (NYDFS) to regulate firms dealing in digital currencies. However, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-09T17:02:14.000Z",
    "title": "Shitcoin aims to promote crypto resilience, hope, and community",
    "url": "https://crypto.news/shitcoin-aims-to-promote-crypto-resilience-hope-and-community/",
    "description": "Shitcoin draws its strength from the real-life narrative of its enigmatic creator, Hiroshi Nakamoto "
  },
  {
    "source": "BTCManager",
    "date": "2024-01-09T16:53:07.000Z",
    "title": "Solana upswing still expected, according to analyst",
    "url": "https://crypto.news/solana-upswing-still-expected-according-to-analyst/",
    "description": "Market analyst More Crypto Online shares that despite Solana seeing some red on Jan. 9, wave five is still on the table."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-09T16:43:52.000Z",
    "title": "Solana ecosystem sees surge in developer retention and global growth",
    "url": "https://crypto.news/solana-ecosystem-sees-surge-in-developer-retention-and-global-growth/",
    "description": "Solana's developer retention soared to 50%, with global expansion, diverse hackathon participation, and SOL's impressive 1,000% gain marking 2023."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-09T16:42:48.000Z",
    "title": "XRP price might hit $0.6 as Grayscale makes bullish $10m move",
    "url": "https://crypto.news/forecast-xrp-price-up-as-grayscale-makes-bullish-move/",
    "description": "Ripple (XRP) price looks set for bullish price action as whale investors react positively to a crucial announcement from Grayscale.&#160; On Jan. 5, Grayscale announced that it had re-added XRP to its Digital Large Cap (GDLC) index fund after a&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-09T17:00:19.000Z",
    "title": "Cardano’s 2024 Rollercoaster: Price Plunges 18% Despite 250% Surge In Development Activity",
    "url": "https://www.newsbtc.com/news/cardanos-2024-rollercoaster-price-plunges-18-despite-250-surge-in-development-activity/",
    "description": "Cardano (ADA) closed out 2023 with a rollercoaster ride, soaring towards $0.70 before plummeting back to $0.52 by the new year. While this sharp correction was anticipated, concerns linger about an ongoing bearish sentiment despite room for growth. Recovery won&#8217;t be a walk in the park. Currently trading at $0.52, Cardano faces an uphill battle. However, glimmers of hope remain. Cardano (ADA): Resilient Support Amid Development Notably, ADA hasn&#8217;t breached the crucial support level of the 200-day EMA, suggesting an underlying bullish bias for the long-term trend that began in mid-October. Related Reading: Maker Takes The Spotlight With 34% Gain – Can MKR Hold This Position? This technical indicator points towards potential for a rebound, although sustained upward momentum will require additional catalysts. Cardano&#8217;s 2024 started with a development bang, not a price boom. Development activity surged 250% in 30 days, showcasing a vibrant ecosystem buzzing with innovation. Cardano Surges Nearly 250% In Development Activity, Whale Buying Appetite – Details &#124; Crypto Breaking News #Cardano #cardanofeed #trading #ADA #crypto #CardanoCommunity #bitcoin #blockchain @otaviolima #cryptocurrency #CardanoADA #btc $ADA https://t.co/tiJaI73LeQ — Cardano Feed ($ADA) (@CardanoFeed) January 6, 2024 Unfortunately, this internal optimism hasn&#8217;t translated to external cheer. The bears remain firmly in control, driving ADA&#8217;s price down 18% in a week and 10% in 24 hours. At $0.52, ADA currently ranks 8th by market cap, but its chart is decidedly red. This disconnect between bustling development and bearish price action highlights the complex cocktail of factors influencing cryptocurrency markets. While a thriving ecosystem bodes well for the future, short-term sentiment reigns supreme, swayed by news, speculation, and overall market trends. ADA market cap currently at $18.47 billion. Chart: TradingView.com On the fundamental side, Cardano&#8217;s ecosystem continues to flourish. The recent Vasil hard fork and growing DeFi activity inject optimism, but external factors like broader market sentiment and regulatory uncertainties could throw wrenches in the recovery gears. Cardano&#8217;s Outlook: Navigating Uncertainty For Growth Cardano&#8217;s near-term outlook remains somewhat cloudy. While the recent dip was expected, complete bearish dominance seems unlikely. Technical indicators hint at a potential uptrend, but navigating choppy waters will require a confluence of positive catalysts and a watchful eye on the broader market. Related Reading: Polygon NFTs Explode: 6-Month High Volume Ignites Market – Details So, what&#8217;s next for Cardano? The recent development surge suggests a project on the move, but overcoming bear dominance requires more than just internal progress. Catalysts like positive news events or broader market recovery could be the wind beneath ADA&#8217;s wings. For now, investors face a classic crypto conundrum: weigh long-term potential against the immediate sting of a bearish market. Cardano finds itself at a crossroads in the early days of 2024, with the clash between internal development strides and external market dynamics shaping its narrative. Despite a remarkable surge in development activity, ADA&#8217;s price has faced a significant downturn, reflecting the intricate dance between optimism and market sentiment. Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-09T17:00:04.000Z",
    "title": "Ripple and XRP Dominate the Charts: Surpasses Bitcoin in Trading Volume on HTX",
    "url": "https://www.crypto-news-flash.com/ripple-and-xrp-dominate-the-charts-surpasses-bitcoin-in-trading-volume-on-htx/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-and-xrp-dominate-the-charts-surpasses-bitcoin-in-trading-volume-on-htx",
    "description": "<img width=\"1800\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/XRP-Ripple-coin-on-mobile.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP-Ripple-coin-on-mobile\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/XRP-Ripple-coin-on-mobile.jpg 1800w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/XRP-Ripple-coin-on-mobile-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/XRP-Ripple-coin-on-mobile-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/XRP-Ripple-coin-on-mobile-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/XRP-Ripple-coin-on-mobile-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/XRP-Ripple-coin-on-mobile-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/XRP-Ripple-coin-on-mobile-450x300.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/XRP-Ripple-coin-on-mobile-1200x800.jpg 1200w\" sizes=\"(max-width: 1800px) 100vw, 1800px\" />Seychelles-based cryptocurrency exchange has revealed a staggering achievement attained by XRP. The asset raked in $112 million in trading volume; the highest trading volume recorded on the 7th of January. A new development has been released and XRP is making its mark in different aspects of the cryptocurrency market. Per a recent announcement from HTX [...]"
  }
]