[
  {
    "source": "Cointelegraph",
    "date": "2023-06-22T22:53:49.000Z",
    "title": "Prime Trust's financials 'considerably deteriorated,' says Nevada regulator",
    "url": "https://cointelegraph.com/news/prime-trust-financial-condition-deteriorated-nevada-regulator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a9cfc1e7-1ef4-444a-a516-43abda0e35f9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Nevada's business regulator issued a cease and desist order to the crypto custodian alleging it has a \"shortfall of customer funds.\" </p>\n                    <p><p>Prime Trust's financial condition is \"critically deficient\" and the crypto custodian is unable to honor customer withdrawals according to a cease and desist from Nevada's business regulator.</p><p>In a June 21 <a href=\"https://fid.nv.gov/uploadedFiles/fidnvgov/content/Opinion/Prime%20Trust%20-%20C%20and%20D%206.21.23.pdf\" target=\"_blank\" rel=\"noopener nofollow\">order</a>, the Nevada, Department of Business and Industry claimed Prime Trust's financial condition \"considerably deteriorated\" and the firm is now in an \"unsafe or unsound condition\" to continue business:</p><blockquote>\"On or about June 21, 2023, Respondent's [Prime Trust] was unable to honor customer withdrawals due to a shortfall of customer funds caused by a significant liability on the Respondent's balance sheet owed to customers.\"</blockquote><p>The order added Prime Trust has \"materially and willfully breached its fiduciary duties to its customers by failing to safeguard assets under its custody.\" The regulator again alleged the firm is \"unable to meet all customer disbursement requests.\"</p><p>Prime Trust has 30 days to respond to the cease and desist order and can request an administrative hearing to contest the order.</p><p>If Prime Trust fails to contest, the cease and desist order will be considered final.</p><p>On June 13, the payments subsidiary of Prime Trust, Banq, <a href=\"https://cointelegraph.com/news/prime-trust-subsidiary-banq-bankruptcy-filing-amid-bitgo-deal\">filed for bankruptcy protection </a>in the United States.</p><p>Since then, wallet infrastructure provider and digital asset custodian BitGo confirmed on June 22 that it <a href=\"https://cointelegraph.com/news/bitgo-terminates-acquisition-prime-trust\">decided to cancel its acquisition of Prime Trust.</a></p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-22T22:57:20.000Z",
    "title": "Binance.US resolves delayed USD withdrawals; expects banking partners to halt option again",
    "url": "https://cryptoslate.com/binance-us-resolves-delayed-usd-withdrawals-expects-banking-partners-to-halt-option-again/",
    "description": "<p>Binance.US said in an email sent to customers on June 22 that it resolved nearly all delayed U.S. dollar withdrawals. Warning of further limitations Binance.US said it worked with its banking partners to re-enable USD withdrawals but also suggested the option will soon be removed again. The company wrote: &#8220;While USD withdrawal remains fully operational [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-us-resolves-delayed-usd-withdrawals-expects-banking-partners-to-halt-option-again/\">Binance.US resolves delayed USD withdrawals; expects banking partners to halt option again</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T22:54:19.000Z",
    "title": "Unlock Your Profit Potential with the Best AI Crypto Trading Bots",
    "url": "https://www.cryptopolitan.com/best-ai-crypto-trading-bots/",
    "description": "In the rapidly evolving digital world, artificial intelligence (AI) has penetrated many sectors, and the realm of cryptocurrency is no exception. Harnessing the power of AI, a new breed of sophisticated crypto trading bots has emerged, offering unprecedented profit potential to both novice and experienced traders.&#160; These bots not only automate the trading process but ... <a title=\"Unlock Your Profit Potential with the Best AI Crypto Trading Bots\" class=\"read-more\" href=\"https://www.cryptopolitan.com/best-ai-crypto-trading-bots/\" aria-label=\"More on Unlock Your Profit Potential with the Best AI Crypto Trading Bots\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T22:40:19.000Z",
    "title": "TrueUSD reassures users of no exposure to Prime Trust amid regulatory challenges",
    "url": "https://www.cryptopolitan.com/trueusd-reassures-users-of-no-exposure-to-prime-trust-amid-regulatory-challenges/",
    "description": "TrueUSD has swiftly moved to restore confidence in its dollar-backed TUSD stablecoin after Nevada-based Prime Trust, a crucial technology partner, faced regulatory hurdles. Prime Trust&#8217;s abrupt suspension of all fiat and cryptocurrency deposits and withdrawals, following state financial regulators&#8217; orders, left many clients stranded and concerned about their funds. In response to the situation, TrueUSD ... <a title=\"TrueUSD reassures users of no exposure to Prime Trust amid regulatory challenges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/trueusd-reassures-users-of-no-exposure-to-prime-trust-amid-regulatory-challenges/\" aria-label=\"More on TrueUSD reassures users of no exposure to Prime Trust amid regulatory challenges\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-22T23:00:28.000Z",
    "title": "Trading Guru John Bollinger Unveils Unparalleled Insights On Bitcoin Spike ",
    "url": "https://www.newsbtc.com/bitcoin-news/trading-guru-john-bollinger-unveils-unparalleled-insights-on-bitcoin-spike/",
    "description": "Bitcoin, the cryptocurrency boasting the highest global market capitalization, has experienced an unexpected and significant surge, surpassing the crucial $30,000 threshold for the first time since April 19. This remarkable upswing has managed to captivate the attention of the esteemed trader, John Bollinger, who graciously shared his astute insights regarding Bitcoin&#8217;s current momentum. In his commentary, Bollinger observed, &#8220;The first pattern failed, but the second one didn&#8217;t.&#8221; This noteworthy assessment hints at the possibility of Bitcoin&#8217;s continued upward movement, emphasizing the potential for the cryptocurrency to sustain its positive trajectory. Dave the Wave contributed to the ongoing discussion surrounding the volatility of the stock. In a tweet, he provided a comprehensive analysis of Bitcoin&#8217;s monthly moving average convergence divergence (MACD), highlighting a bullish recross that hadn&#8217;t occurred in almost two years. Related Reading: Bitcoin Experts Predict “Great Accumulation Race”, What It Means Despite the complexity of these patterns, Dave the Wave&#8217;s research agrees with Bollinger&#8217;s forecast, pointing to the possibility of more cryptocurrency rise. Institutional Interest And Expert Analyses On Bitcoin Significant developments have been observed within the realm of cryptocurrency investments. Notably, industry giants BlackRock and Invesco have taken steps toward Bitcoin adoption by filing exchange-traded fund (ETF) applications. Related Reading: Bitcoin: Experts Point Out Key Differences Between BlackRock And Grayscale Bitcoin Trusts Of particular interest is BlackRock&#8217;s recent filing, which could potentially pave the way for the first-ever spot Bitcoin ETF in the United States. The convergence of optimistic analyses from respected market experts like Bollinger and Dave the Wave, alongside the increasing institutional interest in Bitcoin ETFs, paints a promising picture for the future of Bitcoin. The unfolding events in the forthcoming months will shed light on whether these indicators will lead to a sustained bullish trend for cryptocurrency. BTC&#8217;s Unusual Price Movement Yesterday, Bitcoin experienced a momentary surge, reaching as high as $138,000 on the BTC/Tether trading pair, according to data from Binance.US, a prominent cryptocurrency exchange. BTC falls to $29,800 &#124; Source: Binance TradingView At 6:50 a.m. UTC, prices abruptly skyrocketed to those extraordinary levels but swiftly reverted to align with the prevailing rates observed on other BTC spot markets. Interestingly, the surge was limited to the BTC/Tether pair, while other BTC trading pairs remained unaffected and traded normally. It is highly improbable that the anomalous price spike was driven by a deliberate intention from a trader to purchase Bitcoin at an exorbitant premium of nearly 450%. Presently, Bitcoin is trading at just north of $29,000 during the European morning hours on Wednesday. Featured image from iStock, charts from TradingView.com"
  }
]