[
  {
    "source": "Decrypt",
    "date": "2023-10-07T13:01:02.000Z",
    "title": "Difference in Bull and Bear Crypto Market Gains Is Negligible, Say Analysts",
    "url": "https://decrypt.co/200463/difference-in-bull-and-bear-crypto-market-gains-is-negligible-say-analysts",
    "description": "Data shows that the differences between buying Bitcoin and Ethereum in bull or bear markets is negligible."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-07T13:00:56.000Z",
    "title": "Avalanche-Based Stars Arena Falls Victim To A $3 Million Exploit, TVL Tanks By 100%",
    "url": "https://www.newsbtc.com/news/defi/avalanche-based-stars-arena-falls-victim-to-a-3-million-exploit-tvl-tanks-by-100/",
    "description": "Stars Arena, a decentralized social media platform built on the Avalanche network, has suffered a major security breach, resulting in the loss of a significant amount of cryptocurrency. This comes barely a day after the decentralized application (dApp) reportedly fixed a loophole in its smart contract. On Thursday, October 5, the Stars Arena team said &#8211; via a post on X (formerly Twitter) &#8211; that it has averted a security exploit, which could have led to the loss of over $1 million worth of funds.  Stars Arena Loses $2.9 Million To Attack, PeckShield Reveals On Saturday, October 7, a pseudonymous X user raised the alarm about the suspicious movement of Avalanche (AVAX) tokens from the Stars Arena contract.  A few minutes after this, the protocol’s team confirmed &#8211; via a post on X &#8211; that there has been a “major security breach with its smart contract.”  Related Reading: Celsius Commits To Massive Crypto Repayment: $2 Billion To Creditors By 2023’s End This exploit has also been flagged by blockchain security firm PeckShield, who disclosed that around $2.9 million in AVAX has been drained from the decentralized social media application.  An initial breakdown by the security company identified a reentrancy issue on the Stars Arena Shares contract. “The reentrancy is abused to update the weight when the share/ticket is issued so that 1 share can be sold at a much higher price of approximately 274,000 AVAX,” PeckShield said. As earlier noted, Stars Arena has been gaining some popularity in the past few days. In fact, the recent activity uptick on the Avalanche network has been attributed to the rise of the decentralized social application. However, this latest hack represents a significant deterrent to Stars Arena’s growth. According to data from DeFiLlama, the protocol’s total value locked has plummeted from $1.26 million to $0.47 in the past day, reflecting a 100% decline. Stars Arena went live on Avalanche C-Chain &#8211; the blockchain component specifically designed for running smart contracts on Avalanche &#8211; in late September. Although the Friend.tech-like platform experienced some traction after launch, recent security concerns seem to be stirring skepticism around its growth. $900 Million Lost To Bad Actors In 2023 Q3 This latest exploit will serve as an unfriendly reminder of the growing security concerns in the crypto space. Particularly, the cryptocurrency industry saw a significant surge in exploits and security breaches in the third quarter of 2023. According to a quarterly report by blockchain security firm Beosin, the losses incurred only in Q3 2023 were larger than the total for the year&#8217;s first half. A total of $889.26 million was lost to various attacks in the last quarter, compared to the $663 million lost in 2023’s first six months. Related Reading: Twitter IPO: Dogecoin Takes Center Stage In Elon Musk’s X IPO Rumors Source: Beosin/X Beosin’s report revealed that $540.1 million was lost to hacks, with decentralized finance (DeFi) accounting for 18% of this value. Notably, DeFi peer-to-peer service Mixin Network lost $200 million due to a compromise in its cloud service provider database. AVAX price facing resistance at $11 on the daily timeframe &#124; Source: AVAXUSDT chart on TradingView Featured image from Shutterstock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-07T13:02:49.000Z",
    "title": "Central Banks Create CBDCs to Improve Tax Collection – Leading to the Surge in Privacy Coins Monero, Dash, and ZCash",
    "url": "https://www.crypto-news-flash.com/central-banks-create-cbdcs-to-improve-tax-collection-leading-to-the-surge-in-privacy-coins-monero-dash-and-zcash/?utm_source=rss&utm_medium=rss&utm_campaign=central-banks-create-cbdcs-to-improve-tax-collection-leading-to-the-surge-in-privacy-coins-monero-dash-and-zcash",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/banknotes-3125605_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/banknotes-3125605_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/banknotes-3125605_1920-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/banknotes-3125605_1920-1024x576.jpg 1024w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Argentina&#8217;s Central Bank has doubled down on its CBDC solution, the Digital Peso. Despite the growing push toward CBDCs, consumers are still embracing privacy coins enmasse. The Central Bank of Argentina, Banco Central de la República Argentina, (BCRA) has taken a significant stride in the digital finance world by introducing its Central Bank Digital Currencies (CBDCs) [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-07T13:00:40.000Z",
    "title": "New Gem Project’s Incredible Innovation Poised to Displace Shiba Inu’s Concept",
    "url": "https://www.crypto-news-flash.com/new-gem-projects-incredible-innovation-poised-to-displace-shiba-inus-concept/?utm_source=rss&utm_medium=rss&utm_campaign=new-gem-projects-incredible-innovation-poised-to-displace-shiba-inus-concept",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-26.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-26.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-26-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Investors are looking for the best crypto to buy now, and industry watchers suggest the incredible innovation brought by a new gem known as Bitcoin Spark is poised to displace Shiba Inu&#8217;s concept and potentially lead to massive profits. Shibarium Shiba Inu (SHIB) was originally created as a meme coin in August 2020. However, its [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-07T13:00:05.000Z",
    "title": "Crypto Crossroads: $400M in Bitcoin Options on the Line Today – Will It Make or Break the Rally?",
    "url": "https://www.crypto-news-flash.com/crypto-crossroads-400m-in-bitcoin-options-on-the-line-today-will-it-make-or-break-the-rally/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-crossroads-400m-in-bitcoin-options-on-the-line-today-will-it-make-or-break-the-rally",
    "description": "<img width=\"1280\" height=\"848\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/bitcoin-3890350_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"JpMorgan\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/bitcoin-3890350_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/bitcoin-3890350_1280-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/bitcoin-3890350_1280-1024x678.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/bitcoin-3890350_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The high Bitcoin option expiration on Friday is expected to increase the overall volatility as investors re-adjust their portfolios in line with the October bullish narrative. More Bitcoin Option traders have set call bets with a high rate of expiration amounting to about 22.9 percent at the end of October. The crypto market could experience [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-07T12:48:28.000Z",
    "title": "Crypto Rollercoaster: Bitcoin’s Risky Ride and Ether ETF Disappointment",
    "url": "https://www.crypto-news-flash.com/crypto-rollercoaster-bitcoins-risky-ride-and-ether-etf-disappointment/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-rollercoaster-bitcoins-risky-ride-and-ether-etf-disappointment",
    "description": "Analyst predicts tough times for Bitcoin in the near term, while ETH ETF underperformance plagues crypto’s price.  Bitcoin, Ether, and other altcoins struggle to remain afloat as bearish pressure intensifies in the cryptocurrency market.  The leading cryptocurrency by market cap might follow a downward trend for a brief previous amidst market woes. Meanwhile, the recently [...]"
  }
]