[
  {
    "source": "CoinDesk",
    "date": "2023-06-09T08:51:57.000Z",
    "title": "Cardano Developer Rejects SEC Claim Its ADA Token Is a Security",
    "url": "https://www.coindesk.com/policy/2023/06/09/cardano-developer-rejects-sec-claim-its-ada-token-is-a-security/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "“Under no circumstances is ADA a security under U.S. securities laws,” IOG said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-09T09:02:17.000Z",
    "title": "‘Already explored’ — Apple Vision Pro unable to impress Mark Zuckerberg ",
    "url": "https://cointelegraph.com/news/already-explored-apple-vision-pro-unable-to-impress-mark-zuckerberg",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/dcb053d0-2474-4ec0-8eea-43b27ca29227.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Zuckerberg highlighted divergent philosophies, with Meta emphasizing a social metaverse while Apple's device seemed designed for solitary use.</p>\n                    <p><p>As Meta strives to lead in <a href=\"https://cointelegraph.com/learn/augmented-reality-vs-virtual-reality-key-differences\">virtual and augmented reality (VR/AR)</a>, Apple's recent entry into the market has generated curiosity and apprehension. With the official release of Vision Pro, speculations arise about Mark Zuckerberg's viewpoint as Meta CEO on the competition posed by Apple's VR headset.</p><p>During an all-hands meeting observed by The Verge, Zuckerberg discussed his response to the technical features of Vision Pro. Expressing his curiosity about Apple's offering, Zuckerberg acknowledged that he had yet to experience the Vision Pro firsthand. He revealed that Meta's teams had “already explored” and contemplated the constraints posed by laws and physics, implying that Apple's solutions were not entirely groundbreaking. </p><p>He mentioned that the pricing of the headset was a result of a deliberate \"design trade-off\" aimed at emphasizing more expensive technology and demanding increased computational capabilities. Zuckerberg noted that Apple opted for a higher resolution display, leading to a sevenfold increase in costs and energy consumption, ultimately necessitating the use of a wired connection and battery. </p><p>Expanding on his remarks, the Meta CEO delved into the divergent philosophical outlooks embraced by Apple and Meta, emphasizing the differences in their values and overarching goals. During this discussion, Zuckerberg naturally explored the <a href=\"https://cointelegraph.com/news/an-overview-of-the-metaverse-in-2022#:~:text=The%20metaverse%2C%20first%20coined%20by,incorporates%20different%20concepts%20and%20technologies.\">concept of the metaverse</a>, which notably <a href=\"https://cointelegraph.com/news/apple-vision-pro-headset-wwdc-no-mention-metaverse\">did not receive any mention</a> during the WWDC keynote presentation.</p><p>Zuckerberg stated:</p><blockquote>\"Our vision for the metaverse and presence is fundamentally social. Our device also encourages active engagement and participation. In contrast, every demo they showcased featured an individual sitting alone on a couch.\"</blockquote><p>He highlighted that Meta Quest is designed to foster virtual communities and encourage interaction, emphasizing its role in promoting engagement. In contrast, Apple's Vision Pro was characterized as a device primarily intended for solitary use.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/zuckerberg-questioned-by-senators-leaked-llama-ai\"><strong><em>Meta’s Zuckerberg grilled by senators over ‘leak’ of LLaMA AI model</em></strong></a></p><p>Differing from the Meta Quest and Meta Quest Pro, Apple's Vision Pro introduces control through eye movements and hand gestures, eliminating the requirement for controllers. It also features a translucent display and a lighter design. However, these advanced technologies contribute to a higher price point, with the Vision Pro starting at $3,500. In comparison, Meta's most expensive headset, the Meta Quest Pro, begins at $1,000.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/metaverse-really-turning-out-snow-crash/\"><strong><em>Is the Metaverse really turning out like ‘Snow Crash’?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-09T09:05:57.000Z",
    "title": "Past exploit threatens $200M liquidation if BNB falls below $220",
    "url": "https://cryptoslate.com/past-exploit-threatens-200m-liquidation-if-bnb-falls-below-220/",
    "description": "<p>Binance&#8217;s BNB ecosystem would face a $200 million liquidation if its price were to fall below $220, according to DeFiLlama data. Over the past week, BNB has experienced a significant sell-off as crypto traders reduced their exposure to the token amid regulatory woes. On June 5, the U.S. Securities and Exchange Commission (SEC) filed against [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/past-exploit-threatens-200m-liquidation-if-bnb-falls-below-220/\">Past exploit threatens $200M liquidation if BNB falls below $220</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-09T09:07:21.000Z",
    "title": "CBA Limits Payments to Crypto Exchanges, Crypto Daily TV 9/6/2023",
    "url": "https://cryptodaily.co.uk/2023/06/cba-limits-payments-to-crypto-exchanges-crypto-daily-tv-9-6-2023",
    "description": "In Today&rsquo;s Headlines TV CryptoDaily News:\n<p></p>\n<p>Kraken NFT marketplace launched</p>\n<p>Cryptocurrency exchange Kraken has officially launched its NFT marketplace out of beta testing, supporting over 250 non-fungible tokens across the Ethereum, Solana and Polygon blockchains.</p>\n<p>Australia&rsquo;s biggest lender plans to curb payments to crypto exchanges</p>\n<p>Australia&rsquo;s banking sector is making it harder to transfer funds to cryptocurrency exchanges, citing the risk of scams. The latest step came from the Commonwealth Bank of Australia, which plans to impose a A$10,000 monthly limit on payments to digital-asset trading platforms.</p>\n<p>Bitcoin halving is coming, and only the most efficient miners will survive</p>\n<p>Roughly every four years, the reward for successfully mining a bitcoin block is cut in half. This event, known as the halving, reduces inflationary pressure on bitcoin. Currently, rewards are 6.25 BTC per block, and in April 2024, they will be reduced to 3.125 BTC per block.</p>\nBTC/USD exploded 1.0% in the last session.\n<p>The Bitcoin-Dollar pair skyrocketed 1.0% in the last session. The Stochastic-RSI gives a positive signal. Support is at 254191, and Resistance is at 278411</p>\n<p>The Stochastic-RSI is giving a positive signal.</p>\n<p></p>\nETH/USD skyrocketed 1.1% in the last session.\n<p>The Ethereum-Dollar pair skyrocketed 1.1% in the last session. The CCI is giving a negative signal. Support is at 1779.5067, and Resistance is at 1920.0067.</p>\n<p>The CCI is currently in the negative territory.</p>\n<p></p>\nXRP/USD exploded by 1.7% in the last session.\n<p>The Ripple-Dollar pair skyrocketed 1.7% in the last session. The MACD is giving a positive signal. Support is at 0.4901, and Resistance is at 0.5521.</p>\n<p>The MACD is currently in positive territory.</p>\n<p></p>\nLTC/USD saw a minor dip of 0.2% in the last session.\n<p>The Litecoin-Dollar pair made a minor downward correction in the last session, dropping 0.2%. The MACD is giving a negative signal, which matches our overall technical analysis. Support is at 85.4767, and Resistance is at 92.8767.</p>\n<p>The MACD is currently in negative territory.</p>\n<p></p>\nDaily Economic Calendar:\n<p>US USDA WASDE Report</p>\n<p>The World Agricultural Supply and Demand Estimates report, published monthly by the United States Department of Agriculture, provides forecasts for agricultural commodities&rsquo; supply and demand.</p>\n<p>The US USDA WASDE Report will be released at 16:00 GMT, the US Baker Hughes US Oil Rig Count at 17:00 GMT, and Finland&rsquo;s Industrial Output at 05:00 GMT.</p>\n<p>US Baker Hughes US Oil Rig Count</p>\n<p>The Baker Hughes Rig Count is an important business barometer for the drilling industry and its suppliers. Active drilling rigs consume products and services produced by the oil service industry.</p>\n<p>FI Industrial Output</p>\n<p>The Industrial Output shows the production volume of industries, i.e., factories and manufacturing.</p>\n<p>AT Industrial Production</p>\n<p>Industry is a basic category of business activity. Changes in the volume of the physical output of the nation&rsquo;s factories, mines and utilities are measured by the index of industrial production.</p>\n<p>The Austrian Industrial Production will be released at 07:00 GMT, Japan&rsquo;s CFTC JPY NC Net Positions at 20:30 GMT, and the UK&rsquo;s CFTC GBP NC Net Positions at 20:30 GMT.</p>\n<p>JP CFTC JPY NC Net Positions</p>\n<p>The weekly Commitments of Traders (COT) report provides information on the size and the direction of the positions taken. The report focuses on speculative positions.</p>\n<p>UK CFTC GBP NC Net Positions</p>\n<p>The weekly Commitments of Traders (COT) report provides information on the size and the direction of the positions taken. The report focuses on speculative positions.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T08:58:51.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T08:52:56.000Z",
    "title": "House Financial Services Committee releases new draft stablecoin bill with Bipartisan support",
    "url": "https://www.cryptopolitan.com/house-financial-services-committee-releases-new-draft-stablecoin-bill/",
    "description": "The Republican chair of the House Financial Services Committee has unveiled a new draft of the leading U.S. legislative proposal for overseeing stablecoins, incorporating positions from Democratic lawmakers. It is essential to know that this is the third draft of a stablecoin bill this year. The draft bill, posted on Thursday, is a starting point ... <a title=\"House Financial Services Committee releases new draft stablecoin bill with Bipartisan support\" class=\"read-more\" href=\"https://www.cryptopolitan.com/house-financial-services-committee-releases-new-draft-stablecoin-bill/\" aria-label=\"More on House Financial Services Committee releases new draft stablecoin bill with Bipartisan support\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T08:44:14.000Z",
    "title": "Chancer vs. Conflux: Which Token Has the Best Chance to 10x Your Investment?",
    "url": "https://www.cryptopolitan.com/chancer-vs-conflux-which-token-has-the-best-chance-to-10x-your-investment/",
    "description": "An adage in gambling is that the only way to make money in a casino is to be the casino. And now, with Chancer, you can. Market pundits are taking bets on which coin will 10x the fastest: Conflux, or the new peer-to-peer (P2P) betting platform, Chancer, now in the first phase of its presale. ... <a title=\"Chancer vs. Conflux: Which Token Has the Best Chance to 10x Your Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chancer-vs-conflux-which-token-has-the-best-chance-to-10x-your-investment/\" aria-label=\"More on Chancer vs. Conflux: Which Token Has the Best Chance to 10x Your Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-09T08:45:55.000Z",
    "title": "Next Crypto To Explode? Mechanism Capital Co-Founder Reveals Altcoin Gem",
    "url": "https://www.newsbtc.com/news/next-crypto-to-explode-mechanism-capital-co-founder/",
    "description": "Andrew Kang, a renowned crypto entrepreneur and investor, has revealed via Twitter his choice for the next cryptocurrency that may soon explode in price. Kang is the co-founder of Mechanism Capital, which invests in cryptocurrencies through prop trading, mining, ventures, and secondary markets. In the crypto community, Kang has made a name for himself with his winning trades. On Twitter, Kang now shared his latest crypto find: Radiant Capital (RDNT). The altcoin has a market cap of just $77.3 million, currently ranking #287 among all cryptocurrencies. According to Kang, Radiant Capital has the potential to become the &#8220;new king of the money markets,&#8221; toppling market leaders Aave and Compound from their thrones with a TVL of $5 trillion and $2 trillion, respectively. According to the investor, Radiant Capital can succeed because it is innovating while the others are treading water. Next Crypto To Explode A La SUSHI? However, with a current TVL of $260 million via Arbitrum and the Binance Smart Chain (BSC), Radiant has a long way to go. The case for Radiant is strong, however, according to Kang: the platform is the first functional cross-chain market maker (borrowing on the X-chain, lending on the Y-chain). Related Reading: UK Financial Conduct Authority Clamps Down on Crypto Marketing Also boosting RDNT&#8217;s price could be its upcoming launch on Ethereum and zkSync. Another advantage Radiant Capital has over its competitors, according to Kang, is the potential yield. While Aave &#38; Compound only yield 1-2% on stablecoins, less than treasuries, Radiant can offer much more lucrative rates. &#8220;With &#62;$100B stablecoin mkt cap &#38; $10B+ stables once in MMs now idle, this untapped liquidity is a huge opportunity: as 10-40% stablecoin yields from an audited, year-old protocol become known, expect TVL growth,&#8221; speculates Kang. The second biggest opportunity according to him are Ethereum and Liquid Staking Derivatives (LSDs) when the mainnet dApp launches. Once that happens, Kang expects Radiant to capture a piece of Compound &#38; Aave&#8217;s $4 trillion pie through sustained, incentivized yield. Another argument: with the rise of Layer Zero and zksync, Radiant could be well on its way to becoming a major beneficiary as people use the platform to farm potential airdrops. Related Reading: Coinbase CEO Takes On SEC, Igniting Crypto Community’s Passion for Clarity Also worth noting, according to Kang, is that Radiant has already surpassed Aave, Compound, and even Solana in 90 day revenue. Looking at the 90 day trend, Radiant is the fastest growing protocol in this field. However, the biggest trigger for an explosive rise in the price of the RDNT token could be a vampire attack on the outdated liquidity of existing money markets, a la Sushiswap. Kang writes in his latest tweet today: Sushiswap&#8217;s vampire attack on Uniswap was a core factor in it achieving a billion+ TVL and multi billion valuation. Have we seen a successful one since then? What about a vampire attack on money markets? If billions of stables and LSDs are barely earning 1-2% in Aave and Compound, how much would move for 10% yield? 20%? 30%? Kang Buys $1.11 Million In RDNT As Arkham Intel reports, Kang has followed up his words (after the first tweet on Wednesday) with action. Andrew Kang&#8217;s on-chain address has begun acquiring RDNT tokens. Initially, the trader bought 3.922 million RDNT for $1.11M. With Andrew Kang @Rewkang&#8216;s thread about Radiant Capital yesterday, his on-chain address has begun acquiring $RDNT tokens. Over the past 24 hours, his address 0xe8c has bought 3.922M $RDNT for $1.11M. This has since increased in value to $1.19M &#8211; a gain of ~$80K in under 24h! https://t.co/sZyFJUWchV pic.twitter.com/2HFfLcjsLL — Arkham (@ArkhamIntel) June 8, 2023 However, Kang&#8217;s recommendation has not been met with unanimous enthusiasm throughout the crypto community. Some voices think that Kang&#8217;s theses are too far-fetched and not strong enough. On the other hand, it should be noted that the &#8220;Binance effect&#8221; of a listing already happened at the end of March this year. At press time, Radiant Capital (RDNT) traded at $0.2926. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-09T08:41:19.000Z",
    "title": "How to Make MILLIONS From Bitcoin BRC-20 Ordinals",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-to-make-millions-from-bitcoin-brc-20-ordinals/",
    "description": "<p>The crypto world got rocked this week with the SEC lawsuits against both Binance AND Coinbase. But even that is not slowing down the biggest trend in crypto, BRC-20 tokens. Bitcoin is holding up OK and we need Bitcoin to buy Ordinals. So how do you buy Ordinals? And where? Glad you asked. Today, we [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-to-make-millions-from-bitcoin-brc-20-ordinals/\">How to Make MILLIONS From Bitcoin BRC-20 Ordinals</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]