[
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T08:06:29.000Z",
    "title": "New Tool ‘Nightshade’ Challenges AI Text-to-Image Tech",
    "url": "https://www.cryptopolitan.com/nightshade-challenges-ai-text-to-image-tech/",
    "description": "Generative AI technology, such as OpenAI&#8217;s ChatGPT, has made significant strides in natural language processing. However, these AI models rely on massive datasets scraped from the web, raising concerns among artists and photographers whose work is used without permission or compensation. Artists and Photographers vs. Generative AI Generative AI tools can create images from text ... <a title=\"New Tool &#8216;Nightshade&#8217; Challenges AI Text-to-Image Tech\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nightshade-challenges-ai-text-to-image-tech/\" aria-label=\"More on New Tool &#8216;Nightshade&#8217; Challenges AI Text-to-Image Tech\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T08:04:00.000Z",
    "title": "Spain Launches AI Sandbox Without Cash Support for Startups",
    "url": "https://www.cryptopolitan.com/spain-launches-ai-sandbox-without-cash-support-for-startups/",
    "description": "Spain has embarked on a pioneering initiative within the European Union by introducing an AI sandbox aimed at helping tech startups adapt to the forthcoming EU AI Act. However, the Spanish government has decided against offering financial support to these startups, sparking concerns among some entrepreneurs about the potential burden of compliance. EU AI Act ... <a title=\"Spain Launches AI Sandbox Without Cash Support for Startups\" class=\"read-more\" href=\"https://www.cryptopolitan.com/spain-launches-ai-sandbox-without-cash-support-for-startups/\" aria-label=\"More on Spain Launches AI Sandbox Without Cash Support for Startups\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T08:03:42.000Z",
    "title": "How cybercriminals are exploiting SEO and SEM to facilitate crypto scams: Report",
    "url": "https://www.cryptopolitan.com/cybercriminals-exploiting-seo-and-sem-to-facilitate-crypto-scams/",
    "description": "Bitrace, a prominent figure in the cryptocurrency industry, has recently shed light on an alarming trend—fake wallet apps that fraudulently appear on search engine results. Bitrace reports that perpetrators employ advanced Search Engine Optimization (SEO) and Search Engine Marketing (SEM) techniques to propel phishing links into prominence. These malevolent links then direct users to counterfeit ... <a title=\"How cybercriminals are exploiting SEO and SEM to facilitate crypto scams: Report\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cybercriminals-exploiting-seo-and-sem-to-facilitate-crypto-scams/\" aria-label=\"More on How cybercriminals are exploiting SEO and SEM to facilitate crypto scams: Report\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-30T07:52:55.000Z",
    "title": "Thailand’s fourth-largest bank invests $103m in local crypto exchange",
    "url": "https://crypto.news/thailands-fourth-largest-bank-invests-103m-in-local-crypto-exchange/",
    "description": "Kasikornbank has acquired $103 million worth of shares of the Satang crypto exchange through its subsidiary Unita Capital. Thailand&#8217;s financial giant Kasikornbank (KBank) has bought 97% shares of the local crypto exchange dubbed Satang Pro, Thai newspaper Bangkok Biz News&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-30T08:00:06.000Z",
    "title": "Charting The Dogecoin Path: More Gains On the Horizon?",
    "url": "https://www.newsbtc.com/news/dogecoin-20-gains-on-the-horizon/",
    "description": "Dogecoin (DOGE) continues its remarkable ascent in the cryptocurrency market, garnering attention from investors and enthusiasts alike. Over the past two years, DOGE has exhibited a strong affinity for an ascending trendline, which has played a pivotal role as a dynamic support mechanism. This trendline, indicative of the coin&#8217;s consistent upward trajectory, has become a defining feature of the meme coin&#8217;s journey. In the last six months, the price of Dogecoin has entered a consolidation chapter, repeatedly rebounding off the ascending support trendline situated in the $0.055-$0.06 range. The significance of this pattern lies in the coin&#8217;s resilience to market fluctuations, bolstered by the unwavering support from its community of investors. Related Reading: Pepe Conquers The Weekend Charts With 61% Rally – Here’s Why As of the latest data from CoinGecko, DOGE is currently trading at $0.068750, with a 0.6% gain in the past 24 hours and an impressive 10.8% surge over the past week. This upward momentum reflects the coin&#8217;s resilience and growing appeal among traders and investors. Dogecoin Potential Upsurge A notable technical pattern that has emerged is the formation of a double bottom, signifying a potential bullish trend. This pattern suggests that DOGE&#8217;s price could experience a substantial 20% rally, contingent on buyers maintaining support above the immediate threshold of $0.067. The recent surge in meme coins, including DOGE, Shiba Inu (SHIB), and Floki Inu (FLOKI), has added to the excitement in the cryptocurrency sphere. Dogecoin (DOGE) is currently trading at $0.0685. Chart: TradingView.com The growing enthusiasm can be attributed to the buzz surrounding the Bitcoin Exchange Traded Fund (BTC ETF), which has sent ripples across the crypto market and turned it a vibrant shade of green. Understanding The Ascending Trendline The significance of DOGE&#8217;s affinity for the ascending trendline cannot be overstated. This trendline serves as a visual representation of the coin&#8217;s consistent bullish trajectory over the past two years. As the price of DOGE hovers in the $0.055-$0.06 range, it reaffirms the coin&#8217;s resilience and stability, making it an attractive option for both long-term and short-term investors. The formation of a double bottom pattern in DOGE&#8217;s price chart is a promising development for traders. This pattern typically suggests that the coin is on the verge of a bullish trend reversal. If buyers manage to uphold the immediate support level of $0.067, there is a potential for DOGE to embark on a significant 20% rally, offering traders an enticing opportunity for profits. Related Reading: Crystal Ball For Solana: Envisioning A Staggering 2030 Valuation DOGE&#8217;s sustained journey along its ascending trendline, coupled with the potential of a double bottom pattern, paints an optimistic picture for the coin&#8217;s future. As the broader cryptocurrency market experiences a surge in meme coin popularity, driven by the BTC ETF hype, DOGE enthusiasts eagerly await what the future holds for this beloved meme-inspired cryptocurrency. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  }
]