[
  {
    "source": "Decrypt",
    "date": "2024-02-29T22:01:02.000Z",
    "title": "Blast Unlocks $2.3 Billion in Crypto as Ethereum Scaler Launches",
    "url": "https://decrypt.co/219768/blast-unlocks-2-3-billion-ethereum-scaler-launches",
    "description": "Ethereum layer-2 network Blast is live as first apps go online—and billions in crypto funds locked up by users can now be withdrawn."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-29T21:42:43.000Z",
    "title": "Grayscale lobbying for regulatory approval of options for spot Bitcoin ETFs",
    "url": "https://cryptoslate.com/grayscale-lobbying-for-regulatory-approval-of-options-for-spot-bitcoin-etfs/",
    "description": "<p>Grayscale is lobbying for the US SEC to approve options on its spot Bitcoin exchange-traded fund (ETF), Reuters reported on Feb. 29. Grayscale CEO Michael Sonnenshein said: &#8220;It is vital to the interests of GBTC and all spot Bitcoin [exchange-traded product] investors to access exchange-listed options on GBTC and other spot Bitcoin ETPs.&#8221; The SEC [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/grayscale-lobbying-for-regulatory-approval-of-options-for-spot-bitcoin-etfs/\">Grayscale lobbying for regulatory approval of options for spot Bitcoin ETFs</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-29T22:00:39.000Z",
    "title": "Justin Sun Moves $100M To Binance, Stacking Ethereum?",
    "url": "https://www.newsbtc.com/news/ethereum/justin-sun-moves-100m-to-binance-stacking-ethereum/",
    "description": "Justin Sun, the co-founder of Tron&#8211;a smart contracting platform for deploying decentralized applications (dapps), is once again moving and shuffling millions of dollars. According to Lookonchain data on February 29, Sun reportedly transferred 100 million USDT to Binance, days after moving huge sums earlier this week. Justin Sun Holds Millions Of ETH: Will The Co-founder Buy More? From February 12 to 24, a wallet associated with Sun acquired 168,369 ETH for an average price of $2,894. This purchase, valued at roughly $580.5 million, currently holds an unrealized profit of around $95 million. Profitability could increase considering the sharp demand for crypto, especially top coins like Bitcoin and Ethereum, in recent days. The Ethereum price chart shows that ETH has been on a clear uptrend, rising from around $2,200 in early February to over $3,450 when writing. At this pace, and considering the institutional interest in potent crypto assets, including ETH, the odds of the second most valuable coin stretching gains will be highly likely. As Bitcoin inches closer to $70,000, the probability of Ethereum also tracking higher toward its all-time high of around $5,000 will be elevated. Related Reading: Bitwise CEO Says Bitcoin At $250,000 Is Closer Than You Think Since ETH already owns a big stash of coins, there is speculation that the co-founder will double down, buying even more coins. The crypto community will continue watching the address until this happens and there is solid on-chain data to support the purchase. Spot Ethereum ETFs And The Dencun Upgrade Are Key Updates So far, optimism is high, especially among the broader altcoin community. As Bitcoin races to register new all-time highs pumped by institutional billions, eyes will be on the United States Securities and Exchange Commission (SEC). There are multiple applications for a spot Ethereum exchange-traded fund (ETF).  The agency has not provided a definitive timeline for approving or rejecting the derivative product. There is regulatory uncertainty around the status of ETH, a significant headwind that might delay or even prevent the timely authorization of this product. Still, the community is looking forward to the next communication in May. If the spot Ethereum ETF is a go, the coin will likely rally to new all-time highs, following Bitcoin. Related Reading: Bitcoin MVRV Hits Levels That Lead To Parabolic Bull Run In 2020 However, before then, eyes are on the expected implementation of Dencun. The upgrade addresses challenges facing Ethereum, including scalability. Through Dencun, Ethereum developers hope to lay the base for further throughput enhancements in the coming years. With higher throughput, transaction fees drop, overly improving user experience. This upgrade might go a long way in cementing Ethereum&#8217;s role in crypto, wading off stiff competition from Solana and others, including the BNB Chain. Feature image from DALLE, chart from TradingView"
  }
]