[
  {
    "source": "BTCManager",
    "date": "2023-05-28T11:00:00.000Z",
    "title": "DigiToads is an undervalued crypto that can surpass dogecoin in value",
    "url": "https://crypto.news/digitoads-is-an-undervalued-crypto-that-can-surpass-dogecoin-in-value/",
    "description": "DigiToads (TOADS) is making significant progress under the radar and can surpass dogecoin (DOGE) in value"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-28T11:00:58.000Z",
    "title": "Monaco, NFTs, And Formula 1: Reasons Polygon Is Bullish",
    "url": "https://www.newsbtc.com/nft/monaco-nfts-and-formula-1-reasons-polygon-is-bullish/",
    "description": "Platinium Group, the premier ticket provider for Grand Prix events, has joined forces with an NFT marketplace, Elemint; and a web3 company, Bary, to release a new NFT ticketing system on Polygon that debuted this weekend at the Formula 1 event in Monaco. Tickets for the Monaco Grand Prix, which is ongoing and started on Friday, May 26, are being minted on Polygon, the Ethereum sidechain that enables fast processing speeds and high throughput. Polygon Labs&#8217; head of global business development, Urvit Goel, emphasized that the platform&#8217;s use of Ethereum&#8217;s robust security and NFTs&#8217; unfalsifiable uniqueness improves ticket authenticity, reduces the likelihood of counterfeiting, and gives fans a digital memento they can keep forever. The ticketing platform combines the robust security of Ethereum with the forge-proof uniqueness of NFTs to enhance ticket authenticity and prevent counterfeiting while providing fans with lasting digital mementos. Polygon Rally In response to this deal, MATIC prices rallied on May 26, soaring to as high as $0.97. Even though prices have since retracted, the upswing momentum remains and the token appears to be bottoming up. Related Reading: Shiba Inu Burn Rate Surges 1500% In 24 Hours, Yet Price Continues To Struggle In Red Whether this event will trigger more gains in the sessions ahead is yet to be seen. However, the spike that lifted MATIC above key resistance levels on May 26 may be the foundation for another rally going forward. Currently, MATIC is down 40% from February 2023 highs and remains under pressure, trailing other assets, including BTC. Besides price action, the release of the new ticketing platform on Polygon is when NFTs are finding new uses after a concerning contraction in 2022. Bertrand Labays, Platinum Group&#8217;s Chief Operating Officer, said the integration of blockchain in their operations is “imperative” and that NFTs would play a role in sports. NFT’s Rising Popularity Last year, NFTs trading volumes contracted, following the sharp retracement of asset prices. While MATIC recovered in Q1 2023, gains have not been strong in Q2 2023. However, the platform is positioning itself as a go-to portal for minting NFTs. Specifically, users are finding Polygon’s low-fees and high scalability an advantage. Besides, Polygon’s EVM compatibility means issuers can move their assets to Ethereum. Still, whether the recent announcement from Platinum will draw more interest remains to be seen. Related Reading: Sui (SUI) Continues Downward Trend As Bears Maintain Control Recently, Formula 1 also partnered with Tezos, a self-amending layer-1 blockchain, to launch a new NFT ticketing system. In this arrangement, Formula 1 fans would easily purchase tickets that exist as NFTs and stored permanently on the Polygon and Ethereum competitor. Beyond that, the NFL Players Association (NFLPA) joined hands with Chiliz to create a new NFT ticketing platform on Socios.com for NFL fans to purchase tickets. -Featured Image From Canva, Chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-28T10:53:19.000Z",
    "title": "European Commission To Present Regulatory Framework For Digital Euro In June",
    "url": "https://www.newsbtc.com/token/european-commission-to-present-regulatory-framework-for-digital-euro-in-june/",
    "description": "Fabio Panetta, a member of the Executive Committee of the European Central Bank (ECB), recently announced that the European Commission would be presenting a legislative proposal for the digital euro in June. He further stated that the next steps would be decided in October. Digital Euro Regulatory Framework In Progress In an interview with the ECB&#8217;s official site, Panetta confirmed that the eurozone bank is in regular contact with the European Commission to establish a regulatory framework for the digital euro. The digital euro is set to become the official central bank digital currency (CBDC) for the 27 countries in the European Union. Panetta stated, &#8220;We are studying the design of the digital euro, its distribution, and its impact on the financial sector.&#8221; He also mentioned that the proposal expected to be presented in June would receive a response from the Governing Council of the ECB in October. Related Reading: Sui (SUI) Continues Downward Trend As Bears Maintain Control The Governing Council will then decide whether to initiate a preparation phase to develop and test the digital euro. According to Panetta, the European CBDC testing phase could last two to three years. If everything progresses smoothly and both the Governing Council of the ECB and the legislators of the European Parliament approve the proposal, the digital euro could be launched in approximately three to four years, estimated Panetta. Will The Digital Euro Receive Significant Adoption? During the interview, Panetta was asked about the benefits and potential risks of using the digital euro. In response, he emphasized the need to provide citizens with a risk-free digital means of payment that can be used freely throughout the euro area. Panetta highlighted that such a solution currently does not exist, pointing out that the card payment market is dominated by non-European companies, specifically referring to Visa and Mastercard. He stated that this situation would be unthinkable in the United States and expressed concern about companies selling users&#8217; personal data. Related Reading: Shiba Inu Burn Rate Surges 1500% In 24 Hours, Yet Price Continues To Struggle In Red Panetta also emphasized the importance of central bank money remaining at the financial system&#8217;s core. The increasing adoption of cryptocurrencies like Bitcoin (BTC) raises concerns for entities like the ECB. Addressing concerns about privacy, Panetta clarified that the ECB would not have access to personal data. Financial intermediaries will handle the distribution of the digital euro, and a balance must be found between ensuring confidentiality and combating money laundering and terrorist financing. Panetta noted that the responsibility of finding this balance lies with the legislators. CBDCs On The Rise  Central Bank Digital Currencies (CBDCs) are indeed on the rise as countries worldwide explore the potential of digital currencies issued and regulated by central banks. Countries like the Bahamas and Nigeria have already launched their digital currencies, while China and Japan are in advanced pilot stages. -Featured image from iStock.com, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-28T10:59:00.000Z",
    "title": "Ripple vs SEC: Coinbase Connection to Hinman Emails Sparks Controversy",
    "url": "https://coinedition.com/ripple-vs-sec-coinbase-connection-to-hinman-emails-sparks-controversy/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Ripple-Opposed-Letter-Motion-in-SEC-Lawsuit-XRP-Market-Positive-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple vs SEC: Coinbase Connection to Hinman Emails Sparks Controversy\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Ripple-Opposed-Letter-Motion-in-SEC-Lawsuit-XRP-Market-Positive-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Ripple-Opposed-Letter-Motion-in-SEC-Lawsuit-XRP-Market-Positive-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Ripple-Opposed-Letter-Motion-in-SEC-Lawsuit-XRP-Market-Positive-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Ripple-Opposed-Letter-Motion-in-SEC-Lawsuit-XRP-Market-Positive-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Ripple-Opposed-Letter-Motion-in-SEC-Lawsuit-XRP-Market-Positive-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/01/Ripple-Opposed-Letter-Motion-in-SEC-Lawsuit-XRP-Market-Positive.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The Ripple vs. SEC legal battle takes an intriguing turn. It now involves speculation surrounding Coinbase’s access to the Hinman emails. Ripple said that Ripple may lack the authority to keep the emails confidential. The Ripple Labs versus U.S. Securities and Exchange Commission (SEC) legal battle has taken yet another intriguing turn, this time with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ripple-vs-sec-coinbase-connection-to-hinman-emails-sparks-controversy/\">Ripple vs SEC: Coinbase Connection to Hinman Emails Sparks Controversy</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]