[
  {
    "source": "Decrypt",
    "date": "2023-09-20T22:45:58.000Z",
    "title": "Game of Thrones Creator George R.R. Martin Joins Lawsuit Against OpenAI",
    "url": "https://decrypt.co/198076/game-of-thrones-george-rr-martin-ai-openai",
    "description": "Prominent authors are joining the Authors Guild in a lawsuit against OpenAI, alleging copyright infringement in training ChatGPT."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-20T22:40:13.000Z",
    "title": "Gensler says U.S. government shutdown would reduce SEC to skeleton crew",
    "url": "https://cryptoslate.com/gensler-says-u-s-government-shutdown-will-reduce-sec-to-skeleton-crew/",
    "description": "<p>Gary Gensler, chair of the U.S. Securities and Exchange Commission (SEC), told Bloomberg on Sept. 20 that a government shutdown could hinder his agency. Other reports indicate that the U.S. government could shut down on Oct. 1 as members may not pass the bills needed to fund operations before the next fiscal year. Gensler commented [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/gensler-says-u-s-government-shutdown-will-reduce-sec-to-skeleton-crew/\">Gensler says U.S. government shutdown would reduce SEC to skeleton crew</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-09-20T23:06:58.000Z",
    "title": "Coinbase’s cbETH Staking Generates 4% of Exchange’s Revenue",
    "url": "https://cryptobriefing.com/coinbases-cbeth-staking-generates-4-of-exchanges-revenue/?utm_source=feed&utm_medium=rss",
    "description": "Amid low trading volumes, Coinbase is diversifying revenue beyond exchange fees into areas like Ethereum staking service cbETH."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-20T22:45:00.000Z",
    "title": "Economist and Gold Bug Peter Schiff Forecasts Grim Future for U.S. Dollar Amid Inflation Concerns",
    "url": "https://www.cryptoglobe.com/latest/2023/09/economist-and-gold-bug-peter-schiff-forecasts-grim-future-for-u-s-dollar-amid-inflation-concerns/",
    "description": "In a recent in-depth interview Peter Schiff, a well-known economist and gold advocate, painted a bleak picture for the U.S. dollar and the broader economy, tracing current inflationary pressures back to the 2008 financial meltdown. During an interview on First TV, as first reported by Bitcoin.com, Schiff argued that policies adopted post the crisis, specifically […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T23:00:44.000Z",
    "title": "Shiba Inu Update: 530% Spike In Shibarium Metric Could Trigger SHIB Recovery",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-update-shibarium/",
    "description": "Shiba Inu could be gearing up for a rally after a metric has flashed bullish. This metric has to do with the recently launched Shibarium network whose usage is continuing to rise rapidly. This time around, the Ethereum Layer 2 blockchain has seen a significant surge in the number of new verified contracts. Verified Contracts On Shibarium Record 530% Spike On Monday, September 18, the total number of new verified contracts on the Shibarium network saw an impressive increase. The figure rose 530% to mark a top 5 highest day for new verified contracts on the network. This figure had risen from 4 the previous day to 19 on Monday. Related Reading: This New Development Could Stop The Optimism (OP) Price Dead In Its Tracks Number of new verified contracts spikes &#124; Source: ShibariumScan While there was a decline in the number of new verified contracts the following day, the numbers continued to come out larger than Sunday’s figures. On Tuesday, the total number of new verified contracts came out to 12, still 300% higher than Sunday’s figures. This spike in the number of new verified contracts saw the total number of verified contracts rise to a new all-time high of 430 as of Wednesday morning. The growth is also evident in other metrics such as total accounts which crossed 25,700, and completed transactions on the network almost at 2.7 million. However, it is not all ‘up-only’ for the network given that active accounts have been on the decline. As of Wednesday, active accounts on Shibarium stood at 589, down from its 7,729 peak recorded on August 26, 2023. Will This Trigger A Shiba Inu Spike? Shiba Inu plays a significant role in the Shibarium ecosystem as its governance token and increased usage on the network leads to higher demand which translates to higher prices. This could be the case here with the rise in new verified contracts. Usually, for networks that facilitate decentralized finance (DeFi) protocol, a rise in new verified contracts means more developers are choosing to build on the network. More protocols can inadvertently draw in more users, meaning more demand on the network. Related Reading: How Much Will Dogecoin Trade At If It Attains The Market Cap Of Bitcoin Or Ethereum? However, Shibarium is still struggling to find its footing with only 20,000 new transactions recorded on Tuesday. Its Total Value Locked (TVL) has also fallen from its all-time high of $1.47 million to $600,000 at the time of writing, suggesting dwindling interest in the network. The meme coin is also trading below its 50-day and 100-day moving averages. While this can be bearish for the coin’s price, it could also serve as a lift-off point for the digital asset if the crypto market were to begin another bull rally. SHIB price begins retracement &#124; Source: SHIBUSDT on Tradingview.com Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Times Tabloid, chart from TradingView.com"
  }
]