[
  {
    "source": "Bitcoin.com",
    "date": "2023-09-06T03:30:47.000Z",
    "title": "G20 Nations Actively Discussing Crypto Framework, Says Indian Finance Minister",
    "url": "https://news.bitcoin.com/g20-nations-actively-discussing-crypto-framework-says-indian-finance-minister/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/india-g20-crypto-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"G20 Nations Actively Discussing Crypto Framework Under India&#039;s Presidency, Says Indian Finance Minister\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/india-g20-crypto-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/india-g20-crypto-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/india-g20-crypto-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/india-g20-crypto-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/india-g20-crypto-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/india-g20-crypto-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/india-g20-crypto.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The G20 countries are actively discussing a global framework for crypto assets under India’s presidency, Finance Minister Nirmala Sitharaman has revealed. &#8220;India&#8217;s presidency has put on the table key issues related to regulating or understanding that there should be a framework for handling issues related to crypto assets,” she emphasized. India Says &#8216;Active Discussions&#8217; on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-06T03:26:12.000Z",
    "title": "Attorney General Bonta Urges Congress to Combat AI-Driven Child Exploitation",
    "url": "https://www.cryptopolitan.com/combat-ai-driven-child-exploitation/",
    "description": "California Attorney General Rob Bonta has taken a leading role in a collective effort involving 54 states and territories to combat the alarming surge in child exploitation facilitated by artificial intelligence (AI). Together, they have called upon Congressional leaders to establish an expert commission tasked with investigating the insidious use of AI in exploiting children ... <a title=\"Attorney General Bonta Urges Congress to Combat AI-Driven Child Exploitation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/combat-ai-driven-child-exploitation/\" aria-label=\"More on Attorney General Bonta Urges Congress to Combat AI-Driven Child Exploitation\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-06T03:20:42.000Z",
    "title": "Bitcoin Bulls Hold Strong At $25,500 But Can They Push BTC Higher?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-bulls-hold-strong-25500/",
    "description": "Bitcoin price is consolidating above $25,650 and $25,500. BTC could start a decent increase if the bulls manage to push it above the $26,200 resistance. Bitcoin is trading in a range above the $25,650 support zone. The price is trading below $26,000 and the 100 hourly Simple moving average. There is a short-term bearish trend line forming with resistance near $25,800 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could take a major hit if it continues to struggle below the $26,200 resistance zone. Bitcoin Price Starts Consolidation Bitcoin price remained in a range and settled well below the $26,200 resistance zone. It seems like BTC bulls are currently protecting a downside break below the $25,650 and $25,500 support levels. It is clearly consolidating above the $25,650 level. However, it is also below $26,000 and the 100 hourly Simple moving average. Besides, there is a short-term bearish trend line forming with resistance near $25,800 on the hourly chart of the BTC/USD pair. Immediate resistance on the upside is near the $25,800 level and the trend line. The first major resistance is near the $26,000 level or the 23.6% Fib retracement level of the main decline from the $28,150 swing high to the $25,330 low. The next major resistance is now near the $26,200 level. A proper close above the $26,200 level might start a decent recovery wave toward $26,750. It is close to the 50% Fib retracement level of the main decline from the $28,150 swing high to the $25,330 low. Source: BTCUSD on TradingView.com The next major resistance is near $27,000, above which the bulls might gain strength. In the stated case, the price could test the $28,000 level. Another Drop In BTC? If Bitcoin fails to clear the $26,200 resistance, it could continue to move down. Immediate support on the downside is near the $25,650 level. The next major support is near the $25,350 level. A downside break and close below the $25,350 level might send the price further lower. In the stated case, the price could drop toward $24,800 or even $24,500. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $25,650, followed by $25,350. Major Resistance Levels – $25,800, $26,000, and $26,200."
  }
]