[
  {
    "source": "Decrypt",
    "date": "2023-11-30T22:58:13.000Z",
    "title": "Here's What's Coming to Xbox Game Pass",
    "url": "https://decrypt.co/208162/heres-whats-coming-xbox-game-pass",
    "description": "Microsoft's Xbox Game Pass is adding 16 new titles for subscribers in December—but four games will leave. Here's a look at the lineup."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-30T22:46:19.000Z",
    "title": "Circle Denies Links to Terrorist Financing and Justin Sun",
    "url": "https://decrypt.co/208176/circle-denies-links-to-terrorist-financing-and-justin-sun",
    "description": "“We are built on a culture of compliance and take our obligations seriously,” said the firm's chief strategy officer."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-30T22:40:43.000Z",
    "title": " Crypto is the ‘largest growing’ asset class in Aussie DIY pensions ",
    "url": "https://cointelegraph.com/news/australia-self-managed-retirement-funds-increase-crypto-holdings",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTEvYmFlNTA0YmEtMWY4My00YjQ0LWE4OGUtYTcwZGU4Mjg2MWZmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Australians are increasingly adding cryptocurrency to their “self-managed super funds” as a means to secure their retirement life, according to newly released data.</p>\n                    <p><p>Australians are increasingly looking to cryptocurrency to secure a peachy retirement, with allocation to the asset class from self-managed retirement funds increasing 400% in just four years — with the growth rate surpassing stocks and bonds.</p><p>As of the quarter ending in September, the nearly 612,000 self-managed super funds (SMSFs) are holding a total of $658.6 million (992 million Australian dollars) worth of cryptocurrencies, statistics <a href=\"https://data.gov.au/data/dataset/self-managed-superannuation-funds\" target=\"_blank\" rel=\"noopener nofollow\">released</a> on Nov. </p><p>The latest figure is a 400% increase from the same quarter in 2019 — which closed out at just under $131.5 million (198 million Australian dollars). </p><p>In Australia, self-managed super funds — also known as private superannuation funds — allow individuals to control how their retirement funds are invested. </p><p>Crypto tax provider Koinly’s head of tax Danny Talwar told Cointelegraph this makes crypto the “largest growing asset class in SMSFs.” </p><p>In comparison, listed shares — representing the largest allocation category for SMSFs at the end of the last quarter — grew 28% over the same time. </p><p>However, total SMSF allocations to crypto saw a slight 0.8% drop from the quarter ending June 2023 and a 2.4% drop compared to the previous year. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/dfaad5b5-f290-46cc-a039-e9e4c98235df.jpg\"  /><figcaption style=\"text-align: center;\"><em>Crypto allocation amounts within all SMSFs per quarter since September 2019. </p><p><a href=\"https://cointelegraph.com/news/australia-self-managed-retirement-funds-increase-crypto-holdings\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-30T23:00:52.000Z",
    "title": "Iris Energy Acquires 7,000 Next-Gen T21 Bitcoin Miners in Deal With Bitmain",
    "url": "https://news.bitcoin.com/iris-energy-acquires-7000-next-gen-t21-bitcoin-miners-in-deal-with-bitmain/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/irs-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Iris Energy Acquires 7,000 Next-Gen T21 Bitcoin Miners in Deal With Bitmain\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/irs-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/irs-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/irs-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/irs-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/irs-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/irs-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/irs.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Australia-based and Nasdaq-listed Iris Energy recently announced the acquisition of 1.3 exahash per second (EH/s) capacity in Bitmain&#x2019;s latest Antminer T21 models. This purchase boosts Iris Energy&#x2019;s proprietary mining capacity to a notable 8.3 EH/s. Iris Energy Secures 1.3 EH/s in Latest Bitmain Deal Iris Energy (Nasdaq: IREN) announced on Thursday its procurement of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-30T23:00:28.000Z",
    "title": "3 Bitcoin-Like Proof Of Work Altcoins That Could Make You A Millionaire In 2024",
    "url": "https://www.newsbtc.com/altcoin/3-bitcoin-proof-of-work-altcoins/",
    "description": "Bitcoin is still the leading proof of work blockchain and has already made massive moves over the years, with countless millionaires at the same time. However, with the price of Bitcoin having moved so much already, the upside is fairly limited, especially for crypto investors who do not have ample buying power to make a Bitcoin investment worth their while. In this vein, altcoins offer the best opportunity for smaller and retail investors to make the most money. But not just any altcoins; these coins also employ the proof of work mechanism, just like Bitcoin, making them a good choice, especially when they are newly launched. QUBIC: A Proof Of Work Coin Like Bitcoin The Qubic (QUBIC) coin is already making the rounds on social media platforms such as X (formerly Twitter) and with good reason. The blockchain uses a proof of work mechanism like Bitcoin. Led by IOTA co-founder Dominik Schiener, it has already garnered a reasonable following based on Schiener’s reputation. Related Reading: Top 2 Under The Radar Altcoins That Could Do A 70000% Run Like Kaspa (KAS) The coin is still trading well below $0.1 which could make it a good buy in the long run. With a current circulating supply of 71.425 trillion, its current market cap is currently sitting at around $200 million. 16% of the total supply has reportedly been burned already. Nexa (NEXA) Leads POW Altcoins Next (NEXA) is another proof of work blockchain, but unlike Bitcoin, it uses the UTXO Layer. This means that Nexa is a proof of work blockchain that is also able to support native tokens and smart contracts. To mitigate the problem of scalability often encountered by the likes of Bitcoin and Ethereum, Nexa employs Signatures and UTXO lookups. NEXA price at $0.000013 &#124; Source: NEXAUSDT on Tradingview.com The Nexa token is currently trending below one cent with an around $35 million market cap at the time of writing. Given the kind of run that Kaspa (KAS) had even through a bear market, it puts in perspective the opportunity that lies with this token. Firo (FIRO) Firo (FIRO) is another proof of work coin that also holds a lot of promise among the altcoins that fall into this category. It rebranded from ZCoin and is a privacy-first coin, meaning it mixes two of the most sought-after attributes right now in the crypto market. Related Reading: Ethereum Return To $4,800: Analyst Identifies Pattern To Trigger Rally To ATH Its price is $1.87 with a fully diluted market cap of under $40 million. This makes it the coin on this list with the lowest fully diluted market cap. Its price has been relatively stable for the last week, which could suggest that accumulation is happening ahead of a possible breakout. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Swapzone, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-30T23:01:26.000Z",
    "title": "Bankruptcy Court Declares FTX Debtors Can Begin To Sell $744,000,000 Worth of Grayscale and Bitwise Shares",
    "url": "https://dailyhodl.com/2023/11/30/bankruptcy-court-declares-ftx-debtors-can-begin-to-sell-744000000-worth-of-grayscale-and-bitwise-shares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/ftx-will-dole-one.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/ftx-will-dole-one.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/ftx-will-dole-one.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/ftx-will-dole-one.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/ftx-will-dole-one.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/ftx-will-dole-one.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/ftx-will-dole-one.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A bankruptcy court is ruling that debtors of bankrupt crypto exchange FTX can begin selling hundreds of millions of dollars worth of Grayscale and Bitwise shares. In a new filing, a court in Delaware is granting a motion filed earlier this month that would allow the debtors of FTX and its affiliates to start selling [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/30/bankruptcy-court-declares-ftx-debtors-can-begin-to-sell-744000000-worth-of-grayscale-and-bitwise-shares/\">Bankruptcy Court Declares FTX Debtors Can Begin To Sell $744,000,000 Worth of Grayscale and Bitwise Shares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]