[
  {
    "source": "CryptoSlate",
    "date": "2024-02-13T16:19:32.000Z",
    "title": "Bitcoin retreats below $49k as CPI release dashes hopes of rate cuts",
    "url": "https://cryptoslate.com/bitcoin-retreats-below-49k-as-cpi-release-dashes-hopes-of-rate-cuts/",
    "description": "<p>Bitcoin (BTC) price saw a significant pullback, erasing gains from Monday as investors recalibrated their expectations for the Federal Reserve&#8217;s monetary policy following the release of January Consumer Price Index (CPI) data. The flagship crypto was trading at $48,753 as of press time — a notable deviation from its recent upward trajectory. The dip liquidated roughly [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-retreats-below-49k-as-cpi-release-dashes-hopes-of-rate-cuts/\">Bitcoin retreats below $49k as CPI release dashes hopes of rate cuts</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-13T16:30:33.000Z",
    "title": "Renowned Economist Paul Krugman: ‘ Immigration Is One of America’s Great Sources of Power and Prosperity’",
    "url": "https://www.cryptoglobe.com/latest/2024/02/renowned-economist-paul-krugman-immigration-is-one-of-americas-great-sources-of-power-and-prosperity/",
    "description": "In a recent opinion piece for The New York Times, economist Paul Krugman delves into the complex issue of immigration in the United States, challenging widespread misconceptions and highlighting the indispensable role of immigrants in the nation’s economic fabric. Krugman is an American economist and public intellectual, widely known for his work in international economics, […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-13T16:23:12.000Z",
    "title": "Will Major Altcoins Be a Good Investment if Bitcoin Drops to $20K?",
    "url": "https://cryptodaily.co.uk/2024/02/will-major-altcoins-be-a-good-investment-if-bitcoin-drops-to-20k",
    "description": "Is it time to diversify your portfolio with major altcoins as Bitcoin teeters near $50,000? Discover why these tokens could be golden investments if Bitcoin plunges to $20,000. Stay ahead in the crypto game with insights on potential market shifts and the rising stars of the digital currency world."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-13T16:30:51.000Z",
    "title": "Solana Mobile’s Chapter 2 Reaches 100K Preorders, Guarantees Production",
    "url": "https://news.bitcoin.com/solana-mobiles-chapter-2-reaches-100k-preorders-guarantees-production/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2406680803-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Solana Mobile&#039;s Chapter 2 Reaches 100k Preorders, Guarantees Production\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2406680803-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2406680803-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2406680803-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2406680803-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2406680803-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2406680803-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2406680803.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Solana Mobile, a smartphone-focused subsidiary of Solana Labs, has announced that its second mobile phone, Chapter 2, has reached 100k preorders in less than 30 days, hitting a milestone that now guarantees the production of the hardware device. The company reported that the preorder price of $450 will be maintained only for the next two [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-13T16:37:14.000Z",
    "title": "Get Ready! TEAMZ WEB3 / AI SUMMIT 2024 in Japan is on the Horizon!",
    "url": "https://www.cryptopolitan.com/get-ready-teamz-web3-ai-summit-2024-in-japan-is-on-the-horizon/",
    "description": "About TEAMZ WEB3 / AI SUMMIT 2024 The TEAMZ WEB3 / AI SUMMIT represents an evolution from the TEAMZ WEB3 SUMMIT 2023, previously recognized as one the most significant and influential events in Japan’s Web3 landscape. For 2024, we’re expanding our focus to encompass both the burgeoning realms of Web3 and AI, two domains that [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-13T16:35:32.000Z",
    "title": "Google Gemini Expands Potential, Eyeing Headphones for Next Integration",
    "url": "https://www.cryptopolitan.com/google-gemini-expands-eyeing-headphones/",
    "description": "Last week saw the much-anticipated arrival of the Google Gemini mobile app in the United States, marking a significant step forward in Google&#8217;s venture into conversational AI technology. The chatbot/experimental assistant, named Gemini, made its debut in the US market, with a gradual rollout planned for other regions across the globe. Recent developments suggest that [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-13T16:31:59.000Z",
    "title": "Tech Summit Europe 2024: Transforming Tomorrow",
    "url": "https://www.cryptopolitan.com/tech-summit-europe-2024-transforming-tomorrow/",
    "description": "Amsterdam – The much-anticipated annual Tech Summit Europe is set to captivate industry enthusiasts on April 18, 2024, from 08:00 to 17:00 at the prestigious Postillion Hotel &#38; Convention Centre in Amsterdam.  This year&#8217;s summit, themed &#8220;Transforming Tomorrow,&#8221; promises a day filled with unparalleled insights, cutting-edge technologies, and invaluable networking opportunities. Building on the success [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-13T16:30:34.000Z",
    "title": "Isle of Man contemplates tighter regulation for crypto firms amidst public consultation",
    "url": "https://www.cryptopolitan.com/isle-of-man-contemplates-tighter-regulation/",
    "description": "The Isle of Man, renowned for its status as a self-governing British Crown dependency and a hub for offshore financial activities, has initiated a public consultation to revamp its regulatory framework concerning cryptocurrencies.&#160; To address Anti-Money Laundering and Countering the Financing of Terrorism (AML/CFT) concerns, the local Financial Service Authority (FSA) has unveiled a discussion [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-13T16:24:59.000Z",
    "title": "100x A.I Powerhouse Storms Into Stage 2 Of Presale, Bonk (BONK) Investors Get Involved For Better ROI",
    "url": "https://www.cryptopolitan.com/100x-a-i-powerhouse-storms-into-stage-2-of-presale-bonk-bonk-investors-get-involved-for-better-roi/",
    "description": "As Option2Trade (O2T) advances into the second stage of its presale, it stands as a testament to the power of artificial intelligence in shaping the future of finance. For Bonk (BONK) investors and the wider crypto community, Option2Trade (O2T) offers more than just a promising investment; it offers a vision of the future where AI-driven [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-13T16:13:00.000Z",
    "title": "XRP community rallies amidst concerns over token’s performance",
    "url": "https://www.cryptopolitan.com/xrp-community-rallies-amidst-concerns/",
    "description": "The XRP community finds itself at a crossroads as concerns over the token&#8217;s underperformance persist despite recent bullish sentiments expressed by a top executive.&#160; Versan Aljarrah, a prominent member of the XRP community, recently shared a clip featuring Miles Franklin CEO Andy Schetman, who extolled the potential of XRP to yield substantial wealth for investors.&#160; [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-13T16:30:46.000Z",
    "title": "Extreme Greed Is Back For Bitcoin, Is It Time To Sell?",
    "url": "https://www.newsbtc.com/bitcoin-news/extreme-greed-back-for-bitcoin-time-to-sell/",
    "description": "Data shows extreme greed sentiment has made a return among the Bitcoin investors after the cryptocurrency&#8217;s price has broken above $50,000. Bitcoin Fear &#38; Greed Index Now Points Towards &#8220;Extreme Greed&#8221; The &#8220;Fear &#38; Greed Index&#8221; refers to an indicator that tells us about the general sentiment among Bitcoin traders and broader cryptocurrency sectors. The metric represents this sentiment using a numerical scale from zero to hundred. According to Alternative, its creator, the index calculates this score using five factors: volatility, trading volume, social media sentiment, market cap dominance, and Google Trends. Related Reading: CryptoQuant Founder Puts $112,000 Target For Bitcoin This Year When the Fear &#38; Greed Index has a value of 54 or greater, the investors now share a sentiment of greed. On the other hand, values of 46 or less imply the presence of fear among the traders. The region between these two ranges (values 47 to 53) corresponds to the territory of &#8220;neutral&#8221; sentiment. In addition to these three core sentiments, &#8220;extreme fear&#8221; and &#8220;extreme greed&#8221; occur at the deep ends of the fear and greed ranges. Here is what the Bitcoin Fear &#38; Greed index looks like right now to see which of these regions the market is in: Looks like the value of the metric is 79 at the moment &#124; Source: Alternative As displayed above, the Bitcoin Fear &#38; Greed Index has surpassed the 75 threshold for extreme greed during the past day and has attained a value of 79. The metric was at 70 yesterday, so it has seen a bit of a jump in just the last 24 hours. This surge in sentiment from greed to extreme greed has occurred as cryptocurrency broke past the $50,000 barrier for the first time since December 2021. Historically, the extreme sentiments have been quite significant for the asset, as major bottoms and tops for the price have occurred in these regions. This relationship between the two, however, has been inverse. Extreme fear has been when bottoms have taken shape, while extreme greed has been where tops have formed. In the past, Bitcoin has usually tended to move against the majority&#8217;s expectations. This expectation is the strongest in these ranges, so it makes sense that a reversal is the primarily likely here. Followers of a trading philosophy called &#8220;contrarian investing&#8221; exploit this fact to time their buying and selling moves. &#8220;Be fearful when others are greedy, and greedy when others are fearful&#8221; is a famous quote from Warren Buffet that sums up the idea. As the chart below shows, the last time the Fear &#38; Greed Index attained extreme greed levels was around the time of the spot ETF approval. The trend in the Fear &#38; Greed Index over the past year &#124; Source: Alternative As BTC investors are very well aware, the coin hit a top coinciding with the event as the market took to selling the news. Since the sentiment is now back inside extreme greed with its latest surge, another similar reversal point may be close for its price. Related Reading: Dogecoin Out Of Fashion? Volume &#38; Whale Activity Plunges Perhaps it&#8217;s at a time like this when a contrarian investor would consider moving towards selling, going against the hype and euphoria floating around the market. BTC Price Bitcoin has enjoyed a surge of over 4% in the past day, which has taken its price towards the $50,000 mark. The price of the coin appears to have shot up over the past day &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, Alternative.me, charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-13T16:36:47.000Z",
    "title": "Solana on the Rise: Weekly Close Signals Potential Surge to $135",
    "url": "https://www.crypto-news-flash.com/solana-on-the-rise-weekly-close-signals-potential-surge-to-135/?utm_source=rss&utm_medium=rss&utm_campaign=solana-on-the-rise-weekly-close-signals-potential-surge-to-135",
    "description": "<img width=\"1800\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-with-white-arrow-going-up.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Solana-SOL-logo-with-white-arrow-going-up\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-with-white-arrow-going-up.jpg 1800w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-with-white-arrow-going-up-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-with-white-arrow-going-up-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-with-white-arrow-going-up-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-with-white-arrow-going-up-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-with-white-arrow-going-up-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-with-white-arrow-going-up-450x300.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-with-white-arrow-going-up-1200x800.jpg 1200w\" sizes=\"(max-width: 1800px) 100vw, 1800px\" />Solana is on the rise, after shaking off concerns about the recent network outage that shook investor confidence. With the incident behind them, investors want to drive prices higher and potentially hit the $135 high in the coming weeks. Solana (SOL) has in recent days impressed investors who are now eyeing a breakout. This performance [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-13T16:21:11.000Z",
    "title": "Dolomite Expands to Polygon zkEVM: Pioneering DeFi’s Next Frontier",
    "url": "https://www.crypto-news-flash.com/dolomite-expands-to-polygon-zkevm-pioneering-defis-next-frontier/?utm_source=rss&utm_medium=rss&utm_campaign=dolomite-expands-to-polygon-zkevm-pioneering-defis-next-frontier",
    "description": "<img width=\"1200\" height=\"628\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-13T192327.541.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-13T192327.541.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-13T192327.541-300x157.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-13T192327.541-768x402.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-13T192327.541-150x79.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-13T192327.541-450x236.png 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Arbitrum’s fast-growing DEX Dolomite has launched on Polygon zkEVM. The protocol is set to bring its advanced trading engine backed by ZK technology to Polygon. Dolomite, a leading Decentralized Exchange (DEX) on Arbitrium has announced its anticipated launch on Polygon&#8217;s new zkEVM (zero-knowledge Ethereum Virtual Machine), marking a crucial milestone in the expansion of Decentralized [...]"
  }
]