[
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T10:04:46.000Z",
    "title": "Petro cryptocurrency discontinued in Venezuela following legal troubles",
    "url": "https://www.cryptopolitan.com/petro-cryptocurrency-discontinued-venezuela/",
    "description": "The government of Venezuela has terminated its national cryptocurrency, the Petro (PTR), effective January 15, according to media reports.&#160; Launched in 2018, the Petro was introduced as a mechanism to circumvent U.S. sanctions, but it struggled to gain traction both domestically and internationally. The Petro, backed by Venezuela&#8217;s oil reserves and initially priced at $60 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T10:00:39.000Z",
    "title": "Shiba Inu Coin Price Prediction 2024-2033: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2024-2033 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T09:54:42.000Z",
    "title": "WRX Price Prediction 2024-2033: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2024-2033 How much is WRX worth? The current price of WazirX (WRX) is $0.225, accompanied by a 24-hour trading volume of $1.1 million. The market capitalization stands at $50.9 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 3.19% decrease. Currently, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T09:52:31.000Z",
    "title": "Global Concerns: AI-Generated Misinformation and Cyberattacks Take Center Stage",
    "url": "https://www.cryptopolitan.com/global-concerns-ai-generated-misinformation/",
    "description": "In its recently released Global Risks Report 2024, the World Economic Forum (WEF) identifies the rapid evolution of artificial intelligence (AI) technology as a catalyst for two of the most significant global risks: AI-generated misinformation and cyberattacks. The report defines &#8220;global risk&#8221; as events or conditions that could adversely impact a substantial portion of global [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T09:40:55.000Z",
    "title": "FDA Grants Approval to Darmiyan’s BrainSee AI for Early Alzheimer’s Detection",
    "url": "https://www.cryptopolitan.com/fda-grants-approval-to-darmiyans-brainsee/",
    "description": "In a groundbreaking move, the Food and Drug Administration (FDA) has granted Do Novo approval to the BrainSee medical AI software developed by Darmiyan. This innovative software is designed to predict the likelihood of a patient developing Alzheimer’s disease within five years, providing doctors with a valuable tool for early intervention. Revolutionizing Alzheimer&#8217;s detection Darmiyan&#8217;s [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-13T10:07:00.000Z",
    "title": "Cardano forecasted to hit $5, will other altcoins follow?",
    "url": "https://crypto.news/cardano-forecasted-to-hit-5-will-other-altcoins-follow/",
    "description": "Analysts predict Cardano to hit $5. NuggetRush (NUGX) and Bonk (BONK) gaining traction"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-13T10:05:00.000Z",
    "title": "Liquid staking protocols: new era for Ethereum validators",
    "url": "https://crypto.news/liquid-staking-protocols-new-era-for-ethereum-validators/",
    "description": "Discover how Ethereum&#8217;s shift to PoS and liquid staking protocols transform blockchain technology and address the 32 ETH staking challenge. Ethereum staking has revolutionized the way we use and interact with blockchain technology.  With its security now relying on capital&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-13T10:00:47.000Z",
    "title": "Bitcoin Retreats: ETF Dream Fades, Price Tumbles Under $42,000",
    "url": "https://www.newsbtc.com/news/bitcoin-retreats-etf-dream-fades-price-tumbles-under-42000/",
    "description": "In a dramatic turn of events, Bitcoin prices plummeted Friday, erasing almost 10% of its value and dashing hopes of a sustained rally fueled by the highly anticipated launch of spot Bitcoin ETFs. The cryptocurrency, which had surged to a two-year high of $49,000 just a day prior, retreated below $42,000 as investors digested the implications of the new financial instruments. Bitcoin&#8217;s Downturn: ETF Impact, Trust Sell-off, FTX Bankruptcy Analysts point to a confluence of factors behind the sudden downturn. Profit-taking by early adopters who cashed in on the ETF-induced surge is likely one major driver. With the news out of the way, some investors might have seen an opportunity to lock in profits after a rapid climb. Related Reading: Lido (LDO) Action Heats Up: Nearly 90% Of Holders See Profits On Crypto Climb BTC hitting $41,730 in the last 24 hours. Source: Coingecko Adding to the selling pressure was a wave of selling from Grayscale Bitcoin Trust shares. The long-standing trust, which tracks Bitcoin&#8217;s price but doesn&#8217;t directly hold the cryptocurrency, saw significant outflows as investors shifted towards the newly available ETFs. This switch, while seemingly positive for the ETF market, contributed to the immediate pressure on Bitcoin itself. Further complicating the picture, the bankruptcy proceedings of FTX, the once-dominant crypto exchange, are also believed to be playing a role. Assets are reportedly being &#8220;unloaded&#8221; amid the increased market activity surrounding the ETF launch, leading to additional downward pressure on Bitcoin&#8217;s price. Bitcoin slightly above the $43K level today. Chart: TradingView.com Despite the significant correction, not everyone is singing the blues. Some analysts believe the pullback is a healthy development, allowing the market to adjust after the initial hype surrounding ETFs. Zach Pandl, managing director of research at Grayscale, views the profit-taking as a natural reaction to the recent surge and suggests it shouldn&#8217;t have a long-term impact on Bitcoin&#8217;s price. Bitcoin ETF Launch: Landmark Moment, Uncertain Future While the immediate future remains uncertain, the launch of spot Bitcoin ETFs represents a landmark moment for the cryptocurrency industry. With traditional financial tools now available for institutional and retail investors alike, Bitcoin&#8217;s accessibility and potential for wider adoption are undoubtedly enhanced. Related Reading: Crypto CEO Bets Big: ‘Perfect Storm’ Event To Slingshot Bitcoin To $1 Million However, the story doesn&#8217;t end there. The recent volatility serves as a stark reminder of the inherent risks involved in the cryptocurrency market. As the dust settles and the market digests the ETF news, it will be fascinating to see whether this marks a mere correction or a more fundamental shift in the trajectory of Bitcoin&#8217;s price. One thing is clear: the saga of Bitcoin is far from over. With new players entering the game and established forces facing challenges, the next chapter promises to be just as thrilling, if not more, than the one we&#8217;ve just witnessed. Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-13T10:00:23.000Z",
    "title": "Shiba Inu (SHIB) Faces Potential 20% Decline; Toncoin (TON) and Rebel Satoshi ($RBLZ) Ignite Market Excitement",
    "url": "https://www.crypto-news-flash.com/shiba-inu-shib-faces-potential-20-decline-toncoin-ton-and-rebel-satoshi-rblz-ignite-market-excitement/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-shib-faces-potential-20-decline-toncoin-ton-and-rebel-satoshi-rblz-ignite-market-excitement",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-96.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-96.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-96-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-96-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-96-450x281.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-evolving world of cryptocurrencies, market dynamics can change swiftly, leaving investors on the edge of their seats. Shiba Inu (SHIB), a prominent meme coin, is currently navigating choppy waters, facing the potential of a 20% decline. This surprising downturn comes on the heels of the entire cryptocurrency market experiencing a setback. As top [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-13T09:44:31.000Z",
    "title": "Bitcoin ETF Euphoria Crumbles as BTC Price Plummets 7% – Is $30,000 or $60,000 Next?",
    "url": "https://www.crypto-news-flash.com/bitcoin-etf-euphoria-crumbles-as-btc-price-plummets-7-is-30000-or-60000-next/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-etf-euphoria-crumbles-as-btc-price-plummets-7-is-30000-or-60000-next",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Despite initial optimism following the approval of Bitcoin ETFs, the crypto experienced an unexpected decline, dropping over 7% from $49,000 to an intraday low of $45,644. In contrast to the Bitcoin ETF approval, the market continues to exhibit uncertainty, with the Bitcoin options data showing 36,000 BTC options nearing expiration. The hype surrounding the Bitcoin [...]"
  }
]