[
  {
    "source": "Crypto Daily",
    "date": "2023-07-18T07:10:00.000Z",
    "title": "Binance Ends Partnership Deal With Argentine Football Association",
    "url": "https://cryptodaily.co.uk/2023/07/binance-ends-partnership-deal-with-argentine-football-association",
    "description": "<p>Binance, one of the world's largest cryptocurrency exchanges, has abruptly ended its five-year partnership with the Argentine Football Association (AFA) after only one year.&nbsp;</p>\n<p>As per the exchange, the termination happened because the AFA failed to comply with partnership obligations.</p>\nPartnership Background\n<p>Binance and AFA went into business in AFA, with the former becoming the official naming sponsor of the country's national football team. The deal was for a five-year partnership, generating significant buzz in the crypto space. However, things started to sour after the AFA allegedly failed to fully comply with its partnership obligations leading to the dissolution. As per Binance, the AFA's non-compliance conflicted with their business values and partnership principles.</p>\n<p>Wu Blockchain tweeted:</p>\n\n<p>\"Binance has terminated its five-year partnership with the Argentine soccer association, just after a year, citing a breach of contract. The move comes at a time when Binance is cutting staff and employee benefits. In January 2022, Binance became the main sponsor of Argentina&rsquo;s national soccer team.\"</p>\n\nMore Troubles For Binance\n<p>Binance is currently going through challenging times after news came out that they have reportedly laid off several staff members after a number of executives left the firm. Apparently, more than 1,000 staff members were let go over the past few weeks. It should be noted that Binance CEO CZ has tweeted that the numbers reported were grossly inaccurate.</p>\nAFA's Crypto Partnership\n<p>The Binance partnership was far from AFA&rsquo;s first crypto rodeo. Previously, the AFA had partnered with global exchange ByBit as its main sponsor. The AFA had also partnered with the likes of&nbsp;Upland, and BC.GAME.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-18T07:30:33.000Z",
    "title": "Latam Insights — Argentina’s Reserves Bleed, Central Bank of Brazil Would Be Able to Manipulate Digital Real in CBDC Pilot",
    "url": "https://news.bitcoin.com/latam-insights-argentinas-reserves-bleed-central-bank-of-brazil-would-be-able-to-manipulate-digital-real-in-cbdc-pilot/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1827932012-1-1.webp\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Latam Insights — Argentina&#039;s Reserves Bleed, Central Bank of Brazil Would Be Able to Manipulate Digital Real In CBDC Pilot\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" />Welcome to Latam Insights, a compendium of Latin America&#8217;s most relevant crypto and economic news during the last week. In this issue, the Argentine central bank sheds yuan for dollars as its reserves bleed, the Central Bank of Brazil would be able to manipulate balances and block digital real accounts, and the first bitcoin futures [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T07:22:37.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 How much is LTC worth? The current price of Litecoin stands at $91.18. Over the past 24 hours, it has experienced a trading volume of $1.72B and a market capitalization of $6.71B. Litecoin&#8217;s market dominance is at 0.55%. However, there has been a decrease in the LTC price by 2% within ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-18T07:20:15.000Z",
    "title": "US SEC accepts BlackRock’s spot Bitcoin ETF application",
    "url": "https://crypto.news/us-sec-accepts-blackrocks-spot-bitcoin-etf-application/",
    "description": "The US Securities and Exchange Commission (SEC) has accepted BlackRock's application for a spot Bitcoin exchange-traded fund (ETF)"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-18T07:10:57.000Z",
    "title": "Stellar versus Alex The Doge: comparing features and potential",
    "url": "https://crypto.news/stellar-versus-alex-the-doge-comparing-features-and-potential/",
    "description": "Alex The Doge and Stellar are popular crypto projects that investors can consider. The article highlights features Alex The Doge offers and why it can be explored"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-18T07:38:53.000Z",
    "title": "This Is Mark Cuban’s Crypto Portfolio ",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/this-is-part-of-the-mark-cuban-crypto-portfolio/",
    "description": "<p>Mark Cuban is a well-known name in the crypto space. This entrepreneur and billionaire has plenty of crypto investments. In a recent Twitter thread, MooMs covered eight crypto projects Cuban invested in. It never hurts to know in which projects big names invest. Maybe this gives you some ideas for your own portfolio. So, let&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/this-is-part-of-the-mark-cuban-crypto-portfolio/\">This Is Mark Cuban&#8217;s Crypto Portfolio </a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]