[
  {
    "source": "Decrypt",
    "date": "2024-01-17T20:02:02.000Z",
    "title": "To the Moon? Space Company Axiom Debuts NFT Art Auction Ahead of ISS Mission",
    "url": "https://decrypt.co/213214/to-the-moon-space-company-axiom-debuts-nft-art-auction-ahead-of-iss-mission",
    "description": "Before blasting off to the ISS, Axiom Space is launching an NFT auction with work from Erick Calderon, Amber Vittoria, and more."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-17T20:00:00.000Z",
    "title": " X removes NFT profile pictures, GameStop to shut down NFT marketplace: Nifty Newsletter ",
    "url": "https://cointelegraph.com/news/nft-newsletter-x-profile-pictures-gamestop-shut-down-marketplace",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYzIyMzdlMDAtM2FlMy00MWE0LTgxNWMtNDBjMGEyYmI5MmY2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Community members brought up the issue of fake accounts and scams on X as the platform ends support for NFT profile pictures.</p>\n                    <p><p data-ct-non-breakable=\"true\">In this week’s newsletter, get the community reaction to X (formerly Twitter) removing support for NFT profile pictures and how gaming retailer GameStop is closing its <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> marketplace. In other news, find out how NFTs can make a comeback after the approval of spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds (ETFs) in the United States and how BRC-20 tokens and Bitcoin Ordinals were an “important narrative” for Bitcoin in 2023. </p><p data-ct-non-breakable=\"true\">Social media platform X removed support for NFTs almost a year after its launch. The removal of NFTs sparked responses from community members on what it would mean for the NFT space. </p><p>Many community members brought up the issue of fake accounts and scams on X, voicing their disagreement with the move. One X user described removing NFT profile pics as “another black eye” for the space. </p><p><a href=\"https://cointelegraph.com/news/nft-newsletter-x-profile-pictures-gamestop-shut-down-marketplace\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T20:03:31.000Z",
    "title": "Microsoft inks partnership with Vodafone for AI integration",
    "url": "https://www.cryptopolitan.com/microsoft-with-vodafone-for-ai-integration/",
    "description": "Microsoft and Vodafone have recently joined forces in a formidable 10-year strategic partnership, injecting $1.5 billion into initiatives that include a profound integration of generative artificial intelligence (AI) capabilities. Vodafone’s committed investment over the next decade will be focused on cloud services and the development of “customer-focused AI services” in collaboration with Microsoft. Concurrently, Microsoft [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T20:00:00.000Z",
    "title": "2 Coins Priced Below $0.1 with the Potential for Up to 3000% Profits: Shiba Inu (SHIB) and Pandoshi (PAMBO)",
    "url": "https://www.cryptopolitan.com/2-coins-priced-below-0-1-with-the-potential-for-up-to-3000-profits-shiba-inu-shib-and-pandoshi-pambo/",
    "description": "Cryptocurrency markets are acknowledged for their volatility, offering both risks and possibilities for crypto investors. For the ones in search of doubtlessly excessive returns,&#160; cash stands out because of their low prices and promising outlook: Shiba Inu (SHIB) and Pandoshi (PAMBO). Priced below $0.1, those cash have captured the attention of traders seeking out the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T19:57:04.000Z",
    "title": "Tether details its objections to the UNODC study",
    "url": "https://www.cryptopolitan.com/tether-details-objection-to-the-unodc-study/",
    "description": "Tether, the issuer of the widely-used stablecoin USDT, has raised objections to a study conducted by the United Nations Office on Drugs and Crime (UNODC), which specifically highlighted the stablecoin’s alleged involvement in illicit activities. Tether contends that the UNODC report fails to acknowledge its crucial role in supporting developing economies in emerging markets. Tether [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T19:50:07.000Z",
    "title": "Google Cloud joins Flare network as a validator",
    "url": "https://www.cryptopolitan.com/google-cloud-joins-flare-network-validator/",
    "description": "Google Cloud has entered the blockchain infrastructure sector by aligning itself with Flare as both a network validator and infrastructure provider. Flare, often described as “the blockchain for data,” focuses on enhancing developers’ access to decentralized data through its Oracle system. This strategic move places Google Cloud among over 100 organizations playing dual roles within [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-17T19:44:20.000Z",
    "title": "ARK Investment shifts $16m from ProShares to own Bitcoin ETF",
    "url": "https://crypto.news/ark-investment-shifts-16m-from-proshares-to-own-bitcoin-etf/",
    "description": "ARK Investment Management, led by Cathie Wood, divested from the ProShares Bitcoin ETF, reallocating approximately $16 million towards its own Bitcoin ETF. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-17T20:00:42.000Z",
    "title": "Bitcoin On Thin Ice: Peter Schiff Warns Impending SEC Regulations Could Tank Prices",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-on-thin-ice-peter-schiff-warns-impending-sec-regulations-could-tank-prices/",
    "description": "Prominent economist and vocal crypto skeptic Peter Schiff has once again stirred the pot with his latest prognosis on Bitcoin (BTC). Schiff, known for his critical stance on digital currencies, has raised eyebrows with his latest post, where he warns of impending regulatory changes that could trouble Bitcoin&#8217;s transaction costs and future price trajectory. Regulatory Changes On The Horizon Schiff&#8217;s warnings are anchored in his belief that the US Securities and Exchange Commission (SEC), under the leadership of Gary Gensler, is poised to introduce new, more stringent regulations for cryptocurrencies. Related Reading: Bitcoin Price Signals Recovery But The Bears Are Not Out of Woods Yet According to Schiff, these regulations will likely significantly increase the operational costs of Bitcoin transactions. He argues that this hike in transaction costs will erode Bitcoin&#8217;s practicality as a digital currency, potentially leading to a sharp decrease in its market value. Since @GaryGensler was backed into a corner on spot #BitcoinETFs approval, I think he will soon introduce new onerous #crypto regulations that will substantially increase the cost of #Bitcoin transactions, further undermining its &#8220;use&#8221; case, resulting in a sharp decline in price. — Peter Schiff (@PeterSchiff) January 17, 2024 Schiff interprets Gensler&#8217;s recent actions, especially regarding approving spot Bitcoin exchange-traded funds (ETFs), as a precursor to these anticipated regulatory measures. Despite the looming threat of increased regulation, some industry observers have pointed to Gensler&#8217;s previous classification of Bitcoin as a commodity. This categorization, they argue, might present challenges to the SEC&#8217;s scope of regulation. However, Schiff counters this view by suggesting that the focus of any impending regulatory changes could be more aligned with anti-money laundering efforts rather than strictly within the ambit of securities law. He thinks most are securities. But he may even change his mind on Bitcoin. But my thought is that new regulations will relate to AML, not securities law. — Peter Schiff (@PeterSchiff) January 17, 2024 Technical Analysis Adds To Bearish Sentiment On Bitcoin Supporting Schiff&#8217;s bearish outlook, market analyst Bitcoinhyper has recently identified a bearish pattern on Bitcoin’s chart. According to the analyst, a double-top pattern on the stochastic oscillator, a well-regarded momentum indicator, has emerged, signifying potential bearish movement ahead. This technical observation aligns with recent market trends, where Bitcoin has shown downward movement following the formation of this pattern. Bitcoinhyper’s analysis supports the idea of further corrections, suggesting that Bitcoin&#8217;s peak might already be established. As Bitcoin navigates through these uncertain waters, on-chain data from IntoTheBlock presents another challenge. The data shows that Bitcoin is currently facing a robust on-chain resistance zone. This resistance is gauged by the volume of Bitcoin acquired by investors within the price range of $42,700 to $44,000. Approximately 2.68 million addresses holding over a million BTC are clustered in this range, creating a formidable barrier for price movements. Related Reading: Bitcoin Bearish Forecast: Analyst Signals Continued Downfall Bitcoin&#8217;s trading price currently hovers around $42,601, reflecting a 0.9% decrease over the last 24 hours and nearly a 5% decline over the past week. This price action is further compounded by a notable decrease in trading volume, which has dipped from last week&#8217;s $40 billion to below $30 billion today, indicating reduced market activity. This sluggish market performance comes in the wake of fading excitement over the recent spot ETF approvals and an absence of significant market-driving news. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-17T19:45:02.000Z",
    "title": "‘Fear of the Unknown’ Caused SEC To Delay Bitcoin ETF Approvals, Says Commissioner Hester Peirce",
    "url": "https://dailyhodl.com/2024/01/17/fear-of-the-unknown-caused-sec-to-delay-bitcoin-etf-approvals-says-commissioner-hester-peirce/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/fear-of-unknown-etf.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/fear-of-unknown-etf.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/fear-of-unknown-etf.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/fear-of-unknown-etf.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/fear-of-unknown-etf.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/fear-of-unknown-etf.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/fear-of-unknown-etf.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>U.S. Securities and Exchange Commission (SEC) official Hester Peirce sees the delayed approval of a spot Bitcoin (BTC) exchange-traded fund (ETF) as &#8220;squandered time.&#8221; In a new interview with Natalie Brunell, Peirce, one of the SEC’s five appointed commissioners, says the regulator should reflect on what she argues were errors in the approval process. &#8220;This [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/17/fear-of-the-unknown-caused-sec-to-delay-bitcoin-etf-approvals-says-commissioner-hester-peirce/\">‘Fear of the Unknown’ Caused SEC To Delay Bitcoin ETF Approvals, Says Commissioner Hester Peirce</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-17T19:41:39.000Z",
    "title": "$89,500,000,000 Asset Manager To Shut Down Bitcoin Futures Exchange-Traded Fund Days After Approval of Spot ETFs",
    "url": "https://dailyhodl.com/2024/01/17/89500000000-asset-manager-to-shut-down-bitcoin-futures-exchange-traded-fund-days-after-approval-of-spot-etfs/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/etf-provider-first-futures.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/etf-provider-first-futures.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/etf-provider-first-futures.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/etf-provider-first-futures.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/etf-provider-first-futures.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/etf-provider-first-futures.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/etf-provider-first-futures.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A financial services giant with nearly $90 billion in assets under its management is shutting down its futures Bitcoin (BTC) exchange-traded fund (ETF) just days after the U.S. Securities and Exchange Commission approved a slew of spot market BTC ETFs. According to a new press release, New York-based investment management firm VanEck says that it [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/17/89500000000-asset-manager-to-shut-down-bitcoin-futures-exchange-traded-fund-days-after-approval-of-spot-etfs/\">$89,500,000,000 Asset Manager To Shut Down Bitcoin Futures Exchange-Traded Fund Days After Approval of Spot ETFs</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]