[
  {
    "source": "CryptoGlobe",
    "date": "2023-11-14T23:00:00.000Z",
    "title": "Cardano (ADA) Price Will Explode by Over 10,000% by 2025, Crypto Analayst’s Prediction Suggests",
    "url": "https://www.cryptoglobe.com/latest/2023/11/cardano-ada-price-will-explode-by-over-10000-by-2025-crypto-analaysts-prediction-suggests/",
    "description": "The price of Cardano’s ADA token has surged by more than 45% so far this month as it outperformed a number of other digital assets amid growing adoption. A new price prediction now suggests the cryptocurrency could see a rise of over 10,000% over the next two years. According to a trader using the handle […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-14T23:00:34.000Z",
    "title": "Adrian Day Warns of ‘Inevitable’ US Recession, Describes it as a ‘Freight Train Heading Towards Us’",
    "url": "https://news.bitcoin.com/adrian-day-warns-of-inevitable-us-recession-describes-it-as-a-freight-train-heading-towards-us/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/ftrain-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Adrian Day Warns of ‘Inevitable’ US Recession, Describes it as a ‘Freight Train Heading Towards Us&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/ftrain-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ftrain-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ftrain-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ftrain-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ftrain-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ftrain-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ftrain.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent interview, Adrian Day, CEO of Adrian Day Asset Management, shared his insights, positing a looming economic downturn in the U.S. Day critically analyzed the Federal Reserve&#8217;s actions, explaining their expected impacts on the nation&#8217;s economy. Adrian Day: Recession Looms Like an Oncoming Train On November 8, 2023, Adrian Day the founder and [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-14T23:00:36.000Z",
    "title": "Stunning Correlation Emerges Between XRP And XLM, What’s Going On?",
    "url": "https://www.newsbtc.com/analysis/xrp/correlation-xrp-and-xlm/",
    "description": "On Monday, news quickly spread after a BlackRock XRP ETF filing popped up on the Delaware Corp. Commission website. The filing has since been claimed to be false. But the damage was already done as the token&#8217;s price surged quickly before reversing. One interesting development from this event though was a curious correlation that emerged between the XRP price and the XLM price at the time. While the news was localized to XRP, XLM had surged just as much, emerging with a stunning correlation between the two. XRP And XLM Correlation Balloons In the wake of the rumored BlackRock XRP ETF filing pumping the token’s price, one enthusiast has noticed a significant correlation between XRP and XLM. Crypto analyst and educator Blockchain Backer took to X (formerly Twitter) to reveal what he terms as one of the “most bizarre” moves. Related Reading: Analyst Predicts 8800% Ascent to $35 Cardano (ADA), Here’s When The chart clearly shows the XLM price surging just as the BlackRock news broke with a straight green candle. Likewise, when the news was debunked and the XRP price began to fall, so did the XLM price, in an eerily similar fashion. In another post, Blockchain Backer revealed that XLM had followed XRP’s move in the 2-second timeframe. A chart shared with this post showed XRP’s movement and XLM’s movement on the same chart and the moves happened at almost the same time, as shown below: Source: X “The fake news was literally XRP specific, and would impact XRP only, not XLM. If anything, you&#8217;d expect XLM sell off like the rest of the market. Instead, it mirrors. Why?” the analyst wondered. XLM price retraces after pump &#124; Source: XLMUSD on Tradingview.com Running A Similar Race XRP and XLM have always seemed to run in the same circles and the correlation in their price movements has been a testament to that. One X user, in response to Blockchain Backer’s post, reasoned that the correlation was because both digital assets actually “share the same holders.” One crypto analyst who has also closely tied the performance of XLM to that of XRP is Crypto Bilbuwoo. One of their long-running analysis includes both digital assets which the analyst expects to move toward new all-time highs in the same fashion. Related Reading: Top 5 Meme Coins That Are Outperforming The Altcoin Rally In an October 15 post, Crypto Bilbuwoo posited that “The chart shows that 1.618 Fibonacci ratio(XLM: 6.5$, XRP: 26~33$) will be completed at the end of December.” The last time this happened was back in 2017 and the analyst expects a repeat of that trend, saying there would be a 6,500% surge for both assets. Despite this correlation, Blockchain Backer still finds Monday’s simultaneous pump strange as he believes “those same holders would have dumped XLM for XRP. Not fomo bought XLM on that news story.” However, as another X user explains, “Not if they believe XLM and XRP are brother and sister. There are some influencers peddling this for years. Doesn’t make logical sense but does with that narrative. XLM would be next!” Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Guarda Wallet, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-14T23:01:32.000Z",
    "title": "Kevin O’Leary Says New Crypto Exchange Will Compete With Binance, Become the Largest Ever To Be Regulated",
    "url": "https://dailyhodl.com/2023/11/14/kevin-oleary-says-new-crypto-exchange-will-compete-with-binance-become-the-largest-ever-to-be-regulated/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-rolls-trading-services.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-rolls-trading-services.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-rolls-trading-services.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-rolls-trading-services.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-rolls-trading-services.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-rolls-trading-services.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-rolls-trading-services.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Shark Tank star Kevin O&#8217;Leary says a new crypto exchange is coming that will take business away from the industry&#8217;s leading giants. In a new interview with Fox Business, the venture capitalist says the days of the &#8220;crypto cowboy&#8221; are long gone. O&#8217;Leary says that a new firm based in Abu Dhabi called M2 will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/14/kevin-oleary-says-new-crypto-exchange-will-compete-with-binance-become-the-largest-ever-to-be-regulated/\">Kevin O’Leary Says New Crypto Exchange Will Compete With Binance, Become the Largest Ever To Be Regulated</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]