[
  {
    "source": "CryptoGlobe",
    "date": "2023-10-29T17:00:45.000Z",
    "title": "Bitcoin’s Future: Andrei Jikh Deciphers Cathie Wood’s Predictions and Warns About ETF Pitfalls",
    "url": "https://www.cryptoglobe.com/latest/2023/10/bitcoins-future-andrey-jikh-deciphers-cathie-woods-predictions-and-warns-about-etf-pitfalls/",
    "description": "Andrei Jikh, a prominent finance expert, recently discussed the future of Bitcoin, focusing on Kathy Wood’s price predictions and the potential approval of spot Bitcoin ETFs in the U.S. Jikh is a well-known figure in the world of financial education, primarily through his YouTube platform where he delves into subjects like personal finance, investment strategies, […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-29T17:06:01.000Z",
    "title": "Microsoft Commits $3.2 Billion to Australian AI Development Amid Regulatory Uncertainty in the U.S",
    "url": "https://www.cryptopolitan.com/microsoft-commits-3-2-billion-to-australian-ai/",
    "description": "In a bold strategic move, Microsoft (NASDAQ: MSFT) is set to channel US$3.2 billion into enhancing Australia&#8217;s artificial intelligence (AI) and cloud computing sectors. This substantial investment, extending over the next two years, underscores the tech giant&#8217;s commitment to explore new territories for its cutting-edge technologies while facing regulatory headwinds in the United States. According ... <a title=\"Microsoft Commits $3.2 Billion to Australian AI Development Amid Regulatory Uncertainty in the U.S\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microsoft-commits-3-2-billion-to-australian-ai/\" aria-label=\"More on Microsoft Commits $3.2 Billion to Australian AI Development Amid Regulatory Uncertainty in the U.S\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-29T17:04:29.000Z",
    "title": "Young Entrepreneur Revolutionizes AI Sector with Escribelo.AI and QuickTok.AI",
    "url": "https://www.cryptopolitan.com/young-entrepreneur-revolutionizes-ai-sector/",
    "description": "In the competitive world of artificial intelligence, a young Spanish entrepreneur, Anas Andaloussi, has carved a remarkable path to success with his innovative ventures, Escribelo.AI and QuickTok.AI. From humble beginnings as a Minecraft enthusiast, Anas&#8217;s journey reflects a fusion of his passion for gaming, digital expertise, and a profound understanding of search engine optimization (SEO) ... <a title=\"Young Entrepreneur Revolutionizes AI Sector with Escribelo.AI and QuickTok.AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/young-entrepreneur-revolutionizes-ai-sector/\" aria-label=\"More on Young Entrepreneur Revolutionizes AI Sector with Escribelo.AI and QuickTok.AI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-29T16:55:24.000Z",
    "title": "AI Struggles with Basic Reasoning",
    "url": "https://www.cryptopolitan.com/ai-struggles-with-basic-reasoning/",
    "description": "Renowned AI entrepreneur Max Bennett recently brought attention to the limitations of even the most advanced AI language models, citing examples where they falter in tasks that require basic reasoning. In his book A Brief History of Intelligence: Evolution, AI, and the Five Breakthroughs That Made Our Brains, Bennett emphasizes the disparities between the predictive ... <a title=\"AI Struggles with Basic Reasoning\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-struggles-with-basic-reasoning/\" aria-label=\"More on AI Struggles with Basic Reasoning\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-29T16:54:15.000Z",
    "title": "Google’s $2 Billion AI Investment Sparks FTX’s Recovery Hopes",
    "url": "https://www.cryptopolitan.com/googles-billion-ai-investment-ftxs-recovery/",
    "description": "Google has injected a substantial $2 billion into the artificial intelligence firm Anthropic, potentially reshaping the trajectory of FTX&#8217;s financial future. This monumental investment, led by the tech giant, has triggered a wave of expectations for FTX&#8217;s recovery from bankruptcy. As hedge fund manager Travis Kling hints at a potential turnaround, questions linger about the ... <a title=\"Google&#8217;s $2 Billion AI Investment Sparks FTX&#8217;s Recovery Hopes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/googles-billion-ai-investment-ftxs-recovery/\" aria-label=\"More on Google&#8217;s $2 Billion AI Investment Sparks FTX&#8217;s Recovery Hopes\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-29T16:45:18.000Z",
    "title": "Pixel 8’s AI Photo Editing Raises Ethical Concerns",
    "url": "https://www.cryptopolitan.com/pixel-8s-ai-photo-editing-raises-ethical-concerns/",
    "description": "Google&#8217;s latest smartphone, the Pixel 8, introduces AI-powered photo editing tools that offer users unprecedented control over their images. While hailed for their innovation, these advanced features have raised significant ethical questions about the authenticity of the photos produced. In recent years, smartphone cameras have undergone a transformation, thanks to the integration of computational photography. ... <a title=\"Pixel 8&#8217;s AI Photo Editing Raises Ethical Concerns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pixel-8s-ai-photo-editing-raises-ethical-concerns/\" aria-label=\"More on Pixel 8&#8217;s AI Photo Editing Raises Ethical Concerns\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-29T16:54:28.000Z",
    "title": "ARK Invest offloads GBTC shares amid Grayscale’s Bitcoin ETF application battle",
    "url": "https://crypto.news/ark-invest-offloads-gbtc-shares-grayscale-bitcoin/",
    "description": "ARK Invest's recent actions could be influenced by Bitcoin's latest rally. The cryptocurrency's value recently soared, reaching over $35,000 on Oct. 28."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-29T17:00:46.000Z",
    "title": "Analyst Predicts Terra LUNA To Surge By 80-100% Following Key Event",
    "url": "https://www.newsbtc.com/terra-luna/analyst-predicts-terra-luna-to-surge-by-80-100-following-key-event/",
    "description": "LUNA, the native token of the Terra 2.0 blockchain, was among the many gainers in the past week positively affected by Bitcoin’s impressive rally toward the $35,000 mark. According to data from CoinMarketCap, LUNA is up by 13.96% in the last seven days, providing some relief for investors who have had to endure the token’s bearish form in the previous weeks leading to this price rise.  As expected, LUNA’s current bullish form has now attracted much attention, with some analysts speculating there could be more gains in the coming weeks.  Related Reading: Terra Validator Opposes USTC Burning, Pushes Alternative Plan To Regain Dollar Peg LUNA Could Double Its Value After Breaching Major Trendline, Analyst Says In a post on X on Sunday, crypto analyst Captain Faibik shared with his 67,000 followers an intriguing bullish prediction on LUNA’s price trajectory. Faibik, who claimed to not be a LUNA enthusiast, noted that the altcoin has recently broken a major bearish trendline and could potentially gain by 80-100%. According to Faibik’s analysis, LUNA traded above $0.47 in the past week, breaching a bearish trendline that stretches as far back as January 2023 on the token’s daily chart. Traditionally, trendlines are used by traders to connect several price points together and provide some insight into the potential direction of an asset’s price movement.  When an asset’s price moves out of an established trendline, as in the case of LUNA, it can be interpreted as an impending price reversal. Since the start of 2023, LUNA has produced an overall negative price performance, losing over 63% of its value in the last 10 months. However, if Faibik’s prediction proves true, the popular altcoin could be on its way to a remarkable recovery.  At the time of writing, LUNA trades at $0.468 with a 0.70% decline in the last day. With an 80-100% price increase, this price could rise as high as $0.934 in the coming weeks. Meanwhile, LUNA’s daily trading volume is currently down by 3.73% and valued at $48.67 million. With a market cap of $263.92 million, LUNA is ranked as the 117th largest cryptocurrency. Related Reading: Is Terra Classic Planning For USTC To Be Pegged To The Dollar Again? Terra Community Approves New Proposal  In other news, the Terra Community has recently passed governance proposal 4790 aimed at the active and aggressive development of the Terra ecosystem with resources provided by Terraform Labs. Under this newly approved proposal, Terraform Labs, alongside Terra community partners, will explore opportunities to utilize non-LUNA capital in driving the growth of the project’s economy.  In addition, 125 million LUNA will be staked by a Terra community council to encourage and reward active network engagement, offer essential services to support the ecosystem, and guarantee equitable decentralization. LUNA trading at $0.4696 on the daily chart &#124; Source: LUNAUSDT chart on Tradingview.com Featured image from iStock, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-29T17:00:19.000Z",
    "title": "Bitcoin Hits $35k, Chainlink, Nugget Rush and Solana Pump",
    "url": "https://www.crypto-news-flash.com/bitcoin-hits-35k-chainlink-nugget-rush-and-solana-pump/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-hits-35k-chainlink-nugget-rush-and-solana-pump",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-75.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-75.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-75-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Bitcoin hits the $35,000 level as Chainlink, NuggetRush, and Solana rally. NuggetRush stands out in the meme ecosystem for its tangible utility—integrating a P2E game. NuggetRush is poised for a 2,000% increase before the end of the year. The naysayers and biggest crypto critics have been silenced after their endless “crypto is dead” narrative following [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-29T16:55:02.000Z",
    "title": "US Treasury Deputy Secretary Says Vast Majority of Terror Group Financing Does Not Come From Crypto",
    "url": "https://dailyhodl.com/2023/10/29/us-treasury-deputy-secretary-says-vast-majority-of-terror-group-financing-does-not-come-from-crypto/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Waging-War-on-Crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Waging-War-on-Crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Waging-War-on-Crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Waging-War-on-Crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Waging-War-on-Crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Waging-War-on-Crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Waging-War-on-Crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Deputy Secretary of the US Treasury says cryptocurrencies do not account for the lion&#8217;s share of terror group financing.  Speaking in London during a Royal United Services Institute event, Wally Adeyemo says that terrorist financing is evolving and the advent of crypto provides bad actors with a new channel to move their funds. “As [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/29/us-treasury-deputy-secretary-says-vast-majority-of-terror-group-financing-does-not-come-from-crypto/\">US Treasury Deputy Secretary Says Vast Majority of Terror Group Financing Does Not Come From Crypto</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]