[
  {
    "source": "CoinDesk",
    "date": "2023-08-02T14:58:50.000Z",
    "title": "Ethereum Juggernaut MetaMask’s Origin Story Challenged in New Lawsuit",
    "url": "https://www.coindesk.com/business/2023/08/02/ethereum-juggernaut-metamasks-origin-story-challenged-in-new-lawsuit/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Joel Dietz is suing ConsenSys and his former business partner over his claims to MetaMask, the most important crypto wallet for the Ethereum blockchain."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-02T14:57:47.000Z",
    "title": "Decentralized Exchange THORSwap Introduces New Feature Aimed at Better Price Execution for Large Trades",
    "url": "https://www.coindesk.com/business/2023/08/02/decentralized-exchange-thorswap-introduces-new-feature-aimed-at-better-price-execution-for-large-trades/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Called Streaming Swaps, the feature is designed to improve capital efficiency for decentralized finance users who want to execute large trades."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-02T14:49:33.000Z",
    "title": "Worldcoin’s Iris-Scanning ID System Opens Doors for Government and Corporate Use",
    "url": "https://cryptobriefing.com/worldcoin-government-and-corporate-use/?utm_source=feed&utm_medium=rss",
    "description": "Worldcoin, known for its controversial blockchain-based iris-scanning identity technology, has revealed plans to allow governments and companies to utilize its system for identity verification and other applications, according to a..."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-02T14:46:00.000Z",
    "title": "Why Are the Crypto Market and Bitcoin up Today?",
    "url": "https://www.cryptoglobe.com/latest/2023/08/why-are-the-crypto-market-and-bitcoin-up-today/",
    "description": "Over the last 24-hour period, the total market capitalization of the cryptocurrency space moved up by around 1.7% to $1.18 trillion, with Bitcoin’s price rising over 2.1% to test the $30,000 mark after a slight downturn over the last few days. The rise has left various traders wondering why the cryptocurrency market is up today, […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-02T15:00:00.000Z",
    "title": "Bitcoin Price Analysis:  Volatility Spikes Higher - 3 August 2023",
    "url": "https://cryptodaily.co.uk/2023/08/bitcoin-price-analysis-volatility-spikes-higher-3-august-2023",
    "description": "<p>BTC/USD Elevated Volatility Below 30000:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 3 August 2023</p>\n<p>Bitcoin (BTC/USD) continued to experience elevated volatility early in the Asian session as the pair was lifted from the 28552.42 level and reached the 30033 area before moving back below the 29400 area.&nbsp; Stops were recently elected below the 29089.49 and 28775.19 levels, downside price objectives associated with selling pressure around the 29851.28 area.&nbsp; Additional Stops were elected below the 28999, 28874, and 28672 areas during the acute selloff, downside price objectives related to recent selling pressure around the 29526 and 29344 levels.&nbsp; Additional downside price objectives linked to recent selling pressure include the 28432, 27979, 27409, 27246, and 26501 levels.&nbsp; Below the market, additional downside price objectives include the 28213, 28137, 27757, 27430, 27338, 27312, 26348, and 26199 levels.&nbsp; &nbsp;Also, the 28095.44 area represents the 23.6% retracement of the historic depreciating range from 69000 to 15460.&nbsp;&nbsp;</p>\n<p>Following recent upside activity, areas of technical support and potential buying pressure include the 28306, 27466, 26428, and 26272 levels.&nbsp; Traders are monitoring the recent depreciating range from 31862.21 to 28850 with upside retracement levels around the 30356, 30711, 31151, and 31217 areas.&nbsp; Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;100-bar MA&nbsp;(4-hourly) at 29611.97 and the&nbsp;100-bar MA&nbsp;(Hourly) at 29286.97.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-02T14:48:56.000Z",
    "title": "Ripple executive discusses taxes, Dogecoin, Pomerdoge gain on weekly charts",
    "url": "https://crypto.news/ripple-executive-discusses-taxes-dogecoin-pomerdoge-gain-on-weekly-charts/",
    "description": "Dogecoin and Pomerdoge are bullish on the weekly chart while Ripple executive talks about XRP taxes"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-02T15:00:36.000Z",
    "title": "Uniswap Delists HEX Token After SEC Deems It An “Unregistered Security”",
    "url": "https://www.newsbtc.com/news/defi/uniswap-delists-hex-token-after-sec-deems-it-an-unregistered-security/",
    "description": "Uniswap, the largest decentralized exchange, has removed the HEX token from its interface after it was recently declared an unregistered security by the United States Securities and Exchange Commission (SEC). This comes as another blow for the token in what has been an unpleasant week so far.  This unfavorable run has had an impact on the price of HEX, which is currently valued at $0.00486457. According to CoinGecko data, the token’s price has declined by more than 12% in the last day, as it continues in a downward trend. Uniswap Withdraws Support For “Unregistered Security” HEX Uniswap has delisted the HEX token from its interface, placing it in the protocol’s &#8220;Unsupported List.&#8221; It is a list manually curated by Uniswap Labs &#8211; the developer of the protocol &#8211; to restrict tokens that violate trademarks, projects that have proven to be scams, or otherwise based on legal considerations. Following the SEC’s declaration on Monday, July 31, it appears that Uniswap is distancing itself from the HEX token. This declaration came when the financial regulator filed a lawsuit against Richard “Heart” Scheuler, the founder of HEX, PulseChain, and PulseX (a Uniswap fork). Related Reading: Breaking: HEX Token Plummets 25% Following SEC Lawsuit Against Founder Richard Heart In the court document, the Securities and Exchange Commission mentioned Uniswap as one of the factors behind its selection of the US District Court for the Eastern District of New York as the case’s venue. The commission said it chose this venue because many of the transactions highlighted in the lawsuit occurred on Uniswap, which is headquartered in Brooklyn, New York. The SEC accused the controversial Richard Heart of offering an “unregistered security”, the HEX token. Other angles of the case include HEX’s staking mechanism, its lock-up schedule, and how Heart manipulated the token’s supply by “recycling” transactions. The regulator claims that, by making “grandiose” promises of wealth, Heart was able to raise $1 billion from investors, which he &#8220;inappropriately&#8221; spent on luxury goods. The Crypto Community Reacts After the news of Uniswap blocking traders from trading the HEX token broke out, there has been a mixed reaction from the crypto community on Twitter.  Several tweets are questioning the “decentralized” nature of Uniswap, with some users even going as far as giving the protocol a bad review on various review platforms. Uniswap just halted Hex trading😳 I thought this was DeFi pic.twitter.com/oB7av4a9gB — TrevonJames.eth 🟢 (@TrVon) August 2, 2023 However, some Twitter users believe that Uniswap made the right call, as they feel the SEC’s case against Richard Heart is plausible.  Related Reading: Sell The News? Litecoin Traders Capitulate Ahead Of Today’s Halving Although Uniswap has removed HEX from its front end, it appears that it can still be traded on the decentralized exchange through alternative hosted websites. A Twitter user revealed that there are numerous Uniswap front ends &#8211; created by members of the HEX community &#8211; to trade the delisted token or to interact directly with the protocol’s smart contract to do so. HEXUSDT trading at $0.004923 &#124; Source: daily HEXUSDT chart from TradingView Featured image from Uniswap Labs, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T15:00:41.000Z",
    "title": "Is Worldcoin Crypto’s Next Big Thing? Analyzing Worldcoin and ApeMax",
    "url": "https://www.crypto-news-flash.com/is-worldcoin-cryptos-next-big-thing-analyzing-worldcoin-and-apemax/?utm_source=rss&utm_medium=rss&utm_campaign=is-worldcoin-cryptos-next-big-thing-analyzing-worldcoin-and-apemax",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T171919.861.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T171919.861.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T171919.861-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As the world of cryptocurrency continues to evolve, there are two vastly different crypto coins that are currently creating a buzz in the market &#8211; Worldcoin and ApeMax. Spearheaded by renowned tech entrepreneur Sam Altman, Worldcoin is an ambitious venture that merges digital identity verification with cryptocurrency. On the other hand, ApeMax is a revolutionary [...]"
  }
]