[
  {
    "source": "CoinDesk",
    "date": "2023-07-21T15:24:32.000Z",
    "title": "Crypto Liquidity Network Paradigm Leans Into DeFi With StarkWare",
    "url": "https://www.coindesk.com/business/2023/07/21/crypto-liquidity-network-paradigm-leans-into-defi-with-starkware/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The new Paradex decentralized perpetuals platform is backed by the recent appchain technology from StarkWare."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-21T15:10:49.000Z",
    "title": "ISIS Allies Used Crypto to Raise Millions: TRM Labs",
    "url": "https://www.coindesk.com/policy/2023/07/21/isis-allies-used-crypto-to-raise-millions-trm-labs/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Affiliates of the most notorious terrorist organization use centralized exchanges, the blockchain intel firm said."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-21T15:33:46.000Z",
    "title": "Welcome to McNuggets Land: McDonald’s Launches Metaverse Game in ‘The Sandbox’",
    "url": "https://decrypt.co/149551/welcome-mcnuggets-land-mcdonalds-launches-metaverse-game-sandbox",
    "description": "McDonald’s is the latest major brand to debut an immersive metaverse game experience—with NFT and crypto rewards, too."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-21T15:30:43.000Z",
    "title": "Hackers Drain $3 Million in Ethereum From DeFi Protocol Conic Finance",
    "url": "https://decrypt.co/149532/hackers-drain-3-2m-in-ethereum-from-defi-protocol-conic-finance",
    "description": "The new DeFi protocol, which went live in March, has lost more than 1,700 Ethereum. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-21T14:52:55.000Z",
    "title": "How DeFi adoption varies across chains, BTC price affects velocity",
    "url": "https://cryptoslate.com/defi-adoption-varies-across-chains-btc-price-affects-velocity/",
    "description": "<p>The &#8216;DeFi Summer&#8217; of 2020 was a turning point in the blockchain industry, as the season saw the debut of several DeFi projects, signaling the dawn of a new era in finance. DeFi&#8217;s evolution during this period didn&#8217;t just make waves; it catalyzed a paradigm shift, positioning itself as the bold trailblazer of this unprecedented [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/defi-adoption-varies-across-chains-btc-price-affects-velocity/\">How DeFi adoption varies across chains, BTC price affects velocity</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-21T15:00:00.000Z",
    "title": "Bitcoin Price Analysis:  Bearish Sentiment Growing - 22 July 2023",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-price-analysis-bearish-sentiment-growing-22-july-2023",
    "description": "<p>BTC/USD Bearish Sentiment Expanding:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 22 July 2023</p>\n<p>Bitcoin (BTC/USD) encountered elevated downside risks early in the Asian session as the pair has been increasingly unable to sustain recent gains above the 30000 figure.&nbsp; &nbsp;Bears absorbed the 30183.73 level during the ongoing pullback, a level that represents the 23.6% retracement of the appreciating range from 24750 to 31862.21.&nbsp;&nbsp; Stops were elected below the 30172, 30095, 30018, 29922, and 29768 areas during the depreciation, downside price objectives associated with selling pressure around the 30421.29 and 30281.68 areas.&nbsp; Additional downside price objectives include the 29403, 29089, 28775, 28386, and 27757 levels.&nbsp; Below current price activity, the 28095.44 area represents the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp; &nbsp;</p>\n<p>Following recent upside activity, areas of technical support and potential buying pressure include the 28306, 27466, 26428, and 26272 levels.&nbsp; Above the market, upside price objectives related to this level include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;above the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;200-bar MA&nbsp;(4-hourly) at 29685.25 and the&nbsp;50-bar MA&nbsp;(Hourly) at 29992.93.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T15:35:42.000Z",
    "title": "Will the No Robot Bosses Act Protect Workers from AI Decision-Making?",
    "url": "https://www.cryptopolitan.com/no-robot-bosses-act-ai-decision-making/",
    "description": "In response to the growing prevalence of artificial intelligence (AI) in the workplace and concerns about potential misuse and abuse of the technology, U.S. Senator Bob Casey has introduced the No Robot Bosses Act, one of two bills. This Senate bill aims to safeguard job seekers and employees from being subjected to AI decision-making without ... <a title=\"Will the No Robot Bosses Act Protect Workers from AI Decision-Making?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/no-robot-bosses-act-ai-decision-making/\" aria-label=\"More on Will the No Robot Bosses Act Protect Workers from AI Decision-Making?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T14:41:17.000Z",
    "title": "Can AI Safety Be Ensured by Watermarking Content by Big Tech Companies?",
    "url": "https://www.cryptopolitan.com/ai-safety-ensured-watermarking-by-big-tech/",
    "description": "In a significant move to address AI safety concerns, Big tech companies pledge to adopt voluntary guidelines, such as watermarking to help users identify AI-generated content, as part of their efforts to check AI abuse and misuse. These companies, Amazon, Anthropic, Google, Meta, Microsoft, OpenAI and ML startup Inflection agreed with the Biden Administration to ... <a title=\"Can AI Safety Be Ensured by Watermarking Content by Big Tech Companies?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-safety-ensured-watermarking-by-big-tech/\" aria-label=\"More on Can AI Safety Be Ensured by Watermarking Content by Big Tech Companies?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-21T15:34:03.000Z",
    "title": "US DOJ to double its crypto team, target ransomware crimes",
    "url": "https://crypto.news/us-doj-to-double-its-crypto-team-target-ransomware-crimes/",
    "description": "The U.S. Department of Justice (DOJ) promises to significantly increase the pool of available prosecutors to probe into illicit activities tied to cryptocurrencies. Department of Justice representative Nicole Argentieri announced that the National Cryptocurrency Enforcement Team (NCET) would be integrated&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-21T15:23:19.000Z",
    "title": "Ethereum price can reclaim $2k in August, Santiment predicts",
    "url": "https://crypto.news/ethereum-price-can-reclaim-2k-in-august-santiment-predicts/",
    "description": "Santiment predicts that Ethereum price can reclaim the psychological $2k price mark by August.  Since reaching its peak of $2,132 in April 2023, Ethereum (ETH) has struggled to regain its bullish momentum.  According to Santiment, the psychological area of value at&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-21T15:30:20.000Z",
    "title": "New Crypto Bill Demands SEC And CFTC To Draft Rules For Trading Platforms",
    "url": "https://www.newsbtc.com/news/new-crypto-bill-demands-sec-and-cftc-to-draft-rules-for-trading-platforms/",
    "description": "Senior House Republicans have officially introduced a bill that seeks to change how crypto markets function in the United States. Republican members of the Agriculture and Financial Services Committees of the United States House have introduced this bill to create a regulatory framework for digital assets. Submitted on July 20, the Financial Innovation and Technology for the 21st Century Act represents an effort by US lawmakers to promote collaboration between two major federal regulators. These include the Commodity Futures Trading Commission (CFTC) and the Securities and Exchange Commission (SEC). The 212-page bill aims to tackle regulatory gaps by establishing a comprehensive framework. The framework is expected to address the specific risks associated with various digital asset-related activities. Related Reading: Chainlink Holds Strong With 19% Rally – More Gains In The Pipeline? Crypto Regulation Framework: Protecting Consumers And Fostering Innovation The bill has been co-submitted by Glenn Thompson, Chairman of the House Committee on Agriculture, and French Hill, Chairman of the Subcommittee on Digital Assets. It primarily aims to safeguard consumers and promote innovation within the United States. In addition to its consumer protection and innovation promotion goals, the bill also establishes criteria for classifying a digital asset as a commodity. The primary focus lies on decentralization. If a digital asset meets these conditions, it becomes eligible to be traded as a digital asset commodity on SEC-registered digital asset trading systems. As part of this regulatory framework, market participants would be required to adhere to enhanced and comprehensive disclosure standards. Furthermore, these participants may need to register with both relevant regulatory agencies for compliance purposes. The bill specifically outlines a streamlined process for crypto companies to register with two key financial regulators, the CFTC and the SEC. The bill also seeks to modernize and update the outdated US securities laws when it comes to crypto. One significant amendment proposed in the bill is requiring the SEC to take into consideration the aspect of &#8220;innovation&#8221; as it is imperative to consider innovation when making regulatory decisions or taking any enforcement actions. The bill stated: Securities laws and regulations do not account for many of the unique characteristics of digital assets. Focus On Integrating NFTs In Traditional Marketplaces Under the provisions of the crypto regulation bill, both the Commodity Futures Trading Commission (CFTC) and the Securities and Exchange Commission (SEC) would be obligated to collaborate with foreign regulators. The objective is to establish uniform and consistent regulatory standards for digital assets and related activities across international jurisdictions. This collaboration aims to reduce regulatory discrepancies. It also focuses on enhancing global cooperation and creating a more harmonized approach to governing the digital asset space. Additionally, the bill mandates the Government Accountability Office (GAO) to conduct a comprehensive study on nonfungible tokens (NFTs). It also urges GAO to integrate NFTs within traditional marketplaces. This study will delve into various aspects of NFTs. This includes a study on their functioning, impact on markets, potential risks, and possible implications for consumers and investors. Related Reading: Is The Chainlink Top In? This Metric May Suggest So This is not the only crypto bill being proposed by US lawmakers. Last week, Senators Cynthia Lummis and Kirsten Gillibrand introduced a new version of their bipartisan Responsible Financial Innovation Act which will now compete with the crypto regulation bill. Featured image from, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T15:05:24.000Z",
    "title": "JPMorgan and Wells Fargo to Use Ripple (XRP) Partner’s FedNow Service for Instant Payments in the US",
    "url": "https://www.crypto-news-flash.com/jpmorgan-and-wells-fargo-to-use-ripple-xrp-partners-fednow-service-for-instant-payments-in-the-us/?utm_source=rss&utm_medium=rss&utm_campaign=jpmorgan-and-wells-fargo-to-use-ripple-xrp-partners-fednow-service-for-instant-payments-in-the-us",
    "description": "<img width=\"1000\" height=\"560\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/VIsual-Generation-3-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/VIsual-Generation-3-Ripple.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/VIsual-Generation-3-Ripple-300x168.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/VIsual-Generation-3-Ripple-768x430.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />JPMorgan and Wells Fargo are among the member banks that will utilize FedNow; an instant payment system. Other member banks are partners of Ripple, raising the possibility of FedNow utilizing the XRP Ledger for instant payment. JPMorgan and Wells Fargo are now partner members of the newly launched Federal Reserve’s instant payment service. As CNF [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T14:51:11.000Z",
    "title": "Mass Adoption of NFTs Expected as Fair.xyz Integrates with Polygon Network",
    "url": "https://www.crypto-news-flash.com/mass-adoption-of-nfts-expected-as-fair-xyz-integrates-with-polygon-network/?utm_source=rss&utm_medium=rss&utm_campaign=mass-adoption-of-nfts-expected-as-fair-xyz-integrates-with-polygon-network",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/POLYGON-1-MATIC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon (MATIC) is considering the incorporation of zero-knowledge (ZK) technology into its Proof-of-Stake main chain.\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/POLYGON-1-MATIC.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/POLYGON-1-MATIC-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/POLYGON-1-MATIC-1024x576.jpg 1024w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Fair in partnership with Polygon network has announced an open NFT edition to commemorate the milestones achieved. Fair is backed by key players including OpenSea, Binance, YouTube, Meta, TikTok, and Eden Block, among others. The mainstream adoption of Non-Fungible Tokens (NFTs) is undeniably imminent with the recent proliferation of institutional funds to develop supporting infrastructure. [...]"
  }
]