[
  {
    "source": "Decrypt",
    "date": "2023-09-13T02:52:14.000Z",
    "title": "Binance US CEO Brian Shroder Steps Down Amid Layoffs: Bloomberg",
    "url": "https://decrypt.co/156150/binance-us-ceo-brian-shroder-steps-down-amid-layoffs-bloomberg",
    "description": "Norman Reed, Chief Legal Officer of Binance US, will take the helm after the abrupt executive departure."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-13T03:00:53.000Z",
    "title": "XRP Could Gain By 2500% In 2024, Crypto Analyst Says",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-could-gain-by-2500-in-2024-crypto-analyst-says/",
    "description": "Prominent cryptocurrency XRP remains among the major talking points in crypto over the last few months. Following Ripple’s partial victory over the US Securities and Exchange Commission (SEC) in July, analysts have continued to weigh in on XRP’s future, mostly predicting a bullish price trajectory for the altcoin. In the latest development, a crypto analyst, EGRAG CRYPTO on X, predicts that XRP could be set for massive gains in 2024 based on historical price data.  Related Reading: Pro-XRP Lawyer John Deaton Reveals The Countries Topping The 75,000 Holder List XRP To Repeat Price Rally In 2024? According to an X post on September 12, EGRAG CRYPTO describes XRP as possessing “incredible potential.” Using data from the altcoin chart on Tradingview, the analyst projects a possible market gain of 2500% in 2024. EGRAG CRYPTO’s bullish prediction on XRP is based on the token’s price history. Between 2016 and 2018, XRP embarked on a strong bullish run upon forming a symmetrical triangle pattern, which appears again on the token&#8217;s monthly chart. For context, a symmetrical triangle chart pattern represents a period of consolidation that can result in either a price breakout or a breakdown. If the bullish prediction holds, the XRP token could experience a similar price breakout as in previous times. In line with EGRAG CRYPTO’s prediction, Sharon Thorp, a crypto analyst and business development executive at Wells Fargo, recently forecasted that XRP could trade at $500 in 2027.  This prediction is based on the anticipated growth of the cross-border payment industry, which is expected to reach $250 trillion in valuation by 2027. However, while these predictions may encourage the XRP community, they are individual speculations and should not be considered financial advice. Related Reading: Crypto Analyst Predicts Where Bitcoin Price Will Be By End Of Year Pain Before Gain? Although there may be a bullish sentiment towards XRP&#8217;s potential adoption in the coming years, some analysts believe the token could struggle in the remainder of 2023.  According to a recent X post by a pro-XRP analyst, Jungle Inc 2.0, the rest of 2023 does not bode well for XRP or the general crypto market. The crypto analyst hinges this prediction on “tough financial times” marked by increasing interest rates by the US Federal Reserve. Furthermore, investors should remember that Ripple remains in court with the SEC. The US securities watchdog recently submitted a petition urging the court to approve its request to appeal the recent ruling in its case against Ripple. At the time of writing, XRP trades at $0.4805, dipping by 4.32% in the last week. Meanwhile, the altcoin remains the fifth-largest cryptocurrency with a market cap value of $25.46 billion. XRP trading at $0.4830 on the hourly chart &#124; Source: XRPUSDT chart on Tradingview.com Featured image from CoinMarketCap, chart from Tradingview."
  }
]