[
  {
    "source": "CoinDesk",
    "date": "2024-02-15T08:30:00.000Z",
    "title": "Telefónica Teams Up With Chainlink to Provide Security Against 'SIM Swap' Hacks",
    "url": "https://www.coindesk.com/tech/2024/02/15/telefonica-teams-up-with-chainlink-to-provide-security-against-sim-swap-hacks/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The partnership will be a \"significant step\" in integrating telecom capabilities into the blockchain technology, the firms said."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-15T08:12:45.000Z",
    "title": " UK regulator issued 450 alerts for illegal crypto ads in 2023 ",
    "url": "https://cointelegraph.com/news/uk-illegal-crypto-ads-regulator-fca",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMDZjM2M1NmMtNDdiMy00ZjA2LWI5NDItOWQxMzZjMzcxNWJhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Financial Conduct Authority in the United Kingdom ordered the withdrawal or amendment of over 10,000 finance-related promotions in 2023. </p>\n                    <p><p data-ct-non-breakable=\"true\">The Financial Conduct Authority (FCA) — an independent financial regulatory body in the United Kingdom — has published a report detailing its actions against financial promotions, including its findings and actions against crypto-related advertisements.</p><p>On Feb. 14, the FCA <a href=\"https://www.fca.org.uk/data/financial-promotions-data-2023\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that it found “significant levels of non-compliance” on crypto promotion rules that <a href=\"https://www.fca.org.uk/publication/policy/ps23-6.pdf\" target=\"_blank\" rel=\"noopener nofollow\">came</a> into effect on Oct. 8, 2023. According to the regulator, i reviewed both registered and unregistered crypto firms and identified common issues. </p><p>This includes the use of generic risk summaries without any amendments for product-specific risks, such as stablecoins or asset-backed coins, and using the regulated status in a promotional manner. Furthermore, the FCA also said that firms are making claims about the safety, security and ease of use of crypto services without supporting evidence or highlighting risks. </p><p><a href=\"https://cointelegraph.com/news/uk-illegal-crypto-ads-regulator-fca\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T08:22:17.000Z",
    "title": "Biden’s ambassador choice for OECD to step back from crypto advisory",
    "url": "https://www.cryptopolitan.com/bidens-ambassador-choice-for-oecd-to-step-back-from-crypto-advisory/",
    "description": "Sean Patrick Maloney, a former member of the United States House of Representatives, has made a clear stance on his involvement with crypto-related issues upon his potential confirmation as a U.S. representative to the Organization for Economic Cooperation and Development (OECD). This move comes amid growing concerns over the influence of private sector interests in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T08:13:13.000Z",
    "title": "Blockchain Life 2024: The world’s leading crypto forum is back in Dubai",
    "url": "https://www.cryptopolitan.com/blockchain-life-2024-the-worlds-leading-crypto-forum-is-back-in-dubai/",
    "description": "The main event in the world of cryptocurrencies, mining, and web3 &#8211; Blockchain Life 2024 will take place in Dubai on October 22-23. It is expected that more than 8000 people from 140 countries will attend the forum &#8211; founders of the largest companies, industry leaders, and hundreds of young projects. Attendees will have the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-15T08:36:30.000Z",
    "title": "OFAC sanctions entities behind Iran’s digital currency program",
    "url": "https://crypto.news/ofac-sanctions-entities-behind-irans-digital-currency-program/",
    "description": "The U.S. Treasury sanctioned entities for illegally exporting technology to Iran, including one that developed Iran&#8217;s central bank digital currency platform. The Department of the Treasury&#8217;s Office of Foreign Assets Control (OFAC) said in a press release that on Feb.&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-15T08:21:34.000Z",
    "title": "Bitcoin Price Rally To $75,000 Imminent Due To Massive Cup And Handle Pattern",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-rally-75000-cup-handle-breakout/",
    "description": "Matt Dines, the Chief Investment Officer at Build Asset Management, has identified a classical &#8216;Cup and Handle&#8217; pattern in the Bitcoin (BTC) price chart, which he believes could signal an impending rally to $75,000. This technical formation is often considered a strong bullish signal and is closely watched by market analysts and traders. Bitcoin Price Validates Cup And Handle Pattern The &#8216;Cup&#8217; part of the pattern, resembling a bowl or rounding bottom, began forming in March 2022 when the price plunged below $48,000 and entered one of the longest Bitcoin bear markets. The pattern reached its lowest point at approximately $17,600, signifying a strong support level for Bitcoin. The left side of the pattern shows a rounded bottom resembling a &#8220;cup.” It forms when the price initially declines, then consolidates, and finally starts to rise again. Since hitting this bottom, Bitcoin&#8217;s price has made a steady recovery, mimicking the right side of the cup, indicating a bullish reversal of the previous downtrend. Related Reading: Bitcoin Price Breaks Past $51,500: 4 Key Reasons &#8220;The saucer or the &#8216;cup&#8217; signifies a consolidation period, a pause in the downward trend, before the price begins to rise back up to the test resistance levels,&#8221; Dines explained. The recovery to the initial resistance line completes the &#8216;cup&#8217; portion of the pattern. The Bitcoin price completed this step in early January this year. The subsequent &#8216;Handle&#8217; is represented by a moderate retracement following the recovery, which forms a small dip or pullback from the peak. This handle is identified by a slight downward trajectory and is considered the final consolidation before a breakout. BTC’s price drop to $38,600 at the end of January marked the bottom of the pullback. With the breakout above $48,000, the Bitcoin price validated the cup and handle pattern. Setting A BTC Price Target Dines also addressed the placement of the vertical projection from the bottom of the handle, clarifying its basis: &#8220;It’s totally arbitrary and in the eye of the beholder. But longer answer, traders are eyeing charts for formations.&#8221; The vertical target line, or the &#8216;stick&#8217; on the right, is projected from the bottom of the handle. The height of the cup — from the low at around $17,600 to the resistance line at $48,000— sets the stage for the price target. Related Reading: Bitcoin Open Interest Surges To A 2-Year High, BTC Breaks Above $51,000 Dines added, “A lot of traders will use the height of the bowl (from the low of the bowl to the top at the resistance line) to set their price target. Just add that height to the bottom of the handle … that’s a decent guesstimate for where we’d see the longs who entered on the breakthrough to set their price target.&#8221; Based on the chart, the height from the cup&#8217;s low to the resistance level is roughly $31,973, marking the increase in Bitcoin’s price from its lowest point to the current level when the chart was produced. Projecting this height from the handle&#8217;s formation suggests a target in the vicinity of $75,000. Dines further adds that the collective behavior of market participants will indeed guide the price movement: &#8221; A lot of those longs would set a retrace at ~$75k as they close out their W. If enough participants put this trade on it will set the dominant price action … they win out and it will turn the chart into reality. I know it sounds ridiculous, but in the real world this is how markets actually discover price.” At press time, BTC traded at $51,821. Featured image created with DALLE, chart from TradingView.com"
  }
]