[
  {
    "source": "Cointelegraph",
    "date": "2023-12-26T12:46:28.000Z",
    "title": " $3M of crypto stolen on Christmas Day — MS Drainer scammers fleece victims  ",
    "url": "https://cointelegraph.com/news/3m-of-crypto-stolen-christmas-day",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYTgyYzk0MGItZjkwZS00ODFjLTg4N2EtMjBhNzAzMjMyNzIyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Scammers continue to target unsuspecting cryptocurrency users with phishing sites using wallet drainers.  </p>\n                    <p><p>Scammers have stolen $3 million worth of cryptocurrencies in 24 hours as they continue to use Google Ads to advertise malicious fake websites that use wallet draining software.</p><p>As <a href=\"https://cointelegraph.com/news/ms-drainer-scammers-used-google-ads-swipe-59-million-crypto-scam-sniffer\">reported </a>by Cointelegraph on Dec. 21, scammers used MS Drainer to steal $59 million worth of cryptocurrency in 2023. According to Scam Sniffer, the attackers used Google Ads to trick crypto users into accessing fake versions of Web3 websites, including Zapper, Lido, Stargate, DefiLlama, Orbiter Finance and Radient.</p><p>The security firm flagged fresh incidents from phishing sites associated with the same attackers’ addresses in their scam database on Dec. 25.</p><p><a href=\"https://cointelegraph.com/news/3m-of-crypto-stolen-christmas-day\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T12:57:00.000Z",
    "title": "Elevate Your PS5 Experience with Must-Have Accessories",
    "url": "https://www.cryptopolitan.com/elevate-your-ps5-experience/",
    "description": "As the holiday season rolls on, PlayStation 5 owners are gearing up for the Boxing Day sales to enhance their gaming experience. While the PS5 is undoubtedly impressive, several accessories are available to take your gaming to the next level.&#160; Whether you&#8217;re looking for additional storage, improved controller options, or immersive audio, this article will [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T12:44:13.000Z",
    "title": "Neutron Protocol Team Tackles Vulnerability in Atomicals-js CLI",
    "url": "https://www.cryptopolitan.com/neutron-protocol-vulnerable-atomicals-js-cli/",
    "description": "In the dynamic and ever-evolving world of blockchain technology, maintaining the security and integrity of digital platforms is paramount. Recently, the Neutron Protocol team faced a significant challenge when they discovered a vulnerability in the Atomicals Protocol, specifically within the atomicals-js Command Line Interface (CLI) version 0.1.63. The discovery, made during an optimization process of [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-26T13:00:00.000Z",
    "title": "XRP bullish, investors turn to EOS and Rebel Satoshi ",
    "url": "https://crypto.news/xrp-bullish-investors-turn-to-eos-and-rebel-satoshi/",
    "description": "XRP, EOS, and Rebel Satoshi (RBLZ) are gaining traction, drawing investor attention"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-26T13:00:57.000Z",
    "title": "Ethereum: Balancing Act At $2,300 – Scaling The Heights Or Facing A Looming Drop?",
    "url": "https://www.newsbtc.com/news/ethereum-balancing-act-at-2300-scaling-the-heights-or-facing-a-looming-drop/",
    "description": "The past few weeks have been a rollercoaster ride for Ethereum. Buoyed by a waning Bitcoin dominance and an influx of traders seeking greener pastures, Ethereum&#8217;s price surged towards critical resistance levels near $2,500. Yet, a palpable anxiety lingers in the air, fueled by questions about Ethereum&#8217;s long-term scalability and the increasing chorus of bearish whispers. Can the second-largest crypto navigate this tightrope walk and reclaim its DeFi crown, or will it take a tumble from grace? Ethereum Rises: Growth, Innovations, And Challenges Beneath the surface of rising price charts lies a complex story of intertwined strengths and weaknesses. Ethereum&#8217;s impressive 87% year-on-year market cap surge, catapulting it from $140 billion to a hefty $267 billion, paints a picture of robust growth. Related Reading: Looking Deeper: Can ATOM Sustain Its 13% Surge Beyond The Network Buzz? The Merge upgrade, a landmark event streamlining Ethereum&#8217;s blockchain, and the burgeoning DeFi ecosystem pulsating with innovative applications are key contributors to this ascent. However, lurking beneath this facade is a critical bottleneck: Ethereum&#8217;s Layer 1 scalability limitations. The network&#8217;s notorious high transaction fees and sluggish throughput have become thorns in the side of DeFi expansion, frustrating both users and developers yearning for a smoother experience. As of writing, on this 26th of December, Ethereum&#8217;s price hovers around $2,233, painting the daily and weekly charts red with a dip of roughly 1.5%, data from Coingecko shows. This recent descent adds further intrigue to the complex dance Ethereum is performing near the critical $2,500 resistance level. This delicate dance between bullish aspiration and bearish pressure underscores the fragile equilibrium in the market. On one hand, the optimism surrounding Ethereum&#8217;s future potential continues to draw in traders. Ethereum currently trading at $2,230.5 territory. Chart: TradingView.com On the other hand, the specter of high transaction fees and scalability woes, alongside whispers of a potential bear market, keeps selling pressure simmering just below the surface. Ethereum At $2,300: Bulls&#8217; Battle, Bears&#8217; Threats For Ethereum bulls, the $2,300 level is a crucial battleground. If they can muster enough buy-side force to sustain a climb above this mark, it could pave the way for a surge towards the coveted $2,500 resistance level. This breakthrough would be a significant psychological victory, injecting fresh confidence into the market and potentially triggering a new upward trend phase. However, the bears are not out for the count. Their sights are set on breaching the $2,200 support level, which would solidify their grip and potentially trigger a more substantial decline. Should this scenario unfold, the $2,000 mark could come into play, with further losses possible if selling pressure remains unchecked. Adding to the intrigue is the factor of exchange supply. A recent increase in Ethereum tokens on exchanges indicates more readily available ETH for sellers, potentially amplifying downward pressure. This highlights the delicate balance between market sentiment and technical factors in determining Ethereum&#8217;s future trajectory. Meanwhile, the ETH traders&#8217; profit-taking is evident in the Network Realized Profit/Loss between October 31 and December 23. A significant amount of profit-taking may cause the price of ETH to decline. Ethereum&#8217;s Critical Crossroads Ahead Looking ahead, Ethereum&#8217;s path hinges on its ability to navigate this complex landscape. Addressing its scalability issues through Layer 2 solutions and potential future upgrades will be crucial for maintaining and expanding its DeFi dominance. Related Reading: NEAR: 3 Reasons This Crypto Is Up 80% While Others Hibernate In The Run-Up To 2024 Rekindling developer and user confidence by reducing transaction fees and improving network throughput is also paramount. Only by tackling these internal challenges and adapting to the ever-evolving crypto sphere can Ethereum truly reclaim its throne as the king of DeFi. The next few weeks are likely to be pivotal for Ethereum. Will it scale the $2,500 height and cement its position as a leader in the crypto revolution? Or will internal limitations and external pressures force it to face a precipitous drop? Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-26T12:45:51.000Z",
    "title": "Elon Musk’s Battle with SEC Reaches Apex as U.S. Supreme Court Steps In – Can Dogecoin Profit?",
    "url": "https://www.crypto-news-flash.com/elon-musks-battle-with-sec-reaches-apex-as-u-s-supreme-court-steps-in-can-dogecoin-profit/?utm_source=rss&utm_medium=rss&utm_campaign=elon-musks-battle-with-sec-reaches-apex-as-u-s-supreme-court-steps-in-can-dogecoin-profit",
    "description": "<img width=\"1920\" height=\"1189\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-300x186.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-1024x634.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-768x476.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-1536x951.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-163x102.jpg 163w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-24x15.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-48x30.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />The request by Elon Musk to annul the settlement with the US Securities and Exchange Commission catches the interest of the Supreme Court.  According to Musk and his attorneys, the initial agreement violated his freedom of speech and subjected him to frequent threats.  It can be recalled that Elon Musk conceded to the US Securities and [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-26T12:49:00.000Z",
    "title": "Binance Coin (BNB) Eyes $300 as Bullish Divergence Appears",
    "url": "https://coinedition.com/binance-coin-bnb-eyes-300-as-bullish-divergence-appears/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/BNB_Price_Dips_as_Bears_Take_Over_Amid_Uncertain_Market_Direction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BNB_Price_Dips_as_Bears_Take_Over_Amid_Uncertain_Market_Direction\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/BNB_Price_Dips_as_Bears_Take_Over_Amid_Uncertain_Market_Direction.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/BNB_Price_Dips_as_Bears_Take_Over_Amid_Uncertain_Market_Direction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/BNB_Price_Dips_as_Bears_Take_Over_Amid_Uncertain_Market_Direction-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/BNB_Price_Dips_as_Bears_Take_Over_Amid_Uncertain_Market_Direction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/BNB_Price_Dips_as_Bears_Take_Over_Amid_Uncertain_Market_Direction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/BNB_Price_Dips_as_Bears_Take_Over_Amid_Uncertain_Market_Direction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The price of Binance Coin (BNB) rose by 3.15% in the last 24 hours, and reached $280, CoinMarketCap data revealed. The performance made the coin the best-performing cryptocurrency out of the top 10 assets per market. During the same period, Bitcoin (BTC), Ethereum (ETH), and Solana (SOL) had slight slides in price. The move comes [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/binance-coin-bnb-eyes-300-as-bullish-divergence-appears/\">Binance Coin (BNB) Eyes $300 as Bullish Divergence Appears</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-26T12:45:44.000Z",
    "title": "Macro Guru Raoul Pal Predicts Ethereum Will Massively Outperform Bitcoin, Says ETH’s ‘Big Surprise’ Coming",
    "url": "https://dailyhodl.com/2023/12/26/macro-guru-raoul-pal-predicts-ethereum-will-massively-outperform-bitcoin-says-eths-big-surprise-coming/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/btc-eth-Exploded-200.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/btc-eth-Exploded-200.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/btc-eth-Exploded-200.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/btc-eth-Exploded-200.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/btc-eth-Exploded-200.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/btc-eth-Exploded-200.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/btc-eth-Exploded-200.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Former Goldman Sachs executive Raoul Pal believes that Ethereum (ETH) is poised to outperform Bitcoin (BTC) over the coming weeks and months as investors move their capital within the crypto markets to generate more gains. Pal tells the 21,300 subscribers of his YouTube channel that Ethereum will “massively outperform” Bitcoin just like how lower-rated junk [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/26/macro-guru-raoul-pal-predicts-ethereum-will-massively-outperform-bitcoin-says-eths-big-surprise-coming/\">Macro Guru Raoul Pal Predicts Ethereum Will Massively Outperform Bitcoin, Says ETH&#8217;s &#8216;Big Surprise&#8217; Coming</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]