[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-12T20:55:19.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-12T20:44:54.000Z",
    "title": "Brazil unleashes new crypto taxes",
    "url": "https://www.cryptopolitan.com/brazil-unleashes-new-crypto-taxes/",
    "description": "Brazilian legislators are making strides toward implementing new legislation that would heighten taxes on cryptocurrencies held outside the country. Reports from the nation indicate that a congressional committee has greenlit revisions to a bill that formally designates cryptocurrencies as &#8220;financial assets&#8221; for taxation purposes in the context of overseas investments. Furthermore, this proposed bill seeks ... <a title=\"Brazil unleashes new crypto taxes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/brazil-unleashes-new-crypto-taxes/\" aria-label=\"More on Brazil unleashes new crypto taxes\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-12T20:43:25.000Z",
    "title": "RippleX advances XRP Ledger evolution with XLS-30d AMM protocol",
    "url": "https://www.cryptopolitan.com/ripplex-advances-xrp-ledger-evolution-with-xls-30d-amm-protocol/",
    "description": "The XRP Ledger development and support team, RippleX, has unveiled updates regarding the progress of the XLS-30d protocol. This groundbreaking initiative aims to extend Automated Market Maker (AMM) capabilities to the XRP Ledger, introducing an intriguing blend of order book-based DEX with a protocol-native AMM. Last year, RippleX introduced the XLS-30d technical standard, paving the ... <a title=\"RippleX advances XRP Ledger evolution with XLS-30d AMM protocol\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripplex-advances-xrp-ledger-evolution-with-xls-30d-amm-protocol/\" aria-label=\"More on RippleX advances XRP Ledger evolution with XLS-30d AMM protocol\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-12T21:00:58.000Z",
    "title": "More Selling? Bankrupt Voyager Sends Millions In SHIB And ETH To Coinbase",
    "url": "https://www.newsbtc.com/news/ethereum/voyager-sends-shib-eth-to-coinbase/",
    "description": "Voyager Digital has been busy in recent months as it looks to sell its remaining crypto holdings on centralized exchanges. In its latest move, the bankrupt crypto brokerage has transferred millions in SHIB and ETH to Coinbase. According to on-chain data, Voyager moved SHIB and ETH tokens to Coinbase&#8217;s ledger on Friday, August 11. Millions In SHIB And ETH Transferred To Coinbase By Voyager Voyager has been selling off assets since the beginning of the year. Specifically, the latest on-chain transactions show that Voyager moved a total of $5.5 million in crypto to Coinbase. The transactions consisted of 1,500 ETH sent in two transactions.  Related Reading: Did XRP Price Really Hit $50 On Gemini Exchange? Before being moved to Coinbase, 1,000 ETH and 500 ETH, with a combined value of $2.77 million, were sent to separate wallets. Another 250 billion SHIB valued at $2.7 million was then sent to Coinbase.  On-chain data also shows that Voyager has been moving all its token holdings to its primary address. This likely means the company is consolidating its crypto assets before moving them to crypto exchanges. Bankrupt crypto firm Voyager transferred 1,500 ETH ($2.77 million) and 250 billion SHIB ($2.7 million) to Coinbase. Additionally, Voyager is moving all remaining tokens to the main address. There are currently about $81.63 million worth of cryptocurrency in Voyager addresses.… — Wu Blockchain (@WuBlockchain) August 12, 2023 Looking To Pay Pack Customers Voyager’s goal is to eventually reimburse all customer accounts, at least partially. The firm went bankrupt last year after the failure of crypto hedge fund Three Arrows Capital which failed to repay its $665 million Voyager loan. The company, however, received court approval in May 2023 to begin winding down its operations and start repaying customers a portion of their crypto assets that’s been locked for over a year. According to court filings, Voyager had only about $630 million to pay back $1.8 billion in customer claims. As a result, Voyager users could only claim 35.72% of their tokens. They could either withdraw their claims immediately or choose to wait for 30 days to be paid in USD after Voyager sells the tokens.  VGX prices tanks as bankruptcy proceedings continue &#124; Source: VGXUSDT on Tradingview.com  At the time, data from Arkham Intelligence showed that Voyager had $268 million in ETH, $236 million in USDC, and $77 million in SHIB. But now that the time for customer claims is over, Voyager seems to be consolidating its remaining assets into one address before selling them. According to Arkham Intel, there is currently about $81.63 million worth of cryptocurrency left in Voyager addresses. What This Means For SHIB And ETH Prices The recent transfers of millions of dollars in SHIB and ETH tokens from Voyager Digital to Coinbase could signal selling pressure is on the way for the two cryptocurrencies. If Coinbase unloads these tokens onto the open market, it may drive prices down further as supply outpaces demand.  Related Reading: San Francisco’s SoFi Bank Reveals Significant Holdings In BTC, ETH, And DOGE SHIB is currently on a roll and is up by 15.55% in a 7-day timeframe. ETH, on the other hand, is currently ranging around $1,850 after the ETH ecosystem reached a milestone recently with the number of non-zero addresses reaching a new all-time high. Featured image from Currency.com, chart from Tradingview.com"
  }
]