[
  {
    "source": "Decrypt",
    "date": "2023-12-27T19:02:52.000Z",
    "title": "OpenAI Trained AI Models on Copyrighted Work, Says NYT Lawsuit",
    "url": "https://decrypt.co/211006/openai-trained-ai-models-on-copyrighted-work-says-nyt-lawsuit",
    "description": "Current methods for training AI on copyrighted work means “less journalism will be produced, and the cost to society will be enormous,” says the NYT."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-27T18:58:45.000Z",
    "title": " Price analysis 12/27: BTC, ETH, SOL, BNB, XRP, ADA, AVAX, DOGE, DOT, MATIC ",
    "url": "https://cointelegraph.com/news/price-analysis-12-27-btc-eth-sol-bnb-xrp-ada-avax-doge-dot-matic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMjdkY2I2NjMtZjAyNC00NjE4LWE5NzctNjM4M2MyODE5NzM1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin is forming a bullish pattern, but the RSI shows a negative divergence, giving conflicting signals about the next directional move in the near term.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has been hanging on to the gains made in early December, indicating that every minor dip is being purchased. CoinShares data shows that <a href=\"https://cointelegraph.com/news/crypto-investment-products-103-million-weekly-inflows-coinshares\">Bitcoin funds witnessed an inflow</a> of $87.6 million in the week ending Dec. 22. </p><p>Separately, data from exchange-traded funds (ETFs) research firm ETFGI shows $1.31 billion of inflows into crypto ETFs and exchange-traded products (ETPs) in November, bringing the <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-inflows-dwarf-150-crypto-etp-today\">total inflows for the year to $1.60 billion</a>.</p><p>Investors seem to be accumulating Bitcoin before the anticipated approval of a spot Bitcoin ETF in January. Business Intelligence firm <a href=\"https://cointelegraph.com/news/microstrategy-14620-bitcoins-december-2023\">MicroStrategy added 14,620 Bitcoin</a> to increase its total stockpile to 189,150 Bitcoin. The latest acquisition was made at $42,110 per Bitcoin, taking its total average purchase price to about $31,168.</p><p><a href=\"https://cointelegraph.com/news/price-analysis-12-27-btc-eth-sol-bnb-xrp-ada-avax-doge-dot-matic\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-27T19:00:46.000Z",
    "title": "South Korean public officials will disclose crypto holdings in new registry",
    "url": "https://cryptoslate.com/south-korean-public-officials-will-disclose-crypto-holdings-in-new-registry/",
    "description": "<p>The South Korean government announced today that it will implement a unified public official asset disclosure service, marking a significant development by including the registration of cryptocurrency holdings from next year. The Ministry of Personnel Management announced the move in a press release on Dec. 27. One-stop access Currently, asset disclosure for public officials in [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/south-korean-public-officials-will-disclose-crypto-holdings-in-new-registry/\">South Korean public officials will disclose crypto holdings in new registry</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T19:00:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T18:48:17.000Z",
    "title": "Robert Kiyosaki shares tips on how to accumulate wealth",
    "url": "https://www.cryptopolitan.com/robert-kiyosaki-shares-accumulate-wealth/",
    "description": "Renowned author Robert Kiyosaki, co-author of the bestselling book “Rich Dad Poor Dad,” recently shared insights on his wealth-building strategies. Notably, he emphasized the significance of the Vancouver Resource Investment Conference (VRIC), scheduled for Jan. 20-21, where he is slated to be a keynote speaker. Robert Kiyosaki, whose book has sold over 32 million copies [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-27T19:00:11.000Z",
    "title": "Crypto hedge funds have rallied in Q4",
    "url": "https://crypto.news/crypto-hedge-funds-have-rallied-in-q4/",
    "description": "Cryptocurrency hedge funds are making a significant comeback after suffering massive setbacks in 2022. "
  },
  {
    "source": "BTCManager",
    "date": "2023-12-27T18:52:10.000Z",
    "title": "Solana’s road to next all-time high: analyst explains",
    "url": "https://crypto.news/solanas-road-to-next-all-time-high-analyst-explains/",
    "description": "Both the bullish and bearish outlooks are still net positive overall according to the analyst, with an eventual fifth Elliot wave expected to take Solana to new highs."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-27T19:00:42.000Z",
    "title": "Major Acquisition: MicroStrategy Grows Bitcoin Reserves By 14K BTC Ahead Of ETF Approval",
    "url": "https://www.newsbtc.com/bitcoin-news/major-acquisition-microstrategy-grows-bitcoin-reserves-by-14k-btc-ahead-of-etf-approval/",
    "description": "MicroStrategy (MSTR), a prominent Bitcoin holding company, has once again expanded its BTC holdings with a substantial purchase of 14,620 Bitcoin, amounting to a staggering $615.7 million.  The former CEO of the American business intelligence (BI) firm announced the acquisition, highlighting the company&#8217;s continued confidence in Bitcoin&#8217;s long-term potential.  With the potential approval of Bitcoin spot exchange-traded funds (ETFs) on the horizon, MicroStrategy aims to capitalize on the positive impact on BTC&#8217;s price and the company&#8217;s profitability in the leading cryptocurrency market. MicroStrategy Stock Skyrockets 337% According to a CNBC report, MicroStrategy&#8217;s stock has experienced a remarkable 337% surge in 2023, making it one of the top gainers among US companies valued at $5 billion or more.  This success surpasses the rallies of industry giants like Nvidia and Meta. Unlike its tech peers, MicroStrategy&#8217;s appeal to investors stems primarily from its Bitcoin holdings.  Related Reading: Bitcoin Grabs 14th Spot As World’s Most Valued Currency, Latest Data Show MicroStrategy&#8217;s market capitalization currently stands at $8.5 billion, with a staggering 90% directly tied to its Bitcoin holdings. The company&#8217;s stock price closely mirrors the performance of Bitcoin, with significant fluctuations in response to the cryptocurrency&#8217;s price movements.  Per the report, in 2022, when Bitcoin experienced a 64% decline, MicroStrategy&#8217;s stock plummeted by 74%. Despite the substantial gains achieved this year, MicroStrategy shares are still below their peak levels in 2021, during the cryptocurrency&#8217;s peak. Michael Saylor&#8217;s Vision MicroStrategy&#8217;s decision to invest in Bitcoin dates back to July 2020, when the company recognized the potential of alternative assets, including digital currencies.  At that time, MicroStrategy had a market capitalization of around $1.1 billion, primarily driven by its software business, which has been shrinking since 2015. Co-founder Michael Saylor, who was CEO then, saw an opportunity to put the company&#8217;s idle cash reserves to work, considering low interest rates and the need for diversification. Saylor&#8217;s conviction in Bitcoin as a digital form of gold led MicroStrategy to prioritize Bitcoin purchases over equities and precious metals. This strategic move exposed investors to Bitcoin indirectly through MicroStrategy&#8217;s stock.  Saylor, who transitioned to executive chairman, remains optimistic about Bitcoin&#8217;s future, expecting the bull market to continue into the next year. Despite its growing popularity, Saylor emphasized that Bitcoin still represents only a fraction of global capital allocation, with ample room for further growth. Related Reading: Crypto Trading Firm Expects Bitcoin To Crash To $36,000, Here’s Why As of December 27, 2023, MicroStrategy&#8217;s latest purchase adds to its already impressive Bitcoin portfolio, bringing the total holdings to 189,150 BTC.  The company has invested approximately $5.9 billion, with an average purchase price of $31,168 per Bitcoin. These strategic acquisitions position MicroStrategy as a major player in the crypto space, aligning its interests with the anticipated growth and adoption of Bitcoin. The current market data shows that Bitcoin is trading at $42,900, reflecting a marginal 0.5% increase over the past 24 hours. The cryptocurrency briefly dipped below its critical support level of $42,000 but has since regained its position. The market is anticipating the potential approval of the Bitcoin Spot ETF applications between January 5 and 10, 2024.  This development holds significant promise for Bitcoin, as it could drive the cryptocurrency&#8217;s price well beyond $50,000, establishing a new yearly high and edging closer to its historical peak. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-27T19:07:39.000Z",
    "title": "Year-End Rush: SEC Demands Fixes for Bitcoin ETF Applicants",
    "url": "https://www.crypto-news-flash.com/year-end-rush-sec-demands-fixes-for-bitcoin-etf-applicants/?utm_source=rss&utm_medium=rss&utm_campaign=year-end-rush-sec-demands-fixes-for-bitcoin-etf-applicants",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Mark-Van-Scyoc-SEC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Telegram Gram SEC\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Mark-Van-Scyoc-SEC.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Mark-Van-Scyoc-SEC-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Mark-Van-Scyoc-SEC-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Mark-Van-Scyoc-SEC-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />U.S. SEC officials discuss spot bitcoin ETFs with companies like BlackRock and Grayscale, with a January 10, 2024, decision looming. The SEC sets a December 29 deadline for final proposal changes, potentially excluding those who miss it from early ETF approvals. Recently, the U.S. Securities and Exchange Commission (SEC) held talks with representatives of seven [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-27T19:05:13.000Z",
    "title": "Bitcoin Could Hit $1,000,000 a Coin by 2029, Says Chamber of Digital Commerce CEO – Here’s Why",
    "url": "https://dailyhodl.com/2023/12/27/bitcoin-could-hit-1000000-a-coin-by-2029-says-chamber-of-digital-commerce-ceo-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/BTC-Forming-Bearish-Reversal.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/BTC-Forming-Bearish-Reversal.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/BTC-Forming-Bearish-Reversal.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/BTC-Forming-Bearish-Reversal.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/BTC-Forming-Bearish-Reversal.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/BTC-Forming-Bearish-Reversal.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/BTC-Forming-Bearish-Reversal.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The chief executive of the Chamber of Digital Commerce says that Bitcoin (BTC) could hit a seven-figure price tag by 2029 if adoption continues at the current rate. In a new interview on CNBC Television, Perianne Boring, the crypto advocacy group’s founder and CEO, says that BTC&#8217;s fair value price is likely already somewhere between [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/27/bitcoin-could-hit-1000000-a-coin-by-2029-says-chamber-of-digital-commerce-ceo-heres-why/\">Bitcoin Could Hit $1,000,000 a Coin by 2029, Says Chamber of Digital Commerce CEO – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]