[
  {
    "source": "Decrypt",
    "date": "2023-10-25T19:27:51.000Z",
    "title": "Are You Playing Starfield? Over 11 Million Gamers Are, Says Microsoft CEO",
    "url": "https://decrypt.co/203299/starfield-11-million-players-best-selling-game-microsoft",
    "description": "The first new universe for Bethesda in 25 years was the top-selling video game last month."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-25T19:35:50.000Z",
    "title": "Bitcoin price chases after $35K as BTC derivatives data signals fresh inflow",
    "url": "http://cointelegraph.com/news/bitcoin-price-chases-35-k-btc-derivatives-signals-fresh-inflow",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/31672cae-62d3-4bc9-9cb9-3e1cedbd9fbf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin options and futures data suggests the current BTC price movement could have longevity. </p>\n                    <p><p>Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price action is the talk of the town this week and based on the current sentiment expressed by market participants on social media, one could almost assume that the long-awaited bull market has started. </p><p>As Bitcoin's price rallied by 16.1% between Oct. 22 and Oct. 24, bearish traders using futures contracts found themselves liquidated to the tune of $230 million. One data point that stands out is the change in Bitcoin's open interest, a metric reflecting the total number of futures contracts in play. </p><p>The evidence suggests that Bitcoin shorts were taken by surprise on Oct. 22 but they were not employing excessive leverage.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/6e52e5ae-4180-4550-80da-3d15c8160ad8.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin futures aggregate open interest, USD. Source: Coinglass</em></figcaption></figure><p>During the rally, BTC futures open interest increased from $13.1 billion to $14 billion. This differs from August 17, when Bitcoin's price dropped by 9.2% in just 36 hours. That sudden movement caused $416 million in long liquidations, despite the lower percentage-size price move. At the time, Bitcoin's futures open interest decreased from $12 billion to $11.3 billion.</p><p>Data seems to corroborate the gamma squeeze theory that is circulating, which implies that market makers had their stop losses \"chased.\"</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> &quot;god candle&quot; lines up with where dealers got blown out of short positioning ($32k-$33k).<br><br>This was a gamma squeeze, not organic. <a href=\"https://t.co/NXM8z8mNDa\">pic.twitter.com/NXM8z8mNDa</a></p>&mdash; Not Tiger Global  (@NotChaseColeman) <a href=\"https://twitter.com/NotChaseColeman/status/1716610437070856610?ref_src=twsrc%5Etfw\">October 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Bitcoin personality NotChaseColeman explained on X social network (formerly Twitter), that arbitrage desks were likely forced to hedge short positions after Bitcoin broke above $32,000, triggering the rally to $35,195. </p><p>The most significant issue with the short squeeze theory is the increase in BTC futures open interest. This indicates that even if there were relevant liquidations, the demand for new leveraged positions outpaced the forced closures.</p><h2>Did Changpeng Zhao and BNB play a role in Bitcoin's price action?</h2><p>Another interesting theory from user M4573RCH on X social network claims that Changpeng \"CZ\" Zhao used <a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a> as collateral for margin on Venus Protocol, a decentralized finance (DeFi) application after being forced to sell Bitcoin to \"shore up\" the price of BNB token.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">maybe im nuts but what we just saw is<br><br>cz has BNB collateral on Venus <br><br>bnb dumping<br><br>cz sells btc to shore up bnb <br><br>cz unwinds loans and pays back debt on Venus<br><br>bnb on venus no longet vulnerable to liquidation<br><br>cz buys back btc with bnb to rebalance his btc position<a href=\"https://twitter.com/cz_binance?ref_src=twsrc%5Etfw\">@cz_binance</a>… <a href=\"https://t.co/NHulDnacB3\">pic.twitter.com/NHulDnacB3</a></p>&mdash; ⚡️ (@M4573RCH) <a href=\"https://twitter.com/M4573RCH/status/1717011294480707791?ref_src=twsrc%5Etfw\">October 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to M4573RCH's theory, after a successful intervention, CZ would have paid back the interest on Venus Protocol and bought back Bitcoin using BNB to \"rebalance\" the position.</p><p>Notably, the BNB supply on the platform exceeds 1.2 million tokens, worth $278 million. Thus, assuming that 50% of the position is controlled by a single entity, that's enough to create a $695 million long position using 5x leverage on Bitcoin futures.</p><p>Of course, one will never be able to confirm or dismiss speculations such as the Venus-BNB manipulation or the \"gamma squeeze\" in Bitcoin derivatives. Both theories make sense, but it is impossible to assert the entities involved or the rationale behind the timing.</p><p>The increase in BTC futures open interest indicates that new leveraged positions have entered the space. The movement could have been driven by news that BlackRock's spot Bitcoin ETF request was l<a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-nasdaq-clearing-firm\">isted on the Depository Trust &amp; Clearing Corporation (DTCC)</a>, even though this event does not increase the odds of approval by the U.S. Securities and Exchange Commission.</p><h2>Bitcoin derivatives point to a healthy bull run and room for further gains</h2><p>To understand how professional traders are positioned after the surprise rally, one should analyze the BTC derivatives metrics. Normally, Bitcoin monthly futures trade at a 5% to 10% annualized premium compared to spot markets, indicating that sellers demand additional money to postpone settlement.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/7138e3dc-e928-4f5f-a769-df9e4a8ff199.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 1-month futures premium. Source: Laevitas.ch</em></figcaption></figure><p>The Bitcoin futures premium reached 9.5% on Oct. 24, marking the highest level in over a year. More notably, it broke above the 5% neutral threshold on Oct. 23, putting an end to a 9-week period dominated by bearish sentiment and low demand for leveraged long positions.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-45000-year-end-matrixport-predicts\"><strong><em>Matrixport doubles down on $45K Bitcoin year-end prediction</em></strong></a></p><p>To assess whether the break above $34,000 has led to excessive optimism, traders should examine the <a href=\"https://cointelegraph.com/news/3-major-mistakes-to-avoid-when-trading-crypto-futures-and-options\">Bitcoin options markets</a>. When traders anticipate a drop in Bitcoin's price, the delta 25% skew tends to rise above 7%, while periods of excitement typically see it dip below negative 7%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/088c5b90-e178-4ded-8c4c-1d196860aac7.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 30-day options 25% delta skew. Source: Laevitas.ch</em></figcaption></figure><p>The Bitcoin options' 25% delta skew shifted from neutral to bullish on Oct. 19 and continued in this direction until it reached -18% on Oct. 22. This signaled extreme optimism, with put (sell) options trading at a discount. The current -7% level suggests a somewhat balanced demand between call (buy) and put options.</p><p>Whatever triggered the surprise price rally prompted professional traders to move away from a period characterized by pessimism. However, it wasn't enough to justify excessive pricing for call options, which is a positive sign. Furthermore, there is no indication of excessive leverage from buyers, as the futures premium remains at a modest 8%.</p><p>Despite the ongoing speculation regarding the <a href=\"https://cointelegraph.com/news/galaxy-digital-soaring-bitcoin-price-increase-after-etf-launch\">approval of a spot Bitcoin ETF</a>, there is enough evidence to support a healthy influx of funds, justifying a rally beyond the $35,000 mark.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-25T19:34:39.000Z",
    "title": "FTX and Alameda linked wallets transfer $10M of crypto to exchanges in just 5 hours",
    "url": "http://cointelegraph.com/news/ftx-alameda-linked-wallets-transfer-10-million-worth-crypto-exchanges-5-hours",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/166e9969-9e2c-40b4-9192-ddab42ef5b5b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to Spot On Chain data, the firms sent $10 million worth of crypto to a single wallet address, which then deposited the funds to Binance and Coinbase.</p>\n                    <p><p>Wallets linked to bankrupt crypto firms Alameda Research and FTX <a href=\"https://platform.spotonchain.ai/profile?address=0xde9A61c2b776e2F4C6ddB0C9Ad5cCfCfC15B0a9B\" target=\"_blank\" rel=\"noopener nofollow\">transferred</a> over $10 million worth of cryptocurrency to exchange deposit accounts in five hours on October 24-25, according to data from blockchain analytics platform Spot On Chain. The movement of these funds may indicate that the firms plan to sell some assets to pay back creditors.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> <a href=\"https://twitter.com/hashtag/FTX?src=hash&amp;ref_src=twsrc%5Etfw\">#FTX</a> and <a href=\"https://twitter.com/hashtag/Alameda?src=hash&amp;ref_src=twsrc%5Etfw\">#Alameda</a> related addresses are depositing tokens to exchanges!<br><br>Via address 0xde9, <a href=\"https://twitter.com/hashtag/FTX?src=hash&amp;ref_src=twsrc%5Etfw\">#FTX</a> 0x97f and <a href=\"https://twitter.com/hashtag/Alameda?src=hash&amp;ref_src=twsrc%5Etfw\">#Alameda</a> 0xf02 have transferred <br><br>2,904 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> ($5.21M)<br>1,341 <a href=\"https://twitter.com/search?q=%24MKR&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$MKR</a> ($2.01M)<br>11,975 <a href=\"https://twitter.com/search?q=%24AAVE&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$AAVE</a> ($1.02M)<br>198,807 <a href=\"https://twitter.com/search?q=%24LINK&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$LINK</a> ($2.27M) <br><br>to <a href=\"https://twitter.com/hashtag/Binance?src=hash&amp;ref_src=twsrc%5Etfw\">#Binance</a> and <a href=\"https://twitter.com/hashtag/Coinbase?src=hash&amp;ref_src=twsrc%5Etfw\">#Coinbase</a> in the past 5 hours.… <a href=\"https://t.co/MQxCySp8g0\">pic.twitter.com/MQxCySp8g0</a></p>&mdash; Spot On Chain (@spotonchain) <a href=\"https://twitter.com/spotonchain/status/1717004746043830470?ref_src=twsrc%5Etfw\">October 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to Spot on Chain data, an address listed as “likely” belonging to FTX transferred 2,904 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), worth over $5 million at the time, to address 0xde9a61c2b776e2f4c6ddb0c9ad5ccfcfc15b0a9b at 8:18 pm UTC on October 24. This address sent $3.4 million of the funds to a Binance deposit address and $1.8 million to a Coinbase deposit address. Thirty-nine minutes later, a wallet identified as belonging to Alameda Research sent $95 worth of tokens to this address, including some Chainlink (<a href=\"https://cointelegraph.com/chainlink-price-index\">LINK</a>), MakerDAO (MKR), and Aave (<a href=\"https://cointelegraph.com/aave-price-index\">AAVE</a>) tokens.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-testify-criminal-trial\"><strong>FTX’s Sam Bankman-Fried will testify at criminal trial, say defense lawyers</strong></a></em></p><p>Over the next five hours, an additional $5 million worth of cryptocurrency was sent into this address by FTX and Alameda wallets, including some Compound (COMP) and Render (RNDR) tokens. At approximately 2:00 am UTC on October 25, this address sent approximately $2 million worth of LINK, $2 million worth of MKR, and $1 million worth of AAVE to a Binance deposit address. The total value of cryptocurrency sent to exchange deposit addresses during this period was $10,362,403, according to Spot on Chain data.</p><p>On September 13, a Delaware Bankruptcy Court approved a plan to <a href=\"https://cointelegraph.com/news/court-approves-sale-ftx-digital-assets\">liquidate $3.4 billion worth of crypto assets</a> that FTX and Alameda Research held. The announcement sparked fears that liquidating such a large amount of crypto may cause a slump in the market. However, experts have argued that the gradual, phased nature of the liquidation <a href=\"https://cointelegraph.com/news/court-approves-sale-ftx-digital-assets\">should limit its influence on the market</a>.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-25T19:10:56.000Z",
    "title": "Ethereum dominance against Bitcoin takes sharp dive",
    "url": "https://cryptoslate.com/insights/ethereum-bitcoin-ratio-inches-closer-to-0-05/",
    "description": "<p>Quick Take The evolving dynamics in the cryptocurrency market are clearly reflected in the Ethereum-Bitcoin ratio, which is inching closer to 0.05, a level not seen since mid-2021. Ethereum&#8217;s (ETH) position against Bitcoin (BTC) has been in a steady decline. Notably, it was above 0.07 in early 2023, but the persistent momentum has significantly impacted [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/ethereum-bitcoin-ratio-inches-closer-to-0-05/\">Ethereum dominance against Bitcoin takes sharp dive</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-25T19:12:43.000Z",
    "title": "AI skill threat concerns developers; urge nurturing culture, continuous learning",
    "url": "https://www.cryptopolitan.com/ai-skill-threat-concerns-developers/",
    "description": "A recent report by Pluralsight, a leading technology workforce development company, has highlighted concerns within the software development community regarding the potential threat posed by AI-assisted coding. According to the report, approximately 45% of developers surveyed showcased signs of anxiety and apprehension about the possibility of their skillsets becoming obsolete due to the increasing integration ... <a title=\"AI skill threat concerns developers; urge nurturing culture, continuous learning\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-skill-threat-concerns-developers/\" aria-label=\"More on AI skill threat concerns developers; urge nurturing culture, continuous learning\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-25T19:39:11.000Z",
    "title": "Game studio Neon Machine secures $20m in funding round led by Polychain",
    "url": "https://crypto.news/game-studio-neon-machine-secures-20m-in-funding-round-led-by-polychain/",
    "description": "Seattle’s Neon Machine has secured $20 million in Series A funding, led by Polychain Capital, to advance development of its blockchain-integrated shooter game, \"Shrapnel.\""
  },
  {
    "source": "BTCManager",
    "date": "2023-10-25T19:20:11.000Z",
    "title": "USDT’s Market Cap Soars Beyond $84b Amid Positive Crypto Market Sentiments",
    "url": "https://crypto.news/usdts-market-cap-soars-beyond-84b-amid-positive-crypto-market-sentiments/",
    "description": "USDT's market capitalization reaches a record $84 billion as the crypto rallies."
  }
]