[
  {
    "source": "Cointelegraph",
    "date": "2023-08-09T04:03:45.000Z",
    "title": "Cardano DEX MuesliSwap to refund users after slippage confusion",
    "url": "https://cointelegraph.com/news/cardano-dex-muesliswap-refund-users-high-slippage",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/b19fbcc9-0e57-487e-9df7-2b5ba34cd0df.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The MuesliSwap team wants to refund users that have lost funds to high slippage due to the way the DEX’s matchmaker was set up. </p>\n                    <p><p>The team behind the Cardano-based decentralized exchange MuesliSwap has made a decision to refund users that have been hit with high slippage over the past year.</p><p>On Aug. 8, the MuseliSwap team said it “fell short in providing adequate clarity” on the slippage feature within its protocol.</p><p><a href=\"https://cointelegraph.com/learn/crypto-trading-basics-a-beginners-guide-to-cryptocurrency-order-types\">Slippage</a> is the price difference between when a transaction is submitted and when the transaction is confirmed on the blockchain.</p><p>MuesliSwap users have been paying high slippage for at least a year due to the way the decentralized matchmaker was set up, the team explained. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Important Announcement!  At MuesliSwap, transparency and user education are paramount. We recognize that we fell short in providing adequate clarity on the slippage feature within the MuesliSwap Pool DEX protocol. Our decentralized matchmaker setup allowed each matchmaker to…</p>&mdash; MuesliSwap Team (@MuesliSwapTeam) <a href=\"https://twitter.com/MuesliSwapTeam/status/1688654897938395137?ref_src=twsrc%5Etfw\">August 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Matchmakers — which scan for buy and sell orders to match up and fulfill — were able to “fill the limit order and choose whether to return the additional slippage amount or retain the difference at their discretion,” MuesliSwap noted.</p><p>The slippage difference was an incentive for decentralized matchmakers, it added, but this caused confusion for users. </p><blockquote>“To make amends, we will be refunding affected users who encountered high slippage on the MuesliSwap pools in the last 12 months from our project funds.”</blockquote><p>Additionally, immediate action has been taken to remedy the slippage issue in the MuesliSwap order book, it added.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/dex-aggregators-the-ultimate-solution-to-reduce-price-slippage-in-defi\"><strong><em>DEX aggregators: The ultimate solution to reduce price slippage in DeFi</em></strong></a></p><p>Users have been highlighting slippage issues on all Cardano DEXes. On Aug. 4, one trader <a href=\"https://twitter.com/ShillMoBaggins/status/1687454442054901763\" target=\"_blank\" rel=\"noopener nofollow\">said</a>: </p><blockquote>“Currently completing a LARGE trade on any CARDANO DEX is subject to HUGE slippage which diminishes trader's value by a large percentage.”</blockquote><p>They claimed MuesliSwap was supposedly working on a DEX aggregator to split large trades and limit losses due to slippage.</p><p>MuesliSwap is the fifth largest protocol on Cardano with a total value locked of $17.3 million, according to <a href=\"https://defillama.com/protocol/muesliswap\" target=\"_blank\" rel=\"noopener nofollow\">DeFiLlama</a>. However, MuesliSwap TVL has tanked 27% since the beginning of the month and is down 68% since its all-time high in April 2022.</p><p>In December, <a href=\"https://cointelegraph.com/news/cardano-s-muesliswap-introduces-organic-apr-drawing-praise-criticism\">MuesliSwap launched</a> an “organic APR” feature which increased token emissions as more liquidity went into pools as a way to incentivize users to add collateral.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\">Deposit risk: What do crypto exchanges really do with your money?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-09T04:00:52.000Z",
    "title": "Bitcoin circling the $30,000 mark nine months ahead of next halving",
    "url": "https://cryptoslate.com/insights/bitcoin-circling-the-30000-mark-nine-months-ahead-of-next-halving/",
    "description": "<p>Quick Take A notable lack of volatility marks Bitcoin&#8217;s current cycle, as the leading cryptocurrency meanders below the $30,000 mark. In this phase, even minor price dips spur expectations of more significant falls, again bringing previous support levels into focus. However, investor optimism seems to emerge when it inches upwards, sparking calls for a breach [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-circling-the-30000-mark-nine-months-ahead-of-next-halving/\">Bitcoin circling the $30,000 mark nine months ahead of next halving</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-09T03:50:09.000Z",
    "title": "Indian authorities arrest ringleaders of $120M crypto scam",
    "url": "https://cryptoslate.com/indian-authorities-arrest-ringleaders-of-120m-crypto-scam/",
    "description": "<p>Authorities in India have apprehended the perpetrators behind a multi-million dollar cryptocurrency Ponzi scheme, as reported by The Indian Express on Aug. 8. The fraud involved a cryptocurrency project known as STA Crypto Token, which purported to leverage solar technologies and blockchain technology. According to the latest reports, the scam succeeded in stealing Rs 1,000 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/indian-authorities-arrest-ringleaders-of-120m-crypto-scam/\">Indian authorities arrest ringleaders of $120M crypto scam</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-09T04:00:55.000Z",
    "title": "Record-Breaking $10 Billion Open Interest Fuels Bullish Speculation For Bitcoin Reversal",
    "url": "https://www.newsbtc.com/bitcoin-news/record-breaking-10-billion-open-interest-fuels-bullish-speculation-for-bitcoin-reversal/",
    "description": "The cryptocurrency market has experienced a period of stagnation, with Bitcoin (BTC) trading within a narrow range for the past week.  However, according to market analyst Ali Martinez, there is a glimmer of hope on the horizon as Open Interest, a key indicator of market sentiment, has skyrocketed to a year-to-date high. Correlation Between Open Interest And Bitcoin Notably, the correlation between Open Interest and Bitcoin’s price has historically been significant, suggesting that this surge may herald a potential reversal in the leading cryptocurrency&#8217;s fortunes.  Martinez believes the recent dip to $28,700 prompted crypto traders to take long positions, fueling optimism for a Bitcoin resurgence. Over the past week, the overall crypto market has experienced a period of stagnation, with Bitcoin trading within a tight range of $28,900 to $29,200.  This consolidation follows a continuous decline from its yearly high of $31,800, which has also set the tone for other major cryptocurrencies. The lack of significant price movement has left investors and traders eager for a catalyst that could propel the market forward. Related Reading: Is Curve DAO (CRV) Price On Track To Reach Or Exceed $1 This Month? Nevertheless, the number of open long and short positions on crypto derivative exchanges has surged to a remarkable year-to-date high of $10.086 billion. This surge in Open Interest is significant, indicating heightened market activity and trader engagement. One crucial aspect to consider is the historical correlation between Open Interest and the price of Bitcoin. This relationship has often been strong, with Open Interest as a leading indicator for potential price movements. As Open Interest reaches new highs, it suggests that market participants are actively taking positions in anticipation of a significant market shift. While the crypto market has been characterized by stagnation and decline in recent times, the surge in Open Interest to a yearly high provides hope for a bullish reversal.  Bearish Divergence Signals Potential Pullback For BTC Bitcoin has recently exhibited some intriguing patterns that warrant attention from both technical analysis and on-chain analysis perspectives.  According to Baro Virtual, CryptoQuant author and analyst, a bearish divergence on the BTC Average Return Index suggests a possible pullback to $26,000.  Simultaneously, on-chain analysis indicates a weakening return index performance alongside a rising Bitcoin price, potentially signaling a phase of re-accumulation that may benefit investors seeking lower prices.  The transition of the return index into the negative zone suggests a shift in market sentiment towards re-accumulation.  Related Reading: Terra Luna Token Burn Proposal Greenlit – Could $1 Be Hittable? Re-accumulation typically occurs when long-term investors or institutions acquire Bitcoin at lower prices, anticipating future price appreciation. This behavior can be seen as a positive sign for the market&#8217;s long-term health, reflecting increased interest from strategic investors. As of the current update, BTC has broken out of its range which has persisted since the beginning of August. It is trading at $29,600, reflecting a 2.5% increase over the past 24 hours. However, the upward price movement of BTC in the short term may not be sustained unless accompanied by substantial trading volume. Several significant resistance levels lie ahead, posing challenges for BTC&#8217;s attempt to reclaim the $30,000 milestone. To begin with, the $29,700 zone presents a formidable barrier, followed by subsequent resistance walls at $30,000, $30,700, $31,200, and $31,500. In the short and mid-term, BTC, the largest cryptocurrency in the market, will need a compelling catalyst to push beyond these levels. Without such, a retracement is possible in the coming weeks.  Featured image from iStock, chart from TradingView.com"
  }
]