[
  {
    "source": "Decrypt",
    "date": "2023-08-19T11:01:02.000Z",
    "title": "Crypto's Oldest Use Case Is Back in the Spotlight. But Why Now?",
    "url": "https://decrypt.co/152936/cryptos-oldest-use-case-is-back-spotlight-why-now",
    "description": "Tokenization is back in a big way."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-19T11:00:31.000Z",
    "title": "52 Years of Fiat: The economic legacy of abandoning the gold standard",
    "url": "https://cryptoslate.com/market-reports/52-years-of-fiat-the-legacy-of-abandoning-the-gold-standard/",
    "description": "<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/market-reports/52-years-of-fiat-the-legacy-of-abandoning-the-gold-standard/\">52 Years of Fiat: The economic legacy of abandoning the gold standard</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NullTX",
    "date": "2023-08-19T10:42:31.000Z",
    "title": "The Crypto Market Just Recorded The Biggest Liquidation Since The FTX Exchange Blowup",
    "url": "https://nulltx.com/the-crypto-market-just-recorded-the-biggest-liquidation-since-the-ftx-exchange-blowup/",
    "description": "The recent sharp decline in Bitcoin&#8217;s price from $29k to $25k within 24 hours has sent shockwaves through the cryptocurrency market. This significant drop has resulted in the liquidation of 174,892 traders, amounting to a staggering $1.04 billion in total liquidations.  Biggest Liquidation Since FTX Collapse Long positions totaling $843.83 million and short positions worth [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-19T10:56:30.000Z",
    "title": "Account abstraction will reinvent fintech industry | Opinion",
    "url": "https://crypto.news/account-abstraction-will-reinvent-fintech-industry-opinion/",
    "description": "Our traditional financial industry, despite its tenacity and resilience, is beginning to show its age. The challenges that plague this sector, including its highly centralized nature, exorbitant transaction costs, and inefficient settlement times, underscore the need for transformation. It is&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-19T10:55:51.000Z",
    "title": "Solo Climber: The Lone Crypto Surging 11% In Top 100 Roster On A Weekend",
    "url": "https://www.newsbtc.com/all/solo-climber-the-lone-crypto-surging-11-in-top-100-roster-on-a-weekend/",
    "description": "Injective (INJ) has defied the prevailing downward trend to secure significant gains. While most crypto assets experienced losses, INJ has emerged as the sole gainer among the top 100 cryptocurrencies. The cryptocurrency&#8217;s price climb comes as a welcome relief to investors navigating the tumultuous waters of the market. As the cryptocurrency market grapples with a bearish start to the day, Injective (INJ) stands out with a remarkable performance. With a 10.7% rally in the past 24 hours and seven-day gains of 2.0%, INJ has managed to buck the trend and secure positive momentum.  Crypto market analysts and enthusiasts are keeping a close eye on INJ&#8217;s price movement, eager to see if it can maintain its upward trajectory. INJ price action on a weekend. Source: Coingecko A Bright Spot In A Sea Of Red Market data from CoinGecko reports INJ&#8217;s current price at $7.82. A price analysis reveals that the cryptocurrency&#8217;s potential breakthrough of the $7.96 resistance level could trigger further upward movement, potentially setting the stage for a test of the next resistance at $8.50. Related Reading: Litecoin Price Plunges To Sub-$70 Territory – What Traders Should Expect However, should the bulls fail to breach this critical level, a period of consolidation or a minor correction might be on the horizon for the crypto. The technical analysis of INJ augments the optimistic outlook for the coin. TA indicators signal a bullish sentiment, with oscillators positioned at a &#8216;neutral&#8217; level and moving averages aligned towards a &#8216;buy&#8217; recommendation.  Injective (INJ) registers a weekend market cap of $659 million. Chart: TradingView.com Injective (INJ): A Closer Look  This alignment of technical indicators suggests that INJ&#8217;s current performance is underpinned by robust market dynamics, reinforcing the notion of a potential sustained upward movement. What adds more intrigue to INJ&#8217;s ascent is its well-timed tokenomics upgrade. The rise in INJ&#8217;s value aligns closely with the blockchain company&#8217;s release of a major tokenomics overhaul. This upgrade includes a mechanism that increases the weekly burn rate of INJ through the Injective Token Burn Auction, effectively reducing the overall supply.  INJ seven-day price action on a weekend. Source: Coingecko Additionally, the company has eliminated the limits on how much decentralized apps (dApps) can burn from their transaction fees. This move could potentially enhance the scarcity of INJ and contribute to its current price surge. Related Reading: PEPE Coin Could Take The Spotlight After Shibarium Debut – Here’s Why Amidst a market dominated by red, Injective shines as a beacon of positivity. Its remarkable gains, coupled with a bullish technical analysis and a well-timed tokenomics upgrade, have contributed to its standout performance.  As investors and analysts continue to monitor the market, INJ&#8217;s trajectory will be a focal point, revealing whether it can sustain its momentum and potentially pave the way for a trend reversal in the broader cryptocurrency landscape. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from National Geographic/Jimmy Chin"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-19T10:51:00.000Z",
    "title": "Shiba Inu: Shibarium Scales Operations by 1500% in Alliance with Alchemy",
    "url": "https://coinedition.com/shiba-inu-shibarium-scales-operations-by-1500-in-alliance-with-alchemy/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shibarium Scales Operations\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Shibarium-Scales-Operations-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent update, the Shiba Inu team informed the community about the progress the development team has made so far in scaling Shibarium. The Shiba Inu team shared the update with the Shiba Inu community via their official X account. Recall that Coin Edition reported Shibarium encountered severe technical issues just hours after launch. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/shiba-inu-shibarium-scales-operations-by-1500-in-alliance-with-alchemy/\">Shiba Inu: Shibarium Scales Operations by 1500% in Alliance with Alchemy</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]