[
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T08:14:47.000Z",
    "title": "Kraken experiencing gateway issues — withdrawals, deposits delayed",
    "url": "https://cointelegraph.com/news/kraken-deposit-withdrawal-delays-crypto-gateway-issues",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/6b9b0c50-039e-4155-80a2-06c436b268a0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Major crypto exchange Kraken is investigating an issue with crypto funding gateways, including BTC, ETH, and ERC-20, with users experiencing delays in deposits and withdrawals.</p>\n                    <p><p>Cryptocurrency exchange Kraken says it is currently investigating an issue with several crypto funding gateways, including major ones such as Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) and ERC-20. </p><p>On June 6, Kraken’s <a href=\"https://status.kraken.com/\" target=\"_blank\" rel=\"noopener nofollow\">status</a> page said, “Deposits and withdrawals are currently delayed. We will provide any updates as soon as possible.” </p><p>The first notice was posted around 7:44 am UTC, followed by two updates saying it continues to “work on a fix” for the issue. The status page did not make it clear what was causing the problem. </p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-06T08:33:41.000Z",
    "title": "OKX Partners with Komainu, Enabling 24/7 Secure Trading of Segregated Assets Under Custody for Institutions",
    "url": "https://cryptodaily.co.uk/2023/06/okx-partners-with-komainu-enabling-247-secure-trading-of-segregated-assets-under-custody-for-institutions",
    "description": "<p>ST HELLIER, Jersey, June 6th, 2023, Chainwire</p><p>OKX, the world&rsquo;s second-largest cryptocurrency exchange by trading volume and a leading Web3 technology company, and regulated digital asset custody service provider Komainu, today announced that OKX has joined collateral management platform Komainu Connect, enabling institutional customers to conduct secure 24/7 trading of segregated assets under custody through the OKX platform.</p><p>Launched in April of 2023, Komainu Connect reduces client counterparty risk by removing the need to store collateral with trading counterparties, and offering the ability to keep assets in safe custody instead.&nbsp;</p>Nicolas Bertrand, CEO at Komainu, said: &ldquo;This strategic partnership marks a milestone in our mission to provide secure and compliant digital asset custody solutions. OKX's reputation as a leading cryptocurrency exchange, combined with our expertise in institutional-grade custody services is paving the way for a new era of trust and innovation in the industry.&rdquo;Sebastian Widmann, Head of Strategy at Komainu, said: &ldquo;Komainu Connect is rapidly emerging as the leading collateral management solution. Partnering with one of the world&rsquo;s largest crypto exchanges is a testament to the infrastructure and expertise committed to this service and our focus remains on seamless execution for all parties.&rdquo;Lennix Lai, Global Chief Commercial Officer at OKX, said: &ldquo;Institutions need the peace of mind that comes with knowing their assets are being kept safe with a leading custodian, while retaining their ability to capitalize when investment opportunities arise. That is why we are delighted to partner with Komainu to allow investors a way to keep their assets secure while not compromising on returns.&rdquo;<p>The off-exchange settlement and tripartite mirroring solution is a significant step forward for large-scale institutional crypto traders requiring immediate access to OKX's market-leading portfolio margin account mode and liquid markets.</p><p>Komainu was established in 2018 to provide institutions with a secure and compliant custody service for investment in digital assets. Launched in June 2020, Komainu currently custodies assets for exchanges, financial institutions, asset managers, corporations, and government agencies.</p><p>Find out more about why institutions choose OKX here.</p><p>About OKX</p><p>OKX is a world-leading technology company building the future of Web3. Known as the most reliable crypto trading platform for traders, OKX&rsquo;s crypto exchange is the second largest globally by trading volume.</p><p>OKX&rsquo;s leading self-custody solutions include the Web3-compatible OKX Wallet, which allows users greater control of their assets while expanding access to DEXs, NFT marketplaces, DeFi, GameFi and thousands of dApps.</p><p>OKX partners with a number of the world&rsquo;s top brands and athletes, including English Premier League champions Manchester City F.C., McLaren Formula 1, The Tribeca Festival, golfer Ian Poulter, Olympian Scotty James, and F1 driver Daniel Ricciardo.</p><p>OKX is committed to transparency and security and publishes its Proof of Reserves on a monthly basis.</p><p>To learn more about OKX, download OKX's app or visit: okx.com</p><p>About Komainu</p><p>Komainu is a regulated digital asset custodian built by institutions for institutions and created as a joint venture between Nomura, digital asset manager CoinShares, and digital asset security company Ledger. Offering multi-asset support with regulatory compliance, Komainu is merging traditional financial services with leading security standards for the next generation of institutional custody. Headquartered in Jersey and with offices in London, Dublin, Dubai, and Singapore, Komainu is regulated by the Jersey Financial Services Commission (JFSC) and Dubai Virtual Assets Regulatory Authority (VARA). For more information, visit https://www.komainu.com</p><p>Media Contact: Armel Leslie, Peaks Strategies, +1 (914) 320-7620, aleslie@peaksstrategies.com&nbsp;</p><p>DISCLAIMER</p><p>This announcement is provided for informational purposes only. It is not intended to provide any investment, tax, or legal advice, nor should it be considered an offer to purchase, sell, or hold digital assets. Digital assets, including stablecoins, involve a high degree of risk, can fluctuate greatly, and can even become worthless. You should carefully consider whether trading or holding digital assets is suitable for you in light of your financial condition. Please consult your legal/tax/investment professional for questions about your specific circumstances.</p><p></p>ContactMediaOKXmedia@okx.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T08:30:39.000Z",
    "title": "OKX Partners with Komainu, Enabling 24/7 Secure Trading of Segregated Assets Under Custody for Institutions",
    "url": "https://www.cryptopolitan.com/okx-partners-with-komainu-enabling-24-7-secure-trading-of-segregated-assets-under-custody-for-institutions/",
    "description": "ST HELLIER, Jersey, June 6th, 2023, Chainwire OKX, the world’s second-largest cryptocurrency exchange by trading volume and a leading Web3 technology company, and regulated digital asset custody service provider Komainu, today announced that OKX has joined collateral management platform Komainu Connect, enabling institutional customers to conduct secure 24/7 trading of segregated assets under custody through ... <a title=\"OKX Partners with Komainu, Enabling 24/7 Secure Trading of Segregated Assets Under Custody for Institutions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/okx-partners-with-komainu-enabling-24-7-secure-trading-of-segregated-assets-under-custody-for-institutions/\" aria-label=\"More on OKX Partners with Komainu, Enabling 24/7 Secure Trading of Segregated Assets Under Custody for Institutions\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-06T08:12:29.000Z",
    "title": "Motley Fool Calls Crypto “Future of Money”",
    "url": "https://nulltx.com/motley-fool-calls-crypto-future-of-money/",
    "description": "UK investment experts, The Motley Fool, have described crypto as the “future of money.” With the blockchain world diversifying and proliferating, many investors are coming to the same conclusion and increasingly putting their money into new crypto investments. One of the most revolutionary and exciting new crypto investments is Chancer, a pioneering blockchain project established [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-06T08:39:02.000Z",
    "title": "Bitcoin Devs Target Meme Coin Market: Is the End Near for Shiba Inu, Pepe, and Others in the $500M Market?",
    "url": "https://www.crypto-news-flash.com/bitcoin-devs-target-meme-coin-market-is-the-end-near-for-shiba-inu-pepe-and-others-in-the-500m-market/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-devs-target-meme-coin-market-is-the-end-near-for-shiba-inu-pepe-and-others-in-the-500m-market",
    "description": "<p>Bitcoin developers are targeting the meme coin market with the rise of BRC-20 tokens. The popularity of Shiba Inu and PEPE is now threatened by the NFTs on the Bitcoin blockchain. While the original PEPE Coin is an Ethereum-based ERC-20 coin, other blockchains have gradually stepped up to offer alternative solutions and capture a share [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/bitcoin-devs-target-meme-coin-market-is-the-end-near-for-shiba-inu-pepe-and-others-in-the-500m-market/\">Bitcoin Devs Target Meme Coin Market: Is the End Near for Shiba Inu, Pepe, and Others in the $500M Market?</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-06T08:38:47.000Z",
    "title": "Ripple and Stellar Shine as Crunchfish CEO Reveals Collaboration with Central Banks, Spotlight on Offline Payments Solutions – BIS Partnership Adds to the Momentum",
    "url": "https://www.crypto-news-flash.com/ripple-and-stellar-shine-as-crunchfish-ceo-reveals-collaboration-with-central-banks-spotlight-on-offline-payments-solutions-bis-partnership-adds-to-the-momentum/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-and-stellar-shine-as-crunchfish-ceo-reveals-collaboration-with-central-banks-spotlight-on-offline-payments-solutions-bis-partnership-adds-to-the-momentum",
    "description": "<p>Crunchfish&#8217;s Digital Cash platform offers offline payment capabilities that enhance payment services&#8217; robustness in case of connectivity or server outages. Crunchfish Digital Cash enhances all types of payments while supporting different payment systems including Instant, EMV, CBDC, and cryptocurrency, and can be used for both online and offline transactions. Central banks across the world have [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/ripple-and-stellar-shine-as-crunchfish-ceo-reveals-collaboration-with-central-banks-spotlight-on-offline-payments-solutions-bis-partnership-adds-to-the-momentum/\">Ripple and Stellar Shine as Crunchfish CEO Reveals Collaboration with Central Banks, Spotlight on Offline Payments Solutions &#8211; BIS Partnership Adds to the Momentum</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-06T08:30:06.000Z",
    "title": "Cryptocurrency News: Shiba Inu, Polkadot, Collateral Network Are the Next Cryptos to Pump",
    "url": "https://www.crypto-news-flash.com/cryptocurrency-news-shiba-inu-polkadot-collateral-network-are-the-next-cryptos-to-pump/?utm_source=rss&utm_medium=rss&utm_campaign=cryptocurrency-news-shiba-inu-polkadot-collateral-network-are-the-next-cryptos-to-pump",
    "description": "<p>From meme coins to mainstream cryptocurrency, the crypto market is full of opportunities for diligent investors. However, the threat of a downturn still looms large amid economic uncertainty and the debt ceiling crisis.  If you want to future-proof your portfolio, you may want to check out the following sections to find out why Collateral Network [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/cryptocurrency-news-shiba-inu-polkadot-collateral-network-are-the-next-cryptos-to-pump/\">Cryptocurrency News: Shiba Inu, Polkadot, Collateral Network Are the Next Cryptos to Pump</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-06T08:29:59.000Z",
    "title": "OKX Partners with Komainu, Enabling 24/7 Secure Trading of Segregated Assets Under Custody for Institutions",
    "url": "https://www.crypto-news-flash.com/okx-partners-with-komainu-enabling-24-7-secure-trading-of-segregated-assets-under-custody-for-institutions/?utm_source=rss&utm_medium=rss&utm_campaign=okx-partners-with-komainu-enabling-24-7-secure-trading-of-segregated-assets-under-custody-for-institutions",
    "description": "<p>ST HELLIER, Jersey, June 6th, 2023, Chainwire OKX, the world’s second-largest cryptocurrency exchange by trading volume and a leading Web3 technology company, and regulated digital asset custody service provider Komainu, today announced that OKX has joined collateral management platform Komainu Connect, enabling institutional customers to conduct secure 24/7 trading of segregated assets under custody through [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/okx-partners-with-komainu-enabling-24-7-secure-trading-of-segregated-assets-under-custody-for-institutions/\">OKX Partners with Komainu, Enabling 24/7 Secure Trading of Segregated Assets Under Custody for Institutions</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-06T08:20:39.000Z",
    "title": "Whale’s Mighty Blow: Ethereum Altcoin Sent Crashing as Massive Sell-Off Unleashes – Is This the Investment Opportunity of a Lifetime? Report",
    "url": "https://www.crypto-news-flash.com/whales-mighty-blow-ethereum-altcoin-sent-crashing-as-massive-sell-off-unleashes-is-this-the-investment-opportunity-of-a-lifetime-report/?utm_source=rss&utm_medium=rss&utm_campaign=whales-mighty-blow-ethereum-altcoin-sent-crashing-as-massive-sell-off-unleashes-is-this-the-investment-opportunity-of-a-lifetime-report",
    "description": "<p>A large whale has disposed of the Ethereum-based altcoin The Graph sending bearish concerns to investors holding the altcoin. Some investors are eyeing an opportunity to buy and reinvest in the altcoin ahead of another potential surge. Crypto analytics platform Santiment has highlighted a major move by a whale invested in Ethereum-based altcoin The Graph [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/whales-mighty-blow-ethereum-altcoin-sent-crashing-as-massive-sell-off-unleashes-is-this-the-investment-opportunity-of-a-lifetime-report/\">Whale&#8217;s Mighty Blow: Ethereum Altcoin Sent Crashing as Massive Sell-Off Unleashes &#8211; Is This the Investment Opportunity of a Lifetime? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-06T08:25:40.000Z",
    "title": "The Downtrend of Cronos in the First Quarter of 2023",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-downtrend-of-cronos-in-the-first-quarter-of-2023/",
    "description": "<p>The popular altcoin, Cronos (CRO), had been falling for three consecutive months. Despite a significant distance from the legendary $1 target, investors researching altcoin opportunities should consider this cryptocurrency. That&#8217;s why Cronos on-chain data suggest that unrealized losses could be prompting the investors to wait. The Rising Average Coin Age is a significant indicator of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-downtrend-of-cronos-in-the-first-quarter-of-2023/\">The Downtrend of Cronos in the First Quarter of 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-06T08:27:00.000Z",
    "title": "Popular Trader Is Bullish on ADA, MANA, COTI, and Several Others",
    "url": "https://coinedition.com/popular-trader-is-bullish-on-ada-mana-coti-and-several-others/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/I-am-so-bullish-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/I-am-so-bullish-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/I-am-so-bullish-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/I-am-so-bullish-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/I-am-so-bullish-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/I-am-so-bullish-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/I-am-so-bullish.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The renowned crypto trader and analyst Dan Gambardello named the handful of cryptos he is very bullish on in a tweet published earlier today. His tweet followed the market-wide selloff that took place in the past 24 hours — resulting in the majority of the crypto market trading in the red today. CoinMarketCap indicated at [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/popular-trader-is-bullish-on-ada-mana-coti-and-several-others/\">Popular Trader Is Bullish on ADA, MANA, COTI, and Several Others</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]