[
  {
    "source": "Cointelegraph",
    "date": "2024-01-24T05:32:39.000Z",
    "title": " Geth Ethereum network share falls 5% after fears raised of ‘black swan event’ ",
    "url": "https://cointelegraph.com/news/geth-ethereum-network-share-falls-after-centralization-fears-raised",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNmUyYmMyNGQtOGEwZi00ODdjLWJhOGEtMGU2NDExMzM0Yjg3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Geth’s concentrated use is a risk as the majority of Ethereum validators could lose their staked Ether if it has a critical bug, claims one Ethereum diversity advocate.</p>\n                    <p><p>Ethereum execution client Geth has seen its market share fall after community members raised concerns over the network’s diversity, fearing Geth’s concentration could lead to a “black swan event.”</p><p>On Jan. 23, Geth’s market share of the Ethereum network execution clients fell 5.2% to 78.8% after reaching 84% the day prior.</p><p>Geth is critical in handling transactions and executing smart contracts on Ethereum, but its preference among Ethereum validators has led to an imbalance in execution client diversity on Ethereum, sparking centralization concerns.</p><p><a href=\"https://cointelegraph.com/news/geth-ethereum-network-share-falls-after-centralization-fears-raised\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-24T05:38:26.000Z",
    "title": "BNB Price Could See Major Drawdown If It Fails To Stay Above This Support",
    "url": "https://www.newsbtc.com/analysis/bnb/bnb-price-could-see-major-drawdown-290/",
    "description": "BNB price started a fresh decline from $320 resistance zone. The price is now retesting the $290 support and is at risk of more downsides. BNB price is gaining bearish momentum from the $320 resistance. The price is now trading below $310 and the 100 simple moving average (4 hours). There was a break below a key bullish trend line with support at $315 on the 4-hour chart of the BNB/USD pair (data source from Binance). The pair might continue to move down if it fails to stay above the $290 support. BNB Price Takes Hit In the past few days, BNB price made more than three attempts to clear the $320 resistance zone. However, the bears remained active and protected more gains. As a result, there was a bearish reaction below the $315 level, like Bitcoin and Ethereum. There was a break below a key bullish trend line with support at $315 on the 4-hour chart of the BNB/USD pair. The pair even declined below the $300 level and tested the key support at $290. A low is formed near $290.3, and the price is now struggling to correct higher. BNB price is now trading below $310 and the 100 simple moving average (4 hours). Immediate resistance is near the $298 level or the 23.6% Fib retracement level of the recent decline from the $320 swing high to the $290 low. Source: BNBUSD on TradingView.com The next resistance sits near the $305 level. It is close to the 50% Fib retracement level of the recent decline from the $320 swing high to the $290 low. A clear move above the $305 zone could send the price further higher. In the stated case, BNB price could test $320. A close above the $320 resistance might set the pace for a larger increase toward the $335 resistance. Any more gains might call for a test of the $350 level. More Downsides? If BNB fails to clear the $305 resistance, it could continue to move down. Initial support on the downside is near the $290 level. The next major support is near the $285 level. The main support sits at $272. If there is a downside break below the $272 support, the price could drop toward the $250 support. Any more losses could initiate a larger decline toward the $220 level. Technical Indicators 4-Hours MACD – The MACD for BNB/USD is gaining pace in the bearish zone. 4-Hours RSI (Relative Strength Index) – The RSI for BNB/USD is currently below the 50 level. Major Support Levels – $290, $285, and $272. Major Resistance Levels – $298, $305, and $320."
  }
]