[
  {
    "source": "CoinDesk",
    "date": "2024-02-19T07:20:49.000Z",
    "title": "Sui Overtakes Aptos, Cardano in Value Locked; Sees $310M Inflow in 30 Days",
    "url": "https://www.coindesk.com/business/2024/02/19/sui-overtakes-aptos-cardano-in-value-locked-sees-310m-inflow-in-30-days/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Sui, the layer 1 blockchain built by a group of former Meta (META) employees, has experienced a cascade of inflows this month in a spike that has seen it overtake Cardano, Near and Aptos in terms of total value locked (TVL)."
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-19T07:15:52.000Z",
    "title": "Cathie Wood’s ARK Offloads $90M Coinbase Shares Amid Slew of Analyst Upgrades",
    "url": "https://www.coindesk.com/business/2024/02/19/cathie-woods-ark-offloads-90m-coinbase-shares-amid-slew-of-analyst-upgrades/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "ARK offloaded Coinbase shares from ARK Innovation ETF,  ARK Next Generation Internet ETF, and ARK Fintech Innovation ETF."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-19T07:33:57.000Z",
    "title": "Grayscale’s spot Bitcoin ETF GBTC outflows hit $7b",
    "url": "https://crypto.news/grayscales-spot-bitcoin-etf-gbtc-outflows-hit-7b/",
    "description": "Crypto asset manager Grayscale continues to see a slowdown in outflows from its Bitcoin (BTC) spot exchange-traded fund (ETF). In a Feb. 19 post on X, co-founder of ETF Institute Nate Geraci reported that the total outflow of funds from&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-19T07:16:24.000Z",
    "title": "South Korea considers further delay in crypto taxation ahead of general election",
    "url": "https://crypto.news/south-korea-considers-further-delay-in-crypto-taxation-ahead-of-general-election/",
    "description": "South Korea&#8217;s ruling People Power Party is proposing another delay in the implementation of cryptocurrency investment gains taxation, now potentially extending the start date to 2027. The move is part of the party&#8217;s campaign strategy for the forthcoming general election&#8230;"
  }
]