[
  {
    "source": "Cryptopolitan",
    "date": "2023-10-28T12:05:15.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? The live Solana price today is $32.33, with a 24-hour trading volume of $228,434,886 USD. We update our SOL to USD price in real-time. Solana is down 0.27% in the last 24 hours. The current CoinMarketCap ranking is #9, with a live market cap of $7,901,314,034. ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-28T11:57:01.000Z",
    "title": "Analyst Forecasts Chainlink (LINK) To Fall Below $10 Following Massive Price Surge",
    "url": "https://www.newsbtc.com/news/chainlink/analyst-forecasts-chainlink-link-to-fall-below-10-following-massive-price-surge/",
    "description": "Chainlink (LINK) has emerged as one of the top cryptocurrencies in the last week following an impressive market performance which saw the token gain by 46.49% in the past seven days. Even amidst whale movements, which suggest that investors are taking profit, LINK has managed to maintain its bullish momentum, gaining by 6.10% in the last day to above the $11 mark. However, despite the positive sentiment that has currently overwhelmed the LINK market, some analysts believe the token may be due for a major retracement.  Related Reading: Chainlink (LINK) Surge Far From Done As Crypto Analyst Predicts Rise To $15 LINK To Fall Below $10: Is The Bullish Run Over? In a post on X on Friday, crypto analyst Altcoin Sherpa shared a prediction that LINK may soon experience a price dip, falling as low as $9.50.  However, Altcoin Sherpa notes that this potential price loss may not spell the end of LINK’s bullish phase. In fact, the analyst describes the token’s price coming down as “healthy.”  According to Sherpa’s prediction, LINK’s slide below $10 could simply be a price recorrection before the token resumes its upward trajectory. If this forecast proves true, many traders could view this $9.50 region as a great entry zone. Interestingly, Cryptonary, another analyst on X, has recently shared a similar price prediction. In a post on Thursday, Cryptonary called for much caution in the LINK market, stating the crypto asset may not sustain its current high price levels for long.  To back up this forecast, the analyst states the Relative Strength Index (RSI) shows that Chainlink is currently in the overbought zone, which indicates a price pullback lies on the horizon. Although many traders have opened long positions on LINK as indicated by the market&#8217;s positive funding rates, Cryptonary has advised investors against “joining the crowd” Similar to Altcoin Sherpa, the analyst predicts LINK’s price to fall to $9.67 for a short-term retracement. However, with strong selling pressure, Cryptonary states that LINK could trade as low as $8.  At the time of writing, LINK trades around $11.54 with a 0.25% gain on the last day. Meanwhile, the token’s trading volume is up by 8.01% and valued at $824.92 million.  Related Reading: Chainlink MVRV Enters Bearish Zone As LINK Breaks $10, Correction Soon? Chainlink Records Partnership Streak In other news, Chainlink recently shared with the crypto community its streak of collaborations with major traditional brands in promoting the adoption of blockchain technology. #Chainlink is collaborating with key players across the global economy: 1. Swift—Standard messaging network for 11K+ banks 2. DTCC—World’s largest securities settlement system, processing $2+ quadrillion annually 3. ANZ—Leading Australian bank with $1T+ in AUM 4. Vodafone… — Chainlink (@chainlink) October 27, 2023 In a thread posted on X on Friday, the blockchain highlighted its partnership with the Swift payment company aimed at facilitating the seamless transfer of tokenized assets across multiple chains using Chainlink’s Cross Chain Interoperability Protocol  (CCIP).  In addition to Swift, Chainlink also discussed its partnership with the Depository Trust and Clearing Corporation, the Australia and New Zealand Banking Group Limited, and Vodafone Digital Asset Breaker (DAB). LINK trading at $11.569 on the daily chart &#124; Source: LINKUSDT chart on Tradingview.com Featured image from iStock, chart from Tradingview"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-28T11:41:00.000Z",
    "title": "‘Rich Dad Poor Dad’ Author Alleges FTX Founder of Fooling Investors ",
    "url": "https://coinedition.com/rich-dad-poor-dad-author-alleges-ftx-founder-of-fooling-investors/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/FTX-CEO-Misleading-Public.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"‘Rich Dad Poor Dad’ Author Alleges FTX Founder of Fooling Investors \" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/FTX-CEO-Misleading-Public.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/FTX-CEO-Misleading-Public-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/FTX-CEO-Misleading-Public-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/FTX-CEO-Misleading-Public-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/FTX-CEO-Misleading-Public-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/FTX-CEO-Misleading-Public-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Robert Kiyosaki lambasts Fed Chair and Treasury Secretary, alleging they have been fooling the world. Kiyosaki questions the financial incompetency of the authority, warning them to get away from the public’s money. The investor also alleged Bankman-Fried of fooling Shark Tank fame Kevin O’Leary, and CNBC’s Jim Kramer. In a surprising revelation, Japanese-American investor Robert [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/rich-dad-poor-dad-author-alleges-ftx-founder-of-fooling-investors/\">‘Rich Dad Poor Dad’ Author Alleges FTX Founder of Fooling Investors </a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-28T11:45:59.000Z",
    "title": "Over 50% of Millennials and Gen Z Likely To Support Crypto-Friendly Candidates in the 2024 US Election: Coinbase",
    "url": "https://dailyhodl.com/2023/10/28/over-50-of-millennials-and-gen-z-likely-to-support-crypto-friendly-candidates-in-the-2024-us-election-coinbase/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/Gen-Z-Likely-To.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/Gen-Z-Likely-To.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/Gen-Z-Likely-To.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/Gen-Z-Likely-To.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/Gen-Z-Likely-To.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/Gen-Z-Likely-To.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/Gen-Z-Likely-To.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Leading crypto exchange Coinbase says that over 50% of Americans born between 1981 and 2012 will likely back candidates in next year&#8217;s US election who support digital assets. In a new blog post, Coinbase says that recent surveys conducted with research firm Bovitz, Inc. show a large percentage of America’s Millennials and Gen Zers want their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/28/over-50-of-millennials-and-gen-z-likely-to-support-crypto-friendly-candidates-in-the-2024-us-election-coinbase/\">Over 50% of Millennials and Gen Z Likely To Support Crypto-Friendly Candidates in the 2024 US Election: Coinbase</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]