[
  {
    "source": "Bitcoin.com",
    "date": "2024-01-27T02:00:16.000Z",
    "title": "SEC Delays Spot Ethereum ETF Decisions",
    "url": "https://news.bitcoin.com/sec-delays-spot-ethereum-etf-decisions/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-delays-eth-etf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC Delays Spot Ethereum ETF Decisions\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-delays-eth-etf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-delays-eth-etf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-delays-eth-etf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-delays-eth-etf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-delays-eth-etf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-delays-eth-etf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-delays-eth-etf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Securities and Exchange Commission (SEC) has delayed its decisions on spot ethereum exchange-traded funds (ETFs) proposed by Blackrock, the world&#8217;s largest asset manager, and Grayscale Investments. Grayscale is seeking to convert its existing Ethereum Trust into a spot ETF. Spot Ethereum ETF Decisions Delayed by SEC This week, the U.S. Securities and Exchange [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-27T02:00:10.000Z",
    "title": "Ethereum Faces Market Tremors As Celsius Offloads $1 Billion in ETH",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-faces-market-tremors-as-celsius-offloads-1-billion-in-eth/",
    "description": "Ethereum (ETH) is about witnessing a potential sell-off worth $1 billion. This significant transaction is rooted in actions by Celsius, a bankrupt crypto lender. Reports from on-chain analyst Lookonchain indicate that Celsius initiated the transfer of 459,561 ETH, estimated to be worth around $1.014 billion, to various exchanges. The breakdown of this large-scale distribution includes 297,454 ETH ($656.5 million) moved to Coinbase Prime, 146,507 ETH to Paxos Treasury, and smaller sums totaling 7,800 ETH ($17.2 million) sent to FalconX and Coinbase, respectively. Despite this transfer, Lookonchain disclosed that Celsius still maintains a reserve of 62,468 ETH, valued at roughly $139 million. Celsius transferred 459,561 $ETH($1.014B) out 9 hrs ago. 297,454 $ETH($656.5M) → #CoinbasePrime 146,507 $ETH ($323.3M) → #PaxosTreasury 7,800 $ETH($17.2M) → #FalconX 7,800 $ETH($17.2M) → #Coinbase. And #Celsius still has 62,468 $ETH($139M) left.https://t.co/O71a2LfeKg pic.twitter.com/adcxQA3POn — Lookonchain (@lookonchain) January 26, 2024 This significant transfer carries significant weight in the Ethereum market. It poses a challenge as it exerts considerable pressure on Ethereum&#8217;s price, with potential implications for broader market sentiment. Ethereum could see a significant plunge if the $1.014 billion worth of ETH is sold simultaneously. Related Reading: Celsius Dump Triggers Ethereum Dive: $35 Million Sell-Off Sends ETH Price Crashing Celsius&#8217; Previous Ethereum Transactions Celsius&#8217; latest Ethereum transactions aren&#8217;t isolated events. LookonChain has previously spotted significant transfers linked to Celsius, including a deposit of 13,000 ETH ($30 million) on Coinbase and 2,200 ETH ($5 million) to FalconX. While these moves indicate Celsius&#8217; proactive strategy in managing its financial challenges, they also signal potential volatility for Ethereum&#8217;s market value. Furthermore, Arkham Intelligence reports that between January 8 and January 12, Celsius liquidated over $125 million worth of Ethereum. The primary objective of these sales is to fulfill obligations to creditors. Dune Analytics also highlighted the pattern of large-scale Ethereum redemptions, noting redemptions exceeding $1.6 billion. Since last year&#8217;s Shanghai update, this figure represents the highest Ethereum redemptions recorded. As part of its bankruptcy proceedings, Celsius continues liquidating Ethereum holdings to pay off debts. Ethereum&#8217;s Market Reaction In the aftermath of Celsius&#8217;s Ethereum transactions, the asset has seen a nearly 10% decline in value over the past week, dropping from a high above $2,600 to around $2,186 yesterday. However, Ethereum has slightly recovered, rising by 2.2% in the past 24 hours, with a trading price of $2,258 at the time of writing. Amid these market developments, Michael van de Poppe, a renowned crypto analyst, has identified three key factors that could signal a bullish phase for ETH. A significant element is Bitcoin&#8217;s market behavior, often setting the tone for altcoins. Van de Poppe notes that Bitcoin&#8217;s indications of bottoming out usually precede rallies in altcoins, suggesting a potential upturn for Ethereum. He also emphasizes the increasing excitement around spot Ethereum ETFs, which could catalyze Ethereum&#8217;s market value in the coming weeks. Related Reading: Ethereum’s Path To Recovery: Analyst Highlights 3 Key Factors Pointing To A Price Boom Additionally, Ethereum&#8217;s impending network upgrades, which aim to reduce transaction costs significantly, are expected to enhance the network&#8217;s efficiency and scalability, potentially boosting its market appeal. The momentum towards $ETH is probably going to come in the next few weeks. Arguments: &#8211; #Bitcoin bottoming out is a trigger for altcoins to make a new run. &#8211; Ethereum Spot ETF hype. &#8211; Ethereum launching new upgrades to reduce 90% of the costs. pic.twitter.com/N8bDi52F8M — Michaël van de Poppe (@CryptoMichNL) January 25, 2024 Featured image Unsplash, Chart from TradingView"
  }
]