[
  {
    "source": "CryptoSlate",
    "date": "2023-06-15T06:09:36.000Z",
    "title": "Daily active users and transaction count on Arbitrum has increased post airdrop",
    "url": "https://cryptoslate.com/daily-active-users-and-transaction-count-on-arbitrum-has-increased-post-airdrop/",
    "description": "<p>In the weeks after the ARB airdrop, unique users and transaction counts on Arbitrum have remained high on average compared to pre-airdrop levels, Nansen data shows. Arbitrum airdropped its ARB token on March 23, which pushed its transaction count to an all-time high. A day later, the number of new users on the network reached [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/daily-active-users-and-transaction-count-on-arbitrum-has-increased-post-airdrop/\">Daily active users and transaction count on Arbitrum has increased post airdrop</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T06:15:33.000Z",
    "title": "LBank Exchange Will List 6 Pack Rick (6PR) on June 15, 2023",
    "url": "https://cryptodaily.co.uk/2023/06/lbank-exchange-will-list-6-pack-rick-6pr-on-june-15-2023",
    "description": "<p>Road Town, BVI, June 15th, 2023, Chainwire</p><p>LBank Exchange, a global digital asset trading platform, will list 6 Pack Rick (6PR) on Jun 15, 2023. For all users of LBank Exchange, the 6PR/USDT trading pair will be officially available for trading at 12:00 UTC on Jun 15, 2023.</p><p>6 Pack Rick (6PR) is a muscular revolution in the memeverse, who inspires Mortys and Mortettes everywhere to flex their might, rise above, and aim to transform memecoins, all while leading an epic journey of conquering the memeverse as true champions with the mantra, \"Wubba lubba dub dub!\". </p><p>Introducing 6 Pack Rick</p><p>Its native token, 6PR, will be listed on LBank Exchange at 12:00 UTC on Jun 15, 2023, with the goal of expanding its global footprint and supporting the realization of its forward-thinking objectives.</p><p>The project has set forth a turbocharged roadmap, taking aim at the moon with ambitions as robust as 6 Pack Rick's muscles. The token might appear as futile as the vast cosmos they inhabit, yet in this limitless multiverse with its infinite use cases, it has found it's niche. The unique allure emanates from being as buffed as one can be while simultaneously achieving a splendid degree of inactivity. In essence, its innovatively redefining the concept of uselessness, raising it to unprecedented heights, much like a weightlifter hoisting a weighty barbell into the air. The aim is not merely existing within the cosmic playground, but actively engaging in it, albeit in a distinctively lethargic manner.</p><p>About 6PR Token</p><p>Based on ERC-20, 6PR has a total supply of 420.69 trillion (i.e. 420,690,000,000,000). The token distribution for this project is designed to support various aspects, with 50.00% allocated for presale, 30.00% set aside to ensure liquidity, 8.00% dedicated to centralized exchanges (CEX), 7.00% marked for marketing, and the remaining 5.00% reserved for advisors. It will be listed on LBank Exchange at 12:00 UTC on Jun 15, 2023, investors who are interested in 6PR can easily buy and sell it on LBank Exchange by then. The listing of 6PR token on LBank Exchange will help it further expand its business and draw more attention in the market.</p><p>Learn More about 6PR Token:</p><p>Official Website: https://6packrick.com/</p><p>Twitter: https://twitter.com/6packrick</p><p>Telegram: https://t.me/sixpackrick</p><p>Contract: https://etherscan.io/address/0xA4637f40D17C7cF074e35877d86A8c24Cb1CFf1C</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users' funds and aims to contribute to the global adoption of cryptocurrencies.</p><p>Start Trading Now: lbank.com</p><p>Community &amp; Social Media:&nbsp;l&nbsp;Telegram l&nbsp;&nbsp;Twitter l&nbsp;&nbsp;Facebook l&nbsp;&nbsp;LinkedIn l&nbsp;&nbsp;Instagram l&nbsp;&nbsp;YouTube</p>ContactLBK Blockchain Co. Limitedmarketing@lbank.info"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T06:23:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-15T06:38:20.000Z",
    "title": "Major Investments Pour into Sparklo (SPRK) Amid Cardano (ADA) And BNB (BNB) Issues",
    "url": "https://nulltx.com/major-investments-pour-into-sparklo-sprk-amid-cardano-ada-and-bnb-bnb-issues/",
    "description": "In the aftermath of a prolonged bearish season, investing in crypto projects necessitates diligent observation and analysis of their short-term and long-term prospects. Recognizing the unique characteristic of long-term potential has led whales and industry experts to align themselves with Sparklo, hailed as the epitome of a blue-chip cryptocurrency that holds the promise of a [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-15T06:30:49.000Z",
    "title": "Analyzing The Impact Of The Fed’s Decision On The Bitcoin Market",
    "url": "https://nulltx.com/analyzing-the-impact-of-the-feds-decision-on-the-bitcoin-market/",
    "description": "The recent decision by the U.S Federal Reserve (Fed) to maintain the federal funds rate unchanged has generated implications for various financial markets. One market that has notably reacted to this decision is the Bitcoin market, with Bitcoin experiencing a 2% decline in value, dropping below $24k levels. In this analysis, we will examine the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-15T06:31:34.000Z",
    "title": "Bitcoin Price Hammered Below $25,000 Amid The Fed’s Hawkish Tone, SEC Lawsuits",
    "url": "https://www.newsbtc.com/news/bitcoin-price-hammered-below-25000-amid-the-feds-hawkish-tone-sec-lawsuits/",
    "description": "For the first time since mid-March, Bitcoin price dropped below $25,000 as trade volumes decreased and the U.S. Federal Reserve left interest rates untouched based on projections but warned of additional hikes this year to combat inflation. At the time of writing, Bitcoin was trading at $24,995, down 3.8% in the last 24 hours, data from crypto market tracker CoinMarketCap shows. BTC has now lost 5.26% of its value in the last seven days. Crypto assets may be particularly vulnerable to the central bank’s projection of a higher terminal rate later this year. Related Reading: Polkadot Ventures Into Bearish Zone: What’s The Next Move For DOT? Source: CoinMarketCap Bitcoin price had been stable around $26,000 for the past few days as the market processed the SEC&#8217;s lawsuit against Binance and Coinbase and rising macroeconomic anxiety about interest rate signals from the Fed. SEC Lawsuits, Hawkish Fed Message Hammer Bitcoin Price According to Benjamin Stani, head of business development and sales at cryptocurrency trading platform Matrixport, the SEC&#8217;s lawsuit against the two largest cryptocurrency exchanges is a major factor in the market&#8217;s recent losses. The majority of altcoins also took a beating in value as a result. CoinMarketCap data shows that in the past 24 hours, the entire cryptocurrency market cap has dropped 2.7%, to $1.02 trillion, while daily crypto trading volume has decreased 5.3% to $31.89 billion. BTCUSD drops to the $24K level. Chart: TradingView.com Despite widespread expectations for a rate suspension, the Federal Open Markets Committee signaled future rate hikes in its statement, which normally dampens investor enthusiasm for risk assets like cryptocurrencies. Since early 2022, the US central bank has been gradually increasing interest rates, with the most severe effects seen by the riskiest assets. When interest rates rise, it becomes more expensive to borrow money, which leads to lower levels of investment and consumer spending. And because of the prolonged crypto winter, Bitcoin has been plunging since the beginning of the year. Analysts say it may take awhile for the alpha coin to muster a strong rebound and break past the key $27K or $28K level given the cryptocurrency&#8217;s sluggish performance of late. Sluggish XRP Creates Negative Ripples Across Bitcoin Market Add to the ongoing misery for Bitcoin is the disappointment emanating from the XRP community following the release of the Hinman documents, that many expected would be a savior of sorts to the price of the token and its creator Ripple, whose legal tussle with the SEC has yet to see closure. BTC price on a downward trajectory. Source: TradingView. These Hinman emails are critical in the ongoing case between Ripple and SEC. Whatever negative news comes out of it affects Bitcoin price &#8211; and crypto in general &#8211; in many ways. Related Reading: Tether Shuffles The Deck: 750 Million USDT Shifted From Tron To Ethereum Meanwhile, as technical factors play out, IntoTheBlock reports that Bitcoin-related negativity on Twitter has reached an all-time high. It emphasizes the relevance of this fact, which is that large peaks have typically occurred just before or after price lows in the past. Santiment, an on-chain analytics company, also reports that the number of Bitcoins available for trading has hit a new low not seen since February 2018. Even while lawsuits continue against Binance and Coinbase, it has been reported that traders have continued to move BTC into self-custody. Featured image from Pixels"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T06:15:42.000Z",
    "title": "LBank Exchange Will List 6 Pack Rick (6PR) on June 15, 2023",
    "url": "https://www.crypto-news-flash.com/lbank-exchange-will-list-6-pack-rick-6pr-on-june-15-2023/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-exchange-will-list-6-pack-rick-6pr-on-june-15-2023",
    "description": "Road Town, BVI, June 15th, 2023, Chainwire LBank Exchange, a global digital asset trading platform, will list 6 Pack Rick (6PR) on Jun 15, 2023. For all users of LBank Exchange, the 6PR/USDT trading pair will be officially available for trading at 12:00 UTC on Jun 15, 2023. 6 Pack Rick (6PR) is a muscular [...]"
  }
]