[
  {
    "source": "CoinDesk",
    "date": "2023-10-30T16:01:06.000Z",
    "title": "Crypto Funds See Largest Inflow in 15 Months, With Bitcoin, Solana Leading Rally: CoinShares",
    "url": "https://www.coindesk.com/markets/2023/10/30/crypto-funds-see-largest-inflow-in-15-months-with-bitcoin-solana-leading-rally-coinshares/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Ether-based funds continue to fall out of favor, with outflows for the year now totaling $125 million."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-30T16:00:00.000Z",
    "title": "OKX Latest Proof of Reserves Shows Exchange Over-collateralized",
    "url": "https://www.coindesk.com/markets/2023/10/30/okx-latest-proof-of-reserves-shows-exchange-overcollateralized/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest proof of reserves shows that the exchange is 103% collateralized with bitcoin, ether, and USDT."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-30T15:57:49.000Z",
    "title": "Bitcoin Rally Cools, But Solana, Pepe, and XRP All Jump in Price",
    "url": "https://decrypt.co/203669/buitcoin-rally-cools-solana-xrp-pepe",
    "description": "A number of major alt coins and tokens have jumped in price this morning. "
  },
  {
    "source": "Decrypt",
    "date": "2023-10-30T15:46:59.000Z",
    "title": "Chain of Alliance Update Opens a New Chapter for Blockchain RPGs",
    "url": "https://decrypt.co/203231/chain-of-alliance-update-opens-a-new-chapter-for-blockchain-rpgs",
    "description": "The blockchain-powered RPG adds season-based leaderboards plus new species, classes and rewards with its Alpha 3.0 game update."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-30T16:02:30.000Z",
    "title": "Small Islands, big problems: Can Bitcoin fix this? Cointelegraph Cape Verde video",
    "url": "http://cointelegraph.com/news/small-islands-big-problems-can-bitcoin-fix-this-cointelegraph-cape-verde-video",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/5c13b304-5947-418f-bd5d-d4e0e1691c2f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A small island nation in the Atlantic Ocean grapples with a cash economy influenced by tourism, remittances and limited resources. Can Bitcoin help?</p>\n                    <p><p>Cointelegraph recently traveled to Cape Verde, West Africa, to explore whether Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) could be a tool for progress.</p><p>In the latest on-the-ground video documentary from Cointelegraph, global reporter Joe Hall investigates the remittances market, cash economies, and the challenges and opportunities faced by small island nations worldwide. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/ILOxMyoGLow\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Cape Verde, officially the Republic of Cabo Verde, is an island nation in the central Atlantic Ocean. Cape Verde comprises 10 main islands and several smaller islets, sitting 570 kilometers (350 miles) west of <a href=\"https://cointelegraph.com/magazine/bitcoin-senegal-why-how-african-country-using-btc/\">Senegal, West Africa</a>.</p><p>Hall discovers that more Cape Verdeans live abroad than on the country’s islands. Due to its small land mass, it struggles to cultivate and export goods abroad. The islanders of Cape Verde, especially Sal, rely on tourism to stimulate the economy, and relatives living abroad send money home.</p><p>The combination of a tourism and remittance-based economy presents multiple issues. Due to the presence of tourists year-round, Sal uses three currencies: the local Escudo, the U.S. dollar, and the Euro, although Hall discovered it’s also possible to pay in British pounds. Mastercard and Visa charge upward of 4% for transaction fees in stores, which merchants often pass on to customers.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/df7e4e62-fa2e-4073-aa06-181e8b5f8f19.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Hall receives “confused change” — a mix of euros and escudos — at the checkout. Source: Cointelegraph</em></figcaption></figure><p>Western Union and MoneyGram charge customers as much as 15% for remittances to send money across borders. The high remittance costs act like a tax on the higher incomes of Cape Verdean workers living abroad.</p><p>The Cape Verde cash economy is also hamstrung by high ATM and bank access fees, as well as strict opening and closing hours. Cape Verdean banks close at 5:00 pm local time on the islands, and during bank holidays, ATMs often run out of cash for withdrawal, presenting further economic hurdles for full-time workers. </p><p>Finally, inflation runs higher in Cape Verde than across the eurozone, even though the escudo is “pegged” to the euro. Compared with Western economies, the islands’ incumbent financial systems impede Cape Verdeans from simply spending, saving and sending money the way many Westerners take for granted. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/one-man-s-plan-to-orange-pill-a-nation-bitcoin-senegal\">One man’s plan to orange-pill a nation: Bitcoin Senegal</a></em></strong></p><p>While investigating these economic issues, Hall met with Renato Evarchi, one of the first business owners in Cape Verde to accept Bitcoin. He shed light on the economic situation and explained how more and more Cape Verdeans were warming up to a borderless, immutable and decentralized internet currency. </p><p>To learn more from Hall’s travels in Cape Verde, watch the full documentary above and subscribe to Cointelegraph’s <a href=\"https://www.youtube.com/@cointelegraph/featured\" target=\"_blank\" rel=\"noopener nofollow\">YouTube channel</a>.</p><p><strong><em>Magazine: </em><a href=\"https://cointelegraph.com/magazine/elegant-and-ass-backward-jameson-lopps-first-impression-of-bitcoin/\"><em>‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin</em></a></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-30T15:45:53.000Z",
    "title": "Bitcoin’s ratio to the U.S. long bond is nearing all-time highs",
    "url": "https://cryptoslate.com/insights/bitcoins-ratio-to-the-u-s-long-bond-is-nearing-all-time-highs/",
    "description": "<p>Quick Take The U.S. dollar, reigning as the global reserve currency, has been the standard benchmark for valuing all assets. However, an intriguing shift occurs when we start benchmarking financial assets against Bitcoin instead of the traditional USD. Take the U.S. long bond (TLT) as an example, which is currently trading at approximately $84. It [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-ratio-to-the-u-s-long-bond-is-nearing-all-time-highs/\">Bitcoin’s ratio to the U.S. long bond is nearing all-time highs</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-30T15:41:35.000Z",
    "title": "ETF Speculation Swirls: Dogecoin (DOGE), Shiba Inu (SHIB) and Floki Inu (FLOKI) Bask in Uncertain Glory",
    "url": "https://cryptodaily.co.uk/2023/10/etf-speculation-swirls-dogecoin-doge-shiba-inu-shib-and-floki-inu-floki-bask-in-uncertain-glory",
    "description": "Dive into the dynamic crypto landscape with insights into trending assets like Dogecoin (DOGE), Shiba Inu (SHIB), and Floki Inu (FLOKI). Explore their recent price movements, technical indicators, and groundbreaking developments. Navigate the crypto market's unpredictability while staying informed."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-30T16:00:06.000Z",
    "title": "Biggest Movers: SOL Hits Near 1-Year High, Gaining 9% on Monday",
    "url": "https://news.bitcoin.com/biggest-movers-sol-hits-near-1-year-high-gaining-9-on-monday/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1986636659-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: SOL Hits 1-Year High, After Gaining 9% on Monday\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1986636659-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1986636659-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1986636659-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1986636659-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1986636659-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1986636659-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1986636659.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Solana surged to near a one-year high to start the week, as bulls pushed the cryptocurrency above the $35.00 level. Today’s surge comes as the global crypto market cap rallied, following a recent bout of consolidation. Avalanche also edged higher, surging by 5% today. Solana (SOL) Solana (SOL) was one of the notable gainers in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T16:01:32.000Z",
    "title": "OpenAI Forms Team to Prevent Catastrophic Use of AI",
    "url": "https://www.cryptopolitan.com/openai-to-prevent-catastrophic-use-of-ai/",
    "description": "OpenAI, the organization behind the popular ChatGPT, is mobilizing a team to prevent potential catastrophic threats posed by what they term as &#8220;frontier AI models&#8221;. These models could surpass the capabilities of current leading AI models, presenting both unparalleled opportunities and severe risks. *&#8221;Frontier AI models&#8230; have the potential to benefit all of humanity. But ... <a title=\"OpenAI Forms Team to Prevent Catastrophic Use of AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openai-to-prevent-catastrophic-use-of-ai/\" aria-label=\"More on OpenAI Forms Team to Prevent Catastrophic Use of AI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T15:59:32.000Z",
    "title": "El Salvador’s Nayib Bukele kickstarts re-election campaign",
    "url": "https://www.cryptopolitan.com/el-salvadors-nayib-bukele-election-campaign/",
    "description": "El Salvador’s President Nayib Bukele has taken steps toward running for re-election in the upcoming 2024 presidential election, slated for February. Bukele, known for his advocacy of Bitcoin, received substantial public support on October 26 when his political party officially nominated him for a second term. El Salvador’s Bukele wants to continue progress Addressing a ... <a title=\"El Salvador’s Nayib Bukele kickstarts re-election campaign\" class=\"read-more\" href=\"https://www.cryptopolitan.com/el-salvadors-nayib-bukele-election-campaign/\" aria-label=\"More on El Salvador’s Nayib Bukele kickstarts re-election campaign\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T15:42:17.000Z",
    "title": "Mintable CEO calls out the UK on NFT regulation",
    "url": "https://www.cryptopolitan.com/mintable-ceo-calls-out-uk-on-nft-regulation/",
    "description": "The United Kingdom government faces a critical juncture in its approach to regulating Non-Fungible Tokens (NFTs), according to Mintable CEO Zach Burks. In his assessment, the recent report from a U.K. parliamentary committee doesn’t fully capture the essence of NFT technology and potentially overshadows its broader functionalities by exaggerating concerns primarily related to copyright infringement. ... <a title=\"Mintable CEO calls out the UK on NFT regulation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mintable-ceo-calls-out-uk-on-nft-regulation/\" aria-label=\"More on Mintable CEO calls out the UK on NFT regulation\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-30T15:48:58.000Z",
    "title": "Yuga Labs’ Bored Ape Yacht Club hits 30 ETH floor price",
    "url": "https://crypto.news/yuga-labs-bored-ape-yacht-club-hits-30-eth-floor-price/",
    "description": "According to world’s largest data aggregator CoinGecko, Bored Ape Yacht Club, an NFT collection with owners such as Justin Bieber and Serena Williams, once again sees an uptrend on floor price."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-30T15:59:06.000Z",
    "title": "This Chart Makes It Clear: Bitcoin Is Bullish",
    "url": "https://www.newsbtc.com/news/bitcoin/this-chart-makes-it-clear-bitcoin-is-bullish/",
    "description": "When Bitcoin price action is sideways and directionless for the better part of a year, bulls and bears argue over which direction will be ultimately chosen. However, considering macro conditions like rising interest rates, a sinking stock market, and mounting ting debt, bears aren’t ready to throw in the towel. But they might want to after seeing this chart. Bitcoin Price Chooses A Direction: Up And Away Bitcoin and other cryptocurrencies are normally notoriously volatile. But volatility has dwindled to next to nothing since the FTX collapse struck. Few have been willing to take the risk on BTC and altcoins while macro conditions are this on the edge of collapse. It resulted in a big move off the bottom, but also more than six months of consolidation and confusion. Related Reading: Why Bitcoin Price Could Double To $60K In A Flash But after several months of sideways price action, Bitcoin appears to have chosen a direction and broke out to form a new trend. Bears, however, remain stubbornly short per market sentiment. Bearish traders might want to reconsider their positioning after taking a look at the Directional Movement Index. There is no denying: Bulls are in charge &#124; BTCUSD on TradingView.com Bullish Directional Movement Is Anything But Average The Directional Movement Index is typically found bundled with the Average Directional Index, and consists of a negative and a positive directional indicator. The tool’s premise is simple: when DI+ (green) is above DI- (red) the asset is bullish and DI- is above DI+ when bearish. This technical analysis indicator is currently showing the DI+ soaring, while the DI- is falling and below the 20 line. The 20 line is notable more for the ADX, which isn’t pictured. When the ADX rises above 20, the tool suggests a trend is active and strengthening. Related Reading: Bitcoin Bulls Could Buck Downtrend With Move To $42,000 Bitcoin isn’t above 20 on the weekly yet, but has begun to do so on lower timeframes. With how strong the recent move was, the ADX could confirm above 20 over the next week or two. At that point, bears might finally be forced to concede that a new bull trend has blossomed. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-30T15:46:08.000Z",
    "title": "New P2E Memecoin Set To Outperform Shiba Inu in 2023",
    "url": "https://www.crypto-news-flash.com/new-p2e-memecoin-set-to-outperform-shiba-inu-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=new-p2e-memecoin-set-to-outperform-shiba-inu-in-2023",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-118.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-118.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-118-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-118-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />NuggetRush is a P2E me­mecoin challenging Shiba Inu in 2023 with unique features and innovations. It focuses on GameFi, enabling players to earn real-world rewards and convert in-game rewards into tangible assets. Shiba Inu is an Ethereum meme token with a deflationary model and the ShibaSwap ecosystem. NuggetRush (NUGX) is a play-to-earn (P2E) me­mecoin aiming [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-30T15:51:00.000Z",
    "title": "XRP Faces a Big Obstacle After Whales Begin Sell-Offs",
    "url": "https://coinedition.com/xrp-faces-a-big-obstacle-after-whales-begin-sell-offs/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/xrp7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/xrp7.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/xrp7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/xrp7-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Ripple (XRP) posted 5.50% gains over the last seven days as Bitcoin (BTC) led a significant crypto market recovery. The rise culminated in the token’s jump above the $0.50 psychological resistance. At press time, XRP exchanged hands at $0.55. However, there could be some concerns as regards the XRP price action. On October 29, whale [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-faces-a-big-obstacle-after-whales-begin-sell-offs/\">XRP Faces a Big Obstacle After Whales Begin Sell-Offs</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]