[
  {
    "source": "CryptoGlobe",
    "date": "2024-01-18T23:56:00.000Z",
    "title": "Bitcoin ($BTC) Whale Moves Over $665 Million In Largest Transactions of The Year So Far",
    "url": "https://www.cryptoglobe.com/latest/2024/01/bitcoin-btc-whale-moves-over-665-million-in-largest-transactions-of-the-year-so-far/",
    "description": "The Bitcoin network has just seen its largest transaction of the year so far, with a BTC whale moving a staggering $665 million worth of the cryptocurrency in a single transaction, at a time in which the price of Bitcoin is stagnant around the $43,000 mark after the launch of spot Bitcoin exchange-traded funds (ETFs) […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T23:50:49.000Z",
    "title": "Robinhood’s $7.5M settlement – The gamification scandal deep dive",
    "url": "https://www.cryptopolitan.com/robinhoods-7-5m-settlement-on-gamification/",
    "description": "Robinhood, the renowned crypto and stock trading app, has reached an agreement with Massachusetts&#8217; securities regulator, ending a legal dispute that began in December 2020. The corporation has agreed to pay a $7.5 million penalty and change its digital engagement policies. This judgment comes after complaints that Robinhood gamified cryptocurrency and stock trading to attract [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-18T23:59:27.000Z",
    "title": "Altcoins Forge Distinct Paths Amid Bitcoin Spot ETF Approval Buzz",
    "url": "https://nulltx.com/altcoins-forge-distinct-paths-amid-bitcoin-spot-etf-approval-buzz/",
    "description": "Following the recent milestone of Bitcoin Spot ETF approval, altcoins are displaying notable divergence in market dynamics: Ethereum Name Service (ENS) has witnessed an impressive surge, marking a remarkable 163% gain in the last month. ENS, propelled by positive remarks from Ethereum founder Vitalik Buterin, reached a peak of $27 [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-18T23:40:00.000Z",
    "title": "TUSD Faces Depreciation Amidst Heavy Liquidation And Binance Announcement",
    "url": "https://nulltx.com/tusd-faces-depreciation-amidst-heavy-liquidation-and-binance-announcement/",
    "description": "TrueUSD (TUSD) experienced a significant depreciation, dropping to as low as 97 cents, triggered by reports of traders liquidating over $300 million worth of the stablecoin, according to data from Binance. Binance&#8217;s announcement on January 15 about farming $MANTA by staking $BNB and $FDUSD, excluding $TUSD, played a pivotal role [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-19T00:00:39.000Z",
    "title": "Down Big: Crypto Scamming Numbers Reduced In 2023 – Report",
    "url": "https://www.newsbtc.com/crypto/down-big-crypto-scamming-numbers-reduced-in-2023-report/",
    "description": "2023 started with a challenging overall landscape for the crypto market that continued throughout the rest of the year. However, the market saw a recovery with a spike in bullish sentiment and ended the year on a positive note. Additionally, 2023 saw a decline in crypto scamming and crypto-related illicit activity compared to the previous year, as new data shows. Related Reading: By The Numbers: Crypto Users Lose $300 Million To Phishing Scams In 2023 Illicit Activity Market Revenue Decline In 2023 American blockchain analysis firm Chainalysis released its 2024 Crypto Crime Report detailing the trends and figures that crypto-related illicit activities saw in 2023. The firm’s data shows a significant drop in value received in cryptocurrency addresses used for illicit activities, totaling $24.2 billion. This is a considerable reduction compared to the 2022 updated estimate of $39.6 billion. In addition, the share of all crypto transaction volume associated with illicit activity reduced from 0.42% in 2022 to 0.34% in 2023. According to the report, there seems to be a shift in the type of assets involved in crypto-related crime activities over the last two years, with Bitcoin no longer being the most used asset for most illicit transactions. Alternately, stablecoins have become a more popular choice for crypto assets involved in illicit activities, as the report states. This increase could be attributed to the recent general growth of stablecoins’ share of all crypto activity overall. The shift to stablecoins is not seen in every related crime, with activities, such as darknet market sales and ransomware extortion, still taking place predominately in Bitcoin. Nonetheless, it’s worth noting that their issuers can trace stablecoins, and funds can be frozen when addresses are linked to illicit activities, as Tether did back in 2023. Illicit transaction volume by asset type, 2018-2023. Source: Chainalysis Trends That Defined Crypto-Related Crime In 2023 Chainalysis on-chain metrics suggest that scamming revenues have been trending globally since 2021. Although these crimes are still underreported, “overall, scamming is down, given broader market dynamics.” Romance scams, such as ‘pig butchering,’ are among the most popular crypto scamming tactics used by scammers and are one of the biggest forms of related crime by transaction volume. Regarding crypto hacking, the firm believes that “the decline in stolen funds is driven largely by a sharp dropoff in DeFi hacking,” it could represent “the reversal of a disturbing, long-term trend.” In 2023, crypto scamming and hacking revenue fell significantly, with the total revenue decreasing 29.2% and 54.3%, respectively. In contrast to the overall trends, ransomware and darknet markets, two of the most prominent forms of related crime, saw revenues rise in 2023. Similarly, 2023’s growth in darknet market revenue comes after a 2022 decline in revenue. The report shows that transactions with sanctioned-related entities and jurisdictions drive most of the illicit activity as entities and jurisdictions move towards using stablecoins and other crypto assets to bypass restrictions. They accounted for a combined $14.9 billion transaction volume in 2023, representing 61.5% of all illicit transactions over the year. Chainalysis explains that: Most of this total is driven by cryptocurrency services that were sanctioned by the U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC), or are located in sanctioned jurisdictions, and can continue to operate because they’re in jurisdictions where U.S. sanctions are not enforced. Ultimately, the report addresses that not all sanction-related transactions are due to the illicit use of digital assets, as some of that $14.9 billion volume is related to the average users who reside in the sanctioned jurisdictions. Related Reading: NFT Scams: Types And How To Avoid Them Bitcoin trading at $41,906.6 on the hourly chart. Source BTCUSDT on TradingView.com Featured image from Unsplash.com, Chart from TradingView.com"
  }
]