[
  {
    "source": "Cointelegraph",
    "date": "2023-10-23T18:01:16.000Z",
    "title": "IRS proposes unprecedented data-collection on crypto users",
    "url": "https://cointelegraph.com/news/irs-proposes-unprecedented-data-collection-crypto-users",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/b57ef020-c2d0-4e04-99c3-2ca65608047c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The IRS is looking to require crypto service providers to collect unprecedented swaths of data about their users — including names and Social Security numbers.</p>\n                    <p><p>For two years, the cryptocurrency world has been waiting to see how the <a href=\"https://cointelegraph.com/learn/how-to-file-crypto-taxes\">Internal Revenue Service (IRS)</a> would implement the Infrastructure Investment and Jobs Act. Put simply, this law established new reporting requirements that risked setting a de facto ban on cryptocurrency mining and exposing millions of Americans to new felony crimes. The good news is that the IRS’s nearly 300-page proposal is not quite as bad as it could have been under the law. However, that is far from saying it is good policy. </p><p>As citizens, companies, and consultants finish crafting their comment letters ahead of the October 30 response deadline, it’s important to take a step back and recognize why businesses should not be required to report customers to the government by default. </p><p>Recalling back to 2021, the Infrastructure Investment and Jobs Act was about building roads, bridges, and the like — it was not about cryptocurrency or financial reporting. It wasn’t until funding was desperately needed to <a href=\"https://cointelegraph.com/news/senators-add-crypto-taxes-to-infrastructure-deal-to-raise-28b-in-extra-revenue\">offset spending</a> that members of Congress slipped in two provisions to increase financial surveillance over cryptocurrency users. Their argument was that increasing surveillance would increase tax revenue, effectively accusing cryptocurrency users of tax evasion.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/new-r-d-tax-rules-could-bankrupt-your-blockchain-startup\"><strong><em>New tax rules could mean a US exodus for crypto companies</em></strong></a></p><p>At the time, the Joint Committee on Taxation estimated that the provisions would <a href=\"https://www.jct.gov/publications/2021/jcx-33-21/\" target=\"_blank\" rel=\"noopener nofollow\">yield</a> around $28 billion in tax revenue over 1 years. Without a way to replace the funding, <a href=\"https://cointelegraph.com/news/treasury-secretary-reportedly-against-amending-crypto-language-in-infrastructure-bill\">attempts to remove the controversial reporting requirements </a>were ultimately rejected. </p><p>The $28 billion figure was questionable at the time. And less than a year later, the Biden administration released its <a href=\"https://www.whitehouse.gov/wp-content/uploads/2022/03/budget_fy2023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">budget</a>, which contained a vastly different estimate. In contrast to the $28 billion estimated by the Joint Committee on Taxation, the Biden administration estimated that only $2 billion would be received over the next 10 years. And now, even that number might be an overestimation as Treasury officials acknowledged that the estimates were based on a very different market.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/32c434a4-fe08-4929-9d10-cabd916e6448.jpg\"  /><figcaption style=\"text-align: center;\"><em>The IRS summary of its proposal for imposing new data-collection requirements on cryptocurrency service providers. Source: U.S. Federal Register</em></figcaption></figure><p>With cost-offsetting out the window, what is left appears to be little more than another brick in the wall of U.S. financial surveillance. </p><p>The IRS’s proposal, again, doesn’t seem as bad as it could have been since the proposal does exclude miners and some software developers for now. Still, the proposal chooses a concerning path for deciding who should be required to report customers. </p><p>The premise seems to be partly <a href=\"https://www.federalregister.gov/documents/2023/08/29/2023-17565/gross-proceeds-and-basis-reporting-by-brokers-and-determination-of-amount-realized-and-basis-for\" target=\"_blank\" rel=\"noopener nofollow\">based</a> on “whether a person is in a position to know information about the identity of a customer, rather than whether a person ordinarily would know such information.” The proposal states that this distinction is made because some platforms “have a policy of not requesting customer information or requesting only limited information [but] have the ability to obtain information about their customers by updating their protocols.” For this reason, the proposal states that the IRS expects some decentralized exchanges and selfhosted wallets may be forced to report their customers’ private information. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The IRS reports 1,726 comments received so far.<br><br>Those are rookie numbers.<br><br>Unless you want:<br><br>- Every crypto site and wallet to have your SSN, and <br><br>- Nodes, devs, governance, &amp; LPs to be brokers in technical noncompliance, <br><br>Take 2 mins to use <a href=\"https://twitter.com/LeXpunK_Army?ref_src=twsrc%5Etfw\">@LeXpunK_Army</a> &#39;s comment tool NOW <a href=\"https://t.co/USYAHKdxic\">https://t.co/USYAHKdxic</a> <a href=\"https://t.co/1d8ijWbjVG\">pic.twitter.com/1d8ijWbjVG</a></p>&mdash; CryptoTaxGuy.ETH ⌐◨-◨ ️ (@CryptoTaxGuyETH) <a href=\"https://twitter.com/CryptoTaxGuyETH/status/1714326893502030335?ref_src=twsrc%5Etfw\">October 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In other words, even though businesses may have no reason to collect sensitive, personal information from customers, the baseline that the IRS is working with is whether they have the ability to do so. That may be somewhat limited given the focus is on businesses providing a service, but “the ability to collect information” seems to be little more than “collection by default.” </p><p>While concerning, this approach should not come as a surprise. The U.S. government has slowly been establishing broader financial reporting requirements with the Bank Secrecy Act, the Patriot Act, and many other laws and regulations. The provisions in the Infrastructure Investment and Jobs Act and the resulting proposal from the IRS are just the latest iteration of this expansive framework.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/get-ready-for-a-swarm-of-incompetence-at-the-irs\"><strong><em>Get ready for a swarm of incompetent IRS agents in 2023</em></strong></a></p><p>Yet rather than continue to expand the range and depth of financial surveillance, now should be the time to question the premise as a whole. In a country where Americans are supposed to be protected by the Fourth Amendment, businesses should not be forced to report their customers to the government by default. Activities like using cryptocurrency for payments, receiving over $600 on PayPal after a garage sale, or getting a paycheck from a job should not put you on a government database. </p><p>Steering away from this surveillance status quo might require fundamental changes to U.S. law, but that’s not to say doing so is a radical idea. When surveyed by the Cato Institute, 79 percent of Americans said that it is unreasonable for banks to share financial information with the government and 83 percent said that the government should need a warrant to obtain financial information. </p><p>It is those principles that should guide the discussion forward. So, while the October 30 response deadline is just around the corner, commenters should weigh both what the proposal does and doesn’t say.</p><p>Furthermore, although the present focus is very much on the IRS, let’s not forget that the responsibility to fix both the current situation and the larger financial surveillance status quo lies in the halls of Congress. At the end of the day, the IRS is doing what Congress told it to do. So, it’s Congress that needs to step in to reform the system as a whole.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Nicholas Anthony</strong> is a policy analyst at the Cato Institute’s Center for Monetary and Financial Alternatives. He is the author of <em>The Infrastructure Investment and Jobs Act’s Attack on Crypto: Questioning the Rationale for the Cryptocurrency Provisions</em> and <em>The Right to Financial Privacy: Crafting a Better Framework for Financial Privacy in the Digital Age.</em></div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph. </em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-23T17:50:49.000Z",
    "title": "Chinese digital yuan CBDC used for first time to settle cross-border oil deal ",
    "url": "https://cointelegraph.com/news/chinese-digital-yuan-cbdc-used-first-time-settle-cross-border-oil-deal",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/369181ba-1d1e-4d6b-82df-2d9f138e5e2d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>CBDC and de-dollarization saw major strides last week with the 1-million barrel deal on the Shanghai Petroleum and Natural Gas Exchange.</p>\n                    <p><p>The digital yuan has been used for the first time to settle an oil transaction, the Shanghai Petroleum and Natural Gas Exchange (SHPGX) announced. PetroChina International bought 1 million barrels of crude on Oct. 19. </p><p>The transaction was a response to a call by the Shanghai Municipal Party Committee and Municipal Government to apply the Chinese central bank digital currency (CBDC), also referred to as the e-CNY, to international trade, the exchange <a href=\"https://www.shpgx.com/html/zxdt/20231020/5555.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a>. It is “another major step forward” for the digital yuan, <a href=\"https://global.chinadaily.com.cn/a/202310/21/WS65330f53a31090682a5e9ddb.html\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to the state-controlled China Daily.</p><p>The seller and the price in the transaction were not disclosed. For comparison, the <a href=\"https://www.opec.org/opec_web/en/data_graphs/40.htm\" target=\"_blank\" rel=\"noopener nofollow\">price</a> of the “OPEC basket” of oil from 13 producers was $95.72 per barrel on Oct. 19.</p><p>The crude oil deal also marks an overall major step in the use of the yuan on the international market and in the global movement toward de-dollarization. In the first three quarters of 2023, use of the yuan in cross-border settlements was up 35% year-on-year, reaching $1.39 trillion, China Daily reported. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/DEDOLLARIZATION?src=hash&ref_src=twsrc%5Etfw\">#DEDOLLARIZATION</a> DAILY: PETRODOLLAR SHOCK<br><br>Shanghai Oil, Gas Exchange Settles First Cross-Border Trade in E-Yuan<a href=\"https://twitter.com/hashtag/DigitalYuan?src=hash&ref_src=twsrc%5Etfw\">#DigitalYuan</a> is a game changer!<a href=\"https://twitter.com/hashtag/fintech?src=hash&ref_src=twsrc%5Etfw\">#fintech</a> <a href=\"https://twitter.com/hashtag/finserv?src=hash&ref_src=twsrc%5Etfw\">#finserv</a><a href=\"https://twitter.com/psb_dc?ref_src=twsrc%5Etfw\">@psb_dc</a><a href=\"https://twitter.com/efipm?ref_src=twsrc%5Etfw\">@efipm</a><a href=\"https://twitter.com/baoshaoshan?ref_src=twsrc%5Etfw\">@baoshaoshan</a><a href=\"https://twitter.com/thecyrusjanssen?ref_src=twsrc%5Etfw\">@thecyrusjanssen</a><a href=\"https://twitter.com/lajohnstondr?ref_src=twsrc%5Etfw\">@lajohnstondr</a><a href=\"https://twitter.com/Kathleen_Tyson_?ref_src=twsrc%5Etfw\">@Kathleen_Tyson_</a><a href=\"https://twitter.com/DOualaalou?ref_src=twsrc%5Etfw\">@DOualaalou</a><a href=\"https://t.co/8qT4Oq2X1o\">https://t.co/8qT4Oq2X1o</a></p>— Richard Turrin (@richardturrin) <a href=\"https://twitter.com/richardturrin/status/1716061983227760976?ref_src=twsrc%5Etfw\">October 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The yuan was first used for a liquified natural gas (LNG) purchase on SHPGX in March when the French TotalEnergies agreed to sell LNG to the China National Offshore Oil Corporation (CNOOC). The second LNG deal in yuan occurred last week between CNOOC and French Engie. Those transactions did not involve the digital yuan.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/circle-ceo-warns-of-active-and-accelerating-de-dollarization\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/circle-ceo-warns-of-active-and-accelerating-de-dollarization/amp\">Circle CEO warns of active and accelerating de-dollarization</a></em></strong></p><p>Also on Oct. 19, First Abu Dhabi Bank <a href=\"https://www.bankfab.com/en-ae/about-fab/group/in-the-media/fab-joins-uae-delegation-to-third-belt-and-road-forum-to-support-trade-and-investment-with-china\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that it had signed an agreement on digital currency with the Bank of China, the state-owned commercial bank, at the third Belt & Road Forum for International Corporation, which had ended a day before. China and the United Arab Emirates, of which Abu Dhabi is part, are participants in the mBridge platform to support cross-border transactions with CBDC. MBridge <a href=\"https://cointelegraph.com/news/mbridge-cbdc-project-preparing-new-members-minimum-viable-product\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/mbridge-cbdc-project-preparing-new-members-minimum-viable-product/amp\">intends to launch as</a> a minimum viable product next year. </p><p>Abu Dhabi <a href=\"https://www.reuters.com/business/energy/india-makes-first-crude-oil-payment-uae-indian-rupees-2023-08-14/\" target=\"_blank\" rel=\"noopener nofollow\">signed</a> an agreement with India in August to settle oil deals in rupees.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/china-expands-cbdcs-tentacles-malaysia-is-hks-new-crypto-rival-asia-express/\">China expands CBDC’s tentacles, Malaysia is HK’s new crypto rival: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-23T18:06:12.000Z",
    "title": "US Tops Global Crypto Activity: Chainalysis",
    "url": "https://cryptobriefing.com/us-global-crypto-activity-chainalysis/?utm_source=feed&utm_medium=rss",
    "description": "The US leads global crypto activity with $1 trillion+ in transaction volume over the past year, reports Chainalysis."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T18:02:26.000Z",
    "title": "Bitcoin ETF: The magnet for big institutions? EY thinks so",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-magnet-for-big-institutions-ey/",
    "description": "Institutional hunger for Bitcoin remains rampant, seemingly stymied by regulatory roadblocks. A specific area of interest, drawing these institutional giants like moths to a flame, is the Bitcoin ETF. While Bitcoin&#8217;s allure has been evident for years, the gates to a massive influx of institutional funds remain largely closed. And why? The U.S. regulators&#8217; hesitancy ... <a title=\"Bitcoin ETF: The magnet for big institutions? EY thinks so\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-etf-magnet-for-big-institutions-ey/\" aria-label=\"More on Bitcoin ETF: The magnet for big institutions? EY thinks so\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T18:01:40.000Z",
    "title": "KEY Difference Secures DMCC’s Business Incubator License to Raise Next Web3 Unicorns",
    "url": "https://www.cryptopolitan.com/key-difference-receive-dmcc-license/",
    "description": "KEY Difference DMCC has officially obtained a ‘business incubator’ license from Dubai Multi Commodities Centre, the world’s largest free trade zone, certifying the company’s years of expertise in the blockchain sector.&#160; KEY Difference Receives DMCC’s Nod to Launch Its Web3 Accelerator Per the announcement on Monday, the new license formally clears the path for KEY ... <a title=\"KEY Difference Secures DMCC’s Business Incubator License to Raise Next Web3 Unicorns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/key-difference-receive-dmcc-license/\" aria-label=\"More on KEY Difference Secures DMCC’s Business Incubator License to Raise Next Web3 Unicorns\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T17:48:46.000Z",
    "title": "California targets scammers with new crypto ATM limits",
    "url": "https://www.cryptopolitan.com/california-with-new-crypto-atm-limits/",
    "description": "A storm&#8217;s brewing in California over proposed legislation focused on crypto ATM limitations. In an attempt to hinder the rising tide of scams plaguing the cryptocurrency landscape, California officials are rolling out measures that some laud for consumer protection, while others criticize for potentially strangling an emerging industry. The Crux of the California Crypto Controversy ... <a title=\"California targets scammers with new crypto ATM limits\" class=\"read-more\" href=\"https://www.cryptopolitan.com/california-with-new-crypto-atm-limits/\" aria-label=\"More on California targets scammers with new crypto ATM limits\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-23T17:50:38.000Z",
    "title": "Bitcoin leaders: ease of use now vital for worldwide adoption",
    "url": "https://crypto.news/bitcoin-leaders-ease-of-use-now-vital-for-worldwide-adoption/",
    "description": "Bitcoin leaders met in Lugano to tackle the challenges of spreading adoption, from educating merchants in El Salvador to getting staff on board in Switzerland."
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-23T18:05:23.000Z",
    "title": "Bloomberg Analyst Says ‘Air Pocket’ on Bitcoin Chart Could Trigger BTC Explosion to $39,000",
    "url": "https://dailyhodl.com/2023/10/23/bloomberg-analyst-says-air-pocket-on-bitcoin-chart-could-trigger-btc-explosion-to-39000/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Stance-on-Bitcoin-After.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Stance-on-Bitcoin-After.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Stance-on-Bitcoin-After.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Stance-on-Bitcoin-After.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Stance-on-Bitcoin-After.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Stance-on-Bitcoin-After.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Stance-on-Bitcoin-After.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A Bloomberg crypto analyst says that Bitcoin&#8217;s price chart has an &#8220;air pocket&#8221; that could send BTC higher much quicker than traders realize. Blockchain analyst Jamie Coutts says on social media platform X that Bitcoin has sat in such a tight range for over six months that an eventual break to the upside could be [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/23/bloomberg-analyst-says-air-pocket-on-bitcoin-chart-could-trigger-btc-explosion-to-39000/\">Bloomberg Analyst Says ‘Air Pocket’ on Bitcoin Chart Could Trigger BTC Explosion to $39,000</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]