[
  {
    "source": "Decrypt",
    "date": "2024-02-29T17:21:04.000Z",
    "title": "Solana Surge: SOL Nears 2-Year High Price as Crypto Traders Look Beyond Bitcoin",
    "url": "https://decrypt.co/219713/solana-surge-nears-2-year-high-price-beyond-bitcoin",
    "description": "Bitcoin is booming, but Solana is the biggest gainer in the top 5 coins—and its biggest meme coins are mooning hard, too."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-29T17:36:43.000Z",
    "title": " Prominent short-seller Citron targets Coinbase stock after exchange outage ",
    "url": "https://cointelegraph.com/news/prominent-short-seller-citron-targets-coinbase-stock-after-exchange-outage",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMDk5ZTQyOWUtYjIzZC00MTk5LWEwMDktNzBkMmIyNjhlODcxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The crypto exchange quickly repaired the outage on Feb. 28 with no further disruption to users. </p>\n                    <p><p>Investment research firm Citron, founded by prominent Wall Street short-seller Andrew Left, has called for the short sale of Coinbase (COIN) stock after the exchange's temporary outage on Feb. 28.</p><p>Institutional investors frequently long one asset and short another as a hedging move, betting that the long asset will increase in value and the underlying short asset will lose value in a divergence trade. On Feb. 28, Coinbase, along with other crypto exchanges, suffered a temporary outage as a result of a Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) flash crash that saw a 10% decrease in the price of the digital asset before paring losses.</p><p>During the Coinbase outage, users <a href=\"https://cointelegraph.com/news/coinbase-users-report-zero-balance-bug-btc-bitcoin-price-64-k\">reported zero account balances</a> and errors in buying and selling. \"All customer account balance display issues have been restored on http://Coinbase.com. Thank you to all of our customers for your patience today,\" the exchange <a href=\"https://twitter.com/CoinbaseSupport/status/1763073807680520527\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in a follow-up message on Feb. 29. </p><p><a href=\"https://cointelegraph.com/news/prominent-short-seller-citron-targets-coinbase-stock-after-exchange-outage\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-29T17:30:02.000Z",
    "title": "Outdated life insurance settlement model gets a Core blockchain makeover",
    "url": "https://cryptoslate.com/outdated-life-insurance-settlement-model-gets-a-core-blockchain-makeover/",
    "description": "<p>Core Blockchain development company ARAX and bond issuer Longevity Capital Company (LCC) have partnered to introduce a blockchain-based solution for the life insurance settlement investment sector. Aiming to redefine the life settlement bond market, ARAX and LCC have unveiled a collaboration that has led to the creation of a tokenized fractional life settlement bond platform, [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/outdated-life-insurance-settlement-model-gets-a-core-blockchain-makeover/\">Outdated life insurance settlement model gets a Core blockchain makeover</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-29T17:24:10.000Z",
    "title": "Green Bitcoin Presale Raises $1M as Bitcoin Approaches its ATH",
    "url": "https://cryptodaily.co.uk/2024/02/green-bitcoin-presale-raises-1m-as-bitcoin-approaches-its-ath",
    "description": "Green Bitcoin Presale Raises $1M as Bitcoin Approaches its ATH"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T17:21:26.000Z",
    "title": "Green Bitcoin Presale Raises $1M as Bitcoin Approaches its ATH",
    "url": "https://www.cryptopolitan.com/green-bitcoin-presale-raises-1m-as-bitcoin-approaches-its-ath/",
    "description": "London, United Kingdom, February 29th, 2024, Chainwire The eco-friendly crypto project Green Bitcoin has seen its limited-time presale phase cross $1 million in funding. With an innovative gamified staking model and energy-efficient foundation, Green Bitcoin offers token holders a way to stake their tokens and generate yield. Gamified Staking Model Offers Unique Way to Earn [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-29T17:23:54.000Z",
    "title": "Hedge fund LedgerPrime rebrands post-FTX bankruptcy",
    "url": "https://crypto.news/ledgerprime-rebrand-ftx-bankruptcy/",
    "description": "The digital asset hedge fund LedgerPrime has been rebranded as MNNC Group with new funding and former team members following FTX's bankruptcy."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-29T17:30:23.000Z",
    "title": "Crypto Expert Reveals Why Bitcoin Can Rise To $400,000",
    "url": "https://www.newsbtc.com/news/bitcoin/why-bitcoin-can-rise-to-400000/",
    "description": "February was undoubtedly an amazing month for Bitcoin, with the cryptocurrency going on a 39% surge to cross over $60,000. Notably, price history has shown this is the second most profitable February in the history of Bitcoin and the most profitable February in 11 years.  Indeed, many market players have anticipated this price surge to continue throughout 2024 as the next Bitcoin halving approaches. According to an analysis from trading expert Peter Brandt, the price of BTC is set to skyrocket to $400,000 after the next halving. Crypto Expert Peter Brandt Predicts Bullish BTC Price Points After Halving Bitcoin halvings, which slashes the mining reward for miners into two, are known to trigger massive bull runs before and after they are completed. Indeed, the pre-halving bull run seems to have repeated itself, as Bitcoin has jumped over multiple resistance levels since the beginning of January and is now nearing its all-time high of $69,000, which it reached in November 2021. Related Reading: Cardano Adoption Explodes: ADA Price Ready To Reclaim $3.1 All-Time High? Brandt&#8217;s analysis is majorly based on gains after past halvings as a percentage of gains before halvings. Consequently, the analyst projected past price behavior into the future after April&#8217;s halving is completed.  Per his analysis, BTC&#8217;S current cycle reached its low in November 2022 and is now at 75 bars (weekly bars). If the bull trend extends 75 bars after the next halving, a price high of $150,000 is estimated to occur in early October 2025.  Brandt&#8217;s analysis also pointed out three different scenarios that occurred after the last three halvings. After the first halving in 2012, Bitcoin went on a 5x gain as a percentage of its pre-halving gains. If the same were to happen after 2024&#8217;s halving, Bitcoin could reach $275,000.  Similarly, 2016&#8217;s halving saw Bitcoin going on an 8x gain of its pre-halving gains. If Bitcoin were to go on a similar 8x route, it could reach as high as $400,000 before the next market phase. Lastly, 2020&#8217;s halving produced a modest 2x return of its pre-halving gains. A 2x repeat applied to a BTC price of $50,000 would see the crypto reaching $100,000 at the end of the current market phase.  Bitcoin Set To Keep Shining At the time of writing, Bitcoin is trading at $62,600, up by 21.25% in the past seven days. From a technical perspective, Bitcoin looks prime to continue on its bull run in the current market cycle with virtually no resistance Related Reading: Here Are The Factors Driving The Shiba Inu Recovery Above $0.00001 On-chain fundamentals point to increased accumulation from traders. Data shows that even short-term holding whales are now sitting on over $7.3 billion in unrealized profit, but they still continue to hold. If this bullish sentiment continues, we could see Bitcoin reaching a new all-time high in March. BTC price holds above $62,000 &#124; Source: BTCUSD on Tradingview.com Featured image from Earth.Org, chart from Tradingview.com"
  }
]