[
  {
    "source": "CoinDesk",
    "date": "2023-12-14T15:53:01.000Z",
    "title": "Crypto Trader Turns $1K Into $100K on Solana’s Newest Memecoin, Dogwifhat       ",
    "url": "https://www.coindesk.com/markets/2023/12/14/crypto-trader-turns-1k-into-100k-on-solanas-newest-memecoin-dogwifhat/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Dogwifhat (WIF) memecoin is Solana's latest joke token. One trader turned $1000 into $100000 buying it."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-14T15:50:51.000Z",
    "title": "Protocol Village: Metagood, Behind OnChainMonkey NFTs, Raises $5M Seed Round",
    "url": "https://www.coindesk.com/tech/2023/12/13/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Dec 14-Dec. 20, with live updates throughout."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-14T15:55:48.000Z",
    "title": "Ledger security breach triggers Bitcoin tumble and $83 million in liquidations",
    "url": "https://cryptoslate.com/insights/ledger-security-breach-triggers-bitcoin-tumble-and-83-million-in-liquidations/",
    "description": "<p>Quick Take Bitcoin&#8217;s value experienced significant fluctuation just before the opening of the U.S. market, likely triggered by news of a security breach in Ledger&#8217;s library. The fallout sent Bitcoin tumbling to a low of $41,500. The compromised library compelled Ledger to release an update to rectify the issue swiftly. As this drama unfolded, it [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/ledger-security-breach-triggers-bitcoin-tumble-and-83-million-in-liquidations/\">Ledger security breach triggers Bitcoin tumble and $83 million in liquidations</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-14T16:03:05.000Z",
    "title": "Cardano (ADA) and Solana (SOL) Surge Ahead with Bold Predictions for 2024! Why These Coins Are Poised for Explosive Growth?",
    "url": "https://cryptodaily.co.uk/2023/12/cardano-ada-and-solana-sol-surge-ahead-with-bold-predictions-for-2024-why-these-coins-are-poised-for-explosive-growth",
    "description": "Learn why Cardano (ADA) and Solana (SOL) are positioned for significant growth in 2024, riding the bullish momentum in the market. Gain insights into the technical factors influencing these top coins and anticipate potential price movements. Stay informed about the crypto landscape's evolution as ADA and SOL signal a promising path forward."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-14T16:00:41.000Z",
    "title": "Crypto Whales Shift Holdings: Cardano (ADA) and Solana (SOL) Surge, Pullix (PLX) Emerges as Top Contender",
    "url": "https://cryptodaily.co.uk/2023/12/crypto-whales-shift-holdings-cardano-ada-and-solana-sol-surge-pullix-plx-emerges-as-top-contender",
    "description": "With the bull market approaching, crypto whales have increased their rate of accumulating Cardano, Solana, and Pullix coins."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-14T15:55:52.000Z",
    "title": "Polkadot (DOT) and Algorand (ALGO) Go Bullish, Can They Sustain The Momentum? Meme Moguls (MGLS) Could Have Higher Growth Potential",
    "url": "https://cryptodaily.co.uk/2023/12/polkadot-dot-and-algorand-algo-go-bullish-can-they-sustain-the-momentum-meme-moguls-mgls-could-have-higher-growth-potential",
    "description": "Polkadot and Algorand have risen more than 100% in the past few weeks. This impressive growth has left many wondering if these two cryptocurrencies can continue their bullish run or if investors should move to alternatives."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T16:04:42.000Z",
    "title": "Honkai Star Rail Codes December 2023: Claim Your Free Rewards",
    "url": "https://www.cryptopolitan.com/honkai-star-rail-codes-december-2023-claim-your-free-rewards/",
    "description": "Honkai Star Rail, the popular gacha game developed by Hoyoverse, continues to captivate players worldwide. To enhance your gaming experience, the developers frequently release special codes that grant valuable in-game rewards. In this article, we will provide you with the most up-to-date Honkai Star Rail codes for December 2023, along with instructions on how to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T15:49:39.000Z",
    "title": "Hitachi and Concordium collaborate to create a biometric crypto wallet",
    "url": "https://www.cryptopolitan.com/hitachi-concordium-biometric-crypto-wallet/",
    "description": "In a collaborative effort, Hitachi Research &#38; Development and blockchain developer Concordium Foundation are working on a pioneering project—an innovative biometric cryptocurrency wallet. The joint initiative aims to establish a “proof of technology” for this novel wallet, designed to offer enhanced security and convenience for users. Hitachi aims to revolutionize interaction with the wallet The [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-14T16:06:24.000Z",
    "title": "Cardano adds 17% as analysts monitor 3 altcoins",
    "url": "https://crypto.news/cardano-adds-17-as-analysts-monitor-3-altcoins/",
    "description": "Cardano is rallying. Amid this, analysts have been monitoring three tokens, including Bitcoin ETF Token"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-14T15:52:45.000Z",
    "title": "Bitget implements mandatory KYC for enhanced security",
    "url": "https://crypto.news/bitget-implements-mandatory-kyc-for-enhanced-security/",
    "description": "Bitget, the world's 10th largest cryptocurrency exchange, is implementing comprehensive Know Your Customer (KYC) requirements for all English-speaking users. "
  },
  {
    "source": "BTCManager",
    "date": "2023-12-14T15:50:26.000Z",
    "title": "OKX’s OKB repurchase hits record $630m in burning event",
    "url": "https://crypto.news/okxs-okb-repurchase-hits-record-630m-in-burning-event/",
    "description": "In its 22nd repurchase and burning event on Dec. 14, OKX removed approximately 10.53 million OKB, valued at around $630 million. "
  },
  {
    "source": "BTCManager",
    "date": "2023-12-14T15:41:36.000Z",
    "title": "Bonk gains 48% in a day, trading volume surges over Shiba Inu",
    "url": "https://crypto.news/bonk-gains-trading-volume-surges-shiba-inu/",
    "description": "Solana’s memecoin Bonk has gained nearly 50% in the past 24 hours following its listing on Coinbase and the launch of its Telegram trading bot. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-14T16:00:15.000Z",
    "title": "Bitcoin Deja Vu: Capital Inflows Mirror Pre-2021 Bull Run Momentum",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-capital-inflows-2021-bull-run-momentum/",
    "description": "On-chain data shows the cryptocurrency capital inflows currently look similar to December 2020, right before Bitcoin rallied from $18,000 to $65,000. Bitcoin &#38; Ethereum Are Getting $19.7 Billion In Capital Injections Currently As explained by analyst Ali in a new post on X, Bitcoin and Ethereum are receiving a large amount of capital inflows currently. To showcase these positive flows, the analyst has referred to the &#8220;BTC + ETH Net Position Change&#8221; indicator from the on-chain analytics firm Glassnode. What this metric does is that it keeps track of the 30-day change taking place in the combined realized cap of these top two cryptocurrencies. The &#8220;realized cap&#8221; here basically refers to the total amount of capital (in USD) that investors have used to purchase a given asset. As such, the metric&#8217;s net position change could provide hints about whether the total money invested into the coin in question has gone up or down during the past month. Related Reading: Santiment Points Out Trigger Behind 65% Cardano Rally Now, here is a chart that shows the trend in this indicator for Bitcoin and Ethereum over the past few years: The value of the metric appears to have been going up in recent days &#124; Source: @ali_charts on X As displayed in the above graph, the Bitcoin + Ethereum Net Position Change has been inside the positive territory recently and has only been climbing up. The trend naturally makes sense, as both of the assets have registered some sharp rises during the past month. Currently, the indicator has a value of $19.7 billion. As Ali has pointed out, &#8220;This is around the same capital inflow we saw back in December 2020 before BTC surged from $18,000 to $65,000!&#8221; In the same chart, data for two other metrics is also shown. The first is the &#8220;Stablecoin Net Position Change,&#8221; which, as its name suggests, keeps track of the monthly inflows and outflows for the major USD stablecoins in the sector. Unlike Bitcoin and Ethereum, though, this metric doesn&#8217;t make use of the realized cap, but simply the supply of the stables. This is obviously due to the fact that these coins have mostly the same value at all points, so the realized cap wouldn&#8217;t be any different from the market cap (which itself is equivalent to the supply as the price is $1). From the chart, it&#8217;s visible that the stablecoins have also enjoyed positive inflows recently. This means that all three major asset classes in the sector, Bitcoin, Ethereum, and the stables, are receiving capital injections currently. Most of the capital inflows and outflows towards the cryptocurrency sector happen through these three. The altcoins only receive their capital through a rotation from these core assets. Related Reading: Dogecoin Sell Signal Goes Off: Analyst Predicts Targets Thus, the stablecoins and top two cryptocurrencies simultaneously enjoying positive inflows have historically been a very bullish combination for the sector as a whole. This constructive combination didn&#8217;t form for most of this year but finally has during this latest leg in the rally. The last indicator on the chart keeps track of the net incomings and outgoings from the sector as a whole by simply summing up the netflows for BTC + ETH and the stables. As is apparent, this metric also has a value similar to December 2020 at the moment. Looking at Bitcoin&#8217;s historical performance following December 2020, it could mean that the BTC price is set for another price surge going forward. BTC Price Bitcoin had recovered above the $43,000 level just earlier, but it appears the coin has seen a setback as it&#8217;s now once again trading below the mark. Looks like the price of the asset has shot up during the past day &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-14T16:00:00.000Z",
    "title": "Cardano Whales Move In! ADA Price Hits 17-Month High Amid DeFi Boom",
    "url": "https://coinedition.com/cardano-whales-move-in-ada-price-hits-17-month-high-amid-defi-boom/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/12/cardano-11.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/12/cardano-11.jpg 730w, https://coinedition.com/wp-content/uploads/2023/12/cardano-11-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/12/cardano-11-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/12/cardano-11-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/12/cardano-11-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/12/cardano-11-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/12/cardano-11-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/12/cardano-11-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/12/cardano-11-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/12/cardano-11-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/12/cardano-11-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/12/cardano-11-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/12/cardano-11-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/12/cardano-11-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/12/cardano-11-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/12/cardano-11-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cardano&#8217;s ADA token has experienced a significant surge in whale transactions, exceeding $1.5 billion. This influx of large-scale investments, characterized by individual transactions valued at a minimum of $100,000, has elevated the total transaction volume to a remarkable $19.47 billion. The boost in these substantial transactions highlights major investors&#8217; increasing interest in cryptocurrency. ADA&#8217;s Price [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/cardano-whales-move-in-ada-price-hits-17-month-high-amid-defi-boom/\">Cardano Whales Move In! ADA Price Hits 17-Month High Amid DeFi Boom</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]