[
  {
    "source": "Decrypt",
    "date": "2023-10-27T13:57:49.000Z",
    "title": "New dYdX Chain Denominates Trading Fees in USDC",
    "url": "https://decrypt.co/203480/new-dydx-chain-denominate-trading-fees-usdc",
    "description": "Stakers and validators will also earn all of the newly launched chain's fees for helping to secure the dYdX Chain. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-27T13:50:16.000Z",
    "title": "dYdX launches layer 1 blockchain, validators and stakers set to receive all fees",
    "url": "http://cointelegraph.com/news/dydx-dex-launches-layer-1-blockchain",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/963f0529-63d0-4db8-baf6-2a280a1ecc1a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>dYdX completes the launch of its layer 1 proof-of-stake blockchain with the creation of its genesis block by chain validators. </p>\n                    <p><p>Decentralized cryptocurrency exchange dYdX has launched its layer 1 blockchain with the creation of its genesis block which will operate using native DYDX tokens.</p><p>The dYdX Chain is set to distribute all fees to validators and stakers in USD Coin (USDC). This includes trading fees denominated in USDC as well as gas fees for DYDX-denominated transactions or USDC-denominated transactions.</p><p>The proof-of-stake (PoS) blockchain network was built using Cosmos’ software development kit and makes use of CometBFT as its consensus protocol. Validators stake DYDX in order to secure the blockchain and carry out governance operations of the network.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The launch of the dYdX Chain network itself spanned a massive number of companies:<br><br> <a href=\"https://twitter.com/dydx_ops_subdao?ref_src=twsrc%5Etfw\">@dydx_ops_subdao</a> coordinating genesis &amp; launch generally + hosting indexer &amp; frontend<br> <a href=\"https://twitter.com/dydxfoundation?ref_src=twsrc%5Etfw\">@dydxfoundation</a> coordinating community governance<br> <a href=\"https://twitter.com/noble_xyz?ref_src=twsrc%5Etfw\">@noble_xyz</a>, <a href=\"https://twitter.com/circleapp?ref_src=twsrc%5Etfw\">@circleapp</a>, <a href=\"https://twitter.com/coinbase?ref_src=twsrc%5Etfw\">@coinbase</a> for launching…</p>&mdash; Antonio | dYdX (@AntonioMJuliano) <a href=\"https://twitter.com/AntonioMJuliano/status/1717653138889437280?ref_src=twsrc%5Etfw\">October 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Antonio Juliano, dYdX founder, highlighted that the launch of the dYdX Chain hinged on the likes of Circle and Coinbase launching on Cosmos in time for the creation of its genesis block. Juliano previously described dYdX as an \"entirely new blockchain built on Cosmos SDK\" and the \"first-ever decentralized, offchain orderbook\". The blockchain is also entirely open-source.</p><p>Before the launch of dYdX’s native layer 1 chain, the original DYDX was an ERC-20 token operating on dYdX’s original Ethereum layer 2 protocol. To facilitate the transition to its own layer 1 chain, the dYdX community voted to adopt DYDX as the L1 token of the dYdX Chain, adopt a one-way bridge from Ethereum to the dYdX Chain and to give wrapped Ethereum DYDX (wethDYDX) the same governance utility as ethDYDX in dYdX v3. </p><p>As a result of community votes and governance outcomes, the utility of the DYDX token has expanded to be used for staking, securing the network and assisting with governance on the dYdX Chain. </p><p>Similar to Ethereum’s transition to PoS, stakers and validators secure and protect the network and receive dYdX protocol feels in proportion to their staked assets. Fees collected by the dYdX Chain protocol are distributed to validators and stakers<strong> </strong>through the Cosmos distribution module.</p><p>An announcement from dYdX highlighted its expectation that the governance on the dYdX chain will be more accessible than its previous, Ethereum-based layer 2 protocol:</p><blockquote>“The dYdX Chain does not have the dYdX v3 concept of ‘Proposing Power’; instead, the governance module effectively enables any holder to create a governance proposal with a deposit.”</blockquote><p>Provisions to combat spam proposals include minimum deposit thresholds and voting mechanisms with veto powers. Users can only used staked DYDX tokens to participate in chain governance.</p><p>Chain validators will also inherit the voting weight of stakers, unless specific stakers opt to vote on proposals individually.</p><p><a href=\"https://cointelegraph.com/magazine/ethereum-restaking-blockchain-dangerous/\"><strong><em>Magazine: Ethereum restaking: Blockchain innovation or dangerous house of cards?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-27T13:40:24.000Z",
    "title": "Chainlink (LINK) Price Analysis: LINK On The Rise Following Vodafone DAB Partnership",
    "url": "https://cryptodaily.co.uk/2023/10/chainlink-link-price-analysis-link-on-the-rise-following-vodafone-dab-partnership",
    "description": "Vodafone’s Digital Asset Broker (DAB) has joined forces with Chainlink Labs to demonstrate that global trading operations can be conducted successfully on the blockchain."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-27T13:56:14.000Z",
    "title": "Warzone Mobile Gains Over 45 Million Pre-Registrations Ahead of Spring 2024 Launch",
    "url": "https://www.cryptopolitan.com/warzone-over-45-million-pre-registrations/",
    "description": "As the iconic Call of Duty franchise marks its 20th anniversary, Activision has revealed an astonishing milestone for its upcoming title, Call of Duty: Warzone Mobile. With a spring 2024 release on the horizon, the game has already garnered over 45 million pre-registrations, reflecting the immense anticipation among fans. This announcement comes as a pleasant ... <a title=\"Warzone Mobile Gains Over 45 Million Pre-Registrations Ahead of Spring 2024 Launch\" class=\"read-more\" href=\"https://www.cryptopolitan.com/warzone-over-45-million-pre-registrations/\" aria-label=\"More on Warzone Mobile Gains Over 45 Million Pre-Registrations Ahead of Spring 2024 Launch\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-27T13:48:12.000Z",
    "title": "Metropolitan Police’s Use of Facial Recognition Sparks Controversy",
    "url": "https://www.cryptopolitan.com/metropolitan-polices-use-facial-recognition/",
    "description": "The Metropolitan Police Service&#8217;s deployment of live facial recognition (LFR) technology in Westminster has been branded as an &#8220;Orwellian mass surveillance tool&#8221; by civil rights campaigners. Big Brother Watch, a leading privacy advocacy group, has raised alarms over the police&#8217;s use of this technology, especially after its deployment at least eight times since its pilot ... <a title=\"Metropolitan Police&#8217;s Use of Facial Recognition Sparks Controversy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/metropolitan-polices-use-facial-recognition/\" aria-label=\"More on Metropolitan Police&#8217;s Use of Facial Recognition Sparks Controversy\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-27T13:42:22.000Z",
    "title": "Trezor investigates online fraud targeting crypto wallet users",
    "url": "https://www.cryptopolitan.com/trezor-investigates-online-fraud/",
    "description": "Trezor, a leading cryptocurrency hardware wallet provider, is currently conducting an investigation into a recent phishing campaign that has targeted its users. Reports of phishing emails aimed at Trezor customers prompted the company to take swift action to address the issue. In a recent development, cryptocurrency hardware wallet provider Trezor has found itself embroiled in ... <a title=\"Trezor investigates online fraud targeting crypto wallet users\" class=\"read-more\" href=\"https://www.cryptopolitan.com/trezor-investigates-online-fraud/\" aria-label=\"More on Trezor investigates online fraud targeting crypto wallet users\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-27T14:07:56.000Z",
    "title": "Polkadot developers consider deflationary mechanisms",
    "url": "https://crypto.news/polkadot-developers-consider-deflationary-mechanisms/",
    "description": "The Polkadot network is exploring ways to implement deflationary mechanisms to counterbalance inflation and accrue value for DOT token holders."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-27T14:00:20.000Z",
    "title": "Bitcoin and Ether record low trading volumes on South Korea’s biggest crypto exchange",
    "url": "https://crypto.news/bitcoin-and-ether-record-low-trading-volumes-on-south-koreas-biggest-crypto-exchange/",
    "description": "A recent report revealed that altcoin trading in the South Korean cryptocurrency market was high, in contrast to majors like Bitcoin (BTC) and Ether (ETH) where trading activity has declined in comparison. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-27T13:40:02.000Z",
    "title": "FLOKI Outmuscles Top 100 Cryptos With 134% Price Explosion – Details",
    "url": "https://www.newsbtc.com/news/floki-outmuscles-top-100-cryptos-with-134-price-explosion-details/",
    "description": "FLOKI, in the dynamic and continually evolving world of cryptocurrency, stands as a noteworthy contender, demanding serious consideration within the distinctive and inherently speculative market of meme coins. FLOKI, a cryptocurrency that draws inspiration from Elon Musk and derives its name from his Shiba Inu companion Floki, has exhibited a notable surge in value, with a 26% price appreciation observed over the course of the past 24 hours. At the time of writing, FLOKI was trading at $0.000038, and registered a commanding 134% increase in the last seven days, surpassing today&#8217;s top 100 roster of cryptocurrencies, according to data by crypto market tracker Coingecko. The recent increase in value aligns with the forthcoming introduction of FLOKI&#8217;s eagerly awaited staking initiative scheduled for October 27, 2023. We will be launching the $FLOKI staking program on the 27th of October, 2023. To ensure a sustainable staking program, we will also be launching a sister token that #Floki stakers will earn as rewards. This token is a utility token that targets an industry with trillion dollar… pic.twitter.com/VRWJKUFeLd — FLOKI (@RealFlokiInu) October 25, 2023 Related Reading: PEPE Price Leaps 90% As Meme Coin Reaches Over 155,000 On-Chain Wallets The Role Of Staking In Cryptocurrency Many people in the cryptocurrency industry and among FLOKI&#8217;s investment base are looking forward to the next staking project. Staking is a key component of blockchain technology, enabling cryptocurrency holders to support network security and maintenance while earning rewards by locking up their assets. This active participation benefits both the blockchain&#8217;s stability and stakers, who receive passive income in the form of new tokens or transaction fees. Staking encourages long-term commitment and community engagement in the cryptocurrency space. FLOKI&#8217;s recent 26% single-day price spike enabled the meme coin to tally a high not seen in several months and entering a price range between $0.00003235 and $0.00003500. To keep this positive trend going, the meme coin needs to surpass the $0.00003368 mark. If it manages to do so, it might continue climbing and reach the $0.00003501 mark, or in a very optimistic scenario, even go up to $0.00004000. Related Reading: Shiba Inu Reverses December Downtrend – Good Days Ahead For Investors? FLOKIUSDT currently trading at $0.00003901 on the daily chart: TradingView.com The Hype Around FLOKI Staking Launch The staking launch offers FLOKI holders an opportunity to accrue further FLOKI incentives solely by retaining ownership of the token. It is not surprising that FLOKI prices have experienced a significant increase in value due to the anticipation around its upcoming introduction. The forthcoming launch event will additionally provide pertinent information regarding its affiliated digital asset, TokenFi, denoted by the ticker symbol $TOKEN. Consequently, this development is expected to generate significant anticipation for the aforementioned meme token, leading to a substantial increase in its market value. Meanwhile, Coincodex forecasts that by October 27 the price of Floki Inu will have dropped by 7.26 percent, to USD 0.00002352. The Fear &#38; Greed index is currently at 53, which is neutral despite the bullish signals from the technical indicators. Based on Floki Inu&#8217;s past price patterns, we can estimate that it will be worth as little as 0.00002205 USD in 2024, and as much as 0.00005826 USD in 2025. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-27T14:00:46.000Z",
    "title": "Pepe Coin’s Price Rally Outshines Shiba Inu and Dogecoin, But Can this New Meme Coin Take the Spotlight?",
    "url": "https://www.crypto-news-flash.com/pepe-coins-price-rally-outshines-shiba-inu-and-dogecoin-but-can-this-new-meme-coin-take-the-spotlight/?utm_source=rss&utm_medium=rss&utm_campaign=pepe-coins-price-rally-outshines-shiba-inu-and-dogecoin-but-can-this-new-meme-coin-take-the-spotlight",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-71.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-71.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-71-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency landscape of 2023 is pulsating with energy, marked by both the dominance of established giants and the emergence of ambitious newcomers. Pepe Coin, the latest meme coin entrant, has been creating waves, garnering significant attention as it challenges the likes of Shiba Inu and Dogecoin. Yet, within this fervent backdrop, ApeMax stands out, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-27T13:56:00.000Z",
    "title": "Deribit Notional OI Hits $20B, While $4.5B BTC, ETH Options Set to Expire",
    "url": "https://coinedition.com/deribit-notional-oi-hits-20b-while-4-5b-btc-eth-options-set-to-expire/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/10/BTC-and-ETH-2-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The notional open interest (OI), representing the dollar value locked in active Bitcoin (BTC) and Ethereum (ETH) options contracts on the renowned derivative exchange Deribit, has surged to $20.64 billion. Reportedly, this remarkable milestone closely echoes the Bitcoin peak in November 2021, when it traded over $66,000. Effectively, the current $20.64 billion in notional open [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/deribit-notional-oi-hits-20b-while-4-5b-btc-eth-options-set-to-expire/\">Deribit Notional OI Hits $20B, While $4.5B BTC, ETH Options Set to Expire</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-27T13:40:13.000Z",
    "title": "Floki Inu (FLOKI) Price Prediction 2023-2030: Will FLOKI Price Hit $0.000055 Soon?",
    "url": "https://coinedition.com/floki-inu-floki-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Floki-Inu-FLOKI-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Floki-Inu-(FLOKI)-Price-Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Floki-Inu-FLOKI-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Floki-Inu-FLOKI-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Floki-Inu-FLOKI-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Floki-Inu-FLOKI-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Floki-Inu-FLOKI-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Shiba Inu (SHIB) fans and members of the community created the dog-themed meme coin Floki Inu (FLOKI), which refers to itself as &#8220;a movement&#8221; rather than a meme coin. The Shiba Inu owned by Elon Musk is honored by the coin. If you are interested in the future of FLOKI and want to know its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/floki-inu-floki-price-prediction/\">Floki Inu (FLOKI) Price Prediction 2023-2030: Will FLOKI Price Hit $0.000055 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]