[
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T11:36:39.000Z",
    "title": "Ripple’s XRP gains stablecoin status from World Bank",
    "url": "https://www.cryptopolitan.com/ripples-gain-stablecoin-status-from-world-bank/",
    "description": "The World Bank has officially recognized Ripple&#8217;s native cryptocurrency, XRP, as a stablecoin. This classification marks a significant milestone for Ripple and its digital asset, underscoring its growing acceptance and utility in the global financial landscape. The discussion around this development was sparked by a tweet from a well-known Ripple supporter, leading to further insights [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T11:31:57.000Z",
    "title": "USDC Anywhere Launches: Revolutionizing DeFi with Cross-Chain Accessibility",
    "url": "https://www.cryptopolitan.com/usdc-anywhere-defi-cross-chain-accessibility/",
    "description": "In the rapidly evolving world of digital finance, a groundbreaking innovation has emerged, poised to redefine the landscape of decentralized finance (DeFi) and blockchain technology. Today marks the official launch of &#8220;USDC Anywhere,&#8221; a revolutionary feature from Circle, the creators of the highly popular stablecoin USDC. The new feature is set to transform the way [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T11:22:31.000Z",
    "title": "What Are the Implications of Opera Buying Nvidia H100 Super Computer?",
    "url": "https://www.cryptopolitan.com/implications-of-opera-buying-nvidia-h100/",
    "description": "Last week, the popular browser Opera announced it’s deploying an AI cluster this month in Keflavik, Iceland. The facility will reportedly feature NVIDIA DGX SuperPOD, which is powered by the expensive and highly sought-after Nvidia H100 GPU-esque processor.&#160; Different meanings can be read from this move by Opera. However, the highlight of it all is [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-15T11:32:48.000Z",
    "title": "Crypto whales invest $120M to spark Ripple (XRP) price rally ",
    "url": "https://crypto.news/crypto-whales-invest-120m-to-spark-ripple-xrp-price-rally/",
    "description": "Ripple (XRP) price peaked at $0.56 on Feb. 15, but crypto whales looking to exploit its undervalued status could trigger more bullish action\n"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-15T11:25:58.000Z",
    "title": "eTukTuk raises $1m in presale as investors fight climate change",
    "url": "https://crypto.news/etuktuk-raises-1m-in-presale-as-investors-fight-climate-change/",
    "description": "eTukTuk has raised $1 million in its presale, marking a monumental milestone in its fight against climate change"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-15T11:21:23.000Z",
    "title": "Coinbase shares up 14% ahead of Q4 2023 earnings report",
    "url": "https://crypto.news/coinbase-shares-up-14-ahead-of-q4-2023-earnings-report/",
    "description": "Although analysts expect Coinbase revenue for Q4 2023 to be up 40% from Q3, this did not stop ARK Invest from dumping $33.6 million worth of COIN shares. Shares of the U.S.-based cryptocurrency exchange Coinbase (Nasdaq: COIN) have surged nearly&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-15T11:18:53.000Z",
    "title": "ARK Invest sells shares in Coinbase and Robinhood amidst positive market performance",
    "url": "https://crypto.news/ark-invest-sells-shares-in-coinbase-and-robinhood-amidst-positive-market-performance/",
    "description": "ARK Invest, a key player in the issuance of a spot Bitcoin exchange-traded fund (ETF) in the United States, has executed its first major sale of cryptocurrency-related stocks this year.  On Feb. 14, the firm divested itself of 214,068 shares&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-15T11:30:45.000Z",
    "title": "$52,000 And Climbing: Bitcoin Eyes New Highs This March, Predicts Top Firm",
    "url": "https://www.newsbtc.com/bitcoin-news/52000-and-climbing-bitcoin-eyes-new-highs-this-march-predicts-top-firm/",
    "description": "Bitcoin has been on an absolute tear, surpassing $52,000 for the first time since December 2021. The leading digital asset has already climbed over 23% in 2024, and a major driver of this meteoric rise has been the influx of institutional money entering the space through spot Bitcoin ETFs.  Related Reading: Bitcoin Price Alert: X Account’s Analysis Suggests Sub-$10K Drop – Here’s The Reasoning Bitcoin’s mainstream credibility among traditional investors has been growing since the beginning of February, with ETFs registering between $400 million and $650 million in daily inflows in the past week. At the same time, BTC call options have seen a massive rise.  This bullish sentiment has prompted investors to begin anticipating the moment when BTC would achieve a new all-time high. According to analysts at QCP Capital, a crypto asset trading firm, Bitcoin is set to reach a new all-time high before the end of March 2024. Top Firm Predicts Bitcoin Can Reach New All-Time High Before April Bitcoin&#8217;s current all-time high of $69,044 has looked like an insurmountable mountain for the past two years, especially during the prolonged bear market in 2022, which saw BTC trading below $17,000. However, things have changed since that time, and current metrics point to the price of Bitcoin blasting past this price point in the coming months.  This change in sentiment can mainly be attributed to the attention around spot Bitcoin ETFs. Although Bitcoin seemed to struggle behind a sell-the-news event for weeks after these ETFs hit the market, the situation has since turned positive. According to data from BitMEX Research, Bitcoin ETFs have witnessed massive inflows led by BlackRock&#8217;s ETFs in the past week. At the same time, outflows from Grayscale&#8217;s GBTC have slowed down. Consequently, the ETFs have received a steady $400 million to $650 million in daily inflows, which works out to 8,000 to 12,000 BTC bought daily.  Notably, trading hit historic highs on February 14th, with the top nine ETFs hitting $1.5 billion in trading volume. What&#8217;s Driving The BTC Price Rally? QCP Capital credits this increasing institutional investment in Bitcoin as a critical driver of future growth. Analysts expect this inflow to continue as BTC becomes increasingly popular among traditional investors and global liquidity rotates into the spot ETFs, allowing it to break past its all-time high before April.  Related Reading: Bitcoin Price Rally To $75,000 Imminent Due To Massive Cup And Handle Pattern The analysts also looked at the massive purchases of BTC call options, noting how $10 million was spent in the past week on premiums for $60,000 to $80,000 strikes expiring from April to December. This price point is exciting, as it indicates many investors are already looking forward to Bitcoin breaking past $69,000 in the coming months.  Predictions can be hit or miss, but Bitcoin seems poised to continue its meteoric rise in value. It&#8217;s also important to note that the next Bitcoin halving, slated for April 2024, is steadily approaching.  Cover image from Dall-E, Chart from Tradingview"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-15T11:22:21.000Z",
    "title": "February’s Trio of Altcoins Under $1 with High Growth Prospects",
    "url": "https://coinedition.com/februarys-trio-of-altcoins-under-1-with-high-growth-prospects/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/02/PR4-3.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/02/PR4-3.png 730w, https://coinedition.com/wp-content/uploads/2024/02/PR4-3-300x169.png 300w, https://coinedition.com/wp-content/uploads/2024/02/PR4-3-380x214.png 380w, https://coinedition.com/wp-content/uploads/2024/02/PR4-3-696x392.png 696w, https://coinedition.com/wp-content/uploads/2024/02/PR4-3-159x89.png 159w, https://coinedition.com/wp-content/uploads/2024/02/PR4-3-255x143.png 255w, https://coinedition.com/wp-content/uploads/2024/02/PR4-3-313x175.png 313w, https://coinedition.com/wp-content/uploads/2024/02/PR4-3-440x247.png 440w, https://coinedition.com/wp-content/uploads/2024/02/PR4-3-414x233.png 414w, https://coinedition.com/wp-content/uploads/2024/02/PR4-3-293x165.png 293w, https://coinedition.com/wp-content/uploads/2024/02/PR4-3-375x211.png 375w, https://coinedition.com/wp-content/uploads/2024/02/PR4-3-328x185.png 328w, https://coinedition.com/wp-content/uploads/2024/02/PR4-3-144x81.png 144w, https://coinedition.com/wp-content/uploads/2024/02/PR4-3-123x70.png 123w, https://coinedition.com/wp-content/uploads/2024/02/PR4-3-129x73.png 129w, https://coinedition.com/wp-content/uploads/2024/02/PR4-3-355x200.png 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The digital currency market has experienced a notable revival, with Bitcoin&#8217;s value nearing US$52,000 after a widespread surge that also brought Ether, the second biggest cryptocurrency in terms of market cap, back to its levels before the TerraUSD stablecoin debacle. This upswing has pushed the total market value of cryptocurrencies over the US$2 trillion threshold [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/februarys-trio-of-altcoins-under-1-with-high-growth-prospects/\">February&#8217;s Trio of Altcoins Under $1 with High Growth Prospects</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]