[
  {
    "source": "CoinDesk",
    "date": "2023-10-19T15:45:00.000Z",
    "title": "Crypto for Advisors: What Will Trigger Crypto Mass Adoption?",
    "url": "https://www.coindesk.com/business/2023/10/19/crypto-for-advisors-what-will-trigger-crypto-mass-adoption/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Andy Baehr, head of CoinDesk Indices discusses scenarios that could be the drivers of mass adoption in crypto."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-19T16:00:02.000Z",
    "title": "Seed Phraseless Hardware Crypto Wallet Startup Ryder Raises $1.2 Million",
    "url": "https://decrypt.co/202323/ryder-raises-1-million-for-seed-phraseless-hardware-crypto-wallet",
    "description": "\"People just don’t like seed phrases,” said Ryder CEO Louise Ivan, who added that he considers Ledger the company's biggest competitor."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-19T15:47:38.000Z",
    "title": "Clearinghouse DTCC Snaps Up Blockchain Startup Securrency",
    "url": "https://decrypt.co/202383/clearinghouse-dtcc-acquires-blockchain-startup-securrency",
    "description": "The deal will see Securrency become a fully-owned subsidiary of DTCC and operate under the name DTCC Digital Assets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-19T16:00:00.000Z",
    "title": "Crypto leaders: 12 practical tips for effectively working with regulators",
    "url": "https://cointelegraph.com/innovation-circle/crypto-leaders-12-practical-tips-for-effectively-working-with-regulators",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/979d3d0e-2881-4893-a96f-7d2614ddf283.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Only crypto leaders hold the knowledge and enthusiasm to help guide responsible regulations that don’t throttle crypto.</p>\n                    <p><p>The world is interested in crypto. In the United States and European Union, individual investors have shown they are intrigued by its possibilities, while emerging economies are leveraging it to expand access to financial services. This, of course, is attracting the focus of legislators who want to both tap into crypto’s potential and ensure investors and consumers are well-protected. But with crypto’s international footprint, new and dynamic technologies, and built-in anonymity, it’s a challenge to protect users’ privacy and police unlawful activity.</p> <p>It’s likely impossible for regulators to walk the fine line between encouraging innovation and protecting consumers without developing adaptable, deliberate and internationally coordinated regulatory measures — and for that, they need the help of crypto leaders. It’s an effort well worth those leaders’ time if they wish to enhance industry credibility, attract new users and avoid complex (even punitive) legislation that could hinder innovation. Below, 12 members of <a href=\"https://circle.cointelegraph.com/?_ga=2.198681135.1484442309.1667485998-1927108766.1652715111\">Cointelegraph Innovation Circle</a> offer practical tips for crypto leaders on working individually and as an industry with regulators for the benefit of both sides — and the future. </p> <h2>Focus on use cases without specific binary regulatory requirements</h2> <p>The involvement of leaders who are tech-savvy and understand how regulatory systems apply is important. Financial systems and technology were very different when regulations were first developed. Consumer protection and market integrity are still the primary objectives, but the means to achieve them have changed. Leaders can add value by working with regulators to focus on use cases without specific binary regulatory requirements. – <a href=\"https://circle.cointelegraph.com/u/409457b5-4733-4b8b-86d1-114a5633b416\">Tammy Paola</a>, <a href=\"http://zerocap.com\">Zerocap</a></p> <h2>Prioritize transparency and education</h2> <p>Engage proactively with regulators, prioritizing transparency and education. Understand their concerns and position your dialogue as a partnership. Demonstrating a commitment to ethical practices and consumer protection can foster mutual trust and clearer regulatory pathways. – <a href=\"https://circle.cointelegraph.com/u/0d167285-44f8-41a6-9001-72aab6b4058d\">Tomer Warschauer Nuni</a>, <a href=\"http://www.kryptomon.co\">Kryptomon</a></p> <h2>Recognize that regulation can be an ally</h2> <p>Crypto leaders should recognize that regulation can be an ally. Crypto’s “Wild West” nature invites scammers like FTX and Terra, so embracing regulation with thoughtful collaboration helps the ecosystem as a whole, allowing the crypto industry to become more secure and credible while protecting investors. Leaders should encourage transparency and responsible practices, and work with regulators to build trust in the industry. – <a href=\"https://circle.cointelegraph.com/u/1bff9b74-7b61-4788-a1c8-203b31439d85\">Ayelet Noff</a>, <a href=\"https://slicedbrand.com/\">SlicedBrand</a></p> <h2>Document everything regulators tell you</h2> <p>Engage with your regulators, but document everything that they have told you, especially promises or implied support. Know everything there is about applicable laws in your country, and try to stay clear of flagrant violations of those laws. Always know when they are trying to pitch a novel argument to the courts, and know how to defend yourself. – <a href=\"https://circle.cointelegraph.com/u/008ee5ae-3d26-4c82-a558-db3e57e4c769\">Zain Jaffer</a>, <a href=\"http://www.zain-ventures.com\">Zain Ventures</a></p> <h2>Help assuage regulators’ concerns</h2> <p>Approach the conversation from the perspective of assuaging regulators’ concerns. Often when seeking to craft legislation, regulators approach the industry and are met with distrust or even hostility. Businesses should focus on educating and informing governments about the priorities of the industry and how they can get there while not risking contagion to other parts of the financial system. – <a href=\"https://circle.cointelegraph.com/u/e7c3b482-7235-41b4-a853-23df3d932ab9\">Jason Fernandes</a>, <a href=\"http://adlunam.cc\">AdLunam Inc.</a></p> <h2>Listen closely to regulators’ input</h2> <p>In the world of music, crypto is avant-garde jazz, while regulators are more attuned to classical notes. To make harmonious music, listen closely, blend your innovative riffs with their timeless chords, and compose a symphony of progress together. It’s not about overpowering, but about creating a new genre that resonates with all. – <a href=\"https://circle.cointelegraph.com/u/8179044f-5f09-469d-8c72-d17fd6274257\">Arvin Khamseh</a>, <a href=\"http://soldoutnfts.io\">SOLDOUT NFTs</a></p> <h2>Help shape regulations that benefit both sides</h2> <p>Let’s keep in mind that many regulators are in the process of grasping and understanding the Web3 industry. Hence, every Web3 company should contribute to shaping regulations that benefit both sides. The most effective approach involves showing a readiness to cooperate, tackle concerns and educate regulators, fostering the most favorable outcomes possible. – <a href=\"https://circle.cointelegraph.com/u/bcb46b42-12ad-4937-8069-b741c596ef3c\">Sheraz Ahmed</a>, <a href=\"http://storm.partners/\">STORM Partners</a></p> <h2>Consider how similar companies in the industry can work together</h2> <p>Build upon the premise that we will get farther together. Even companies working on the same or similar products should consider how they can work together to achieve goals beyond their individual growth. The industry is still in its infancy, and we will find mainstream adoption and tremendous success together, especially when working with regulators. – <a href=\"https://circle.cointelegraph.com/u/84007b98-8c0e-4c02-8807-ff7876b7765d\">Megan Nyvold</a>, <a href=\"http://bingx.com/en-us/\">BingX</a></p> <h2>Be cautious, compliant and patient</h2> <p>Regulators aim to make things the best they can for all parties involved, but sometimes that process takes time. This is why it’s always a good idea to be cautious and compliant while also being hyper aware that things may not work out at first. Documenting everything and helping to find solutions is recommended, as this space is a work in progress for everyone — but the end goal is the same. – <a href=\"https://circle.cointelegraph.com/u/923e790f-d991-437d-a1eb-575af185daca\">Ilias Salvatore</a>, <a href=\"http://flooz.xyz\">Flooz XYZ</a></p> <h2>Offer direct and clear assistance toward shared goals</h2> <p>As a cousin of trust, transparency should be top of mind for companies seeking to collaborate and build strong foundations with regulators across any jurisdiction. These officials are in place to protect the safety and security of participants in their region. By offering direct and clear assistance toward that goal, crypto leaders can make sure understanding is sustained through mutual respect. – <a href=\"https://circle.cointelegraph.com/u/83c71aad-8be6-470a-aaf9-7f146821217c\">Oleksandr Lutskevych</a>, <a href=\"http://cex.io\">CEX.IO</a></p> <h2>Address myths and false information about crypto</h2> <p>My advice for crypto leaders is that they try to deal with the myths and false information that has been revolving around crypto as an ecosystem. Many of these myths can be addressed through accurate data. For example, the drawbacks of proof-of-work are used to malign the image of the entire world of cryptocurrencies. Another example is working against the image of crypto being used to avoid taxation. – <a href=\"https://circle.cointelegraph.com/u/1d9f8b61-2e77-4452-a837-4db4245d01ca\">Abhishek Singh</a>, <a href=\"http://acknoledger.com/\">Acknoledger</a></p> <h2>Proactively undergo third-party audits and certifications</h2> <p>Leverage third-party audits and certifications to show compliance and security. Regulators may not be blockchain experts, but they understand audits. Proactively undergoing these evaluations can make a compelling case for your project’s legitimacy, potentially speeding up regulatory approvals and fostering a cooperative relationship with authorities. – <a href=\"https://circle.cointelegraph.com/u/16cde551-5395-4ca9-8281-7152cbb88396\">Tiago Serôdio</a>, <a href=\"https://www.partisiablockchain.com/\">Partisia Blockchain</a></p> <hr class=\"wp-block-separator\" /> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-19T16:00:09.000Z",
    "title": "Gemini claims ‘victim’ status in NYAG’s billion-dollar lawsuit",
    "url": "https://cryptoslate.com/gemini-claims-victim-status-in-nyags-billion-dollar-lawsuit/",
    "description": "<p>Crypto trading platform Gemini has responded to a lawsuit filed against it, bankrupt lender Genesis, and its parent company Digital Currency Group (DCG), by casting itself as a victim of the fraud perpetrated by the other two defendants. According to Gemini&#8217;s statement on X (formerly Twitter), its addition to the lawsuit was tantamount to &#8220;blaming [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/gemini-claims-victim-status-in-nyags-billion-dollar-lawsuit/\">Gemini claims &#8216;victim&#8217; status in NYAG&#8217;s billion-dollar lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-19T16:00:14.000Z",
    "title": "This Bullish Divergence Is Once Again Forming For Bitcoin, Rally Soon?",
    "url": "https://www.newsbtc.com/bitcoin-news/bullish-divergence-again-forming-bitcoin-rally/",
    "description": "Data shows a divergence is forming between Bitcoin and Ethereum&#8217;s open interest, something that has been bullish for BTC in the past. Bitcoin Open Interest Has Declined, While Ethereum Has Seen Rise According to data from the on-chain analytics firm Santiment, the BTC open interest has been going down since Monday. The &#8220;open interest&#8221; here refers to the total amount of Bitcoin contracts (in USD) that are currently open on the futures and options market. When the value of this metric increases, it means that there are more positions being opened up on derivative exchanges right now. Such a trend can lead to increased volatility for the asset, as more positions generally come with higher overall leverage for the sector. Related Reading: Bitcoin Market Cap Could Rise By $1 Trillion After Spot ETFs Launch: CryptoQuant On the other hand, decreasing values suggest the traders are either closing off their positions or are getting liquidated. The cryptocurrency may become calmer following this kind of trend. Now, here is a chart that shows the trend in the open interest for Bitcoin and Ethereum over the past month: Looks like the two metrics have been going opposite ways in recent days &#124; Source: Santiment on X As displayed in the above graph, The Bitcoin open interest has observed a downtrend in the last few days. This decline in the indicator had first started when the fake iShares ETF announcement led to more than $100 million shorts being flushed in a flash. The metric saw a bit of a rebound not too long after this sudden sharp liquidation squeeze took place, but it was quick to return back toward a downward trajectory. At the same time that this latest decline in the Bitcoin open interest has occurred, the Ethereum open interest has registered a rise instead. This suggests that while contracts are closing up on BTC futures and options, the ETH side of the market is seeing renewed interest. Interestingly, as Santiment has highlighted in the chart, the last time this trend occurred, the Bitcoin price benefited from an uplift. This previous occurrence of the pattern was between September 28 and 30, and shortly after this, the BTC price saw an increase of about 4.5%. The divergence between the metrics of the two assets was much more pronounced back then as compared to now; however, the scales of both the decline in the BTC open interest and the rise in the ETH open interest were far greater. Related Reading: This Rare Bullish Bitcoin Crossover Could Soon Form, Quant Predicts When Nonetheless, the same general pattern has still repeated this time, so it now remains to be seen whether Bitcoin would see a bullish effect this time as well, and if so, to what degree, given the lesser scale of the divergence. BTC Price Bitcoin has gone stale during the last few days as its price is still trading around the $28,400 mark right now. The value of the coin has been consolidating sideways in the past few days &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-19T16:07:38.000Z",
    "title": "Ripple’s XRPL Accelerator Program Teams Up with tokentus Investment AG for Blockchain Innovation",
    "url": "https://www.crypto-news-flash.com/ripples-xrpl-accelerator-program-teams-up-with-tokentus-investment-ag-for-blockchain-innovation/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-xrpl-accelerator-program-teams-up-with-tokentus-investment-ag-for-blockchain-innovation",
    "description": "<img width=\"800\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-48x29.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />Ripple Labs and tokentus have partnered to bootstrap the XRPL Accelerator Program. This program is designed for innovators with at least 1 viable product fitting for the XRPL ecosystem. Frankfurt-based tokentus Investment AG is making waves in the blockchain and crypto industry with its new partnership with Ripple Labs Inc. This strategic collaboration is part [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-19T16:00:40.000Z",
    "title": "Bitcoin Settles Above $28k after Fake ETF News; Investors Anticipate Gala & InQubeta Boom",
    "url": "https://www.crypto-news-flash.com/bitcoin-settles-above-28k-after-fake-etf-news-investors-anticipate-gala-inqubeta-boom/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-settles-above-28k-after-fake-etf-news-investors-anticipate-gala-inqubeta-boom",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-86.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-86.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-86-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-86-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cryptocurrency markets are perpetually eventful, with news and rumors constantly shifting the tides of investor sentiment. Recent episodes of volatility were underscored by a short-lived spike in Bitcoin&#8217;s value, catalyzed by a hoax regarding an anticipated spot BTC ETF. Yet, as the smoke clears on Bitcoin&#8217;s impulsive rally, the stage is increasingly being set for [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-19T15:53:31.000Z",
    "title": "BNB Bears on the Prowl: Is Binance Coin (BNB) Set for a Rocky Ride?",
    "url": "https://www.crypto-news-flash.com/bnb-bears-on-the-prowl-is-binance-coin-bnb-set-for-a-rocky-ride/?utm_source=rss&utm_medium=rss&utm_campaign=bnb-bears-on-the-prowl-is-binance-coin-bnb-set-for-a-rocky-ride",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Binance Coin&#8217;s Greenfield Mainnet launched, but market response stayed muted after six months of development. Recent analysis shows BNB stuck in a six-week stasis, with resistance at $220 impacting bullish momentum. The Binance Coin (BNB) Chain ecosystem reached a significant milestone with the public launch of its Greenfield Mainnet on October 17. This development comes [...]"
  }
]