[
  {
    "source": "Cointelegraph",
    "date": "2023-07-04T14:03:10.000Z",
    "title": "Google updates its privacy policy to allow data scraping for AI training ",
    "url": "https://cointelegraph.com/news/google-updates-its-privacy-policy-to-allow-data-scraping-for-ai-training",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/16f346d4-9db8-4ddd-a03e-b217bbff1e18.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The latest updates to Google’s privacy policy reveal that Google may use any public information available to train its various AI products and services. </p>\n                    <p><p>Google has made updates to its privacy policy which now allows it to take any publicly available data and use it for artificial intelligence (AI) training purposes. </p><p>The update to the company’s privacy policy came on July 1 and can be compared to previous versions of the policy via a link published on the site’s <a href=\"https://policies.google.com/privacy/archive?hl=en\" target=\"_blank\" rel=\"noopener nofollow\">update</a> page. </p><p>In the latest version, changes can be seen that include the addition of Google’s AI models, Bard and Cloud AI capabilities to the services it may train by using “information that’s publicly available online” or from “other public sources.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/1ceb3961-45d9-466f-b517-e52e3de1b7b8.png\"  /><figcaption style=\"text-align: center;\"><em>The updated Google policy conditions (in green) as of July 1, 2023. Source: screenshot </em></figcaption></figure><p>The policy update infers that Google is now making it clear to the public and its users that anything that is publicly uploaded online could be used in its training processes with the current and future AI systems it develops. </p><p>This update from Google comes shortly after OpenAI, the developer of the popular AI chatbot ChatGPT was charged with<a href=\"https://cointelegraph.com/news/open-ai-hit-with-class-action-lawsuit-over-chatgpt-data-theft\"> a class-action lawsuit in California</a> over allegedly scraping private information from users via the internet.</p><p>It claimed that OpenAI used data from millions of comments on social media, blogs, Wikipedia and other personal information from users to train ChatGPT without first getting consent to do so. The lawsuit concluded that this, therefore, violated the copyrights and privacy rights of millions of users on the internet. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/us-vice-president-gathers-top-tech-ceos-to-discuss-dangers-of-ai\"><strong><em>US vice president gathers top tech CEOs to discuss dangers of AI</em></strong></a></p><p>Twitter’s recent change in the number of tweets <a href=\"https://cointelegraph.com/news/twitter-down-elon-musk-rate-limit-exceeded\">users are able to access</a> depending on their account verification status has caused rumors across the internet that it was imposed partially due to AI data scraping. </p><p>The documents of Twitter’s developers read that rate limits were imposed as a method to manage the volume of requests made to Twitter’s application program interface (API).</p><p>Elon Musk, the owner and former CEO of Twitter recently <a href=\"https://twitter.com/elonmusk/status/1674865731136020505\" target=\"_blank\" rel=\"noopener nofollow\">tweeted</a> about the platform “getting data pillaged so much that it was degrading service for normal users.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-traders-chatgpt-stock-picks-ai-dice-adobe-firefly/\"><strong><em>AI Eye: 25K traders bet on ChatGPT’s stock picks, AI sucks at dice throws, and more</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-04T13:51:56.000Z",
    "title": "Blue-chip NFTs hit hard as over 1,200 liquidations rock market",
    "url": "https://cryptoslate.com/blue-chip-nfts-hit-hard-as-over-1200-liquidations-rock-market/",
    "description": "<p>The NFT market experienced a significant shock in the past three days, with over 1,200 NFTs being liquidated due to a record-low plunge in the floor price of several prominent or &#8216;blue-chip&#8217; NFTs Data from the NFT analysis site, Snow Genesis, shows that hundreds of NFTs used as collateral for loans are at risk of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/blue-chip-nfts-hit-hard-as-over-1200-liquidations-rock-market/\">Blue-chip NFTs hit hard as over 1,200 liquidations rock market</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-04T13:50:00.000Z",
    "title": "Belarus Going For Partial Crypto Ban",
    "url": "https://cryptodaily.co.uk/2023/07/belarus-going-for-partial-crypto-ban",
    "description": "<p>In an attempt to combat fraud, Belarus is looking to put an end to peer-to-peer crypto exchanges.&nbsp;</p>\n&ldquo;Crypto-Friendly&rdquo; Belarus Cracking Down?&nbsp;\n<p>In an effort to combat fraud and tighten its grip on cryptocurrency transactions, the Belarusian government is contemplating a ban on peer-to-peer (P2P) crypto trading. The proposed crackdown aims to protect consumers and prevent illegal activities within the cryptocurrency market.&nbsp;</p>\n<p>P2P crypto trading refers to the exchange of cryptocurrency between two individuals directly, without the involvement of a third party like a crypto exchange.&nbsp;</p>\n<p>Belarus, known for its relatively lenient stance on cryptocurrency, embraced blockchain technology and even legalized cryptocurrency mining and exchange activities in 2017. It has been called one of the most crypto-friendly countries in the world, as it offers a tax exemption for individuals and businesses conducting crypto transactions. A year ago, President Lukashenko even signed a decree to ratify the free circulation of cryptocurrencies in the country.&nbsp;</p>\nTrying To Curb Money Laundering\n<p>The country&rsquo;s Ministry of Internal Affairs released a statement on Sunday revealing that malicious actors were using the P2P crypto services to transact dirty funds.&nbsp;</p>\n<p>The statement read,&nbsp;</p>\n\n<p>&ldquo;Since the beginning of the year, employees of the cybercrime counteraction units have stopped the activities of 27 citizens who provide illegal cryptocurrency exchange services. Their total illegal income amounted to almost 22 million rubles ($8.7 million).&rdquo;&nbsp;&nbsp;</p>\n\n<p>As a result, the proposed ban seeks to restrict the direct exchange of cryptocurrencies between individuals without any intermediary platform. By eliminating P2P trading, Belarus hopes to curb fraudulent schemes and money laundering attempts that have been prevalent in the country's crypto space.&nbsp;</p>\n<p>The notice also explained that citizens would be able to conduct such financial transactions only through the registered exchanges in order to promote transparency and government control.&nbsp;</p>\nHow Will Ban Affect Belarus&rsquo;s Crypto Landscape?&nbsp;\n<p>The decision comes amidst rising instances of fraud within the country's cryptocurrency sector. Scammers have taken advantage of the anonymous nature of P2P transactions to carry out various fraudulent schemes, defrauding unsuspecting individuals of their hard-earned money.</p>\n<p>Although critics have argued that a blanket ban on P2P crypto trading may stifle innovation and hinder the growth of the industry, it is interesting to note that the country has recently renewed its crypto tax exemption law to be in effect till 2025.&nbsp;</p>\n<p>It is worth noting that the proposed ban on P2P crypto trading in Belarus is still in the discussion stage. The government is expected to consult with industry experts and stakeholders to carefully weigh the potential consequences before finalizing any regulatory measures.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T13:40:08.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for a decoupling of on-chain and off-chain trading activity. There was evidence that, unlike traditional financial markets, cryptocurrency volatility is not associated with market downturns. Observers also noted that, after gaining widespread attention ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-04T14:00:47.000Z",
    "title": "XRP, Cardano Among Altcoins To Keep An Eye On: Santiment",
    "url": "https://www.newsbtc.com/altcoin/xrp-cardano-among-altcoins-keep-an-eye-on-santiment/",
    "description": "Data from Santiment shows XRP and Cardano, among other altcoins, may be the ones worth keeping an eye on in the coming days. Social Dominance Of Altcoins Like XRP &#38; Cardano Has Remained Low Recently According to data from the analytics firm Santiment, Bitcoin is seeing the greatest attention in the market right now, while some of the alts aren&#8217;t being talked about that much. The indicator of interest here is &#8220;social dominance,&#8221; to understand which the &#8220;social volume&#8221; needs to be looked at first. The social volume is a metric that measures the total amount of unique social media posts/threads that are making mentions of a given asset or term. By &#8220;unique,&#8221; what&#8217;s meant here is that the indicator only counts these posts once regardless of how many times they mention the term (obviously, as long as they make at least one mention). If the metric counted the pure number of mentions instead, then a thread with a large number of mentions could raise the count by itself, even if mentions may be low everywhere else on social media. Thus, to obtain a more accurate representation of the trend in the wider market, the social volume only considers unique posts. Now, social dominance is an indicator that compares the social volume of a given cryptocurrency with the combined social volume of the top 100 assets (by market cap) in the sector. Related Reading: Historical Litecoin Bearish Signal Goes Off, Correction Incoming? Here is a chart that shows the trend in the social dominance of the five largest coins in the market: Bitcoin (BTC), Ethereum (ETH), BNB (BNB), XRP (XRP), and Cardano (ADA): Looks like the value of the metric has stayed low for the altcoins &#124; Source: Santiment on Twitter As displayed in the above graph, the social dominance of Bitcoin has been high since the rally started around the start of the year. The asset has been leading the price surge in these last few months, so it&#8217;s not particularly surprising that the interest in the cryptocurrency has been elevated during this period. Discussions around BTC on social media had been dropping slightly last month when FUD had been going around in the market, but with the latest leg in the rally above the $30,000 level, interest has once again spiked in the coin. While this has happened, however, the other top assets like XRP have only observed a sideways trend or a drawdown in their respective social dominance. This would imply that these cryptocurrencies have failed to garner any significant attention during the last couple of weeks. Related Reading: Why Bitcoin Dominance Hints At A Surprise Altcoin Season Ahead The amount of discussion that Bitcoin is seeing, though, isn&#8217;t always a good sign, as too much excitement has historically often resulted in the formation of a local top. On the contrary, as the alts aren&#8217;t getting too much attention currently, they may have the potential for observing more price rise. Cardano, BNB, and XRP, in particular, have pretty low values of the indicator right now, which, according to Santiment, makes them worth keeping an eye on. XRP Price At the time of writing, XRP is trading around $0.48, up 1% in the last week. XRP seems to have been struggling recently &#124; Source: XRPUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T14:00:38.000Z",
    "title": "This PEPE, Dogecoin, and SHIB Meme Coin Competitor is a 10X Token",
    "url": "https://www.crypto-news-flash.com/this-pepe-dogecoin-and-shib-meme-coin-competitor-is-a-10x-token/?utm_source=rss&utm_medium=rss&utm_campaign=this-pepe-dogecoin-and-shib-meme-coin-competitor-is-a-10x-token",
    "description": "Memcoins are one of the most surefire ways to make it in the crypto space. This is evident in the recorded success of meme coins such as Pepe (PEPE), Dogecoin (DOGE), and Shiba Inu (SHIB). With the aforementioned coins at their peak and having recorded immense increases in the past, DigiToads (TOADS) has been touted [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-04T13:49:00.000Z",
    "title": "XRP May Surpass Its Current Slump in a Short While, Here’s Why",
    "url": "https://coinedition.com/xrp-may-surpass-its-current-slump-in-a-short-while-heres-why/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/037.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/037.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/037-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/037-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/037-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/037-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/037-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/037-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/037-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/037-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/037-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/037-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/037-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/037-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/037-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/037-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/037-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Ripple’s (XRP) performance in June was not something that bulls would have desired. Apart from the few times when the token made an upward movement, XRP consolidated for most of the month. As a result, it ended the month a little below $0.50. At press time, the token had lost 7.14% of its value in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-may-surpass-its-current-slump-in-a-short-while-heres-why/\">XRP May Surpass Its Current Slump in a Short While, Here&#8217;s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]