[
  {
    "source": "CoinDesk",
    "date": "2023-06-26T20:51:53.000Z",
    "title": "Bitcoin Holds Above $30K as Investors Await Historically Strong July, Eye Options Expiry",
    "url": "https://www.coindesk.com/markets/2023/06/26/bitcoin-holds-above-30k-as-investors-await-historically-strong-july-eye-options-expiry/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BTC has gained at least 20% in July in each of the past three years. Depending on its price heading into the expiry, bitcoin could rally additionally or retreat."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-26T20:58:55.000Z",
    "title": "Judge denies motion from Binance regarding allegedly 'misleading' SEC statements",
    "url": "https://cointelegraph.com/news/judge-denies-motion-binance-alleged-misleading-sec-statements",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/77348ec0-c90c-4939-8885-70c9d48815f6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The legal teams for Binance, Binance.US and CZ filed a motion for the court to order the SEC to comply with “applicable rules of conduct” following allegedly misleading statements.</p>\n                    <p><p>A federal judge overseeing the lawsuit between Binance.US, Binance Holdings Limited and CEO Changpeng \"CZ” Zhao and the United States Securities and Exchange Commission (SEC) has denied a motion which could have stopped the financial regulator from issuing public statements related to the case.</p><p>In a June 26 ruling in the U.S. District Court for the District of Columbia, Judge Amy Berman Jackson <a href=\"https://www.courtlistener.com/docket/67474542/securities-and-exchange-commission-v-binance-holdings-limited/\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> it was unnecessary for the court to intervene regarding the basis for a motion from parties affiliated with Binance and Binance.US. The legal team <a href=\"https://cointelegraph.com/news/binance-cz-allege-sec-made-misleading-statements-assets\">filed a motion</a> on June 21 alleging that the SEC misled the U.S. public in statements issued over the securities lawsuit, which had the potential of “tainting the jury pool” and introducing “unwarranted confusion into the marketplace”.</p><p>“While all of the lawyers in this case should adhere to their ethical obligations at all times, it is not apparent that Court intervention to reiterate that point is needed at this time, or that it is necessary or appropriate for the Court to get involved in wordsmithing the parties' press releases,” said Judge Jackson. “Nor is it clear that the agency's public relations efforts to date will materially affect proceedings in this case.”</p><p>The complaint stemmed from a June 17 press release from the SEC, in which enforcement director Gurbir Grewal claimed CZ and Binance could “commingle customer assets or divert customer assets as they please”. Binance's and Binance.US' legal teams said the SEC statements were “misleading” and largely denied the allegations. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-relists-privacy-coins-in-europe\"><strong><em>Binance reverses decision to delist privacy coins in Europe</em></strong></a></p><p>Binance, Binance.US and CZ are all targets of a lawsuit filed by the SEC on June 5 alleging the exchanges offered unregistered securities to U.S. customers and Binance failed to register as an exchange or a broker-dealer clearing agency. The federal regulator originally filed a motion aiming to have the court freeze all Binance.US assets but ultimately <a href=\"https://cointelegraph.com/news/us-court-approves-sec-binanceus-agreement\">reached a compromise agreement</a> in which only the exchange’s employees would have access to client funds.</p><p>Amid the U.S. legal proceedings, Binance has continued its global operations, <a href=\"https://cointelegraph.com/news/binance-launches-regulated-platform-in-kazakhstan\">announcing the launch</a> of a regulated crypto platform in Kazakhstan on June 20. However, on June 23 the Belgian Financial Services and Markets Authority <a href=\"https://cointelegraph.com/news/belgian-financial-regulator-orders-binance-cease-virtual-currency-services\">ordered the exchange</a> to stop offering crypto exchange and custody wallet services, and Binance has reportedly <a href=\"https://financefwd.com/de/binance-oesterreich/\" target=\"_blank\" rel=\"noopener nofollow\">withdrawn</a> its application with Austria’s financial regulatory authority. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/money-back-crypto-litigation/\"><strong><em>Get your money back: The weird world of crypto litigation</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-26T20:43:21.000Z",
    "title": "Switzerland seizes $26M tied to Do Kwon, Terra",
    "url": "https://cryptoslate.com/switzerland-seizes-26m-tied-to-do-kwon-terra/",
    "description": "<p>Swiss authorities seized millions of dollars of crypto linked to Terraform Labs and its associates, Digital Asset said on June 24. The news outlet said that authorities froze $26 million of Bitcoin and other digital assets held at the Zurich-based Sygnum Bank. Those assets belonged to Do Kwon and Han Chang-joon — formerly the CEO [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/switzerland-seizes-26m-tied-to-do-kwon-terra/\">Switzerland seizes $26M tied to Do Kwon, Terra</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-06-26T20:42:48.000Z",
    "title": "Binance’s Request to Modify SEC’s Language Denied by Judge",
    "url": "https://cryptobriefing.com/binances-request-denied-by-judge/?utm_source=feed&utm_medium=rss",
    "description": "Binance&#8217;s attempt to change the way the U.S. Securities and Exchange Commission&#8217;s (SEC) portraysBinance.US of handling of customer funds in a June 17 press releases was denied by a federal..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T20:59:11.000Z",
    "title": "US Government splurges $12.7B to save 10 wealthy depositors",
    "url": "https://www.cryptopolitan.com/us-government-spends-12-7b-on-10-depositors/",
    "description": "The US Government has portrayed a level of injustice to so many in the economic society following the crash of several big banks. According to sources, the Federal Deposit Insurance Corporation (FDIC) has released an unredacted document revealing that the US government guaranteed the accounts of Silicon Valley Bank&#8217;s (SVB) top ten clients following its ... <a title=\"US Government splurges $12.7B to save 10 wealthy depositors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-government-spends-12-7b-on-10-depositors/\" aria-label=\"More on US Government splurges $12.7B to save 10 wealthy depositors\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-26T21:00:58.000Z",
    "title": "Chainlink Bulls Must Defend Support Zone To Prepare For Another Rally",
    "url": "https://www.newsbtc.com/news/chainlink/chainlink-bulls-must-defend-support-zone-to-prepare-for-another-rally/",
    "description": "Chainlink (LINK) has experienced a surge in bullish sentiment as it rebounded from the $5 support level. In the past week, LINK has surpassed several support levels, resulting in a gain of over  20%. Although there haven&#8217;t been significant changes on the daily chart, the technical outlook for the altcoin has turned notably bullish. Both demand and accumulation have shown significant improvement, while the overall strength of the broader market has also contributed to LINK&#8217;s upward movement. The positive momentum in major altcoins, driven by Bitcoin surpassing the $30,000 mark, has further added to the optimism. Sustaining this price momentum will largely depend on BTC&#8217;s continued upward push. Related Reading: Binance Rescinds Decision To Remove Privacy Coins From European Market While a price pullback cannot be ruled out for LINK, the increased buying power should help prevent a loss of momentum. If LINK manages to maintain its nearest support level, the ongoing price rally is expected to continue as the increase in LINK&#8217;s market capitalization suggests the anticipation of further bullish gains. Chainlink Price Analysis: One-Day Chart After surpassing the significant psychological level of $6, the price of LINK was $6.20. The $6 mark has demonstrated its importance as a support level and dropping below it would potentially lead to a decline toward $5. On the other hand, if LINK manages to break the overhead resistance at $6.46, it could potentially rally to $6.70, representing a gain of over 11% in the upcoming trading sessions. In the event of a decrease from the current price, support levels to watch out for are $5.60 and $5. The trading volume of LINK in the last session has shown an increase, indicating an influx of buyers into the market. Technical Analysis Recent trading sessions have witnessed notable improvement in buying strength for LINK. Despite a slight dip in price, the buying strength has remained stable on the chart. This is indicated by the Relative Strength Index (RSI) surpassing the 60-mark, signaling growing demand. This suggests the potential for increased gains in the price action. Additionally, buyers have driven the price momentum in the market, causing it to surge above the 20-Simple Moving Average line. The daily chart for LINK has shown buy signals in line with the increasing demand. The Moving Average Convergence Divergence (MACD) indicator has displayed tall and growing green histograms, which are typically associated with buy signals. This suggests a positive momentum for the altcoin. Related Reading: Bitcoin Bullish Signal: Exchange Whale Ratio Plunges However, it is important to note that the Chaikin Money Flow (CMF), which reflects capital inflows and outflows, has formed a downtick. While capital inflows still outweigh outflows, the rate of inflows has been declining at press time. Featured image from DataDrivenInvestor, charts from TradingView.com"
  }
]