[
  {
    "source": "Cointelegraph",
    "date": "2023-08-15T08:52:49.000Z",
    "title": "Singapore central bank says three business days is ‘timely transfer’ for stablecoins",
    "url": "https://cointelegraph.com/news/stablecoins-singapore-central-bank-says-three-business-days-is-timely-transfer-for-stablecoins",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/9330f03d-0b33-413d-80ca-52c3b1bf5a18.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Redemptions of MAS-regulated single-currency stablecoins will have a longer grace period which is five business days despite some arguing that it should be done in real-time. </p>\n                    <p><p>While blockchains continue to revolutionize payments by allowing instant transfers, Singapore’s central bank believes that three business days is a \"timely transfer\" for single-currency stablecoins (SCS), which is similar to transfer speed requirements for domestic money transfers. </p><p>On Aug. 15, the Monetary Authority of Singapore (MAS) <a href=\"https://cointelegraph.com/news/singapore-central-bank-releases-regulatory-framework-for-stablecoins\">released its regulatory framework</a> for stablecoins in the city-state. In the newly-published guidelines, the financial regulator <a href=\"https://www.mas.gov.sg/-/media/mas-media-library/publications/consultations/pd/2023/response-to-consultation-on-stablecoins-regulation_15aug2023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">highlighted</a> that it would consider three business days as a timely transfer for SCS despite some feedback calling for a shorter time frame. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3dbe5bc9-2ec5-4713-af47-2af6dec8bbc7.png\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of MAS’ response to the public consultation on stablecoins. Source: MAS</em></figcaption></figure><p>According to MAS, while SCS transfers may be expected to be completed more quickly because they are done on a blockchain, transfers of MAS-regulated stablecoins may “occur on various types of blockchain infrastructure that may have different service standards.” The central bank wrote that these types of blockchain infrastructures may not always be under the control of intermediaries. MAS wrote: </p><blockquote>“MAS will retain the proposed timeline of three business days. This would mirror the existing money transmission requirement for domestic money transfer services.”</blockquote><p>Apart from stablecoin transfers, MAS also indicated that SCS redemptions need a longer time period. According to the document, redeeming stablecoins back to fiat will be given five business days. This response from MAS came despite some respondents arguing that redemptions must be done \"within a shorter time frame, or even on a real-time basis.\" </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/circle-preps-1b-war-chest-to-deal-with-market-threats-from-paypal-and-others\"><strong><em>Circle preps $1B war chest to deal with market threats from PayPal and others</em></strong></a></p><p>According to MAS, it will proceed with the requirement that issuers return the value of MAS-regulated SCS to holders within five business days. The regulator explained: </p><blockquote>“The redemption timeline is intended to strike a balance between responsiveness to users’ requests and ensuring there is enough time for the SCS issuer to do so in an orderly manner under various stress situations.”</blockquote><p>Cointelegraph reached out to MAS for comment but did not get an immediate response.</p><p><strong><em>Asia Express: </em></strong><a href=\"https://cointelegraph.com/magazine/chinas-risky-bitcoin-court-decision-is-huobi-in-trouble-or-not-asia-express/\"><strong><em>China’s risky Bitcoin court decision, is Huobi in trouble or not?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-15T08:49:15.000Z",
    "title": "Up to $500M in liabilities as crypto custodian Prime Trust files Chapter 11 bankruptcy",
    "url": "https://cryptoslate.com/up-to-500m-in-liabilities-as-crypto-custodian-prime-trust-files-chapter-11-bankruptcy/",
    "description": "<p>Prime Trust, LLC, a prominent player in digital asset custody, has filed voluntary petitions for Chapter 11 bankruptcy. According to a report released by the company on Aug. 14, the proceedings are expected to provide a &#8220;transparent and value-maximizing process for the benefit of its clients and stakeholders.&#8221; The Nevada-based company is known for its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/up-to-500m-in-liabilities-as-crypto-custodian-prime-trust-files-chapter-11-bankruptcy/\">Up to $500M in liabilities as crypto custodian Prime Trust files Chapter 11 bankruptcy</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-15T09:00:16.000Z",
    "title": "FDIC report includes crypto as banking risk",
    "url": "https://cryptodaily.co.uk/2023/08/fdic-report-includes-crypto-as-banking-risk",
    "description": "<p>The Federal Deposit Insurance Corporation has included crypto in its annual risk review for the first time, stating that crypto presents key risks and that it needs closer supervision.</p>\nFDIC seeks more control over crypto companies\n<p>The crypto industry may not be entirely happy with being closely supervised by the likes of the FDIC given that it came about as an alternative to a slow-moving banking system that does not provide a helpful service to clients.</p>\n<p>Be that as it may, the FDIC has the reins of power and will do what it will do in order to try and bring crypto under the control of regulators that are regulating on behalf of the incumbent system.</p>\n<p>Banks are already working with crypto institutions, and others are contemplating such a move. Therefore, in collaboration with its fellow federal banking entities the FDIC has stated in its report that it is ready to delve further into how banks are getting involved in crypto, and with this knowledge provide full supervisory guidance.</p>\nPerceived risks to banks\n<p>In its report the FDIC talks of the &ldquo;dynamic nature of crypto-assets&rdquo;, and their &ldquo;rapid pace of innovation&rdquo;. The main risks for the banking sector, as perceived by the FDIC is the possibility of &ldquo;contagion&rdquo; which could spread over into banks with exposure to the sector, and also the &ldquo;run risk&rdquo; for banks that hold stablecoin reserves.</p>\n<p>The report went on to specify that all FDIC supervised banks must notify the agency of any crypto related activities that they have or that they are planning to engage in. Examples were then given of firms that had made misleading claims as to the eligibility of FDIC insurance for certain crypto-assets. The report ended with what the authors saw as &ldquo;heightened liquidity risks&rdquo; due to what they saw as the &ldquo;unpredictability&rdquo; of deposit inflows and outflows.</p>\nOpinion\n<p>The FDIC is an organisation staffed by those from the existing financial system, and therefore it is biassed towards the protection of the banks within that system.&nbsp;</p>\n<p>There is no conversation as to how more failing banks might impact any crypto companies that are dealing with them, or how obliging crypto companies, or the banks that seek to deal with them, to jump through ever more complex regulatory hoops, might end up squashing the dynamism and innovation of crypto.</p>\n<p>The FDIC is there to insure the funds of bank customers should their bank fail. However, without the money to guarantee the savings of the clients of more than one or two big banks should they fail - it might be asked: what is the point of this organisation anyway?</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T08:54:12.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T09:00:38.000Z",
    "title": "Hyundai, Kia integrates Hedera, InQubeta Is One Of The Fastest-Growing Crypto Projects in Q3 2023",
    "url": "https://www.crypto-news-flash.com/hyundai-kia-integrates-hedera-inqubeta-is-one-of-the-fastest-growing-crypto-projects-in-q3-2023/?utm_source=rss&utm_medium=rss&utm_campaign=hyundai-kia-integrates-hedera-inqubeta-is-one-of-the-fastest-growing-crypto-projects-in-q3-2023",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-33.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-33.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-33-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-33-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-33-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-33-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The third quarter of 2023 has proven to be nothing short of transformative for the crypto world. Between global corporations tapping into blockchain benefits and emerging projects taking significant strides, it has been a bustling period. However, standing out prominently amidst this evolution is InQubeta, swiftly rising through the ranks and carving out a niche [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T08:54:16.000Z",
    "title": "Terra (LUNA) Partners with NOWNodes for Seamless Node Access, Is Price About to Explode?",
    "url": "https://www.crypto-news-flash.com/terra-luna-partners-with-nownodes-for-seamless-node-access-is-price-about-to-explode/?utm_source=rss&utm_medium=rss&utm_campaign=terra-luna-partners-with-nownodes-for-seamless-node-access-is-price-about-to-explode",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-25.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-25.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-25-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Terra (LUNA) has solidified a collaboration with NOWNodes to provide enhanced node access. NOWNodes introduced two distinct nodes tailored for the Terra blockchain, ensuring a streamlined and secure integration via its API. According to official communications from NOWNodes on Full Nodes and Block Explorers, Terra (LUNA) has formally established a partnership with NOWNodes, underscoring a [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-15T08:41:07.000Z",
    "title": "2 EARLY ALTCOINS For BIG CRYPTO GAINS",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/2-early-altcoins-for-big-crypto-gains/",
    "description": "<p>You need to watch this video now because being early means big gains! MATIC &#8211; It had a public sale price of 0.00263 USD. But the ATH stood at $2.92 which is more than 1110x.  That&#8217;s why me and my team at AB always keep looking for early opportunities. Some of them might not even [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/2-early-altcoins-for-big-crypto-gains/\">2 EARLY ALTCOINS For BIG CRYPTO GAINS</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]