[
  {
    "source": "Cointelegraph",
    "date": "2023-07-08T06:00:16.000Z",
    "title": "ZachXBT's research cited in Canadian NFT rug pull class action lawsuit ",
    "url": "https://cointelegraph.com/news/zachxbt-s-research-cited-in-canadian-nft-rug-pull-class-action-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/b67b9cc4-0841-45b1-b714-9af0f0d28005.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to court documents, the Boneheads team has been accused of breach of contract, misappropriating funds and misleading investors.  </p>\n                    <p><p>The investigative work of <a href=\"https://cointelegraph.com/news/zach-xbt-sued-libel-claimed-plaintiff-drained-funds-from-project\">independent blockchain sleuth</a>  ZachXBT has been cited in a class action lawsuit in Canada against Boneheads, an alleged $3.1 million nonfungible token rug pull.</p><p>Tweeting on July 7, ZachXBT highlighted that lawsuit as he reiterated accusations that the Boneheads team “quickly disappeared and spent the mint funds on BAYCs [Bored Ape Yacht Club NFTs], luxury goods, and other items never fulfilling the roadmap.”</p><p>“Yet another case where my research has been cited,” ZachXBT added. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">A class action lawsuit was filed in Canada against the Boneheads team for the $3.1M NFT rug pull<br><br>The team quickly disappeared and spent the mint funds on BAYCs, luxury goods, and other items never fulfilling the roadmap <br><br>Yet another case where my research has been cited <a href=\"https://t.co/GoIGmPs50g\">https://t.co/GoIGmPs50g</a> <a href=\"https://t.co/mboWXt3mfm\">pic.twitter.com/mboWXt3mfm</a></p>&mdash; ZachXBT (@zachxbt) <a href=\"https://twitter.com/zachxbt/status/1677336923336065024?ref_src=twsrc%5Etfw\">July 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The class action lawsuit was initially filed in the Ontario Superior Court of Justice in mid-June. </p><p>As per a June 19 statement of claim, the Boneheads team has been <a href=\"https://boneheadsclassaction.com/documents/\" target=\"_blank\" rel=\"noopener nofollow\">accused</a> of breach of contract with investors by failing to deliver on the project’s roadmap, misappropriating funds, conducting fraudulent misrepresentation and negligent misrepresentation, among other things. </p><p>“As of the date of filing of this claim, the Boneheads NFT team has not delivered on a single roadmap promise they had made to Boneheads NFT purchasers,” the filing reads, adding: </p><blockquote>“Consumers have not received a single NFT airdrop, token, physical collectible, marketplace access, forging, avatar application, voting right, giveaway, or the dozens of other promises that were made to consumers in consideration for purchasing or minting a Boneheads NFT.”</blockquote><p>Looking at the references to ZachXBT, the filing highlights the sleuth’s investigation into the project that was published to Twitter on July 14, 2022, along with additional posts from the following month.</p><p>In the initial thread, ZachXBT provided a rundown of how the project allegedly misappropriated funds that were meant to be used to support the Boneheads roadmap. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cz-powell-on-chain-sleuth-zach-xbt-legal-fees\"><strong><em>CZ, Powell and more rally to fund legal fees for on-chain sleuth ZachXBT, surpassing $1M</em></strong></a></p><p>ZachXBT also outlined how quickly the project became inactive after mint and unveiled who the key players behind the project were, as he tracked their dodgy antics. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">9/ Other TikTok videos exist of her flexing luxury trips, designer clothes shopping, and a Gwagon all after the project had raised $3.1m. <a href=\"https://t.co/cTfJ0YXGt4\">pic.twitter.com/cTfJ0YXGt4</a></p>&mdash; ZachXBT (@zachxbt) <a href=\"https://twitter.com/zachxbt/status/1547589543280332807?ref_src=twsrc%5Etfw\">July 14, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Despite months of inactivity on social media, the Boneheads team immediately responded to ZachXBT’s posts via Twitter, stating that Boneheads was not a scam but a ‘very deliberately slow creative process,” the filing reads, adding: </p><blockquote>“They subsequently announced that 21, a ‘new’ collection, would be dropping on the anniversary of their project launch, in August 2022. No such collection was ever released.”</blockquote><p>ZachXBT’s work has now been used on a handful of occasions to help build cases against bad actors in the NFT space. </p><p>In February, the FBI seized 86.5 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) and $100,000 worth of NFTs from a phishing scammer <a href=\"https://cointelegraph.com/news/fbi-seizes-100k-in-nfts-and-86-5-eth-from-scammer-following-zachxbt-investigation\">following a lengthy investigation by ZachXBT</a>. </p><p>In October 2022, France’s national cyber unit also cited ZachXBT’s work in<a href=\"https://cointelegraph.com/news/french-police-use-twitter-crypto-sleuth-s-research-to-catch-scammers\"> helping it catch and charge</a> a group of alleged phishing scammers suspected of stealing $2.5 million worth of NFTs. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/coldie-snoop-dogg-piece-vitalik-buterin-john-mcafee/\"><strong><em>NFT Creator: ‘Holy shit, I’ve seen that!’ — Coldie’s Snoop Dogg, Vitalik and McAfee NFTs</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-08T06:01:26.000Z",
    "title": "Humanoid Robots Engage in Q&A Session at Geneva UN News Conference",
    "url": "https://www.cryptopolitan.com/humanoid-robots-at-geneva-un-news-conference/",
    "description": "A group of humanoid robots took center stage at a news conference held in Geneva, organized by the United Nations&#8217; International Telecommunication Union. The conference aimed to ignite a conversation about the future of artificial intelligence by allowing reporters to ask questions directly to these human-like machines. The news conference, titled &#8220;AI for Good Global ... <a title=\"Humanoid Robots Engage in Q&#038;A Session at Geneva UN News Conference\" class=\"read-more\" href=\"https://www.cryptopolitan.com/humanoid-robots-at-geneva-un-news-conference/\" aria-label=\"More on Humanoid Robots Engage in Q&#038;A Session at Geneva UN News Conference\">Read more</a>"
  }
]