[
  {
    "source": "Cointelegraph",
    "date": "2023-11-02T04:44:29.000Z",
    "title": "Elon Musk slams NFTs but ends up arguing the case for Bitcoin Ordinals",
    "url": "http://cointelegraph.com/news/elon-musk-slams-nfts-jpeg-url-argues-case-bitcoin-ordinals",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/7aea3fcb-e3d2-4def-aba0-dd300e691ed8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Elon Musk argued that NFT projects “should at least encode the JPEG in the blockchain,” to the delight of many Bitcoiners. </p>\n                    <p><p>While publicly mocking non-fungible token (NFTs) during a podcast, Tesla CEO and billionaire Elon Musk appears to have inadvertently highlighted the case for Bitcoin Ordinals, also known as Bitcoin NFTs. </p><p>“The funny thing is the NFT is not even on the blockchain — it’s just a URL to the JPEG,” said Musk in an Oct. 31 released <a href=\"https://open.spotify.com/episode/7edwvm2c6Ieuzun4xtFYCJ\" target=\"_blank\" rel=\"noopener nofollow\">interview</a> on The Joe Rogan Experience.</p><p>Musk said NFT projects should at least encode the JPEG on-chain:</p><blockquote>“You should at least encode the JPEG in the blockchain. If the company housing the image goes out of business, you don’t have the image anymore.”</blockquote><p>On social media, Bitcoiners argued Musk’s comments actually summed up the use case for Bitcoin Ordinals. Bitcoin’s version of NFTs launched in January by developer Casey Rodarmor, which was made possible by the Taproot soft fork in November 2021.</p><p>Cryptocurrency analyst Will Clemente was among those that praised Musk’s comments, noting there are 38 million and counting Ordinals inscriptions that will forever exist on Bitcoin’s blockchain.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">.<a href=\"https://twitter.com/elonmusk?ref_src=twsrc%5Etfw\">@elonmusk</a> you just laid out the case for Bitcoin ordinals - image/text inscriptions directly on the most secure open source monetary network on the planet. There are currently 38 million of these inscriptions on the Bitcoin blockchain. <a href=\"https://t.co/WASj1qpkz8\">pic.twitter.com/WASj1qpkz8</a></p>&mdash; Will Clemente (@WClementeIII) <a href=\"https://twitter.com/WClementeIII/status/1719790083350356101?ref_src=twsrc%5Etfw\">November 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“This is why Ordinals will continue to grow,” <a href=\"https://twitter.com/frankdegods/status/1719644838818410656\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Rohun “Frank” Vora, the creator of NFT projects DeGods and y00ts. “It's the most elegant solution to one of the most universal criticisms of NFTs.”</p><p>Ordinals developer known as “Leonidas” <a href=\"https://x.com/LeonidasNFT/status/1719582173718863934\" target=\"_blank\" rel=\"noopener nofollow\">liked</a> Musk’s comments so much that they inscribed the 19-second video into Bitcoin’s blockchain at block 814,773:</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/2d6bbcdc-af99-47b9-b1c6-08ece37e0d4d.png\"  /><figcaption style=\"text-align: center;\"><em>Video of Elon Musk inscribed on Bitcoin’s blockchain via the Ordinals protocol. Source: </em><a href=\"https://www.ord.io/36751919\" target=\"_blank\" rel=\"noopener nofollow\"><em>Ord.io</em></a></figcaption></figure><p>The criticisms from Musk toward NFTs aren’t new. In December 2021, he mocked NFTs as a sign of mental illness in a meme showing a patient lying on a therapist’s couch.</p><blockquote class=\"twitter-tweet\"><p lang=\"zxx\" dir=\"ltr\"><a href=\"https://t.co/Wv6iJDuTge\">pic.twitter.com/Wv6iJDuTge</a></p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1471338213549744130?ref_src=twsrc%5Etfw\">December 16, 2021</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Musk’s comments however don’t stand true for all NFT projects on Ethereum.</p><p>For example, Larva Labs <a href=\"https://www.larvalabs.com/blog/2021-8-18-18-0/on-chain-cryptopunks\" target=\"_blank\" rel=\"noopener nofollow\">moved</a> its Cryptopunks NFTs on-chain in August 2021 after they lived off-chain for the first four years.</p><p>“Storing them on-chain in this way would further cement the long-term survival of the Cryptopunks images and attributes, and ensure that they can be fully accessed by anyone with only an Ethereum client,” Larva Labs in the statement.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">.<a href=\"https://twitter.com/elonmusk?ref_src=twsrc%5Etfw\">@elonmusk</a> is correct that having NFT merely provide an http link to someone&#39;s domain is silly. <br><br>However, with rare exceptions, it&#39;s also silly to insist NFT content be on chain, <br><br>IPFS links, with the content backed by whoever owns the NFT is the natural solution.</p>&mdash; Arthur B.  (@ArthurB) <a href=\"https://twitter.com/ArthurB/status/1719563552732614855?ref_src=twsrc%5Etfw\">November 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/are-nft-markets-in-a-death-spiral-or-ready-for-a-resurgence\"><strong><em>Are NFT markets in a death spiral or ready for a resurgence? </em></strong></a></p><p>Metagood, the team behind the Ethereum-native OnChainMonkeys, announced in September that it would migrate its NFTs to Bitcoin.</p><p>While the firm’s CEO Danny Yang didn’t directly address the JPEG dilemma, he explained that NFTs “will win on Bitcoin” because it is a more secure network to work from:</p><blockquote>“The Bitcoin Ordinal protocol is better designed for decentralization and security than the Ethereum NFT protocol. High-value NFTs will win on Bitcoin.”</blockquote><p>However, Ethereum still remains home to 84% of all NFT trading volumes, <a href=\"https://www.coingecko.com/research/publications/market-share-nft-blockchains\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to CoinGecko, sourcing data from June. Bitcoin and ImmutableX came in second and third with market shares of 11% and 2.5% respectively.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/nft-collector-william-mapan-explains-generative-art-using-crayon-dice-nouns-cool-cats/\"><strong><em>NFT Collector: William Mapan’s Distance sells out, NFT float in Macy’s Parade, Nouns DAO forks</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-02T04:58:01.000Z",
    "title": "DOT Price (Polkadot) Surge to $5.5 – Are Bulls Ready For This?",
    "url": "https://www.newsbtc.com/analysis/dot/dot-price-polkadot-surge-to-5-5/",
    "description": "Polkadot (DOT) is gaining pace above the $4.50 resistance against the US Dollar. The price could surge toward $5.5 if it clears the $4.80 resistance. DOT is slowly moving higher above the $4.50 resistance zone against the US Dollar. The price is trading above the $4.60 zone and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support near $4.50 on the 4-hour chart of the DOT/USD pair (data source from Kraken). The pair could gain bullish momentum if there is a close above $4.80 and $4.85. Polkadot Price Regains Strength After forming a base above the $4.00 handle, DOT price started a decent increase. The price was able to clear the key barrier at $4.20 to enter a positive zone, like Bitcoin and Ethereum. Polkadot cleared the $4.50 resistance zone and the 100 simple moving average (4 hours). It traded to a new multi-week high at $4.803 and is now consolidating gains. It is well above the 23.6% Fib retracement level of the upward move from the $4.046 swing low to the $4.803 high. DOT price is now trading above the $4.60 zone and the 100 simple moving average (4 hours). There is also a key bullish trend line forming with support near $4.50 on the 4-hour chart of the DOT/USD pair. The trend line is close to the 50% Fib retracement level of the upward move from the $4.046 swing low to the $4.803 high. Source: DOTUSD on TradingView.com Immediate resistance is near the $4.80 level. The next major resistance is near $4.85. A successful break above $4.85 could start another strong rally. In the stated case, the price could easily rally toward $5.20 in the coming days. The next major resistance is seen near the $5.50 zone. Are Dips Supported in DOT? If DOT price fails to continue higher above $4.80 or $4.85, it could start a downside correction. The first key support is near the $4.62 level. The next major support is near the $4.50 level and the trend line, below which the price might decline to $4.35. Any more losses may perhaps open the doors for a move toward the $4.20 support zone. Technical Indicators 4-Hours MACD – The MACD for DOT/USD is now gaining momentum in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for DOT/USD is now above the 50 level. Major Support Levels – $4.62, $4.50 and $4.20. Major Resistance Levels – $4.80, $4.85, and $5.50."
  }
]