[
  {
    "source": "NewsBTC",
    "date": "2023-11-12T17:45:49.000Z",
    "title": "THORChain (RUNE) Notches 31.5% Gain To Attain New Yearly Peak",
    "url": "https://www.newsbtc.com/thorchain/thorchain-rune-notches-31-5-gain-to-attain-new-yearly-peak/",
    "description": "RUNE, native token of the cross-chain decentralized exchange THORChain, is currently one of the best-performing cryptocurrencies in the market, boasting of a 31.5 % price increase in the last 24 hours.  Based on data from Coingecko, this price gain only underlines the remarkable bullish form of RUNE in the past few weeks, as the token is up by 115.0% and 212.3% on the 14-day and 30-day charts, respectively.  Interestingly, this sustained bullish pressure in the RUNE market has resulted in the DeFi coin attaining a new yearly high of $5.31 and a peak daily trading volume of $1.28 billion. Related Reading: THORChain Beats Rivals In Top 100 Coin Rankings With 34% Rally – How RUNE Did It Behind THORChain (RUNE) Rise In analyzing RUNE’s meteoric rise in the past few weeks, several analysts have given credit to the newly introduced features on the THORChain platform.  For context, in the THORChain Q3 2023 Ecosystem Report, the DEX’s development team announced the implementation of new features such as lending, streaming swaps, streaming loans, and savers for stablecoins, among others.  In an X post on Saturday, a crypto analyst with the username The Wolf of DeFi provided some insight into how one of these features has spurred RUNE to new heights. The analyst attributed most of RUNE gains to the streaming swaps feature, which is designed to allow large swap requests to be automatically divided into smaller requests that are processed over time.  The Wolf of DeFi explains the introduction of this update has triggered an increase in the platform’s swap volume and the annual percentage rate (APRs) being offered to liquidity providers. As expected, higher APRs will attract more liquidity providers who have to invest in RUNE, which serves as the base asset of every liquidity pool on THORChain, creating a cycle named the liquidity flywheel. Furthermore, The Wolf of DeFi stated that every dollar worth of non-RUNE assets deposited in a THORChain liquidity pool is matched with its equivalent in RUNE by the network nodes.  Thus, if an LP deposits $100 consisting of $50 BTC and $50 RUNE into BTC/RUNE, nodes will balance this transaction with an additional $50 RUNE, which adds to the buying pressure in the market, allowing the token to maintain its upward trajectory.  Related Reading: RUNE Beyond Swaps: THORChain Introduces New Lending Protocol RUNE Price Prediction Looking at RUNE’s daily chart, the relative strength index (RSI) stands at 87.24, which indicates the token is well in the overbought zone. Thus, investors are advised to be on alert for a possible price pullback. On the other hand, RUNE may continue to sustain its bullish momentum, especially as the team behind THORChain looks to introduce more attractive features, including order book trading. At the time of writing, RUNE is currently valued at $5.10, with a 3.2% gain in the last hour. Meanwhile, the token’s market cap stands at $1.58 billion, allowing it to rank as the 41st largest cryptocurrency in the market. RUNE trading at $5.109 on the daily chart &#124; Source: RUNEUSDT chart on Tradingview.com Featured image from iStock, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-12T18:02:51.000Z",
    "title": "Stellar-Powered Decaf Brews Up Financial Freedom in Latin America",
    "url": "https://www.crypto-news-flash.com/stellar-powered-decaf-brews-up-financial-freedom-in-latin-america/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-powered-decaf-brews-up-financial-freedom-in-latin-america",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Morrowind-Stellar-Lumens.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Stellar\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Morrowind-Stellar-Lumens.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Morrowind-Stellar-Lumens-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Morrowind-Stellar-Lumens-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Morrowind-Stellar-Lumens-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The Decaf platform helps users in Latin America send payments, remittances, and on/off-ramps seamlessly through the Stellar network and MoneyGram ecosystem. With thousands of Latin Americans already using Decaf and the Stellar network, the platform reported $200k worth of USDC off-ramped weekly through MoneyGram. The Stellar (XLM) network has been at the forefront of mainstream [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-12T17:52:07.000Z",
    "title": "Where to Invest? BorroeFinance, NEO, and Litecoin Are Positioned for a Significant Uptick in Value",
    "url": "https://www.crypto-news-flash.com/where-to-invest-borroefinance-neo-and-litecoin-are-positioned-for-a-significant-uptick-in-value/?utm_source=rss&utm_medium=rss&utm_campaign=where-to-invest-borroefinance-neo-and-litecoin-are-positioned-for-a-significant-uptick-in-value",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-39.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-39.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-39-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Based on recent market analysis, BorroeFinance ($ROE), a top DeFi project on the crypto scene, is poised for additional gains as an upsurge appears on the horizon. Neo (NEO) also recently revisited a thirty-six-week high while short positions increased. Litecoin (LTC), however, witnessed a remarkable growth in network activities, leading investors to wonder if LTC [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-12T17:55:41.000Z",
    "title": "Investment Titan BlackRock Questions SEC, Argues Spot Bitcoin and Ethereum ETFs Not Different From Futures ETFs",
    "url": "https://dailyhodl.com/2023/11/12/investment-titan-blackrock-questions-sec-argues-spot-bitcoin-and-ethereum-etfs-not-different-from-futures-etfs/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/multiple-altcoin-etfs-coming.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/multiple-altcoin-etfs-coming.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/multiple-altcoin-etfs-coming.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/multiple-altcoin-etfs-coming.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/multiple-altcoin-etfs-coming.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/multiple-altcoin-etfs-coming.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/multiple-altcoin-etfs-coming.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The biggest asset management firm in the world is challenging the U.S. Securities and Exchange Commission (SEC), contending that spot market Bitcoin (BTC) and Ethereum (ETH) exchange-traded funds (ETFs) are no different than futures ETFs. In a new filing, investment titan BlackRock – which has over $8 trillion in assets under management – says that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/12/investment-titan-blackrock-questions-sec-argues-spot-bitcoin-and-ethereum-etfs-not-different-from-futures-etfs/\">Investment Titan BlackRock Questions SEC, Argues Spot Bitcoin and Ethereum ETFs Not Different From Futures ETFs</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]