[
  {
    "source": "CryptoGlobe",
    "date": "2023-11-04T16:11:00.000Z",
    "title": "Passive Income Powerhouse: An American Mom’s Amazon Review Side Hustle",
    "url": "https://www.cryptoglobe.com/latest/2023/11/passive-income-powerhouse-andreea-mateis-amazon-review-side-hustle/",
    "description": "In a digital era where side hustles can become significant income streams, Andreea Matei’s story stands out. CNBC’s Make It reports on how Matei’s engagement with the Amazon Influencer Program transformed her financial trajectory, starting with a simple 75-second video review that earned her $1.28. This modest beginning marked the start of a lucrative journey. […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-04T16:30:03.000Z",
    "title": "The Clock Ticks for Sam Bankman-Fried: Countdown to a Crypto Mogul’s Day of Reckoning",
    "url": "https://news.bitcoin.com/the-clock-ticks-for-sam-bankman-fried-countdown-to-a-crypto-moguls-day-of-reckoning/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbfjail-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"The Clock Ticks for Sam Bankman-Fried: Countdown to a Crypto Mogul&#039;s Day of Reckoning\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbfjail-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbfjail-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbfjail-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbfjail-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbfjail-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbfjail-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbfjail.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A jury has unanimously convicted Sam Bankman-Fried on a slew of charges, encompassing wire fraud, conspiracy to engage in wire fraud, and money laundering among the seven counts. The following is an in-depth look at what will happen between now and Bankman-Fried’s sentencing, which is scheduled for March 28, 2024. Before the Gavel — What [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-04T16:37:16.000Z",
    "title": "FTT price up 13% following 2-week rally",
    "url": "https://crypto.news/ftt-price-up-13-following-2-week-rally/",
    "description": "The growth came against the backdrop of the trial of former FTX CEO Sam Bankman-Fried. A 12-person jury found Mr. Bankman-Fried guilty of all charges proffered against him, with sentencing scheduled for March 28, 2024."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-04T16:33:53.000Z",
    "title": "Cardano Summit 2023: Merging AI And Blockchain, Funding, And Day 2 Recap",
    "url": "https://www.newsbtc.com/news/cardano/cardano-summit-2023-ai-blockchain-funding-and-day-2/",
    "description": "In the financial center of Dubai, the Cardano Summit 2023 will gather some of the most prominent projects in the crypto space. During the three-day event, speakers, founders, and the community will voice views on the growing sector and the future of the network and blockchain technology as Cardano enters a critical stage in its development. Related Reading: Cardano Summit 2023: Charles Hoskinson Takes The Stage, Day 1 Recap Cardano Summit 2023 Hints At What’s Next For The Ecosystem The second day of the Cardano Summit 2023 was all about a debate on governance, community, funding, and bridging the Cardano ecosystem with new technologies, such as Artificial Intelligence. Governance and giving the community more power has been a key issue for IOG, Cardano’s leading developer. Day2 at the #CardanoSummit2023 was marked by engaging discussions about governance &#38; the future of #Cardano. The IOG team was delighted to connect with so many #CardanoCommunity members, sharing insights that will shape the path ahead. Your passion fuels the Cardano ecosystem!💪 pic.twitter.com/g3YTNJyCgO — Input Output (@InputOutputHK) November 4, 2023  Two years ago, the Cardano ecosystem celebrated its full decentralization as stake pool operators took over block production. Now, the ecosystem continues to move in that direction by implementing capabilities that will help the community retain that power. Sebastian Zilliacus from Emurgo, a Cardano-based entity operating as their communication and educational arm, presented their vision to migrate social media platforms from centralized to decentralized environments. In that way, users would finally break free from the control of third parties and can truly “own their identities.” In addition, teams presented tokenization solutions that could allow everyone to own a piece of precious metal and other “real-world assets” and ways to support displaced people by providing them with financial support using staking pools. Main Stage Update! Did you catch @szilliacus Managing Director of @emurgo_io Media sharing the vision on Decentralized Social Media: The Future of Empowerment &#38; Connections? 👏 &#8220;In the Web3 space, we celebrate the diversity of identity &#8211; we own our identities and… pic.twitter.com/1iQwOkdgT5 — Cardano Foundation (@Cardano_CF) November 4, 2023  To break down these and other topics, including the union of blockchain and AI, funding, and the sentiment during the event, our team reached out to Sheraz Ahmed, Managing Partner at STORM, to get his unique insight. Ahmed was the master of ceremonies on the Innovation Stage. He has attended the last three Cardano Summits while helping with the ecosystem in different endeavors, including Emurgo and its marketing and educational efforts. This is what he told us about AI and Blockchain: (…) blockchain as a data management system can benefit from having AI integrated within it. I think that&#8217;s a really important part. I think it also kind of has the ability that blockchain and that we can use blockchain as an underlying for AI. So I think the two go really well together as a well-attended panel.  A New Way To Fund Projects On Cardano On the other hand, the community was looking forward to the debate around funding and financial support. As Ahmed explained, funding in the Cardano ecosystem mostly takes place via Project Catalyst, which has seen some delays during the Bear Market. In that sense, the debate focused on incentivizing Venture Capitalist firms and external funding to onboard the Cardano ecosystem. Ahmed said: (…) cutting off funding can be cutting off the oxygen out of startups. And so they are looking at other ways of kind of funding. Charles Hodkinson gave an interesting analogy to this where he was like, well, the treasury at the Foundation Foundation, the CARDENA as a whole is kind of like a big reservoir of water. That catalyst is just the pipe is the only pipe at the moment to be able to release all of this kind of treasury that they have to support the community. And that through SIP 1694, which is the Air Voltaire, which will be the new governance mechanism to allow for things to operate a bit more autonomously, will allow for the community to be able to distribute treasury in a much more facilitated manner. And so I think a lot of community excited about that because it means that the flood gates are open or will be open and it will allow for projects, the community and other things to be funded in a better way. Once again, the Cardano ecosystem seems to be preparing for the next cycle from different angles by supporting developers today, incentivizing more developers to work on their blockchain, and keeping a strong community. Related Reading: Cardano Summit 2023: A Chat With SingulariyNET, Staking Announcement These elements could play out for the Cardano ecosystem during the next Bull Cycle, allowing it to gain an advantage over Polkadot, Solana, and other networks. Ahmed concluded: We&#8217;ll just have to wait and see. And it depends on the wisdom of the community and where they decide to spend their resources (…). If they have a better distribution of funds and in a more long-term mindset where they&#8217;re not just spending the whole treasury in a year, two years, but they have a 10 to 20 year mindset, I think things can really happen. So that&#8217;s super exciting. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-04T16:15:19.000Z",
    "title": "50,000 XRP Up for Grabs in November as Uphold’s Exciting XRP Sweepstakes Return",
    "url": "https://www.crypto-news-flash.com/50000-xrp-up-for-grabs-in-november-as-upholds-exciting-xrp-sweepstakes-return/?utm_source=rss&utm_medium=rss&utm_campaign=50000-xrp-up-for-grabs-in-november-as-upholds-exciting-xrp-sweepstakes-return",
    "description": "<img width=\"800\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-48x29.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />Multi-asset digital assets platform Uphold is offering XRP holders 50,000 XRP tokens. Interested participants will gain 1 entry into the draw for every $20 worth of eligible trade carried out. Holders of the Ripple (XRP) token are in for a jolly ride after Uphold.Inc. announced a mouthwatering XRP giveaway to community members. Uphold, Inc. is [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-04T16:33:00.000Z",
    "title": "Feds Bust Drug Kingpin’s Attempt to Launder 30,000 ETH While In Prison",
    "url": "https://coinedition.com/feds-bust-drug-kingpins-attempt-to-launder-30000-eth-while-in-prison/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration-.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum Officially Splits ERC and EIP, Marking New Documentation Era\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration-.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration--300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration--311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration--380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration--696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration--124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration--159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration--255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration--440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration--414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration--293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration--375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration--328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration--144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration--123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/Ethereums-Holesky-Testnet-Launch-Fails-Due-to-Misconfiguration--129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>U.S. Attorney Philip Sellinger has announced that federal law enforcement authorities have seized $54 million worth of cryptocurrencies linked to Christopher Castelluzzo, the leader of a notorious drug ring based in New Jersey. The seizure marks a significant blow to Castelluzzo and his co-conspirators, whose illicit activities spanned from 2010 to 2015. According to federal [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/feds-bust-drug-kingpins-attempt-to-launder-30000-eth-while-in-prison/\">Feds Bust Drug Kingpin’s Attempt to Launder 30,000 ETH While In Prison</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]