[
  {
    "source": "Cointelegraph",
    "date": "2023-08-10T15:25:27.000Z",
    "title": "Stablecoins could be key to upholding US dollar's global reserve status: Report",
    "url": "https://cointelegraph.com/news/stablecoins-could-be-key-upholding-us-dollar-global-reserve-status-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/1f5133bf-83c7-462c-b2f4-044b3bd6bb1f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In an opinion piece in The Wall Street Journal, Brian Brooks and Charles Calomiris claim that U.S. stablecoin legislation is crucial to re-dollarizing the world.</p>\n                    <p><p>Stablecoins are at the heart of a dollar-based revolution and could be a pivotal factor in keeping the United States dollar the dominant global currency, <a href=\"https://www.wsj.com/articles/stablecoins-can-help-keep-the-dollar-the-worlds-reserve-currency-yuan-china-ef1047c\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to an Aug. 9 opinion piece published in The Wall Street Journal. </p><p>The authors, Brian Brooks and Charles Calomiris, urged Congress to implement a \"sound and stable regulatory framework\" for stablecoins in the country. Brooks is a former CEO of Binance.US, former chief legal officer of Coinbase, and served as U.S. Comptroller of the Currency. Calomiris is dean of economics, politics and history at the University of Austin and served as chief economist of the Office of the Comptroller of the Currency.</p><p>The Clarity for Payment Stablecoins Act was <a href=\"https://www.congress.gov/bill/118th-congress/house-bill/4766\" target=\"_blank\" rel=\"noopener nofollow\">proposed</a> in July by House Financial Services Committee Chairman Patrick McHenry. However, the stablecoin legislation<a href=\"https://cointelegraph.com/news/patrick-mchenry-blames-white-house-lack-urgency-stablecoin-bill-negotiations\"> has faced obstacles</a> due to the lack of bipartisan agreement.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/ICYMI?src=hash&amp;ref_src=twsrc%5Etfw\">#ICYMI</a>: U.S leadership in stablecoins can cement the Dollar&#39;s global reserve currency status.<br><br>Our bipartisan Clarity for Payment Stablecoins Act provides the necessary consumer protections to help this technology achieve its full potential.<br><br>Read more <a href=\"https://t.co/HY3i9BALsX\">https://t.co/HY3i9BALsX</a></p>&mdash; Patrick McHenry (@PatrickMcHenry) <a href=\"https://twitter.com/PatrickMcHenry/status/1689653840910704641?ref_src=twsrc%5Etfw\">August 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to Brooks and Calomiris, with emerging concerns about the \"de-dollarization\" — a scenario in which the dollar loses its global reserve currency status — stablecoins could revive the post-World War II arrangement when the greenback emerged as the currency of international trade. </p><p>The affirmations are backed by data from the International Monetary Fund showing that the share of U.S. dollar reserves held by foreign central banks has fallen from almost 73% in 2000 to 59% today. \"Any tool that could boost the U.S. dollar should be considered,\" reads the piece. </p><p>The authors issued a warning about the ongoing dollar exodus from big commodity commodity traders, such as Brazil and Argentina. Both countries entered into bilateral agreements with China to use the yuan and their local currencies — Real and Peso, respectively — for trade settlements. Brooks and Calomiris also explained how stablecoins provide people living under hyperinflation with easier access to the U.S. dollar.</p><p>In a call for stablecoin regulation, the authors noted that de-dollarization could damage the United States economy, as the currency's reserve status reduces the country's borrowing costs, which is crucial during times of record government borrowing and spending. They also noted that it could affect American consumers' purchasing power, increasing the cost of foreign goods.</p><p>\"If stablecoins flourish, citizens of other countries will increase the demand for dollars independent of (and perhaps contrary to) their governments’ political decisions,\" notes the authors, adding that \"U.S. politicians need to agree that re-dollarizing the global economy is important.\"</p><p><strong><em>Magazine - <a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\">Crypto regulation: Does SEC Chair Gary Gensler have the final say?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-10T15:23:42.000Z",
    "title": "Binance Backs Curve with $5M as DeFi Protocol Eyes BNB Chain Integration",
    "url": "https://cryptobriefing.com/binance-backs-curve-with-5m-as-defi-protocol-eyes-bnb-chain-integration/?utm_source=feed&utm_medium=rss",
    "description": "Binance Labs endorses Curve with a $5M investment, fostering a future alliance and hinting at Curve's expansion on the BNB Chain."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-10T15:27:40.000Z",
    "title": "Introducing NFT Plazas: How Media Outlets Can Amplify NFT and Metaverse Adoption",
    "url": "https://cryptodaily.co.uk/2023/08/introducing-nft-plazas-how-media-outlets-can-amplify-nft-and-metaverse-adoption",
    "description": "<p>Global interest in non-fungible tokens has sharply plummeted as the base prices of prominent NFT collections have declined since 2022. Peaking at $5.8 billion in January 2022, NFT trading volume dropped to $707.70 million in June 2023.&nbsp;</p>\n<p>Robert Quartly-Janeiro, CSO of Bitrue, a Tier 1 crypto exchange, says:</p>\n\n<p>\"FOMO fueled the massive surge in the NFT market, but the decline in trading volume by 90% from the last year&rsquo;s peak shows the dynamics has shifted. Barriers such as skepticism towards NFTs as potential scams, lack of sustained interest, scalability challenges, and lack of clear use cases are hindering the wide adoption of non-fungibles.\"</p>\n\n<p>As fundamental elements of Web3, NFTs, and metaverse projects have a lot of scope and opportunity. In this shifting environment, mainstream digital media is poised to play a significant role, given its power to amplify trends or foster skepticism.&nbsp;</p>\nNFT Plazas: All the Latest NFT and Metaverse News\n<p>Founded in 2018, NFT Plazas offers daily insights into the multifaceted spheres of non-fungible tokens and the broader metaverse. Over its years of operation, the independent NFT news platform has methodically carved out a reputation as a leader in NFT and metaverse coverage.</p>\n<p>It delivers timely industry news, feature articles with thorough educational content, insightful data analyses, and performs due diligence and analysis on new NFT projects. This blend of content makes the often convoluted world of Web3 technologies more accessible to laypeople.</p>\n<p>The outlet concentrates on quality over hype, aiming to demystify the space and reduce barriers of entry. In a field where misinformation is rampant, NFT Plazas helps to ensure that accurate, unbiased information is always at the reader&rsquo;s fingertips.</p>\nMedia and NFTs: The symbiotic catalysts for adoption\n<p>With its expansive reach and influence, the media has been instrumental in narrating the story of non-fungibles, delineating their value, and encouraging their adoption. As NFTs enter mainstream consciousness, it serves as passive observer and an active participant, crafting narratives that influence perception, drive interest, and foster understanding.</p>\n<p>Social media platforms have also metamorphosed into bustling marketplaces where buyers, sellers, and mediators intersect, while platforms like Twitter and Discord continue to serve as critical nodes of discovery and discussion. The synergy between NFTs and social media hints at a future where the line between digital assets and traditional online interactions further blurs.</p>\n<p>\"The role of media is not just to report on the world of crypto, metaverses, and NFTs,\" commented Mary Pedler, Founder of Input PR communications agency for cutting-edge crypto and tech projects. \"It actively shapes perceptions, demystifies complexities, and lowers the entry threshold for the average user.\"</p>\n<p>NFT Plazas, acutely aware of the challenges of NFT adoption, harnesses the power of media to bridge knowledge gaps. They employ a multi-pronged approach, where comprehensive educational content aids the uninitiated, while data-driven insights offer value to veterans. While their educational efforts have garnered praise, more aggressive marketing techniques might find lesser traction among a discerning audience wary of hype.</p>\n<p>The media's role in Web3 and the broader digital asset landscape is pivotal. As gatekeepers of information, platforms like NFT Plazas can influence the trajectory of NFT adoption, ensuring that the metamorphosis of the digital realm is rooted in knowledge, transparency, and trust.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T15:30:40.000Z",
    "title": "Apple earns favorable Supreme Court ruling against Epic Games",
    "url": "https://www.cryptopolitan.com/apple-earn-favorable-court-ruling-epic-games/",
    "description": "In a significant twist in the prolonged legal clash between Epic Games, the creator of Fortnite, and tech giant Apple, a U.S. Supreme Court justice has intervened to temporarily suspend a ruling from the Ninth Circuit Court of Appeals. The move provides Apple with the opportunity to appeal the decision to the highest court and ... <a title=\"Apple earns favorable Supreme Court ruling against Epic Games\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apple-earn-favorable-court-ruling-epic-games/\" aria-label=\"More on Apple earns favorable Supreme Court ruling against Epic Games\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T15:15:36.000Z",
    "title": "How Helium Hotspots Expand Connectivity Coverage 200 Times Than Wi-Fi",
    "url": "https://www.cryptopolitan.com/helium-hotspots-connectivity-200-times/",
    "description": "Internet connectivity is a lifeline intertwining personal and professional lives. Yet, inequities persist, leaving certain areas underserved. Enter the Helium hotspots — a revolutionary solution tackling these challenges. Combining blockchain and decentralization, Helium redefines global connectivity. In this guide, we explore its core concepts, unique features, and potential impact. From its innovative approach to connectivity ... <a title=\"How Helium Hotspots Expand Connectivity Coverage 200 Times Than Wi-Fi\" class=\"read-more\" href=\"https://www.cryptopolitan.com/helium-hotspots-connectivity-200-times/\" aria-label=\"More on How Helium Hotspots Expand Connectivity Coverage 200 Times Than Wi-Fi\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T15:14:30.000Z",
    "title": "Top crypto platforms to watch out for in Q2 2023 – Pay attention to GambleFi",
    "url": "https://www.cryptopolitan.com/gamblefi-crypto-platforms-to-watch-out-for/",
    "description": "Navigating the ever-evolving labyrinth of the crypto landscape demands a keen eye, strategic insight, and an uncanny ability to anticipate market dynamics. As investors thrive in the second quarter of 2023, a symphony of innovation and opportunity orchestrates across the realm of digital finance. The digital chameleon of finance has morphed into a captivating tale ... <a title=\"Top crypto platforms to watch out for in Q2 2023 &#8211; Pay attention to GambleFi\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gamblefi-crypto-platforms-to-watch-out-for/\" aria-label=\"More on Top crypto platforms to watch out for in Q2 2023 &#8211; Pay attention to GambleFi\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-10T15:16:56.000Z",
    "title": "RocketX join hands with Hedera for blockchain interoperability",
    "url": "https://crypto.news/rocketx-join-hands-with-hedera-for-blockchain-interoperability/",
    "description": "RocketX, a multichain centralized and decentralized exchange (DEX) aggregator that allows users to trade multiple assets, is integrating Hedera"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-10T15:25:00.000Z",
    "title": "Analyst Predicts Exponential Movement as BTC Nears Key $30k Breakout",
    "url": "https://coinedition.com/analyst-predicts-exponential-movement-as-btc-nears-key-30k-breakout/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/THE-INFLATION-DATA-IS-ABOUT-TO-FOOL-EVERYONE-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent analysis, crypto analyst Crypto Rover shifted focus to the movement of Bitcoin (BTC), noting that it has experienced a minor retracement, slipping from $30,000 to $29,500. Despite this, Crypto Rover highlights that the overall market remains relatively stable, and the anticipated volatility has yet to make a significant impact. The technical analysis [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analyst-predicts-exponential-movement-as-btc-nears-key-30k-breakout/\">Analyst Predicts Exponential Movement as BTC Nears Key $30k Breakout</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]