[
  {
    "source": "CryptoSlate",
    "date": "2024-02-23T23:14:14.000Z",
    "title": "Never-before-seen Satoshi Nakamoto emails add several details to Bitcoin’s origin lore",
    "url": "https://cryptoslate.com/never-before-seen-satoshi-nakamoto-emails-add-several-details-to-bitcoins-origin-lore/",
    "description": "<p>Private email correspondence between the pseudonymous Bitcoin creator Satoshi Nakamoto and an early contributor to the project, Martii Malmi, has shed further light on the origin story of the flagship crypto and its creator&#8217;s earliest thoughts about the future. The emails were shared as evidence by Malmi in the Crypto Open Patent Alliance (COPA) vs. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/never-before-seen-satoshi-nakamoto-emails-add-several-details-to-bitcoins-origin-lore/\">Never-before-seen Satoshi Nakamoto emails add several details to Bitcoin&#8217;s origin lore</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-23T23:13:00.000Z",
    "title": "Crypto Trader Turns $51 into $10,800 in Two Hours on Solana ($SOL)",
    "url": "https://www.cryptoglobe.com/latest/2024/02/crypto-trader-turns-51-into-10800-in-two-hours-on-solana-sol/",
    "description": "A cryptocurrency trader has turned a meager $51 investment into a staggering $10,800 in just two hours, sparking both awe and skepticism within the volatile digital asset community, trading Solana ($SOL) for a gain of 210x.  The feat saw the individual leverage the decentralized finance (DeFi) ecosystem of the Solana blockchain, executing a series of […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T23:38:08.000Z",
    "title": "Uniswap (UNI) soars 50% after governance proposal unveiled",
    "url": "https://www.cryptopolitan.com/uniswap-uni-soars-50-governance-proposal/",
    "description": "Uniswap (UNI), a leading decentralized finance (DeFi) protocol, recently experienced a remarkable surge in its price, skyrocketing by over 50%. This surge came on the heels of a groundbreaking governance proposal aimed at enhancing the protocol&#8217;s decision-making process and incentivizing UNI token holders.&#160; The proposal suggests implementing a fee-sharing mechanism that rewards UNI holders who [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T23:33:14.000Z",
    "title": "Love him or hate him, Trump’s pro-Bitcoin stance is turning heads",
    "url": "https://www.cryptopolitan.com/trumps-pro-bitcoin-stance-turns-heads/",
    "description": "Former U.S. President Donald Trump recently commented on the growing prominence of Bitcoin, stating that the cryptocurrency has &#8220;taken on a life of its own.&#8221; Trump&#8217;s acknowledgment reflects the widespread adoption and influence of Bitcoin beyond traditional financial systems.&#160; However, he also hinted at the necessity for regulatory measures due to its increasing prominence and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T23:32:36.000Z",
    "title": "Master Kung Fu Saga with Exclusive Codes",
    "url": "https://www.cryptopolitan.com/master-kung-fu-saga-with-exclusive-codes/",
    "description": "In the dynamic world of mobile gaming, Kung Fu Saga emerges as a formidable contender, captivating players with its engaging gameplay and immersive experience. This game, which has quickly climbed the ranks of popularity, offers players the chance to dive into a world where martial arts and strategy collide. To enhance this thrilling adventure, players [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T23:28:10.000Z",
    "title": "Bitcoin who? Ethereum and Binance Coin lead market surge this week",
    "url": "https://www.cryptopolitan.com/bitcoin-who-eth-and-bnb-lead-market-surge/",
    "description": "Bitcoin, the pioneering crypto, has long been the focal point of the digital asset market. However, recent market dynamics have seen a shift in attention towards alternative cryptocurrencies, notably Ethereum and Binance Coin. Despite Bitcoin&#8217;s decline of 2.8% in the past week, Ethereum and Binance Coin have surged in prominence.&#160; Ethereum, with its versatile ecosystem [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T23:23:53.000Z",
    "title": "Grayscale eyes mega M&A deals for expansion",
    "url": "https://www.cryptopolitan.com/grayscale-eyes-mega-ma-deals-for-expansion/",
    "description": "According to statements made by the company&#8217;s CEO, Grayscale, a prominent crypto investment firm, has signaled its openness to exploring mergers and acquisitions (M&#38;A) opportunities. This announcement reflects the company&#8217;s strategic stance amid a dynamic and evolving crypto landscape.&#160; As a leading player in the digital asset management space, Grayscale&#8217;s interest in M&#38;A activities underscores [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T23:18:08.000Z",
    "title": "Nvidia’s market cap tops $2 trillion for the first time",
    "url": "https://www.cryptopolitan.com/nvidias-market-cap-tops-2-trillion/",
    "description": "Nvidia has shattered ceilings and expectations alike by reaching a staggering $2 trillion market cap. This achievement places the California tech giant at the zenith of its game, much to the fascination and intrigue of investors and tech enthusiasts worldwide. The company has also seen a 59% stock increase that marks 2024 as a banner [&#8230;]"
  }
]