[
  {
    "source": "CryptoGlobe",
    "date": "2023-06-24T13:19:36.000Z",
    "title": "Coinbase and Bitcoin’s Symbiotic Relationship: A Look into the ‘BlackRock Rally",
    "url": "https://www.cryptoglobe.com/latest/2023/06/coinbase-and-bitcoins-symbiotic-relationship-a-look-into-the-blackrock-rally/",
    "description": "In a recent episode of CNBC’s Fast Money, Brian Stutland of Equity Armor Investments joined Melissa Lee and the Fast Money traders to discuss the recent surge in Coinbase (NASDAQ: COIN) shares, a phenomenon closely tied to Bitcoin’s recent “BlackRock rally.” On 15 June 2023, The iShares unit of BlackRock, the world’s largest asset manager, […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-24T13:36:01.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-24T13:23:26.000Z",
    "title": "The menace of Twitter bots: A threat to crypto marketing strategies",
    "url": "https://www.cryptopolitan.com/the-menace-of-twitter-bots-threat-to-crypto/",
    "description": "Twitter bots have attained notoriety within the crypto industry. Now, two Yale researchers believe they know how to trade more profitably by leveraging phony engagement. In recent years, the crypto industry has witnessed exponential growth and widespread adoption. As this digital revolution gains momentum, marketing strategies have become paramount in ensuring success for crypto projects.&#160; ... <a title=\"The menace of Twitter bots: A threat to crypto marketing strategies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-menace-of-twitter-bots-threat-to-crypto/\" aria-label=\"More on The menace of Twitter bots: A threat to crypto marketing strategies\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-24T13:15:44.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-24T13:35:29.000Z",
    "title": "KuCoin Token (KCS) And Tezos (XTZ) Bullish Sparklo (SPRK) Value Surges",
    "url": "https://nulltx.com/kucoin-token-kcs-and-tezos-xtz-bullish-sparklo-sprk-value-surges/",
    "description": "It has been an impressive start for Sparklo in the crypto space with many investors lining up to be part of the revolutionary project. Sparklo, which is a novel cryptocurrency, is set to redefine the crypto use cases by linking cryptocurrency to the precious metal industry trading. Meanwhile, KuCoin Token (KCS) and Tezos (XTZ) have [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-24T13:15:19.000Z",
    "title": "Spectra (SPCT) VS. Optimism (OP) And BNB (BNB): Unleashing The Potential of Blockchain Venture Capital",
    "url": "https://nulltx.com/spectra-spct-vs-optimism-op-and-bnb-bnb-unleashing-the-potential-of-blockchain-venture-capital/",
    "description": "Spectra (SPCT) is making waves in its first presale stage, positioning itself as a formidable venture capital blockchain. Spectra (SPCT) aims to democratize investment access by leveraging blockchain technology and adopting a community-driven approach. This article explores why Spectra (SPCT) is emerging as a formidable competitor to industry giants like Optimism (OP) and BNB (BNB), [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-24T13:20:10.000Z",
    "title": "Peter Schiff bashes bitcoin again, says recent party will soon end ",
    "url": "https://crypto.news/peter-schiff-bashes-bitcoin-again-says-recent-party-will-soon-end/",
    "description": "Peter Schiff's tweet about the end of the bitcoin party has caused controversy in the crypto community"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-24T13:26:27.000Z",
    "title": "BUSD Market Cap Plunge Of 80% In 2023 Raises Concerns Of Impending Collapse",
    "url": "https://www.newsbtc.com/news/busd-market-cap-plunge-of-80-in-2023-raises-concerns-of-impending-collapse/",
    "description": "The fate of Binance USD (BUSD), the stablecoin introduced by Binance, hangs in the balance as its market capitalization has experienced a significant decline of over 80% in 2023. From November 2022 to June of the current year, BUSD&#8217;s market capitalization has plummeted from USD23 billion to USD4 billion. Notably, the capitalization suffered an 18% loss in May alone, as reported by CCData, an analysis company. TrueUSD (TUSD) Gains Traction As BUSD Market Cap Declines As the market capitalization of BUSD continues to decline and reach a critical level, representing less than 5% of the overall stablecoin market capitalization, Binance has begun actively promoting the adoption of TrueUSD (TUSD). While TUSD&#8217;s market capitalization still falls slightly below that of BUSD, currently standing at over USD3.1 billion, it has surpassed BUSD in terms of trading volumes. According to data provided by CCData, the trading volumes of TUSD have tripled, indicating a growing interest and usage of the stablecoin. Related Reading: Mask Foundation Moves 2.5 Million Tokens To Exchanges, Huge Dip Incoming? TrueUSD (TUSD), introduced in 2017 by TrustToken, has emerged as the fifth-largest stablecoin in the market, trailing closely behind BUSD. Functioning as an Ethereum-based ERC-20 token, TUSD secures its value with dollar reserves deposited in multiple US-based banking entities. The company behind TUSD ensures a 1:1 convertibility with the US currency, instilling confidence in its stability and reliability among users. As BUSD&#8217;s market capitalization experiences a significant decline, the growing popularity and trading volumes of TUSD serve as a testament to the increasing demand for an alternative stablecoin option. Also, Binance&#8217;s shift towards promoting TUSD suggests a strategic response to the changing landscape of stablecoin usage and market dynamics. The steep decline in BUSD&#8217;s market capitalization can be attributed to its impending discontinuation. In February 2023, NewsBTC reported that Paxos would cease issuing the BUSD stablecoin due to an ongoing lawsuit filed by the United States Securities and Exchange Commission (SEC). As per Paxos&#8217; official statement, BUSD will be redeemable until February 24, 2024, marking the potential date for its exit from the market. Investors Move To USDT As It Nears Its All-Time High Capitalization As the market capitalization of Tether (USDT) continues to rise steadily, approaching its all-time high, investors are taking notice and making strategic moves. According to data from CoinMarketCap, USDT&#8217;s current market capitalization stands at $82.9 billion (USD), close to its previous peak of $83.2 billion, reached in May 2022. This upward trajectory has prompted investors to diversify their portfolios and explore alternative stablecoin options. Related Reading: Bitcoin Just Gained Over 18% In Seven Days: What’s Happened When This Has Occurred In The Past? Also, Investors are drawn to USDT due to its stability and pegging to the US dollar, offering a reliable store of value amidst market fluctuations. With its widespread acceptance and liquidity, USDT has become a preferred choice for traders, providing a convenient and secure means of preserving their capital during volatile market conditions. At press time, USDT was trading at $0.9780 per coin with a 24-hour price increase of 1.38%. Featured image from iStock, charts from Tradingview and CCData"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-24T13:25:27.000Z",
    "title": "BREAKING: IMF Acknowledges It Cannot Ban Bitcoin, Ethereum, and Ripple (XRP), but the Harder Push for CBDCs Persists",
    "url": "https://www.crypto-news-flash.com/breaking-imf-acknowledges-it-cannot-ban-bitcoin-ethereum-and-ripple-xrp-but-the-harder-push-for-cbdcs-persists/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-imf-acknowledges-it-cannot-ban-bitcoin-ethereum-and-ripple-xrp-but-the-harder-push-for-cbdcs-persists",
    "description": "The International Monetary Fund (IMF) recognizes the potential of Central Bank Digital Currencies (CBDCs), advocating for regulation over outright bans of cryptocurrencies. The IMF report highlights the significant adoption of digital currencies in Latin America and the Caribbean, providing valuable lessons for the global financial ecosystem. The International Monetary Fund (IMF) recently published a report [...]"
  }
]