[
  {
    "source": "Cointelegraph",
    "date": "2023-10-20T16:32:14.000Z",
    "title": "Price analysis 10/20: BTC, ETH, BNB, XRP, SOL, ADA, DOGE, TON, DOT, MATIC",
    "url": "https://cointelegraph.com/news/price-analysis-10-20-btc-eth-bnb-xrp-sol-ada-doge-ton-dot-matic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/d49d4bfe-367e-4d63-9645-f1285507bb5b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price briefly pushed above the $30,000 level. Are altcoins poised to follow?</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) rose above $30,000 on Oct. 20, indicating that the path of least resistance is to the upside. <a href=\"https://cointelegraph.com/news/grayscale-new-spot-bitcoin-etf-nyse\">Grayscale Investments filing a new application</a> with the United States Securities and Exchanges Commission for a new spot Bitcoin ETF may have acted as a bullish trigger.</p><p>In another positive news for the cryptocurrency space, the <a href=\"https://cointelegraph.com/news/sec-dismiss-lawsuit-brad-garlinghouse-chris-larsen\">SEC sought to dismiss all claims</a> against Ripple CEO Brad Garlinghouse and executive chair Chris Larsen. This will increase expectations that the regulator may slow down its attack on the cryptocurrency entities due to a string of recent setbacks.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/78bf6d84-4b48-4dd0-9f4b-97578cc14ea1.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>As the market sentiment improves, Bitcoin’s long-term holders (LTHs) have been increasing their Bitcoin stockpile. Glassnode data shows that <a href=\"https://cointelegraph.com/news/bitcoin-long-term-investors-own-76-percent-btc\">76.2% of the available Bitcoin is locked up</a> in long-term storage. This is likely to cause a supply crunch in the market, which is bullish for Bitcoin’s price.</p><p>Could Bitcoin maintain its momentum and rise higher? Will the altcoins also follow? Let’s analyze the charts of the top 10 cryptocurrencies to find out.</p><h2>Bitcoin price analysis</h2><p>Bitcoin broke and closed above the $28,143 resistance on Oct. 16 and the bulls held the level successfully during the retest on Oct. 17 and 18. This indicates that the buyers flipped the level into support.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/79705806-85c0-4647-8812-c3508ebddbbc.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The 20-day exponential moving average ($27,769) has turned up and the relative strength index (RSI) is in the overbought zone, indicating that the bulls have the upper hand. The buyers will try to sustain the price above $30,000 and challenge the stiff overhead resistance zone between $31,000 and $31,805. Sellers are expected to protect this zone with vigor.</p><p>Time is running out for the bears. If they want to prevent the upside, they will have to quickly yank the price back below $28,143. If they do that, the BTC/USDT pair could plummet to the 50-day simple moving average ($26,882).</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) once again bounced off the strong support near $1,531 as seen from the long tail on the Oct. 19 candlestick. This shows that the bulls are fiercely defending the $1,531 support.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/7e90382f-5cd5-4fea-8ee4-c4a7f3818768.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AETHUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The repeated failure of the bears to break the $1,531 level is likely to attract buyers. The 50-day SMA ($1,613) may act as a hurdle but if crossed, the ETH/USDT pair could pick up momentum and attempt a rally to $1,746. </p><p>Although the downsloping moving averages indicate advantage to bears, the positive divergence on the RSI suggests that the negative momentum is reducing. The bears will be back in the driver’s seat if they sink the price below $1,531.</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) turned down from the downtrend line on Oct. 16 but a positive sign is that the bulls did not allow the price to dip below the 20-day EMA ($210). This indicates a change in sentiment from selling on rallies to buying on dips.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/ce80ddcd-24c7-4def-95f8-9d7249f5a821.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABNBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Buyers will once again try to drive and maintain the price above the downtrend line. If they succeed, the BNB/USDT pair could accelerate to $235 and thereafter extend the rally to $250. The bears are likely to mount a strong defense at this level.</p><p>The important support to watch on the downside is the 20-day EMA and the next is $203. A break and close below this level will open the doors for a possible decline to the next major support at $183.</p><h2>XRP price analysis</h2><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) turned down from the moving averages on Oct. 16 but the bears could not sink the price below the immediate support at $0.46. This suggests a lack of selling at lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/28199404-18aa-4bdb-a632-24ab15caa627.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AXRPUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The moving averages have flattened out and the RSI is just above the midpoint. This suggests that the XRP/USDT pair may oscillate between $0.46 and $0.56 for some time. If the price stays above the moving averages, the pair may rally to the overhead resistance at $0.56.</p><p>On the contrary, if the price falls below the moving averages, it will increase the possibility of a drop to $0.46. The next trending move is likely to begin above $0.56 or below $0.41. </p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) soared and closed above the neckline of the inverse head and shoulders pattern on Oct. 19, completing the bullish setup. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/44cfa45e-5cf0-4e5c-8467-5616ba56dd13.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASOLUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The buying continued on Oct. 20 and the bulls are trying to thrust the price above the immediate resistance at $27.12. If they can pull it off, the SOL/USDT pair could rise toward the pattern target of $32.81.</p><p>Usually, after breaking out of a major resistance, the price turns down and retests the breakout level. In this case, the price may return to test the neckline. If the price turns up from this level, the pair may start a new up-move. A break and close below $23 could shift the advantage back in favor of the bears.</p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) once again slipped to the strong support at $0.24 on Oct. 19 but the bulls held the level successfully. The positive divergence on the RSI indicates that the bearish momentum is reducing.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/957889dd-44b1-4b2e-9eb2-1bc1cf6eed1f.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AADAUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The price has reached the moving averages which are likely to act as a strong hurdle. If bulls overcome this resistance, the ADA/USDT pair could first rise to $0.27 and subsequently to $0.28. The bears are expected to fiercely guard this zone.</p><p>If the price turns down from $0.28, it will signal that the pair may form a range for a few days. On the downside, the bears will have to tug the price below $0.24 to indicate the resumption of the downtrend. The next support is at $0.22 and then at $0.20.</p><h2>Dogecoin price analysis</h2><p>The long tail on Dogecoin’s (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) Oct. 19 candlestick shows that the bulls are aggressively buying in the zone between $0.055 and $0.06.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/97ef71d6-9240-4e60-94f1-42c6b03a7a7c.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOGEUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls will have to shove the price above the 50-day SMA ($0.06) to indicate a comeback. That could clear the path for a potential rise to the overhead resistance at $0.07. This level may witness a tough battle between the bulls and the bears but if the buyers prevail, the DOGE/USDT pair could surge to $0.08.</p><p>If the price turns down from the moving averages, it will indicate that the bears remain active at higher levels. A tumble below $0.055 will signal the start of the next leg of the downtrend.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/why-is-xrp-price-up-today\"><strong><em>Why is XRP price up today?</em></strong></a></p><h2>Toncoin price analysis</h2><p>Toncoin (TON) broke below the 61.8% Fibonacci retracement level of $1.98 on Oct. 12 but the bears could not capitalize on this weakness. The bulls purchased the dip and pushed the price back above $1.98 on Oct. 17.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/93b1b515-0266-4140-b2e2-78ee3ca9834e.png\"  /><figcaption style=\"text-align: center;\"><em>TON/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ALTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears are trying to halt the recovery at $2.20 but a positive sign is that the bulls have not allowed the price to slip back below the moving averages. This suggests that the sentiment has turned positive and traders are buying the dips.</p><p>If buyers kick the price above $2.20, the TON/USDT pair will complete a small inverted H&amp;S pattern. The target objective of this setup is $2.47. This positive view will invalidate if the price turns down and slumps below $1.89.</p><h2>Polkadot price analysis</h2><p>Polkadot (<a href=\"https://cointelegraph.com/polkadot-price-index\">DOT</a>) has been in a strong downtrend. The bears tried to extend the decline on Oct. 19 but the long tail on the candlestick shows solid buying at lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/457713b0-d9cc-4985-a66c-7015cf9f606e.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>DOT/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOTUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The relief rally is likely to reach the breakdown level of $3.91 where the bears are expected to mount a strong defense. If the price turns down from this level, it will indicate that the sentiment remains negative and traders are selling on rallies. The bears will again try to pull the price below $3.56 and start the next leg of the downtrend.</p><p>On the contrary, if the price breaks above $3.91, it will suggest the start of a stronger recovery. The DOT/USDT pair could then climb to the downtrend line. A break above $4.33 will signal a potential trend change.</p><h2>Polygon price analysis</h2><p>Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) has been trading below the moving averages for the past few days, but the bears have failed to break the support at $0.49. This suggests that selling dries up at lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/2ad4a749-09f4-4042-b1db-fd611795b4a6.png\"  /><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AMATICUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The positive divergence on the RSI also shows that the selling pressure could be reducing. If buyers catapult and sustain the price above the moving averages, the MATIC/USDT pair could surge to the overhead resistance at $0.60. This level may again attract selling by the bears. The pair is likely to swing between $0.49 and $0.60 for a while longer.</p><p>On the downside, $0.49 remains the key level to keep an eye on. If this level gives way, the pair may plummet to $0.45. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-20T16:24:53.000Z",
    "title": "Hong Kong securities regulator updates crypto policies, citing market developments",
    "url": "https://cointelegraph.com/news/hong-kong-regulator-changes-crypto-policies",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/949a6651-f94e-47df-b525-18ef765a4ff8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The notice came more than a month after more than a thousand users reported losses from the JPEX crypto exchange.</p>\n                    <p><p>The Securities and Futures Commission (SFC) of Hong Kong announced it will update its policies on virtual currency sales and requirements “in light of the latest market developments and enquiries from the industry”.</p><p>In an Oct. 20 notice, the SFC <a href=\"https://apps.sfc.hk/edistributionWeb/gateway/EN/circular/intermediaries/supervision/doc?refNo=23EC44\" target=\"_blank\" rel=\"noopener nofollow\">said</a> under the updated guidelines, certain virtual currency products will only be available to professional investors. In addition, intermediaries in the crypto space “should assess whether clients have knowledge of investing in virtual assets” prior to handling any transactions.</p><p>“Although virtual assets are becoming more popular in some parts of the world, the global regulatory landscape remains uneven,” said the SFC. “The risks associated with investing in virtual assets identified by the SFC back in 2018 continue to apply.”</p><p>The updated requirements considered virtual assets “complex products” under the SFC and subject to the same guidelines as similar financial products. The commission specifically mentioned crypto exchange-traded funds and products issued outside Hong Kong as examples of complex products.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/less-50-percent-hong-kong-retail-crypto-investors-aware-regulations\"><strong><em>Less than 50% of Hong Kong retail crypto investors aware of relevant regulations: Survey</em></strong></a></p><p>Many crypto users in Hong Kong are still reeling from the scandal surrounding the JPEX crypto exchange. In September, the SFC announced that it had received more than 1,000 complaints related to JPEX, with <a href=\"https://cointelegraph.com/news/jpex-blames-market-makers-hong-kong-liquidity-crisis\">users claiming losses</a> totaling millions of dollars. Local police later arrested six JPEX employees for operating an unlicensed crypto exchange.</p><p>It’s unclear if SFC’s updated policies are the direct result of the events surrounding JPEX, but the regulator said in September it would <a href=\"https://cointelegraph.com/news/crypto-rules-hong-kong-tightened-after-jpex-fraud-case\">increase its efforts</a> to keep crypto investors informed of risks. In October, the Hong Kong Police Force and SFC <a href=\"https://cointelegraph.com/news/hong-kong-police-sfc-crypto-task-force-jpex-scandal\">formed a working group</a> aimed at monitoring and investigating potential illegal activities involving digital assets.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitmains-hong-kongs-jpex-bitget-asia-express/\"><strong><em>Bitmain’s revenge, Hong Kong’s crypto rollercoaster: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-20T16:34:04.000Z",
    "title": "Binance Stops Visa Card Support in Europe",
    "url": "https://cryptobriefing.com/binance-stops-visa-card-europe/?utm_source=feed&utm_medium=rss",
    "description": "Binance ends Visa card support in Europe Dec 20 amid regulatory pressure on crypto debit cards, leaving users to find alternatives."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-20T16:31:54.000Z",
    "title": "Crypto Under $1 With High Potential - Ripple (XRP), Stellar (XLM), Dogecoin (DOGE), Polygon (MATIC), Shiba Inu (SHIB)",
    "url": "https://cryptodaily.co.uk/2023/10/crypto-under-1-with-high-potential-ripple-xrp-stellar-xlm-dogecoin-doge-polygon-matic-shiba-inu-shib",
    "description": "Explore cryptocurrency trends, focusing on market stability, notable developments, and comprehensive price analysis for Ripple (XRP), Stellar (XLM), Dogecoin (DOGE), Polygon (MATIC), Shiba Inu (SHIB), and ScapesMania (MANIA). Uncover essential technical indicators, significant catalysts, and promising trading opportunities within the dynamic crypto environment."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-20T16:20:20.000Z",
    "title": "Prosecutors in SBF’s case argue ‘effective altruism’ relevance during the trial",
    "url": "https://www.cryptopolitan.com/sbfs-prosecutors-argue-effective-altruism/",
    "description": "Sam Bankman-Fried&#8217;s&#160; (SBF) case has brought about a lot of public attention, captivating crypto enthusiasts across the globe. This has been not only for the legal claims but also the ethical as well as moral dilemmas the case has presented. The current central debate involves the concept of &#8216;effective altruism&#8217;, and its justification is yet ... <a title=\"Prosecutors in SBF’s case argue ‘effective altruism’ relevance during the trial\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sbfs-prosecutors-argue-effective-altruism/\" aria-label=\"More on Prosecutors in SBF’s case argue ‘effective altruism’ relevance during the trial\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-20T16:13:00.000Z",
    "title": "Bitcoin ETFs could be a game changer for investors – Google Search weighs In",
    "url": "https://www.cryptopolitan.com/bitcoin-etfs-search-surges-on-google-trends/",
    "description": "The crypto world has been in a frenzy following the market sentiments surrounding Bitcoin ETF approval by the US Securities and Exchanges Commission (SEC). Both institutional and retail traders have been enthusiastic about the approval of this new financial product that could revolutionize the entire crypto market. Exchange-traded Funds act as a bridge between traditional ... <a title=\"Bitcoin ETFs could be a game changer for investors &#8211; Google Search weighs In\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-etfs-search-surges-on-google-trends/\" aria-label=\"More on Bitcoin ETFs could be a game changer for investors &#8211; Google Search weighs In\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-20T16:15:00.000Z",
    "title": "Whale Transfers 4.5T SHIB From One Unknown Wallet to Another",
    "url": "https://coinedition.com/whale-transfers-4-5t-shib-from-one-unknown-wallet-to-another/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Whale Transfers 4.5T SHIB From One Unknown Wallet to Another\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/According_to_Beosin_monitoring_the_transaction_on_Shibarium_Shiba-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The transaction happened in the middle of the recent SHIB burn exercise. Shib CoOp became the first project to burn SHIB on the Shibarium network. Whale Alert shows that 4.5 trillion SHIB was transferred from one unknown wallet to another. Information from Whale Alert, the blockchain tracker and analytics platform, shows that 4,560,030,677,374 SHIB, equivalent [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/whale-transfers-4-5t-shib-from-one-unknown-wallet-to-another/\">Whale Transfers 4.5T SHIB From One Unknown Wallet to Another</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]