[
  {
    "source": "Decrypt",
    "date": "2023-07-05T12:34:15.000Z",
    "title": "Binance Halts Deposits and Withdrawals on 10 Multichain-Bridged Tokens",
    "url": "https://decrypt.co/147362/binance-halts-deposits-and-withdrawals-on-10-multichain-bridged-tokens",
    "description": "Binance previously suspended deposits of the ten tokens after some transactions on the Multichain protocol froze back in May."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-05T12:20:27.000Z",
    "title": "Crypto Storage Token Storj Hits 10-Month High Overnight",
    "url": "https://decrypt.co/147361/crypto-storage-token-storj-hits-10-month-high-overnight",
    "description": "Crypto storage token Storj has seen its market capitalization double overnight as trading volumes for the asset surge in South Korea. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T12:20:00.000Z",
    "title": "How blockchain technology and DeFi could help solve the housing crisis",
    "url": "https://cointelegraph.com/news/how-blockchain-technology-and-defi-could-help-solve-the-housing-crisis",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/2aca8ed9-61c6-4d7c-adf4-6f04ce440d1c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Home Construction Collective’s co-founders spoke with The Agenda podcast to explain why homes are so expensive and how decentralized finance might provide an answer.</p>\n                    <p><p>The prices of houses are sky-high all around the world, and homebuyers are feeling the pain. While affording a home has never been more difficult for many people, the ability to raise funds to construct new homes has never been easier, thanks to <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a>. The newly launched Home Construction Collective is attempting to leverage blockchain’s coordination and fundraising potential in an effort to fund the construction of, and therefore increase the supply of, affordable homes.</p><p>On Episode 14 of <em>The Agenda </em>podcast, hosts Jonathan DeYoung and Ray Salmond speak with Home Construction Collective co-founders Isaac Lidsky and Erich Wasserman about the housing crisis and how blockchain technology may offer a solution.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/c5653a5f-e9ca-4dae-a994-e03bad4c9bea.jpg\"  /></figure><p><strong>Unpacking the housing crisis</strong></p><p>According to Lidsky and Wasserman, the housing crisis is not truly a crisis of prices — instead, it’s a supply crisis. “We have systematically underproduced homes for decades,” Lidsky said. “Depending on what estimates you look at, we’re short between 4.5 million to 7 million homes today.” Exacerbating this problem is that more and more homes are being built specifically to be rented out rather than sold to prospective homeowners.</p><p>The lack of affordable homes has profoundly impacted the net worth of younger generations. “Home ownership is usually the biggest investment that people make in their lifetimes,” said Wasserman. “It’s the gateway to financial access. Homeowners have a staggering 40 times the net worth of renters.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/tokenized-mortgages-can-prevent-another-housing-bubble-crisis-says-casper-exec\"><strong><em>Tokenized mortgages can prevent another housing bubble crisis, says Casper exec</em></strong></a></p><p>Lidsky added: “In their 40s, the baby boomers accounted for 21% of all wealth. In their 40s, Gen Xers, it had dropped to 2%. And for us millennials, we’re at 4.8%, with Mark Zuckerberg alone representing 2% of that 4.8%. And those are the horrendous numbers.”</p><p><strong>Using DeFi to incentivize starter home construction</strong></p><p>Home Construction Collective is focused on financing the construction of “starter homes,” or homes that first-time buyers can afford, which Lidsky reported are in incredibly short supply. “The more of them we can put on the market, the more affordable they’ll become,” he posited. </p><template data-ct-widget=\"buzzsprout\" data-buzzsprout-podcast-id=\"2096305\"></template><p>To help achieve this goal, the project fractionalizes the investment process, allowing people from around the world to invest in the construction of a new home and profit once it sells. Wasserman broke down the project’s mission in this regard:</p><blockquote>“The problem we’re trying to solve and the thing we’re trying to do is to broaden investor access to these assets, which have been the, really, exclusive domain of regional banks and private lenders. And we’d submit they’ve not done a terribly good job over the last decades in keeping up with demand.”</blockquote><p>Lidsky and Wasserman also co-founded a protocol called Rigor, which uses blockchain to streamline the construction supply chain and payment process. Lidsky said that by using Rigor, the cost of manufacturing the homes financed by Home Construction Collective is reduced:</p><blockquote>“In the background, we’re also, at the pace of innovation in Web3, moving smartly to sort of further develop our tools ultimately to bring down the cost to produce these homes, bring down the cost in cycle times and in dollars. And so it’s a powerful one-two punch.”</blockquote><p>To hear more from Lidsky and Wasserman’s conversation with <em>The Agenda,</em> listen to the full episode on <a href=\"https://cointelegraph.com/podcasts/the-agenda\">Cointelegraph’s Podcasts page</a>, <a href=\"https://podcasts.apple.com/us/podcast/the-agenda/id1659393166\" target=\"_blank\" rel=\"noopener nofollow\">Apple Podcasts</a> or <a href=\"https://open.spotify.com/show/6azmkkIXj5LQbxTRAbAqXS\" target=\"_blank\" rel=\"noopener nofollow\">Spotify</a>. And don’t forget to check out Cointelegraph’s <a href=\"https://cointelegraph.com/podcasts\">full lineup</a> of other shows! </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/zkrollups-endgame-scaling-blockchains-polygon-miden-founder/\"><strong><em>ZK-rollups are ‘the endgame’ for scaling blockchains, Polygon Miden founder</em></strong></a></p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph. </p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T12:13:33.000Z",
    "title": "Denmark orders Saxo Bank to erase cryptocurrency holdings",
    "url": "https://cointelegraph.com/news/denmark-orders-saxo-bank-to-erase-cryptocurrency-holdings",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/05b7232d-5d97-43c3-9762-9c583444abaa.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>DFSA's decision about Saxo Bank's crypto holdings will have a \"very limited impact\" on its business and its customers will not experience any significant changes, the lender said.</p>\n                    <p><p>Financial regulators in Denmark are coming after cryptocurrency service providers, declaring that local banks are not allowed to hold cryptocurrency to hedge against trading risks.</p><p>On July 4, the Danish Financial Supervisory Authority (DFSA) officially <a href=\"https://www.finanstilsynet.dk/Tilsyn/Tilsynsreaktioner/Paabud/2023/Saxo_bank_050723\" target=\"_blank\" rel=\"noopener nofollow\">ordered</a> the local investment bank Saxo bank to dispose of its own holdings in crypto.</p><p>The regulator said that Saxo Bank’s crypto activity “lies outside of the legal business area of financial institutions,” citing section 24 of the Denmark’s Financial Business Act.</p><p>According to the DFSA, Saxo Bank offers its customers the opportunity to trade a number of cryptocurrency products through its platform. The firm also offers several crypto-linked exchange-traded funds and exchange-traded notes, the regulator noted, adding that “it is possible to speculate on crypto assets.”</p><p>Additionally, Saxo Bank has its own portfolio of cryptocurrency assets, which are held as a hedge to offset the market risk associated with the bank’s crypto products, the DFSA wrote.</p><p>Citing Annex 1 of the Financial Business Act, the authority said that trading in crypto-assets does not appear to be covered by the legal business area of financial institutions in Denmark. The DFSA stated:</p><blockquote>“Based on the above, Saxo Bank's trading in crypto assets for its own account is found to be outside the legal business area of ​​financial institutions. On this basis, Saxo Bank is ordered to dispose of its own holdings of crypto assets.”</blockquote><p>In the announcement, the DFSA also mentioned Europe's Markets in Crypto Assets regulation known as MiCA. The regulator noted that MiCA regulations will only take effect in its entirety starting from December 2024. “The area thus remains unregulated for the time being,” the regulator added.</p><p>The order from the FSA doesn’t make Saxo Bank stop its crypto offering, Saxo global communications head Lasse Lilholt told Cointelegraph.</p><p>“We naturally take the decision of the Financial Supervisory Authority into account and will read it thoroughly to consider how we otherwise respond to it,” the representative noted. As a Saxo Bank customer, one does not own the underlying cryptocurrency but instead buys a financial product that follows the price of the cryptocurrency.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner\"><strong><em>BlackRock spot Bitcoin ETF filing names Coinbase as ‘surveillance-sharing’ partner</em></strong></a></p><p>The spokesperson also noted Saxo Bank holds a “very limited portfolio of cryptocurrencies,” solely to hedge a marginal proportion of risk associated with the facilitation of crypto assets. The representative added:</p><blockquote>“The vast majority of this exposure is mitigated through exchange-traded and cleared products. Therefore, the FSA's decision will have a very limited impact on our business, and our customers will not experience any significant changes.”</blockquote><p>The DFSA didn’t immediately respond to Cointelegraph’s request to comment.</p><p>It appears that financial authorities in Denmark have been somewhat uncertain about local cryptocurrency regulations. According to some legal <a href=\"https://freemanlaw.com/cryptocurrency/denmark/\" target=\"_blank\" rel=\"noopener nofollow\">sources</a>, cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) do not fall under any category of financial services in Denmark and as such are not covered by the DFSA’s jurisdiction.</p><p>Despite uncertainty, the <a href=\"https://cointelegraph.com/news/crypto-financial-services-provider-januar-receives-full-danish-payments-license\">DFSA authorized the Danish crypto-related startup Januar</a> to conduct business in 30 European Economic Area markets in April 2023. Previously, The Supreme Court of Denmark <a href=\"https://cointelegraph.com/news/bitcoin-profits-are-taxable-in-certain-cases-says-denmark-s-supreme-court\">made two judgments</a> on whether the sale of Bitcoin under certain circumstances qualifies as a taxable event in March.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-travel-booking-bad-3-weird-uses-chatgpt-crypto-plugins/\"><strong><em>AI Eye: AI travel booking hilariously bad, 3 weird uses for ChatGPT, crypto plugins</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-05T12:20:14.000Z",
    "title": "Binance suspends support for 8 Multichain-bridged tokens amid cross-chain issues",
    "url": "https://cryptoslate.com/binance-suspends-support-for-eight-multichain-bridged-tokens-amid-cross-chain-issues/",
    "description": "<p>Crypto exchange Binance will suspend support for eight Multichain-bridged (MULTI) tokens on July 7 till further notice because of the issues with some of the protocol&#8217;s cross-chain routes. In a July 5 update, Binance stated that its users would be unable to deposit or withdraw digital assets, including Travala, Alchemy Pay, Harvest Finance, Polkastarter, and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-suspends-support-for-eight-multichain-bridged-tokens-amid-cross-chain-issues/\">Binance suspends support for 8 Multichain-bridged tokens amid cross-chain issues</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-05T12:19:00.000Z",
    "title": "The Crypto Weekly Roundup: Our Expertise Combined With AI",
    "url": "https://cryptodaily.co.uk/2023/07/the-crypto-weekly-roundup-our-expertise-combined-with-ai",
    "description": "<p>We are delighted to announce our new video series, the Crypto Weekly Roundup, helping summarize the most important events from the world of crypto over the past week.&nbsp;</p>\n<p>The Crypto Weekly Roundup series of videos is the latest addition to our treasure trove of content and will give our users information from the crypto space in a manner that is dynamic, compelling, and, most important of all, easy to understand. The video series is the result of our dedication to bringing you the latest news and developments from the crypto space.</p>\n<p>That&rsquo;s not all! For the first time, we have combined human intelligence with artificial intelligence, making this a truly historic and unique endeavor. Our AI avatar will co-host the video along with our team and bring a unique perspective, making the content more engaging and insightful for our audience. We believe that merging our team&rsquo;s human expertise with AI can offer our audience a comprehensive analysis of the crypto space, redefining how news is analyzed and delivered and helping reshape the audience&rsquo;s viewing experience.</p>\n<p>We hope our game-changing weekly roundup can become an integral part of our audience&rsquo;s weekly crypto digest. You can view the videos on our YouTube channel, and we highly encourage anyone that is interested in the crypto ecosystem to spend a few minutes and access the latest developments in crypto. Our Crypto Weekly Roundup series helps you stay informed and ahead of the curve with a unique blend of expert analysis and AI-enhanced insights. Checkout this week's roundup video:</p>\n<p></p>\n<p>Don&rsquo;t miss out on the chance to stay up-to-date with the latest developments because when it comes to crypto, every bit of news counts!</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-05T12:30:37.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Consolidates Lower Ahead of FOMC Meeting Minutes",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-consolidates-lower-ahead-of-fomc-meeting-minutes/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2023079627-2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BTC Consolidates Lower Ahead of FOMC Meeting Minutes\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2023079627-2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2023079627-2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2023079627-2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2023079627-2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2023079627-2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2023079627-2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2023079627-2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin dropped below $31,000 on Wednesday, as markets consolidated ahead of the upcoming U.S. Federal Open Market Committee (FOMC) minutes. The minutes of last month&#x2019;s meeting are expected to show the Fed&#x2019;s potential path to further hikes this year. Ethereum fell for a second straight session. Bitcoin Bitcoin (BTC) consolidated on Wednesday, as markets prepared [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T12:38:54.000Z",
    "title": "From Pepe to fortunes – Unveiling the strange new ‘2.0’ phenomenon in knockoff cryptos",
    "url": "https://www.cryptopolitan.com/pepe-fortunes-strange-new-crypto-knockoffs/",
    "description": "Following a two-day surge, Pepe (PEPE) reached a two-month high. Market investors have profited from the asset&#8217;s recent increase. Microcaps that claim to be the long-awaited return of popular meme currencies are the current fad in some sectors of the crypto industry. Pepecoin 2.0 success Trading volumes for tokens like Pepe 2.0, Floki 2.0, and ... <a title=\"From Pepe to fortunes &#8211; Unveiling the strange new &#8216;2.0&#8217; phenomenon in knockoff cryptos\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pepe-fortunes-strange-new-crypto-knockoffs/\" aria-label=\"More on From Pepe to fortunes &#8211; Unveiling the strange new &#8216;2.0&#8217; phenomenon in knockoff cryptos\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T12:29:24.000Z",
    "title": "79% of Corporate Strategists View AI and Analytics as Crucial for Future Success, Gartner Survey",
    "url": "https://www.cryptopolitan.com/corporate-strategists-ai-and-analytics/",
    "description": "According to a recent survey conducted by Gartner, Inc., 79% of corporate strategists believe that technologies such as analytics, artificial intelligence (AI), and automation will play a critical role in their success over the next two years. The survey also revealed that strategists see the potential for automating a significant portion of strategic planning and ... <a title=\"79% of Corporate Strategists View AI and Analytics as Crucial for Future Success, Gartner Survey\" class=\"read-more\" href=\"https://www.cryptopolitan.com/corporate-strategists-ai-and-analytics/\" aria-label=\"More on 79% of Corporate Strategists View AI and Analytics as Crucial for Future Success, Gartner Survey\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-05T12:11:57.000Z",
    "title": "Bitcoin’s BRC-69 standard eliminates data limit for Ordinals",
    "url": "https://crypto.news/bitcoins-brc-69-standard-eliminates-data-limit-for-ordinals/",
    "description": "Bitcoin Ordinals, often called bitcoin&#8217;s (BTC) version of NFTs, are experiencing a significant surge as a new token standard, BRC-69, was launched on July 3. The latest standard brings an innovative solution to reduce the time and cost of making&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-05T12:30:00.000Z",
    "title": "Big Eyes Price Crashes ~100% After $34M Presale, Smart Money Investing In This ERC-20 Token Instead",
    "url": "https://www.crypto-news-flash.com/big-eyes-price-crashes-100-after-34m-presale-smart-money-investing-in-this-erc-20-token-instead/?utm_source=rss&utm_medium=rss&utm_campaign=big-eyes-price-crashes-100-after-34m-presale-smart-money-investing-in-this-erc-20-token-instead",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T133159.052.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T133159.052.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T133159.052-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The Big Eyes [$BIG] token presale raised an alleged $33.5-million in funding from crypto traders.   Those  investors saw a huge token value increase in the first few days following its launch on public exchanges — Uniswap, Poloniex, OKXWallet, LBank, and BIG SWAP.   However, just after those glory days things took an abrupt crash. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-05T12:17:39.000Z",
    "title": "Dogecoin Competitor and ADA-based SNEK Unveils Innovative Future Plan – Is Now the Time to Invest? Report",
    "url": "https://www.crypto-news-flash.com/dogecoin-competitor-and-ada-based-snek-unveils-innovative-future-plan-is-now-the-time-to-invest-report/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-competitor-and-ada-based-snek-unveils-innovative-future-plan-is-now-the-time-to-invest-report",
    "description": "<img width=\"1000\" height=\"664\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The Snek meme coin team has announced an improved website and more burn mechanisms to unleash the underlying value. The new Cardano-based meme coin has a market cap of about $29M and a 24-hour traded volume of around $1 million. The ultimate growth of the Cardano (ADA) market is heavily dependent on the underlying smart [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-05T12:13:43.000Z",
    "title": "Top 5 PoW Privacy Coins Ready to Explode",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-pow-privacy-coins-ready-to-explode/",
    "description": "<p>Cryptocurrencies have revolutionized the financial landscape, offering fast and secure transactions. However, the lack of privacy in certain cryptocurrencies has raised concerns about the confidentiality of users&#8217; financial activities. In this article, we will explore five prominent privacy coins &#8211; Monero, Firo (formerly Zcoin), Dash, Verge, and PIVX. Also, delve into the improvements they bring [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-pow-privacy-coins-ready-to-explode/\">Top 5 PoW Privacy Coins Ready to Explode</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-05T12:33:07.000Z",
    "title": "iFX EXPO: A Tour Around the World",
    "url": "https://coinedition.com/ifx-expo-a-tour-around-the-world/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/PR-49.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/PR-49.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/PR-49-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/PR-49-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/PR-49-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/PR-49-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/PR-49-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/PR-49-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/PR-49-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/PR-49-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/PR-49-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/PR-49-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/PR-49-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/PR-49-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/PR-49-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/PR-49-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/PR-49-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Brought to the finance and fintech arena by Ultimate Fintech, iFX EXPO is the largest B2B exhibition worldwide. Faithfully convened every year in key financial hubs around the world, from Dubai in the Middle East to Bangkok in exotic Asia and Limassol on the warm Eastern Mediterranean shores of Europe, the expo brings together thousands [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ifx-expo-a-tour-around-the-world/\">iFX EXPO: A Tour Around the World</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-05T12:25:00.000Z",
    "title": "Solana Bulls Record 7-Day High, Liquid Staking Surge Boosts Growth",
    "url": "https://coinedition.com/solana-bulls-record-7-day-high-liquid-staking-surge-boosts-growth/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/019.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/019.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/019-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/019-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/019-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/019-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/019-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/019-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/019-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/019-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/019-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/019-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/019-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/019-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/019-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/019-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/019-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Solana&#8217;s rise in the crypto space is one worth keeping an eye on. Notably, by the end of June, the combined stake of Solana (SOL) tokens held by liquid staking protocols Marinade Finance, Lido, Jito, JPool, and Socean reached a staggering $187 million. Besides, this represented a significant surge from the year&#8217;s start, when $98 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/solana-bulls-record-7-day-high-liquid-staking-surge-boosts-growth/\">Solana Bulls Record 7-Day High, Liquid Staking Surge Boosts Growth</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]