[
  {
    "source": "CryptoSlate",
    "date": "2023-10-24T20:00:14.000Z",
    "title": "Jameson Lopp demonstrates why Hal Finney could not have been Satoshi Nakamoto",
    "url": "https://cryptoslate.com/jameson-lopp-demonstrates-why-hal-finney-could-not-have-been-satoshi-nakamoto/",
    "description": "<p>Jameson Lopp, a significant figure in the Bitcoin community, published a detailed blog post on Oct. 21 dismissing the speculation that programmer Hal Finney was Satoshi Nakamoto. The anonymity of Satoshi Nakamoto has been a matter of intrigue since Bitcoin&#8217;s (BTC) debut in 2009. Speculation has real-world implications, as evidenced by the experiences of Finney, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/jameson-lopp-demonstrates-why-hal-finney-could-not-have-been-satoshi-nakamoto/\">Jameson Lopp demonstrates why Hal Finney could not have been Satoshi Nakamoto</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-24T20:00:47.000Z",
    "title": "‘Bond King’ Bill Gross Predicts Q4 Recession: Loan Delinquencies and Regional Banks in the Crosshairs",
    "url": "https://news.bitcoin.com/bond-king-bill-gross-predicts-q4-recession-loan-delinquencies-and-regional-banks-in-the-crosshairs/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/gros5s-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"&#039;Bond King&#039; Bill Gross Predicts Q4 Recession: Loan Delinquencies and Regional Banks in the Crosshairs\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/gros5s-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gros5s-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gros5s-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gros5s-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gros5s-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gros5s-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gros5s.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bill Gross, revered as Wall Street&#8217;s &#8216;Bond King,&#8217; foresees a recession clouding the U.S. economy by the year&#8217;s final quarter. He pinpoints the burgeoning issue of overdue car payments and the financial strains beleaguering regional banks as catalysts for the impending economic slump. Bill Gross Foresees Economic Clouds on the Horizon On Tuesday, October 24, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-24T20:00:23.000Z",
    "title": "FET Blasts 14% Higher: See The “Golden” Signal Behind The Surge",
    "url": "https://www.newsbtc.com/analysis/fet/fet-blasts-14-higher-see-the-golden-signal-behind-the-surge/",
    "description": "As the broader cryptocurrency market breaks out on the back of Bitcoin&#8217;s big rally, FET is the next altcoin to double-digit gains. The AI cryptocurrency at one point hit 14% higher intraday. The move could be the start of something special, according to a &#8220;golden&#8221; signal in Fetch.ai. FET Soars 14% As Golden Cross Triggers FET is up 14% today as cryptocurrencies across the board see significant gains led by Bitcoin (BTC) this week. Even before the big move, the AI coin had opened this weekly trading session forming a golden cross of the 50-week and 200-week moving averages. A golden cross occurs when a short term moving average crosses above a long-term moving average from below. This is a buy signal in trend-following technical systems and suggests that a new trend is potentially blossoming. A death cross is the opposite sell signal. While the signal in and of itself is bullish based on the performance of trend-following systems, FET could be showing itself as a crypto market leader by being among the first coins to form such a golden cross. Ethereum (ETH) and Bitcoin are still death crossed, for example. Even recent market stars Chainlink (LINK) and Solana (SOL) haven&#8217;t formed a golden cross on the weekly timeframe. The golden cross has formed &#124; FETUSD on TradingView.com Can Fetch Recapture AI Hype? There&#8217;s no denying fetch.ai&#8217;s latest double-digit price surge has brought fresh excitement and validation to the project. The startup&#8217;s vision of an AI-powered decentralized machine economy clearly resonates with many crypto investors. Furthermore, hype around AI leftover from Nvidia&#8217;s epic rally could find its way further into Fetch.ai. FETUSD rallied by more than 2380% starting from October 2020 through April 2021. In late 2022, Fetch.ai did another 900% following the release of ChatGPT and other big AI projects. What might this next rally result in for return on investment, if it continues higher? Former all-time highs reside around $1.20, which could be the next logical target if price exceeds $0.60, which was the 2023 peak so far. Beyond that, FET would enter price discover and there is no telling how high it could go. But with only two months left in 2023, the $0.60 peak might stand as the record, with FET not able to break above it until 2024. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-24T20:00:22.000Z",
    "title": "XRP Price Confirms Early Stages Of Bull Market? Data Sheds Light On Recent Rally",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-confirms-early-stages-of-bull-market-data-sheds-light-on-recent-rally/",
    "description": "Volatility is back in the crypto market as the XRP price and the price of other major cryptocurrencies trend to the upside and into new year highs. The cryptocurrency is heading towards its next resistance level with a high chance of Related Reading: XRP 10% Rally Strengthens Case For $0.55 Breakout As of this writing, the XRP price trades at $0.57, with a 9% increase in the last 24 hours. The cryptocurrency recorded a 16% spike in the previous seven days and closely followed Bitcoin and Ethereum’s price action, which recorded a 22% and 16% profit over the same period. XRP Price On Its Way To Next Critical Level According to an XRP trader on social media platform X, the token&#8217;s price exceeded the critical resistance level of $0.528. The analyst claims that there is a high chance that the XRP will rise close to $0.60 in the short term. In that sense, the trader believes that $0.66 will operate as the next critical resistance level based on the chart below. The analyst compared the current XRP price with the 2017 bull run. The chart shows that during the 2017 run, XRP closed above the weekly Ichimoku Cloud, a level used to gauge critical resistance and support levels. Once the token broke above that level, it could quickly fall into new highs and price discovery. The analyst stated the following about the XRP price and its potential to continue its run: This is not a warning or financial advice, but I would like to share it with you and emphasize how close we are after this weekly close. It seems the weekly Ichimoku close will be above the clouds, and it only happened before the 2017 run and 2021. When it happens, it happens. Be Ready. Crypto Market Poised For Further Highs A report from Bitfinex Alpha corroborates the market susceptibility to “new narratives.” In particular, the potential approval of a spot Bitcoin Exchange Traded Fund (ETF) in the US. As the XRP price and the market continue to rip higher, volatility in the sector is likely to remain high. As seen on the chart below, the crypto has been inching higher and higher with each volatility event (the potential approval of a Bitcoin ETF was the most recent. Related Reading: Cardano Passes Crucial Update As ADA Price Prepares For 65% Rally In addition, the crypto research firm points to an increase in on-chain activity, which has historically supported higher prices for the sector: On-chain activity also continues to support the conclusion that higher volatility is here to stay and that it will grow in the coming months. Our analysis of Spent Output Age Bands (SOAB), which track the age of coins when they&#8217;re spent, and in particular the &#8220;age bands&#8221; of UTXOs that are most active, we can discern which group of investors is predominantly influencing market changes. For instance, if the UTXOs aged between three and five years show significant activity, it implies that investors who have held their positions for that time span are the primary movers in the market at that juncture. Cover image from Unsplash, charts from Bitfinex Alpha, Dark Defender, and Tradingview"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-24T19:57:00.000Z",
    "title": "Maker’s (MKR) Yearly-High Hit Indicates Caution, Here’s Why",
    "url": "https://coinedition.com/makers-mkr-yearly-high-hit-indicates-caution-heres-why/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Crypto_Market_Revival_Sees_MKR_Rise_10_In_The_Last_24_Hours.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Crypto_Market_Revival_Sees_MKR_Rise_10_In_The_Last_24_Hours.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Crypto_Market_Revival_Sees_MKR_Rise_10_In_The_Last_24_Hours-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Crypto_Market_Revival_Sees_MKR_Rise_10_In_The_Last_24_Hours-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/09/Crypto_Market_Revival_Sees_MKR_Rise_10_In_The_Last_24_Hours-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Crypto_Market_Revival_Sees_MKR_Rise_10_In_The_Last_24_Hours-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Crypto_Market_Revival_Sees_MKR_Rise_10_In_The_Last_24_Hours-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The price of Maker (MKR) briefly tapped $1,650 in the early hours of October 24. The value was the highest price the token has reached throughout 2023. On a 90-day basis, Maker’s price has increased by 35.82%, almost double the performance of Bitcoin (BTC) within the same period. On the daily timeframe, MKR has only [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/makers-mkr-yearly-high-hit-indicates-caution-heres-why/\">Maker’s (MKR) Yearly-High Hit Indicates Caution, Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-24T20:00:25.000Z",
    "title": "London Launches 40-Member Team to Police Digital Assets As Crypto Economy Grows: Report",
    "url": "https://dailyhodl.com/2023/10/24/london-launches-40-member-team-to-police-digital-assets-as-crypto-economy-grows-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/london-launches-team.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/london-launches-team.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/london-launches-team.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/london-launches-team.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/london-launches-team.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/london-launches-team.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/london-launches-team.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>London&#8217;s Metropolitan Police have reportedly assembled a 40-person team dedicated to cracking down on crypto crime. According to a new report from the Financial Times, the police force&#8217;s crypto team began recruiting last December and became operational in May. Detective Inspector Geoff Donoghue, who works on the Met’s crypto investigation team, tells the FT that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/24/london-launches-40-member-team-to-police-digital-assets-as-crypto-economy-grows-report/\">London Launches 40-Member Team to Police Digital Assets As Crypto Economy Grows: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-24T19:55:06.000Z",
    "title": "China Sees Biggest Capital Flight in Seven Years As $5,100,000,000 Exits Struggling Stock Market: Report",
    "url": "https://dailyhodl.com/2023/10/24/china-sees-biggest-capital-flight-in-seven-years-as-5100000000-exits-struggling-stock-market-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/china-yuan-settle-dollar.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/china-yuan-settle-dollar.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/china-yuan-settle-dollar.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/china-yuan-settle-dollar.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/china-yuan-settle-dollar.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/china-yuan-settle-dollar.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/china-yuan-settle-dollar.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Banking giant Goldman Sachs says that China is weathering the biggest capital flight since 2016 amid struggling equities markets. In a report seen by the South China Morning Post (SCMP), Goldman says foreign investors sold off a net total of $3.3 billion in domestic Chinese stocks, bringing the total outflows for October to $5.1 billion. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/24/china-sees-biggest-capital-flight-in-seven-years-as-5100000000-exits-struggling-stock-market-report/\">China Sees Biggest Capital Flight in Seven Years As $5,100,000,000 Exits Struggling Stock Market: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]