[
  {
    "source": "Cointelegraph",
    "date": "2023-06-19T15:57:14.000Z",
    "title": "Etherscan launches AI-powered Code Reader",
    "url": "https://cointelegraph.com/news/etherscan-launches-ai-powered-code-reader",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/c94dc9c8-2124-45d6-9c4f-080df015a37c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The tool allows users to retrieve and interpret the source code of a specific contract address via AI prompt. </p>\n                    <p><p>On June 19, Ethereum block explorer and analytics platform Etherscan <a href=\"https://info.etherscan.com/code-reader/\" target=\"_blank\" rel=\"noopener nofollow\">launched</a> a new tool, dubbed \"Code Reader,\" that utilizes artificial intelligence to retrieve and interpret the source code of a specific contract address. After user prompt input, Code Reader generates a response via OpenAI's large language model (LLM), providing insight into the contract's source code files. Etherscan developers wrote: </p><blockquote>\"To use the tool, you need a valid OpenAI API Key and sufficient OpenAI usage limits. This tool does not store your API keys.\"</blockquote><p>Use cases for Code Reader include gaining deeper insight into contracts' code via AI-generated explanations, obtaining comprehensive lists of smart contract functions related to Ethereum data, and understanding how the underlying contract interacts with decentralized applications (dApps). \"Once the contract files are retrieved, you can choose a specific source code file to read through. Additionally, you may modify the source code directly inside the UI before sharing it with the AI,\" developers wrote.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/efd80f50-3bbd-4ed7-a635-59ce2396ad43.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>A demonstration of the Code Reader tool. Source: Etherscan</em></figcaption></figure><p>Amid an AI boom, some experts have cautioned on the feasibility of current AI models. According to a recent <a href=\"https://foresightventures.medium.com/foresight-ventures-rational-insights-into-decentralized-computing-networks-9aaa94ba9197\" target=\"_blank\" rel=\"noopener nofollow\">report</a> published by Singaporean venture capital firm Foresight Ventures, \"computing power resources will be the next big battlefield for the coming decade.\" That said, despite growing demand for training large AI models in decentralized distributed computing power networks, researchers say current prototypes face significant constraints such as complex data synchronization, network optimization, data privacy and security concerns. </p><p>In one example, Foresight researchers noted that the training of a large model with 175 billion parameters with single-precision floating-point representation would require around 700 gigabytes. However, distributed training requires these parameters to be frequently transmitted and updated between computing nodes. In the case of 100 computing nodes and each node needing to update all parameters at each unit step, the model would require transmitting of 70 terabytes of data per second, far exceeding the capacity of most networks. Researchers summarized:</p><blockquote>\"In most scenarios, small AI models are still a more feasible choice, and should not be overlooked too early in the tide of FOMO on large models.\"</blockquote><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-19T15:47:06.000Z",
    "title": "How to use Solana Saga to buy and sell crypto",
    "url": "https://cointelegraph.com/news/how-to-use-solana-saga-buy-sell-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/52e23959-4855-4d39-9c76-89c772ae0f95.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The first mobile by a blockchain company, the Solana Saga was launched in April 2023. Can users benefit by using Saga for crypto transactions?</p>\n                    <p><h2>Solana Saga, the Web3 mobile phone</h2><p>Solana launched its Web3 mobile phone, the first of its kind, in April 2023. The phone packs all the usual functionalities users have come to expect from a smartphone and tops it up with a <a href=\"https://cointelegraph.com/blockchain-for-beginners/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\">Web3</a> experience. It includes a <a href=\"https://cointelegraph.com/defi-101/what-are-dapps-everything-there-is-to-know-about-decentralized-applications\">decentralized application (DApp)</a> store and seamless integration across <a href=\"https://cointelegraph.com/tags/wallet\">crypto wallets</a> and DApps. Saga has been tagged as the phone “that keeps on giving.”</p><p>The phone has been on pre-order for several months, and those who pre-ordered enjoyed airdrops like the “Saga Pass.” Holders of the Saga Pass also received several art <a href=\"https://cointelegraph.com/news/what-is-a-crypto-airdrop-and-how-does-it-work\">airdrops</a> in the form of <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a> leading up to the April launch. On April 13, 2023, Anatoly Yakovenko, co-founder of Solana, went on stage to announce the launch of the phone and its features.</p><h2>First reactions</h2><p>The phone arrived a few weeks late for European users due to supply chain challenges. Even when American users started receiving their phones in April, it took May for those across the Atlantic to get theirs. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/6f0d9183-8c47-41d0-aed1-888032cff017.png\"  /></figure><p>The phone has a good form factor that is not too different from an iPhone. The green buttons, ceramic backing and stainless steel frame make it feel like a mainstream phone. The phone runs on Android OS and is manufactured by OSOM, which presented it alongside the Solana co-founder at the launch event.</p><p>The phone packs a bunch of hardware elements. It has a 6.67-inch, 1080p resolution AMOLED screen and a 120Hz display. The processor used is the Qualcomm Snapdragon 8+ Gen1 with 12 gigabytes of RAM. The phone also comes with 512GB of storage, which is not very common with smartphones. The phone lasts longer than a typical iPhone 14 Pro with a 4,110-mAh battery. </p><p>There is also a fingerprint sensor on the back of the phone, which feels ergonomically intuitive for users. The camera takes good pictures, although an objective analysis of how it compares with an iPhone or Samsung camera is beyond the scope of this article. The sound quality of the in-built speakers could be better.</p><h2>Setting up and software</h2><p>The phone setup is pretty quick. The setup process includes creating a Solana wallet and a seed vault where the seed phrase is stored. Users can then rely on their fingerprints (biometrics) to unlock their wallets and sign transactions. The seed vault is a fundamental feature that sets it up for the Web3 experience.</p><p>The phone works like any other Android phone, and therefore, the basic setup is not any different from that of a normal Android phone. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/2866430b-da30-4b11-b0d3-fb2a71012cae.png\"  /></figure><p>But it also comes with a Solana-powered DApp store. The app store provides us access to a number of DApps on the Solana network across games, NFTs, <a href=\"https://cointelegraph.com/defi-101/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> and social categories. When the phone was launched, there were no more than a dozen apps. But through April and May 2023, more apps have been shipped, and the app store now has over 25 apps.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/24665b96-e74d-4079-9b43-f26a264c1c39.png\"  /></figure><p>The setup of the Phantom wallet, which is commonly used on the Solana network, is quite seamless and simple. However, some users have had trouble downloading other applications onto the phone. Through April and May 2023, the DApp store had a few updates, which seem to have fixed these issues.</p><h2>Some Saga experiences</h2><p>The Saga brings the Solana user experience to life by providing exclusive access to several DApps. To start with, Saga users receive a genesis token, which helps the Solana DApps ecosystem identify loyal users and reward them over time.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/bbed2f83-fae0-408c-bd4b-54690f06b6e5.png\"  /></figure><p>On the practical side, transactions using the Phantom wallet to swap USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) for Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) were quite seamless using the fingerprint sensor. For once, a crypto transaction feels like a fintech contactless payment — mechanical and mindless.</p><p>Other key applications worth mentioning are Dialect, a Web3 messaging app using NFT stickers. Solana’s compressed NFT technology makes minting an NFT extremely cost-efficient. The Dialect app also gamifies collections of NFT stickers that can be then used in messages.</p><p>The Mintify app connects to the user’s photos and allows minting them without a fuss. The app connects with the Phantom wallet to charge a fee in SOL (about 0.01 SOL per mint). Once the user approves the mint, it happens instantly, with pictures uploaded on-chain and an address provided immediately.</p><p>Some of the DApps that were largely web-based for all users have shown up on the Saga app store. Squads, a multisig wallet on Solana, is an example. They may have held back their mobile launch for the Saga release. </p><p>This may be a sign of things to come as Web3 apps show allegiance to their parent chain’s ecosystem infrastructure. However, that would also limit their distribution capabilities and restrict them to a limited user base. </p><p>Apart from these integrated and exclusive user experiences, the Solana Mobile team has also announced meaningful airdrops. For instance, Claynosaurz, one of the top NFT communities by market capitalization on Solana, is doing an airdrop for users who pre-ordered the phone.</p><p>Other Web3 apps work seamlessly, too. Saga relies on the Android ecosystem to support other Web3 applications. However, they do not offer the same integrated experience that Saga DApps can offer.</p><h2>Can Solana Saga be improved?</h2><p>The Saga costs $1,000 apiece, and that is a big ask from a liquidity-drained Web3 user at the depths of a <a href=\"https://cointelegraph.com/trading-for-beginners/bull-vs-bear-crypto-market-what-is-the-difference-and-how-to-handle-both\">bear market</a>. It is generally the Solana-loyalists, liquidity-rich and Solana-curious who typically go for this innovation. </p><p>While the fingerprint sensor is useful and intuitive, it still is not the same as facial recognition, which is perhaps a more intuitive and instantaneous experience. Saga also doesn’t support e-Sims. For users who travel frequently and may need to use two or three mobile numbers on one phone, e-Sims are quite helpful.</p><p>The DApp store experience has received mixed feedback due to technical glitches. One of the key sectors that is expected to bring 1 billion users onboard to Web3 is gaming. The DApp store only has three games as of May 26, 2023. Despite all these glitches, it is a promising start to a much-needed development in the industry.</p><h2>What lies ahead for the Solana Saga?</h2><p>Will Saga beat the iPhone or Android anytime soon? Highly unlikely. This is an experiment to provide a specific user experience and its benefits to the converted (native Web3/Solana users). For others, it is just a glimpse into the future.</p><p>While some may call it sheer coincidence, Apple’s approval of Uniswap, Axie Infinity and in-app sales on <a href=\"https://cointelegraph.com/metaverse-for-beginners/what-is-stepn-gmt-a-beginners-guide-on-the-web3-lifestyle-app\">StepN</a> are all indicators that the Saga is influencing some of the macro trends in the industry. </p><p>The Apple tax of 30% is still a drain on creators’ revenue; however, that may be a future tweak that might come when Apple’s hands are forced. Until then, Saga users can be the guinea pigs for perhaps an underrated Web3 experiment. </p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-19T15:45:40.000Z",
    "title": "SEC Sued Binance and Coinbase, Here’s How to Outperform in the Red Market With ATPBot",
    "url": "https://www.cryptoglobe.com/latest/2023/06/sec-sued-binance-and-coinbase-heres-how-to-outperform-in-the-red-market-with-atpbot/",
    "description": "Disclaimer: This is a sponsored article and is for informational purposes only, it should not be construed as investment advice. Cryptocurrency investment carries a high level of risk and may not be suitable for all investors. The views expressed in this article do not constitute financial advice and should not be used as the basis […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-19T15:57:22.000Z",
    "title": "Do Kwon Sentenced to Four Months in a Montenegro Jail",
    "url": "https://cryptodaily.co.uk/2023/06/do-kwon-sentenced-to-four-months-in-a-montenegro-jail",
    "description": "<p>Do Kwon has been sentenced to four months in jail by a Montenegro district court for forging travel documents. </p>\n<p>Bloomberg reports that a Montenegrin Basic Court in the country&rsquo;s capital of Podgorica sentenced Do Kwon and his associate Han Chang-Joon to four months in jail for forging travel documents. The infamous co-founder of the collapsed Terraform Labs was arrested in March in Podgorica, where he was found attempting to travel to Dubai with a forged passport.</p>\n<p>Kwon and Joon were found guilty of forgery charges, and two Costa Rican and Belgian passports and two identity cards belonging to Kwon and Joon were confiscated. A Basic Court in Podgorica shared the verdict on Monday and said the pair&rsquo;s time spent in detention would be included in their sentence.</p>\n<p>The duo have been in custody despite being released on bail early in June.</p>\nDo Kwon: An Internationally Wanted Man\n<p>Kwon is a South Korean national who stands accused on charges of multibillion-dollar fraud related to the collapse of the Terra ecosystem in May 2022. Terraform&rsquo;s algorithmic stablecoin and crypto project Terra-Luna collapsed, wiping out $40 billion in market cap and sending the overall crypto market into a spiral.</p>\n<p>Following Terra&rsquo;s collapse, South Korean authorities charged Kwon in September for violating its Capital Markets Act and issued a warrant for his arrest.</p>\n<p>The International Criminal Police Organisation (Interpol) accordingly issued a red notice for Kwon, signalling international law enforcement agencies to track him down and arrest him on charges of fraud.</p>\n<p>US Federal prosecutors further indicted Kwon with two counts each of securities fraud, wire fraud, commodities fraud, and conspiracy.</p>\n<p>Both South Korea and the US are seeking Kwon&rsquo;s extradition.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T16:07:27.000Z",
    "title": "Learn about “ATPBot”, a trading bot dubbed the “ChatGPT of the investing world”",
    "url": "https://www.cryptopolitan.com/learn-about-atpbot-a-trading-bot-dubbed-the-chatgpt-of-the-investing-world/",
    "description": "One of the hot topics this year is ChatGPT, an artificial intelligence technology hailed as a turning point in our lives and work. Keep up with the progress of the world. One of the most noteworthy artificial intelligence innovations this year is the AI-Crypto Trading Bot ATPBot, which has won the reputation of &#8220;ChatGPT in ... <a title=\"Learn about &#8220;ATPBot&#8221;, a trading bot dubbed the &#8220;ChatGPT of the investing world&#8221;\" class=\"read-more\" href=\"https://www.cryptopolitan.com/learn-about-atpbot-a-trading-bot-dubbed-the-chatgpt-of-the-investing-world/\" aria-label=\"More on Learn about &#8220;ATPBot&#8221;, a trading bot dubbed the &#8220;ChatGPT of the investing world&#8221;\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T16:04:40.000Z",
    "title": "China and Malaysia collaborate to integrate AI and blockchain technology to foster cross-border trade",
    "url": "https://www.cryptopolitan.com/china-and-malaysia-collaborate-to-integrate-ai-and-blockchain-technology-cross-border-trade/",
    "description": "Malaysia and China have set the stage for a new era of technological advancement. The two nations are combining forces to pioneer the integration of Artificial Intelligence (AI) and blockchain technology to enhance cross-border trade processes. The alliance, which is part of an ongoing intergovernmental research initiative, symbolizes a significant stride in international cooperation in ... <a title=\"China and Malaysia collaborate to integrate AI and blockchain technology to foster cross-border trade\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-and-malaysia-collaborate-to-integrate-ai-and-blockchain-technology-cross-border-trade/\" aria-label=\"More on China and Malaysia collaborate to integrate AI and blockchain technology to foster cross-border trade\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T16:03:44.000Z",
    "title": "Cardano in the Bear Market: Assessing its Position and Future Amidst Crypto Challenges",
    "url": "https://www.cryptopolitan.com/cardano-in-the-bear-market-assessing-its-position-and-future-amidst-crypto-challenges/",
    "description": "During the bull run of 2021, it felt like the good times would never end. Specific cryptocurrency projects increased by 100x over a few weeks, and American retail traders were pumping their stimulus checks into the digital asset market. Elon Musk led the orchestra before the whole market sleepwalked off a cliff and lost over ... <a title=\"Cardano in the Bear Market: Assessing its Position and Future Amidst Crypto Challenges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-in-the-bear-market-assessing-its-position-and-future-amidst-crypto-challenges/\" aria-label=\"More on Cardano in the Bear Market: Assessing its Position and Future Amidst Crypto Challenges\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T16:01:29.000Z",
    "title": "Craig Wright accuses bitcoin developers of theft and sabotage ",
    "url": "https://crypto.news/craig-wright-accuses-bitcoin-developers-of-theft-and-sabotage/",
    "description": "Craig Wright, widely known as the self-proclaimed originator of bitcoin and occasionally referred to as the \"Counterfeit Satoshi Nakamoto,\" has recently initiated a scathing assault on the foremost architects of the digital currency."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T16:00:00.000Z",
    "title": "Bitcoin price slips after Fed decision, ethereum price at a critical turning point, Tradecurve bullish",
    "url": "https://crypto.news/bitcoin-price-slips-after-fed-decision-ethereum-price-at-a-critical-turning-point-tradecurve-bullish/",
    "description": "Tradecurve presale is ongoing and TCRV prices rose 20% in the past few days while ethereum and bitcoin prices were volatile following the Fed's decision to pause rate hikes"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T15:50:33.000Z",
    "title": "Cyber heists in digital playground, school-age hackers steal millions in NFTs",
    "url": "https://crypto.news/cyber-heists-in-digital-playground-school-age-hackers-steal-millions-in-nfts/",
    "description": "The world of NFTs has fallen prey to an unexpected wave of school-age cyber bandits, orchestrating intricate phishing scams that have netted them millions in stolen assets."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-19T16:00:04.000Z",
    "title": "Stablecoins Supply Finally Shows Rise, Here’s Why This Is Bullish For Bitcoin",
    "url": "https://www.newsbtc.com/stablecoin/stablecoins-market-cap-shows-rise-why-bullish-bitcoin/",
    "description": "On-chain data shows the supply of stablecoins has been going up recently, a sign that could potentially be bullish for Bitcoin. Stablecoins Have Registered An Increase In Their Supply Recently As pointed out by an analyst in a CryptoQuant post, every increase in stablecoins&#8217; supply since late 2022 has been accompanied by a rise in the price of Bitcoin. The metric of interest here is naturally the combined circulating supply of all stablecoins. When the value of this indicator rises, it means that capital is entering into the stables currently as more of their tokens are being minted. On the other hand, a decline implies investors are either redeeming these fiat-tied tokens for currencies like the dollar or shifting them into other cryptocurrencies like Bitcoin. Generally, investors use stables whenever they want to avoid the volatility associated with most of the coins in the sector. Thus, whenever the supply of these tokens is going up, it can also be a sign that investors are possibly retreating from the volatile markets. When such investors eventually feel like the prices are right to jump back into the other assets, they simply exchange their stablecoins for their desired coins. Naturally, this can provide bullish pressure on the price of the cryptocurrency that they are shifting into. Related Reading: Bitcoin Price Steadies Above $26K, Can Bulls Pump It Further? Now, here is a chart that shows the trend in the combined circulating supply of the stablecoins over the past year and a half: The value of the metric seems to have been going up in recent days &#124; Source: CryptoQuant As displayed in the above graph, the combined circulating supply of the stablecoins had started moving on an overall downtrend back when Bitcoin hit the bull market top. This decrease in the supply of these tokens implied the exit of capital from the market, as BTC and other coins also went down in value alongside this downtrend. In late 2022, however, the indicator finally showed a brief deviation from the downward trajectory as its value registered a sharp increase. Interestingly, not too long after this spike appeared, the price of Bitcoin started observing its rally. This increase in the supply of the stablecoins could have been a sign that a capital injection into the market took place, and as these freshly piled up stables were converted to the other coins, the market obtained its fuel for the rally. Related Reading: Bitcoin Retailers Buying The Dip As BTC Soars Above $26,000 In March of this year, when the rally had paused and the Bitcoin price had been going down, the metric had once again spiked, implying that investors may have possibly been withdrawing their BTC into the stables. After the bottom below $20,000, however, the supply of the stablecoins once more dropped, suggesting that holders were potentially exchanging back into Bitcoin. Naturally, the price of the asset observed a bullish boost from this, as the rally kicked back on. From the chart, it&#8217;s visible that the indicator has been rising again recently. Given that all such rises in the metric have been bullish for BTC during recent months, it&#8217;s possible that this fresh influx of capital can provide fuel for the asset this time as well. BTC Price At the time of writing, Bitcoin is trading around $26,400, up 2% in the last week. The value of the asset has gone up over the weekend &#124; Source: BTCUSD on TradingView Featured image from CoinWire Japan on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T16:00:20.000Z",
    "title": "Uwerx (WERX) Outperforms Polkadot (DOT) And Fantom (FTM) As They Battle Being Listed As Securities",
    "url": "https://www.crypto-news-flash.com/uwerx-werx-outperforms-polkadot-dot-and-fantom-ftm-as-they-battle-being-listed-as-securities/?utm_source=rss&utm_medium=rss&utm_campaign=uwerx-werx-outperforms-polkadot-dot-and-fantom-ftm-as-they-battle-being-listed-as-securities",
    "description": "The SEC is not letting Binance and Coinbase rest, as it has filed a lawsuit against them for trading unregistered securities that the regulatory body had listed. Following this, most established cryptos are losing their positions, and new tokens like Uwerx are taking over. Uwerx is entering the freelancing industry with its never-seen-before features and [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-19T15:55:18.000Z",
    "title": "Injective’s Latest Updates",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/injectives-latest-updates/",
    "description": "<p>Injective (INJ) is a decentralized exchange protocol built on Ethereum. Cosmos SDK blockchain that enables users to trade a wide range of assets, including derivatives, futures, and synthetic assets. Let&#8217;s discover Injective&#8217;s Latest Updates and see how much they&#8217;ve improved in the latest months. 1) Tokenomics According to CoinGecko, these are the most important indicators [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/injectives-latest-updates/\">Injective&#8217;s Latest Updates</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-19T15:55:00.000Z",
    "title": "Crypto Analyst: Altcoin Accumulation May Last a Few More Weeks",
    "url": "https://coinedition.com/crypto-analyst-altcoin-accumulation-may-last-a-few-more-weeks/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-3-1.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>A cryptocurrency trader and analyst identified on Twitter as Mags predicted that the altcoin bear market was nearing its end. According to Mags, the altcoin market was still in the accumulation phase, which may last a few more weeks or months. However, he noted that the worst days were already behind. Despite Mags’ bullish sentiment, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-analyst-altcoin-accumulation-may-last-a-few-more-weeks/\">Crypto Analyst: Altcoin Accumulation May Last a Few More Weeks</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]