[
  {
    "source": "Cointelegraph",
    "date": "2023-10-27T20:46:25.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "http://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Sam Bankman-Fried denied defrauding FTX users during his ongoing criminal trial on Oct. 27. Meanwhile, cryptocurrency hardware wallet provider Trezor is investigating a recent phishing campaign and nonfungible token (NFT) firm Yuga Labs has been awarded approximately $1.6 million in damages over a long-running lawsuit against NFT artists Ryder Ripps.</p><h3>SBF denies defrauding investors</h3><p>Sam Bankman-Fried took the stand at his criminal trial on Oct. 27, where he <a href=\"https://cointelegraph.com/news/sam-bankman-fried-denies-defrauding-ftx-users\">denied defrauding FTX users</a> during the collapse of his crypto exchange last year.</p><p>Reports indicate that Bankman-Fried partly blamed former FTX chief technology officer Gary Wang for creating the \"allow negative\" button for sister company Alameda Research.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> The long awaited testifying SBF courtroom sketch.<br><br>I think the artist gave him a pretty fair shake.<br><br>Courtesy of Jane Rosenberg/Reuters. <a href=\"https://t.co/FyXd84Yvp4\">pic.twitter.com/FyXd84Yvp4</a></p>&mdash; Ariel Givner, Esq. (@GivnerAriel) <a href=\"https://twitter.com/GivnerAriel/status/1717677985141084466?ref_src=twsrc%5Etfw\">October 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“At the time, I wasn’t entirely sure what was happened,” Bankman-Fried was quoted as saying about Alameda’s line of credit. “I thought the funds were being held in a bank account, or sent to FTX in stablecoins. If Alameda was keeping it, I figured it would be reflected as a negative number on FTX.”</p><p>During an earlier testimony, Bankman-Fried admitted to knowing \"basically nothing\" about crypto when launching Alameda Research.</p><p>Bankman-Fried's first of two criminal trials entered its <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">14th day</a> on Oct. 27. He faces seven counts of conspiracy and fraud in his current proceedings.</p><h3>Crypto wallet Trezor looks into phishing campaign, exec says</h3><p>Cryptocurrency hardware wallet provider Trezor is investigating a recent phishing campaign, as users have reported receiving phishing emails.</p><p>The anonymous blockchain sleuth ZachXBT took to his Telegram channel on Oct. 26 to alert users to a phishing attack targeting Trezor customers.</p><p>ZachXBT referred to an X (formerly Twitter) post from the account JHDN, which alleged that Trezor may have been breached after receiving phishing emails on the email account used specifically for buying the wallet.</p><p>In a similar manner to some Trezor-related phishing attacks in the past, the phishing email invites users to download the “latest firmware update” to users’ Trezor devices in order to “fix an issue in software.” According to the poster, the malicious email was sent from the email <a href=\"mailto:amministrazione@sideagroup.com\" target=\"_blank\" rel=\"noopener nofollow\">amministrazione@sideagroup.com</a>.</p><p>According to Trezor’s brand ambassador, Josef Tetek, the firm is aware of the ongoing phishing campaign and is actively looking into it.“We continuously report fake websites, contact domain registrars, and educate and warn our customers of known risks,” Tetek said, referring to multiple articles aiming to help users deal with phishing attacks.</p><p>Tetek emphasized that Trezor never asks for users’ recovery seed, PIN or passphrase.</p><h3>Ryder Ripps ordered to pay Yuga Labs $1.6M in copyright lawsuit</h3><p>A United States district court judge has ordered nonfungible token (NFT) artists Ryder Ripps and Jeremy Cahen to pay Bored Ape Yacht Club creator Yuga Labs a total of $1.57 million in disgorgement and damages, along with legal fees, bringing an end to the long-running “copycat” NFT lawsuit.</p><p>The Oct. 25 <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cacd.855658/gov.uscourts.cacd.855658.431.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">order</a> follows an April 21 partial summary judgment granted in favor of Yuga Labs after the firm claimed that Ripps and Cahen, the defendants, violated copyright laws by <a href=\"https://cointelegraph.com/news/ai-has-a-role-to-play-in-detecting-fake-nfts\">making copycat versions</a> of its Bored Ape Yacht Club (BAYC) collectibles.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Yuga Labs wins lawsuit against RR/BAYC and is granted $1,375,362 of <a href=\"https://twitter.com/ryder_ripps?ref_src=twsrc%5Etfw\">@ryder_ripps</a> and <a href=\"https://twitter.com/Pauly0x?ref_src=twsrc%5Etfw\">@Pauly0x</a>&#39;s profits and $200k in damages, conclusion of law documents released yesterday show<br><br>Doesn&#39;t include attorneys&#39; fees, for which will parties will confer at future date. Thoughts?  <a href=\"https://t.co/DZgky4LiiX\">pic.twitter.com/DZgky4LiiX</a></p>&mdash; okHOTSHOT (@NFTherder) <a href=\"https://twitter.com/NFTherder/status/1717654274635612525?ref_src=twsrc%5Etfw\">October 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>District court Judge John Walter awarded Yuga Labs $1.37 million after concluding the NFT firm was entitled to a disgorgement of the defendants’ profits. An additional $200,000 was awarded in statutory damages relating to cybersquatting violations.</p><p>Yuga Labs has also been entitled to recover attorney fees and costs from the NFT artists after the judge determined the trademark infringement constituted an “exceptional case.”</p><h3>SBF reportedly believed his dealings with Alameda were legal</h3><p>Former FTX CEO Sam Bankman-Fried didn't think there was anything wrong with <a href=\"https://cointelegraph.com/news/sam-bankman-fried-testifies-without-jury\">taking FTX deposits through Alameda Research</a>, according to reports from his ongoing trial in New York.</p><p>Bankman-Fried took the stand on Oct. 26, where he was questioned about his use of the Signal messaging app and other matters related to his failed crypto empire.</p><p>\"Did you believe taking FTX deposits through Alameda was legal?” defense attorney Mark Cohen asked. \"I did,\" Bankman-Fried said. “I was CEO of both at that time.”</p><p>Bankman-Fried is <a href=\"https://cointelegraph.com/news/prosecutors-rest-case-sam-bankman-fried-testify\">the last witness</a> to take the stand in his criminal proceedings. Judge Kaplan said the jury will decide Bankman-Fried's fate \"in the first few days of next week.\"</p><p>The former FTX CEO has pleaded not guilty to all seven charges in his criminal case. However, he's expected to face five more counts in a second trial slated for March 2024. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-27T20:40:59.000Z",
    "title": "Kraken to suspend trading for USDT, DAI, WBTC, WETH, and WAXL in Canada",
    "url": "http://cointelegraph.com/news/kraken-suspend-trading-usdt-dai-wbtc-weth-and-waxl-stablecoin-canada",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/a54935d3-dffa-43a6-895f-ed7072cd9719.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to customer emails, the changes will go into effect starting Nov. 30.</p>\n                    <p><p>Kraken will suspend all transactions related to USDT, DAI, WBTC, WETH, and WAXL in Canada in November and December, according to multiple customer emails shared with Cointelegraph.</p><p>In response to a request for comment from Cointelegraph, a Kraken spokesperson said, via email, “we constantly monitor the assets on our platform to ensure we are meeting the highest compliance standards in the crypto industry,” before confirming the suspensions. </p><p>Per the spokesperson:</p><blockquote>“In accordance with recent Canadian regulatory changes and following extensive consultation with the CSA and OSC, we today notified our clients that we will soon be suspending trading for USDT, DAI, WBTC, WETH, and WAXL.”</blockquote><p>The email further added that Kraken remains “committed to providing our Canadian clients with an exceptional trading experience.”</p><p>The suspensions may not surprise many Canadian cryptocurrency users as it comes on the heels of <a href=\"https://cointelegraph.com/news/breaking-coinbase-to-suspend-usdt-trading-for-canadian-users\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/breaking-coinbase-to-suspend-usdt-trading-for-canadian-users/amp\">several other notable exchanges taking similar actions</a> throughout 2023. In August, Coinbase ceased trading Tether, Dai, and Rai, following a similar move by Crypto.com after it previously delisted Tether. </p><p>The same regulatory challenges faced by those firms may have also led to others withdrawing from the Canadian market entirely. As Cointelegraph reported, <a href=\"https://cointelegraph.com/news/okx-to-cease-operations-in-canada-by-june-22-2023\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/okx-to-cease-operations-in-canada-by-june-22-2023/amp\">OKX ceased operations in Canada</a> in June after <a href=\"https://cointelegraph.com/news/binance-calls-it-quits-in-canada-blames-new-rules\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-calls-it-quits-in-canada-blames-new-rules/amp\">Binance announced their intention to do so in May</a>. </p><p>Kraken, for its part, appears to be continuing operations in Canada and will merely be suspending transactions related to five specific assets. </p><p>According to the email, “as of November 30th” depositis and trading functions will cease for the aforementioned assets. Then, “as of December 4th,” users will no longer be able to perform withdrawals of the associated assets.</p><p>Finally, “as of December 5th,” continues the email, any remaining related assets will be converted to U.S. dollars at the “prevailing market rate” and credited to users’ accounts. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/defi-canada-central-bank-assesses-innovations-challenges\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/defi-canada-central-bank-assesses-innovations-challenges/amp\"><strong><em>Canada central bank assesses innovations and challenges of DeFi</em></strong></a></p><p>In related news, Kraken <a href=\"https://blog.kraken.com/news/bivu-das-joins-kraken-as-uk-managing-director\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> the appointment of a new managing director for U.K. operations on Oct. 27. The new director, Bivu Das, is an entrepreneur and former head of Starling Bank with a long history in fintech and traditional financial services.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-27T21:00:07.000Z",
    "title": "Ethereum’s Dencun Upgrade Faces Setback — Delay Amid Testing Requirements",
    "url": "https://news.bitcoin.com/ethereums-dencun-upgrade-faces-setback-delay-amid-testing-requirements/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/dencun-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ethereum&#039;s Dencun Upgrade Faces Setback Delay Amid Testing Requirements\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/dencun-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dencun-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dencun-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dencun-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dencun-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dencun-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dencun.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The highly anticipated Dencun upgrade for the Ethereum blockchain won&#8217;t be making its debut in 2023 as initially expected. Ethereum&#8217;s core developers have decided to push back the upgrade&#8217;s release until at least 2024, a revelation made during the latest All Core Developers meeting. After the meeting, software developer Tim Beiko took to social media [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-27T21:00:44.000Z",
    "title": "Bitcoin’s Stellar Surge: What’s Next? Expert Deciphers The Crypto Labyrinth",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoins-stellar-surge-whats-next-expert-deciphers-the-crypto-labyrinth/",
    "description": "Gareth Soloway, an analyst and Chief Market Strategist at InTheMoneyStocks.com and President of VerifiedInvesting.com, has recently dived deep into the dynamics and offers a glimpse into Bitcoin and its future. Bitcoin&#8217;s rally, which boasts a 30% uptick in the past fortnight, has reignited the bullish sentiments within the crypto community. This performance has been linked to the anticipation surrounding the potential approval of a spot Bitcoin Exchange-traded fund (ETF). What happens once this approval is granted? Related Reading: Bitcoin Price Rally: Analyst Sets $45,000 Target And It’s Closer Than You Think The Power Of Speculation And Potential Spot Bitcoin ETF Impact Gareth Soloway believes the approval, which might see daylight by the end of this year or early 2024, could trigger a price correction. &#8220;If Bitcoin is still up here, you may not go higher,&#8221; Soloway posits. Soloway argues that the crypto space might already be factoring in the spot Bitcoin ETF approval. This implies that the news, once official, might paradoxically catalyze a sell-off, dampening the current momentum. Soloway&#8217;s projection sees the &#8220;maximum upside&#8221; of Bitcoin in this bull phase reaching around $47,000 – potentially the next resistance level. The expert hints that many institutional ETF players might have pre-emptively accumulated Bitcoin, anticipating an eventual spot ETF approval. This could mean fewer buyers once the spot Bitcoin ETF comes to life. Soloway elucidated: Many of these ETF institutions have probably been accumulating for the last couple of months, knowing that eventually an approval will come. And so, there may not be as many buyers for the spot ETF. A Glimpse Into 2024: Economic Predictions And Crypto While Bitcoin&#8217;s immediate future is in the limelight, Soloway takes a broader macroeconomic stance for the coming year. The analyst paints a cautious picture, predicting an impending economic recession in 2024. This, coupled with a stock market correction of around 35%, might significantly impact Bitcoin.  Soloway noted predicting a possible plunge to $15,000: What happens if the stock market goes down 35%? Fear and panic will take over, even in Bitcoin holders. Remember, there are a lot of people who hold Bitcoin that also have big stock portfolios. And if I&#8217;m down huge at some point, do I start to panic and start selling everything? That&#8217;s the worry that could drive us back to $15,000 or even lower. Backing his bleak economic prediction, Soloway further highlights soaring credit card debts, skyrocketing interest rates, and the &#8220;risky&#8221; state of several banking institutions. The expert stressed the lurking dangers within the banking sector, many of which he called &#8220;zombie banks,&#8221; operating with unsustainable &#8220;dead paper on their balance sheet.&#8221; Related Reading: Bitcoin’s Upcoming Leap? Analyst Predicts A Potential $45,500 Rise By November Despite the grim financial outlook, Soloway shared his bullish sentiment on gold, anticipating new all-time highs. The analyst underscores the importance of aligning with &#8220;smarter money,&#8221; referring to central banks that oversee and implement monetary policies.  Soloway concluded: If they [Central Banks are] loading the boat on gold, then it probably says we need to do the same Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-27T21:04:09.000Z",
    "title": "$37,560,000 To Be Given Away With No Catch in Major US Guaranteed Income Programs",
    "url": "https://dailyhodl.com/2023/10/27/37560000-to-be-given-away-with-no-catch-in-major-us-guaranteed-income-programs/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/dollar-income-guaranteed.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/dollar-income-guaranteed.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/dollar-income-guaranteed.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/dollar-income-guaranteed.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/dollar-income-guaranteed.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/dollar-income-guaranteed.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/dollar-income-guaranteed.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A total of $37.56 million is being given away in a pair of guaranteed income programs in two of the nation&#8217;s major metropolitan areas. A program called Breathe is expanding in Los Angeles, with the initial goal of giving $1,000 to 1,000 people over the course of three years. Now, the program has started giving [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/27/37560000-to-be-given-away-with-no-catch-in-major-us-guaranteed-income-programs/\">$37,560,000 To Be Given Away With No Catch in Major US Guaranteed Income Programs</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]