[
  {
    "source": "Decrypt",
    "date": "2023-07-19T21:56:02.000Z",
    "title": "Orgasm NFTs? NARS Cosmetics Brand Reveals Eyebrow-Raising Art Auctions",
    "url": "https://decrypt.co/149257/orgasm-nfts-nars-cosmetics-brand-reveals-eyebrow-raising-art-auctions",
    "description": "NARS has teamed up with SuperRare and digital artists to drop NFTs for National Orgasm Day, continuing a trend for the beauty brand."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-19T21:55:12.000Z",
    "title": "Societe Generale subsidiary receives France’s first crypto services license",
    "url": "https://cryptoslate.com/societe-generale-subsidiary-receives-frances-first-crypto-services-license/",
    "description": "<p>Société Générale subsidiary Forge has become the first entity to obtain a crypto services license in France, according to a July 19 announcement. The company is the blockchain subsidiary of France&#8217;s third-largest bank, Société Générale. It is currently the only firm to hold France&#8217;s digital asset service provider (DASP) license, which is offered by the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/societe-generale-subsidiary-receives-frances-first-crypto-services-license/\">Societe Generale subsidiary receives France&#8217;s first crypto services license</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-19T22:00:00.000Z",
    "title": "Starknet Introduces Appchains Framework $STRK",
    "url": "https://cryptodaily.co.uk/2023/07/starknet-introduces-appchains-framework-strk",
    "description": "<p class=\"md-end-block md-p\">Starknet, an Ethereum Layer 2, has disclosed the initiation of \"appchains,\" a framework designed to enable developers to construct several application-specific blockchains within the Starknet ecosystem.</p>\n<p class=\"md-end-block md-p\">The innovative project is in alignment with the growing trend of modular networks in the Layer 2 ecosystem, spearheaded by projects like Optimism, Polygon, zkSync, and Arbitrum. </p>\nA New Era For Application-Specific Chains\n<p class=\"md-end-block md-p\">Developers can harness Starknet Stack, the native developer toolkit of Starknet's ecosystem, to create these appchains, using STARK proofs to boost security. Central to this toolkit is Cairo, a programming language developed by the StarkWare team, bearing similarities to Rust.</p>\n<p class=\"md-end-block md-p\">In a recent blog post, Starknet revealed that the use of appchains could offer developers an enhanced performance, a claim further supported by Starknet's recent v0.12.0 upgrade on the mainnet, which reportedly amplified network performance. </p>\nAdvancing Customization For Devs\n<p class=\"md-end-block md-p\">A unique aspect of appchains lies in their capability to support features currently not present on Starknet's main network. This includes features like custom fee market logic and consernsus mechanisms, among others. This flexibility can potentially grant developers the ability to customize their application's configurations and functionalities, thus offering a greater degree of control over their projects.</p>\n\n<p class=\"md-end-block md-p\">\"Starknet Appchains are the bespoke environment where applications can tailor an instance of Starknet to achieve better control over the specs, lower cost, greater scale, and opt-in privacy,\" the firm shared.</p>\n\n<p class=\"md-end-block md-p md-focus\">The team underscored the escalating interest in application-specific blockchains, tailored to meet customized requirements. They stated:</p>\n\n<p class=\"md-end-block md-p\">\"The need for appchains has been apparent for several years and is now getting renewed attention.\"</p>\n\n<p class=\"md-end-block md-p\">Starknet's introduction of appchains represents a significant milestone in the blockchain landscape, enhancing developers' capacity for customization, and making the ecosystem more versatile and adaptable to specific application requirements. Such a move signals a key step towards a more decerntralized, diversified, and performance-oriented blockchain environment.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T22:05:00.000Z",
    "title": "Jack Dorsey’s historic tweet-turned-NFT: What’s the latest?",
    "url": "https://www.cryptopolitan.com/jack-dorsey-historic-tweet-turned-nft-latest/",
    "description": "Just over two years ago, Jack Dorsey, the co-founder and ex-CEO of Twitter, carved a unique niche in the digital world by turning the first-ever Tweet into a non-fungible token (NFT). This significant pivot in the interplay of technology, social media, and digital art made waves in the digital assets market. However, the recent trajectory ... <a title=\"Jack Dorsey&#8217;s historic tweet-turned-NFT: What&#8217;s the latest?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/jack-dorsey-historic-tweet-turned-nft-latest/\" aria-label=\"More on Jack Dorsey&#8217;s historic tweet-turned-NFT: What&#8217;s the latest?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T21:55:09.000Z",
    "title": "Ripple Launches Public Version of Its B2B Liquidity Hub: Why Is This Important?",
    "url": "https://www.cryptopolitan.com/ripple-launches-b2b-liquidity-hub-importance/",
    "description": "Ripple is thrilled to announce the official opening of Ripple Liquidity Hub, signifying a significant milestone for the company. Following a successful pilot last year, the B2B Liquidity Hub is now available to the public, offering businesses a straightforward and seamless solution for managing their modern crypto liquidity requirements. With its emphasis on usability and ... <a title=\"Ripple Launches Public Version of Its B2B Liquidity Hub: Why Is This Important?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-launches-b2b-liquidity-hub-importance/\" aria-label=\"More on Ripple Launches Public Version of Its B2B Liquidity Hub: Why Is This Important?\">Read more</a>"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-19T22:01:23.000Z",
    "title": "Ripple and Crypto Heavyweights Invest in New Artificial Intelligence Metaverse Project",
    "url": "https://dailyhodl.com/2023/07/19/ripple-and-crypto-heavyweights-invest-in-new-artificial-intelligence-metaverse-project/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/ripple-bank-montenegro-new.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/ripple-bank-montenegro-new.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/ripple-bank-montenegro-new.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/ripple-bank-montenegro-new.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/ripple-bank-montenegro-new.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/ripple-bank-montenegro-new.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/ripple-bank-montenegro-new.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ripple Labs and crypto investment firm 10T are investing $54 million into Futureverse, a crypto technology and artificial intelligence (AI) gaming startup. According to a new announcement, Futureverse plans to use the funds for research and development, including advancing its technology called the Root Network. The Root Network is a blockchain and suite of protocols [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/19/ripple-and-crypto-heavyweights-invest-in-new-artificial-intelligence-metaverse-project/\">Ripple and Crypto Heavyweights Invest in New Artificial Intelligence Metaverse Project</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]