[
  {
    "source": "CoinDesk",
    "date": "2023-06-28T18:47:16.000Z",
    "title": "Blockchain May Offer Answers for AI Challenges",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/28/blockchain-may-offer-answers-for-ai-challenges/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Artificial intelligence is already having a big impact on society, but it also has the potential to harm. Blockchain technology may help create safer, more effective AI systems."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-28T18:51:04.000Z",
    "title": "Bitcoin Market Dominance Reaches 58%—Highest Level Since April 2021",
    "url": "https://decrypt.co/146585/bitcoin-market-dominance-58-percent",
    "description": "That means Bitcoin now has a staggering $590 billion market capitalization."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-28T19:00:00.000Z",
    "title": "Germany launches dog-themed NFTs to fetch cyber talent: Nifty Newsletter, June 21–28",
    "url": "https://cointelegraph.com/news/germany-launches-dog-themed-nfts-to-fetch-cyber-talent-nifty-newsletter-june-21-28",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/ef595b7e-fde5-4a44-860b-c129df8a2c3b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The German foreign service created a dog-themed NFT collection in the form of a treasure hunt to recruit and test new cyber talent.</p>\n                    <p><p>In this week’s newsletter, read about the German foreign intelligence agency issuing a dog-themed <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> treasure hunt and check out the new NFT stamp collection from the autonomous territory of the Faroe Islands. Find out about Hermès latest win in its infringement case against MetaBirkins, and don’t forget this week’s Nifty News, featuring the NFT Web3 card game Gods Unchained being added to the Epic Games store, and why the United States Secret Service created an NFT collection.</p><h3>German intelligence service launches dog-themed NFTs to fetch cyber talent</h3><p>The German foreign intelligence agency, the Bundesnachrichtendienst (BND), launched a collection of dog-themed NFTs on June 19. Aside from cartoon depictions of dogs, the collection features an on-chain treasure hunt to recruit cyber talent.</p><p>Dogs of BND NFTs are only collectible by finding a character string posted on the organization’s Instagram that will direct users to a specific Ethereum address. Users would need to use the given information to find the collection and mint the NFT.</p><p><a href=\"https://cointelegraph.com/news/german-intelligence-service-launches-dog-themed-nfts-recruitment-drive\"><strong>Continue reading</strong></a></p><h3>Judge grants Hermès request to halt all ‘MetaBirkin’ NFT sales</h3><p>On June 23, Manhattan-based U.S. Judge Jed Rakoff granted the request of luxury fashion house Hermès to block all sales of the MetaBirkin NFTs, marking another win for the fashion brand in the infringement case.</p><p>Rakoff showed skepticism toward artist Mason Rothschild’s defense against the Hermès’ suit and questioned the artist’s continued marketing of the project. He said that Rothschild’s “entire scheme” was to trick customers into believing Hermès endorsed the project.</p><p><a href=\"https://cointelegraph.com/news/judge-grants-hermes-request-to-halt-all-metabirkin-nft-sales\"><strong>Continue reading</strong></a></p><h3>Faroe Islands postal service issues NFT-embedded stamps</h3><p>The Faroe Islands released its first series of stamps, known as “crypto stamps,” with a digital copy stored on the blockchain as an NFT and still serving as actual postage. </p><p>On June 23, the official website for the local postal service announced the collection called Stamps of Maybe, which was produced in collaboration with the company VariusSystems. The Faroe Islands follow two other European countries, Austria and the Netherlands, in issuing NFT stamps. </p><p><a href=\"https://cointelegraph.com/news/faroe-islands-postal-service-issues-nft-stamps\"><strong>Continue reading</strong></a></p><h3>Yes, the Secret Service has an NFT collection, and no, it’s not for sale</h3><p>Cointelegraph spoke with agents from the Secret Service’s San Francisco field office, known as the Digital Asset Technology Alliance Squad, about their NFT collection sitting on OpenSea. </p><p>The unit specifically deals with crypto-related crime and said the collection was created to better understand how NFTs worked. One of its forensic financial analysts said it also serves as an example of the agency’s interest in the crypto ecosystem. </p><p><a href=\"https://cointelegraph.com/news/secret-service-reveals-more-about-its-nft-collection\"><strong>Continue reading</strong></a></p><h3>Immutable’s Gods Unchained launches on Epic Games Store</h3><p>Gods Unchained, the NFT trading card game from Immutable Games, was listed on the Epic Games Store on June 21. The Web3 trading card game is now accessible to Epic’s 230 million customers.</p><p>Initially, the game was released in June 2019, growing its user base to nearly 80,000 weekly users by January 2022. Each card in the Gods Unchained world is represented by an NFT on the Ethereum layer-2 network, Immutable X. </p><p><a href=\"https://cointelegraph.com/news/immutable-s-gods-unchained-launches-epic-games-store\"><strong>Continue reading</strong></a></p><p><em>Thanks for reading this digest of the week’s most notable developments in the NFT space. Come again next Wednesday for more reports and insights into this actively evolving space.</em></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-01/15eccf0a-448c-48d6-bca3-f981d4c5199d.jpg\"  alt=\"Germany, United States, Europe, Gaming, Games\"  title=\"Germany launches dog-themed NFTs to fetch cyber talent: Nifty Newsletter, June 21&ndash;28 \"  /></figure><p class=\"post-content__accent post-content__accent_big\"><a href=\"https://cointelegraph.com/podcasts/nft-steez\">CHECK OUT COINTELEGRAPH’S <em>NFT STEEZ</em> PODCAST</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-28T18:45:53.000Z",
    "title": "ARK Invest amends Bitcoin spot ETF application in race for SEC approval",
    "url": "https://cryptoslate.com/ark-invest-amends-bitcoin-spot-etf-application-in-race-for-sec-approval/",
    "description": "<p>ARK Invest, led by Cathie Wood, and digital asset manager 21Shares, recently revised their application for a US-based Bitcoin ETF to include a surveillance-sharing agreement in a move that appears to be in reaction to  BlackRock&#8216;s filing two weeks earlier. These surveillance-sharing agreements, planned between the CBOE options exchange and a US-based Bitcoin trading platform, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ark-invest-amends-bitcoin-spot-etf-application-in-race-for-sec-approval/\">ARK Invest amends Bitcoin spot ETF application in race for SEC approval</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T19:00:49.000Z",
    "title": "Radix (XRD) Down By 11% In A Single Day, As Altcoin Market Slows Down",
    "url": "https://www.newsbtc.com/altcoin/radix-down-by-11-in-a-day-as-altcoin-market-slows-down/",
    "description": "With decentralized finance (DeFi) gaining more traction, Radix (XRD) is touted to be one of the pioneers of this technological shift. It is a blockchain platform that enables the development of innovative DeFi applications. XRD, Radix’s native token, is one of the worst performers in the market today, recording an 11% loss in the past 24 hours. However, it is worth noting that the general altcoin market is in red today, as most assets are currently in a slight decline.  Radix Experiences Recorrection Following Recent Price Rally The price performance of Radix has been largely positive in 2023. In April, the XRD token reached its yearly peak &#8211; so far &#8211; at $0.139530. However, the cryptocurrency is currently on a 45% price decline, resulting from its slump in April and May. Related Reading: Bitcoin Miners Send 315% Of Daily Revenue To Exchanges Recording High Interaction That said, the Radix market has been showing signs of recovery in June, gaining over 7% in the last 30 days. On June 15, the XRD price found support at the $0.055136 level before commencing its recent bullish run.  According to data from CoinGecko, the token has surged by more than 33% in the past two weeks. However, the token’s price appears to be experiencing a price recorrection at the moment, losing nearly 11% of its value in the past day. As of this writing, the Radix token is trading at $0.076715, with a 24-hour trading volume of over  $5 million. Additionally, the XRD token boasts a market cap of $775.4 million and ranks as the 53rd largest cryptocurrency in the market. XRDUSD trading at $0.075202 &#124; Source: XRDUSD chart from TradingView Whether XRD will resume its bullish trajectory remains to be seen. According to the price prediction site CoinCodex, Radix is expected to rise by more than 31% and cross the $0.1 price point in the next month. The General Altcoin Market Suffers Slight Decline The Radix token is not the only altcoin experiencing a price dip at the moment. Generally, the altcoin market is currently on a decline, with most tokens registering slight losses in the past 24 hours. BNB, for example, has lost 3.2% of its value in the past day. XRP, ADA, and the popular meme coin DOGE are among the other top 10 cryptocurrencies in the red today. As of this writing, the altcoin market cap stands at around $321 billion, representing a nearly 2% drop in the last day. The altcoin market cap at $322.1 billion &#124; Source: TOTAL3 chart from TradingView A broader look at the market shows that altcoins are 20% below their April high. According to crypto analyst Benjamin Cowen, this demonstrates that altcoins (collectively) offer more risk than reward when compared to Bitcoin. That said, some major tokens, such as Stellar (XLM) and Kaspa (KAS) are doing well in the market today, with gains of 5% and 3.5%, respectively. Related Reading: Cardano Set To Be Delisted On Huobi – Will It Dent ADA Price? Featured image from SoFi, charts from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T19:06:35.000Z",
    "title": "Unlocking Transparency: Chainlink’s Proof of Reserve (PoR) Revolutionizes Tokenized Indexes And Conquers $5T Market",
    "url": "https://www.crypto-news-flash.com/unlocking-transparency-chainlinks-proof-of-reserve-por-revolutionizes-tokenized-indexes-and-conquers-5t-market/?utm_source=rss&utm_medium=rss&utm_campaign=unlocking-transparency-chainlinks-proof-of-reserve-por-revolutionizes-tokenized-indexes-and-conquers-5t-market",
    "description": "Chainlink plays a crucial role in asset tokenization. More opportunities have been identified in this niche to drive real world use cases in the long term. Decentralized oracle service provider Chainlink is boosting tokenization which is the process of transforming physical or digital assets into digital tokens on a blockchain. By providing reliable and secure [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T19:00:49.000Z",
    "title": "How to Find the Best Meme Coin ICOs: A Look at Hollywood X PEPE",
    "url": "https://www.crypto-news-flash.com/how-to-find-the-best-meme-coin-icos-a-look-at-hollywood-x-pepe-2/?utm_source=rss&utm_medium=rss&utm_campaign=how-to-find-the-best-meme-coin-icos-a-look-at-hollywood-x-pepe-2",
    "description": "Finding the best Initial Coin Offerings (ICOs) can be a daunting task. With the influx of new projects daily, it&#8217;s often challenging to identify which ones have the potential for substantial gains. But fear not, fellow crypto enthusiasts. In this blog post, we&#8217;re going to explore how to spot potential gems in the vast ocean [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T19:00:31.000Z",
    "title": "Binance Unveils Exciting New Functions for Bitcoin, Ethereum, XRP, SHIB, and DOGE Auto-Invest, Empowering Crypto Investors",
    "url": "https://www.crypto-news-flash.com/binance-unveils-exciting-new-functions-for-bitcoin-ethereum-xrp-shib-and-doge-auto-invest-empowering-crypto-investors/?utm_source=rss&utm_medium=rss&utm_campaign=binance-unveils-exciting-new-functions-for-bitcoin-ethereum-xrp-shib-and-doge-auto-invest-empowering-crypto-investors",
    "description": "In a recent announcement, Binance revealed that Binance Auto-Invest has enabled an API functionality.  Binance Auto-Invest celebrates a new milestone with a promising offer for Institutional clients and industry partners.  Binance announces that Binance Auto-Invest has now enabled API functionality. The announcement was made recently on the official Binance website. Detailing the updates that come [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T19:00:07.000Z",
    "title": "How to Find the Best Meme Coin ICOs: A Look at Hollywood X PEPE",
    "url": "https://www.crypto-news-flash.com/how-to-find-the-best-meme-coin-icos-a-look-at-hollywood-x-pepe/?utm_source=rss&utm_medium=rss&utm_campaign=how-to-find-the-best-meme-coin-icos-a-look-at-hollywood-x-pepe",
    "description": "Finding the best Initial Coin Offerings (ICOs) can be a daunting task. With the influx of new projects daily, it&#8217;s often challenging to identify which ones have the potential for substantial gains. But fear not, fellow crypto enthusiasts. In this blog post, we&#8217;re going to explore how to spot potential gems in the vast ocean [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-28T18:45:39.000Z",
    "title": "Bankrupt Crypto Exchange FTX Recovers $7,000,000,000 in Liquid Assets With More To Come",
    "url": "https://dailyhodl.com/2023/06/28/bankrupt-crypto-exchange-ftx-recovers-7000000000-in-liquid-assets-with-more-to-come/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/exchange-ftx-liquid-assets.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/exchange-ftx-liquid-assets.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/exchange-ftx-liquid-assets.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/exchange-ftx-liquid-assets.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/exchange-ftx-liquid-assets.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/exchange-ftx-liquid-assets.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/exchange-ftx-liquid-assets.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A new report is revealing that beleaguered crypto trading platform FTX has so far recovered billions of dollars in assets. The report says that the bankrupt crypto exchange has recovered $7 billion and expects to claw back even more. According to the new report, the global FTX platform owes its clients about $8.7 billion. “Based [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/28/bankrupt-crypto-exchange-ftx-recovers-7000000000-in-liquid-assets-with-more-to-come/\">Bankrupt Crypto Exchange FTX Recovers $7,000,000,000 in Liquid Assets With More To Come</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-28T18:41:52.000Z",
    "title": "Digital Euro System Now Underway in Europe, EU Commission Says It ‘Won’t Replace Cash’",
    "url": "https://dailyhodl.com/2023/06/28/digital-euro-system-now-underway-in-europe-eu-commission-says-it-wont-replace-cash/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Euro-Pegged-Stablecoin-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Euro-Pegged-Stablecoin-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Euro-Pegged-Stablecoin-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Euro-Pegged-Stablecoin-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Euro-Pegged-Stablecoin-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Euro-Pegged-Stablecoin-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Euro-Pegged-Stablecoin-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The European Commission has proposed a legislative plan for the launch of a new digital euro payments system, one that it says will not replace the use of physical cash. In a new announcement, the Commission says that it acknowledges that the use of physical cash is still preferred by the majority of Europeans, but [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/28/digital-euro-system-now-underway-in-europe-eu-commission-says-it-wont-replace-cash/\">Digital Euro System Now Underway in Europe, EU Commission Says It ‘Won’t Replace Cash’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]