[
  {
    "source": "Decrypt",
    "date": "2023-12-07T02:01:46.000Z",
    "title": "Rising Bitcoin Fees Prompt Renewed Battle Over Ordinals, BRC-20 Tokens",
    "url": "https://decrypt.co/208945/rising-bitcoin-fees-prompt-renewed-battle-over-ordinals-brc-20-tokens",
    "description": "While some call for purging the NFT-like inscriptions, others say they are good for the network."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-07T02:00:10.000Z",
    "title": "Solana Dominates Ethereum In Daily Active Wallets, SOL Back To $140?",
    "url": "https://www.newsbtc.com/news/solana/solana-dominates-ethereum-in-daily-active-wallets-sol-back-to-140/",
    "description": "Solana (SOL), the fourth-generation blockchain, has staged a remarkable comeback, looking at on-chain metrics. Citing Artemis data, Step Data Insights on X noted that Solana&#8217;s daily active wallets flipped Ethereum&#8217;s, the pioneer smart contract platform. This development is when SOL prices have been ripping past resistance levels in the past few months. Solana&#8217;s Resurgence Continues, Daily Active Wallets Flips Ethereum According to Step Data Insights, Solana&#8217;s daily active wallets currently hover at around 400,000, slightly edging past Ethereum&#8217;s. This spike in activity suggests that Solana is attracting a growing user base, and more people are keen to explore its ecosystems, comprising DeFi, NFTs, and other protocols.  Additional data from Artemis shows that Solana also eclipses Ethereum in the number of daily transactions. Although Ethereum leads in DeFi total value locked (TVL), Solana&#8217;s low fee and scalable environment could explain why users opt for this high-performance network. Related Reading: Tether (USDT) Cap Approaches $90 Billion: Why This Affects Bitcoin Overall, the Solana recovery could triggered by recent favorable price action in Q4 2023. To quantify, Step Data Insights notes that SOL has risen by over 210% in the past three months. During this time, ETH&#8217;s gains have capped.  The analytic platform states that the coin only rose by 39%. To illustrate, in the last three months, SOL rose from around $17 to peak at approximately $70. Meanwhile, ETH expanded from roughly $1,500 to peak at about $2,300, recorded on December 6. This recovery points to increasing investor confidence. However, time will tell whether SOL will extend gains in the sessions. From the daily chart, prices have been moving horizontally for the better part of H2 November to early December 2023.  The immediate resistance line is at $70. With the SOL moving inside a bull flag, any upswing above November 2023 highs will be the building block for a possible leg-up that will lift SOL to April 2022 highs of $140. Spot Bitcoin ETF Hopes, Firedancer Lifting Solana Altcoins, including Solana, have been racing higher as the crypto market recovers. Following a court ruling, SOL is relatively firm despite the FTX estate being permitted to liquidate the coin in the secondary markets to repay creditors.  Related Reading: Solana-Powered Helium (HNT) Spikes By 145%, Analyzing The Drivers Of The Surge Hopes of the Securities and Exchange Commission (SEC) approving the first Bitcoin ETF have also benefited Solana. However, the recent release of Firedancer, a validator client developed by Jump Crypto, on testnet has supported SOL.  The client will make the network more resilient and performant. Firedancer will go live in the H1 2024. Once it goes live, the new client is expected to improve Solana&#8217;s reliability.  Feature image from Canva, chart from TradingView"
  }
]