[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-20T03:30:47.000Z",
    "title": "TUSD Supply Skyrockets With 1 Billion Injection Amidst Decline in Stablecoins",
    "url": "https://news.bitcoin.com/tusd-supply-skyrockets-with-1-billion-injection-amidst-decline-in-stablecoins/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/jo90-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"TUSD Supply Skyrockets With 1 Billion Injection Amidst Decline in Stablecoins\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/jo90-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jo90-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jo90-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jo90-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jo90-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jo90-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jo90.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Despite the decline in stablecoins due to substantial redemptions, particularly from projects like USDC, DAI, and BUSD, the project TUSD has experienced a notable surge in its supply. TUSD has added more than a billion dollars&#8217; worth of tokens to its existing supply. As of the present moment, the market capitalization of TUSD stands at [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-20T03:31:20.000Z",
    "title": "Ethereum Price Indicators Suggest Strengthening Case For More Upsides",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-more-upsides-1750/",
    "description": "Ethereum price is showing positive signs above $1,700 against the US Dollar. ETH could gain bullish momentum if it clears the $1,750 resistance zone. Ethereum is slowly moving higher above the $1,700 and $1,720 resistance levels. The price is trading above $1,720 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support near $1,718 on the hourly chart of ETH/USD (data feed via Kraken). The pair could rise further above the $1,750 and $1,765 resistance levels. Ethereum Price Steadies Above $1,700 Ethereum’s price started a steady recovery wave above the $1,650 level. ETH was able to settle above the $1,700 resistance zone, similar to Bitcoin. Recently, the price saw a minor downside correction from the $1,768 high. The price traded below the $1,720 level but the bulls were active near $1,700. A low is formed near $1,698 and the price is again attempting a fresh increase. There was a break above the $1,720 resistance. The price climbed above the 50% Fib retracement level of the downward move from the $1,768 swing high to the $1,698 low. Ether is now trading above $1,720 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support near $1,718 on the hourly chart of ETH/USD. Immediate resistance is near the $1,750 level. The next major resistance is near the $1,765 level. Source: ETHUSD on TradingView.com A successful move above the $1,750 and $1,765 resistance levels might start a steady recovery wave. The next resistance sits near $1,800, above which Ethereum could rise toward the $1,850 level. Any more gains above the $1,850 resistance zone might send the price toward the $1,920 resistance. Ae Dips Supported in ETH? If Ethereum fails to clear the $1,750 resistance, it could start another decline. Initial support on the downside is near the $1,720 level and the trend line. The next major support is near the $1,700 level or the recent low. If there is a break and close below the $1,700 support, the price could drop toward the $1,675 support. Any more losses may perhaps send the price toward the $1,620 zone. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,700 Major Resistance Level – $1,765"
  }
]