[
  {
    "source": "Decrypt",
    "date": "2023-07-25T11:23:38.000Z",
    "title": "Binance Files Intent to Dismiss CFTC Complaint",
    "url": "https://decrypt.co/149939/binance-files-intent-to-dismiss-cftc-complaint",
    "description": "Binance, along with its CEO Changpeng Zhao, intends to request that the CFTC's latest complaint against the crypto exchange be dismissed."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T11:21:01.000Z",
    "title": "Former CFTC chairman says stablecoins can be a bridge between two worlds",
    "url": "https://cointelegraph.com/news/former-cftc-chairman-says-stablecoins-can-be-a-bridge-between-two-worlds",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/94036b3a-8902-4e05-baa5-082e6a336e63.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Timothy Massad, the former CFTC chairman, highlighted the benefits of stablecoins and urged regulators not to discredit their utility when it comes to regulations.   </p>\n                    <p><p>The previous chairman of the United States Commodity Futures Trading Commission (CFTC), Timothy Massad, highlighted the importance of government attention being paid to the stablecoin ecosystem in an interview with CNBC. </p><p>On July 24, Massad told the CNBC interviewer that he sees stablecoins as a bridge between “the crypto world and the real world” and that governments should not view them as a fad fated to disappear. </p><p>The ex-chairman said he is “concerned” that the risks of stablecoins are not being properly addressed by regulators, rather they are kept out of the conversation due to the thought that they don’t actually work. </p><p>“I’m sympathetic to a lot of people in the government saying ... we’re not convinced of the use case here, we don’t really see what the value is in the real world,\" he said. \"But sometimes it takes time to really discover that.”</p><p>Massad has been an<a href=\"https://cointelegraph.com/news/ripple-court-ruling-regulation-more-compelling-more-urgent-former-cftc-chair\"> outspoken advocate for crypto regulation</a> and more cohesive collaboration between the CFTC and the Securities and Exchange Commission (SEC) when it comes to digital assets. </p><p>On July 24, the United States Government Accountability Office (GAO), a national Congressional watchdog agency, released a report on the use of blockchain in finance in which<a href=\"https://cointelegraph.com/news/us-gao-lack-interagency-cooperation-needs-to-be-addressed-crypto-regulation\"> it echoed the sentiment</a> for interagency cooperation on crypto regulations. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/cds-vs-stablecoins-korean-banks-to-research-the-stablecoins-alternative\"><strong><em>Korean banks research stablecoin, CBDC alternative</em></strong></a></p><p>In the same CNBC interview, he highlighted that stablecoins could hold the potential to create faster payment mechanisms in the U.S. and that if the U.S. were to create a stablecoin it could lead other countries to do the same. </p><blockquote>“I think the competition from stablecoins could be useful, again, if we address the risks, and they are significant.”</blockquote><p>In addition to faster payment systems, he argued that stablecoins are already causing banks to consider their current operating systems and how they can be improved. </p><p>Massad has also been one to judge the U.S. in the past for not jumping on <a href=\"https://cointelegraph.com/news/us-is-not-moving-fast-enough-to-develop-a-cbdc-says-former-cftc-chair\">the creation of a central bank digital currency (CBDC)</a> fast enough. </p><p>These comments come as regulators in the U.S. continue to mull over regulations for the crypto industry, which include <a href=\"https://cointelegraph.com/news/crypto-bills-could-change-us-landscape-explained\">multiple bills that would affect stablecoin issuance</a> and usage. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/wolf-of-all-streets-world-bitcoin-hits-1m-1-million-hall-of-flame/\"><strong><em>Wolf Of All Streets worries about a world where Bitcoin hits $1M: Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T11:19:22.000Z",
    "title": "Worldcoin may face UK data regulators inquiry days after launch: Report",
    "url": "https://cointelegraph.com/news/worldcoin-may-face-uk-data-regulators-enquiry-days-after-launch-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/495c5cb0-102f-4a24-b914-0413d00145a0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The project has faced criticism from within the fintech world over its dystopian features and privacy concerns.</p>\n                    <p><p>The newly launched controversial crypto and ID project Worldcoin could face inquiries from data regulators in the United Kingdom as it raises concerns over privacy and critical biometric data safety, according to a Reuters report.</p><p>The Information Commissioner’s Office (ICO) — the U.K.’s data regulatory body — acknowledged the launch of the crypto project in the country, and said it would examine the project and make further inquiries concerning data laws, <a href=\"https://www.reuters.com/technology/uk-data-watchdog-make-enquiries-worldcoin-crypto-project-2023-07-25/?rpc=401&amp;\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> Reuters. </p><p>When Cointelegraph reached out to the ICO to ask about their reported probe into Worldcoin, the independent regulatory body declined to comment. A spokesperson for the regulator said they “have not announced anything publicly to confirm or deny if we are looking into Worldcoin. Until then I would not be able to pass comments.”</p><p>The digital identification-centred crypto project launched on July 24 and was co-founded by OpenAI's CEO Sam Altman. The project <a href=\"https://cointelegraph.com/news/sam-altman-worldcoin-secures-115-million-decentralized-id\">secured $115 million in funding in May </a>earlier this year with funding from A16z Crypto, Bain Capital Crypto, and Distributed Global. Worldcoin <a href=\"https://cointelegraph.com/news/sam-altman-worldcoin-world-id-two-million-sign-ups\">onboarded over 2 million users during its beta phase</a> despite many sharing concerns over the nature of the project.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/openai-ceo-sam-altman-testifies-in-historic-senate-hearing-on-ai-safety\"><strong><em>OpenAI CEO Sam Altman testifies in ‘historic’ Senate hearing on AI safety</em></strong></a></p><p>While those numbers might look impressive, a study by MIT Technology <a href=\"https://www.technologyreview.com/2022/04/06/1048981/worldcoin-cryptocurrency-biometrics-web3/\" target=\"_blank\" rel=\"noopener nofollow\">claimed </a>that the majority of the first one million users were onboarded using \"deception, cash handouts and exploiting workers\" in developing countries. Several aspects of the project have not gone down well with the crypto community, from concerns over the security of users’ biometric data to privacy concerns.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">A global database of human IDs issued after an eye scan, paid for with useless Worldcoin token, connected with all financial transaction data of each individual  managed by a centralized non-profit collecting sensitive data for KYC/AML.<br><br>WHAT COULD GO WRONG? <a href=\"https://t.co/8K6R17vBb0\">https://t.co/8K6R17vBb0</a></p>&mdash; Anita ⚡️‍ Bitcoin for Fairness (@AnitaPosch) <a href=\"https://twitter.com/AnitaPosch/status/1683404618070466560?ref_src=twsrc%5Etfw\">July 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Apart from an enquiry in the UK, the native token WLD is not going to launch in the United States and none of the native crypto exchanges such as Coinbase or Kraken have listed it. The project developers cited regulatory concerns in the U.S., as the key reason behind the decision. However, many crypto proponents believe it qualifies as unregistered securities.</p><p><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/worldcoin-token-launch-sparks-response-from-vitalik-buterin&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\"><strong>Collect this article as an NFT</strong></a> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></p><p><em><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/tokenizing-music-royalties-nfts-taylor-swift-3lau-nas-the-weeknd/\">Tokenizing music royalties as NFTs could help the next Taylor Swift</a></strong></em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-25T11:22:56.000Z",
    "title": "Solana-Based ATMTA’s Star Atlas Announces Restructuring and Staff Cut",
    "url": "https://cryptobriefing.com/atmtas-star-atlas-announces-restructuring/?utm_source=feed&utm_medium=rss",
    "description": "ATMTA, a Solana-based Web3 gaming company that runs the popular Star Atlas game, has revealed a major restructuring of its operations in response to challenging market conditions. The companys CEO..."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-25T11:30:23.000Z",
    "title": "Latam Insights — Argentina Reaches IMF Agreement, Bitfarms to Open New Mining Operations in Paraguay",
    "url": "https://news.bitcoin.com/latam-insights-argentina-reaches-imf-agreement-bitfarms-to-open-new-mining-operations-in-paraguay/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1827932012-1-1-1.webp\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Latam Insights — Argentina Rebalances IMF Agreement, Bitfarms To Open New Mining Operations in Paraguay\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" />Welcome to Latam Insights, a compendium of Latin America&#8217;s most relevant crypto and economic news during the last week. In this issue, Argentina reached a new agreement with the International Monetary Fund (IMF), Bitfarms will open two bitcoin mining farms in Paraguay, and Venezuela is now accepting MIR card payments. Argentina Reaches New Disbursement Agreement [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T11:22:06.000Z",
    "title": "Google’s Bard Predicts Bitcoin’s Price After 2024 Halving",
    "url": "https://www.cryptopolitan.com/googles-bard-predicts-bitcoins-price/",
    "description": "The recent launch of OpenAI&#8217;s text-based AI tool, ChatGPT, sparked renewed interest in generative AI bots, with Google&#8217;s Bard leading the way. Bard has already proven its worth in cryptocurrency market analysis, particularly in Bitcoin (BTC). With Bitcoin&#8217;s price currently stagnant after losing the $30,000 level, Bard was sought out by Finbold to provide insights ... <a title=\"Google&#8217;s Bard Predicts Bitcoin&#8217;s Price After 2024 Halving\" class=\"read-more\" href=\"https://www.cryptopolitan.com/googles-bard-predicts-bitcoins-price/\" aria-label=\"More on Google&#8217;s Bard Predicts Bitcoin&#8217;s Price After 2024 Halving\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T11:34:53.000Z",
    "title": "Cardano TVL – A Crucial Factor For ADA Price Revival?",
    "url": "https://www.newsbtc.com/news/cardano-tvl-a-crucial-factor-for-ada-price-revival/",
    "description": "Cardano has leaped considerably in the realm of DeFi activities, particularly in terms of Total Value Locked (TVL), despite the somewhat lackluster performance of ADA itself.  TVL refers to the total value of assets locked within various decentralized finance protocols and applications on the Cardano blockchain. An increasing TVL can have several positive implications for the Cardano ecosystem. The significance of TVL lies in its reflection of the overall engagement and adoption of DeFi projects built on Cardano. A higher TVL indicates greater trust and confidence in these decentralized financial services. It demonstrates that users are willing to lock their assets within the ecosystem, utilizing various DeFi protocols for lending, borrowing, staking, and other financial activities. Cardano TVL Surges Amid Price Decline ADA has experienced a recent decline in its price, with the latest data from Coingecko showing it currently stands at $0.305. Over the past 24 hours, the price has faced a modest 0.4% decline, and over the last seven days, it has decreased by a mere 0.3%. Despite these losses, there is a notable silver lining in the form of Cardano&#8217;s TVL on the network. Source: Coingecko The surge in Cardano&#8217;s TVL by 28% in the last three months indicates a growing interest in the DeFi activities offered by the network. It reflects growing confidence among users willing to lock their assets in decentralized applications, such as lending platforms, decentralized exchanges, and liquidity pools. Related Reading: XRP Position In The Crypto Top 4 Ranking: Can It Endure? This increased participation can foster the development of a vibrant and robust DeFi ecosystem on Cardano, offering users a wide range of financial services. Cardano total value locked. Source: DefiLlama Moreover, the year-to-date (YTD) triple growth of Cardano&#8217;s TVL raises optimism for the project&#8217;s potential recovery and a potential return to its previous all-time high levels achieved in 2022. Related Reading: XDC Continues To Shoot Up With 74% Gain – What’s Powering This Token? As the DeFi ecosystem on Cardano expands, it can attract more developers, projects, and investors, further enhancing the network&#8217;s utility and value proposition. Cardano (ADA) market cap currently at $10 billion. Chart: TradingView.com Cardano DeFi Lockup Surpasses Ethereum, But Market Cap Lags Behind Meanwhile, a recent report sheds light on a noteworthy plunge in the total tokens locked within Ethereum, Cardano&#8217;s main rival. On the other hand, Cardano has emerged as a strong contender, outperforming Ethereum regarding individual token lockup within its DeFi ecosystem. While Cardano excels in terms of token lockup, it still needs to catch up in other critical areas compared to Ethereum. One of the most significant disparities lies in the market capitalization of the two cryptocurrencies. Ethereum&#8217;s market capitalization remains considerably higher than Cardano&#8217;s, highlighting Ethereum&#8217;s long-standing dominance in the blockchain space. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Blog Tiền Ảo"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T11:11:48.000Z",
    "title": "Monero and Enjin Coin Holders Fearing The Worst, While Early Tradecurve Holders Are Up 150%",
    "url": "https://www.crypto-news-flash.com/monero-and-enjin-coin-holders-fearing-the-worst-while-early-tradecurve-holders-are-up-150/?utm_source=rss&utm_medium=rss&utm_campaign=monero-and-enjin-coin-holders-fearing-the-worst-while-early-tradecurve-holders-are-up-150",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T101242.407.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T101242.407.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T101242.407-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T101242.407-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency industry is undergoing a volatile phase, with many long-standing projects falling to the ground. Monero (XMR) and Enjin Coin (ENJ) are two such cryptocurrencies that have suffered a severe fall in recent weeks. On the contrary, Tradecurve (TCRV), a new token, has registered massive presale success. Thus, their investors are fearful, and wondering [...]"
  }
]