[
  {
    "source": "CryptoSlate",
    "date": "2023-07-07T10:45:52.000Z",
    "title": "Kraken’s Jesse Powell under federal investigation but exchange remains uninvolved",
    "url": "https://cryptoslate.com/krakens-jesse-powell-under-federal-investigation-but-exchange-remains-uninvolved/",
    "description": "<p>Crypto exchange Kraken told CryptoSlate it is not part of the current federal investigations into its co-founder Jesse Powell, according to a July 7 press statement. Powell is the subject of Federal Investigations. Powell is currently involved in a civil dispute with the Verge Center for the Arts, a non-profit art gallery. This news was [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/krakens-jesse-powell-under-federal-investigation-but-exchange-remains-uninvolved/\">Kraken&#8217;s Jesse Powell under federal investigation but exchange remains uninvolved</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-07T10:44:24.000Z",
    "title": "Another Binance Exec Resigns Amid US Legal Scrutiny",
    "url": "https://cryptobriefing.com/another-binance-exec-resigns/?utm_source=feed&utm_medium=rss",
    "description": "Patrick Hillmann, Binance&#8217;s chief strategy officer, confirmed via a tweet that he is leaving the cryptocurrency exchange, parting ways amicably after a two-year tenure. His announcement joins the recent exits..."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-07T10:42:49.000Z",
    "title": "American Lawyer: Investors Suing Ripple Better Pray for the SEC to Lose Its Case Against Ripple",
    "url": "https://www.cryptoglobe.com/latest/2023/07/american-lawyer-investors-suing-ripple-better-pray-for-the-sec-to-lose-its-case-against-ripple/",
    "description": "It’s no secret that Ripple Labs Inc., the company behind the prominent cryptocurrency XRP, is caught up in two legal maelstroms that could define its future. The first case involves the United States Securities and Exchange Commission (SEC), which accuses Ripple of an unlawful sale of XRP tokens, perceived as unregistered securities. The second is […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-07T11:00:27.000Z",
    "title": "BRICS nations summit in August will turn monetary system upside down",
    "url": "https://cryptodaily.co.uk/2023/07/brics-nations-summit-in-august-will-turn-monetary-system-upside-down",
    "description": "<p>At the BRICS summit on August 22, a new currency is to be announced which will be pegged to commodities, and gold in particular.</p>\n<p>Central banks around the world bought almost 230 tons of gold in the first three months of this year, which is the most buying of gold in a single quarter that has ever been seen.</p>\nPrecious metals price suppression\n<p>That the price of gold is still depressed perhaps bears testament to how the price of precious metals is being suppressed by the big commercial banks on the London Bullion Metals Exchange (LBMA) and the Commodities Exchange (COMEX).</p>\n<p>However, as the alleged price suppression continues, large entities are able to buy gold and silver at rock-bottom prices in preparation for a world where tangible resources are much more likely to be valued than fiat currencies printed out of thin air.</p>\n<p>The recent dumping of the gold and silver prices after huge shorting took place might be one of the western commercial banks&rsquo; last ditch attempts to keep both gold and silver from rocketing higher, which would have the potential to tear the heart out of the dollar.</p>\nThe BRICS nations\n<p>The BRICS nations is the term for the original five countries that compose this trading block: China, Russia, India, Brazil, and South Africa. Saudi Arabia is among one of 25 other countries that are formally applying for membership of BRICS.</p>\n<p>The BRICS nations hold and produce a significant share of the world&rsquo;s resources. China and Russia are the 6th and 7th biggest gold producers in the world, and Saudi Arabia and Russia are 2 of the 3 largest energy producers.</p>\n<p>With China, India, Brazil, and Russia, BRICS has 4 of the 7 largest countries in the world measured by land mass, and also 4 of the 9 largest populations.</p>\n<p>If 50% of the world&rsquo;s wheat production is also put into the mix it can be seen that the BRICS nations have a massive amount of power and should they put up a rival reserve currency to the dollar they will need to be taken extremely seriously.</p>\nCreation of a new bond market\n<p>Some analysts and detractors might say that a BRICS reserve currency cannot really get off the ground without a deep and liquid bond market to underpin it. Be that as it may, renowned economist Jim Rickards has posited that this could be done if BRICS+ created a bond market in around 20 countries at the same time.</p>\n<p>With the massive population that the BRICS have, retail investors could be encouraged to buy the bonds, much like what happened with the Liberty Bonds, which were used in the US for the financing of the war in 1917.</p>\n<p>If all this should come to pass then the financial upheaval and turmoil in the West, where currency is based on nothing, has the potential to completely change the world order. There is not much time left for retail investors to protect themselves with gold, silver, and bitcoin.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T10:47:27.000Z",
    "title": "SEC investigation stalls BarnBridge DAO, BOND token plummets",
    "url": "https://www.cryptopolitan.com/sec-investigation-stalls-barnbridge-dao-bond-token-plummets/",
    "description": "BarnBridge DAO, a risk management entity within the decentralized finance (DeFi) space, is under investigation by the U.S. Securities and Exchange Commission (SEC). The news broke out through Douglas Park, the legal representative of BarnBridge, who urged the cessation of all activities linked to the organization on their Discord channel last week. Park, a lawyer ... <a title=\"SEC investigation stalls BarnBridge DAO, BOND token plummets\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-investigation-stalls-barnbridge-dao-bond-token-plummets/\" aria-label=\"More on SEC investigation stalls BarnBridge DAO, BOND token plummets\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-07T11:02:48.000Z",
    "title": "Former FTX boss reportedly rejected partnership with Taylor Swift",
    "url": "https://crypto.news/former-ftx-boss-reportedly-rejected-partnership-with-taylor-swift/",
    "description": "Unnamed sources now claim Taylor Swift, a well-known singer, was inclined to strike a deal with FTX, a now-defunct cryptocurrency exchange"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-07T10:46:16.000Z",
    "title": "Kraken co-founder’s home searched by FBI in March",
    "url": "https://crypto.news/kraken-co-founders-home-searched-by-fbi-in-march/",
    "description": "Jesse Powell, founder and former CEO of crypto exchange Kraken, had his residence searched by the FBI earlier this year"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-07T11:00:58.000Z",
    "title": "Polygon Crypto (MATIC) is down 31% in 30 Days, and Anarchy (ANA) Continues to Set The Presale World ablaze.",
    "url": "https://www.crypto-news-flash.com/polygon-crypto-matic-is-down-31-in-30-days-and-anarchy-ana-continues-to-set-the-presale-world-ablaze/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-crypto-matic-is-down-31-in-30-days-and-anarchy-ana-continues-to-set-the-presale-world-ablaze",
    "description": "<img width=\"512\" height=\"326\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T124050.371-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T124050.371-1.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T124050.371-1-300x191.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T124050.371-1-312x198.png 312w\" sizes=\"(max-width: 512px) 100vw, 512px\" />A crypto investor&#8217;s worst fear is watching their holdings disappear right before their eyes. That’s the reality for Polygon (MATIC) holders right now as the coin continues to bleed, going down by 31% in just under a month. MATIC’s price had been hovering at a low altitude for some time, but its descent seems about [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-07T10:43:53.000Z",
    "title": "XRP Attorney Spots the Adverse Effects of Ripple Losing to the SEC",
    "url": "https://coinedition.com/xrp-attorney-spots-the-adverse-effects-of-ripple-losing-to-the-sec/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/XRPCommunity_SECGov_v_Ripple_XRP_William_Michael_Cunningham-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>John E Deaton, the prominent XRP attorney, recently predicted the adverse effects of the prolonged SEC-Ripple lawsuit, alluding to the consequences of the beleaguered crypto firm Ripple losing to the Securities and Exchange Commission (SEC). The lawyer asserted that an unfavorable result for Ripple would be detrimental to the XRP community as the case would [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-attorney-spots-the-adverse-effects-of-ripple-losing-to-the-sec/\">XRP Attorney Spots the Adverse Effects of Ripple Losing to the SEC</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]