[
  {
    "source": "CoinDesk",
    "date": "2023-08-18T09:51:33.000Z",
    "title": "Single Trader Lost $55M on Ether Long Yesterday",
    "url": "https://www.coindesk.com/markets/2023/08/18/single-trader-lost-55m-on-ether-long-yesterday/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "That was nearly 30% of all liquidated futures on Binance, the data shows."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-18T10:00:17.000Z",
    "title": "Tether to Withdraw Support for USDT on Omni, Kusama, and Bitcoin Cash’s SLP",
    "url": "https://news.bitcoin.com/tether-to-withdraw-support-for-usdt-on-omni-kusama-and-bitcoin-cashs-slp/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2124354977-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Tether to Stop Minting USDT on Onmi, Kusama and BCH SLP\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2124354977-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2124354977-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2124354977-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2124354977-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2124354977-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2124354977-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2124354977.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Tether has announced a strategic transition that will see the company withdraw support for USDT issued on Omni, Kusama, and Bitcoin Cash&#x2019;s Simple Ledger Protocol (SLP). The company stated that one of the factors that affected this decision was the level of community interest in these projects, declaring that maintaining support for projects without traction [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T09:50:08.000Z",
    "title": "Here are 5 reasons Bitcoin dropped – SpaceX isn’t to blame for this crypto bloodbath",
    "url": "https://www.cryptopolitan.com/5-reasons-bitcoin-fell-spacex-not-to-blame/",
    "description": "Elon Musk&#8217;s SpaceX apparently selling its Bitcoin holdings, the bankruptcy of a Chinese property behemoth, and concerns about interest rate hikes are among the hypotheses put forward to explain Bitcoin&#8217;s unexpected price drop. An unexpected and significant sell-off in crypto markets startled what had been an otherwise dull few weeks for crypto, and the sensation ... <a title=\"Here are 5 reasons Bitcoin dropped &#8211; SpaceX isn&#8217;t to blame for this crypto bloodbath\" class=\"read-more\" href=\"https://www.cryptopolitan.com/5-reasons-bitcoin-fell-spacex-not-to-blame/\" aria-label=\"More on Here are 5 reasons Bitcoin dropped &#8211; SpaceX isn&#8217;t to blame for this crypto bloodbath\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T09:48:14.000Z",
    "title": "Tether ceases USDT support for Bitcoin, Kusama, and Bitcoin Cash blockchains",
    "url": "https://www.cryptopolitan.com/tether-ceases-usdt-support-for-bitcoin-kusama-and-bitcoin-cash-blockchains/",
    "description": "Tether, a prominent stablecoin issuer, has announced its decision to discontinue USDT blockchain support for Bitcoin, Kusama, and Bitcoin Cash, citing a meticulous evaluation of factors encompassing security, compliance, and customer support. This move reflects Tether&#8217;s commitment to ensuring the safety and longevity of chosen blockchains, optimizing maintenance efficiency, and avoiding compromises in security and ... <a title=\"Tether ceases USDT support for Bitcoin, Kusama, and Bitcoin Cash blockchains\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tether-ceases-usdt-support-for-bitcoin-kusama-and-bitcoin-cash-blockchains/\" aria-label=\"More on Tether ceases USDT support for Bitcoin, Kusama, and Bitcoin Cash blockchains\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-18T10:05:36.000Z",
    "title": "Shiba Inu Price Shows Resilience As Shibarium Reboots: SHIB Price Targets",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-price-resilience-shibarium-reboot/",
    "description": "Shibarium, Shiba Inu&#8217;s layer-2 network, is still waiting for a reboot. At the time of going to press, Shibarium was still not producing any blocks, as Shibariumscan.io&#8217;s block explorer shows. As a reminder, Shiba Inu&#8217;s highly anticipated layer-2 went offline minutes after its official launch on Wednesday. In the wake of the unexpectedly high traffic that temporarily took the Shibarium network offline, the Shiba Inu team is diligently working on a solution to restore normalcy, the devs assured today. With many investors keeping a close eye on developments, there is one notable promise from the team &#8211; they emphasize that users&#8217; funds are safe. When Shibarium went offline, $1.7 million was stuck in the ETH Bridge. Shibarium, which is a fork of the renowned Polygon network, saw an unprecedented number of &#8220;compute units&#8221; of traffic shortly after its launch. This influx resulted in, as Shiba Inu developer Kaal Dhairya put it, &#8220;thousands upon thousands of contract creation and normal transactions IN A BLOCK.&#8221; As a result, the Shibarium network activated its failsafe mode and ceased operations to ensure the safety of assets within the blockchain. Related Reading: Buying The Dip? Shiba Inu Whale Activity Surges As Price Declines Nearly 10% In an update today, SHIB developer Kaal Dhairya wrote in a blog post: &#8220;Shibarium received millions of &#8216;compute units&#8217; of traffic in a matter of moments. At that point, Shibarium&#8217;s amazing system went into failsafe mode and paused to make sure the funds were safe&#8230;. And they are.&#8221; The transparency of the Shiba Inu team continues to be evident as they not only recognize the current challenges, but actively seek expert assistance to address them. But the scaling issues seem to be bigger than expected, as the network is approaching a 48-hour downtime (with short interruptions). When Shiabrium will be back online is still unclear, Dhairya announced: &#8220;Tomorrow I will send another update to inform our army of the status of Shibarium Scaling!&#8221; Shiba Inu (SHIB) Shows Resilience The Shiba Inu price briefly fell back to $0.00000727 yesterday amid the market-wide crash, posting a 20% drop. However, SHIB managed to defend a new higher low (albeit just barely) &#8211; a bullish sign. Related Reading: Voyager Sells 1.4 Trillion Shiba Inu, But There’s Good News For SHIB In addition, SHIB bulls have succeeded in ushering in a recovery. At the time of writing, SHIB was trading at $0.00000838, currently trading just above the 23.6% Fibonacci retracement level at $0.00000833. A daily close above this price level would be a bullish exclamation point. This would open the possibility of a move up to the 200-day EMA at $0.00000935, which was lost on Wednesday as a result of the Shibarium stall. A quick bounce of the 200-day EMA would be a strong sign. As then, the area between the 38.2% Fibonacci retracement level at $0.00000979 and the psychologically important $0.00001 level would come into focus. This area could be highly contested. However, if a breakout succeeds, the next targets are $0.00001096 (50% Fibonacci), $0.00001213 (61.8% Fibonacci) and $0.00001381 (78.6% Fibonacci) before the yearly high at $0.00001593 becomes the final hurdle for a bullish breakout of SHIB. Featured image from iStock, chart from TradingView.com"
  }
]