[
  {
    "source": "Decrypt",
    "date": "2023-11-06T22:17:30.000Z",
    "title": "Ben ‘Bitboy’ Armstrong Really Wants His Lambo Back, Files Another Lawsuit",
    "url": "https://decrypt.co/204570/ben-bitboy-armstrong-really-wants-his-lambo-back-files-another-lawsuit",
    "description": "The YouTuber’s legal battles continue as a sixth complaint emerges. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-06T22:19:08.000Z",
    "title": "Solana price corrects as recent (SOL) rally factors come under question",
    "url": "http://cointelegraph.com/news/solana-price-corrects-as-sol-rally-factors-come-under-question",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/6493b387-184f-48d7-bce5-534175c98048.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>SOL price has started to cool off as investors potentially question the reasons for the most recent double-digit rally. </p>\n                    <p><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) experienced a notable 36.6% increase in value between Oct. 30 and Nov. 2. However, SOL’s failure to breach the $44.50 mark resulted in a 10% correction down to $40 on Nov. 6. This movement has left many investors pondering whether the ecosystem growth and network activity support Solana’s present $16.9 billion market capitalization.</p><p>Solana's peak at $44.50 on Nov. 2 was the highest it had reached since August 2022, and coincided with the Solana Breakpoint 2023 global conference held in Amsterdam. The price hype during this period even prompted BitMEX co-founder Arthur Hayes to admit to being a \"degen\" and invest in SOL, despite <a href=\"https://cointelegraph.com/news/bought-sol-arthur-hayes-solana-price-rebounds-500\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bought-sol-arthur-hayes-solana-price-rebounds-500/amp\">referring to the token as \"just a meme.\"</a></p><p>During the Breakpoint conference, the Solana Foundation <a href=\"https://cointelegraph.com/news/solana-sol-price-gains-october-firedancer-testnet-goes-live\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/solana-sol-price-gains-october-firedancer-testnet-goes-live/amp\">unveiled the testnet launch of Firedancer,</a> a new client aimed at enhancing speed, reliability, and reducing hardware requirements for validators, addressing a longstanding criticism of this layer-1 blockchain that offers parallel computing for smart contracts.</p><p>Additionally, on Oct. 31, the Solana Foundation announced the availability of its network dataset on Google Cloud <a href=\"https://solana.com/news/solana-data-live-on-google-cloud-bigquery\" target=\"_blank\" rel=\"noopener nofollow\">BigQuery</a>, a serverless data warehouse solution with built-in machine learning and artificial intelligence. This enables developers and companies to access archival data and analytical insights transparently and securely.</p><p>On the development front, the Solana Foundation has maintained a consistent level of activity. This includes the approval by validators in September of the v.1.16 update, which <a href=\"https://solana.com/news/solana-validators-v1-16-update\" target=\"_blank\" rel=\"noopener nofollow\">introduced</a> confidential transactions for SPL tokens on the Solana network using zero-knowledge (ZK) proofs.</p><p>However, not all news has been positive for Solana despite its token's price performance. For example, on Oct. 17, the decentralized liquid staking protocol, Lido Finance, announced its <a href=\"https://cointelegraph.com/news/lido-finance-wind-down-solana-operations-after-low-fees\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/lido-finance-wind-down-solana-operations-after-low-fees/amp\">decision to cease operations</a> on the network, citing unsustainable financials and low fees, which led to a community vote sealing the service's termination.</p><p>The central question that lingers is whether the on-chain activity and metrics related to decentralized applications (DApps) support the SOL price hike. Thus, one should analyze how Solana's on-chain data and ecosystem growth compares to its competitors.</p><h2>Solana’s reduced total value locked and activity pose considerable risks</h2><p>Solana's primary DApp metric began showing weakness in September as the network's total value locked (TVL), measuring the amount deposited in its smart contracts, reached its lowest levels in over 2 years on Nov. 5.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/2a42e030-063f-4d24-923f-886a81cb5089.png\"><figcaption style=\"text-align: center;\"><em>Solana network Total Value Locked, SOL. Source: DefiLlama</em></figcaption></figure><p>Notably, Solana's DApp deposits experienced a 30% decrease in 30 days at 9.83 million SOL. As a point of comparison, Ethereum's TVL in ETH declined by 2% during the same period, while BNB Chain saw an 8% decrease in BNB terms.</p><p>Furthermore, Solana's low fees and continued development after the FTX-Alameda Research collapse have not necessarily translated into a large number of active users. Solana's largest decentralized exchange (DEX), Raydium, recorded only 17,380 active addresses in the past 30 days. Similarly, Solana's most widely used game, Star Atlas, had 12,420 unique addresses during the same period.</p><p>In contrast, BNB Chain's DEX, PancakeSwap, boasted 513,060 active addresses in the last 30 days, and its Stargate game had 106,400 users. Meanwhile, Avalanche's DEX, Trader Joe, garnered 54,130 active addresses, and its leading game, Galxe, had 32,040 unique addresses.</p><p>Perhaps more concerning is the fact that Solana's DApps' volume reached $609 million in the last 30 days, as reported by DappRadar. This number pales in comparison to BNB Chain's $11 billion, Polygon's $5.3 billion, and Avalanche's $727 million in DApps volume.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/9ad51e8d-be3a-4580-b5ae-3e9ae0b62bc5.png\"><figcaption style=\"text-align: center;\"><em>DApps volume ranking, 30 days, USD. Source: DappRadar</em></figcaption></figure><p>In addition to these issues, criticism has arisen regarding the need for Know Your Customer (KYC) and Anti-Money Laundering (AML) requirements to become a network validator, as <a href=\"https://twitter.com/StakeWithPride/status/1721333643027829244\" target=\"_blank\" rel=\"noopener nofollow\">highlighted</a> by user StakeWithPride on a social network.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/multichain-inside-job-and-sol-surges-80-in-a-month-finance-redefined\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/multichain-inside-job-and-sol-surges-80-in-a-month-finance-redefined/amp\">Multichain inside job? And SOL surges 80% in a month - Finance Redefined</a></em></strong></p><p>To add to the concerns, X social network user arixoneth revealed that out of 1,997 validators, 1,818 received delegations from the Solana Foundation or Alameda, accounting for nearly 90% of all validators. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">2/ I wrote a script to get precise numbers and here is what I got:<br><br>Out of 1997 validators 1818 received delegations from the foundation & Alameda.<br><br>In total they have delegated 106M SOL, 73M from the foundation and 33M from Alameda. <a href=\"https://t.co/Il3eyabeZ8\">pic.twitter.com/Il3eyabeZ8</a></p>— arixon.eth  (@arixoneth) <a href=\"https://twitter.com/arixoneth/status/1709272897892618245?ref_src=twsrc%5Etfw\">October 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>These participants effectively delegated 106 million SOL from these two entities, raising questions about centralization and dissatisfaction among SOL token holders, both concerning the validators and development subsidies as well as the comparatively small DApps user base in relation to other networks. Ultimately, Solana’s on-chain activity contradicts the recent price surge and does not support further price increases.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-06T22:30:19.000Z",
    "title": "OpenAI unveils GPT-4 Turbo, custom GPTs, and more at OpenAI DevDay",
    "url": "https://cryptoslate.com/openai-unveils-gpt-4-turbo-custom-gpts-and-more-at-openai-devday/",
    "description": "<p>OpenAI announced new product upgrades to ChatGPT at its OpenAI DevDay event on Nov. 6. First announced was GPT-4 Turbo, its latest AI model. The new model provides answers with context up to April 2023 instead of January 2022. OpenAI CEO Sam Altman said: &#8220;We are just as annoyed as all of you, probably more, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/openai-unveils-gpt-4-turbo-custom-gpts-and-more-at-openai-devday/\">OpenAI unveils GPT-4 Turbo, custom GPTs, and more at OpenAI DevDay</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-06T22:30:03.000Z",
    "title": "Altcoin Cycle Signal indicates altcoins could take the limelight in new market phase",
    "url": "https://cryptoslate.com/insights/altcoin-cycle-signal-indicates-altcoins-could-take-the-limelight-in-new-market-phase/",
    "description": "<p>Quick Take Historical analysis reveals a fascinating pattern between Bitcoin&#8217;s (BTC) risk profile and the market performance of altcoins. The Bitcoin Risk Signal, a measure of the potential for a significant drawdown in Bitcoin&#8217;s price, is currently at &#8216;0,&#8217; indicative of the least risk. Over the past year, there have been four instances of such [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/altcoin-cycle-signal-indicates-altcoins-could-take-the-limelight-in-new-market-phase/\">Altcoin Cycle Signal indicates altcoins could take the limelight in new market phase</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-06T22:30:31.000Z",
    "title": "Cathie Wood Endorses Bitcoin ‘Hands Down’ Over Gold and Cash, Foresees Deflationary Economy",
    "url": "https://news.bitcoin.com/cathie-wood-endorses-bitcoin-hands-down-over-gold-and-cash-foresees-deflationary-economy/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/cathiewood-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Cathie Wood Endorses Bitcoin &#039;Hands Down&#039; Over Gold and Cash, Foresees Deflationary Economy\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/cathiewood-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cathiewood-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cathiewood-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cathiewood-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cathiewood-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cathiewood-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cathiewood.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Cathie Wood, the founder and CEO of Ark Investment Management, has an optimistic outlook on bitcoin&#x2019;s future and she recently shared her enthusiasm on Bloomberg&#x2019;s &#x201C;Merryn Talks Money&#x201D; podcast. In the conversation, when presented with the choice between gold, cash, or bitcoin as a ten-year investment, Wood confidently declared her preference for bitcoin, saying it [&#8230;]"
  }
]