[
  {
    "source": "Decrypt",
    "date": "2023-09-06T13:14:33.000Z",
    "title": "TON Foundation Announces Registration as Swiss Non-Profit",
    "url": "https://decrypt.co/155138/ton-foundation-announces-registration-as-swiss-non-profit",
    "description": "The TON blockchain project that spun-off from Telegram after legal troubles in the United States has found a new home in Switzerland."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T13:30:00.000Z",
    "title": "NFT collapse and monster egos feature in new Murakami exhibition",
    "url": "https://cointelegraph.com/magazine/nft-collapse-and-monster-egos-feature-in-new-murakami-exhibition/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/magazine-Takeshi-Murakami-scaled.jpeg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Famed Japanese artist Takashi Murakami’s new exhibition comments on digital ego and the shaky status of the NFT industry.</p>\n                    <p><p><strong>Even if you arent personally familiar with famed Japanese contemporary artist Takashi Murakami, you have surely seen his work.</strong> <br><br>The pop artists brightly colored signature characters have appeared on everything from limited edition Louis Vuitton bags to Supreme shirts to Vans skateboarding shoes.<br><br>Having collaborated with celebrities like Drake, Kanye West and Billie Eilish, and institutions such as the Museum of Modern Art and Gagosian, Murakami is, without a doubt, one of the biggest conventional artists to try their hand at making nonfungible tokens (NFTs). Despite this, his projects still havent blown up to the extent of other prominent contemporary artists like Beeple.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/bag.jpg\" alt=\"\" class=\"wp-image-23644\" width=\"396\" height=\"456\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/bag.jpg 552w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/bag-260x300.jpg 260w\" sizes=\"(max-width: 396px) 100vw, 396px\" /><figcaption class=\"wp-element-caption\">Louis Vuitton x Takashi Murakami 2000s pre-owned monogram panda jewelry case selling for an eye-popping $37,000 (Farfetch)</figcaption></figure><p><br>Many are convinced that is set to change, claiming Murakamis flowers are well on their way to becoming as iconic as CryptoPunks and Bored Apes. After a hotly anticipated but ultimately disappointing NFT launch that coincided with the 2022 crypto collapse, the artist is finally having another go at the medium. A new exhibit at San Franciscos Asian Art Museum shows how Murakami creates original tokens from scratch.</p><h2 class=\"wp-block-heading\" id=\"h-high-art-and-low-art\"><strong>High art and low art</strong></h2><p>While many take Murakamis flowers at face value, there is more to them than meets the eye. Inspired by the postwar Japan in which he grew up, these deceptively jolly icons critique the perversion and violence that underscore the countrys otaku and kawaii subcultures.</p><p>The stylized imagery of these cultures is becoming increasingly popular in western countries thanks to the export of Japanese manga, anime and video games, and Murakami  taking a page out of Andy Warhol’s book  exposes the commercialization of these mediums by way of embracing and even exploiting them. His studio isnt so much a studio as it is a full-fledged factory, operated by 25 assistants who help him satisfy the demand for his personal brand.</p><p>Unifying Murakamis scattered oeuvre is his Superflat theory, which not only refers to the two-dimensional quality that bridges traditional Japanese visual culture to its contemporary counterparts, but also to the idea that Japan, as a society, makes little distinction between high and low art  between the art you find in a museum and the art you find on billboards or the pages of a manga.</p><section class=\"adv-banner adbutler-ad adbutler-ad__desktop\"><div class=\"container\"><!-- 1456x180 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><section class=\"adv-banner adbutler-ad adbutler-ad__mobile\"><div class=\"container\"><!-- 600x500 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><p><br>This, Murakami says, is in stark contrast to the West, where professional critics decide what kind of creative output deserves to be displayed in galleries and what does not. Presently, NFTs are still largely relegated to the second group  a classification he hopes to change. <br><br>After finding huge success with traditional media, uncontrollable events and poor timing conspired against the artists NFT efforts. Murakamis first flowers launched right before the downfall of FTX, causing their value to plummet from $260,000 to just $2,200 per token on OpenSea. Displaying a level of humility seldom seen in the worlds of both art and crypto, Murakami paused his sales and apologized to his investors.</p><figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\"><blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Dear holders of <a href=\"https://t.co/cfb6yRZ4lo\" target=\"_blank\" rel=\"nofollow\" >https://t.co/cfb6yRZ4lo</a>, I appreciate your continuing patronage, although the project&#39;s floor price and transaction prices remain stagnant. I am very sorry. <a href=\"https://t.co/l9QmTUAS1t\" target=\"_blank\" rel=\"nofollow\" >pic.twitter.com/l9QmTUAS1t</a></p>— takashi murakami (@takashipom) <a href=\"https://twitter.com/takashipom/status/1534560567146319872?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >June 8, 2022</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></figure><p><br>He followed up this apology with a lengthy statement saying he would take a step back from the NFT marketplace and figure out how to create digital art that matched the value of its real-world counterparts. He asked himself the kinds of questions that confuse the non-initiated. Should he use ERC-721 or 1155? Did he need IPFS or independent smart contracts? What about opening his own physical storefront?</p><h2 class=\"wp-block-heading\" id=\"h-unfamiliar-people\"><strong>Unfamiliar people</strong></h2><p>The crypto collapse left a mixed impression on Murakami, who will be exploring his frustration with the volatility of the metaverse in an exhibit he calls Unfamiliar People  Swelling of Monsterized Human Ego. Running from Sept. 15, 2023, until Feb. 12, 2024, it largely consists of mixed media pieces depicting humanoid monsters.<br><br>Influenced by traditional ukiyo-e woodblock prints, his familiar kawaii style, and even Spanish painter Francisco Goyas nightmarish painting Saturn Devouring His Son (which a young Murakami remembers seeing on a museum trip with his parents), the distorted figures presented in Murakamis exhibit comment on the corroding influence of digital technology: the relentless self-promotion on social media and the adulterating anonymity of internet message boards.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/TM3.jpg\" alt=\"\" class=\"wp-image-23645\" width=\"579\" height=\"602\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/TM3.jpg 850w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/TM3-288x300.jpg 288w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/TM3-770x801.jpg 770w\" sizes=\"(max-width: 579px) 100vw, 579px\" /><figcaption class=\"wp-element-caption\">A high-spirited Youth Whos Determined to Get a Job in Finance and Make It (Murakami)</figcaption></figure><p>His core theme  the swelling ego  not only applies to toxic online discourse but also to the mismanagement of media personalities like Elon Musk, Mark Zuckerberg and Sam Bankman-Fried, whose irresponsible behavior has tarnished the reputations of entire industries and technologies.</p><p>Despite his negative experiences with making and selling NFTs, Murakami isnt pessimistic. He believes the crypto collapse, far from bursting an already oversized bubble, will go down in financial history as little more than a temporary setback.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/recursive-inscriptions-bitcoin-supercomputer-defi-aws-possible/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Recursive inscriptions: Bitcoin supercomputer and BTC DeFi coming soon</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/best-and-worst-stories-3-years-cointelegraph-magazine/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>The best (and worst) stories from 3 years of Cointelegraph Magazine</p>                        </a>                    </div></div></div><p><br>Both economically and conceptually, he tells Magazine, the current decline of virtual currencies simply marks a shaky transitional period. Therefore, I am not worried at all, and am still running several NFT projects. I will continue to bridge the metaverse and the real world in the art scene. He thinks that in the near future, with the rise of young critics and creators who understand the concept, NFT art will become common all at once.<br><br>Standing in contrast to Murakamis Unfamiliar People series are various physical reimaginings of his NFTs, including painted renditions of the Murakami.Flowers. Previously sold at Gagosian, Murakami created these paintings to help secure and stabilize the value of his NFTs, whose floor price on OpenSea remains as low as it can be. Some of the paintings, meanwhile, have sold for upwards of $70,000.</p><figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/TM2-819x1024.jpeg\" alt=\"\" class=\"wp-image-23646\" width=\"521\" height=\"652\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/TM2-819x1024.jpeg 819w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/TM2-240x300.jpeg 240w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/TM2-770x963.jpeg 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/TM2.jpeg 920w\" sizes=\"(max-width: 521px) 100vw, 521px\" /><figcaption class=\"wp-element-caption\">Murakami posing in front of paintings inspired by his Murakami.Flowers NFTs (RK)</figcaption></figure><p>Also present at the exhibit is a sculpture of the digital avatars Murakami made in collaboration with RTFKT, a digital fashion and collectible organization known for its work on video game engines, blockchain authentication and augmented reality, in addition to its futuristic sneaker designs.</p><p>Inspired by Snapchats Bitmoji, Murakami and RTFKT created over 20,000 character models to represent players in online games, each with uniquely designed eyes, mouths, clothes and even behavioral traits. Murakami describes his sculpture as a cyborg. Not only because it has a reflective silver surface with mechanical patterns etched into it, but also because the digital avatars on which it is based are part human and part machine.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/TM5.jpg\" alt=\"\" class=\"wp-image-23647\" width=\"444\" height=\"592\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/TM5.jpg 736w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/TM5-225x300.jpg 225w\" sizes=\"(max-width: 444px) 100vw, 444px\" /><figcaption class=\"wp-element-caption\">Clone X  Takashi Murakami #3 Devil Miss Ko2 (Murakami)</figcaption></figure><h2 class=\"wp-block-heading\" id=\"h-changing-value-in-contemporary-art\"><strong>Changing value in contemporary art</strong></h2><p>When asked if making NFT art is in any way different from making traditional art, Murakami answered: yes and no.</p><p>Contemporary art since Marcel Duchamp has clearly been a world of transcendental conceptual art, he says, so I thought that an understanding of the metaverse would come somewhat naturally for the fans of contemporary art. I instantly understood and entered into that worldview, but to my surprise, others didnt follow. I think the big deterrent has been a certain inability to change the value system of the contemporary art world, and a resulting unwillingness to understand NFTs. Right now, these two words are still completely separated.</p><p>At the moment, most western critics do not see NFT art as art. They think the imagery is poorly executed and childish, and insist the concept of the metaverse is a fraud, according to Murakami. Their aversion to NFTs  fueled in part by self-preservation  is so fervent that they reject Murakamis tokens whilst celebrating their painted equivalents. No doubt, the swollen egos of Unfamiliar People contain traces of these individuals as well.</p><p>Perhaps the western art world should be more like Japans. There, the destruction of the Second World War and subsequent occupation by the U.S. army completely dismantled the countrys traditional social structure. As a result, says Murakami, Japan found itself in a very unique situation where high art could not be established since there were no elites to claim it as theirs and theirs alone. He adds:</p><blockquote class=\"wp-block-quote\"><p>In Japan there is no distinction between high art and low art, and we are bound by the obsession that high art must also be dragged down to the realm of the low and be enjoyable to everyone.</p></blockquote><p>This, paired with the demand for iconography reminiscent of Japanese manga and anime, indicates that Japan should have a rich and vibrant NFT market. However, this is not the case. According to Murakami, plenty of Japanese artists  especially manga artists  are interested in making the switch, but are prevented from doing so by strict regulations that make such ventures unprofitable.  </p><p>The virtual currency ecosystem the Japanese government has thought up, he explains, is so complicated and negative that the manga or anime creators would not be enticed to leave their normal economic sphere. Therefore, there has been no sign of the NFT market developing at all here.</p><p>The situation isnt much better in America  at least, not right now. Although the crypto world is gradually picking itself up from the FTX fiasco, NFTs are yet to recover. </p><p>After hitting their peak value in January 2022, many tokens plummeted. By September of that year, volumes <a href=\"https://cointelegraph.com/news/nft-trading-volume-plunges-98-from-january-despite-rise-in-adoption\" target=\"_blank\" rel=\"nofollow\" >had all but disappeared</a> and demand had vanished. Murakamis flowers arent the only NFTs raise their floor price; BoredApes and CryptoPunks are in the same boat. </p><p>The current situation is so bad that many NFT creators dont know what to do or where to go next. Murakami is the rare exception, but perhaps that is because  as a renowned artist  his source of status and income isnt exclusively tied to tokens. For him, creating NFTs is an artistic experiment as much as it is an act of embracing what he (and many others) still believe to be the future of both creativity and commerce.</p><p>And Murakami really does believe that. Years after coming up with his idea of Superflat, he argues that the digitization of art has not just verified his theory, but taken it to its logical conclusion:</p><blockquote class=\"wp-block-quote\"><p>I believe the era of Superflat has come to an end, at least for the time being, along with the pandemic. The reason is because the full perfection of the web-based society has now been achieved. In other words, the real Superflat society has now become a reality. And with the rise of the metaverse, unknown zones have emerged that will add even more depth to that definitively flattened society; we could say we are now heading for a hyper-Superflat world.</p></blockquote><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.7\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T13:12:11.000Z",
    "title": "SBI expands Ripple remittance tech to banks in Vietnam, Indonesia, Philippines",
    "url": "https://cointelegraph.com/news/ripple-sbi-expands-ripple-remittance-tech-to-vietnam-indonesia-and-philippines",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/34d0fe24-1108-4ff1-afa4-39f28c393f84.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>SBI Remit will use XRP as a bridge currency to enable faster and more cost-effective remittances to several Southeast Asian countries.  </p>\n                    <p><p>Japanese financial holding company SBI Group has announced that its international remittance services arm SBI Remit has partnered with Ripple and SBI Ripple Asia to offer an XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) remittance service to bank accounts in several Southeast Asian countries. </p><p>In an announcement, the company <a href=\"https://www.sbivc.co.jp/newsview/88ut48zo5l\" target=\"_blank\" rel=\"noopener nofollow\">highlighted</a> that SBI Remit has been using Ripple payments services for international remittances since 2017. Furthermore, SBI Remit also introduced solutions using crypto in 2021, claiming that it was the first in Japan to provide remittance services using XRP to crypto wallets in the Philippines. </p><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\">XRPを活用するRippleの送金ソリューションを用いた国際送金サービスをフィリピン・ベトナム・インドネシア向けに順次拡大<br><br>【XRPのブリッジ通貨利用】<br>✅スピーディかつ低コストで送金<br>✅拡張性あり(世界中のRipple提携先へ容易に送金可)<br>⇒国際送金事業における競争力強化<a href=\"https://t.co/2mwo33cn4q\">https://t.co/2mwo33cn4q</a> <a href=\"https://t.co/vaOKwlC79y\">pic.twitter.com/vaOKwlC79y</a></p>&mdash; SBI VC Trade (SBI VCトレード） (@sbivc_official) <a href=\"https://twitter.com/sbivc_official/status/1699304614200594855?ref_src=twsrc%5Etfw\">September 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>With the new update, the payment technology service will be expanded to bank accounts in the Philippines, Vietnam and Indonesia. Through the program, SBI Remit will use XRP as a bridge currency to allow fast and cost-effective remittances. </p><p>According to the announcement, SBI expects adoption to accelerate as the volume of remittances to bank accounts in the countries mentioned above is high. Meanwhile, SBI also highlighted that it partnered with the cross-border payment solutions company Tranglo to make the expansion possible.</p><p>SBI did not mention an exact date of when the service will be available, but the company highlighted that it will be rolled out within this month. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/digital-dollar-project-completes-cbdc-retail-remittance-pilot-with-western-union\"><strong><em>Digital Dollar Project completes CBDC retail remittance pilot with Western Union</em></strong></a></p><p>Ripple’s services continue to gain adoption in Japan despite its ongoing lawsuit in the United States. On April 17, Japanese banks Yamaguchi, Momiji and Kitakyushu <a href=\"https://cointelegraph.com/news/ripple-based-moneytap-adopted-by-three-japanese-banks\">started to support</a> a RippleNet-based remittance service called MoneyTap P2P. The banks collectively have more than 170 local branches and are considered to be some of the major banking players in the country. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-city-guide-osaka-japan/\"><strong><em>Crypto City: Guide to Osaka, Japan’s second-biggest city</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-09-06T13:30:00.000Z",
    "title": "NFT collapse and monster egos feature in new Murakami exhibition",
    "url": "https://cointelegraph.com/magazine/nft-collapse-and-monster-egos-feature-in-new-murakami-exhibition/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/magazine-Takeshi-Murakami-scaled.jpeg\"></p><p>Famed Japanese artist Takashi Murakami’s new exhibition comments on digital ego and the shaky status of the NFT industry.</p>\n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-09-06T13:23:37.000Z",
    "title": "Justin Bieber’s hit ‘Company’ transforms into royalty-bearing NFT",
    "url": "https://crypto.news/justin-biebers-hit-company-transforms-into-royalty-bearing-nft/",
    "description": "Justin Bieber's 2015 hit song \"Company\" has been converted into an NFT by anotherblock, enabling fans to earn royalties from its future streams."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-06T13:30:31.000Z",
    "title": "ApeMax The New Meme Coin Headed to the Moon? A Comprehensive Exploration of ApeMax’s Features and Unlocking the Secrets of the Hottest New Crypto Presale",
    "url": "https://www.crypto-news-flash.com/apemax-the-new-meme-coin-headed-to-the-moon-a-comprehensive-exploration-of-apemaxs-features-and-unlocking-the-secrets-of-the-hottest-new-crypto-presale/",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-06T154455.750.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-06T154455.750.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-06T154455.750-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The ever-expanding universe of cryptocurrencies has been a breeding ground for innovative and sometimes whimsical projects. Meme coins, especially, have captured the spotlight, offering a mix of fun, community, and DEFI. One such emerging star in the meme coin space is ApeMax, featuring its charismatic mascot, Max the Ape. In this guide, we&#8217;ll take you [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-06T13:28:56.000Z",
    "title": "Cardano: The Amazon of the Crypto World, Driving ADA Price Past $0.50 with Massive New Updates and Scaling Features",
    "url": "https://www.crypto-news-flash.com/cardano-the-amazon-of-the-crypto-world-driving-ada-price-past-0-50-with-massive-new-updates-and-scaling-features/",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-Cardano.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-Cardano.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-Cardano-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-Cardano-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-Cardano-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />A market analyst has highlighted similarities between Cardano (ADA) right now and Amazon (AMZN) in 2001. Cardano&#8217;s robustness and competitive nature draw parallel to Amazon in its initial stages which were followed by massive success. Popular market analyst and Crypto Capital Venture founder Dan Gambardello has in a recent YouTube analysis likened Cardano (ADA) to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-06T13:27:42.000Z",
    "title": "Ripple: XRP Lawyer Accuses US SEC of Concealing Secret Howey Memo for Self-Protection",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-lawyer-accuses-us-sec-of-concealing-secret-howey-memo-for-self-protection/",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP Lawyer John Deaton\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Attorney John Deaton alleges SEC&#8217;s concealment of &#8216;Howey Memo,&#8217; raising concerns about transparency and its potential impact on the XRP lawsuit. John Deaton criticizes former SEC Chair Jay Clayton&#8217;s past controversies, including conflicts of interest and connections to the Corporation Service Company (CSC), raising questions about financial misconduct. During the intense legal dispute involving Ripple [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-06T13:10:33.000Z",
    "title": "IOTA to Unleash the Beast: Closed Launch of ShimmerEVM Released, Unlocking Access to Billion-Dollar Markets",
    "url": "https://www.crypto-news-flash.com/iota-to-unleash-the-beast-closed-launch-of-shimmerevm-released-unlocking-access-to-billion-dollar-markets/",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"IOTA MIOTA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Tobias-Arhelger-IOTA-2-1-48x32.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />The IOTA team is working on the closed launch of ShimmerEVM which will be the final one before the public launch. So far, the ShimmerEVM testnet has already processed more than a total of 1.4 million transactions. In an internal communication on the discord channel, IOTA&#8217;s team members have shared the progress with the mainnet [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-06T13:30:07.000Z",
    "title": "Nexo Price Prediction 2023-2030: Will NEXO Price Hit $1 Soon?",
    "url": "https://coinedition.com/nexo-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Nexo-NEXO-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Nexo (NEXO) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Nexo-NEXO-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Nexo-NEXO-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Nexo-NEXO-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Nexo-NEXO-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Nexo-NEXO-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Nexo is an Ethereum-based platform that was started in 2017. Its native token is denoted as NEXO and is present in the Ethereum blockchain, Binance Chain, and Polygon blockchain. Nexo investors are bullish on the token since it has a return on investment (ROI) of over 24 times in the past four years. The crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/nexo-price-prediction/\">Nexo Price Prediction 2023-2030: Will NEXO Price Hit $1 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-06T13:30:00.000Z",
    "title": "SEC’s Next Target Might Be Friend.tech — Are Its Keys Securities?",
    "url": "https://coinedition.com/secs-next-target-might-be-friend-tech-are-its-keys-securities/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/SEC-Trying-to-Hurt-Binance.US_.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SEC Trying to Hurt Binance.US\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/SEC-Trying-to-Hurt-Binance.US_.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/SEC-Trying-to-Hurt-Binance.US_-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/SEC-Trying-to-Hurt-Binance.US_-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/SEC-Trying-to-Hurt-Binance.US_-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/SEC-Trying-to-Hurt-Binance.US_-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/SEC-Trying-to-Hurt-Binance.US_-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Friend.tech, a rapidly emerging social media platform in the crypto space, has come under scrutiny regarding the classification of its keys as securities and whether they should be subject to regulation by the U.S. Securities and Exchange Commission (SEC). In an Unchained Podcast episode hosted by Laura Shin, legal expert J.W. Verret and tax specialist [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/secs-next-target-might-be-friend-tech-are-its-keys-securities/\">SEC&#8217;s Next Target Might Be Friend.tech — Are Its Keys Securities?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-06T13:13:20.000Z",
    "title": "HEX Was Deliberately Designed to Make Richard Heart Rich: Investor",
    "url": "https://coinedition.com/hex-was-deliberately-designed-to-make-richard-heart-rich-investor/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://coinedition.com/wp-content/uploads/2022/10/A-Beginners-Guide-To-Crypto-Trading-696x392-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/A-Beginners-Guide-To-Crypto-Trading-696x392-1.jpg 696w, https://coinedition.com/wp-content/uploads/2022/10/A-Beginners-Guide-To-Crypto-Trading-696x392-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/A-Beginners-Guide-To-Crypto-Trading-696x392-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/A-Beginners-Guide-To-Crypto-Trading-696x392-1-600x338.jpg 600w\" sizes=\"(max-width: 696px) 100vw, 696px\" /><p>Several crypto users consider HEX, the project described as a Certificate of Deposit on the blockchain, a failed project. According to DonAlt, a self-described Vaxxed Matrix Agent, HEX is a crypto token created to make its founder, Richard Heart, rich. DonAlt noted that HEX is one of the crypto projects where he is entirely price [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/hex-was-deliberately-designed-to-make-richard-heart-rich-investor/\">HEX Was Deliberately Designed to Make Richard Heart Rich: Investor</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]