[
  {
    "source": "NewsBTC",
    "date": "2024-01-31T23:00:03.000Z",
    "title": "Billionaire Tim Draper’s Forecast: Bitcoin To Hit $250,000 By 2025",
    "url": "https://www.newsbtc.com/bitcoin-news/billionaire-tim-drapers-forecast-bitcoin-to-hit-250000-by-2025/",
    "description": "Renowned billionaire investor Tim Draper has again captured the crypto community&#8217;s attention with his bullish stance on Bitcoin. Despite missing his previous forecast 2018, where he predicted Bitcoin would hit $250,000 by 2022, Draper remains steadfast in his belief in Bitcoin&#8217;s potential. Bitcoin To Hit $250,000 By 2025 In a recent Bloomberg interview, Draper first humorously acknowledged his missed prediction, joking: &#8220;Well, I don&#8217;t know why anybody is still listening to me if I missed that one.&#8221; Yet, this missed forecast hasn’t dampened his optimism; Draper is doubling on his prediction, projecting that Bitcoin will reach the quarter-million mark by 2025. Related Reading: Glassnode Co-Founder Warns: Bitcoin’s Surge Could Trigger A $1 Billion Liquidation Event – Here’s Why Draper cites his misjudgment of the US government&#8217;s conservative stance on cryptocurrency regulation as the reason behind his previous prediction not materializing. However, he emphasizes the increasing adoption of Bitcoin in countries with unstable currencies. Draper notes the growing preference for conducting business in Bitcoin over traditional currencies like the US dollar, especially in regions where the dollar is often associated with criminal activities. His vision for Bitcoin extends beyond a mere store of value; he anticipates a future where Bitcoin becomes a universally accepted currency, fundamentally transforming financial transactions. Draper noted: I actually think there will be a moment in time when I can buy my food, clothing, and shelter all in Bitcoin, and people won&#8217;t want dollars anymore. It is worth noting that Tim Draper further foresees a &#8220;transformative shift&#8221; in the worldwide financial landscape, where Bitcoin&#8217;s limited supply and resistance to political interference render it a more dependable and stable currency choice. Here&#8217;s why Draper Associates Founder Tim Draper is still bullish on Bitcoin 👇 https://t.co/pGnc9lUzVf pic.twitter.com/ac3NMJjCPx — Bloomberg (@business) January 30, 2024 Draper sees a parallel between Bitcoin&#8217;s growth trajectory and Microsoft&#8217;s initial stages, forecasting Bitcoin&#8217;s rise as a central platform for diverse financial innovations, notably in the realms of Decentralized Finance (DeFi) and Non-Fungible Tokens (NFTs), which he refers to as &#8220;organelles.&#8221; Industry Titans BTC Forecast Align Draper&#8217;s bold predictions echo those of other industry figures, like the founder of the hedge fund Skybridge, Anthony Scaramucci, who projects that Bitcoin could reach as high as $400,000, nearing half of gold’s market capitalization. This prediction suggests a potential tenfold increase, dramatically shifting the landscape of digital assets. Related Reading: Bitcoin Whales Increase Holdings By 4.5%, Getting Ready For Rally? Meanwhile, Bitcoin&#8217;s influence is already being felt in traditional finance. Recent data from JP Morgan shows a significant inflow into Bitcoin funds. In contrast, gold exchange-traded funds (ETFs) experience a concurrent outflow, indicating a shift in investor preference from traditional to digital assets. Gold flow consistently moving out while btc flows move in pic.twitter.com/Y1A75nAZBa — Tom Dunleavy (@dunleavy89) January 31, 2024 Amid these developments, Bitcoin&#8217;s market performance continues to exhibit resilience and growth. Over the past week, the cryptocurrency has seen a 6.1% increase, trading at around $43,056 at the time of writing. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-31T23:01:09.000Z",
    "title": "Tether Sees Record-Breaking Profits, Largely Driven by Interest Payments From US Treasuries",
    "url": "https://dailyhodl.com/2024/01/31/tether-sees-record-breaking-profits-largely-driven-by-interest-payments-from-us-treasuries/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/tether-fake-says-wholly.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/tether-fake-says-wholly.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/tether-fake-says-wholly.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/tether-fake-says-wholly.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/tether-fake-says-wholly.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/tether-fake-says-wholly.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/tether-fake-says-wholly.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Stablecoin issuer Tether’s latest attestation report reveals that the firm made record profits in Q4, mostly driven by interest payments from US treasuries. According to the report, Tether made $2.5 billion in profits during the fourth quarter of 2023, the highest net profit the firm has ever seen. “In terms of financial performance, the fourth [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/31/tether-sees-record-breaking-profits-largely-driven-by-interest-payments-from-us-treasuries/\">Tether Sees Record-Breaking Profits, Largely Driven by Interest Payments From US Treasuries</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]