[
  {
    "source": "CoinDesk",
    "date": "2024-04-02T15:58:28.000Z",
    "title": "Crypto Exchange Figure Markets Has a Plan to Democratize Finance",
    "url": "https://www.coindesk.com/business/2024/04/02/crypto-exchange-figure-markets-has-a-plan-to-democratize-finance/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "What appears to be another post-FTX trading and custody play with institutions in mind, is really all about visionary disruption."
  },
  {
    "source": "CoinDesk",
    "date": "2024-04-02T15:40:00.000Z",
    "title": "Ethereum Could Face 'Hidden Risks' From Ballooning Restaking Market: Coinbase",
    "url": "https://www.coindesk.com/business/2024/04/02/ethereum-could-face-hidden-risks-from-ballooning-restaking-market-coinbase/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Restaking has grown into the second-largest DeFi sector on the Ethereum blockchain and is likely to become a core part of the network’s infrastructure, the report said."
  },
  {
    "source": "Decrypt",
    "date": "2024-04-02T16:01:08.000Z",
    "title": "'Crypto: The Game' Goes Bigger for Season 2—Can It Sustain the Hype?",
    "url": "https://decrypt.co/224441/crypto-game-bigger-season-2-remain-viral-hit",
    "description": "After captivating the industry, the Survivor-inspired Crypto: The Game is back with on-chain mechanics, sponsors, and more upgrades."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-02T16:06:53.000Z",
    "title": " Bitcoin clings to $65K — More losses ahead for BTC price?  ",
    "url": "https://cointelegraph.com/news/bitcoin-65k-more-losses-btc-price",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvYWEzOGZmMWYtYjllOC00ZDhlLThiOTMtMjc4ZjllZmI3MmQyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin price briefly dipped below the $65,000 mark as long-term BTC holders started selling. Can BTC price close the week above $65,600?</p>\n                    <p><p>Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price fell over 7.1% during the past day, slipping below the $65,000 mark for the first time since March 24.</p><p>The current week, or the 14th week of the year, is historically one of the worst weeks for Bitcoin’s price performance. BTC price fell an average of 8.33% on the 14th week of the year, according to <a href=\"https://www.coinglass.com/today\" target=\"_blank\" rel=\"noopener nofollow\">Coinglass</a> data.</p><p>Bitcoin price fell over 6% in the past 24 hours, reaching a daily low of $64,610 at 1:35 pm (UTC), while trading volume for the world’s largest cryptocurrency rose over 75% during the day to $46 billion, according to <a href=\"https://coinmarketcap.com/currencies/bitcoin/\" target=\"_blank\" rel=\"noopener nofollow\">CoinMarketCap</a> data.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-65k-more-losses-btc-price\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-02T16:05:00.000Z",
    "title": " History of Crypto: The ICO Boom and Ethereum&#039;s Evolution ",
    "url": "https://cointelegraph.com/news/ethereum-ico-boom-history-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOWQ3NGQ0MmYtNzcxNi00NDBhLWI4ZjgtZGE1YTNmMTRjNzY0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>In 2017 the initial coin offering boom launched a tidal wave of activity for the crypto industry. Despite being plagued by scams and fraud, the ICO boom was also responsible for some of the most important crypto projects in the industry today. </p>\n                    <p><p data-ct-non-breakable=\"true\">In this article, we will venture through one of the most transformative periods of crypto history, known as the initial coin offering (ICO) boom. </p><p data-ct-non-breakable=\"true\">ICOs swept onto the crypto scene in early 2017, allowing thousands of new blockchain-based projects to rapidly raise significant amounts of capital by selling pre-released tokens directly to investors. Projects issued their tokens in exchange for funding to launch new networks and decentralized applications (DApps). </p><p class=\"post-content__accent post-content__accent_big data-ct-non-breakable=\" true><a href=\"https://cointelegraph.com/history-of-crypto\">EXPLORE THE HISTORY OF CRYPTO</a></p><p><a href=\"https://cointelegraph.com/news/ethereum-ico-boom-history-crypto\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-04-02T15:43:44.000Z",
    "title": "Aave considers dropping DAI as collateral over contagion concerns from MakerDAO’s USDe move",
    "url": "https://cryptoslate.com/aave-considers-dropping-dai-as-collateral-over-contagion-concerns-from-makerdaos-usde-move/",
    "description": "<p>Marc Zeller, the founder of the Aavechan Initiative, has proposed to the decentralized autonomous organization (DAO) overseeing Aave to remove DAI stablecoin&#8217;s collateral status within the protocol&#8217;s lending ecosystem. This move comes in response to MakerDAO&#8217;s proposal to allocate 600 million DAI into the fast-rising synthetic dollar USDe and staked USDe (sUSDe) through the DeFi [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/aave-considers-dropping-dai-as-collateral-over-contagion-concerns-from-makerdaos-usde-move/\">Aave considers dropping DAI as collateral over contagion concerns from MakerDAO&#8217;s USDe move</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-02T16:03:43.000Z",
    "title": "dTelecom Migrates From Arbitrum to DePIN Layer-1 peaq",
    "url": "https://cryptodaily.co.uk/2024/04/dtelecom-migrates-from-arbitrum-to-depin-layer-1-peaq",
    "description": "dTelecom, the innovative DePIN functioning as a live streaming and real-time communications layer for apps and decentralized apps (dApps), will soon migrate to peaq as its layer-1 blockchain as it prepares to leave the Arbitrum ecosystem."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-02T15:57:09.000Z",
    "title": "Expert Altcoins Picks for Exponential Gains",
    "url": "https://cryptodaily.co.uk/2024/04/expert-altcoins-picks-for-exponential-gains",
    "description": "Our latest article, “Expert Altcoins Picks for Exponential Gains” provides valuable insights and predictions on what the next big altcoins might be. Gain a greater understanding of the potential these cryptocurrencies hold in the market."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-02T16:07:24.000Z",
    "title": "Google Unveils SEEDS: A Revolutionary AI Model for Weather Forecasting",
    "url": "https://www.cryptopolitan.com/google-seeds-for-weather-forecasting/",
    "description": "Google has developed a generative artificial intelligence (AI) model, which the company has called the Scalable Ensemble Envelope Diffusion Sampler (SEEDS), to transform weather forecasting in a big way and help make effective, low-cost predictions. This is the modern age, which has greatly made use of supercomputing and advanced models of AI as compared to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-02T16:01:08.000Z",
    "title": "Binance CEO tackles South Korea market entry woes",
    "url": "https://www.cryptopolitan.com/binance-ceo-tackles-south-korea-market-entry/",
    "description": "According to the reports, the CEO of Binance, Richard Teng, visited South Korea to iron out issues that have arisen regarding the entry of the company into the market. Teng sought to interact directly with the local financial regulatory authorities, among them the Financial Intelligence Unit (FIU). His visit comes after Binance’s fight to gain [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-02T16:00:32.000Z",
    "title": "Content Warning: Lethal Company-Style Horror Game Available for Free for a Limited Time",
    "url": "https://www.cryptopolitan.com/game-available-for-free-for-a-limited-time/",
    "description": "As a shocking maneuver on April 1st, Landfall, the publisher company behind the horrific new video game &#8220;Content Warning,&#8221; with a free offer game released for the 24-hour launch release window. This game virtually repeats Let&#8217;s Get This Political&#8217;s style, requiring players to capture their pals becoming terrified and then posting the content on SpöökTube [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-02T15:58:00.000Z",
    "title": "Tron Price Prediction 2024-2033: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2024-2033 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network. TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-04-02T16:04:46.000Z",
    "title": "Bitcoin miners earned record $2b before halving",
    "url": "https://crypto.news/bitcoin-miners-earned-record-before-halving/",
    "description": "Bitcoin miners earned over $2 billion in March, reaching a new all-time high."
  },
  {
    "source": "BTCManager",
    "date": "2024-04-02T15:49:56.000Z",
    "title": "Tether grants $100k to BTCPay Server Foundation",
    "url": "https://crypto.news/tether-grants-100k-to-btcpay-server-foundation/",
    "description": "Tether recently announced a $100,000 grant to the BTCPay Server Foundation, solidifying its support of the free and open-source software movement."
  },
  {
    "source": "BTCManager",
    "date": "2024-04-02T15:41:36.000Z",
    "title": "Changpeng Zhao tops crypto billionaires ranking despite legal saga",
    "url": "https://crypto.news/changpeng-zhao-tops-crypto-billionaires-ranking-despite-legal-saga/",
    "description": "According to a new Forbes article, Binance founder Changpeng Zhao has tripled his net worth since 2023."
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-02T16:00:47.000Z",
    "title": "Buying Opportunity: Crypto Institutional Investors Pump $862 Million Into The Market",
    "url": "https://www.newsbtc.com/crypto/crypto-institutional-investors/",
    "description": "Crypto investment products are up again in terms of inflows, giving the crypto industry a much-needed breather. Recent market dynamics have seen Bitcoin leading the surge of inflows into crypto investment products, signaling a possible resumption of bullish sentiment. James Butterfill, head of research at Coinshares, reported this inflow in a social media post. The statistics indicate that crypto investment products received inflows of $862 million over the timeframe spanning from March 23 to March 29 to reverse the record net outflows of $942 million set in the prior week. Unsurprisingly, most of the inflow went into Bitcoin, hinting at a potential buying opportunity for investors still waiting to get in on the asset during this bull run. Institutional Investors Pump $862 Million Into Crypto Market James Butterfill termed the inflow registered last week as a &#8220;recovery for ETFs.” This is rightly so, as these US-based Spot Bitcoin ETFs gave investors a scare in the prior week with lackluster inflow, hinting at the possibility that the bull run could be coming to an end. This led to crypto investment products bleeding for the first time after seven consecutive weeks of inflows.  Related Reading: Forget Bitcoin, Altcoins Are The Winners Of This Cycle, Crypto Analyst Says However, it would seem the sentiment regarding Spot Bitcoin ETFs is now back to a very bullish outlook. As a result, Bitcoin registered $865 million in inflows to bring its year-to-date inflow to $12.83 billion. On the other hand, Ethereum and multi-asset products registered $18.9 million and $2.6 million in outflows, respectively, to offset some of the inflows registered by Bitcoin.  Inflows of $6.1 million, $0.2 million, $0.3 million, $1.1 million, and $2.4 million were recorded for Solana, Litecoin, XRP, and Polkadot, respectively. Polkadot also registered an inflow of $2.4 million. Short Bitcoin products, on the other hand, witnessed outflows of $2 million.  Source: CoinShares Buying Opportunity For Bitcoin? Bitcoin&#8217;s price surge for the past few months has largely been due to action surrounding Spot Bitcoin ETFs. Interestingly, last week&#8217;s inflow activity saw Bitcoin breaking into the $70,000 price territory multiple times last week. This bullish momentum wasn&#8217;t sustained, allowing the bears to create a resistance at around $71,000. Related Reading: Hedge Fund Manager Predicts When Bitcoin Price Will Reach $150,000 Nevertheless, the inflow indicates something bullish might be brewing behind the scenes. Fundamentals surrounding the crypto point to a bullish price action throughout April, particularly as the next halving approaches. Bitcoin went through bearish price action over the weekend, correcting by almost 7% from $71,285. At the time of writing, Bitcoin has broken below a support at $68,500 and is now trading at $66,510. According to Santiment, the price dip has given crypto traders a sense of buying opportunity with calls of &#8220;buy and bullish&#8221; spiking across social media. Total market cap rises toward $2.4 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com Featured image from Mint, chart from Tradingview.com"
  }
]