[
  {
    "source": "Cointelegraph",
    "date": "2024-03-30T07:28:18.000Z",
    "title": " Crypto hacking incidents decline in Q1 2024— Immunefi ",
    "url": "https://cointelegraph.com/news/crypto-hacking-incidents-decline-in-q1-2024-immunefi",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZDA2OTQyMmUtMDA3NC00OTI2LWE1YTYtOTgyMzUxZDUzNzgxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>While some applaud this move toward mainstream adoption, privacy-centric Bitcoin supporters raise concerns about centralized data aggregation.</p>\n                    <p><p>In the first quarter of this year, the cryptocurrency industry saw a notable decline in losses due to hacking, with a significant drop of 23.1% compared to the previous year, according to a March. 28 research report by blockchain security firm Immunefi.</p><p>According to the<a href=\"https://downloads.ctfassets.net/t3wqy70tc3bv/34mVQUo6KAMcKF7rHyRdNM/d6c8710283abad55ec786c56f94eb3d1/Immunefi__Crypto_Losses_in_Q1_2024.pdf\" target=\"_blank\" rel=\"noopener nofollow\"> report</a>, the total amount lost to hacking incidents in Q1 of 2024 amounted to approximately $336.3 million. However, the $336.3 million in losses represents a 23.1% decrease compared to losses of $437.5 million in the same quarter last year. </p><p>According to Immunefi’s research, the cryptocurrency space encountered 46 hacking incidents and 15 cases of fraudulent activities in the first quarter of 2024, leading to losses surpassing $321 million. </p><p><a href=\"https://cointelegraph.com/news/crypto-hacking-incidents-decline-in-q1-2024-immunefi\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-30T07:38:59.000Z",
    "title": "PEPE Price Prediction: Will Pepe Coin Dominate Dogecoin And Shiba Inu In 2024?",
    "url": "https://www.cryptopolitan.com/pepe-price-prediction/",
    "description": "PEPE Price Predictions 2024-2033 Meme coins are renowned in the cryptocurrency market for boosting investor morale, particularly during periods of market turbulence or stagnation. For enthusiasts of meme coins, the newly-introduced &#8220;PEPE&#8221; coin is one not to be overlooked. It has established a remarkable benchmark, experiencing an extraordinary surge of nearly 7,000% since its debut [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-30T07:32:45.000Z",
    "title": "Hong Kong to Expand Surveillance Camera Network Amidst Privacy Concerns",
    "url": "https://www.cryptopolitan.com/hong-kong-to-expand-surveillance-camera/",
    "description": "In response to rising crime rates, the Hong Kong police have unveiled plans to bolster the city&#8217;s surveillance infrastructure by installing 615 new cameras. This move, announced in February 2024, targets areas with high crime figures and pedestrian traffic. Moreover, integrating artificial intelligence (AI) capabilities into these surveillance systems is possible, marking a significant technological [&#8230;]"
  }
]