[
  {
    "source": "Cointelegraph",
    "date": "2023-08-09T19:00:00.000Z",
    "title": "NFT gas usage drops, Ordinals nonprofit launches: Nifty Newsletter",
    "url": "https://cointelegraph.com/news/nft-gas-usage-drops-bitcoin-ordinals-nonprofit-launches-nft-newsletter",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/0f4b1baa-0ae5-4910-9077-414815f933d7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>An NFT trader who noticed a bot was copying his trades tricked the bot out of 800 ETH, worth around $1.5 million.</p>\n                    <p><p>In this week’s newsletter, read about how the team behind Bitcoin Ordinals plans to drive the development of <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a> on Bitcoin and find out why metaverse platform The Sandbox requires Know Your Customer (KYC) checks for staking. In other news, learn why NFT gas usage is on a downward trend, and don’t forget this week’s Nifty News, featuring an NFT trader tricking a bot and bagging $1.5 million in profit. </p><h2>Bitcoin Ordinals team launches nonprofit to grow protocol development</h2><p>The team behind Bitcoin Ordinals has launched a nonprofit aiming to boost the development of NFTs on Bitcoin. Dubbed the Open Ordinals Institute, the nonprofit will provide funding for Ordinals developers. </p><p>The Bitcoin Ordinals protocol was launched in January, and it rapidly became one of the most popular trends in crypto. Users rushed to inscribe their assets like NFTs and Bitcoin-based crypto on the Bitcoin blockchain. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-ordinals-non-profit-open-ordinals-institute\"><strong>Continue reading</strong></a></p><h2>NFT gas usage shows downward trend, signals shift in landscape</h2><p>NFT gas usage continues on a downward trend. On Aug. 3, gas consumption of NFT marketplaces like Blur, OpenSea, SuperRare, LooksRare and Rarible only accounted for 1.85% of the total consumption on the entire Ethereum network. </p><p>Moreover, NFT-related projects that were once top gas users on the Etherscan charts are now not listed. This indicates a potential shift in NFT use, where users may be holding their NFTs instead of actively trading. </p><p><a href=\"https://cointelegraph.com/news/nft-gas-usage-shows-downward-trend-signals-shift-in-landscape\"><strong>Continue reading</strong></a></p><h2>The Sandbox implements KYC measures for protocol staking</h2><p>Metaverse project The Sandbox will implement a KYC verification protocol for staking. According to an announcement, only KYC-verified uscane to deposit The Sandbox (<a href=\"https://cointelegraph.com/the-sandbox-sand-price-index\">SAND</a>) tokens and claim staking rewards. </p><p>On-chain analytics firm Messari’s data shows that 6.7% of SAND’s circulating supply — about 123 million tokens — is currently staked by users. According to the metaverse platform, the move aims to enhance user security and compliance. </p><p><a href=\"https://cointelegraph.com/news/the-sandbox-implements-kyc-measures-protocol-staking\"><strong>Continue reading</strong></a></p><h2>Nifty News: Trader nabs 800 ETH by baiting a bot, NFT thefts slow and more</h2><p>NFT trader Hanwe Chang tricked a bot into copying his trades, resulting in a profit of 800 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), worth around $1.5 million. The NFT trader noticed that the bot was copying his bids. Because of this, the trader tricked the bot into buying his inflated NFTs. </p><p><a href=\"https://cointelegraph.com/news/trader-baits-bot-july-nft-volume-drops-nifty-news\"><strong>Continue reading</strong></a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-01/43adc850-7dbd-4fa8-811b-9eb32b6c1983.jpg\"  alt=\"\"  title=\"NFT gas usage drops, Ordinals nonprofit launches: Nifty Newsletter\"  /></figure><p class=\"post-content__accent post-content__accent_big\">CHECK OUT COINTELEGRAPH’S NFT STEEZ PODCAST</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-09T19:00:00.000Z",
    "title": "Worldcoin controversy explained in latest Cointelegraph Report  ",
    "url": "https://cointelegraph.com/news/worldcoin-controversy-explained-in-latest-cointelegraph-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/d194763f-ffda-4947-bfa4-5b1ace698473.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In the latest Cointelegraph Report, we analyzed the privacy and ethical concerns around Worldcoin, currently among the most controversial cryptocurrency projects, and assessed its potential to disrupt the AI era. </p>\n                    <p><p>Worldcoin, an ambitious but also controversial cryptocurrency project, has been making headlines since its launch last month. The project collects people’s biometric data by scanning their eyeballs via a metallic orb. Its goal is to create a proof-of-personhood system that allows it to distinguish robots from humans in the budding era of AI. </p><p>But the project has raised numerous concerns among regulators and privacy advocates around the world due to an alleged lack of transparency regarding the methods the organization is using to collect people’s data. </p><p>A single company gathering millions of people data can potentially create a data privacy threat. </p><p>Moreover, some investigative reporters shed light on unethical and deceptive methods used by the organization to collect people’s data in the Global South. In particular, the organization has been giving out its native token, WLD, as an incentive to sign up, allegedly using \"deceptive marketing techniques\". </p><p>Currently, the token has no real use case and it is largely a speculative instrument on the future success of the Worldcoin project. </p><p>In our latest Cointelegraph report, we broke down how Worldocin works and tried to figure out how grounded are the concerns around it. </p><p>Watch our <a href=\" https://youtu.be/j9KkDxJsogE\" target=\"_blank\" rel=\"noopener nofollow\">full report</a> on Cointelegraph YouTube channel and don’f forget to subscribe! </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/j9KkDxJsogE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-09T18:59:24.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting the Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>The $100 million-plus hack of Multichain has caused another Fantom project to shutter its doors. Russia will begin testing its in-house CBDC, the digital ruble, on Aug. 15 in partnership with 13 local banks. Meanwhile, BlackRock insiders say a spot Bitcoin (BTC) exchange-traded fund (ETF) could land before February, according to Galaxy Digital CEO Mike Novogratz.</p><h2>Multichain exploit claims another Fantom project</h2><p>The recent <a href=\"https://cointelegraph.com/news/multichain-stops-operations-over-lack-of-funds\">exploit of cross-chain protocol Multichain</a> has left another Fantom project dead in its wake — SpiritSwap confirmed on Aug. 9 that it would begin winding down operations on Sept. 1.</p><p>SpiritSwap, a decentralized exchange built on Fantom, revealed on Discord that the <a href=\"https://cointelegraph.com/news/spiritswap-fantom-project-winds-down-citing-multichain-exposure\">Multichain hack drained its treasury</a>, leaving it unable to finance its operations. Without treasury funds, the DEX can no longer maintain operations, salaries or marketing. Developers wrote on Discord that SpiritSwap is looking for “a team to take over” the DEX beginning next month.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">End of an era as <a href=\"https://twitter.com/Spirit_Swap?ref_src=twsrc%5Etfw\">@Spirit_Swap</a> calls it quits; the very first place I landed on <a href=\"https://twitter.com/hashtag/Fantom?src=hash&amp;ref_src=twsrc%5Etfw\">#Fantom</a> 828 days ago <br><br>They&#39;re looking for a team to hand things to; otherwise operations will cease on September 1; a guide to help users withdraw <a href=\"https://twitter.com/search?q=%24SPIRIT&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$SPIRIT</a> dregs as they unlock will be developed  <a href=\"https://t.co/Syu2wqNlAY\">pic.twitter.com/Syu2wqNlAY</a></p>&mdash; The Fantom Ecologist  (@ftm_ecologist) <a href=\"https://twitter.com/ftm_ecologist/status/1689070014446673924?ref_src=twsrc%5Etfw\">August 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In July, Fantom-based crypto lender Geist Finance said it would be <a href=\"https://cointelegraph.com/news/fantom-based-lender-geist-finance-shuts-down-permanently-over-multichain-hack\">shutting down permanently</a> following the Multichain hack. </p><p>Fantom’s total value locked, or TVL, has plunged from $364 million in May to $72 million in August. </p><h2>Russia to begin CBDC trials with 13 banks</h2><p>The Bank of Russia (BoR) announced that it will begin testing operations for its in-house central bank digital currency (CBDC) project with digital rubles. The test will begin on August 15. </p><p>A statement released by the Bank of Russia indicates that the pilot tests will involve the participation of 13 banks and a restricted group of their clients.</p><p>The initial phase of the pilot program will focus on refining fundamental processes, including the establishment and funding of digital ruble accounts (digital wallets), digital ruble transactions among individuals, uncomplicated automated payments, and the utilization of a QR code for transactions involving purchases and services.</p><h2>Novogratz says Bitcoin ETF 6 months away, citing insiders</h2><p>A spot Bitcoin ETF in the U.S. could be live <a href=\"https://cointelegraph.com/news/blackrock-insiders-bitcoin-etf-within-six-months-galaxy-novogratz\">in the next six months</a> according to Galaxy Digital chief <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/mike-novogratz#:~:text=Mike%20Novogratz%3A%20Founder%20and%20CEO,48%20%7C%20The%20Cointelegraph%20Top%20100&amp;text=%E2%80%9COver%20the%20next%20decade%2C%20Web3,our%20physical%20and%20digital%20realities.%E2%80%9D\">Mike Novogratz</a> citing sources at asset managers BlackRock and Invesco.</p><p>On Galaxy’s Aug. 8 Q2 earnings call, Novogratz said its contacts from Invesco and BlackRock \"get you to think that this is a question of when, not if — that the outside window is probably six months.\"</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">According to &quot;contacts&quot; from inside BlackRock and Invesco spot Bitcoin ETF approval a matter of &quot;when, not if&quot; likely in &quot;four to six months&quot; -- Galaxy CEO Mike Novogratz on earnings call this morning <a href=\"https://t.co/TIhHC7xnHI\">pic.twitter.com/TIhHC7xnHI</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1688916620473946114?ref_src=twsrc%5Etfw\">August 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“This is probably [...] four to six months if you had to put a ‘pin the tail on the donkey’ on it, that the SEC is going to approve a Bitcoin ETF,” Novogratz added.</p><p>Novogratz didn’t have a comment on the expected timing of Galaxy's ETF approval, which is sitting with the Securities and Exchange Commission.</p><p>He said, however, that once a spot Bitcoin ETF is approved, issuers will be fighting for market share. </p><blockquote>“The  news of both BlackRock filing ETF and quite frankly, Invesco Plus Galaxy, we're going to fight like cats and dogs to win market share there once it gets approved.”</blockquote><p>Other analysts think a wave of spot Bitcoin ETFs could come even sooner if Grayscale wins its case against the SEC, believing there could be simultaneous approvals for several or all currently pending spot Bitcoin ETFs.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-09T18:59:04.000Z",
    "title": "Price analysis 8/9: BTC, ETH, BNB, XRP, DOGE, ADA, SOL, MATIC, LTC, DOT",
    "url": "https://cointelegraph.com/news/price-analysis-8-9-btc-eth-bnb-xrp-doge-ada-sol-matic-ltc-dot",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/9f5acce2-fa44-40af-9d5f-e1e5b655f71a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin's sharp recovery to $30,000 proves that bulls are buying BTC and altcoins at lower support levels.</p>\n                    <p><p>Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) rebound off $28,701 on Aug. 7 shows that lower levels continue to attract buyers. The recovery has kept the price stuck inside the range as traders await the start of a new trending move. A recent report by ARK Invest said that “Bitcoin’s volatility dropped to a 6-year low during July.” </p><p>Traders who expected a strong move in either direction have been disappointed by the <a href=\"https://cointelegraph.com/news/btc-bitcoin-price-trade-wait-october\">ongoing range-bound action in August</a>. If history repeats itself, then August and September may turn out to be washout months as their average moves have been 0.73% and -5.01% respectively.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/d5aef8bd-f32a-4cba-9682-e7406f6e05bf.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>Although the short-term is uncertain, the long-term continues to look attractive. Galaxy Digital CEO Mike Novogratz, citing sources at BlackRock and Invesco, said that the first spot Bitcoin exchange-traded fund in the United States may be <a href=\"https://cointelegraph.com/news/blackrock-insiders-bitcoin-etf-within-six-months-galaxy-novogratz\">approved by the Securities and Exchange Commission</a> in “four to six months.”</p><p>Such a move is expected to be hugely positive for the crypto space. In the meantime, let’s look at the important resistance levels to watch out for in Bitcoin and altcoins. Could bulls overcome the roadblock? Let’s study the charts of the top-10 cryptocurrencies to find out.</p><h2>Bitcoin price analysis</h2><p>Bitcoin’s strong relief rally from the $28,861 support shows that the bulls have not yet given up and they continue to view the dips as a buying opportunity.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/7c2218f5-6da5-4e59-bcf8-8d4acea5cd05.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The BTC/USDT pair rose above the 20-day exponential moving average ($29,455) on Aug. 8 and the bulls are trying to build upon the momentum by pushing the price above the 50-day simple moving average ($29,981). If they manage to do that, the pair could pick up momentum and soar toward the overhead resistance zone between $31,804 and $32,400.</p><p>Contrarily, if the price turns down and skids below the 20-day EMA, it will suggest that the bears continue to sell on rallies. That could keep the pair stuck inside a tight range between $28,500 and $30,500 for a few days.</p><h2>Ether price analysis</h2><p>Buyers purchased the dip below the $1,816 support in Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) on Aug. 7 and followed that up with another strong move on Aug. 8.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b0eebbd0-b3d3-46aa-a3e9-349270c1154e.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AETHUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls are facing resistance at the 50-day SMA ($1,881) but a minor positive is that they are trying to hold the 20-day EMA. The flattening 20-day EMA and the RSI near the midpoint suggest that the bears are losing their grip.</p><p>If buyers drive the price above the 50-day SMA, the ETH/USDT pair could rally to $1,930 and eventually to the psychologically important level of $2,000. The bulls will have to surmount this level to start the next leg of the up-move.</p><p>The advantage could tilt in favor of the bears if they yank the price below the crucial short-term support at $1,800.</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) turned up from the moving averages and reached the resistance line of the symmetrical triangle pattern on Aug. 8.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/67b672ad-0aad-44f0-88a2-a6d2c4eab64a.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABNBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears are trying to defend the resistance line but if bulls do not allow the price to slide back below the moving averages, it will increase the possibility of an upside breakout. The BNB/USDT pair could first climb to $265 and then make a dash to the pattern target of $288.</p><p>On the contrary, if the price turns down and skids below the moving averages, it will suggest that the pair may extend its stay inside the triangle for some more time. A break below the triangle could tilt the advantage in favor of the bears. The pair could then decline to $220</p><h2>XRP price analysis</h2><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) reversed direction from the 50-day SMA ($0.60) on Aug. 7 and reached the 20-day EMA ($0.66) on Aug. 9.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/7db49840-8a1c-4ddd-b64d-997b60455092.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AXRPUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If the price turns down from the current level, it will suggest that the sentiment has turned negative and traders are selling on rallies. That will enhance the prospects of a fall to the breakout level of $0.56.</p><p>On the other hand, if the price rises above the 20-day EMA, it will suggest that bulls are attempting a comeback. The XRP/USDT pair could then rise to $0.73, which may prove to be a tough hurdle to cross.</p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) snapped back from the support line of the ascending channel on Aug. 7, indicating that bulls continue to buy on dips.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b4c60535-611a-454c-984e-01eb92723442.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOGEUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Buyers propelled the price above the 20-day EMA ($0.07), clearing the path for a possible rally to $0.08. This level may prove to be a difficult obstacle but if the bulls surpass it, the DOGE/USDT pair could reach the resistance line of the channel.</p><p>This positive view will invalidate in the near term if the price turns down from the current level or the overhead resistance and plunges below the channel. That could sink the pair to $0.07. This is an important level to keep an eye on because if it cracks, the pair may slump to $0.06.</p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) turned up from $0.28 on Aug. 7, indicating buying at lower levels. The price has reached the moving averages, which is just below the downtrend line.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/8ff6ed91-6505-468b-9e07-13a24302ad51.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AADAUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears are likely to guard the downtrend line with vigor. If the price turns down from this level, the ADA/USDT pair could retest the support at $0.28. A break and close below this level could pull the pair to $0.26 and then to $0.24.</p><p>Contrary to this assumption, if bulls clear the overhead hurdle the pair could rally to $0.34. This level may again prove to be a barrier but if bulls overcome it, the pair could reach the overhead resistance at $0.38.</p><h2>Solana price analysis</h2><p>The bulls successfully held the support at $22.30 indicating demand at lower levels. Buyers shoved Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) above the 20-day EMA ($23.71) on Aug. 8, signaling a comeback.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/9abe52ca-90a7-4c47-81a0-a1ef0d4b23f5.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASOLUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The flattish 20-day EMA and the RSI in the positive territory indicate a minor advantage to the bulls. The SOL/USDT pair could rise to $25.68 and then to the stiff overhead resistance of $27.12. Sellers may pose a strong challenge at this level.</p><p>If the price turns down from the overhead resistance, it will suggest that the pair may consolidate between $27.12 and $22.30 for some time. The bears will gain the upper hand if they tug the price below $22.30.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/why-is-shiba-inu-price-up-today\"><strong><em>Why is Shiba Inu price up today?</em></strong></a></p><h2>Polygon price analysis</h2><p>Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) bounced off the strong support at $0.64 and reached the moving averages where the bears are expected to mount a strong defense.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/c57034a2-dabc-4287-a79c-3cf1d0583638.png\"  /><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AMATICUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If the price turns down from the moving averages, the MATIC/USDT pair could once again drop to $0.64. A bounce off this level could keep the pair range-bound between $0.64 and the moving averages for some time. The flattish moving averages and the RSI just below the midpoint also suggest a range-bound action.</p><p>On the contrary, if bulls drive the price above the moving averages, it will suggest the start of a stronger recovery to $0.74 and then to $0.80.</p><h2>Litecoin price analysis</h2><p>The bears tried to sink Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) below the support at $81.36 on Aug. 7, but the long tail on the candlestick shows strong demand at lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/c8d7baf1-41bb-464f-bda5-a66b2abd010d.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>LTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ALTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls are trying to start a recovery which is likely to face strong selling near the 20-day EMA ($87). If the price turns down from this level, it will suggest that the sentiment remains negative and traders are selling on rallies. The bears will then make one more attempt to sink the LTC/USDT pair below $81.36.</p><p>If bulls want to make a comeback, they will have to kick the price above the 20-day EMA. If they succeed, it could open the doors for a possible rise to the 50-day SMA ($92) and later to $96.46.</p><h2>Polkadot price analysis</h2><p>Polkadot (<a href=\"https://cointelegraph.com/polkadot-price-index\">DOT</a>) has been trading between $5 and $5.65 for many days. Efforts to push the price above and below the range have been unsuccessful, indicating that bulls are buying the dips and bears are selling on rallies.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f6505963-53a4-4e42-98b1-76d87c4f98a1.png\"  /><figcaption style=\"text-align: center;\"><em>DOT/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOTUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls are trying to push the price above the moving averages but are facing stiff resistance from the bears. If the price turns down from the moving averages, it will increase the likelihood of a break below $4.83. If that happens, the DOT/USDT pair could descend to $4.60.</p><p>Alternatively, if bulls propel the price above the moving averages, it will suggest that the range remains intact. The pair could rise to $5.33 and subsequently to the overhead resistance at $5.64.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-09T18:45:00.000Z",
    "title": "How short-term holders keep Bitcoin price stable but constrained",
    "url": "https://cryptoslate.com/short-term-holders-kept-bitcoins-price-stable-but-constrained/",
    "description": "<p>Bitcoin has maintained a tight trading range between $28,000 and $30,000 since April 2023, a prolonged sideways movement that has been a rarity in the market. One of the reasons for this squeezed price range, especially after BTC dropped below $30,000, is price support created by short-term holders. Short-term holders are entities that have held [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/short-term-holders-kept-bitcoins-price-stable-but-constrained/\">How short-term holders keep Bitcoin price stable but constrained</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T18:54:59.000Z",
    "title": "Is Google, Universal Music Group Co-Producing Controversial Deepfake Music?",
    "url": "https://www.cryptopolitan.com/google-universal-co-producing-deepfake-music/",
    "description": "In a significant development at the nexus of technology and music, Google and Universal Music Group are reportedly engaged in discussions to obtain licenses for artists&#8217; vocal recordings and musical melodies to create AI-generated songs. This step into the world of &#8220;deepfake music&#8221;, where AI replicates artists&#8217; voices and generates compositions, marks a compelling yet ... <a title=\"Is Google, Universal Music Group Co-Producing Controversial Deepfake Music?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/google-universal-co-producing-deepfake-music/\" aria-label=\"More on Is Google, Universal Music Group Co-Producing Controversial Deepfake Music?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T18:42:34.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-09T19:01:28.000Z",
    "title": "Aptos, Microsoft partner to fuse AI with blockchain",
    "url": "https://crypto.news/aptos-microsoft-partner-to-fuse-ai-with-blockchain/",
    "description": "Aptos Labs has partnered with Microsoft to integrate AI capabilities with blockchain technology"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-09T19:00:18.000Z",
    "title": "Billionaire Investor Wishes He Bought Bitcoin Early On, Here’s Why",
    "url": "https://www.newsbtc.com/bitcoin-news/billionaire-wishes-he-bought-bitcoin-early/",
    "description": "As Bitcoin continues to enjoy more mass adoption, many have regretted their decision not to get in earlier on the flagship cryptocurrency. Co-founder of private investment firm The Carlyle Group David Rubenstein joins this long list of individuals as he wishes he had bought BTC early on.  Bitcoin Is Here To Stay Speaking on Bloomberg Television on August 8, Rubenstein said he wished he had bought Bitcoin when one BTC was worth $100. The statement stems from the fact that the billionaire believes BTC is here to stay, following “enormous interest” in the cryptocurrency.   Related Reading: ARK Invest’s CEO Says SEC Could Approve Multiple Spot Bitcoin ETFs Simultaneously He explained that Bitcoin’s decentralization is key to this interest as people want a form of money that governments can’t control. According to him: There’s enormous interest around the world, and to be able to have something you can transfer without having the government knowing about it, and keep it private. You can say people shouldn’t do that, but that’s not going to stop people from doing it. BTC price rocks up to $29,873 &#124; Source: BTCUSD on Tradingview.com BlackRock Is Key To All Of It Rubenstein also noted that people who once mocked BTC and other cryptocurrencies might begin to have second thoughts following BlackRock’s application for a Spot Bitcoin exchange-traded fund (ETF). “What’s happened is people made fun of bitcoin and other cryptocurrencies, but now the establishment, Larry Fink at BlackRock, is now saying they’re going to have an ETF if approved by the government in bitcoin,” Rubenstein told Bloomberg. “So you’re saying wait a second, the mighty BlackRock is willing to have an ETF in bitcoin, maybe bitcoin is going to be around for a while.” The billionaire investor’s sentiments echo that of Galaxy Digital CEO Mike Novogratz, who mentioned, during an interview on Bloomberg TV with David Rubenstein, that BlackRock’s CEO Larry Fink’s change of heart was the “most important thing that happened this year in Bitcoin.” “He [Larry Fink] got ‘orange-pilled. Larry was a nonbeliever. Now he says, ‘Hey, this is going to be a global currency.’ People around the world all trust it,” he said. Larry, who had once referred to BTC as “an index of money laundering,” said in a July 5 interview with Fox Business that Bitcoin could revolutionize the financial industry as it could be used as a hedge against inflation instead of traditional gold.  Related Reading: Can PayPal’s PYUSD Be Frozen In Your Wallet Like Tether’s USDT? There is no denying the influence that BlackRock and its CEO Larry Fink could have on BTC adoption, especially among institutional investors. BlackRock is currently the largest asset manager with over $9.1 trillion in assets under management (AuM).  With such a large clientele base, the market could see more individual investors, companies, governments, and foundations invest in Bitcoin through BlackRock (when their spot Bitcoin ETF gets approved by the SEC).  Meanwhile, Larry Fink is a prominent figure on Wall Street and one who boasts tremendous influence in the financial world, and he will likely carry this influence into crypto. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-09T18:45:59.000Z",
    "title": "Circle CEO Jeremy Allaire Says Majority of USDC Adoption Comes From Outside the US",
    "url": "https://dailyhodl.com/2023/08/09/circle-ceo-jeremy-allaire-says-majority-of-usdc-adoption-comes-from-outside-the-us/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/usdc-adoption-comes.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/usdc-adoption-comes.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/usdc-adoption-comes.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/usdc-adoption-comes.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/usdc-adoption-comes.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/usdc-adoption-comes.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/usdc-adoption-comes.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Circle CEO Jeremy Allaire says that non-US markets are driving the adoption of Circle&#8217;s dollar-pegged stablecoin USD Coin (USDC). Allaire says there&#8217;s a large international demand for &#8220;safe, transparent digital dollars.&#8221; &#8220;Despite the hype that we&#8217;re all about the US, we estimate that 70% of USDC adoption is non-US, and some of the fastest growing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/09/circle-ceo-jeremy-allaire-says-majority-of-usdc-adoption-comes-from-outside-the-us/\">Circle CEO Jeremy Allaire Says Majority of USDC Adoption Comes From Outside the US</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-09T18:41:44.000Z",
    "title": "Solana Rival Aptos (APT) Partners With Microsoft To Work on Aritificial Intelligence and Web3: Report",
    "url": "https://dailyhodl.com/2023/08/09/solana-rival-aptos-apt-partners-with-microsoft-to-work-on-aritificial-intelligence-and-web3-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Aptos-Is-Grossly-Overvalued.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Aptos-Is-Grossly-Overvalued.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Aptos-Is-Grossly-Overvalued.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Aptos-Is-Grossly-Overvalued.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Aptos-Is-Grossly-Overvalued.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Aptos-Is-Grossly-Overvalued.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Aptos-Is-Grossly-Overvalued.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Solana (SOL) rival Aptos (APT) is reportedly partnering with tech giant Microsoft on a new push into artificial intelligence (AI) and web3 projects. According to a new TechCrunch report, Aptos Labs will integrate its blockchain technology with Microsoft’s Azure OpenAI Service to quicken web3 adoption. Says Mo Shaikh, co-founder of Aptos Labs, “The primary focus [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/09/solana-rival-aptos-apt-partners-with-microsoft-to-work-on-aritificial-intelligence-and-web3-report/\">Solana Rival Aptos (APT) Partners With Microsoft To Work on Aritificial Intelligence and Web3: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]