[
  {
    "source": "CoinDesk",
    "date": "2023-11-15T01:18:56.000Z",
    "title": "India's Supreme Court Turns Away Petition Asking Government to Frame Crypto Guidelines",
    "url": "https://www.coindesk.com/policy/2023/11/15/indias-supreme-court-turns-away-petition-asking-government-to-frame-crypto-guidelines/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "India's Supreme Court has turned away a petition that sought to direct the government and relevant authorities to frame guidelines for regulating the trading and mining of cryptocurrencies."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-15T01:12:18.000Z",
    "title": "Creator of Mutant Ape ripoff NFTs pleads guilty to $3M fraud scheme",
    "url": "http://cointelegraph.com/news/mutant-ape-planet-nft-creator-pleads-guilty-fraud",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/4fd38068-e619-4455-a3bd-794cdacffae5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The French developer of the Mutant Ape Planet NFT collection faces up to five years in prison after pleading guilty to wire fraud charges.</p>\n                    <p><p>The creator of the Mutant Ape Planet nonfungible token (NFT) collection — a knock-off of Yuga Labs’ Mutant Ape Yacht Club project — has pleaded guilty to conspiracy to commit wire fraud in a New York federal court.</p><p>In a Nov. 14 <a href=\"https://www.justice.gov/usao-edny/pr/nonfungible-token-nft-developer-pleads-guilty-international-scheme-defraud-nft\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, the U.S. Attorney’s Office for the Eastern District of New York said French national Aurelien Michel pleaded guilty to executing a “rug pull” and admitted to defrauding investors out of $3 million in connection with the fraudulent Mutant Ape Planet NFTs.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Nonfungible Token (NFT) Developer Pleads Guilty to an International Scheme to Defraud NFT Purchasers <br><br>Aurelien Michel Conspired to Steal From Purchasers of “Mutant Ape Planet” NFTs Through False Promises and Misrepresentations<a href=\"https://twitter.com/HSINewYork?ref_src=twsrc%5Etfw\">@HSINewYork</a> <a href=\"https://twitter.com/IRSCI_NY?ref_src=twsrc%5Etfw\">@IRSCI_NY</a> <a href=\"https://t.co/K3CzIb8dQD\">https://t.co/K3CzIb8dQD</a></p>&mdash; US Attorney EDNY (@EDNYnews) <a href=\"https://twitter.com/EDNYnews/status/1724486706710077706?ref_src=twsrc%5Etfw\">November 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to Department of Justice (DOJ) prosecutors, Michel and his co-conspirators marketed the NFTs to investors by falsely promising them rewards and benefits designed to increase the demand for the collection.</p><p>Prosecutors said Michel and his associates “intentionally failed to deliver on these promises, diverting millions of dollars’ worth of proceeds for their personal benefit.”</p><p>“While Michel purported to sell dream NFTs backed with rewards and benefits, he defrauded investors, turning their dream into a nightmare of deception and losses,” said Thomas M. Fattorusso, special agent in charge of IRS criminal investigation in New York.</p><blockquote>“There is no excusing this kind of greed, and today’s guilty plea brings Michel one step closer to realizing his own nightmare — behind bars.”</blockquote><p>Michel <a href=\"https://cointelegraph.com/news/mutant-ape-planet-creator-arrested-in-ny-for-alleged-2-9m-nft-fraud\">was arrested</a> in New York on Jan. 4, 2023, on charges related to the scheme. The DOJ <a href=\"https://www.justice.gov/usao-edny/pr/non-fungible-token-nft-developer-charged-multi-million-dollar-international-fraud\" target=\"_blank\" rel=\"noopener nofollow\">said</a> on Jan. 5 that Michel admitted to the NFT collection’s community via a social media chat that he perpetrated a rug pull and said “we never intended to rug but the community went way too toxic.”</p><p>Upon sentencing, Michel faces a maximum sentence of five years in prison and has agreed to pay $1.4 million in restitution. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/onecoin-cryptoqueen-legal-chief-pleads-guilty-fraud-money-laundering\"><strong><em>Cryptoqueen’s OneCoin legal chief pleads guilty to fraud</em></strong></a></p><p>The Mutant Ape Planet collection — which has since been <a href=\"https://opensea.io/collection/mutant-ape-planet/activity\" target=\"_blank\" rel=\"noopener nofollow\">removed</a> from the NFT platform OpenSea — once consisted of 6,797 NFTs minted on the Ethereum blockchain.</p><p>In February 2022, it boasted more than 320 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) in sales volume, which dropped significantly by April 2022, two months later. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/3d263c66-1897-4272-9e42-5308cc036009.png\"  /><figcaption style=\"text-align: center;\"><em>Sales of the Mutant Ape Planet NFT collection between Jan. 2022 to Jan. 2023. Source: OpenSea</em></figcaption></figure><p>By January 2023, around the time of Michel’s arrest, the average price and total sales volume of the collection had cratered to near zero.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/i-spent-a-week-working-in-vr-it-was-mostly-terrible-however/\"><strong><em>I spent a week working in VR. It was mostly terrible, however…</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-15T01:22:57.000Z",
    "title": "Sora Ventures invests in Fhenix, fuels first confidential blockchain using homomorphic encryption",
    "url": "https://cryptoslate.com/sora-ventures-invests-in-fhenix-fuels-first-confidential-blockchain-using-homomorphic-encryption/",
    "description": "<p>Sora Ventures has joined a consortium of investors in a $7 million funding round for Fhenix. This significant investment supports the development of the Fhenix Network, poised to be the first confidential blockchain platform leveraging fully homomorphic encryption (FHE) within the Ethereum ecosystem. Jason Fang, the Founder of Sora Ventures, expressed his enthusiasm for the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sora-ventures-invests-in-fhenix-fuels-first-confidential-blockchain-using-homomorphic-encryption/\">Sora Ventures invests in Fhenix, fuels first confidential blockchain using homomorphic encryption</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  }
]