[
  {
    "source": "Decrypt",
    "date": "2023-07-15T14:48:20.000Z",
    "title": "'Space Mermaids' Is an Addictive Arcade-Style Game on XRP With NFT Rewards",
    "url": "https://decrypt.co/148677/space-mermaids-addictive-arcade-style-game-xrp-rewards",
    "description": "PREVIEW: Players must dodge asteroids and collect stars as a pixelated mermaid in Space Mermaids, a retro-style game built on XRP."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-15T15:00:00.000Z",
    "title": "Project roadmap or token price — Which is most important?",
    "url": "https://cointelegraph.com/news/project-roadmap-or-token-price-which-is-most-important",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/29f7e696-afca-442e-a585-a808705d980a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Content creator KryptosChain explains why a project’s roadmap and token price are important to its success, as well as the upgrades to the Polkadot ecosystem that excite him most.</p>\n                    <p><p>In the latest episode of <em>Market Talks</em>, show host and Cointelegraph head of markets Ray Salmond sat down with Polkadot ambassador and content creator KryptosChain to discuss the current state of the crypto market and drastic <a href=\"https://youtu.be/etq6rOhVUfU\" target=\"_blank\" rel=\"noopener nofollow\">changes taking place in the Polkadot ecosystem</a>. </p><p>According to KryptosChain, the crypto market is possibly rounding the last corner of the bear market, and across the space, sentiment and money flow are steadily beginning to improve.</p><blockquote>“Overall, I do think the market sentiment right now is hype-driven, but hopefully, we can change that with enterprise adoption and through the eventual approval of a spot Bitcoin ETF” </blockquote><p>He added that, “In my opinion, I think the Bitcoin halving next year will be the main driver for the start of a new bull market, because of its history, and people base the markets’ performance on the history and psychology around it. I think 2024, toward the end — maybe summer or maybe autumn — is when we’re going to see some big activity.” </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/etq6rOhVUfU\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>When asked whether investors should believe in projects based on the team’s goals and aspirations, or simply the price of the token, KryptosChain suggested that:</p><blockquote>“It’s a mix from my point of view, and from what I’m seeing in the crypto community, a majority of people are in it only for the money, and then there are some people that are in it for the tech and the money, and there are very few, which are mostly the developers, who are only in it for the tech because they believe it can change the world and that Web3 is here to stay. From my point of view, as a content creator, both are important. The tech is important, but if you’re going to make an investment in it, you need to reap something from it, also. I believe it’s also important to look at who are the market makers behind a project.” </blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/forget-about-price-polkadot-decoded-2023-says-bear-markets-are-for-building\"><strong><em>Forget about price!</em></strong><strong><em> Polkadot</em></strong><strong><em> Decoded 2023 says bear markets are for building</em></strong></a></p><h2>A well-timed change is in order for Polkadot</h2><p>Regarding the recent developments in the Polkadot ecosystem and his views on the changes, KryptosChain was generally positive and excited about the project’s new direction. </p><p>“Polkadot is introducing so many technical updates to change things, to make the ecosystem truly interoperable, which is a big positive. Forkless upgrades and alterations to the Parachain auctions are also upcoming events which are quite exciting.” </p><p>To hear more about Ray and KryptosChain’s discussion at Polkadot Decoded 2023, listen to <em>Market Talks, </em>exclusively on the new <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research YouTube channel</a>.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/project-roadmap-or-token-price-which-is-most-important&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-15T14:58:09.000Z",
    "title": "Ark Invest adjusts investment strategy, reduces Coinbase stake amid regulatory landscape shifts",
    "url": "https://www.cryptopolitan.com/ark-invest-adjusts-investment-strategy-reduces-coinbase-stake-amid-regulatory-landscape-shifts/",
    "description": "Ark Invest, the renowned investment firm led by Cathie Wood, made additional sales of Coinbase shares on Friday amidst the stock&#8217;s continued rally. The move comes as Ripple&#8217;s legal developments at the hands of the Securities and Exchange Commission (SEC) contribute to Coinbase&#8217;s positive market performance. According to a recent update from Ark&#8217;s trading desk, ... <a title=\"Ark Invest adjusts investment strategy, reduces Coinbase stake amid regulatory landscape shifts\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ark-invest-adjusts-investment-strategy-reduces-coinbase-stake-amid-regulatory-landscape-shifts/\" aria-label=\"More on Ark Invest adjusts investment strategy, reduces Coinbase stake amid regulatory landscape shifts\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-15T14:55:22.000Z",
    "title": "Bored Ape Yacht Club (BAYC) NFT sells for over $1 Million – is the NFT frenzy back?",
    "url": "https://www.cryptopolitan.com/bored-ape-yacht-club-bayc-nft-sells-for-over-1-million-is-the-nft-frenzy-back/",
    "description": "The Bored Ape Yacht Club (BAYC) collection witnessed a momentous transaction recently. According to recent reports, bored Ape #1734, one of the NFTs from the collection, fetched an astounding price of 600 ETH, equivalent to over $1.2 million, on July 13. This remarkable sale has injected newfound optimism into the BAYC collection and the broader ... <a title=\"Bored Ape Yacht Club (BAYC) NFT sells for over $1 Million &#8211; is the NFT frenzy back?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bored-ape-yacht-club-bayc-nft-sells-for-over-1-million-is-the-nft-frenzy-back/\" aria-label=\"More on Bored Ape Yacht Club (BAYC) NFT sells for over $1 Million &#8211; is the NFT frenzy back?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-15T15:00:00.000Z",
    "title": "Undervalued ethereum competitor prompts shift in investor sentiment",
    "url": "https://crypto.news/undervalued-ethereum-competitor-prompts-shift-in-investor-sentiment/",
    "description": "InQubeta, an AI-based crowdfunding platform, is gaining attention as a potential competitor to ethereum (ETH), leading to a shift in investor sentiment. InQubeta introduces a crowdfunding platform that connects crypto investors with AI start-ups, creating a novel way for investors&#8230;"
  }
]