[
  {
    "source": "CoinDesk",
    "date": "2023-12-07T22:42:25.000Z",
    "title": "Ether, Solana Hit 19-Month Highs as Bitcoin Rally Halts with Traders Fearing 'Bull Trap'",
    "url": "https://www.coindesk.com/markets/2023/12/07/ether-solana-hit-19-month-highs-as-bitcoin-rally-halts-with-traders-fearing-bull-trap/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BitMex founder Arthur Hayes speculated about SOL hitting near $100 in a bullish weekend for altcoins."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-07T23:00:49.000Z",
    "title": "Shiba Inu Burn Rate Rises Rapidly In One Week, What’s Been Driving It?",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-burn-rate-rises-rapidly/",
    "description": "The rise in the Shiba Inu burn rate has no doubt been one of the most notable developments in the community. At the start of the week, the burn rate rose over 7,000,000% after more than 8 billion tokens were burned in a 24-hour period. This trend has not slowed down either given that the burn figures have continued to rise daily. Shiba Inu Burn Surge Continues Earlier in the week when the Shiba Inu burn saw one of its highest daily spikes, the total number of tokens burned had come out to just over 8 billion. At the time, this was a significant figure given that the burn rate had been slowing down over the last year. However, there has been a steady rise in the number of SHIB tokens that are being burned lately, which raises the question of what is driving the burn. Related Reading: Bitcoin Bullish Fractal Returns: Analyst Predicts Another Leg-Up With Price Target After a dip in the burn rate following the 8 billion daily burn, the community is back at it again and their zeal has been rewarded once more. On Thursday, the burn tracker Shibburn reported that the 24-hour figure had crossed 10 million once again. This shows a steady recovery from Wednesday’s figures which had tanked significantly. Source: Shibburn As Shibburn data shows, the 10.34 million SHIB that were burned in the last 24 hours amounts to an 803.4% increase in the burn rate compared to the previous day. The majority of the burns have, however, come from a single wallet address. The address sent a little over 10.2 million SHIB to the burn address. This recent spike in the BURN rate has also added to the total amount burned on a weekly basis. The figure comes out to 8.497 billion, which is a 1,969.72% increase from the previous week’s figures. SHIB bulls struggle to maintain control &#124; Source: SHIBUSD on Tradingview.com What Is Driving The SHIB Burn? The most significant burn for the week was the 8.2 billion burn, most of which came from a single address. This address was the ShibaSwap deployer wallet, which meant that the SHIB team was the one burning the tokens. Related Reading: 8 Green Candles: Here’s What Happened To Bitcoin The Last Time It Appeared The spike in the burn rate coincides with the increased usage of the Shiba Inu layer 2 blockchain Shibarium, which marked multiple milestones this week. As the usage has risen and more fees were collected on the network, the amount of SHIB to be burned rose drastically. Daily transactions on Shibarium have consistently come out above 7 million this week, bringing the total transactions on the network above 51 million. If this continues, then the burn rate could continue to rise as more usage of the L2 means more fees being burned. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from NewsBTC, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-07T23:01:15.000Z",
    "title": "Solana-Based DeFi Project Jito (JTO) To Kick Off Airdrop As Coinbase Announces Support for the Token",
    "url": "https://dailyhodl.com/2023/12/07/solana-based-defi-project-jito-jto-to-kick-off-airdrop-as-coinbase-announces-support-for-the-token/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/Coinbase-Executive-Explains-Why.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/Coinbase-Executive-Explains-Why.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/Coinbase-Executive-Explains-Why.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/Coinbase-Executive-Explains-Why.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/Coinbase-Executive-Explains-Why.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/Coinbase-Executive-Explains-Why.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/Coinbase-Executive-Explains-Why.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A decentralized finance (DeFi) project built over smart contract platform Solana (SOL) is gearing up to kick off an airdrop as Coinbase announces support for it. In a new thread on the social media platform X, DeFi protocol Jito (JTO) says it will be launching its first ever airdrop on December 7th, saying that eligible [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/07/solana-based-defi-project-jito-jto-to-kick-off-airdrop-as-coinbase-announces-support-for-the-token/\">Solana-Based DeFi Project Jito (JTO) To Kick Off Airdrop As Coinbase Announces Support for the Token</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]