[
  {
    "source": "CryptoSlate",
    "date": "2023-12-18T23:20:58.000Z",
    "title": "UK Treasury unveils sandbox rules for digital asset innovation",
    "url": "https://cryptoslate.com/uk-treasury-unveils-sandbox-regulations-for-digital-asset-innovation/",
    "description": "<p>Leaders of the UK Treasury laid a set of rules called Digital Securities Sandbox (DSS) regulations before parliament on Dec. 18. A related memo explains that these regulations aim to create a controlled environment. This allows companies and regulators to test new technology in financial markets, overcoming existing regulatory obstacles and potentially fostering innovation in [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/uk-treasury-unveils-sandbox-regulations-for-digital-asset-innovation/\">UK Treasury unveils sandbox rules for digital asset innovation</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T23:25:04.000Z",
    "title": "Rule changes at Helium Mobile address suspicious token farming activities",
    "url": "https://www.cryptopolitan.com/helium-mobile-address-token-farming/",
    "description": "Helium Mobile, the provider of a unique cryptocurrency-driven cell plan, is witnessing a surge in new subscribers amid the remarkable price increase of its native MOBILE token. Responding to concerns over suspicious account activities, the company has introduced rule modifications affecting the crypto rewards payout system. Adjustment to reward payout rules As of December 18, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T23:12:28.000Z",
    "title": "Worldcoin to restart operations in Kenya by early 2024",
    "url": "https://www.cryptopolitan.com/worldcoin-to-restart-operations-in-kenya/",
    "description": "Worldcoin, the cryptocurrency project known for using iris biometric technology, is reportedly on the verge of resuming its operations in Kenya. This development follows a period of regulatory scrutiny that led to suspending its activities in the country. According to recent reports, Worldcoin representatives have engaged in discussions with Kenyan authorities, leading to an agreement [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-18T23:25:41.000Z",
    "title": "Bitcoin Inscriptions Trigger Surge In Arbitrum Network Fees",
    "url": "https://nulltx.com/bitcoin-inscriptions-trigger-surge-in-arbitrum-network-fees/",
    "description": "The recent surge in Ordinals inscriptions, not limited to Bitcoin alone, has sent shockwaves through various blockchain networks, notably impacting Ethereum Virtual Machine (EVM) chains with a significant increase in gas spending during the weekend. Bitcoin&#8217;s inscription phenomenon has posed a unique set of challenges, and its repercussions have extended [&#8230;]"
  }
]