[
  {
    "source": "Cointelegraph",
    "date": "2023-05-31T16:21:20.000Z",
    "title": "Bitcoin fragments could become more valuable than full Bitcoins",
    "url": "https://cointelegraph.com/news/bitcoin-fragments-more-valuable-than-full-bitcoins",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/2089f657-a71d-4800-b616-0b2fa5914d5f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Collectors known as “sat hunters” are collecting satoshis from rare Bitcoin — and those fragments may eventually be worth more than regular Bitcoin.</p>\n                    <p><p>Since January, there have been over 10 million inscriptions on the largest blockchain in the world, and this number continues to grow exponentially.</p><p>To provide some context, the Ordinals Protocol allows for the ordered identification of satoshis, the smallest subdivision of a Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), enabling each of them to have an individual identity. From that people can inscribe sats with arbitrary content, creating Bitcoin-native digital artifacts, more commonly known as <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a>.</p><p>Among the various narratives resulting from this technique, the existence of an extremely underground group of individuals who identify, track and trade high-value historical satoshis has come to light. They are known as “sat hunters.”</p><p>There is no denying that the Bitcoin ecosystem is undergoing a period of tremendous innovation since the advent of the Ordinals Protocol in early 2023.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/d2fbae89-7289-4db7-81f1-c7614127f2ae.jpg\"  /></figure><p>Their main activity involves transacting millions of BTC in search of satoshis that were present in historical moments of the crypto world.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/b6e5f9d6-5d15-45eb-9f5e-c26f579baeb2.jpg\"  /></figure><p>This practice is known as “sat hunting” and can be compared to continuously withdrawing money from a bank in search of rare coins: You withdraw $10,000, keep $1 of rare coins, deposit the remaining $9,999, and repeat the process of withdrawing another $10,000 in a continuous cycle.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/can-we-still-trust-ledger\"><strong><em>Users will decide if they can still trust Ledger with their seed phrases</em></strong></a></p><p>The group that holds the largest amount of rare satoshis is the Rare Satoshi Society, which has already traded more than $1 billion in Bitcoin volume in pursuit of these historical sats.</p><p>They are becoming well-known for providing rare satoshis for the majority of Ordinals experiments and even sold a single satoshi for 0.5 BTC.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/b8d9a25d-4c9b-487d-9872-e95e24554891.jpg\"  /></figure><p>And it’s fascinating to observe how some Ordinals projects are adopting this narrative. One example is the Nakamoto Whales project, which minted a portion of its collection into rare satoshis from the first thousand mined blocks, including one mined by Satoshi Nakamoto.</p><p>Alongside the deployment of NFTs in rare satoshis, there is also an emerging trend of historically inscribed fungible tokens (BRC-20). DAnTer, a member of the Rare Satoshi Society, recently inscribed a collection, FHAL, onto a satoshi that was mined by the legendary Hal Finney on block 78 with the purpose of democratizing access to such a historical asset for more individuals.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/ddc82ea6-5b27-43fc-8479-cd3ec110f14a.jpg\"  /></figure><p>Now, according to DAnTer, we have entered an era where one Bitcoin is no longer equal to one Bitcoin — and a satoshi becomes equal to infinity.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/pepe-would-be-ashamed-by-pepe-investors\"><strong><em>Pepe would be ashamed of PEPE investors</em></strong></a></p><p>And although the narrative of historical satoshis still remains underground, fungible tokens on the Bitcoin network are hotter than ever. OKX, one of the largest exchanges in the world, just announced the listing of ORDI, the largest BRC-20 token in terms of market capitalization, while OXBT, one of the most popular BRC-20 tokens, has surpassed Bored Ape Yacht Club in the seven-day volume chart — just after its launch.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/08b2b250-fb8f-44a2-8f77-838d42fa05c8.jpg\"  /></figure><p>In February, people were trading Ordinals using Excel spreadsheets due to the lack of infrastructure. Today, just a few months later, major exchanges are joining this movement. Big brands like Bugatti have shown interest in the rare sats narrative, and there is even discussion about smart contracts on the Bitcoin network.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/dc4422ad-2fab-4d29-803c-bbd2e1ae0c6e.jpg\"  /></figure><p>Could this be the phase of the greatest innovation and onboarding in the history of Bitcoin?</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Lugui Tillier</strong> is the chief commercial officer of Lumx Studios, a leading Web3 studio that counts BTG Pactual Bank, the largest investment bank in Latin America, among its investors. Lumx Studios has previous Web3 cases with Coca-Cola, AB InBev, Nestlé and Meta.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-31T16:14:36.000Z",
    "title": "Crypto markets brace for impact as US debt ceiling debate threatens liquidity crunch",
    "url": "https://cryptoslate.com/why-raising-the-debt-ceiling-could-cause-a-massive-liquidity-crisis-in-crypto/",
    "description": "<p>Market attention is focused on the U.S. debt ceiling debate, but a looming liquidity crisis could impact both financial and crypto markets, including Bitcoin. As the Treasury plans to replenish its dwindling General Account balance, the method and implications of raising $440 billion through T-bill issuance could cause significant market shifts. What key correlations exist between the Treasury General Account, quantitative tightening, and Bitcoin's price? Find out by delving into our comprehensive analysis...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/why-raising-the-debt-ceiling-could-cause-a-massive-liquidity-crisis-in-crypto/\">Crypto markets brace for impact as US debt ceiling debate threatens liquidity crunch</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T16:32:10.000Z",
    "title": "Chainalysis acquires Web3 firm Transpose",
    "url": "https://www.cryptopolitan.com/chainalysis-acquires-web3-firm-transpose/",
    "description": "Blockchain analytics firm Chainalysis has acquired Transpose, a Web3 data and infrastructure company. The announcement, made on Tuesday, revealed that the two companies will collaborate to create a future where all value is transferred on-chain and every company becomes a blockchain company. Chainalysis wants to push for an on-chain financial system While the exact financial ... <a title=\"Chainalysis acquires Web3 firm Transpose\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainalysis-acquires-web3-firm-transpose/\" aria-label=\"More on Chainalysis acquires Web3 firm Transpose\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T16:25:00.000Z",
    "title": "Play the Best Five Online Slots",
    "url": "https://www.cryptopolitan.com/play-the-best-five-online-slots/",
    "description": "When it comes to online slots in Ireland, it is fair to say that there are many great slots that players can try their luck on. However, not all slots have been created equally, and some are much better than others. Below we are going to take a look at five of the best online ... <a title=\"Play the Best Five Online Slots\" class=\"read-more\" href=\"https://www.cryptopolitan.com/play-the-best-five-online-slots/\" aria-label=\"More on Play the Best Five Online Slots\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T16:16:03.000Z",
    "title": "El Salvador adds a new member to its National Bitcoin Office",
    "url": "https://www.cryptopolitan.com/el-salvador-member-national-bitcoin-office/",
    "description": "Renowned economist and author of “The Bitcoin Standard,” Dr. Saifedean Ammous, has taken up the role of economic advisor to the National Bitcoin Office of El Salvador. The appointment, announced on May 30, highlights the country’s commitment to incorporating Bitcoin into its economic policies. El Salvador’s new member will act as its economic advisor Dr. ... <a title=\"El Salvador adds a new member to its National Bitcoin Office\" class=\"read-more\" href=\"https://www.cryptopolitan.com/el-salvador-member-national-bitcoin-office/\" aria-label=\"More on El Salvador adds a new member to its National Bitcoin Office\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T16:24:35.000Z",
    "title": "SEC accepting ethereum for penalty payment",
    "url": "https://crypto.news/sec-accepting-ethereum-for-penalty-payment/",
    "description": "The U.S. Securities and Exchange Commission (SEC) will now accept ethereum as part of a penalty payment in a recent fraud case, while maintaining the classification of the digital asset as a security."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T16:31:05.000Z",
    "title": "Tether (USDT) and Tradecurve to help tackle hyperinflation in Argentina",
    "url": "https://www.crypto-news-flash.com/tether-usdt-and-tradecurve-to-help-tackle-hyperinflation-in-argentina/?utm_source=rss&utm_medium=rss&utm_campaign=tether-usdt-and-tradecurve-to-help-tackle-hyperinflation-in-argentina",
    "description": "<p>Latin America has seen an enormous surge in crypto adoption, especially in nations with uncontrolled inflation. Residents all over the world are leveraging stablecoins like Tether (USDT) to combat hyperinflation. Argentina is a prime example where the Peso suffers from an inflation rate exceeding 100%, and Argentinians have begun storing their savings in Tether (USDT). [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/tether-usdt-and-tradecurve-to-help-tackle-hyperinflation-in-argentina/\">Tether (USDT) and Tradecurve to help tackle hyperinflation in Argentina</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T16:21:52.000Z",
    "title": "HedgeUp’s (HDUP) Expected Performance Potential: Analyst Predict it to outperform Arbitrum (ARB) and Fantom (FTM)",
    "url": "https://www.crypto-news-flash.com/hedgeups-hdup-expected-performance-potential-analyst-predict-it-to-outperform-arbitrum-arb-and-fantom-ftm/?utm_source=rss&utm_medium=rss&utm_campaign=hedgeups-hdup-expected-performance-potential-analyst-predict-it-to-outperform-arbitrum-arb-and-fantom-ftm",
    "description": "<p>In the rapidly evolving landscape of cryptocurrencies, new players continue to emerge, disrupting traditional finance&#8217;s status quo and offering intriguing investment opportunities. HedgeUp (HDUP) has steadily made its mark as one such entrant, capturing significant attention in recent times. Analysts now predict it to outperform more established cryptocurrencies like Arbitrum (ARB) and Fantom (FTM). Dissecting [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/hedgeups-hdup-expected-performance-potential-analyst-predict-it-to-outperform-arbitrum-arb-and-fantom-ftm/\">HedgeUp&#8217;s (HDUP) Expected Performance Potential: Analyst Predict it to outperform Arbitrum (ARB) and Fantom (FTM)</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-31T16:35:03.000Z",
    "title": "Bumper’s Breakthrough DeFi Protocol Set To Reshape Options Pricing",
    "url": "https://dailyhodl.com/2023/05/31/bumpers-breakthrough-defi-protocol-set-to-reshape-options-pricing/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Bumper.fi-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Bumper.fi-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/05/Bumper.fi-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/05/Bumper.fi-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Bumper.fi-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/05/Bumper.fi-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>May 31, 2023 – London, United Kingdom Marking a seismic shift in the digital asset landscape, DeFi platform Bumper today unveiled the findings of their comprehensive simulation, exhibiting new pricing efficiencies over traditional options desks ahead of the protocol launch in August 2023. This report delineates a milestone in financial technology, showcasing an altogether new [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/31/bumpers-breakthrough-defi-protocol-set-to-reshape-options-pricing/\">Bumper’s Breakthrough DeFi Protocol Set To Reshape Options Pricing</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]