[
  {
    "source": "Crypto Daily",
    "date": "2023-12-25T19:37:18.000Z",
    "title": "Are Dogecoin (DOGE) and Shiba Inu (SHIB) Finally Set For Explosive Growth? Find Out Inside!",
    "url": "https://cryptodaily.co.uk/2023/12/are-dogecoin-doge-and-shiba-inu-shib-finally-set-for-explosive-growth-find-out-inside",
    "description": "Unveile the surprising crypto market predictions as 2023 approaches! Discover how Dogecoin (DOGE) and Shiba Inu (SHIB) are poised to shake up the crypto world. Will the Santa Claus rally lift them to new heights? Read now to find out the latest twists and turns in the world of meme coins."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-25T19:30:07.000Z",
    "title": "Bitcoin Breaks Records: Christmas Eve Sees Lifetime Surge in Daily Transactions and Hashrate",
    "url": "https://news.bitcoin.com/bitcoin-breaks-records-christmas-eve-sees-lifetime-surge-in-daily-transactions-and-hashrate/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/btcs-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Breaks Records: Christmas Eve Sees Lifetime Surge in Daily Transactions and Hashrate\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/btcs-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/btcs-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/btcs-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/btcs-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/btcs-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/btcs-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/btcs.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Dec. 24, 2023, Bitcoin shattered yet another daily transaction milestone, with miners confirming 723,459 transfers in a single day. The transaction rate on Christmas Eve exceeded the former peak of 710,579 verifications on Nov. 19, 2023. Bitcoin&#x2019;s Festive Feat &#x2014; Record Transactions and Hashrate Soar on Christmas Eve Throughout the festive weekend, the Bitcoin [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-25T19:15:00.000Z",
    "title": "Bixos Unveils Groundbreaking Real World Asset Investment at Kartal, Istanbul Event",
    "url": "https://news.bitcoin.com/bixos-unveils-groundbreaking-real-world-asset-investment-at-kartal-istanbul-event/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/h3-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/h3-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/h3-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/h3-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/h3-1536x864.jpg 1536w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/h3-2048x1152.jpg 2048w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/h3-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/h3-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/h3-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/h3-1520x855.jpg 1520w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/h3-1280x720.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Kartal, Istanbul – 25th December 2023 – Bixos, a leading force in blockchain innovation, is pleased to announce a historic moment in its journey with the revelation of its inaugural Real World Asset (RWA) investment at a recent event in Kartal, Istanbul. This transformative milestone signifies Bixos&#8217;s commitment to reshaping the conventional investment [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-25T19:28:34.000Z",
    "title": "Bitcoin fork discussions surface amid network congestion issues",
    "url": "https://www.cryptopolitan.com/bitcoin-fork-discussions-congestion-issues/",
    "description": "Amidst the complex landscape of blockchain dynamics, discussions surrounding a potential Bitcoin fork in 2024 are gaining momentum. The focal points of these deliberations include block space concerns, Ordinal inscriptions, and the persistent issue of escalating transaction fees. While no formal announcement has been made, a growing number of voices in the cryptocurrency community are [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-25T19:17:21.000Z",
    "title": "Bitcoin mining difficulty increases as miners purchase new equipment",
    "url": "https://www.cryptopolitan.com/bitcoin-mining-increases-miners-equipment/",
    "description": "In late December 2023, the landscape of Bitcoin mining underwent a significant transformation as the mining difficulty reached an unprecedented level. At block height 822,528, the difficulty surged by 6.98%, marking the most substantial increase in nine months since March 23. This surge set a new record, making the process of discovering block rewards more [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-25T19:14:02.000Z",
    "title": "League of Legends 2023 Recap: A Detailed Overview of Your Season Performance",
    "url": "https://www.cryptopolitan.com/league-of-legends-2023-recap-a-detailed/",
    "description": "As the 2023 League of Legends season draws to a close, avid summoners worldwide await Riot Games&#8216; final gift of the year &#8211; the much-anticipated LoL Recap for 2023. Much like Spotify&#8217;s Wrapped, this feature allows players to delve into their performance statistics, offering valuable insights into their journey throughout the year.&#160; From KDA to [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-25T19:11:38.000Z",
    "title": "Dogecoin Witnesses Significant Network Growth Amid Meme Coin Revolution",
    "url": "https://nulltx.com/dogecoin-witnesses-significant-network-growth-amid-meme-coin-revolution/",
    "description": "In the dynamic landscape of cryptocurrencies, the meme coin revolution has introduced several newcomers, including PEPE and BONK. Standing out amidst this vibrant competition is Dogecoin, boasting a market valuation of $13.32 billion and securing its position as the tenth-largest cryptocurrency. Dogecoin distinguishes itself as the most stable meme coin, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-25T19:30:26.000Z",
    "title": "Dogecoin In Demand: Data Shows DOGE Adoption Is Accelerating",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-demand-doge-adoption-accelerating/",
    "description": "On-chain data suggests the Dogecoin adoption has been picking up recently as a large number of new addresses are popping up on the network. Dogecoin Is Observing A High Number Of Daily New Addresses Currently In a new post on X, analyst Ali talked about how the Dogecoin network activity has been looking like recently in terms of new address creation. A &#8220;new address&#8221; is one that has taken part in some kind of transaction activity for the first time. Some of the new addresses that pop up on the network every day belong to the existing users, who may be creating additional addresses for privacy purposes or simply moving to a different wallet. Related Reading: Bitcoin Whales Do $2.2 Billion Selloff, But BTC Stays Strong The rest of the new addresses, though, are being created by fresh investors entering into the market, so the daily total value of the new addresses can provide hints about how the adoption of the meme coin is coming along. The below chart shows the trend in this metric for Dogecoin over the last couple of months: The value of the metric appears to have seen some overall uptrend in the last few weeks &#124; Source: @ali_charts on X As displayed in the above graph, the daily number of new Dogecoin addresses started spiking last month and has since been consistently setting new highs as the metric continues in an overall upward trajectory. This would suggest that the network has been receiving a consistently high influx of new investors recently. Adoption is always a constructive sign for any cryptocurrency, as fresh hands can help build a solid foundation that future uplifts in the price can sustainably grow off. Thus, it&#8217;s crucial for assets to continue to look attractive to new users, something that Dogecoin appears to have been doing fine recently. Any positive effects on the price that come through adoption, though, generally only appear in the long term. Rather, depending on the nature of the adoption, it can in fact impart a negative influence on the cryptocurrency in the short-term. This happens when too many new users join the blockchain in a short amount of time, only buying into the asset due to FOMO. Recently, the on-chain analytics firm Santiment also discussed this fast pace of address creation on the Dogecoin network, noting that Bitcoin (BTC) is also displaying a similar trend. The trend in the addresses of the top assets in the sector &#124; Source: Santiment on X &#8220;Though network growth is a great sign long-term, this rapid rate of new wallets is a FOMO sign to be slightly cautious of,&#8221; explained the analytics firm in the post. Related Reading: Polygon Breaks Through $0.85, Is A Move To New Highs Next? From the chart, it&#8217;s visible that Cardano (ADA) is the only asset among the top cryptocurrencies by market cap that&#8217;s not displaying any sort of address growth at all. DOGE Price Since the rally Dogecoin observed during the starting third of the month, the asset has gone rather stale, as its price has continued to move sideways around the $0.093 level during the last two weeks. DOGE hasn't enjoyed any upwards momentum in recent days &#124; Source: DOGEUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Santiment.net, IntoTheBlock.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-25T19:37:04.000Z",
    "title": "CAKE Token Investors Rejoice as PancakeSwap Mulls 300 Million Token Reduction",
    "url": "https://www.crypto-news-flash.com/cake-token-investors-rejoice-as-pancakeswap-mulls-300-million-token-reduction/?utm_source=rss&utm_medium=rss&utm_campaign=cake-token-investors-rejoice-as-pancakeswap-mulls-300-million-token-reduction",
    "description": "<img width=\"1280\" height=\"910\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-300x213.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-1024x728.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-768x546.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-269x192.png 269w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-24x17.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-36x26.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/rocket-gc51fb5864_1280-48x34.png 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />PancakeSwap&#8217;s CAKE has recently enjoyed a price spike reaching as much as $3.04 following a proposal to reduce the maximum supply by 300 million. This proposal marks a significant milestone for the project that is seeking to fix its high-inflation emissions model. PancakeSwap (CAKE) investors are rejoicing in a new development in the project. According [...]"
  }
]