[
  {
    "source": "Bitcoin.com",
    "date": "2023-07-21T03:30:58.000Z",
    "title": "BRICS Interest Soars: 40+ Countries Seek Membership as De-Dollarization Efforts Grow",
    "url": "https://news.bitcoin.com/brics-interest-soars-40-countries-seek-membership-as-de-dollarization-efforts-grow/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-over-40-countries-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BRICS Interest Soars: 40+ Countries Seek Membership as De-Dollarization Efforts Grow\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-over-40-countries-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-over-40-countries-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-over-40-countries-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-over-40-countries-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-over-40-countries-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-over-40-countries-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-over-40-countries.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />South Africa&#8217;s top diplomat responsible for BRICS relations has revealed that more than 40 countries are interested in joining the economic bloc. Among them, 22 nations have formally applied for membership. He believes that the BRICS group could expand to include more than 50 countries. BRICS Group Attracts More Than 40 Nations Anil Sooklal, South [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-21T03:31:13.000Z",
    "title": "Ethereum Price Prediction – Key Risks Warn Against Chasing ETH Higher",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-prediction-1825/",
    "description": "Ethereum price is struggling to clear the $1,920 resistance against the US Dollar. ETH could gain bearish momentum if there is a close below $1,875. Ethereum is trading in a range above the $1,875 level. The price is trading below $1,910 and the 100-hourly Simple Moving Average. There is a key rising channel forming with support near $1,885 on the hourly chart of ETH/USD (data feed via Kraken). The pair could decline heavily if the price remains below $1,920 for a long time. Ethereum Price Struggles Below $1,920 Ethereum’s price attempted a fresh increase above the $1,900 level. However, ETH failed to gain traction above the $1,920 resistance and reacted to the downside, similar to Bitcoin. The price declined below the $1,885 level but remained stable above $1,875. A low is formed near $1,877 and the price is now consolidating losses. It is slowly moving higher above the $1,885 level. There is also a key rising channel forming with support near $1,885 on the hourly chart of ETH/USD. Ether is trading below $1,910 and the 100-hourly Simple Moving Average. On the upside, immediate resistance is near the $1,900 level. It is close to the 50% Fib retracement level recent decline from the $1,927 swing high to the $1,877 low. The first major resistance is near the $1,910 level or the 61.8% Fib retracement level recent decline from the $1,927 swing high to the $1,877 low, above which the price could test the main resistance at $1,920. Source: ETHUSD on TradingView.com The next major resistance is near the $1,940 level. Any more gains could send Ether toward the $2,000 resistance in the near term. More Losses in ETH? If Ethereum fails to clear the $1,920 resistance, it could continue to move down. Initial support on the downside is near the $1,885 level and the channel trend line. The first major support is near the $1,875 level, below which the price might gain bearish momentum. The next major support is near the $1,825 support level. A downside break and close below $1,825 could push the price toward the $1,770 level. Any more losses could open the doors for a move toward the $1,720 support level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,875 Major Resistance Level – $1,920"
  }
]