[
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T07:25:00.000Z",
    "title": "Multichain CEO Unreachable As Protocol’s Problems Continue",
    "url": "https://cryptodaily.co.uk/2023/06/multichain-ceo-unreachable-as-protocols-problems-continue",
    "description": "<p>There seems to be no end to the problems at Multichain, with the team unable to reach the protocol&rsquo;s CEO and gain the necessary server access for maintenance works.&nbsp;</p>\n<p>The Multichain team has been trying its level best to keep the protocol running.&nbsp;</p>\nWhere Is The Multichain CEO?&nbsp;\n<p>Last week, rumors that Chinese authorities had arrested several Multichain executives began doing the rounds. According to the rumors, the arrested executives included Zhaojan, the protocol&rsquo;s Chief Executive Officer. While the integrity of these reports has not yet been confirmed, and the authorities have neither confirmed nor denied the reports, Binance responded to the news and suspended specific token deposits. Multichain has been facing days of continued outages, with several transactions in limbo due to multiple cross-chain pathways that are offline.&nbsp;</p>\n<p>Furthermore, it was also rumored that law enforcement officials have taken control of a wallet containing $1.6 billion belonging to Multichain, according to several Twitter accounts.&nbsp;</p>\n\n<p>&ldquo;According to the rumors earlier today in the Chinese community, it is said that the core members of the Multichain team were arrested by Chinese police, and the cold wallet was controlled, involving about $1.5 billion in funds.&rdquo;</p>\n\nProblems Continue&nbsp;\n<p>According to Multichain&rsquo;s Twitter account, the problems currently facing the protocol began on Monday, with the team stating that the protocol has been experiencing several issues thanks to unforeseen circumstances. The team stated that despite the team&rsquo;s best efforts to maintain the protocol and keep it running, they could not reach their CEO to access critical servers and carry out maintenance.&nbsp;</p>\n\n<p>&ldquo;In the past two days, the Multichain protocol has experienced multiple issues due to unforeseeable circumstances. The team has done everything possible to maintain the protocol running, but we are currently unable to contact CEO Zhaojun and obtain the necessary server access for maintenance.&rdquo;</p>\n\n<p>According to the team, the latest set of issues was triggered by problems arising from a network of nodes within the Multichain protocol. This was impacting cross-chain services for several blockchains, including PublicMint, Dyno Chain, Keychain, Dexit, Red Light Chain, Ekta, ONUS, HPB, Omax, Planq, and Findora.&nbsp;</p>\n\n<p>&ldquo;This afternoon, there was an issue with the scanning node network of Router5, which has affected the normal cross-chain service of some chains. Furthermore, this problem is beyond the team&rsquo;s current permissions and ability. In order to protect the interests of our users, we have decided to suspend the corresponding cross-chain service for the affected chain on the UI. Last week, the same issue happened on Router2.&rdquo;</p>\n\nMULTI Token Relatively Unaffected Over Past 24 Hours\n<p>The Multichain team has asked partners to stop calling smart contracts running on Multichain until they can get the permissions to access the protocol servers. Despite the gloomy news, the protocol&rsquo;s MULTI token has fared relatively well, reporting an increase of over 3%. Currently, the token is trading at $4.07. However, the token has lost over 19% of its value since Multichain&rsquo;s problems began.</p>\n<p>Multichain was previously known as Anyswap before suffering a major exploit in 2021. However, it made a strong recovery, becoming one of the largest blockchain bridges in the crypto space, with transaction volumes hitting the $100 billion mark. Multichain facilitates the exchange of tokens across several major networks, including Polygon, Ethereum, Binance Chain, and Avalanche. Head of product at Coinbase, Conor Grogan, tweeted that the problems at Multichain will impact only a small number of users, highlighting the low transaction outputs on the networks.&nbsp;</p>\n<p>Crypto Twitter is also nervous about rumors that Gate.io is facing liquidity issues, although the company has denied the reports.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T07:10:56.000Z",
    "title": "LBank Exchange Will List Floxypay (FXY) on Jun 1, 2023",
    "url": "https://cryptodaily.co.uk/2023/06/lbank-exchange-will-list-floxypay-fxy-on-jun-1-2023",
    "description": "<p>Road Town, BVI, June 1st, 2023, Chainwire</p><p>LBank Exchange, a global digital asset trading platform, will list Floxypay (FXY) on Jun 1, 2023. For all users of LBank Exchange, the FXY/USDT trading pair will be officially available for trading at 10:00 UTC on Jun 1, 2023.</p><p>Floxypay, a crypto platform designed to facilitate cryptocurrency exchange, crypto wallet management, and seamless integration with the travel industry for hotel and flight bookings using cryptocurrencies. Its native token, FXY, will be listed on LBank Exchange at 10:00 UTC on Jun 1, 2023, with the goal of expanding its global footprint and supporting the realization of its forward-thinking objectives.</p><p>Introducing Floxypay</p><p>LBank Exchange is thrilled to announce the upcoming listing of Floxypay (FXY), a crypto assets trading platform for facilitating cryptocurrency-related transactions, crypto wallet management, and seamless integration with the travel industry for hotel and flight bookings using cryptocurrencies.</p><p>FloxyPay offers top-class crypto payment solutions that can catapult businesses to success by providing seamless global payment experiences. With a focus on both crypto and fiat currencies, FloxyPay ensures that customers have a secure and efficient payment process.</p><p>FloxyPay offers a seamless global crypto payment experience, accepting and processing cryptocurrencies from anywhere. With diverse solutions, flexible 24/7 support, and scalable API integration, businesses can manage crypto payments effortlessly. FloxyPay ensures independent, transparent transactions with no chargebacks and multiple crypto options. Their global payment gateway guarantees secure transactions, low fees, and multi-currency support. For gaming businesses, FloxyPay provides fraud prevention and customized payment solutions. FloxyPay will also offer a user-friendly multi-cryptocurrency wallet with enhanced security features in the near future.</p><p>About FXY Token</p><p>Based on Polygon ERC-20, FXY has a total supply of 100 billion (i.e. 100,000,000,000) tokens. Holding and utilizing FXY tokens unlocks a range of exciting benefits, creating a rewarding experience for the platform users. It will be listed on LBank Exchange at 10:00 UTC on Jun 1, 2023, investors who are interested in FXY can easily buy and sell it on LBank Exchange by then. The listing of FXY token on LBank Exchange will undoubtedly help it further expand its business and draw more attention in the market.</p><p>Learn More about FXY Token:</p><p>Official Website | Telegram | Twitter | LinkedIn | Medium | Facebook | Instagram | Contract</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users' funds and aims to contribute to the global adoption of cryptocurrencies.</p><p>Start Trading Now: lbank.com</p><p>Community &amp; Social Media:&nbsp;&nbsp;Telegram l&nbsp;Twitter l&nbsp;Facebook l&nbsp;LinkedIn l&nbsp;Instagram l&nbsp;YouTube</p><p></p>ContactLBK Blockchain Co. Limitedmarketing@lbank.info"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-01T07:29:05.000Z",
    "title": "XRP $1 Threshold On The Horizon? Noted Trader Fuels Speculation",
    "url": "https://www.newsbtc.com/news/xrp-1-threshold-on-the-horizon/",
    "description": "XRP is no stranger to volatility and the excitement it brings. However, when a prominent trader like DonAlt raises the possibility of the crypto reaching the elusive $1 mark, it piques the interest of investors and enthusiasts alike.  The last time XRP saw such heights was back in November 2021, and since then, the digital asset has experienced a rollercoaster ride.  Now, with DonAlt&#8217;s speculation, the question arises: could XRP be on the verge of a major breakthrough? Related Reading: Shiba Inu: What’s Stifling The Meme Coin From Entering A Bullish Market Phase? DonAlt&#8217;s Tweet Raises XRP Speculation Earlier today, prominent cryptocurrency trader and influencer, DonAlt, ignited speculation among his followers by tweeting, &#8220;Is $XRP finally going to $1?&#8221; This tweet has generated increased discussions and debates surrounding XRP&#8217;s future price movement, attracting the attention of traders and enthusiasts alike. Is $XRP finally going to $1? — DonAlt (@CryptoDonAlt) May 31, 2023 In recent developments, XRP, the native coin of Ripple, has been displaying promising signs, as evidenced by remarkable spikes in address activity observed over two consecutive days.  This surge in address activity indicates a heightened level of interest and engagement with the cryptocurrency. Such an occurrence potentially signifies an upward trend for XRP, suggesting a possible decoupling from the broader altcoin market. Source: Coingecko According to data from CoinGecko, the current price of XRP stands at $0.505016. However, the past 24 hours witnessed a minor setback for the cryptocurrency, as it experienced a slump of 2.1%.  BTCUSD falls back into the $26K region. Chart: TradingView.com Despite this temporary dip, XRP has demonstrated resilience and noteworthy performance over the last seven days, recording impressive gains of 12.0%. This positive trend indicates the potential for XRP to rebound and regain its value. Potential Implications For XRP&#8217;s Future As SEC Battle Nears Conclusion The long-awaited conclusion of the Securities and Exchange Commission (SEC) lawsuit against Ripple, the company behind XRP, appears to be just around the corner. Brad Garlinghouse, the CEO of Ripple, recently expressed his belief that the lawsuit will reach a resolution in “weeks, not months.”  This news has generated significant excitement and anticipation among XRP holders and the broader cryptocurrency community. Related Reading: XRP Flows Strong With 13% Gain, Fueled By Bullish Market Indicators With the lawsuit&#8217;s conclusion looming, market observers and investors are eagerly awaiting the outcome and its potential impact on XRP&#8217;s price and market dynamics. The prevailing sentiment suggests that a favorable resolution for Ripple could serve as a catalyst for a surge in XRP&#8217;s value, potentially propelling it to new heights. Positive Market Sentiment And Investor Confidence The conclusion of the SEC lawsuit could also have broader implications for the market sentiment toward cryptocurrencies, particularly in relation to regulatory clarity. A favorable outcome for Ripple would signal a more positive regulatory environment for digital assets, potentially boosting investor confidence in the cryptocurrency market as a whole. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk) -Featured image from Pictorem.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T07:10:42.000Z",
    "title": "LBank Exchange Will List Floxypay (FXY) on Jun 1, 2023",
    "url": "https://www.crypto-news-flash.com/lbank-exchange-will-list-floxypay-fxy-on-jun-1-2023/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-exchange-will-list-floxypay-fxy-on-jun-1-2023",
    "description": "<p>Road Town, BVI, June 1st, 2023, Chainwire LBank Exchange, a global digital asset trading platform, will list Floxypay (FXY) on Jun 1, 2023. For all users of LBank Exchange, the FXY/USDT trading pair will be officially available for trading at 10:00 UTC on Jun 1, 2023. Floxypay, a crypto platform designed to facilitate cryptocurrency exchange, [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/lbank-exchange-will-list-floxypay-fxy-on-jun-1-2023/\">LBank Exchange Will List Floxypay (FXY) on Jun 1, 2023</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-01T07:13:07.000Z",
    "title": "Hong Kong’s SFC Releases Circular on VATPs’ New Licensing System",
    "url": "https://coinedition.com/hong-kongs-sfc-releases-circular-on-vatps-new-licensing-system/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/The_Securities_and_Futures_Commission_SFC_of_Hong_Kong_announced-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/The_Securities_and_Futures_Commission_SFC_of_Hong_Kong_announced-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/The_Securities_and_Futures_Commission_SFC_of_Hong_Kong_announced-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/The_Securities_and_Futures_Commission_SFC_of_Hong_Kong_announced-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/The_Securities_and_Futures_Commission_SFC_of_Hong_Kong_announced-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/The_Securities_and_Futures_Commission_SFC_of_Hong_Kong_announced-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/The_Securities_and_Futures_Commission_SFC_of_Hong_Kong_announced.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Hong Kong’s Securities and Futures Commission (SFC) released a circular on May 31 announcing the transitional arrangements for a new licensing system for centralized crypto trading platforms. As per the report, the novel licensing regime under the Anti-Money Laundering and Counter-Terrorist Financing Ordinance (Cap 615) (AMLO), is in force from today. The SFC has declared [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/hong-kongs-sfc-releases-circular-on-vatps-new-licensing-system/\">Hong Kong’s SFC Releases Circular on VATPs’ New Licensing System</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]