[
  {
    "source": "Cointelegraph",
    "date": "2023-12-25T03:35:45.000Z",
    "title": " Japan scraps corporate tax on unrealized crypto profits: Report ",
    "url": "https://cointelegraph.com/news/japan-scraps-tax-unrealized-profits-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvOTYxYjE1YzEtZWVkZC00NDBkLTlmYzAtNzM4M2M3MjI2MjI4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Domestic firms were previously required to pay tax on paper gains from their cryptocurrency holdings but now only need to do so when they sell the asset.</p>\n                    <p><p>Japanese firms will reportedly no longer be required to pay tax on “unrealized gains\" from cryptocurrency holdings as of April next year after the Cabinet reportedly approved a revision to the national tax regime for digital assets. </p><p><a href=\"https://coinpost.jp/?p=500501\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to local reports, Japan’s government unveiled the new tax reform on Dec. 22 following a cabinet meeting, with the new changes set for April 1, 2024 — the start of Japan’s financial year.</p><p>Previously, cryptocurrencies held by corporations received from third parties needed to be reported — based on the difference between market value and book value, regardless of whether the firm sold the cryptocurrency.</p><p><a href=\"https://cointelegraph.com/news/japan-scraps-tax-unrealized-profits-crypto\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-25T03:32:18.000Z",
    "title": "Phoenix Group Amplifies Its Tech and Web3 Presence with Strategic Lyvely Investment",
    "url": "https://www.cryptopolitan.com/phoenix-group-tech-web3-lyvely-investment/",
    "description": "Phoenix Group PLC, a global leader in blockchain technology, has made a significant stride in the tech and Web3 domain with its strategic investment in Lyvely, a dynamic UAE-based platform. The investment is a clear indication of Phoenix Group&#8217;s dedication to nurturing innovation and reshaping the digital landscape, particularly in enhancing the interaction and monetization [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-25T03:24:10.000Z",
    "title": "The Future Battlefield – Decoding China’s Military-Civil Fusion Blueprint",
    "url": "https://www.cryptopolitan.com/chinas-military-civil-fusion-blueprint/",
    "description": "In a sweeping effort to propel the People&#8217;s Liberation Army (PLA) into unparalleled technological prowess, the Chinese Communist Party (CCP) has unleashed its ambitious &#8220;Military-Civil Fusion&#8221; (MCF) strategy. This strategic blueprint, encompassing quantum computing, semiconductors, 5G, nuclear technology, aerospace technology, gene editing, and artificial intelligence, signifies a comprehensive and institutionalized approach unlike any seen before. [&#8230;]"
  }
]