[
  {
    "source": "Cointelegraph",
    "date": "2023-06-02T04:12:13.000Z",
    "title": "AI trends at all-time high on Google but Bitcoin still did it better",
    "url": "https://cointelegraph.com/news/ai-google-search-trend-all-time-high-bitcoin-peak",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/39b54883-efa5-4deb-8c0a-d066a761c62e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Google Trends data reveals that even though AI is the talk of the town, it still pales in comparison to Bitcoin in 2017. In China, it's a completely different story.</p>\n                    <p><p>Global search interest for the term “AI” has reached a new all-time high on Google, though it’s yet to hold a candle to Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) peak mania in 2017, data has revealed.</p><p>Artificial intelligence has dominated headlines over the past few months, with some suggesting that it’s the latest “tech fad” after crypto and the Metaverse. </p><p>Most recently, OpenAI executives warned in a May 23 blog <a href=\"https://cointelegraph.com/news/openai-warns-superhuman-ai-may-arrive-within-a-decade-we-have-to-get-it-right\">post that within</a> the next ten years, AI will exceed expert skill level in “most domains” and be as productive as “one of today’s largest corporations.”</p><p>However while global and United States search interest for AI has reached a fever pitch — clocking in at 89 on Google Trends, it is still shy of Bitcoin’s peak search interest of 100 in December 2017 when Bitcoin was nearing its then-high of $20,000.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/6ac4c588-a74c-4e7f-9d96-68d0e51019ac.png\"  /><figcaption style=\"text-align: center;\"><em>Comparing search trends for buzz words, \"AI, \"metaverse,\" and \"Bitcoin\" over a ten-year-period in the United States. Source: Google Trends</em></figcaption></figure><p>Mark Schilsky, an Alliance Bernstein technology specialist noted on May 31 that AI was “still far below the absolute hype of Bitcoin,” according to a <a href=\"https://www.businessinsider.com/ai-trending-google-search-bitcoin-metaverse-chatgpt-artificial-intelligence-2023-5#:~:text=%22AI%22%20is%20trending%20in%20Google,isn't%20a%20new%20term\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from Business Insider. His analysis was specifically focused on U.S. search trends. </p><p>Schilisky compared the three “buzziest segments of the tech industry” over the past ten years, “AI”, “metaverse”, and Bitcoin,” to reveal that the peak of search volume for “Bitcoin” is higher than the peak of search volume for AI so far.</p><h3>China says Bitcoin who? </h3><p>The results, however, vastly differ in China, where cryptocurrency is banned and Google search is restricted. The country favors Baidu as its search engine.</p><p>According to Google Trends, China’s Google users have consistently had more search interest for AI compared to Bitcoin on a monthly basis since May 2013.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e28720c1-a728-4c24-aff5-1508257c91ae.png\"  /><figcaption style=\"text-align: center;\"><em>Comparing search trends for buzz words \"AI,\" \"metaverse,\" and \"Bitcoin\" in China. Source: Google Trends</em></figcaption></figure><p>Throughout the last decade, there were only three instances in which Bitcoin surpassed AI searches in China, which line up with significant Bitcoin-related events.</p><p>In November 2013, Bitcoin surpassed AI as a search time in China for the first time, coinciding with it reaching its <a href=\"https://cointelegraph.com/news/absolute_bitcoin_price_record_reaches_300\">highest-ever level</a> of $300 on the now-defunct cryptocurrency exchange Mt. Gox.</p><p>In December 2017, Bitcoin once again took the lead in search interest, which was when Bitcoin hit all-time highs of $17,249.92 at the time.</p><p>The third and most recent occurrence took place in February 2021, as Bitcoin soared above $43,000 following the news that <a href=\"https://cointelegraph.com/news/bitcoin-hits-43k-all-time-high-as-tesla-invests-1-5-billion-in-btc\">Tesla had bought $1.5</a> billion worth of Bitcoin, and its decision to start accepting Bitcoin payments.</p><p>The country banned cryptocurrencies in 2021, and shortly after it was reported by Cointelegraph’s staff in China that online searches for <a href=\"https://cointelegraph.com/news/chinese-search-engines-block-results-for-top-crypto-exchanges\">several major cryptocurrency </a>exchanges were returning zero results.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/australia-consultation-high-risk-ai-ban\"><strong><em>Australia asks if ‘high-risk’ AI should be banned in surprise consultation</em></strong></a></p><p>Meanwhile, China has seen searches for “AI” hit their all-time high of 100 in April 2023. Today, the search score is around 94.</p><p>In May, Flytek, a state-sponsored Chinese AI company, announced it is launching “Spark Model” <a href=\"https://cointelegraph.com/news/state-sponsored-chinese-ai-firm-launches-bot-service-to-surpass-chatgpt\">an AI system designed</a> to compete directly with OpenAI’s ChatGPT.</p><p>Chinese officials recently <a href=\"https://cointelegraph.com/news/chinese-officials-issue-warning-about-ai-and-national-security\">discussed the need</a> for “dedicated efforts to safeguard political security and improve the security governance of internet data and artificial intelligence,” during a meeting on May 30. According to a local media outlet it was stated:</p><blockquote>“We must be prepared for worst-case and extreme scenarios and be ready to withstand the major test of high winds, choppy waters and even dangerous storms.”</blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/make-500-from-chatgpt-stock-tips-bard-leans-left-100m-ai-memecoin-ai-eye/\"><strong><em>Make 500% from ChatGPT stock tips? Bard leans left, $100M AI memecoin: AI Eye</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T04:26:08.000Z",
    "title": "Uwerx (WERX) Investors Massive Discounts While Shiba Inu (SHIB) And Ankr Network (ANKR) Show Positive Signs",
    "url": "https://www.cryptopolitan.com/uwerx-werx-investors-massive-discounts-while-shiba-inu-shib-and-ankr-network-ankr-show-positive-signs/",
    "description": "While Shiba Inu (SHIB) and Ankr Network (ANKR) are showing positive signs, early participants in the Uwerx presale are enjoying a 20% purchase bonus. However, this bonus will decrease as the presale price increases.&#160; What other benefits are there in the Uwerx presale? Continue reading to find out.&#160; The Uwerx (WERX) Presale Has A Wide ... <a title=\"Uwerx (WERX) Investors Massive Discounts While Shiba Inu (SHIB) And Ankr Network (ANKR) Show Positive Signs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uwerx-werx-investors-massive-discounts-while-shiba-inu-shib-and-ankr-network-ankr-show-positive-signs/\" aria-label=\"More on Uwerx (WERX) Investors Massive Discounts While Shiba Inu (SHIB) And Ankr Network (ANKR) Show Positive Signs\">Read more</a>"
  }
]