[
  {
    "source": "Cointelegraph",
    "date": "2023-07-30T18:00:44.000Z",
    "title": "DOGE, MKR, OP and XDC gather strength as Bitcoin price remains range-bound",
    "url": "https://cointelegraph.com/news/doge-mkr-op-and-xdc-gather-strength-as-bitcoin-price-remains-range-bound",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/c59faa6b-ec76-4fb0-86ca-d23fae31ea91.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin’s price consolidation is giving altcoin traders confidence that DOGE, MKR, OP and XDC could break out. </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has been stuck in a narrow range for the past several days. A minor positive is that the range has formed near the recent local high. This suggests that the bulls are not rushing to the exit as they anticipate another leg higher.</p><p>Bitcoin’s consolidation has pulled its market dominance to 48% from over 50% on June 30. This shows that market participants have been gradually shifting their focus to select altcoins, which are starting to move up.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/360266aa-7a42-4e57-9bc7-7f7cd5ec4f2e.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto market data daily view. Source:</em><em> </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>However, an altcoin recovery is likely to remain in place only till Bitcoin shows strength. If Bitcoin turns down sharply, the possibility of a sell-off in altcoins remains high. While select altcoins provide trading opportunities, cryptocurrency traders should be careful and keep a close watch on Bitcoin’s price action.</p><p>What are the important support and resistance levels to watch out for on Bitcoin? Let’s study the charts of top-5 cryptocurrencies that may try to move in the near term.</p><h2>Bitcoin price analysis</h2><p>The bulls managed to sustain Bitcoin above the 50-day simple moving average ($29,377) for the past few days but a negative sign is that they haven’t been able to propel the price above the 20-day exponential moving average ($29,670).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/3024f3a4-2606-4de2-9699-79a9cd682468.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em><a href=\"https://www.tradingview.com/x/SwWHyQYk/\" target=\"_blank\" rel=\"noopener nofollow\">BTC/USDT</a> daily chart. Source: TradingView</em></figcaption></figure><p>The bears will try to strengthen their position by pulling the price below the immediate support at $28,861. If they manage to do that, it will suggest that the BTC/USDT pair could stay range-bound between $31,000 and $24,800 for some time. The gradually downsloping 20-day EMA and the relative strength index (RSI) in the negative territory indicate advantage to bears.</p><p>This bearish view will invalidate if the bulls drive the price above the 20-day EMA. The pair could then rise to the overhead resistance zone between $31,000 and $32,400. The bulls will have to overcome this barrier to signal the start of a new uptrend to $40,000.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/e209c00c-3ad1-430e-96ca-f7351e93cd2a.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The 20-EMA has flattened out and the RSI is near the midpoint, indicating a balance between supply and demand. The pair is stuck inside a narrow range between $28,861 and $29,690.</p><p>A break and close above the overhead resistance will indicate that the advantage has tilted in favor of the bulls. The pair could then rise to $30,500 and later to $31,500. </p><p>Alternatively, if the price turns down and breaks below $28,861, it will suggest that bears are in control. The pair could then slump to $27,500.</p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) is facing resistance just above the $0.08 level but a positive sign is that the bulls have not given up much ground.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/0766477e-2b0b-4c2b-ac19-cf32b8bc092c.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em><a href=\"https://www.tradingview.com/x/WoLPY27y/\" target=\"_blank\" rel=\"noopener nofollow\">DOGE/USDT</a> daily chart. Source: TradingView</em></figcaption></figure><p>The bulls purchased the dip on July 28, indicating that the sentiment remains positive and traders are buying the dips. If bulls propel the price above the intraday high made on July 25, the DOGE/USDT pair could pick up momentum. The pair could then soar to $0.10 and subsequently to $0.11.</p><p>Contrarily, if the price turns down from the current level and plummets below the 20-day EMA, it will suggest that bears are selling on rallies. The pair could then slide to the breakout level of $0.07.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/670295ee-48a2-48e4-8136-e71ab05a2d52.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The 4-hour chart shows that the pair is in an uptrend. The price dipped below the 20-EMA but the bulls bought the dip and again pushed the price above $0.08. If bulls clear the overhead hurdle, the pair may resume its up-move. </p><p>The important support to watch on the downside is the 20-EMA and then the 50-SMA. Sellers will have to sink the price below the 50-SMA to gain the upper hand. The pair could then slump to the breakout level at $0.07.</p><h2>Maker price analysis</h2><p>Maker (<a href=\"https://cointelegraph.com/maker-price-index\">MKR</a>) had been stuck below $1,200 for the past several months. The bulls finally cleared this overhead obstacle on July 29.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/86bf87ec-ecb7-4522-ab14-ec642d58b57d.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em><a href=\"https://www.tradingview.com/x/tdaONg1q/\" target=\"_blank\" rel=\"noopener nofollow\">MKR/USDT</a> daily chart. Source: TradingView</em></figcaption></figure><p>Usually, after the price breaks above a stiff overhead resistance, the price turns down and retests the breakout level. In this case, the price may drop to the breakout level of $1,200. If the price turns up sharply from this level, it will suggest that the bulls have flipped $1,200 into support. The MKR/USDT pair may then start a new uptrend toward $1,600 and then $1,900.</p><p>Conversely, if bears sink and sustain the price below $1,200, it will suggest that the recent breakout may have been a bull trap. The pair could then skid to the 20-day EMA ($1,079). A break and close below this level will suggest that the bears are back in the game.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/c051968f-0385-4615-9460-259f7776ae1d.png\"  /><figcaption style=\"text-align: center;\"><em>MKR/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The upsloping moving averages and the RSI above 66 on the 4-hour chart indicate that the pair is in an uptrend. The price turned down from $1,361 but the bulls are likely to buy the dip to the 20-EMA.</p><p>If they do that, the pair will again try to rise above the overhead resistance of $1,361. If that happens, the pair may soar to $1,600. On the contrary, a decline below the moving averages will indicate that bears have seized control. The pair may then dump to $1,000.</p><p><strong><em>Related: </em><a href=\"https://cointelegraph.com/news/bitcoin-bull-flag-repeat-btc-price-freezes\"><em>Bitcoin due key MACD bull flag repeat as BTC price freezes at $29.3K</em></a></strong></p><h2>Optimism price analysis</h2><p>After staying in a downtrend for several days, Optimism (OP) is showing first signs of starting a new uptrend. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/cb9b7829-9495-429a-a48c-c1870754c510.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em><a href=\"https://www.tradingview.com/x/BzW52XPv/\" target=\"_blank\" rel=\"noopener nofollow\">OP/USDT </a>daily chart. Source: TradingView</em></figcaption></figure><p>The 20-day EMA ($1.46) has started to turn up and the RSI is in the positive territory, indicating that the bulls have the upper hand. There is a minor resistance at $1.66 but if this level is crossed, the OP/USDT pair could rise to $1.88 and then to $2.</p><p>Contrary to this assumption if the price turns down from $1.66, it will suggest that bears are selling on rallies. The pair could then drop to the 20-day EMA, which is an important level to keep an eye on. If this support cracks, the pair may descend to the 50-day SMA ($1.33).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/a58c4bbc-f660-4741-b39b-bf6a8bda2234.png\"  /><figcaption style=\"text-align: center;\"><em>OP/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The 4-hour chart shows that the price is stuck between $1.66 and $1.40 for some time. The 20-EMA has started to turn up and the RSI is just below the overbought region, indicating that the bulls have a slight edge.</p><p>If bulls thrust the price above $1.66, the pair could resume the up-move. The first target objective on the upside is $1.92.</p><p>If the price turns down from $1.66, it will signal that the pair may extend its range-bound action for some more time. The bears will have to sink and sustain the price below $1.40 to come out on top. That could clear the path for a potential fall to $1.15.</p><h2>XDC Network price analysis</h2><p>The XDC Network (XDC) surged from $0.03 on July 11 to $0.06 on July 25, indicating a strong uptrend.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/0c8d0bb0-5ed0-4224-80d2-6ddb483a95c4.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em><a href=\"https://www.tradingview.com/x/SAzg53N4/\" target=\"_blank\" rel=\"noopener nofollow\">XDC/USDT</a> daily chart. Source: TradingView</em></figcaption></figure><p>The price could first correct to the 38.2% Fibonacci retracement level of $0.05 and then to the 20-day EMA ($0.05). This is an important zone to watch out for because a strong bounce off it will suggest that the sentiment remains bullish. </p><p>If the price turns up from this zone, the bulls will attempt to resume the uptrend. A rally above the intraday high of July 27 could open the gates for an up-move to $0.10. This positive view will be negated on a break and close below the 20-day EMA.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/f13057ec-87a7-4e60-8463-77d2c2ff3542.png\"  /><figcaption style=\"text-align: center;\"><em>XDC/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The bulls are attempting to arrest the pullback at the 50-SMA on the 4-hour chart. This is a positive sign but the flattening 20-EMA and the RSI near the midpoint suggest that the positive momentum may be weakening.</p><p>If the price turns down from the current level or the overhead resistance at $0.06 and breaks below the 50-SMA, it will signal the start of a deeper correction. The XDC/USDT pair may then slide to the 50% Fibonacci retracement level near $0.05.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-30T18:07:39.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-30T17:46:15.000Z",
    "title": "China steals US’s thunder on GPS dominance",
    "url": "https://www.cryptopolitan.com/china-steals-uss-thunder-on-gps-dominance/",
    "description": "The waves of technological advancement are changing, and China is riding the crest. A new era dawns in global navigation, as the long-standing dominion of the United States in the field of satellite technology faces a formidable challenge. China&#8217;s Beidou constellation is not just a reflection of emerging prowess but a testament to strategic vision ... <a title=\"China steals US&#8217;s thunder on GPS dominance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-steals-uss-thunder-on-gps-dominance/\" aria-label=\"More on China steals US&#8217;s thunder on GPS dominance\">Read more</a>"
  }
]