[
  {
    "source": "CoinDesk",
    "date": "2023-08-02T23:00:00.000Z",
    "title": "Is Sam Bankman-Fried Going to Jail?",
    "url": "https://www.coindesk.com/policy/2023/08/02/is-sam-bankman-fried-going-to-jail/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Federal prosecutors said they were “seeking detention” for Sam Bankman-Fried, asking a judge to revoke his bond after he shared documents with the New York Times that they allege were meant to harass a fellow executive from the FTX empire and potentially influence her testimony."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-02T23:02:29.000Z",
    "title": "Space and Time launches Proof-of-SQL for blockchain and AI data verification",
    "url": "https://cryptoslate.com/space-and-time-launches-proof-of-sql-for-blockchain-and-ai-data-verification/",
    "description": "<p>Space and Time, a firm that describes itself as an AI-powered data warehouse, announced the launch of its Proof-of-SQL product on Aug. 2. Proof-of-SQL is capable of proving that the data returned in applicable queries is accurate and has not been tampered with. This verification is accomplished through zero-knowledge (ZK) proofs, which generate a SNARK [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/space-and-time-launches-proof-of-sql-for-blockchain-and-ai-data-verification/\">Space and Time launches Proof-of-SQL for blockchain and AI data verification</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-02T23:00:31.000Z",
    "title": "KuCoin suspends Bitcoin, Litecoin mining amid shifting strategy and layoff rumors",
    "url": "https://cryptoslate.com/kucoin-suspends-bitcoin-litecoin-mining-amid-shifting-strategy-and-layoff-rumors/",
    "description": "<p>According to an Aug. 2 statement, KuCoin plans to suspend its Bitcoin (BTC) and Litecoin (LTC) mining pools, effective from Aug. 15, until further notice. The exchange attributed its decision to its &#8220;evolving business strategy&#8221; and advised its mining pool users to transition their miners to alternatives before the deadline. KuCoin mining pool users have [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/kucoin-suspends-bitcoin-litecoin-mining-amid-shifting-strategy-and-layoff-rumors/\">KuCoin suspends Bitcoin, Litecoin mining amid shifting strategy and layoff rumors</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T23:01:12.000Z",
    "title": "New York bill aims to stop AI from replacing writers and actors",
    "url": "https://www.cryptopolitan.com/new-york-bill-on-ai-replacing-actors/",
    "description": "In the state of New York, two bills have been introduced to safeguard creative workers in the film and television industry as the ongoing strikes by the Writers Guild of America (WGA) and the Screen Actors Guild-American Federation of Television and Radio Artists (SAG-AFTRA) continue to cause delays in film and television production, lawmakers at ... <a title=\"New York bill aims to stop AI from replacing writers and actors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/new-york-bill-on-ai-replacing-actors/\" aria-label=\"More on New York bill aims to stop AI from replacing writers and actors\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-02T23:02:04.000Z",
    "title": "This Long-Term Bitcoin Price Average Is Setting ATHs",
    "url": "https://www.newsbtc.com/bitcoin-news/this-long-term-bitcoin-price-average-is-setting-aths/",
    "description": "Bitcoin price is nowhere near setting new all-time highs, but an important long-term price average is doing so, day after day, month after month. What is this moving average being referenced, and what does it setting new highs potentially mean? The 50-month moving average at the highest point ever&#124; BTCUSD on TradingView.com Meet The Moving Train: The 50-Month Moving Average As Bitcoin and the rest of the crypto market grind painfully sideways, a key measure using a moving average of BTCUSD price action is rising steadily, now at its highest point ever historically. The moving average in reference is the 50-month moving average (50MA). To calculate the span, simply take the last 50 months worth of BTCUSD closing prices, add them together, then divide them by the 50 (the number of months worth of data in the period). Related Reading: Bitcoin Bollinger Bands Are The Tightest Ever, What Happens Next? Traders use moving averages for a variety of reasons. This includes as trend-following tool, as trend lines, and for timing entries and exits. Such signals trigger when price passes above or below the span, or if two moving averages crossover one another in a two-moving average system. These are called a golden cross or death cross. #Bitcoin’s 50-month moving average continues to set new record highs Without all the noise, the primary trend points upward pic.twitter.com/HG8gjO3Gn6 &#8212; Tony &#34;The Bull&#34; (@tonythebullBTC) August 2, 2023 What The 50MA Hitting ATHs Means For Bitcoin The 50-month moving average making new all-time highs, general means the primary trend is still up. The chart above shows the long-term uptrend clearly without the noise of candlesticks or price action. With the candlesticks turned back on, Bitcoin is above the span — another bullish sign. Related Reading: Don’t Change The Channel! Why Bitcoin Could Target $42K If Uptrend Holds BTCUSD closed above the 50MA back in March 2023 and has since held above it for several months. Notably, Bitcoin lost this level for the first time back in June 2022. Meanwhile, the top cryptocurrency bottomed precisely at the 50MA in 2018 and again in 2020. The 50MA is currently at $26,353 and could act as support of retested. If lost, it could be a sign the longer-term trend is turning bearish. The 200-week moving average, another similar high timeframe price indicator that is used widely in technical analysis, is also at a similar level and trending upwards. This chart originally appeared in Issue #14 of CoinChartist (VIP). Subscribe for free. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-02T23:03:00.000Z",
    "title": "SOL, ETH Near New Levels, Will the Bearish Streak Continue?",
    "url": "https://coinedition.com/sol-eth-near-new-levels-will-the-bearish-streak-continue/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SOL ETH New Levels\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/SOL-ETH-New-Levels-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Despite recent talks of an altcoin season, assets like Solana (SOL), and top-ranked altcoin Ethereum (ETH) have not lived up to expectations. According to CoinMarketCap, SOL previously hit a 7-day low on August 1 before its 24-hour recovery to $23.70 at press time. Like Solana, ETH also slipped for the third consecutive day, falling as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sol-eth-near-new-levels-will-the-bearish-streak-continue/\">SOL, ETH Near New Levels, Will the Bearish Streak Continue?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]