[
  {
    "source": "CryptoSlate",
    "date": "2023-08-08T08:26:36.000Z",
    "title": "DeFi total losses breach $77B as July records largest loss of 2023 with $389M stolen",
    "url": "https://cryptoslate.com/defi-total-losses-breach-77b-as-july-records-largest-loss-of-2023-with-389m-stolen/",
    "description": "<p>De.Fi&#8217;s Rekt Database reports that July saw $389.82 million in DeFi losses related to hacks and exploits, pushing the cumulative total value of all of to cross the threshold of $77 billion. Ethereum emerged as the most targeted, losing $350 million across 36 incidents. Multichain, however, suffered the most severe single-case loss of $231 million [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/defi-total-losses-breach-77b-as-july-records-largest-loss-of-2023-with-389m-stolen/\">DeFi total losses breach $77B as July records largest loss of 2023 with $389M stolen</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-08T08:26:00.000Z",
    "title": "YGG Surges Nearly 600% Before Crashing, What’s Going On?",
    "url": "https://cryptodaily.co.uk/2023/08/ygg-surges-nearly-600-before-crashing-whats-going-on",
    "description": "<p>Yield Guild Games surged nearly 600% in less than a week, smashing through the top gainers charts before abruptly crashing.&nbsp;</p>\n<p>According to reports, a new Binance trading product and an ongoing community gaming event have played a pivotal role in the incredible price rally of the YGG token.&nbsp;</p>\nYGG Token Surges&nbsp;\n<p>According to data from CoinmarketCap, the Yield Guild Games (YGG) token saw a dramatic surge over the past week, rising by 580% and reaching a peak of $0.93 on the 7th of August, 2023. However, the token abruptly crashed soon after reaching this price level and is currently trading at around $0.36. However, the token had hinted at a decline in price in its gradually dropping trading volume. The trading volume recorded a drop of 26% in 24 hours, falling under $500 million, while the market cap increased by $17 million, reaching $161 million.&nbsp;</p>\nWhy Did The YGG Price Rally?&nbsp;\n<p>Observers attributed the surge in the YGG token&rsquo;s price to a couple of major factors. On the 3rd of August, Yield Guild Games announced the 4th season of the Guild Advancement Program (GAP). The Guild Advancement Program is a periodic gaming event that distributes rewards such as tokens to community members who successfully complete specified quests in participating in YGG-affiliated games.&nbsp;</p>\n<p>The 4th season of Yield Guild Games includes some of the biggest names in the space, such as Splinterlands, Skyweaver, and Axie Infinity. As a result, it should come as no surprise that the Yield Guild Games network usage saw a spike, reaching a one-month high of 192 active addresses. Yield Guild Games stated in its press release,&nbsp;</p>\n\n<p>&ldquo;Some of the community&rsquo;s most recent top picks are joining the fold this season, with all-new quests for guild members to dive into as they hone their skills and establish their web3 reputation. The season will officially begin on the 3rd of August, 2023, and will run until the 27th of September, 2023.&rdquo;</p>\n\n<p>Barely a day later, Binance announced plans to launch a YGG/USDT trading pair for perpetual contracts on its CEX platform, allowing up to 20x leverage. Available on-chain data suggests that the announcement brought in about $100 million worth of new capital into the YGG ecosystem.&nbsp;</p>\nWhales Dumping Share Of YGG\n<p>While the growth has been quite notable, reports have emerged of venture capital companies who initially backed the project, reportedly looking to sell their share of YGG on Binance. Data from LookOnChain sourced on the 7th of August shows that Bitkraft Ventures and DWF Labs have moved their YGG holdings to Binance and are most likely looking to sell. DWF Labs had received around 29 million YGG from the Yield Guild Games Treasury. However, on-chain data has suggested that most of these tokens have been moved to exchanges. Bitkraft Ventures also made large deposits on Binance using FalconX.&nbsp;</p>\n<p>Another whale, Wintermute Trading, has reportedly deposited just over 11 million YGG worth $6.7 million to different exchanges over the past four days. It currently holds a further 2.5 million YGG, valued at around $1.5 million. LookOnChain also showed that Youbi Capital had deposited around 1 million YGG to Binance. The firm currently holds about 11 million YGG. Sfermion has also jumped on board the selling wagon, using FalconX to deposit its YGG tokens on Binance.&nbsp;</p>\n<p>Large deposits generally signify an investor&rsquo;s willingness to exchange the token for other assets or sell them. This is also true of whales such as the ones mentioned earlier. Smaller investors generally tend to follow larger investors, copying their selling behavior.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T08:18:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-08T08:37:52.000Z",
    "title": "Bitcoin turns green as large whales make moves",
    "url": "https://crypto.news/bitcoin-turns-green-as-large-whales-make-moves/",
    "description": "Bitcoin (BTC) has witnessed high volatility over the past month, but with the current whale movements, the flagship cryptocurrency gained a bullish moment. According to data from Santiment, Bitcoin whale transactions, consisting of at least $1 million worth of BTC,&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-08T08:31:27.000Z",
    "title": "Indian EOW exposed a $120m crypto Ponzi scheme",
    "url": "https://crypto.news/indian-eow-exposed-a-120m-crypto-ponzi-scheme/",
    "description": "The Indian Economic Offenses Wing (EOW) revealed a crypto-related Ponzi scheme exploiting over 200,000 individuals across different states in India. According to a report by Asian News International (ANI), Solar Techno Alliance developed a digital asset on Binance Smart Chain&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-08T08:30:19.000Z",
    "title": "Can Litecoin Bulls Turn The Tide On Recent Declines? A Closer Look",
    "url": "https://www.newsbtc.com/all/can-litecoin-bulls-turn-the-tide-on-declines/",
    "description": "Litecoin (LTC) has recently faced a period of bearish pressure that has taken a toll on its market performance. The months of July and August have witnessed a shift in sentiment, as bearish forces began to dominate the crypto market.  As of the latest update, LTC finds itself trading within a critical support zone, prompting discussions among traders and analysts about its potential trajectory. With the value of LTC hovering just below the $80 mark, market observers are closely monitoring whether this level will hold against the prevailing bearish sentiment. Related Reading: PEPE’s Future: Will Prices Of Meme Coins Continue To Drop? Litecoin Vital Support Zone Tested A recent price analysis has underscored the significance of the $80 threshold, suggesting that a breach below this point could potentially trigger an extended downtrend for Litecoin. The current market figures reflect a small 24-hour uptick of 0.2% and a seven-day decline of 8.5% with a current price of $82.57 on CoinGecko, painting a cautious picture for LTC&#8217;s short-term performance. The fluctuations in price during this period have sparked discussions about the factors contributing to Litecoin&#8217;s recent struggles. Source: Coingecko Halving Event And Its Impact The crypto community is no stranger to the phenomenon of halving, an event embedded in the genes of cryptocurrencies like Litecoin. In 2019, Litecoin underwent its second halving, a pre-programmed event that occurs approximately every four years. This event, characterized by a reduction in block rewards issued to miners, has historically carried significant implications for price trends. LTC weekly price movement. Source: CoinMarketCap Related Reading: XRP Journey To $10: Unveiling The Forces That Could Trigger An Upward Momentum The halving event in 2019 witnessed a fascinating sequence of events. In the lead-up to the halving, Litecoin&#8217;s price experienced a rally, generating excitement among investors. However, the post-halving scenario took an unexpected turn as an extended downtrend followed, lasting for over 500 days. This downtrend was succeeded by a period of consolidation, marking the complexity of crypto market dynamics and the interplay between halving events and price trends. Litecoin market cap currently at $6 billion. Chart: TradingView.com LTC&#8217;s Third Halving Event And Network Fundamentals Fast-forward to August 2, 2023, and Litecoin&#8217;s blockchain has just experienced its third halving event. Occurring at block 2,520,000, this event has effectively slashed mining rewards to 6.25 LTC per block. Despite the prevailing lull in price action, Litecoin&#8217;s network fundamentals remain robust.  Litecoin&#8217;s Hashrate is currently at getting close to hitting a new all time high. Currently at 933.2 TH/s, with difficultly just touching on a new ATH. $LTC is stronger than ever! Despite what you may read in the &#8216;press&#8217;. pic.twitter.com/0hEgED09kd — Litecoin (@litecoin) August 6, 2023 Meanwhile, Litecoin&#8217;s hashrate is poised to achieve an all-time high, exemplifying the network&#8217;s resilience and ongoing miner participation. Presently boasting a difficulty level of 933.2 TH/s, Litecoin inches closer to establishing a new record, highlighting its secure and decentralized network infrastructure.  The strengthening hashrate and its associated positive network indicators underline Litecoin&#8217;s capacity to withstand market fluctuations and continue to evolve in the face of external pressures. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from The Currency Analytics"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-08T08:18:07.000Z",
    "title": "Galaxy Digital CEO Applauds Coinbase’s Legal Battle With the SEC",
    "url": "https://coinedition.com/galaxy-digital-ceo-applauds-coinbases-legal-battle-with-the-sec/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Galaxy_Digital_CEO_Mike_Novogratz_calls_Coinbases_legal_fight_with-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Mike Novogratz, CEO of the New York-based crypto investment firm Galaxy Digital, called Coinbase’s legal fight with the SEC “brave” in a recent Bloomberg interview. Novogratz was asked about his opinion on the SEC taking legal action against Coinbase, the American crypto exchange platform. Coinbase’s CEO, Brian Armstrong, took to Twitter multiple times and shared [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/galaxy-digital-ceo-applauds-coinbases-legal-battle-with-the-sec/\">Galaxy Digital CEO Applauds Coinbase’s Legal Battle With the SEC</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]