[
  {
    "source": "Cointelegraph",
    "date": "2023-12-02T17:05:55.000Z",
    "title": " Madeira seeks to boost economy with startups, innovative payment system  ",
    "url": "https://cointelegraph.com/news/madeira-boost-economy-startups-payment-system",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYTZjMGFiMTktZjhmZi00ZDQzLTlmMzUtM2EyMjFkMzkxZWI1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Madeira Blockchain 2023 conference showcased the region's efforts to become an emerging technology hub in the Atlantic. </p>\n                    <p><p >An archipelago in the middle of the Atlantic is seeking startups and tech talents to boost its economic growth. </p><p >Portugal's Madeira archipelago has been praised for its natural beauty, but an aging population and pressing need for a more diversified economy prompted its local government to explore emerging technologies, such as blockchain. </p><p >According to Rogerio Gouveia, finance secretary of the regional government of Madeira, emerging-technology companies make up nearly 30% of businesses in Madeira's free trade zone, a special economic area that offers tax benefits to companies, including one of the lowest corporate tax rates in the European Union and capital gains tax exemption for eligible firms.</p><p >\"For companies aiming to establish a presence in the region, the foremost tax incentive is found in the Madeira free zone or the International Business Center. </p><p >One of the companies behind Madeira's Web3 ecosystem is Yacooba Labs, a software development company using blockchain technology for ticketing solutions, addressing issues like overpriced secondary markets and fraud on tickets.</p><figure ><img src=\"https://s3.cointelegraph.com/uploads/2023-12/7211450a-03f5-4b07-90dc-307b947ea6d4.jpg\"  /><figcaption style=\"text-align: center;\"><em>Madeira's regional finance secretary, Rogério Gouveia, discusses the region's efforts to attract startups and tech talent.</em></figcaption></figure><p >In addition, Madeira's tax incentives are associated with other initiatives aimed at shifting the region's focus from tourism to a technology-based economy, including an emphasis on information technology education in local schools. </p><p >Madeira is also working on a payment network that will connect local merchants and simplify currency exchange for tourists. </p><p><a href=\"https://cointelegraph.com/news/madeira-boost-economy-startups-payment-system\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-12-02T16:43:39.000Z",
    "title": "Spanish authorities detain alleged crypto fugitive",
    "url": "https://crypto.news/spanish-authorities-detain-alleged-crypto-fugitive-wanted-by-us/",
    "description": "The Spanish police reported the apprehension of pro-Pyongyang group founder Alejandro Cao de Benos at Madrid's Atocha train station upon arriving from Barcelona"
  }
]