[
  {
    "source": "CoinDesk",
    "date": "2023-06-20T13:00:00.000Z",
    "title": "Startup Arbol Unveils AI and Blockchain-Powered Climate Insurance Platform",
    "url": "https://www.coindesk.com/business/2023/06/20/startup-arbol-unveils-ai-and-blockchain-powered-climate-insurance-platform/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The market for climate insurance is estimated to triple in the next decade."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-20T13:00:00.000Z",
    "title": "Branding: The layer-1 of a successful Web3 marketing strategy",
    "url": "https://cointelegraph.com/innovation-circle/branding-the-layer-1-of-a-successful-web3-marketing-strategy",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/1b9b6060-3122-47ab-8307-8cf140525de5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Building on a blockchain follows similar fundamental principles to building in real life.</p>\n                    <p><p>Building on a blockchain follows similar fundamental principles to building in real life. First, you establish the foundations, then you can start laying the bricks, and only once it’s built can someone begin experiencing the building’s purpose. With blockchain, establishing a foundation involves selecting (or even designing) a first layer. Laying the bricks is akin to writing the platform code, and only then the user experience can begin. </p> <p>So why, if we know the process involved in building a successful, sustainable structure from scratch, do we ignore it when it comes to our crypto marketing efforts?  </p> <h3><strong>The naive crypto founder’s marketing checklist</strong></h3> <p>Building a Web3 project from scratch? Here’s a typical marketing checklist for starry-eyed founders:</p> <ul><li>Have a logo: something from a freelancer will do to start</li><li>Create a whitepaper: this is a must-have for VCs</li><li>Have a website and social media accounts</li><li>Create a blog (remember: SEO matters) </li><li>Engage a PR agency and issue lots of press releases ahead of launch </li><li>Use influencers (more followers = more reach)</li><li>Use paid placements to establish authority</li><li>Participate in sponsorships and time on stage at big events</li></ul> <p>Even if a project manages to survive the next crash, it’ll invariably end up rinsing and repeating this list with endless newer and more exciting features, products and services, with little return on its marketing spend. </p> <p>The problem is, when everyone is doing the same thing, nobody stands out. And during the bear markets, what’s left? All of the above costs time and money, but none of it buys loyalty. </p> <p>All entrepreneurs building on blockchain understand the importance of building from the foundations up — starting with layer-1. Layer-1 underpins everything. </p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://circle.cointelegraph.com/learn-more?utm_campaign=Coin&_ga=2.123197772.699257063.1649682515-719256619.1645538730\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <p>What are the characteristics you seek from layer-1? </p> <ul><li>Decentralization with distributed shared ownership </li><li>Immutability</li><li>Transparency</li><li>Longevity</li></ul> <p>Nothing in the extensive founder’s marketing checklist shares these non-negotiable properties. </p> <h3><strong>Your brand is your layer-1 of your marketing  </strong></h3> <p>Successful marketing starts with its own layer-1 — building the brand. Your layer-1 is the keystone on which your entire platform is built, and your brand is the keystone on which your entire marketing strategy should be constructed. </p> <p>Your brand isn’t a logo or a catchy slogan. It’s first and foremost a memorable, relevant, credible, unique, concise and consistent brand positioning and promise. Ideally, it’s supported by a clear set of values, ideas, narratives and visuals that pull everything else together. </p> <p>Your brand is what makes people recognize you. It’s what invokes what your business is known for. And it’s the only part of your marketing toolkit that creates a truly emotional tie between you and your target audience. </p> <p>Remember, your brand is the only asset that you can derive from your marketing spend. However much you pay a PR or marketing agency, no matter how much they talk about ROI — without a brand, it’s all just talk. Your brand is your layer-1. </p> <p>That’s not to say that all the other stuff isn’t important. Your socials, blog and PR campaigns all matter. But they are your layer-2 — your touchpoints. If we take the blockchain analogy, your layer-2 marketing activities and touchpoints are like your dApps. They’re your presence — your voice to the world. </p> <p>Layer-3 is where the magic happens. Layer-3 is the experience, where your brand, product and story come together to create traction, impact and enduring value. This is why people will come back and what will propel you through the toughest of bear markets and financial hardships. </p> <p>But without layer-1 — your brand — you’ll never reach layer-3 based on a foundation of layer-2 alone. It would be like trying to launch a dApp without a blockchain. </p> <h3><strong>Retrofitting works</strong></h3> <p>Hang on, you may be thinking. I’ve already started my business, and I didn’t build a brand before I started. I already have my website, socials, blog and campaigns set up, but without a brand. Is it all now doomed to fail? </p> <p>It’s not a problem. </p> <p>Unlike dApps, which can’t run without blockchains, it is possible to retroactively build your brand. In fact, the chances are that in the process of building your layer-2, you’ve already started creating an impression that can help to form the basis of your brand. </p> <p>What are you good at? Why does your community come to you above the competition? Why is your offering relevant? </p> <p>Arguably, if you have already started, you’re in an even stronger position to build a brand retroactively because you already have enough data and input to be able to answer these questions. Those touchpoints you set up are a valuable trove of feedback from people who have engaged with your product and formed an impression. Listen to what they have to say. </p> <p>Once you know what you’re good at, and how you’re being perceived, you have the ingredients to create your brand. The rest is pure science. </p> <p><em>German is co-founder & chief relevance officer of <a href=\"https://www.therelevancehouse.com/\">THE RELEVANCE HOUSE</a>, a branding, marketing & growth agency focused on blockchain and Web3.</em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\" /> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-20T12:45:53.000Z",
    "title": "Investing in Web3 is a ‘hedge against disruption’ — VC investment exec",
    "url": "https://cointelegraph.com/news/investing-in-web3-is-a-hedge-against-disruption-vc-investment-exec-interview",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/f7ab1ce7-6310-4b8d-bb9c-d66e8294b41e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Martin El-Khouri, a senior director at Bertelsmann Investments, spoke with Cointelegraph at the Proof of Talk conference on the state of VC investments in Web3.</p>\n                    <p><p>The crypto space has been facing waves of uncertainty in recent months between <a href=\"https://cointelegraph.com/news/eu-s-new-crypto-law-how-mica-can-make-europe-a-digital-asset-hub\">impending regulations</a> from regulators across the world and a lingering market downturn. </p><p>Despite the state of the industry investors are still backing new ventures in the space. Data shows that in 2022 alone, European DeFi <a href=\"https://cointelegraph.com/news/european-defi-startups-saw-a-120-increase-in-vc-funding-in-2022-finance-redefined\">startups experienced an increase</a> in venture capital (VC) funding by up to 120%. </p><p>Cointelegraph spoke with Martin El-Khouri, a senior director at Bertelsmann Investments, during the Proof of Talk blockchain conference about why major investment firms still see Web3 as a way forward. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/69927c38-beb4-4dc7-b8c5-d6604d7bb7cb.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Proof of Talk 2023 blockchain conference in Paris. Source: Cointelegraph</em></figcaption></figure><p>Bertelsmann Investments is one of the world's major VC investment firms with around 1.7 billion euro invested in over 400 companies worldwide.</p><p> El-Khouri told Cointelegraph that the firm made its first investment into the Web3 space back in 2016 and the current state of the market actually helps investors distinguish between “noise and sound.”</p><blockquote>“Now that the hype is gone, investors can see where the actual value is being accrued, which projects are just artificially inflated and which ones are built and based on a solid foundational framework.”</blockquote><p>He said he considers investments in Web3 a “hedge against disruption,” though says it’s still sometimes “difficult to convince” executive leadership in large global corporate entities to dedicate attention to Web3 due to the industry’s fluctuating reputation.  </p><p>However, he highlighted that regulations help the industry in terms of investments because it <a href=\"https://cointelegraph.com/news/investors-crypto-institutional-backing-nomura-survey\">gives investors more clarity</a> about what is being built. </p><blockquote>“When you invest in a project, you want to understand whether there is a big regulatory risk that could prevent this business and business model or idea from flying.”</blockquote><p>“The more regulatory clarity we get,” he said, “the easier it becomes to evaluate different types of businesses.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/metaverse-investments-opportunities-and-risks-of-the-trillion-dollar-vr-market\"><strong><em>Metaverse investments: Opportunities and risks of the trillion-dollar VR market</em></strong></a></p><p>He also pointed out the shift of interest towards generative AI and AI startups. According to data from Marketsandmarkets, the AI market is projected to hit $407 billion by 2027, compared to its $86.9 billion revenue in 2022. </p><p>El-Khouri said that although investors are pivoting towards AI, “blockchain and crypto are going to be more important than ever before.” </p><blockquote>“The interesting thing is that the main value propositions of Web3 are basically magnified 10,000x via what we're seeing right now with generative AI.”</blockquote><p>He concluded that especially when it comes to AI content creation, blockchain will help solve the “double spending problem without the need for an intermediary, and it gives provenance to digital assets.” </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-is-ai-a-threat-why-ai-advance/\"><strong><em>AI Eye: Is AI a nuke-level threat? Why AI fields all advance at once, dumb pic puns</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-20T12:55:34.000Z",
    "title": "An institutional crypto exchange backed by Fidelity, Schwab, and Citadel, launches today",
    "url": "https://cryptoslate.com/edx-markets-the-institutional-crypto-exchange-backed-by-fidelity-schwab-and-citadel-launches-today/",
    "description": "<p>EDX Markets, a non-custodial cryptocurrency exchange backed by Citadel Securities, Fidelity Investments, and Charles Schwab, is live as of today, June 20. EDX differentiates itself from traditional crypto exchanges by not directly catering to retail investors as it focuses on institutional traders. Additionally, trading access is via API and does not offer a front-end or [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/edx-markets-the-institutional-crypto-exchange-backed-by-fidelity-schwab-and-citadel-launches-today/\">An institutional crypto exchange backed by Fidelity, Schwab, and Citadel, launches today</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-20T13:00:00.000Z",
    "title": "$BNB Chain Unveils Testnet For opBNB Layer 2",
    "url": "https://cryptodaily.co.uk/2023/06/bnb-chain-unveils-testnet-for-opbnb-layer-2",
    "description": "<p class=\"md-end-block md-p\">Binance-backed BNB Chain has unveiled opBNB, a new Layer-2 testnet designed to address the pressing scalability challenges that have slowed the mass adoption of blockchain technology.</p>\n<p class=\"md-end-block md-p\">This Optimism-based Layer-2 network offers promising solutions, aiming to increase transaction speed, lower costs, and enhance network security.</p>\nUnveiling opBNB: The New Era of Scalability\n<p class=\"md-end-block md-p\">On June 19, BNB Chain announced the opBNB testnet launch, an innovation in the blockchain space that seeks to enhance the scalability of the BNB Smart Chain (BSC). opBNB represents a tangible commitment to ensure a seamless, efficient experience for users, developers, and projects within the BSC ecosystem. This development is a clear demonstration of BSC's ambition to bring the power of blockchain to everyone, despite falling to exploits in the past.</p>\n<p class=\"md-end-block md-p\">An Ethereum Virtual Machine (EVM) compatible layer-2 chain, opBNB uses Optimism OP Stack to further bolster BSC's scalability while maintaining cost-effectiveness and security. This revolutionary layer-2 solution leverages Optimistic Rollups, a technique that reduces computational load on the main chain by executing transactions off-chain and only posting transaction data on-chain.</p>\nScaling Beyond the Challenges\n<p class=\"md-end-block md-p\">Blockchain networks often grapple with network congestion and high fees during periods of heightened network demand. The existing BNB Chain can handle around 2,000 transactions per second at transaction costs of roughly $0.10. However, with opBNB's advanced features, the Binance blockchain network is set to push its gas limit to an incredible 100 million per block, a considerable increase from the 30 million limit allowed by Optimism.</p>\n<p class=\"md-end-block md-p\">This dramatic upgrade will allow opBNB to process over 4,000 transfer transactions per second, with the average transaction cost dropping to less than $0.005. These improvements are part of opBNB&rsquo;s efforts to streamline data accessibility, enhance the caching layer, and addjust the submission process algorithm to allow simultaneous operations.</p>\nThe Potential Impact of opBNB\n<p class=\"md-end-block md-p\">The introduction of opBNB marks a turning point in BSC&rsquo;s evolution, offering enhanced scalability and robust security measures that will enable the network to cater to a growing user base and expand its range of applications. </p>\n<p class=\"md-end-block md-p\">For developers and projects, opBNB provides a solid, EVM-compatible platform for building diverse ecosystems and reaching more users. It offers a substantially improved throughput and lower transaction costs, providing a more seamless user experience. Projects previously hampered by the high volume of transactions on BSC can now thrive in the new, more scalable opBNB environment.</p>\nSkeptics and Prospects\n<p class=\"md-end-block md-p\">Despite the promising innovation, some critics, such as Cinneamhain Ventures partner Adam Cochran, argue that BNB Chain&rsquo;s decision to launch an Optimism fork, instead of opting for other options like becoming a layer-2 directly on Ethereum or even a layer-3 on Optimism or Arbitrum, doesn&rsquo;t make sense. He blamed the scaling issues on the centralization of an Ethereum fork and unsafe gas limit settings.</p>\n<p class=\"md-end-block md-p\">Despite skepticism, opBNB continues to show potential, especially given BNB Chain&rsquo;s status as the third-largest blockchain network in terms of DeFi total value locked. Its TVL stands at $3.38 billion, with a 24-hour volume of $264 million and roughly a million active daily userrs.</p>\n<p class=\"md-end-block md-p\">The launch of opBNB invites developers and projects to experiment, build, and contribute to the broader BSC ecosystem, fostering the future of blockchain technology and paving the way for the next generation of blockchain innovation.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T12:43:44.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-20T12:56:08.000Z",
    "title": "Crypto enthusiast Tsai to steer Alibaba",
    "url": "https://crypto.news/crypto-enthusiast-tsai-to-steer-alibaba/",
    "description": "Alibaba&#8217;s leadership reshuffle puts Joseph Tsai, a known crypto enthusiast, in the chairman&#8217;s seat, suggesting possible future crypto initiatives. However, given China&#8217;s cautious stance on cryptocurrencies, how this change will play out remains to be seen. On June 20, Alibaba&#8230;"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-20T12:54:00.000Z",
    "title": "Japan’s Crypto Exchanges Propose 10x Leverage on Margin Trading",
    "url": "https://coinedition.com/japans-crypto-exchanges-propose-10x-leverage-on-margin-trading/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/026.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/026.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/026-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/026-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/026-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/026-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/026-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/026-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/026-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/026-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/026-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/026-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/026-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/026-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/026-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/026-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/026-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Japan&#8217;s cryptocurrency exchanges are advocating for more lenient margin trading regulations as the country aims to boost its position in the global digital asset market. The Japan Virtual and Crypto Assets Exchange Association (JVCEA) has proposed permitted leverage for retail players of four to ten times, compared to the current limit of two times. According [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/japans-crypto-exchanges-propose-10x-leverage-on-margin-trading/\">Japan’s Crypto Exchanges Propose 10x Leverage on Margin Trading</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]