[
  {
    "source": "Cointelegraph",
    "date": "2023-09-28T04:20:22.000Z",
    "title": "Mark Zuckerberg reveals Meta AI chatbot, his answer to ChatGPT",
    "url": "https://cointelegraph.com/news/meta-ai-ceo-mark-zuckerberg-unveil-chatbot-rayban-metaverse",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/2219770c-1038-450a-94fc-a935fc36afe5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The new AI assistant, Meta AI will be initially available from Sept. 27 for a limited group of U.S.-based users.</p>\n                    <p><p>Meta CEO Mark Zuckerberg has unveiled his firm's new AI-powered assistant  — Meta AI —  his answer to OpenAI’s ChatGPT, which will integrate with Instagram, Facebook, WhatsApp and eventually, its mixed reality devices.</p><p>Speaking at the Meta Connect <a href=\"https://www.facebook.com/Meta/videos/1038522214125952\" target=\"_blank\" rel=\"noopener nofollow\">event</a> on Sept. 27, Zuckerberg explained that Meta AI is powered by the company’s large language model Llama 2, and has been built in partnership with Microsoft Bing to allow users access to real-time information from the internet. </p><blockquote>“Meta AI is your basic assistant that you can talk to like a person.”</blockquote><p>In addition to answering questions, and talking with users, the newly unveiled bot can generate images, leveraging a new image generation tool called Emu that Meta trained on 1.1 billion pieces of data, including photos and captions shared by users on Facebook and Instagram.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/78edb88b-e553-4ac7-b538-8eaf377270cf.jpg\"  /><figcaption style=\"text-align: center;\"><em>Zuckerberg unveiled the new Meta AI chatbot at the Connect Event. Source: Meta</em></figcaption></figure><p>Noting Meta AI’s main point of difference from competitor ChatGPT, Zuckerberg said that instead of creating a one-size-fits-all chatbot, Meta’s overarching strategy was to create different AI products for different use cases. </p><p>As an example, he showed how Meta AI would be slightly different in each of the company’s social media apps, providing an example of how it could be added to group chats on Facebook Messenger to assist with organizing travel plans. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/a6c03f90-e8e0-4775-a14c-8d2b350b0aa2.png\"  /><figcaption style=\"text-align: center;\"><em>Meta AI answering a user’s question about cocktails. Source: Meta</em></figcaption></figure><p>Zuckerberg said that Meta’s chatbots aren’t just intended to transmit helpful information. They are also designed to be conversational and entertaining. </p><p>Showing off its entertainment-focused AI products, Meta also announced a collection of chatbots based on approximately 30 celebrities, including Paris Hilton, Snoop Dogg and former NFL player Tom Brady.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/a69d7deb-75f5-4237-8737-6ae69dfae92f.jpg\"  /><figcaption style=\"text-align: center;\"><em>Snoop Dogg as an interactive Dungeons &amp; Dragons dungeon master chatbot. Source: Meta</em></figcaption></figure><p>According to Meta, the new AI assistant will be available from Sept. 27 for a limited group of United States-based users on Facebook Messenger, Instagram, and WhatsApp. </p><p>Meta AI will also be available for users of the company’s new smart glasses scheduled for release on Oct. 17 for U.S. users, as well as its new Quest 3 VR device. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/elon-musk-sam-altman-bill-gates-discusses-ai-with-congress\"><strong><em>Elon Musk, Mark Zuckerberg and Sam Altman talk AI regs in Washington</em></strong></a></p><p>The same day as Meta's Connect event, OpenAI announced its chatbot ChatGPT will no longer be limited to data before 2021. </p><p>The updates are available immediately for Plus and Enterprise users using the GPT-4 model, according to a Sept. 27 post on X.</p><p>Before this update, ChatGPT suffered from an ever-widening gap in its knowledge base. Due to the nature of how AI models such as generative pre-trained transformers (GPT) are trained, ChatGPT’s knowledge base previously ended in 2021. Presumably the year it was finalized for production.</p><p><strong><em>AI Eye: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-real-ai-usecases-crypto-gemini-gpt-4-rival-roblox-assistant-ai-cheating/\"><strong><em>Real uses for AI in crypto, Google’s GPT-4 rival, AI edge for bad employees</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-28T04:29:32.000Z",
    "title": "Ethereum Price Faces Rejection But Bulls Are Not Out of Woods Yet",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-faces-rejection-1620/",
    "description": "Ethereum price is attempting a fresh increase above $1,620 against the US Dollar. ETH must settle above $1,620 and $1,650 to start a decent increase. Ethereum is attempting a recovery wave above the $1,600 level. The price is trading above $1,600 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support near $1,600 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a decent increase if there is a close above $1,620 and $1,650. Ethereum Price Holds Ground Ethereum’s price remained well-supported above the $1,580 level. ETH formed a base above $1,600 and recently moved a few points higher, like Bitcoin. There was a move above the $1,620 level but upsides were limited. A high was formed near $1,633 before there was a strong bearish reaction. The price trimmed most gains and revisited the $1,580 zone. A low is formed near $1,583 and the price is now rising. Ethereum is trading above $1,600 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support near $1,600 on the hourly chart of ETH/USD. On the upside, the price might face resistance near the $1,608 level or the 50% Fib retracement level of the recent decline from the $1,633 swing high to the $1,583 low. The next major resistance is $1,620. It is close to the 76.4% Fib retracement level of the recent decline from the $1,633 swing high to the $1,583 low. Source: ETHUSD on TradingView.com A push above $1,620 might send Ether further higher in the coming sessions. The main hurdle is still near the $1,650 and $1,660 levels. If the bulls succeed in clearing the $1,660 hurdle, the price could start a decent increase toward the $1,720 resistance. Any more gains might open the doors for a move toward $1,800. Another Drop in ETH? If Ethereum fails to clear the $1,620 resistance, it could start another decline. Initial support on the downside is near the $1,600 level and the trend line. The next key support is $1,580, below which the price could test the $1,540 support. A downside break below the $1,540 support might spark strong bearish moves. In the stated case, there could be a drop toward the $1,450 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,580 Major Resistance Level – $1,620"
  }
]