[
  {
    "source": "Decrypt",
    "date": "2024-02-07T01:47:22.000Z",
    "title": "People Are Using Basic AI to Bypass KYC —But Should You?",
    "url": "https://decrypt.co/216188/ai-generated-fake-id-bypass-kyc-aml-banks-crypto-onlyfakes",
    "description": "For $15 you can get an AI-generated ID to open a bank account, unban your crypto, and open the gates that anti-money laundering measures closed."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-07T02:00:35.000Z",
    "title": "Judge Orders Ripple to Comply With SEC’s New Discovery Requests Concerning XRP",
    "url": "https://news.bitcoin.com/judge-orders-ripple-to-comply-with-secs-new-discovery-requests-concerning-xrp/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/ripple-sec-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/ripple-sec-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ripple-sec-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ripple-sec-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ripple-sec-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ripple-sec-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ripple-sec-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ripple-sec.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A federal judge has ruled in favor of the U.S. Securities and Exchange Commission (SEC) and ordered Ripple to comply with the regulator&#x2019;s post-complaint discovery requests concerning XRP. Ripple must also answer an interrogatory regarding the amount of XRP institutional sales proceeds it received after the SEC complaint was filed. Judge Grants SEC&#x2019;s Motion Against [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-07T02:00:41.000Z",
    "title": "US Treasury Secretary Janet Yellen Urges Congress To Pass Crypto Legislation",
    "url": "https://www.newsbtc.com/news/us-treasury-secretary-janet-yellen-urges-congress-to-pass-crypto-legislation/",
    "description": "In a recent statement before the House of Representatives, US Treasury Department Secretary Janet Yellen emphasized the need for Congress to pass legislation that provides clarity and regulation in the crypto markets.  Secretary Yellen Calls For Action ‘Digital Asset Risks’  During the Financial Committee hearing, Yellen highlighted the “risks” associated with digital assets and called for measures to address potential vulnerabilities and non-compliance with applicable laws and regulations. Yellen specifically mentioned concerns related to runs on crypto-asset platforms, stablecoins, and the “proliferation” of platforms acting outside regulatory boundaries.  The Treasury Secretary stressed the importance of enforcing existing rules and regulations while urging Congress to enact legislation specifically targeting stablecoins and “non-securities” crypto assets in the spot market. Related Reading: Bitcoin, Solana Take Center Stage In $721 Million In Institutional Inflows Notably, Taylor Barr, head of policy at the blockchain trade association Chamber of Digital Commerce, pointed out that the bipartisan FIT for the 21st Century Act, led by Representative French Hill, aligns with Yellen&#8217;s call for market structure and regulation. Hill, a proponent of the legislative environment for crypto, previously highlighted the progress made in the House of Representatives. He emphasized passing the first comprehensive regulatory framework for digital assets and the prudent approach to stablecoins.  Furthermore, Hill believes that these initiatives address significant “regulatory gaps” and contribute to the crypto industry&#8217;s growth. Pro-Crypto Stance And Legislative Initiatives Align Barr also commended the Clarity for Payment Stablecoins Act proposed by the Chairman of the US Financial Committee, Patrick McHenry.  This act aims to establish consistent oversight and consumer protection for payment stablecoins, incorporating successful state-level regulations and striking a balance between innovation and regulatory certainty. McHenry, who has been vocal about the importance of the US leading the financial system of the future, has already emphasized the bipartisan progress on legislation to address the regulatory challenges posed by digital assets.  McHenry called for the “completion of the job,” highlighting the Clarity for Payment Stablecoin Act as a crucial step towards establishing a federal framework for stablecoins. Related Reading: Solana Suffers 11th Outage In 2 Years, SOL Price Drops 3% Overall, the convergence of Secretary Yellen&#8217;s call for regulation, Representative Hill&#8217;s legislative initiatives, and Chairman McHenry&#8217;s pro-crypto stance reflect a growing momentum toward establishing a comprehensive regulatory framework for the crypto industry.  However, it remains to be seen how Secretary Yellen&#8217;s proposed regulatory enforcement ideas and proposals will strike a balance between fostering innovation, as emphasized by McHenry and Hill while ensuring the growth of nascent technology.  As discussions on crypto legislation continue, the industry eagerly anticipates the outcome, seeking a regulatory environment that provides clarity and consumer protection and positions the United States at the forefront of digital asset innovation. Featured image from Shutterstock, chart from TradingView.com "
  }
]