[
  {
    "source": "Cointelegraph",
    "date": "2023-05-26T18:46:16.000Z",
    "title": "Atlanta Fed explains Web3 finance, including XRP ‘international payment medium’ ",
    "url": "https://cointelegraph.com/news/atlanta-fed-explains-web3-finance-including-xrp-international-payment-medium",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/eea44e5f-9e34-4028-9292-dfc8b05b4a84.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The highly accessible introductory text mentions all the concepts and names a curious reader would need, along with some assessments.</p>\n                    <p><p>The Federal Reserve Bank of Atlanta has piqued the interest of the crypto community with a recent publication in its Policy Hub series on the implications of Web3 for financial services. The 17-page paper by Christine Parlour, a professor at the University of California, Berkeley Haas School of Business, is intended as a basic text, and is noteworthy for its completeness.</p><p>The paper <a href=\"https://www.atlantafed.org/-/media/documents/research/publications/policy-hub/2023/05/15/03--introduction-to-web3-with-implilcations-for-financial-services.pdf\" target=\"_blank\" rel=\"noopener nofollow\">begins</a> with an discussion of blockchains, explaining that “data are sorted and stored in specific locations called ‘wallets’ or ‘addresses.’” After providing the necessary background, Parlour looks at decentralized finance (DeFi) and financial infrastructure.</p><p>Parlour mentions the regulatory challenges of decentralized autonomous organizations (DAOs), which do not have “an obvious legal entity” to engage with. Furthermore:</p><blockquote>“The darker side of using tokens as collateral is that it generates interconnectedness among various protocols, which makes estimating or understanding systemic risk more challenging for regulators.”</blockquote><p>Parlour’s discussion is rich with brand names of lending protocols and stablecoins. </p><p>Web3 financial infrastructure provides advantages over traditional finance in the cost and speed of transacting, Parlour says. Trade finance can be significantly improved through cost reductions along the supply chain, for example.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ripple-acquires-swiss-blockchain-custody-firm-metaco-for-250m\">Ripple acquires Swiss blockchain custody firm Metaco for $250M</a></em></strong></p><p>The paper touches on central bank digital currency (CBDC) as it discusses foreign exchange and <a href=\"https://cointelegraph.com/news/bank-of-international-settlement-will-test-defi-implementation-in-forex-cbdc-markets\">looks at the recently launched Project Mariana</a> that attempts to apply DeFi protocols for foreign exchange. Parlour mentions Stellar and Ripple and describes Ripple’s XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) token as “envisioned as an international payment medium or wholesale settlement coin.” </p><p>Ripple has garnered much attention for its <a href=\"https://cointelegraph.com/news/ripple-montenegro-sign-deal-on-project-for-unspecified-national-digital-currency\">deals with states such as Montenegro</a> for the development of CBDCs. There has been much speculation about United States Federal Reserve plans to introduce a CBDC, which the Fed has not confirmed. Parlour gives no indication of any plans of this type, or that the Fed is thinking of using XRP for any purpose. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Atlanta Fed released a report re: Web3 &amp; finance that mentions <a href=\"https://twitter.com/hashtag/Ripple?src=hash&amp;ref_src=twsrc%5Etfw\">#Ripple</a>. They describe <a href=\"https://twitter.com/hashtag/XRP?src=hash&amp;ref_src=twsrc%5Etfw\">#XRP</a> as an &quot;international payment medium or wholesale settlement coin.&quot;  &quot;Wholesale settlement&quot; is interesting context. Also a brief overview of Project Mariana.<a href=\"https://t.co/pzazPU8zvu\">https://t.co/pzazPU8zvu</a> <a href=\"https://t.co/2LAC74RwSR\">pic.twitter.com/2LAC74RwSR</a></p>&mdash; WrathofKahneman (@WKahneman) <a href=\"https://twitter.com/WKahneman/status/1661786573506232321?ref_src=twsrc%5Etfw\">May 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ripple <a href=\"https://cointelegraph.com/news/lawyer-lays-out-his-reasoning-on-why-xrp-is-not-a-security\">is also in a legal dispute</a> with the Securities and Exchange Commission over the status of XRP as a security.</p><p>In addition, Parlour discusses tokenized bank deposits, a concept promoted by the USDF Consortium, whose <a href=\"https://cointelegraph.com/news/us-house-stablecoin-hearing-focuses-on-competing-bills-for-regulation\">CEO Robert Morgan recently told</a> a U.S. House of Representatives hearing about that technology, describing it as a “third way” between traditional finance and DeFi. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ripple-visa-hong-kong-cbdc-pilot-huobi-token-allegations-asia-express/\">Ripple, Visa join HK CBDC pilot, Huobi accusations, GameFi token up 300%: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-26T18:59:11.000Z",
    "title": "Circle launches Euro Coin on Avalanche",
    "url": "https://cryptoslate.com/circle-launches-euro-coin-on-avalanche/",
    "description": "<p>Circle, the digital fintech firm most famous as the issuer of the USDC stablecoin and, more recently, Euro Coin, has unveiled the launch of Euro Coin on the Avalanche blockchain.  Circle anticipates the launch to be the first of many multi-chain launches for its reportedly fully-backed euro-denominated stablecoin. Like USDC, Euro Coin is designed to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/circle-launches-euro-coin-on-avalanche/\">Circle launches Euro Coin on Avalanche</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T18:41:43.000Z",
    "title": "Cardano price analysis: ADA recovers at $0.3632 after a bullish movement",
    "url": "https://www.cryptopolitan.com/cardano-price-analysis-2023-05-26/",
    "description": "Cardano price analysis shows a bullish trend forming, with the price of ADA breaking above the $0.3545 support zone and climbing up to a high of $0.3633 earlier today. ADA kicked off today&#8217;s trading session on a low note before steadily rising, reaching the $0.3632 mark.&#160; ADA is now trading around the $0.3632 level and ... <a title=\"Cardano price analysis: ADA recovers at $0.3632 after a bullish movement\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-analysis-2023-05-26/\" aria-label=\"More on Cardano price analysis: ADA recovers at $0.3632 after a bullish movement\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-26T18:43:38.000Z",
    "title": "Ledger CEO explains the company’s path to regain user trust",
    "url": "https://crypto.news/ledger-ceo-explains-the-companys-path-to-regain-user-trust/",
    "description": "In a recent blog post, Pascal Gauthier, Chairman and CEO of Ledger, addressed concerns over the company's new product, Ledger Recover. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-26T19:00:19.000Z",
    "title": "Why This Signal Means Uniswap’s Bear Run Is Almost Over",
    "url": "https://www.newsbtc.com/news/uniswap/why-this-signal-means-uniswaps-bear-run-is-almost-over/",
    "description": "The price of Uniswap, the largest decentralized exchange by trading volume, is down roughly 35% from Q1 2023 peaks. Even so, on-chain data from Etherscan shows that there has been a steady increase in the number of UNI holders in the past two days. As of May 13, there were 369,646 UNI holders. Since then, the number has increased to over 370,100 as of May 26. During this time, UNI prices have remained stable but relatively high. Based on the UNIUSDT chart, the prices have found support around $4.9. However, prices have increased by approximately 10% over the past two weeks, rising to $5.4. Although the number of UNI holders may not directly affect the prices, there is a clear correlation between the demand for UNI and the increase in token prices. Related Reading: Toncoin (TON) Continues Downward Trend As Bears Maintain Control Several factors could have provided tailwinds for UNI, the governance token of Uniswap.  Apple Jail Break On May 23, Uniswap’s mobile wallet was released from what Uniswap Labs, the team maintaining Uniswap, said was “Apple jail.”  With this jailbreak, users can download the Uniswap Wallet, that’s non-custodial like MetaMask.  Through this wallet, users can buy and sell various supported cryptocurrencies.  This announcement is bullish because as more users opt for Uniswap Wallet, the demand for the decentralized exchange could rise, increasing its dominance and stature.  While MetaMask remains the most dominant Ethereum and Ethereum Virtual Machine (EVM) wallet enabling the storing and trading of various tokens, even using processors like PayPal, the popularity of Uniswap could see Uniswap Wallet gnaw market share.  Presently, Uniswap Labs said their wallet could support the trading of tokens across Ethereum, Polygon, Optimism, and Arbitrum. Uniswap To Launch On Base? Earlier on, the Uniswap contributors proposed the deployment of the DEX v3 on Coinbase’s Base.  Among supporters of this proposal is GFX Labs, one of the largest UNI holders and supporters of Uniswap’s expansion to other chains. Recently, GFX Labs voted for the launch of the DEX on BNB Smart Chain (BSC) and MoonBeam.  Even so, before voting starts, the proposal will undergo a “temperature check-up” to gauge community support. If there is majority support, it will proceed to the next step. Uniswap v3 is the latest iteration of the DEX, introducing the concept of concentrated liquidity for higher capital efficiency and more return on investment (ROI) for liquidity providers.  Base is a layer-2, open-source, and EVM-compatible platform by Coinbase, one of the largest cryptocurrency exchanges. Related Reading: JPMorgan Predicts Bitcoin (BTC) To Revisit $45,000, Here’s Why It is unclear whether the above-spurred demand for UNI, pushed the number of holders higher in the last week.  However, this could suggest that the project is generating interest, which may support future token prices. Feature Image From Canva, Chart From TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-26T18:45:20.000Z",
    "title": "Gaming Represents the ‘Largest Scale Opportunity’ for Crypto, Says Polygon (MATIC) Co-Founder",
    "url": "https://dailyhodl.com/2023/05/26/gaming-represents-the-largest-scale-opportunity-for-crypto-says-polygon-matic-co-founder/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/gaming-largest-scale-says.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/gaming-largest-scale-says.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/gaming-largest-scale-says.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/gaming-largest-scale-says.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/gaming-largest-scale-says.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/gaming-largest-scale-says.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/gaming-largest-scale-says.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The future of crypto lies with gaming, according to Sandeep Nailwal, the co-founder of Ethereum (ETH) layer-2 scaling solution Polygon (MATIC). Nailwal conducted a Reddit ask-me-anything (AMA) session on Thursday and Friday, responding to questions about his project and the crypto space at large. When asked about potential real-life use cases for the blockchain, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/26/gaming-represents-the-largest-scale-opportunity-for-crypto-says-polygon-matic-co-founder/\">Gaming Represents the ‘Largest Scale Opportunity’ for Crypto, Says Polygon (MATIC) Co-Founder</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-26T18:41:32.000Z",
    "title": "Top Crypto Analyst Spots ‘Moment of Truth’ for Ethereum (ETH), Highlights Bitcoin’s (BTC) Next Big Move",
    "url": "https://dailyhodl.com/2023/05/26/top-crypto-analyst-spots-moment-of-truth-for-ethereum-eth-highlights-bitcoins-btc-next-big-move/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/BTC-ETH-big-catch.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/BTC-ETH-big-catch.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/BTC-ETH-big-catch.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/BTC-ETH-big-catch.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/BTC-ETH-big-catch.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/BTC-ETH-big-catch.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/BTC-ETH-big-catch.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says Ethereum (ETH) is facing a &#8220;moment of truth&#8221; as he maps out potentialities for Bitcoin&#8217;s (BTC) next big move. Crypto trader Justin Bennett tells his 112,500 Twitter followers that ETH&#8217;s price to keep an eye on is $1,835. &#8220;Moment of truth for ETH here at $1,835. Sustained break above and we [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/26/top-crypto-analyst-spots-moment-of-truth-for-ethereum-eth-highlights-bitcoins-btc-next-big-move/\">Top Crypto Analyst Spots ‘Moment of Truth’ for Ethereum (ETH), Highlights Bitcoin’s (BTC) Next Big Move</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]