[
  {
    "source": "Cointelegraph",
    "date": "2024-01-04T00:41:31.000Z",
    "title": " ENS token surges 70% as Vitalik Buterin lauds platform ‘super important’  ",
    "url": "https://cointelegraph.com/news/ens-token-surges-70-vitalik-buterin-lauds-platform-super-important",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvODQwMDc4MjItMDYwNS00ZTlmLWJjNjYtYjI2MmQ4NmFkZDRlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The price of ENS token rocketed up from yearly lows as Vitalik Buterin lauded the importance of Ethereum Name Service. </p>\n                    <p><p>The governance token of the Ethereum Name Service (ENS) surged as high as 72% on Jan. 3 after the domain platform received praise from Ethereum co-founder Vitalik Buterin. </p><p>In a Jan. 3 post to X (formerly Twitter) Buterin lauded the Ethereum Name Service as “super important” and reiterated that the service should remain accessible and affordable to all users of the Ethereum network, especially those on layer-2 networks.</p><p>“All L2s should be working on (trustless, merkle-proof-based) CCIP resolvers, so that we can have ENS subdomains registerable, updateable and readable directly on L2s,” said Buterin.</p><p><a href=\"https://cointelegraph.com/news/ens-token-surges-70-vitalik-buterin-lauds-platform-super-important\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-04T01:00:16.000Z",
    "title": "Crypto community divided as UniSat Wallet adopts Ordinals Jubilee upgrade proposal",
    "url": "https://cryptoslate.com/crypto-community-divided-as-unisat-wallet-adopts-ordinals-jubilee-upgrade-proposal/",
    "description": "<p>UniSat Wallet recently confirmed its alignment with the upcoming Ordinals Jubilee upgrade amid a broader discussion about the evolution and governance of the BRC-20 token standard, which operates on the Ordinals Protocol. UniSat Wallet, known for its role in the Ordinals marketplace, announced plans to adhere to the Ordinals Jubilee upgrade, ensuring that the BRC-20 [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/crypto-community-divided-as-unisat-wallet-adopts-ordinals-jubilee-upgrade-proposal/\">Crypto community divided as UniSat Wallet adopts Ordinals Jubilee upgrade proposal</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T00:56:29.000Z",
    "title": "Crypto market sees $500m+ liquidated in 4 hours",
    "url": "https://www.cryptopolitan.com/crypto-market-sees-500m-liquidated-4-hours/",
    "description": "In a dramatic turn of events that has left the crypto world reeling, over $500 million was wiped off the crypto market in a mere four hours. This staggering loss is attributed to a significant drop in Bitcoin’s value, spurred by growing apprehensions about the rejection of Spot Bitcoin ETFs. The crypto giant tumbled as [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T00:52:53.000Z",
    "title": "Saudi Arabia makes a BRICS blunder – What went wrong?",
    "url": "https://www.cryptopolitan.com/saudi-arabia-makes-a-brics-blunder/",
    "description": "Saudi Arabia, a nation known for its strategic geopolitical moves, recently made headlines with a decision that has left many international observers scratching their heads. The Kingdom&#8217;s choice to join the BRICS group, comprised of Brazil, Russia, India, China, and South Africa, has raised questions about its implications for Saudi Arabia&#8217;s longstanding alliances, particularly with [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-04T01:00:30.000Z",
    "title": "From Bullish To Bearish, Bitcoin Plunges More Than 6% Amid Matrixport’s Contradictory Reports",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-plunges-more-than-6-amid-matrixports-contradictory-reports/",
    "description": "Matrixport, a crypto financial services platform, has recently made headlines with the release of two conflicting articles on January 2nd about the future of Bitcoin (BTC). The first publication, radiating optimism, projected that Bitcoin’s price could soar to $50,000 in January, spurred by the potential approval of Bitcoin spot exchange-traded funds (ETFs). This bullish stance was further grounded by disclosing a possible announcement that could happen on January 8th, 9th, or 10th. Related Reading: Matrixport Foresees Bitcoin Hitting $50,000 Price Mark: Here’s When Matrixport’s Sudden Shift: A Bullish Sentiment And Then Bearish Counterpoint Matrixport&#8217;s initial bullish report highlighted the transformative impact a Bitcoin spot ETF approval could have on the crypto market. The anticipated approval is seen as a &#8220;pivotal&#8221; moment that would &#8220;legitimize&#8221; Bitcoin in the eyes of institutional investors and potentially unlock a significant influx of capital into the crypto market. This sentiment echoed the growing optimism within the crypto community, with many stakeholders eagerly awaiting regulatory endorsements that could catalyze Bitcoin&#8217;s ascent. However, in a surprising twist, Matrixport released a second article later the same day titled “Why the SEC will REJECT Bitcoin Spot ETFs again.” This piece presented a starkly bearish perspective, contrasting their earlier optimistic forecast. The article emphasized the political composition of the US Securities and Exchange Commission (SEC), noting that the current Democratic dominance and Chair Gary Gensler’s cautious stance towards crypto might &#8220;diminish the likelihood of a spot ETF approval.&#8221; The report argued that such approval would validate Bitcoin as an alternative store of value, a move Gensler &#8220;might not be ready to make.&#8221; The firm noted in the bearish article: An ETF would certainly enable crypto overall to take off, and based on Gensler’s comments in December 2023, he still sees this industry in need of more stringent compliance. From a political perspective, there is no reason to approve a bitcoin spot ETF that would legitimize Bitcoin as an alternative store of value. Bitcoin Plunge And Crypto Community Reaction Matrixport&#8217;s bearish outlook had immediate repercussions in the crypto market. Bitcoin experienced a notable decline, shedding around 6% of its value and slipping below the $43,000 mark. This downturn wasn&#8217;t isolated to Bitcoin alone; Ethereum and other altcoins also saw significant drops, with Solana plummeting by nearly 10%. Data from Coinalyze indicated over $400 million in altcoin liquidations, with long positions bearing the brunt of this market shift. Largest total market liq event since the uptrend from 25k began in August. Largest alts liq event in 2 years. Brought to you by a Matrixport intern. pic.twitter.com/4z71FbkUfB — Hsaka (@HsakaTrades) January 3, 2024 The publication of these contrasting articles by Matrixport ignited a wave of controversy within the crypto community. Some observers pointed to Matrixport&#8217;s founder, Jihan Wu, a prominent Bitcoin Cash supporter, leading to speculations about the firm&#8217;s intentions. This is the guy who founded Matrixport, a supporter of Bitcoin Cash. If anyone believes anything that Matrixport publishes, I have a bridge to sell to you. pic.twitter.com/cxaxSOcDx7 — James Van Straten (@jimmyvs24) January 3, 2024 This revelation sparked heated discussion, with many saying that Matrixport’s actions were driven by market manipulation motives, especially in light of the market turbulence that followed the viral articles. Related Reading: Bitcoin Crashes To $41,500 As ETF Approval Hangs In Balance: Experts Despite the current market condition, as always, some are still bullish, while some even refuse to believe MatrixPort was the cause of this market downturn. Mike Alfred, an investor serving as a board member of BTC miner Iris Energy, already shared his bullish take, noting, &#8220;Big money isn’t buying this.&#8221; Top tier Bitcoin miners have shaken off the Matrixport market manipulation and have gone green or moved back towards breakeven. Big money isn’t buying this. — Mike Alfred (@mikealfred) January 3, 2024 Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-04T01:00:04.000Z",
    "title": "Analyst Predicts ‘Mind-Blowing’ Parabolic Leg for Solana, Names One Altcoin That Could Outperform Other Coins",
    "url": "https://dailyhodl.com/2024/01/03/analyst-predicts-mind-blowing-parabolic-leg-for-solana-names-one-altcoin-that-could-outperform-other-coins/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/mind-blowing-parabolic-leg.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/mind-blowing-parabolic-leg.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/mind-blowing-parabolic-leg.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/mind-blowing-parabolic-leg.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/mind-blowing-parabolic-leg.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/mind-blowing-parabolic-leg.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/mind-blowing-parabolic-leg.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto strategist who nailed the Bitcoin&#8217;s (BTC) price floor during the 2018 bear market thinks Solana (SOL) is gearing up for a steep move to the upside. Pseudonymous analyst Bluntz tells his 234,400 followers on the social media platform X that Solana appears to be forming a bullish reversal pattern on the one-hour chart. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/03/analyst-predicts-mind-blowing-parabolic-leg-for-solana-names-one-altcoin-that-could-outperform-other-coins/\">Analyst Predicts ‘Mind-Blowing’ Parabolic Leg for Solana, Names One Altcoin That Could Outperform Other Coins</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]