[
  {
    "source": "Crypto Daily",
    "date": "2024-03-17T19:36:45.000Z",
    "title": "DeeStream (DST) Emerges as the New Darling: Filecoin (FIL) and Near Protocol (NEAR) Communities Enthralled by Its Potential",
    "url": "https://cryptodaily.co.uk/2024/03/deestream-dst-emerges-as-the-new-darling-filecoin-fil-and-near-protocol-near-communities-enthralled-by-its-potential",
    "description": "Many doubters laughed at cryptocurrencies in the early days, with many calling Bitcoin (BTC) fake money when it launched. However, the cryptocurrency market has proved doubters wrong many times over. Filecoin (FIL) and Near Protocol (NEAR) were notable additions to the market and they have consistently proved that the crypto market is here to stay."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-17T19:31:53.000Z",
    "title": "Altcoins to Watch - The Next Batch Set to Skyrocket!",
    "url": "https://cryptodaily.co.uk/2024/03/altcoins-to-watch-the-next-batch-set-to-skyrocket",
    "description": "Scrutinize the potential of altcoins set to spike in the cryptocurrency market. This article provides detailed insights on the next batch of altcoins anticipated to skyrocket, helping investors make informed decisions."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-17T19:25:58.000Z",
    "title": "DeeStream (DST) Captivates Bitcoin Cash (BCH) and Stellar (XLM) Admirers: A Presale Poised for Historical Gains",
    "url": "https://cryptodaily.co.uk/2024/03/deestream-dst-captivates-bitcoin-cash-bch-and-stellar-xlm-admirers-a-presale-poised-for-historical-gains",
    "description": "The general cryptocurrency market has continued to experience a positive influence from the bullish 2023 trend of leading cryptocurrencies. This spillover led to a significant surge of altcoins within a short timeframe, promising a possible bullish phase in the crypto market. During this phase, altcoins such as Bitcoin Cash (BCH) and Stellar (XLM) have taken the baton with striking growth in the market."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-17T19:20:39.000Z",
    "title": "Breaking Crypto Analysis: Altcoins Ready for Massive 2024 Gains",
    "url": "https://cryptodaily.co.uk/2024/03/breaking-crypto-analysis-altcoins-ready-for-massive-2024-gains",
    "description": "Dive into our breaking crypto analysis as we predict the altcoins primed for massive growth in 2024. Get ahead of the game with valuable insights and expert opinion on these potential crypto game-changers."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-17T19:13:49.000Z",
    "title": "OKX & Binance Rival Fezoo (FEZ) presale has Solana (SOL) & Polygon (MATIC) holders scrambling to buy in early",
    "url": "https://cryptodaily.co.uk/2024/03/okx-binance-rival-fezoo-fez-presale-has-solana-sol-polygon-matic-holders-scrambling-to-buy-in-early",
    "description": "For a long time, centralized exchanges like OKX and Binance have dominated the crypto exchange space. Many crypto enthusiasts, both seasoned and newbie alike have relied on these platforms to participate in the crypto ecosystem."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-17T19:30:24.000Z",
    "title": "BTC and ETH Derivative Tokens Dominate by Securing Several Top Positions in the Crypto Economy",
    "url": "https://news.bitcoin.com/btc-and-eth-derivative-tokens-dominate-by-securing-several-top-positions-in-the-crypto-economy/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/candies-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/candies-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/candies-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/candies-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/candies-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/candies-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/candies-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/candies.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Throughout this month, bitcoin and ethereum have risen to their highest valuations in years. These two pivotal crypto assets have substantially influenced the cryptocurrency market, with bitcoin currently holding a 51.9% market dominance and ethereum at 17% as of mid-March 2024. Furthermore, in recent years, derivative tokens of bitcoin and ether have garnered significant popularity. [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-17T19:35:26.000Z",
    "title": "Indian Finance Minister: crypto isn’t currency, G20 must regulate",
    "url": "https://crypto.news/indian-finance-minister-crypto-isnt-currency-g20-must-regulate/",
    "description": "Indian Finance Minister Nirmala Sitharaman has taken a firm stance on Bitcoin (BTC) and other digital assets, emphasizing that they cannot be considered currencies. "
  },
  {
    "source": "BTCManager",
    "date": "2024-03-17T19:34:17.000Z",
    "title": "XRP poised for gains as new AI altcoin eyes major growth",
    "url": "https://crypto.news/xrp-poised-for-gains-as-new-ai-altcoin-eyes-major-growth/",
    "description": "Amid predictions of a bull market, XRP is anticipated to surpass its all-time high, bolstered by legal victories. Concurrently, InQubeta, a new cryptocurrency focused on democratizing AI investments, successfully raises funds through its presale, highlighting its potential in the evolving crypto landscape. #partnercontent "
  },
  {
    "source": "BTCManager",
    "date": "2024-03-17T19:15:41.000Z",
    "title": "Reddit IPO oversubscribed 5x, targets $6.5b valuation: report",
    "url": "https://crypto.news/reddit-ipo-5x-oversubscribed-6-5-billion-valution-report/",
    "description": "San Francisco-based Reddit — which owns Bitcoin (BTC), Ethereum (ETH), and Polygon (MATIC) according to its IPO filing — is reportedly between four and five times oversubscribed."
  }
]