[
  {
    "source": "Cointelegraph",
    "date": "2024-02-27T03:46:57.000Z",
    "title": " ENS to end eth.link domain suit after DAO greenlights $300K settlement ",
    "url": "https://cointelegraph.com/news/ens-dao-approves-300k-domain-manifold-lawsuit-settlement",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNzFhMzgxODgtYjVkYy00MTY0LWEzMzYtNTJlY2I4ODQyNzc3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>ENS Labs’ has been given approval from its DAO to settle and dismiss a legal fight over the ownership of the eth.link domain.</p>\n                    <p><p>Ethereum Name Service (ENS) developer is set to end its stoush with Manifold Finance over ownership of the eth.link domain after its decentralized autonomous organization (DAO) approved a $300,000 settlement to Manifold. </p><p>An ENS DAO <a href=\"https://snapshot.org/#/ens.eth/proposal/0x456ccb438eed5d189cbe51e5e36a88d2bb4dc0c61f12f6d9e310a7ba4798d5fc\" target=\"_blank\" rel=\"noopener nofollow\">vote</a> ended on Feb. 26 saw about 88% approve the settlement — which will see ENS Labs drop its lawsuit and pay $300,000 to Manifold but be able to retain the domain name. Meanwhile, 84% approved a $750,000 reimbursement of ENS Labs’ legal costs.</p><p>The approved settlement ends an 18-month-long saga that saw ENS Labs <a href=\"https://www.courtlistener.com/docket/64950616/1/ens-labs-ltd-v-godaddy-incorporated/\" target=\"_blank\" rel=\"noopener nofollow\">sue</a> Manifold and domain registrars GoDaddy and Dynadot in an Arizona District Court and win an <a href=\"https://www.courtlistener.com/docket/64950616/19/ens-labs-ltd-v-godaddy-incorporated/\" target=\"_blank\" rel=\"noopener nofollow\">order</a> to stop the domain from being transferred from its ownership.</p><p><a href=\"https://cointelegraph.com/news/ens-dao-approves-300k-domain-manifold-lawsuit-settlement\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-27T04:04:30.000Z",
    "title": "Can AI in Archaeology Unlock the Mysteries of Ancient History?",
    "url": "https://www.cryptopolitan.com/ai-in-archaeology-mysteries-ancient-history/",
    "description": "In a groundbreaking development at the intersection of technology and archaeology, AI in Archaeology has emerged as a transformative tool for unraveling some of the world&#8217;s oldest archaeological mysteries. With the recent triumph in the Vesuvius Challenge, where AI engineers successfully deciphered ancient Greek passages from a charred scroll, the realm of archaeology stands on [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-27T04:05:38.000Z",
    "title": "Ethereum Price Rally Stalls As Bitcoin Pumps But Bulls Are Not Done Yet",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-rally-3250/",
    "description": "Ethereum price climbed to a new multi-month high above $3,200. ETH is consolidating while Bitcoin is gaining pace above the $55,000 resistance. Ethereum extended its increase above the $3,200 resistance zone. The price is trading above $3,175 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $3,150 on the hourly chart of ETH/USD (data feed via Kraken). The pair could extend its increase toward $3,320 or even $3,450 in the near term. Ethereum Price Underperforms Bitcoin Ethereum price remained in a positive zone and extended its increase above the $3,050 resistance. ETH climbed above the $3,200 resistance, but upsides were contained after Bitcoin surged above $55,000. Ether even spiked above $3,250. A new multi-week high is formed near $3,274 and the price is now consolidating gains. It is trading above the 23.6% Fib retracement level of the upward move from the $3,041 swing low to the $3,274 high. There is also a key bullish trend line forming with support at $3,150 on the hourly chart of ETH/USD. The trend line is close to the 61.8% Fib retracement level of the upward move from the $3,041 swing low to the $3,274 high. Ethereum is now trading above $3,175 and the 100-hourly Simple Moving Average. Immediate resistance on the upside is near the $3,250 level. The first major resistance is near the $3,275 level. The next major resistance is near $3,320, above which the price might gain bullish momentum. Source: ETHUSD on TradingView.com If there is a move above the $3,400 resistance, Ether could even rally toward the $3,450 resistance. Any more gains might call for a test of $3,500. Are Dips Limited In ETH? If Ethereum fails to clear the $3,250 resistance, it could start a downside correction. Initial support on the downside is near the $3,200 level. The first major support is near the $3,150 zone and the trend line, below which Ether might test $3,130. The next key support could be the $3,100 zone. A clear move below the $3,100 support might send the price toward $3,050 or the 100-hourly Simple Moving Average. Any more losses might send the price toward the $2,880 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $3,150 Major Resistance Level – $3,250"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-27T04:00:54.000Z",
    "title": "Ethereum Exodus: Whales Withdraw $64 Million ETH From Exchanges, Bullish Signal?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-exodus-whales-withdraw-64-million-eth-from-exchanges-bullish-signal/",
    "description": "According to data from Lookonchain, an on-chain analytics platform, Ethereum (ETH), whales have withdrawn roughly $64.2 million worth of ETH from major exchanges. This significant movement of funds coincides with a notable uptick in the price of ETH, indicating an increasing interest in the asset. Related Reading: 800,000 ETH Flow Out Of Centralized Exchanges In 2024 – Bullish Sign For Ethereum Price? Ethereum Whales Movement Signals Confidence According to Lookonchain&#8217;s findings, much of the ETH supply has been shifted from exchange wallets to custodial wallets. The on-chain analytics platform reported that an Ethereum address labeled 0x8B94 had withdrawn an amount of 14,632 ETH, valued at approximately $45.5 million, from Binance. Lookonchain states these funds have been actively staked within six days, indicating a deliberate move towards adopting long-term investment strategies. The analysis from the platform also points out that another two fresh whale wallets have transferred 6,000 ETH, amounting to $18.7 million, from Kraken to undisclosed wallet addresses over the last two days. Whales are accumulating $ETH! 0x8B94 withdrew 14,632 $ETH($45.5M) from #Binance and staked it in the past 6 days.https://t.co/bywnrZ2glt 2 fresh whale wallets withdrew 6K $ETH($18.7M) from #Kraken in the past 2 days.https://t.co/0kEvOmiv3hhttps://t.co/90fqjJXsSu pic.twitter.com/J0ewl8S3OX — Lookonchain (@lookonchain) February 26, 2024 This trend suggests an increase in major investors to secure substantial amounts of Ethereum away from exchange platforms, potentially as a means of positioning for long-term asset appreciation. Further echoing this is a recent analysis from CryptoQuant&#8217;s Quicktake, which underscores a notable trend regarding Ethereum withdrawals from exchanges over the past few weeks. This observation relies on the &#8220;Exchange Reserve&#8221; metric, which monitors the quantity of ETH tokens held in the wallets of all centralized exchanges. When the value of this metric increases, it signifies that investors are depositing more assets than withdrawing them from centralized exchanges, indicating a buildup of Ethereum reserves. Conversely, a decline in the metric suggests a net outflow of assets from these platforms. According to data from CryptoQuant, over 800,000 ETH, equivalent to roughly $2.4 billion, has exited cryptocurrency exchanges since the beginning of the year. Such substantial outflows from these platforms typically indicate a surge in investor confidence in the Ethereum network and its native token. Ethereum&#8217;s Price Momentum And Potential For A Significant Breakout Meanwhile, Ethereum&#8217;s price has displayed bullish momentum, witnessing a 5.5% increase in the past week and reclaiming the crucial $3,000 mark. Financial guru Raoul Pal has drawn attention to Ethereum&#8217;s potential for a major breakout, pointing to a &#8220;dual-chart pattern&#8221; observed on the ETH/BTC chart. The ETH/BTC chart is an absolute stunner&#8230;and ready for the next big move the break of the mega wedge&#8230;lets see how is pans out&#8230; pic.twitter.com/5x4tJLjtJy — Raoul Pal (@RaoulGMI) February 25, 2024 Pal highlights a &#8220;mega wedge&#8221; pattern alongside an inner descending channel, indicating a consolidation phase with bullish potential. Related Reading: Ethereum Breaks Back Above $3,000, Will FOMO Lead To Top Again? Featured image from Unsplash, Chart from TradingView"
  }
]