[
  {
    "source": "Decrypt",
    "date": "2023-10-20T14:47:41.000Z",
    "title": "Nintendo Switch 2 Preview: Everything You Need to Know",
    "url": "https://decrypt.co/197793/nintendo-switch-2-rumors-leaks-latest-news",
    "description": "UPDATE: How powerful will the Switch 2 be? The latest leaks point to some serious capabilities. Here's everything we know so far."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-20T14:40:12.000Z",
    "title": "BTC price hits 2-month high amid bet Bitcoin will break $32K ‘soon’",
    "url": "https://cointelegraph.com/news/btc-price-2-month-high-bitcoin-break-32k",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/31fb123e-557d-4170-8d92-af69a933cf4b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin consolidates below $30,000, with the BTC price weekly close of interest to market analysts.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) tapped $30,000 into the Oct. 20 Wall Street open as analysts directed attention to the weekly close.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/62a7863f-4772-4d8d-b7fd-8b6666b30112.png\"><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>BTC price sets up weekly close showdown</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> captured new two-month BTC price highs of $30,233 on Bitstamp.</p><p>The pair <a href=\"https://cointelegraph.com/news/bitcoin-30k-xrp-price-ripple-legal-victory\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-30k-xrp-price-ripple-legal-victory/amp\">showed continued strength</a> during the Asia trading session, with a slight comedown taking place at the time of writing, taking the spot price back below $29,500.</p><p>With volatility still evident, market participants argued that a weekly candle close was needed in order to establish the rally’s true staying power.</p><p>For Keith Alan, co-founder of monitoring resource Material Indicators, the 100-week moving average (MA) at $28,627 was of particular importance.</p><p>“This move is one to watch, but what I’m watching for right now is to see if this Weekly candle closes above the 100-Week MA and if next week’s candle can stay above it with no wicks below,” he <a href=\"https://twitter.com/KAProductions/status/1715352240846721289\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in part of an X post on the day. </p><blockquote>“Some might consider that a confirmation of a bull breakout, but this market is known for squeezes and fake outs so I’m looking for more confirmations. For me BTC will also need to take out prior resistance at $30.5k, $31.5k and ultimately $33k to call a bull breakout confirmed and validated.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/786bcd8d-9c48-4102-9f3b-58a218ec2ce5.png\"><figcaption style=\"text-align: center;\"><em>BTC/USD 1-week chart with 100MA. Source: TradingView</em></figcaption></figure><p>Eyeing required support zones, popular trader Pentoshi flagged $28,900 as the line in the sand for bulls to hold.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/search?q=%24BTC&src=ctag&ref_src=twsrc%5Etfw\">$BTC</a> update <br><br>Would like to see shallow dips and now price maintain above 28.9-29.2k area <a href=\"https://t.co/12UUsbRRSq\">https://t.co/12UUsbRRSq</a> <a href=\"https://t.co/Mq01tU4B7T\">pic.twitter.com/Mq01tU4B7T</a></p>— Pentoshi  euroPeng  (@Pentosh1) <a href=\"https://twitter.com/Pentosh1/status/1715353518138077677?ref_src=twsrc%5Etfw\">October 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Tracking low-timeframe (LTF) market conditions, meanwhile, fellow trader Skew suggested that a sweep of late longs could result in an entry opportunity prior to upside resuming.</p><p>“I suspect longs are starting to fomo in here around $30K,” he <a href=\"https://twitter.com/52kskew/status/1715332959589507509\" target=\"_blank\" rel=\"noopener nofollow\">told</a> X subscribers alongside a chart of exchange order book data as $30,000 reappeared.</p><blockquote>“So if this LTF trend breaks a nice sweep could be a nice entry before higher wouldn't be surprised to see something like this play out.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/b6df996f-be40-446a-987e-600cd1297b76.png\"><figcaption style=\"text-align: center;\"><em>BTC/USD order book data. Source: Skew/X</em></figcaption></figure><h2>Forecast expects “mass adoption,” Bitcoin ETF approval</h2><p>In an optimistic longer-timeframe view, trading team Stockmoney Lizards predicted that resistance immediately above $30,000 would soon crack.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-long-term-investors-own-76-percent-btc\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-long-term-investors-own-76-percent-btc/amp\">Hodling hard: Bitcoin’s long-term investors own over 76% of all BTC for the first time</a></em></strong></p><p>Updating a chart fractal comparing BTC/USD in 2023 to its 2020 breakout, analysts argued that the time for significant upside is now. An approval of the United States’ first Bitcoin spot price exchange-traded fund (ETF) would form the clinching factor.</p><p>“31/32k will break soon,” part of accompanying commentary <a href=\"https://twitter.com/StockmoneyL/status/1715313700070908192\" target=\"_blank\" rel=\"noopener nofollow\">read</a>.</p><blockquote>“P.S.: Many of you will once more say: ‘But 2020 was after halving, here we are before’ — answer: doesn't matter. This year mass adoption / ETF approval will be THE driver.”</blockquote><p>Stockmoney Lizards referenced the upcoming <a href=\"https://cointelegraph.com/news/btc-price-models-130k-target-024-bitcoin-halving\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/btc-price-models-130k-target-024-bitcoin-halving/amp\">block subsidy halving</a> scheduled for April 2024.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/2edb4164-807c-403d-8f2e-a850d63cbbf9.png\"><figcaption style=\"text-align: center;\"><em>BTC/USD comparative chart. Source: Stockmoney Lizards/X</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-20T14:45:34.000Z",
    "title": "Incoming Tether CEO Paolo Ardoino promises real-time reserve transparency beginning 2024",
    "url": "https://cryptoslate.com/incoming-tether-ceo-paolo-ardoino-promises-real-time-reserve-transparency-beginning-2024/",
    "description": "<p>Paolo Ardoino, Tether&#8217;s incoming CEO, said the stablecoin issuer plans to publish real-time attestation of its reserve starting next year, Bloomberg reported on Oct. 20. Tether, due to its significant role in the cryptocurrency industry, has faced increasing pressure to enhance transparency regarding the reserves backing its USDT stablecoin, a digital asset pegged to the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/incoming-tether-ceo-paolo-ardoino-promises-real-time-reserve-transparency-beginning-2024/\">Incoming Tether CEO Paolo Ardoino promises real-time reserve transparency beginning 2024</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-20T14:47:43.000Z",
    "title": "Tether CTO Reveals Real-Time Reserves Reporting Launching in 2024",
    "url": "https://cryptobriefing.com/tether-reveals-real-time-reserves-2024/?utm_source=feed&utm_medium=rss",
    "description": "Tether moves to real-time reserves reporting in 2024 to address transparency concerns over the widely-used USDT stablecoin."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-20T14:57:52.000Z",
    "title": "Chamber of Digital Commerce alleges SEC is suing the equivalent of a “grocery store selling oranges”",
    "url": "https://crypto.news/chamber-of-digital-commerce-alleges-sec-is-suing-the-equivalent-of-a-grocery-store-selling-oranges/",
    "description": "The United States-based Chamber of Digital Commerce has joined a collective effort to challenge the lawsuit between the SEC and Binance."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-20T14:48:49.000Z",
    "title": "Circle to launch new smart contract platform",
    "url": "https://crypto.news/circle-to-launch-new-smart-contract-platform/",
    "description": "Circle has announced the launch of two new products enabling web2 developers to create and deploy decentralized applications easily. The Circle Gas Station and Circle Smart Contract Platform products will provide developers a way to access USDC balances and transactions&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-20T15:00:05.000Z",
    "title": "Shiba Inu Revival? Here’s Why A Resurgence May Be Imminent",
    "url": "https://www.newsbtc.com/news/shiba-inu-revival-heres-why-a-resurgence-may-be-imminent/",
    "description": "Shiba Inu (SHIB) has been displaying a bearish structure accompanied by a noticeable capital outflow, leading to a plunge in its value. Despite the prevailing technical indicators, there is a lingering possibility of a short-term range formation.  At present, the critical resistance on the charts is identified at $0.000007. Notably, this level experienced a brief shift to support earlier in the week, but the bullish momentum was ultimately unable to sustain its grip. As of the latest update, the current SHIB price on CoinGecko hovers at $0.00000692, with a moderate 24-hour rally of 3.5% and a modest seven-day gain of 1.2%. The recent descent below the trendline support does not necessarily invalidate its strength.  Frequently observed in technical analysis, assets often retest critical support levels to confirm their resilience before any substantial directional shift. If SHIB can promptly reclaim its position above this trendline, it might signal the commencement of a potentially bullish phase. Related Reading: ETH Price Watch: Impact On Price As Traders Ditch Bitcoin On Derivatives Market Shiba Inu: Struggle For Support Analyzing the four-hour chart, the market structure of SHIB took a bearish turn following the decline below the $0.00000693 mark, ultimately reaching the local lows of $0.00000673. Similar market movements were witnessed earlier this month, which led to the plotting of a set of Fibonacci levels.  Notably, the 61.8% and 78.6% levels failed to witness a successful H4 trading session closure above them, despite a brief spike to the $0.00000729 mark. In the last 12 hours, SHIB bulls have managed to put a temporary halt to the prevailing bearish momentum, thereby indicating a possibility of a bounce back towards the $0.000007 level. SHIB has a market cap of $4.1 billion today. Chart: TradingView.com Evaluating the moving averages, SHIB currently lies below both its short-term and long-term averages, historically indicating the presence of bearish momentum. However, considering the broader context, this positioning could potentially signify a consolidation phase, setting the stage for an imminent reversal in its trajectory. Potential Impact Of Current Market Trends On SHIB&#8217;s Long-term Outlook The recent market trends have raised concerns regarding SHIB&#8217;s long-term trajectory, with the bearish structure and substantial capital outflow posing significant challenges for the cryptocurrency. However, market analysts continue to highlight the potential for a short-term range formation despite the persisting technical indicators. As the cryptocurrency grapples with critical resistance levels and the possibility of retesting support, investors remain cautiously optimistic about the potential for a bullish phase. SHIB seven-day price action. Source: Coingecko Related Reading: Bitcoin SV Climbs 22% – A Close Look At The Factors Behind The Surge Notably, the recent drop below the trendline support has added to the uncertainty surrounding SHIB&#8217;s near-term performance. However, technical analysis suggests that a quick reclaim of the position above this trendline could serve as a crucial indicator for a potential bullish phase.  The recent positioning of SHIB below both its short-term and long-term moving averages has raised concerns about the persistence of bearish momentum. However, experts underline the importance of considering the broader context, emphasizing the potential for a consolidation phase that could pave the way for a reversal in SHIB&#8217;s market trajectory.  (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from BeChewy"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-20T14:41:12.000Z",
    "title": "Reviving the Euro Flow: Binance Users Rejoice as New Partnership Enables Cash Outs",
    "url": "https://www.crypto-news-flash.com/reviving-the-euro-flow-binance-users-rejoice-as-new-partnership-enables-cash-outs/?utm_source=rss&utm_medium=rss&utm_campaign=reviving-the-euro-flow-binance-users-rejoice-as-new-partnership-enables-cash-outs",
    "description": "<img width=\"1431\" height=\"805\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Binance-Smart-Chain.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance Smart Chain\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Binance-Smart-Chain.jpg 1431w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Binance-Smart-Chain-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Binance-Smart-Chain-1024x576.jpg 1024w\" sizes=\"(max-width: 1431px) 100vw, 1431px\" />Without specifying the exact names of the firms, the Binance cryptocurrency exchange announced that it had signed agreements with new fiat partners to enable seamless EUR payments including deposits, and withdrawals. The announcement follows regulatory scrutiny that led to several on and off-ramping service providers like Paysafe ending their business relationship with Binance earlier this [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-20T14:40:00.000Z",
    "title": "BIGTIME Price Rebounds, Bulls Eye $0.165 Resistance",
    "url": "https://coinedition.com/bigtime-price-rebounds-bulls-eye-0-165-resistance/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-51.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BIGTIME Skyrockets\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-51.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-51-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-51-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-51-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-51-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-51-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Despite a negative attempt to plummet the Big Time (BIGTIME) market, support at the intra-day low of $0.141 remained firm, resulting in a price bounce. This support level shows substantial purchasing demand at this price point, indicating that investors believe in BIGTIME&#8217;s future. The ensuing rebound recovered the price to $0.158, illustrating the market&#8217;s durability [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bigtime-price-rebounds-bulls-eye-0-165-resistance/\">BIGTIME Price Rebounds, Bulls Eye $0.165 Resistance</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]