[
  {
    "source": "Cointelegraph",
    "date": "2023-12-10T08:59:36.000Z",
    "title": " KyberSwap exploiter linked to $50M HXA token movement ",
    "url": "https://cointelegraph.com/news/kyber-swap-exploiter-linked-to-50m-hxa-token-movement",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYzVjMzNlMTItZDJmNS00MjM0LTk4NmEtNTU5NTg5MjI0Mjc1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Blockchain security firm Cyvers said the KyberSwap exploiter’s acquired funds were spread across various externally owned accounts (EOAs), now recognized as the top HXA token holders.</p>\n                    <p><p>Blockchain security firm Cyvers <a href=\"https://twitter.com/CyversAlerts/status/1733069135049904619\" target=\"_blank\" rel=\"noopener nofollow\">detected</a> a movement of $50 million in HXA tokens, the native utility token of the Herencia Artifex NFT project, linked to the KyberSwap exploiter. </p><p>The KyberSwap exploiter’s address got these tokens from an Ethereum address using the “transfer from function.” </p><p>Decentralized application (DApp) users commonly use the “transfer from” function. It refers to a mechanism by which one party (sender) can transfer or send tokens from the balance of another party (owner) to a third-party address. However, improper use or vulnerabilities in implementing such functions can lead to security concerns. </p><p><a href=\"https://cointelegraph.com/news/kyber-swap-exploiter-linked-to-50m-hxa-token-movement\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-10T09:07:55.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-10T09:06:32.000Z",
    "title": "Boston Dynamics Unveils Bittle X: A Voice-Controlled Robot Companion",
    "url": "https://www.cryptopolitan.com/boston-dynamics-unveils-bittle-x/",
    "description": "Boston Dynamics, a leader in robotics and automation technology, has revealed its latest creation: Bittle X. This palm-sized robot, priced at $225, is designed to follow voice commands, offering a versatile and interactive experience for users. Introducing Bittle X: A Compact and Affordable Robot Companion Boston Dynamics has been at the forefront of robotic innovation ... <a title=\"Boston Dynamics Unveils Bittle X: A Voice-Controlled Robot Companion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/boston-dynamics-unveils-bittle-x/\" aria-label=\"More on Boston Dynamics Unveils Bittle X: A Voice-Controlled Robot Companion\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-10T08:43:00.000Z",
    "title": "Crypto Industry in Georgia: Contributions and Positioning within the Global Context",
    "url": "https://www.cryptopolitan.com/crypto-industry-in-georgia-contributions/",
    "description": "Georgia, a vibrant epicenter of digital innovation, has emerged as a prominent player in the global cryptocurrency arena. Nestled at the crossroads of Eastern Europe and Western Asia, this nation has carved out a distinctive niche in the crypto world, distinguishing itself through a combination of regulatory foresight and technological adoption. Its trajectory in the ... <a title=\"Crypto Industry in Georgia: Contributions and Positioning within the Global Context\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-industry-in-georgia-contributions/\" aria-label=\"More on Crypto Industry in Georgia: Contributions and Positioning within the Global Context\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-10T08:43:00.000Z",
    "title": "How to Mint NFTs for Free",
    "url": "https://www.cryptopolitan.com/how-to-mint-nfts-for-free/",
    "description": "Non-Fungible-Tokens (NFTs) broke into the crypto market in 2021 and ever since, they&#8217;ve driven investments globally. NFTs are back on market track as the 2023 crypto market recovers from the worst winter in DeFi history. Besides that, NFT have also amassed a large community of creators and investors. This is one reason why there is ... <a title=\"How to Mint NFTs for Free\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-to-mint-nfts-for-free/\" aria-label=\"More on How to Mint NFTs for Free\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-12-10T08:53:10.000Z",
    "title": "Captain Faibik Bitcoin Price Analysis – Can Ethereum Break Above $2,200 ? Pullix Projected for 37x Growth",
    "url": "https://nulltx.com/captain-faibik-bitcoin-price-analysis-can-ethereum-break-above-2200-pullix-projected-for-37x-growth/",
    "description": "Bitcoin (BTC) closed the past month with a total surge of 12%, continuing its positive trend from October. It&#8217;s now forming an ascending triangle pattern, with a crucial upper boundary at $38,000. Captain Faibik projects a potential breakout in the altcoin market, which can lead to a market cap of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-10T08:42:58.000Z",
    "title": "Crypto Analyst Predicts 100% Price Surge For MATIC – Here’s What Needs To Happen",
    "url": "https://www.newsbtc.com/matic/crypto-analyst-predicts-100-price-surge-for-matic-heres-what-needs-to-happen/",
    "description": "MATIC, the native token of the Polygon network, has been on an exciting run in the past few weeks, like several other altcoins in the market. Despite the positive price performance, the cryptocurrency has not been able to return above the $1 mark, seemingly facing rejection at the $0.9 zone. However, it appears that the tides might be changing for MATIC following a crypto analyst’s projection.  Will MATIC Price Skyrocket 100% If This Happens? Prominent crypto analyst Ali Martinez has put forward their bullish projection for the MATIC price in the near future. In a post on the X platform, the analyst revealed that the altcoin could be set for a bullish breakout that could catapult its price to double its current value. Martinez’s prediction revolves around the symmetrical triangle pattern forming on the Polygon weekly price chart. Interestingly, the MATIC triangular formation is around the $0.96 price point, intersecting with the 50% Fibonacci retracement level. Keep your eyes on #Polygon! A daily or weekly candlestick close above $0.96 could be the spark for a bullish $MATIC breakout. If this key level is breached, we might witness #MATIC surging toward $1.82! pic.twitter.com/M9bz3myRVi — Ali (@ali_charts) December 9, 2023 Related Reading: Why Is XRP Price Up Today? Ripple’s Massive Buyback May Have The Answer This pattern forms a basis of Martinez’s projection, as the analyst believes “a daily or weekly candlestick close above $0.96 could be the spark for a bullish MATIC breakout.” According to the analyst, a break through this critical price level could send the altcoin to $1.82. This projection represents an approximately 100% rally from the current price point. As of this writing, the Polygon token is valued at $0.905165, reflecting a nearly 2% price decline in the past 24 hours. Nevertheless, MATIC ranks as the 15th-largest cryptocurrency, with a market capitalization of roughly $8.42 billion. On-Chain Data Reveals Minimal Resistance Ahead A particular on-chain data revelation adds even more strength to Martinez’s $1.82 projection for MATIC price. In an earlier post on X, Martinez revealed that the Polygon token might be set to go on a bullish run. This theory is based on price data from the analytics platform IntoTheBlock. According to the blockchain platform, about 42,000 addresses purchased 5.8 billion tokens between $0.80 and $0.86, making the price range a “key” support zone. 42,000 addresses purchased 5.8 MATIC billion tokens between $0.80 and $0.86 &#124; Source: Ali_charts/X Related Reading: Bitcoin Bull Signal Returns: Exchange Supply Hits Lowest Level Since 2017 As displayed in the chart above, the small size of the dots indicates the low density of investors and no major on-chain resistance above the current MATIC price. “Given the minimal resistance ahead, Polygon seems primed for a bull run as long as this level holds,” according to the analyst. MATIC price hovers around the $0.9 mark on the daily timeframe &#124; Source: MATICUSDT chart on TradingView Featured image from iStock, chart from TradingView"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-10T08:43:30.000Z",
    "title": "Top 5 Twitter Accounts to Discover and Manage Airdrops",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-twitter-accounts-to-discover-and-manage-airdrops/",
    "description": "<p>Twitter, or X, is a must-have resource for crypto investors. You could have an interest in gem-hunting, GameFi, DeFi or even NFTs. With Twitter, you can get early alpha for any of these categories. Needless to say, there&#8217;s a ton of alpha on Twitter for airdrop hunters as well. Today, we&#8217;re going to look at [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-twitter-accounts-to-discover-and-manage-airdrops/\">Top 5 Twitter Accounts to Discover and Manage Airdrops</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-10T08:47:00.000Z",
    "title": "APT, 1NCH, APE, FLOW, CYBER Set to Undergo New Token Unlocks",
    "url": "https://coinedition.com/apt-1nch-ape-flow-cyber-set-to-undergo-new-token-unlocks/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"APT APE Set to Undergo New Token Unlocks\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A lot of projects plan to unlock new tokens between 11 and 17 December, according to data from Token Unlocks. Some of the major ones of this lot include  Aptos (APT), 1inch Network (1INCH), ApeCoin (APE),  Flow (FLOW), and CyberConnect (CYBER). Token unlocks refer to the scheduled release of previously restricted tokens into the market. [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/apt-1nch-ape-flow-cyber-set-to-undergo-new-token-unlocks/\">APT, 1NCH, APE, FLOW, CYBER Set to Undergo New Token Unlocks</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]