[
  {
    "source": "CryptoSlate",
    "date": "2024-01-21T13:00:10.000Z",
    "title": "Op-ed: Proof of Stake – Meet the new inequality, same as the old inequality?",
    "url": "https://cryptoslate.com/op-ed-proof-of-stake-meet-the-new-inequality-same-as-the-old-inequality/",
    "description": "<p>The following is a guest post from John deVadoss. The promise of cryptoeconomics lies in its moon-shot ambition of creating new economic platforms, built on the aspirational ideas of decentralization and democratization and enabling inclusive and equitable governance models, thereby leveling the playing field for the common man. We are at a decisive fork in [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/op-ed-proof-of-stake-meet-the-new-inequality-same-as-the-old-inequality/\">Op-ed: Proof of Stake &#8211; Meet the new inequality, same as the old inequality?</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-21T12:46:16.000Z",
    "title": "Coinbase Likely to Win Dismissal of SEC Lawsuit: Bloomberg Legal Analyst",
    "url": "https://cryptodaily.co.uk/2024/01/coinbase-likely-to-win-dismissal-of-sec-lawsuit-bloomberg-legal-analyst",
    "description": "Legal experts believe there is a high chance that Coinbase will secure a complete dismissal in its ongoing lawsuit with the US Securities and Exchanges Commission."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-21T13:00:23.000Z",
    "title": "Grayscale’s 4K Bitcoin Transfer, Blackrock CEO Favorable on Bitcoin, Ripple’s XRP Ousted, and More — Week in Review",
    "url": "https://news.bitcoin.com/grayscales-4k-bitcoin-transfer-blackrock-ceo-favorable-on-bitcoin-ripples-xrp-ousted-and-more-week-in-review/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitcoin_gbtc_transfer-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Grayscale’s 4K Bitcoin Transfer, Blackrock CEO Favorable on Bitcoin, Ripple&#039;s XRP Ousted, and More — Week in Review\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitcoin_gbtc_transfer-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitcoin_gbtc_transfer-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitcoin_gbtc_transfer-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitcoin_gbtc_transfer-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitcoin_gbtc_transfer-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitcoin_gbtc_transfer-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitcoin_gbtc_transfer.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Grayscale stirred speculation by transferring 4,000 bitcoins, while Blackrock CEO Larry Fink endorsed bitcoin as &#x201C;digital gold,&#x201D; surpassing government influence. In regulatory news, Ripple&#x2019;s XRP was removed from Hong Kong Virtual Asset Consortium&#x2019;s top crypto index. Meanwhile, Elon Musk reaffirmed his commitment to Dogecoin, along with revealing that his company Spacex holds a substantial amount [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-21T13:07:37.000Z",
    "title": "Can Uniswap (UNI) v4 Launch Rescue its Price? Chiliz (CHZ) and Pushd (PUSHD) Investors Enjoy Bullish Gains!",
    "url": "https://nulltx.com/can-uniswap-uni-v4-launch-rescue-its-price-chiliz-chz-and-pushd-pushd-investors-enjoy-bullish-gains/",
    "description": "Many established crypto projects are under pressure from newcomers to the market, prompting intense developments and new releases to try and maintain pace. Uniswap (UNI) has seen its price stagnate over the past year, while newbies Chiliz (CHZ) and Pushd (PUSHD) are enjoying enormous gains. Here’s why. Can Uniswap (UNI) [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-21T12:59:08.000Z",
    "title": "Ripple (XRP) and Shiba Inu (SHIB) Battle for Gains While Pullix (PLX) Sells Over 70Million Tokens",
    "url": "https://nulltx.com/ripple-xrp-and-shiba-inu-shib-battle-for-gains-while-pullix-plx-sells-over-70million-tokens/",
    "description": "Ripple (XRP) has made significant waves during the past week as whales moved millions of tokens and sent the trading volume flying. Analysts are now keen on the future of the crypto and project that it can reach significant gains. In the meantime, Shiba Inu (SHIB) is also showcasing solid [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-21T12:55:26.000Z",
    "title": "Pullix (PLX), Shiba Inu (SHIB), and Sei (SEI) Spark Crypto Analyst Frenzy With Sky-High Expectations",
    "url": "https://nulltx.com/pullix-plx-shiba-inu-shib-and-sei-sei-spark-crypto-analyst-frenzy-with-sky-high-expectations/",
    "description": "Recently, Pullix (PLX), Shiba Inu (SHIB), and Sei (SEI) have ignited a frenzy among analysts in the DeFi market. Some are even confident that PLX &#8211; now in Stage 6 of its presale &#8211; could become the next 100x altcoin in 2024. With over $4M raised and 70M tokens sold, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-21T13:00:32.000Z",
    "title": "Whales Go Wild: Cardano Transactions Surge 11% – Price Hike Incoming?",
    "url": "https://www.newsbtc.com/news/whales-go-wild-cardano-transactions-surge-11-price-hike-incoming/",
    "description": "Cardano (ADA) staged a remarkable performance today, defying prevailing expectations and orchestrating a meteoric rise that propelled it from a relatively unassuming position to a prominent spot within the top 10 cryptocurrencies by market capitalization, courtesy of an impressive 3.6% rally. While stalwarts like Bitcoin and Ethereum made incremental movements, Cardano distinguished itself with an unparalleled surge, surpassing its heavyweight counterparts and setting ablaze a bullish sentiment that swept across the crypto community. Related Reading: Astar Makes History, Investors Celebrate 16% Price Hike – Here’s More Cardano Transactions Soaring The unforeseen ascent of Cardano has left analysts scrambling for explanations, and a prevailing theory points to an upswing in whale activity. Insights gleaned from IntoTheBlock&#8217;s data reveal a staggering 11% surge in cumulative whale volume over the preceding 24 hours. Cardano Whale Transactions. Source: IntoTheBlock Whale Transaction Numbers Tell A Story This surge translates to an astronomical $14.34 billion worth of Cardano changing hands among the titans of the crypto realm, dwarfing the transactional activity witnessed in other leading digital assets. In comparison, Ethereum recorded a comparatively modest $4.21 billion in whale transactions, and Dogecoin struggled to breach the $1 billion mark, further underscoring the dominance of Cardano&#8217;s surge in whale participation. The surge in Cardano&#8217;s whale activity not only fueled its impressive rally but also underscored the growing influence of large-scale investors within the cryptocurrency market. This unexpected turn of events has prompted speculation and discussions within the crypto community regarding the potential catalysts behind such substantial whale engagement. Bitcoin (BTC) is currently trading at $41.646. Chart: TradingView.com These numbers tell a clear story: big bucks are betting big on Cardano. The number of whale transactions went from a respectable 5,080 on January 17th to a jaw-dropping 7,910 by the 19th. This sudden influx of institutional interest from deep-pocketed investors suggests a surge of confidence in Cardano&#8217;s future, propelling its price upwards and leaving other altcoins in its wake. However, amidst the celebratory champagne showers, whispers of caution linger. Cardano&#8217;s price remains deeply tethered to Bitcoin, meaning a sudden BTC dip could drag ADA down with it. Additionally, with short-term profit-taking a constant threat, especially near the psychologically important $0.67 resistance level, a temporary pullback isn&#8217;t off the table. Related Reading: Maker (MKR) Makes Crypto History: $2K Breached – Can DeFi Reach For More? But beyond the immediate price action, a bedrock of optimism underpins Cardano&#8217;s ascent. The development team continues to churn out impressive updates, with major advancements promised for the Proof-of-Stake network this year. From upcoming hard forks to innovative dApp implementations, these technological leaps could solidify Cardano&#8217;s long-term value proposition and attract even more whales to its welcoming shores. Featured image from Pexels "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-21T12:50:55.000Z",
    "title": "Shibarium On The Verge Of Momentous Milestone – Will This Trigger A Price Rally?",
    "url": "https://www.newsbtc.com/all/shibarium-on-the-verge-of-momentous-milestone-will-this-trigger-a-price-rally/",
    "description": "Shibarium is almost at a new transaction milestone amid Shiba Inu&#8217;s market price uncertainty. The latest data from Shibariumscan shows the layer-2 scaling platform for Shiba Inu is now nearing a transaction count of 300 million, an exciting threshold that points to a successful and impactful rollout. With SHIB now struggling to post gains in the past month, it is only natural to ponder whether Shibarium&#8217;s eventual attainment of this transaction milestone could reverse the meme coin&#8217;s fortune, even if only temporarily.  Shibarium Nears 300 Million Transactions Shibarium has largely been successful since it went live in August 2023, becoming the preferred platform of Shiba Inu whales and investors. In the first month, Shibarium processed more than 3 million transactions, an indication of its market fit.  Related Reading: Astar Makes History, Investors Celebrate 16% Price Hike – Here’s More The layer-2 solution particularly witnessed a flurry of transactions towards the end of 2023, pushing the total transaction count over milestones in multiple succession. In December, Shibarium averaged over 7.5 million transactions every day. However, the daily transaction count has seen a decline in January, save for a recent integration of Shibarium by crypto exchange Gate.io. Despite the recent decline, Shibarium&#8217;s total transactions point to steady activity. At the time of writing, Shibarium&#8217;s 24-hour daily transaction stands at 2.75 million and a total of 299.4 million transactions, spanning 2.75 million blocks. Incoming SHIB Price Surge? As it stands, a larger part of SHIB&#8217;s utility is now tied to the adoption and use of Shibarium, and the crypto is known to react to updates regarding the Shibarium platform. SHIB has mostly traded below $0.00001 since the beginning of the year, and a 300 million transaction milestone could become a much-needed catalyst for a price surge.  Higher usage signals investor interest and faith in the ecosystem. At the same time, fees collected from transactions on Shibarium could be used to burn more SHIB, leading to an uptick in the SHIB tokens left in circulation. SHIB market cap is currently at $5.6 billion. Chart: TradingView.com SHIB is currently trading at $0.000009474, down by 13% since reaching $0.0000109 on January 2nd. Price action shows the crypto testing the $0.0000087 and $0.0000089 support levels throughout the month, rebounding three times. According to data from IntoTheBlock, 78.92 trillion SHIB tokens were bought between these price points, which are now acting as support Related Reading: Maker (MKR) Makes Crypto History: $2K Breached – Can DeFi Reach For More? BONE, Shibarium&#8217;s gas token, also shares the same sentiment. BONE is currently trading at $0.6179, down by 18% in the past month, as part of the recent daily transaction decline on Shibarium. However, reaching a new transaction milestone could cascade into an uptick in daily transactions, which would increase BONE&#8217;s utility and trigger price growth. Featured image from Pexels "
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-21T12:45:44.000Z",
    "title": "Aggressive Bull Market Speculation on Ethereum Has Not Yet Begun, According to Analytics Firm Kaiko",
    "url": "https://dailyhodl.com/2024/01/21/aggressive-bull-market-speculation-on-ethereum-has-not-yet-begun-according-to-analytics-firm-kaiko/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Says-Ethereum-In-for-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Says-Ethereum-In-for-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/Says-Ethereum-In-for-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Says-Ethereum-In-for-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Says-Ethereum-In-for-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Says-Ethereum-In-for-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Says-Ethereum-In-for-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analytics firm Kaiko says that speculative fervor on Ethereum (ETH) hasn&#8217;t yet kicked off, despite being well off its 2022 lows. In a new report, Kaiko says that Bitcoin has benefited from the hype surrounding the approval of BTC exchange-traded funds (ETFs) in the US, but that speculation on an Ethereum ETF has not [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/21/aggressive-bull-market-speculation-on-ethereum-has-not-yet-begun-according-to-analytics-firm-kaiko/\">Aggressive Bull Market Speculation on Ethereum Has Not Yet Begun, According to Analytics Firm Kaiko</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]