[
  {
    "source": "Decrypt",
    "date": "2023-09-22T18:39:56.000Z",
    "title": "Bitcoin Critic Senator Menendez Charged With Corruption, Bribery",
    "url": "https://decrypt.co/198398/bitcoin-critic-senator-menendez-corruption-bribery",
    "description": "Senator Menendez, a long-time critic of Bitcoin and other crypto for its alleged association with criminals, faces up to 20 years in prison if convicted."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-22T19:00:27.000Z",
    "title": "Anthropic’s ‘responsible scaling’ policy introduces outline for safe AI development",
    "url": "https://cryptoslate.com/anthropics-responsible-scaling-policy-introduces-outline-for-safe-ai-development/",
    "description": "<p>Anthropic, the  artificial intelligence research company behind the chatbot Claude, unveiled a comprehensive Responsible Scaling Policy (RSP) this week aimed at mitigating the anticipated risks associated with increasingly capable AI systems. Borrowing from the US government&#8217;s biosafety level standards, the RSP introduces an AI Safety Levels (ASL) framework. This system sets safety, security, and operational [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/anthropics-responsible-scaling-policy-introduces-outline-for-safe-ai-development/\">Anthropic’s ‘responsible scaling’ policy introduces outline for safe AI development</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-22T18:57:59.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-22T19:00:57.000Z",
    "title": "How An ‘Inconsequential’ Mistake Saw Bitcoin Crash To $8,000",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-crash-to-8000/",
    "description": "Bitcoin is known to be a very volatile digital asset as its price is often wont to rise and fall unexpectedly, and sometimes without a clear reason. One of these instances of the digital asset flash-crashing was back in 2021 when the price of Bitcoin had fallen 87% on some exchanges in a matter of minutes. However, the mystery behind this flash crash has been unveiled two years after it first occurred. Former Alameda Research Engineer Spills Secret Alameda Research is the sister company of the now-defunct FTX crypto exchange run by Caroline Ellison who served as CEO until it collapsed. Following the bankruptcy, employees at the trading firm have, at various times, come forward to tell stories of what took place at the company. This time around, an ex-engineer Aditya Baradwaj is telling the story of how a simple mistake caused the company to lose tens of millions of dollars. Related Reading: Investment Firm Founder Has An Important Message For Bitcoin Holders Baradwaj took to his X (formerly Twitter) account to reveal how an Alameda employee had unwittingly triggered a Bitcoin flash crash in 2021. According to him, the error was a result of two trading systems operated at the company. PART 2: THE FAT-FINGER or The story of how a misplaced decimal point at Alameda Research caused a market crash that echoed around the world. (1/n) 🧵#SBF #FTX pic.twitter.com/jCykh6rg1o — Adi (e/acc) (@aditya_baradwaj) September 20, 2023 The ex-engineer explained that Alameda had semi-systemic strategies in which a complex automated trading system was controlled by model parameters set by traders. The second was manual trading which would be done when the former could not execute a trade due to a number of reasons. In the case of the trader who triggered the flash crash, they had to manually enter a trade to sell a large tranche of BTC using Alameda’s manual trading system. However, the trader had failed to realize that the decimal point in the trade was off by a couple of spaces, which meant that they were selling the BTC at much lower prices than the current price. The result of this simple error was Alameda selling off a sizable portion of BTC at pennies on the dollar which resulted in a flash crash on multiple exchanges. The crash was most prominent on the FTX and Binance exchanges, where prices fell from $65,000 to $8,000 in a matter of minutes. Covering Up The Bitcoin Crash The aftermath of the flash crash, according to the ex-engineer, involved Alameda rushing to put in place sanity checks that should have been available before any manual trades were executed. He notes that this was not out of the ordinary as they were always waiting for things to break before fixing them at the company. Related Reading: Bloomberg Analyst Lauds Bitcoin Energy Shift Amid Rising Hashrate “That&#8217;s usually how things worked at Alameda &#8211; we would wait until something broke, and then rush to fix it,” he said. Baradwaj also referred to FTX founder Sam Bankman-Fried saying that the utility gained after the events outweighed the costs incurred from poor risk checks and hacks. He also pointed to Binance commenting on the flash crash with a statement that blamed a bug in the trading algorithm of one of their institutional traders. “I guess Caroline had made some phone calls,” Baradwaj said, referring to Alameda’s CEO. BTC price holding support &#124; Source: BTCUSD on Tradingview.com Featured image from Nairametrics, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-22T18:45:13.000Z",
    "title": "US Anti-CBDC Bill Passes Through House Financial Services Committee Along Party Lines",
    "url": "https://dailyhodl.com/2023/09/22/us-anti-cbdc-bill-passes-through-house-financial-services-committee-along-party-lines/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/anti-bill-passes-out.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/anti-bill-passes-out.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/anti-bill-passes-out.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/anti-bill-passes-out.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/anti-bill-passes-out.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/anti-bill-passes-out.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/anti-bill-passes-out.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>US legislators in the House Financial Services Committee have voted in favor of a proposed law that aims to stop the Federal Reserve from issuing a central bank digital currency (CBDC). According to the office of Congressman Tom Emmer (R-MN), the committee passed the CBDC Anti-Surveillance State Act during a markup session on Wednesday. Emmer, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/22/us-anti-cbdc-bill-passes-through-house-financial-services-committee-along-party-lines/\">US Anti-CBDC Bill Passes Through House Financial Services Committee Along Party Lines</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-22T18:41:30.000Z",
    "title": "U.S. DOJ Wins Motion To Prevent Proposed Sam Bankman-Fried Witnesses From Testifying in FTX Trial",
    "url": "https://dailyhodl.com/2023/09/22/u-s-doj-wins-motion-to-prevent-proposed-sam-bankman-fried-witnesses-from-testifying-in-ftx-trial/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/over-ponzi-scheme-doj.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/over-ponzi-scheme-doj.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/over-ponzi-scheme-doj.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/over-ponzi-scheme-doj.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/over-ponzi-scheme-doj.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/over-ponzi-scheme-doj.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/over-ponzi-scheme-doj.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Department of Justice (DOJ) has successfully won a motion to prevent Sam Bankman-Fried’s proposed expert witnesses from testifying in the upcoming FTX trial. A new court filing reveals that Bankman-Fried’s proposed witnesses either failed to meet the standards of being able to testify or were excluded due to the government’s request. In the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/22/u-s-doj-wins-motion-to-prevent-proposed-sam-bankman-fried-witnesses-from-testifying-in-ftx-trial/\">U.S. DOJ Wins Motion To Prevent Proposed Sam Bankman-Fried Witnesses From Testifying in FTX Trial</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]