[
  {
    "source": "Decrypt",
    "date": "2023-10-26T22:40:53.000Z",
    "title": "A Bitcoin ETF Could Soon Finally Launch. What If It Flops?",
    "url": "https://decrypt.co/203441/bitcoin-etf-launch-flop-market-demand",
    "description": "Bitcoin hopefuls are crossing their fingers for the approval of a spot crypto ETF. But will demand match the hype?"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-26T22:50:57.000Z",
    "title": "Yuga Labs wins $1.6M in Bored Apes trademark infringement case",
    "url": "https://cryptoslate.com/yuga-labs-wins-1-6m-in-bored-apes-trademark-infringement-case/",
    "description": "<p>On Oct. 26, Yuga Labs, the company behind the popular Bored Ape Yacht Club (BAYC) NFT collection, announced that two individuals who infringed on its brand had been ordered by the court to pay damages and cease their infringing activities. The company wrote in a statement: &#8220;After the court ruling against Ryder Ripps and Jeremy [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/yuga-labs-wins-1-6m-in-bored-apes-trademark-infringement-case/\">Yuga Labs wins $1.6M in Bored Apes trademark infringement case</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-26T22:59:00.000Z",
    "title": "Binance.US Airdrops Flare Tokens to $XRP Holders After Long Wait",
    "url": "https://www.cryptoglobe.com/latest/2023/10/binance-us-airdrops-flare-tokens-to-xrp-holders-after-long-wait/",
    "description": "The American subsidiary of leading cryptocurrency exchange Binance, Binance.US, has recently distributed Flare ($FLR) tokens to $XRP token holders who had them on the exchange at the time of the snapshot, which was back on December 12, 2020. According to a recent announcement from the cryptocurrency exchange, it successfully airdropped FLR tokens on October 25 […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-26T23:00:53.000Z",
    "title": "Crypto Analyst Who Called Bitcoin’s Parabolic Rally Picks Altcoin Set To Pop",
    "url": "https://www.newsbtc.com/altcoin/crypto-analyst-bitcoin-altcoin/",
    "description": "Predicting the Bitcoin price movements and when altcoin prices will rally again is not a small feat but one analyst has managed to do so. Crypto analyst TonyTheBull has been calling for a bull market, saying that this cycle differs from previous ones in the fact that there will be a rally this year. This proved to be true last week when the price of Bitcoin started surging and hit as high as $35,100. Now the analyst has called the next altcoin to outperform, and it already is. Fetch (FET) Is Next Altcoin In Line In the latest iteration of the CoinChartist (VIP) newsletter, crypto analyst TonyTheBull revealed that Fetch (FET) was his next pick after the Bitcoin breakout. He revealed that he had previously bought FET which ended up outperforming in January, and believes the same will be the case here as well. Related Reading: Bitcoin Resumes Rally After Brief Hiatus, Here’s What Happened FET which is one of the top AI-powered crypto tokens is already on the rise after the analyst called it at the $0.24 level. TonyTheBull also posits that a Raging Bull indicator flipping on would be able to confirm further upside. “Waiting for the Raging Bull to turn on would help confirm increased bullishness in the altcoin,” the newsletter read. Source: CoinChartist The Raging Bull Indicator, explained the analyst, “was designed using the Relative Strength Index to help indicate when Bitcoin or other assets are in a bull market, and more importantly, and impulsive like trend.” Basically, this indicator helps to show the strength of a cryptocurrency. Looking at FET’s performance since the call, it has already climbed over 30% and is now trading above $0.3, hitting a local peak of $0.32 on Wednesday. FET price sitting above $0.29 &#124; Source: FETUSD on Tradingview.com Bitcoin Not The Only One Looking Good Despite Bitcoin still looking incredibly bullish on the charts, the analyst points out some altcoins that have had their Raging Bull Indicators turned on this year as well. The first on the list is Solana whose indicator turned on for the first time since 2022. Following this, the digital asset went on a massive run but it might not be done. Related Reading: Bitcoin Price Crosses $35,000, Here’s Why TonyTheBull revealed that the last time this indicator was turned on, Solana blew up by 500%, and then continued on to do a 17,000% rally. So if it sticks to historical performance, the Solana rally might only be in its early stages. Source: CoinChartist The next altcoin to appear on the list is Chainlink’s LINK. LINK moved from around $7 to over $11 in a matter of days. But just like Solana, this coin may only be in its early stages. LINK’s Raging Bull Indicator last turned on in 2019 and the coin saw a “700% in the near term, and more than 9,000% in total.” The analyst further added, “This might not be a setup to sleep on.” Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Binance, chart from TradingView.com"
  }
]