[
  {
    "source": "Bitcoin.com",
    "date": "2024-01-23T05:00:09.000Z",
    "title": "Michael Howell Predicts Continued Surge in Global Liquidity Benefiting Stocks, Gold, and Crypto",
    "url": "https://news.bitcoin.com/michael-howell-predicts-continued-surge-in-global-liquidity-benefiting-stocks-gold-and-crypto/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/howell_global_liquidity-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Michael Howell of Crossborder Capital Focused on Rising Global Liquidity and Its Market Impact\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/howell_global_liquidity-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/howell_global_liquidity-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/howell_global_liquidity-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/howell_global_liquidity-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/howell_global_liquidity-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/howell_global_liquidity-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/howell_global_liquidity.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Crossborder Capital’s Michael Howell, a veteran in global finance, offered a liquidity-based view on the current state of the economy. He challenged the prevailing narrative of monetary tightening with evidence of a rise in liquidity, which in turn should uplift stocks, gold, and cryptocurrencies. Michael Howell of Crossborder Capital Focused on Rising Global Liquidity and [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-23T04:47:41.000Z",
    "title": "Ethereum Price Reaches Support, Can ETH Start A Steady Increase Again?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-reaches-2300/",
    "description": "Ethereum price extended losses and tested the $2,300 support. ETH is now attempting a recovery wave above the $2,340 level and might test $2,390. Ethereum started a fresh decline below the $2,420 and $2,400 levels. The price is trading below $2,400 and the 100-hourly Simple Moving Average. There was a break above a connecting bearish trend line with resistance near $2,340 on the hourly chart of ETH/USD (data feed via Kraken). The pair attempt a fresh increase if it clears the $2,390 and $2,400 levels. Ethereum Price Revisits $2,300 Ethereum price struggled to start a fresh increase above the $2,550 and $2,580 resistance levels. ETH started a fresh decline and traded below the $2,400 support like Bitcoin. There was a move below the $2,350 level. A new weekly low was formed near $2,302 and the price is now consolidating losses. There was a minor increase above the $2,330 level. The price climbed above the 23.6% Fib retracement level of the downward move from the $2,479 swing high to the $2,302 low. There was also a break above a connecting bearish trend line with resistance near $2,340 on the hourly chart of ETH/USD. Ethereum is now trading below $2,400 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,365 level. The next hurdle could be $2,390 or the 50% Fib retracement level of the downward move from the $2,479 swing high to the $2,302 low. The next major resistance is now near $2,400. A clear move above the $2,400 level might start a decent increase. In the stated case, the price could rise toward the $2,480 level. Source: ETHUSD on TradingView.com The next key hurdle sits near the $2,500 zone. A close above the $2,500 resistance could start another steady increase. In the stated case, Ether price could rise toward the $2,650 zone. Another Decline in ETH? If Ethereum fails to clear the $2,390 resistance, it could start another decline. Initial support on the downside is near the $2,320 level. The next key support could be the $2,300 zone. A downside break below the $2,300 support might send the price further lower. In the stated case, Ether could test the $2,250 support. Any more losses might send the price toward the $2,200 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $2,300 Major Resistance Level – $2,390"
  }
]