[
  {
    "source": "Cointelegraph",
    "date": "2023-07-19T18:41:51.000Z",
    "title": "Apple has its own GPT AI system but no stated plans for public release: Report",
    "url": "https://cointelegraph.com/news/apple-has-gpt-ai-system-no-stated-plans-for-public-release-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/2951bc59-d9fa-4aa3-ba35-b998d8868ee8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Cupertino, California-based company reportedly developed an internal GPT system on Google infrastructure for employees to tinker with.</p>\n                    <p><p>Apple’s reportedly working on its own generative pre-trained transformer (GPT) artificial intelligence (AI) model. However, there’s no indication that the company has any plans to launch it to the public.</p><p>Per a July 19 report from Bloomberg, Apple’s internal GPT system is called “Ajax.” It’s <a href=\"https://www.bloomberg.com/news/articles/2023-07-19/apple-preps-ajax-generative-ai-apple-gpt-to-rival-openai-and-google#xj4y7vzkg\" target=\"_blank\" rel=\"noopener nofollow\">purportedly</a> similar to OpenAI’s ChatGPT and Google’s Bard. </p><p>Apple has a longstanding reputation for <a href=\"https://www.theverge.com/2021/6/7/22521476/apple-walled-garden-carrier-app-store-innovation\" target=\"_blank\" rel=\"noopener nofollow\">developing</a> its products inside of a walled garden. While “Ajax,” which Bloomberg reports some engineers have referred to as “Apple GPT,” could eventually turn into a consumer-facing product, its current infrastructure could pose a problem. </p><p>Apple codenamed its GPT system “Ajax” because it was <a href=\"https://github.com/google/jax\" target=\"_blank\" rel=\"noopener nofollow\">developed</a> on top of Google Jax, a machine learning framework. It’s also reportedly running on Google Cloud, which could limit Apple’s ability to affordably scale Ajax beyond internal testing. </p><p>Google’s Bard AI system is one of the primary competitors in the consumer-facing generative AI technology space, facing direct opposition from Microsoft and OpenAI in the form of BingAI and ChatGPT. However, Apple has so far not indicated it intends to compete in this arena.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/llama-2-open-source-ai-model-launched-by-meta-microsoft\"><strong><em>Meta and Microsoft launch open-source AI model Llama 2</em></strong></a></p><p>Apple’s track record concerning AI <a href=\"https://www.wired.com/story/apple-ai-privacy/\" target=\"_blank\" rel=\"noopener nofollow\">demonstrates</a> that the company is privacy-focused when it concerns machine learning technology. For this reason, most of its efforts are focused on AI technologies that can be run using onboard processors instead of cloud-based services. </p><p>Chatbot technology, such as ChatGPT, typically requires internet connectivity to work. While it’s possible to run a chatbot on discrete architecture, such as the AI chip on an iPhone, the model size and capabilities are constrained by the device’s hardware.</p><p>However, if Apple were to develop a comparatively useful GPT model capable of running discretely on iPhone hardware, that could be a boon to users who value privacy over the conversational features embedded in the larger cloud-based models. Consumers who require privacy as a default would stand to benefit the most. </p><p>This could also solve or mitigate some of the outstanding problems with GPT-based chatbots. Cryptocurrency trading bots built on GPT tech, for example, currently <a href=\"https://www.nytimes.com/2023/05/01/business/ai-chatbots-hallucination.html\" target=\"_blank\" rel=\"noopener nofollow\">suffer</a> from hallucinations. In the technical sense, this means that sometimes they make things up when they can’t come up with a factual answer. </p><p>A pretrained chatbot capable of referencing user-tuned data sets and running discretely on an iPhone could eliminate noisy data for trading bots and keep users’ financial data — such as wallet keys, personally identifiable information and transaction records — completely private. </p><p>Despite Apple’s lack of impact in the chatbot space, the Cupertino, California-based company is one of the most impactful players in AI. The AI powering the iPhone’s camera and photography editing suite <a href=\"https://www.techradar.com/features/iphone-14-camera-explained-photonic-engine-quad-pixel-sensors-and-more\" target=\"_blank\" rel=\"noopener nofollow\">remains</a> cutting edge, and Apple Research <a href=\"https://machinelearning.apple.com/research/\" target=\"_blank\" rel=\"noopener nofollow\">outputs</a> a steady stream of significant papers in the machine learning space. </p><p>A veritable “who’s who\" of AI luminaries and renowned experts have also recently filtered through the company’s secretive AI labs, <a href=\"https://www.technologyreview.com/2018/02/21/145289/the-ganfather-the-man-whos-given-machines-the-gift-of-imagination/\" target=\"_blank\" rel=\"noopener nofollow\">including</a> the “GANfather,” Ian Goodfellow, who recently left the company to join Google DeepMind, and its current head of AI, John Giannandrea, who previously led Search at Google.</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T19:07:17.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices considering investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it brings. For ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T18:46:10.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for decoupling on-chain and off-chain trading activity. There was evidence that, unlike traditional financial markets, cryptocurrency volatility is not associated with market downturns. Observers also noted that, after gaining widespread attention and with ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-19T18:59:00.000Z",
    "title": "CBDCs explained: How could they impact global finance",
    "url": "https://crypto.news/cbdcs-explained-how-could-they-impact-global-finance/",
    "description": "Central bank digital currencies (CBDCs) are increasingly becoming the forefront of financial discussions. As of 2023, about 130 countries, representing 98% of global GDP, are exploring the implementation of CBDCs. This piece delves into the specifics of CBDCs, benefits, and&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-19T18:53:08.000Z",
    "title": "BitSport unveils BitPool v2 and BITP token",
    "url": "https://crypto.news/bitsport-unveils-bitpool-v2-and-bitp-token/",
    "description": "BitSport has unveiled BitPool V2 and initiated a Balancer Liquidity event on Fjordfoundry for its governance token, BITP"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T19:00:49.000Z",
    "title": "Bitcoin Exchange Inflow Spikes, Is This Bearish?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-exchange-inflow-spikes-is-this-bearish/",
    "description": "On-chain data shows the Bitcoin exchange inflow towards Binance has spiked during the past day, which may be bearish for the price. Bitcoin Exchange Inflow Has Registered A Large Spike As an analyst in a CryptoQuant post pointed out, a whale has made a large deposit to the cryptocurrency exchange Binance. The relevant indicator here is the &#8220;exchange inflow,&#8221; which measures the total amount of Bitcoin that investors send to a specific centralized exchange (which, in this case, is Binance). When the value of this metric is high, it means that the holders are depositing large amounts to the platform right now. The investors may have made these transfers for selling-related purposes, depending on which type of exchange these inflows are for. Naturally, if that is the case, the price could feel a bearish effect from the inflows. On the other hand, low values imply the exchange in question isn&#8217;t receiving that many coins currently. Such a trend would imply that the market&#8217;s selling pressure may be low. Related Reading: Bitcoin Has Broken This Open Interest Pattern, Quant Explains Now, here is a chart that shows the trend in the Bitcoin exchange inflow for the cryptocurrency exchange Binance over the past day: The value of the metric seems to have been quite high in recent hours &#124; Source: CryptoQuant As shown in the above graph, the Bitcoin exchange inflow for Binance has observed a rather large spike in the past day. With this deposit, around 4,451 BTC (approximately worth $133 million at the current exchange rate) has entered the platform&#8217;s wallets. Interestingly, this deposit has come from a whale that has bought 20,000 BTC over the last eight months, meaning that the investor still has over 15,000 BTC left in their wallet after the transaction. The whale may have made this transfer to take some profit at the current prices. Since the scale of the deposit is quite sizeable, it could potentially cause bearish ripples in the market. However, as another quant has explained, the deposits have been towards the derivatives side of the exchange and not the spot platform. Looks like the spot exchanges inflow hasn't moved today &#124; Source: CryptoQuant It would appear likely that the transfer hasn&#8217;t been made to sell the coins (at least not directly) but rather for opening positions on the derivatives market. Related Reading: Signal With Perfect Track Record Predicts Bitcoin Bull Market Parabola: Analyst &#8220;This category of large wallets rarely moves directly to derivative exchanges,&#8221; notes the analyst, given that the size of the wallet in question is in the 10,000+ BTC range, the class of the largest whales on the network. Such a large position can lead to volatility in the Bitcoin price, but unlike selling from spot deposits, this price action may not necessarily be bearish for the asset. BTC Price At the time of writing, Bitcoin is trading around $29,800, down 3% in the last week. BTC has gone downhill during the last few days &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-19T18:51:37.000Z",
    "title": "ARK Invest CEO Cathie Wood: Bitcoin to Reach $1,500,000 by 2030 and Defeat CBDCs around the World",
    "url": "https://www.crypto-news-flash.com/ark-invest-ceo-cathie-wood-bitcoin-to-reach-1500000-by-2030-and-defeat-cbdcs-around-the-world/?utm_source=rss&utm_medium=rss&utm_campaign=ark-invest-ceo-cathie-wood-bitcoin-to-reach-1500000-by-2030-and-defeat-cbdcs-around-the-world",
    "description": "<img width=\"1280\" height=\"890\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280-300x209.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280-1024x712.png 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Cathie Wood reiterates her $1.5 million trading price prediction of Bitcoin, claiming her Fund has a lot of confidence in the bullish case. Michael Saylor had equally predicted that the Bitcoin price could surge by 10X from its current price.  Ark Invest&#8217;s Cathie Wood has predicted on multiple occasions that the Bitcoin (BTC) price could [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-19T18:45:32.000Z",
    "title": "Crypto Exchange Binance Hits Pause on Certain Employee Perks, Cites Decline in Profits: Report",
    "url": "https://dailyhodl.com/2023/07/19/crypto-exchange-binance-hits-pause-on-certain-employee-perks-cites-decline-in-profits-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/exchange-hits-pause-perks.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/exchange-hits-pause-perks.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/exchange-hits-pause-perks.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/exchange-hits-pause-perks.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/exchange-hits-pause-perks.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/exchange-hits-pause-perks.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/exchange-hits-pause-perks.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Top global crypto exchange Binance is reportedly eliminating some employee benefits due to a decrease in profits. Anonymous former company employees told the Wall Street Journal that the exchange sent out an email last month announcing it was putting a stop to work-from-home expenses and reimbursements for mobile phones and fitness, among other benefits. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/19/crypto-exchange-binance-hits-pause-on-certain-employee-perks-cites-decline-in-profits-report/\">Crypto Exchange Binance Hits Pause on Certain Employee Perks, Cites Decline in Profits: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-19T18:41:56.000Z",
    "title": "Crypto Memes and ‘Finfluencers’ To Be Targeted by Regulators in UK As New Rules Kick In",
    "url": "https://dailyhodl.com/2023/07/19/crypto-memes-and-finfluencers-to-be-targeted-by-regulators-in-uk-as-new-rules-kick-in/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/07/meme-coin-1.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/07/meme-coin-1.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/07/meme-coin-1.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/07/meme-coin-1.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/07/meme-coin-1.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/07/meme-coin-1.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/07/meme-coin-1.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Lawmakers in the UK are now targeting crypto memes and fintech influencers in an effort to enforce new social media guidelines. According to a new press release by the nation’s Financial Conduct Authority (FCA), the regulatory agency will be cracking down on illicit and non-compliant financial promotion starting in October. “The FCA has been ramping [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/19/crypto-memes-and-finfluencers-to-be-targeted-by-regulators-in-uk-as-new-rules-kick-in/\">Crypto Memes and ‘Finfluencers’ To Be Targeted by Regulators in UK As New Rules Kick In</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]