[
  {
    "source": "Decrypt",
    "date": "2023-11-04T12:01:02.000Z",
    "title": "Bored Ape Creator Yuga Labs and Magic Eden Launching Ethereum NFT Marketplace That Enforces Royalties",
    "url": "https://decrypt.co/204403/bored-ape-creator-yuga-labs-magic-eden-launching-ethereum-nft-marketplace-enforces-royalties",
    "description": "Magic Eden’s new Ethereum NFT marketplace will be “contractually obligated” to pay royalties. What does that mean for traders?"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-04T12:00:25.000Z",
    "title": "XRP Unlikely To Suffer From Ripple IPO, Crypto Author Says",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-unlikely-to-suffer-from-ripple-ipo-crypto-author-says/",
    "description": "Amid multiple speculations on the effects of Ripple potentially launching an initial public offering (IPO), popular crypto author Panos Mekras has come out to dispel concerns about this development, yielding a negative effect on the XRP token. Related Reading: XRP Price Rally Threatened As Ripple Unlocks 1 Billion Tokens Ripple IPO Will Lead To More Exposure For XRP, Mekras Says On Friday, November 3, crypto analyst and trader Mason Versluis shared a screenshot on X in which a crypto enthusiast argued that a Ripple IPO would result in the “death of XRP.” Although the enthusiast did admit that XRP may initially experience a price surge following the confirmed news of such development, he also suspects that Ripple’s &#8220;manipulation&#8221; of the altcoin will increase. In contrast, Versluis stated that a Ripple IPO should only boost the interest in XRP. However, he does admit the possibility of the “other side.” Reacting to Versluis&#8217; post, Panos Mekras, stamped out the potential of a Ripple IPO causing any negative effect on XRP. He stated that Ripple inviting public investors would result in a bigger exposure for the company and the XRP token. In addition, Mekras also implied that XRP functions as a “universal digital asset” with several use cases possessing an “unlimited potential”; thus, its trajectory cannot be solely tied to Ripple, which is just one company. For now, these takes can be considered as only speculations as Ripple has not even officially confirmed its intention to launch an IPO. News surrounding the payment company’s &#8220;alleged&#8221; preparation to go public rose to a new height on Friday after crypto analyst Lewis Jackson posted a video on YouTube highlighting multiple signs of an incoming IPO. In this YouTube post, Jackson spoke about the notable increase in Ripple’s mergers and acquisitions (M&#38;A), which is a common activity with companies anticipating an IPO.  He also pointed to Ripple&#8217;s current recruitment activities in which the company is looking for a director of international tax and a shareholder communication senior manager, among others, all of which are roles that are indicative of impending IPO. Related Reading: Ripple Achieves Regulatory Approval To Offer XRP Services XRP Soars By 12% In A Week In other news, XRP has produced a remarkable price performance in the last week, gaining by 12.47% within seven days. This price rise allows the fifth largest cryptocurrency to maintain its market recovery in Q4 2023 after the altcoin experienced a 40% price decline in Q3 as the hype surrounding Ripple’s partial victory over the SEC came down. At the time of writing, XRP trades at $0.614 with a 1.49% gain in the last day. Meanwhile, the token’s daily trading volume is currently down by 34.98% and valued at $1.1 billion. XRP trading at $0.6145 on the daily chart &#124; Sorce: XRPUSDT chart on Tradingview.com Featured image from iStock, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-04T12:07:06.000Z",
    "title": "Post-SBF Conviction: Binance and Tether Face Regulatory Scrutiny – Prosecutor Promises ‘Handcuffs for All’ Crypto Crooks",
    "url": "https://www.crypto-news-flash.com/post-sbf-conviction-binance-and-tether-face-regulatory-scrutiny-prosecutor-promises-handcuffs-for-all-crypto-crooks/?utm_source=rss&utm_medium=rss&utm_campaign=post-sbf-conviction-binance-and-tether-face-regulatory-scrutiny-prosecutor-promises-handcuffs-for-all-crypto-crooks",
    "description": "<img width=\"1280\" height=\"964\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/courtroom-898931_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/courtroom-898931_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/courtroom-898931_1280-300x226.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/courtroom-898931_1280-1024x771.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/courtroom-898931_1280-768x578.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The DOJ is investigating Binance and Tether for alleged connections to terrorism financing after convicting Sam Bankman-Fried for fraud. Crypto firms face increased scrutiny as regulators push for higher accountability and oversight to prevent illegal activities. The United States Department of Justice (DOJ) has increased its scrutiny of prominent cryptocurrency firms following high-profile legal proceedings [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-04T11:59:00.000Z",
    "title": "What Fuels ETH’s Monopoly? JPMorgan, SEC, or Its Security, Liquidity?",
    "url": "https://coinedition.com/what-fuels-eths-monopoly-jpmorgan-sec-or-its-security-liquidity/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/ETH-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/ETH-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/ETH-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/ETH-2-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>There have been significant divergent views among prominent figures in the crypto community regarding the underlying reasons for the widespread hostility directed towards Ethereum amid its dominance as the second biggest crypto project. Liam, a notable community builder, suggested that the animosity towards Ethereum is not due to its lack of functionality but rather stems [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/what-fuels-eths-monopoly-jpmorgan-sec-or-its-security-liquidity/\">What Fuels ETH’s Monopoly? JPMorgan, SEC, or Its Security, Liquidity?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-04T11:45:45.000Z",
    "title": "Trader Lays Out Bearish Scenario for Solana if History Repeats, Updates Outlook on Bitcoin and Dogecoin",
    "url": "https://dailyhodl.com/2023/11/04/trader-lays-out-bearish-scenario-for-solana-if-history-repeats-updates-outlook-on-bitcoin-and-dogecoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Extreme-Volatility-on-Solana.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Extreme-Volatility-on-Solana.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Extreme-Volatility-on-Solana.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Extreme-Volatility-on-Solana.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Extreme-Volatility-on-Solana.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Extreme-Volatility-on-Solana.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Extreme-Volatility-on-Solana.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is warning that Ethereum (ETH) competitor Solana (SOL) could undergo a sudden market correction. Pseudonymous crypto analyst Rekt Capital tells his 363,800 followers on the social media platform X that if SOL fails to flip a key level into support, it could follow a prior price pattern to the downside. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/04/trader-lays-out-bearish-scenario-for-solana-if-history-repeats-updates-outlook-on-bitcoin-and-dogecoin/\">Trader Lays Out Bearish Scenario for Solana if History Repeats, Updates Outlook on Bitcoin and Dogecoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]