[
  {
    "source": "CoinDesk",
    "date": "2023-09-06T13:00:00.000Z",
    "title": "Looking at Uniswap and Crypto’s New Favorite Ruling",
    "url": "https://www.coindesk.com/policy/2023/09/06/looking-at-uniswap-and-cryptos-new-favorite-ruling/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A ruling dismissing a putative class action lawsuit against Uniswap will almost definitely come up again in other lawsuits involving securities law and crypto entities."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-06T13:00:27.000Z",
    "title": "Aspen Launches With Tools to Help NFT Creators Reclaim Royalties",
    "url": "https://decrypt.co/155121/aspen-launches-tools-help-nft-creators-reclaim-royalties",
    "description": "Monax Labs has debuted a tool suite that helps creators reclaim unpaid NFT royalty fees by restricting access to perks and utility."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-06T12:41:17.000Z",
    "title": "Marathon Digital's Bitcoin Production Drops 9% in August Due to Texas Heat",
    "url": "https://decrypt.co/155120/marathon-digitals-bitcoin-production-drops-9-in-august-due-to-texas-heat",
    "description": "The mining firm blamed extreme weather conditions in the Lone Star State for the decrease in Bitcoin production in August."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T13:01:00.000Z",
    "title": "Crypto VC: Risk and investment strategies with Shima Capital",
    "url": "https://cointelegraph.com/news/crypto-vc-risk-investment-strategies",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/628bbe32-0ea1-4e1e-bfb6-8e4c38fe88b1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cointelegraph sits down with venture capital leaders in a new series to talk about which investments interest them most.</p>\n                    <p><p>Venture capital has been a key driver for myriad startups in the blockchain space. Founders know how competitive it can be to secure valuable VC funding that can keep the lights on and employees paid during the critical first days of a new project.</p><p>In a new interview series, Cointelegraph sits down with executives at some of the most active funds investing in the crypto space to understand their perspectives, hear their successes and failures, and know what gets them excited about a new project in the Web3 space.</p><p>This week, Cointelegraph spoke with Shima Capital’s founder and managing general partner, Yida Gao. He founded Shima Capital in 2021, and the fund has since been very active, investing in nearly 100 projects. Gao is also an adjunct professor at the Massachusetts Institute of Technology. </p><p><strong>Cointelegraph: Shima Capital was founded relatively recently, yet the firm has already invested in some of the most prominent projects in the crypto industry. As of now, which investment would you consider to be the most successful?</strong></p><p><strong>Yida Gao: </strong>This feels like asking a parent to choose their favorite child! I would say it’s still too early to make that call, as you alluded to. We definitely have a few that have performed pretty well and attracted good traction, such as Wombat Exchange, Berachain, Magna, Monad Network, etc. We’ve also incubated several projects that we will announce soon. For now, we’re proud of all the portfolio companies for pushing through this continuing bear market. So, the fact that they’re still standing means they’ve successfully navigated one of the toughest situations they’ll ever face.</p><p><strong>CT: Who were your initial investors, and how did you persuade them to invest in such a high-risk industry?</strong></p><p><strong>YG: </strong>Although some of our own investors were named in earlier announcements, we’ve since taken a more personable approach and prefer to respect their privacy. That said, I’ve been in the finance and venture space for a decade, so I have a track record in both traditional and Web3 investing. I believe having navigated through the ups and downs in terms of the market and market sentiment played a key role in gaining the trust of some of the most successful investors in the world.</p><p><strong>CT: In the early days of Shima Capital, how did you attract your deal flow?</strong></p><p><strong>YG: </strong>Although Shima Capital itself was new, and still is to a degree, I — having been around the space since 2015 — have tried to build a strong global network and reputation in the industry. Additionally, we have a world-class team at Shima who individually bring additional credibility and esteem to our fund. Our motto of “running through walls for our founders” seems to help attract deal flow as well.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/5d19dd2c-9e42-4523-b0dc-28c7efbf5436.jpg\"  /></figure><h2>About the industry</h2><p><strong>CT: Given the recent volatility in the crypto market and high-profile cases involving companies like Celsius, 3AC, Alameda Research and FTX, how do you justify the risks to your investors?</strong></p><p><strong>YG: </strong>Most of our investors have been investing in Web3 and crypto for a while and are well aware of the risks involved in this industry — or any other industry, for that matter. We maintain quarterly regular updates to our investors and have frequent emails, messages or calls with them too. We believe that this is more about building up relationships and trust, and I work hard myself and as Shima Capital to maintain strong relationships and build lasting trust with everyone we work with.</p><p><strong>CT: FTX was considered to be an industry blue chip for some time, but recent events have raised questions about the need for regulations. In your view, what kind of regulations could prevent such scenarios as happened to FTX, Alameda and 3AC from happening in the future?</strong></p><p><strong>YG: </strong>We invest in projects we believe to be upstanding and responsible, with or without official regulations. For Shima Capital itself, we are registered with the Securities and Exchange Commission and work daily to maintain SEC compliance. It’s debatable whether regulations could have prevented the aforementioned scenarios, but as long as we continue working in good faith to all stakeholders, our industry will not just survive but thrive.</p><p><strong>CT: What is your vision for the ideal consensus between the crypto community and governments? Moreover, how will the potential tightening of U.S. regulations impact the development of the industry?</strong></p><p><strong>YG: </strong>As I mentioned previously, there can be a friendly co-existence between regulators and the Web3 industry/community at large. As long as we all strive to act responsibly and regulations do not become too restrictive, the industry will continue its rapid, innovative development.</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/bitcoin-etf-sec-deadline\">Bitcoin ETF applications: Who is filing and when the SEC may decide</a></em></strong></p><p><strong>CT: One of the biggest challenges for the crypto industry is the lack of mainstream use cases. For many people, this industry is still synonymous with illicit activities such as money laundering and terrorism financing. What do you think needs to happen to change this perception?</strong></p><p><strong>YG: </strong>I think we’re already making major headways in this regard. Decentralized finance has advanced a lot in the past few years, and the infrastructure has also made progress to support smoother user experiences. We have also been tracking projects in the gaming and consumer verticals. This can mean a lot of things to different people, but essentially, it’s about providing digital property rights access to all and owning your assets, like playable characters, for instance. As more and more well-known non-crypto brands join Web3 in some capacity, it brings more credibility. </p><p><strong>CT: Are NFTs a thing of the past, or do you anticipate their evolution into something new? What, in your opinion, is the next big thing?</strong></p><p><strong>YG: </strong>Like any other “hot new thing,” there can be ups and downs throughout the lifecycle. For NFTs, we’re already seeing an uptick in NFT volume since then, and more and more mainstream brands are coming on board. Recent developments are skewing more toward NFT financialization, or NFTFi, which is another sector we have been focusing on. We believe that NFTs could maintain this rejuvenated momentum and regain popularity. But to open it up to additional verticals, we see real-world assets, or RWAs, and regenerative finance picking up steam this year, along with more innovative on-chain ideas like restaking.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">MIT Bitcoin Expo running 10 yrs strong  <a href=\"https://t.co/wPW9MAXuEj\">https://t.co/wPW9MAXuEj</a></p>&mdash; Yida Gao (@yidagao) <a href=\"https://twitter.com/yidagao/status/1650160375894032385?ref_src=twsrc%5Etfw\">April 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong>CT: The last bull run was triggered by the “DeFi summer.” What catalyst do you think will ignite the next bull run?</strong><strong></strong></p><p><strong>YG: </strong>Wouldn’t we all love to have this answer?! But the truth is, there are so many factors that will make this happen, some within crypto and some external, like regulation from governments. If I had to pick two potential “summers,” it would be RWAs and Web3 gaming.</p><p><strong>CT: In light of the recent collapses of several big banks, many people are concerned about the existing financial system. How do you envision the future of finance and economics, and what new norms do you think will emerge, and in what timeframe?</strong></p><p><strong>YG: </strong>It’s much easier to pinpoint what went wrong after something happened, but unfortunately, there are no crystal balls here. I do think that the worlds of traditional and blockchain-based financial systems can co-exist, and likely will in the new future. Traditional banks have been looking into blockchain and crypto for years, so it’s only a matter of time before they gain widespread and mainstream popularity. A big unlock will be clearer regulations in industry-leading countries like the United States.</p><p><strong>CT: The world is buzzing about AI and ChatGPT. There are those who believe AI will “steal jobs,” while others are confident it will enhance our lives and make them easier. What is your perspective? Furthermore, what significant changes do you think AI will bring to the crypto industry?</strong></p><p><strong>YG: </strong>Right now, AI and ChatGPT are great idea generators and editors. You can plug in a request for “Web3 marketing practices,” for instance, and it’ll generate 10 ideas. Some good, some less good. Same with editing. Throw in some web copy or an article and ask the AI to critique it for you, and it will. But that’s why humans will always be needed. There’s a literal limit to how much ChatGPT knows (September 2021 is the end-line for its knowledge base as of today). Anyone can use AI as a jumping-off point, but we’ll always need humans to edit and refine and add and remove. Areas where crypto might be able to help include democratizing data labeling with token incentives, data proofs and proof of AI inference calls to demonstrate model verification.</p><h2>Portfolio companies</h2><p><strong>CT: What does an ideal startup look like to Shima? Is it the idea, the personality of the founder, the team or the traction that takes priority?</strong></p><p><strong>YG: </strong>Honestly, we take it all into consideration! We need to believe in the product first and foremost, but we also need to believe in the founder’s vision and the team’s ability to execute on that vision. A brand-new idea won’t have traction in terms of users at this point, but the path to traction should be clear. We look at the entire package when doing our due diligence, which generally falls into three buckets: team, product and market. As a seed fund, we care most about the team since product and market can always change in this fast-moving industry.</p><p><strong>CT: Shima Capital has invested in several DeFi startups. How do you assess the risks associated with DeFi investments, and what measures do you take to mitigate those risks?</strong></p><p><strong>YG: </strong>There are just as many risks investing in Web2 as there are in Web3, including DeFi. What’s important is to understand that there are risks no matter what, and to identify and weigh risks as best you can before investing. We spend considerable time on due diligence and researching all aspects of the business, from the idea to the team to the inherent risks, and then make a well-informed decision. For DeFi specifically, it’s important to also review the smart contracts, if possible, to make sure there are no known bugs. (De.fi is a good tool to automatically look for common smart contract vulnerabilities.)</p><p><strong>CT: What is the best way for a startup to capture your attention?</strong></p><p><strong>YG: </strong>All the things I mentioned throughout this interview! A solid idea, founders uniquely positioned to capture the market for said idea and a clear go-to-market strategy presented in a concise presentation.</p><p><strong>CT: Does Shima invest solely in equity, or do you also invest in tokens? In what terms?</strong> </p><p><strong>YG: </strong>We primarily invest in SAFEs [simple agreements for future equity] with token warrants but sometimes invest in pure tokens as well. The terms are deal-by-deal specific.</p><p><strong>CT: What is your fastest-growing portfolio company, and what do you believe is the key to its success?</strong></p><p><strong>YG: </strong>We have several that have performed well through the crypto bear market, such as Wombat Exchange, Berachain, Magna and Monad Network. It’s very hard to hand-pick one from the long list, as the definition of fast-growing would be different for different business models. In order to be successful, we think the founding team is a critical key to success. This includes the team’s capability to identify high-potential markets and execute on strong strategies to capture said market.</p><p><strong>CT: How do you discover the best deals?</strong></p><p><strong>YG: </strong>We have a deep network of connections in the VC world and strong relationships across the industry, from OG angels to exchanges to other strategists. Our investment team also proactively sources deals through hackathons, demo days of accelerators, colleges and even via Twitter. We’re always on the lookout for the next big project.</p><p><strong>CT: Many prominent investors, such as a16z and Shima, are investing in Web3 gaming. However, many metaverse and Web3 projects appear to be overhyped. What motivates investors to remain optimistic about Web3 games and virtual environments?</strong></p><p><strong>YG: </strong>You need to look beyond buzzwords and hype and focus on the underlying technology and — most importantly — the user experience. With gaming, all that players care about is the experience of playing the game. If it’s a good game, they won’t care what technology is used to build it. Most gamers wouldn’t be able to tell you how Web2 games are currently built, but they can tell you which games they like playing and why. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\">How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</a></em></strong></p><p>User experience beats all else, whether it’s Web3 or not! Some of the reasons we’re excited about Web3 gaming include its potential to decrease development cycles via short feedback loops between the developers and its community of gamers, interoperability of digital game assets/IP, new user acquisition strategies in a post-IDFA world [identifier for advertisers rollout by Apple], and novel gaming mechanics like fully on-chain games that are only enabled by blockchain technologies.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-06T12:55:34.000Z",
    "title": "Digital ruble rise threatens future of conventional banking in Russia",
    "url": "https://cryptoslate.com/digital-ruble-rise-threatens-future-of-conventional-banking-in-russia/",
    "description": "<p>Anatoly Aksakov, the chairman of Russia&#8217;s Financial Market Committee in the State Duma, suggested that the Digital Ruble, a central bank digital currency (CBDC), could potentially render traditional banks redundant, as local media outlet Ria reported on Sept 5. Aksakov reportedly said at a media forum AIF Media meeting that these traditional financial institutions will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/digital-ruble-rise-threatens-future-of-conventional-banking-in-russia/\">Digital ruble rise threatens future of conventional banking in Russia</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-06T12:41:12.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Consolidation Continues, as Moving Average ‘Death Cross’ Nears",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-consolidation-continues-as-moving-average-death-cross-nears/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2013022463-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Consolidation Continues, as Moving Average ‘Death Cross’ Nears\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2013022463-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2013022463-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2013022463-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2013022463-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2013022463-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2013022463-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2013022463.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin was largely unchanged on Wednesday, as moving averages closed in on a potential upward crossover. The potential for a &#x201C;death cross&#x201D; will likely be in the mind of would-be bulls, looking for an opportune time to reenter. Ethereum continues to hover close to a floor of $1,630. Bitcoin Bitcoin&#x2019;s consolidation continued on Wednesday, as [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-06T12:58:55.000Z",
    "title": "Turkey inflation rises to 59% as the Turkish lira devalues",
    "url": "https://www.cryptopolitan.com/turkey-inflation-climbs-to-59/",
    "description": "In August, inflation in Turkey surged to 58.9% year-on-year, marking the highest rate since December 2022, as per official data released on Monday. Prices have soared nearly 60% compared to the same period last year, and there was a 9.1% increase compared to the previous month. This rapid rise in prices can be attributed to ... <a title=\"Turkey inflation rises to 59% as the Turkish lira devalues\" class=\"read-more\" href=\"https://www.cryptopolitan.com/turkey-inflation-climbs-to-59/\" aria-label=\"More on Turkey inflation rises to 59% as the Turkish lira devalues\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-06T12:49:34.000Z",
    "title": "The Road Ahead and How Artificial Intelligence is Transforming the Transportation Sector",
    "url": "https://www.cryptopolitan.com/ai-is-transforming-the-transportation-sector/",
    "description": "The transportation sector has been on a remarkable journey since the introduction of artificial intelligence (AI). With futuristic visions of flying cars and advanced vehicle innovations, the industry readily embraced AI&#8217;s transformative potential. Today, AI is driving significant changes in the transportation sector, touching nearly every aspect of the way we move people and goods. ... <a title=\"The Road Ahead and How Artificial Intelligence is Transforming the Transportation Sector\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-is-transforming-the-transportation-sector/\" aria-label=\"More on The Road Ahead and How Artificial Intelligence is Transforming the Transportation Sector\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-06T12:43:19.000Z",
    "title": "TON Foundation Founded in Switzerland as a Non-Profit Organization",
    "url": "https://www.cryptopolitan.com/ton-foundation-founded-in-switzerland-as-a-non-profit-organization/",
    "description": "Zug, Switzerland, September 6th, 2023, Chainwire The Open Network Foundation (TON Foundation), the non-profit association supporting the growth of The Open Network (TON), announces its official launch as a Swiss non-profit organization. Switzerland is known for its rich history of technological innovations across multiple industries, including its clear and precise legal framework surrounding blockchain and ... <a title=\"TON Foundation Founded in Switzerland as a Non-Profit Organization\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ton-foundation-founded-in-switzerland-as-a-non-profit-organization/\" aria-label=\"More on TON Foundation Founded in Switzerland as a Non-Profit Organization\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-06T12:59:15.000Z",
    "title": "Binance Russia execs leave amid ongoing rumors of market exit",
    "url": "https://crypto.news/binance-russia-execs-leave-amid-ongoing-rumors-of-market-exit/",
    "description": "Two Binance executives announced they were leaving the company amid the rumors of the major exchange possibly exiting Russia. Binance&#8217;s head of Eastern Europe and CIS, including Russia, Gleb Kostarev, announced in a Sept. 6 LinkedIn post that it was&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-06T12:48:44.000Z",
    "title": "Grayscale urges SEC to approve its spot Bitcoin ETF filing",
    "url": "https://crypto.news/grayscale-urges-sec-to-approve-its-spot-bitcoin-etf-filing/",
    "description": "Grayscale is calling on the US SEC to approve its spot Bitcoin exchange-traded fund (ETF) application, arguing that further delay would cause harm to investors.  Grayscale&#8217;s lawyers on Sept. 5 wrote a letter to the SEC seeking a meeting with&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-06T13:00:13.000Z",
    "title": "Bitcoin HODLer Dominance Rises To Record Levels, Bullish Sign?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-hodler-dominance-rises-to-record-levels-bullish-sign/",
    "description": "On-chain data shows the divergence between the Bitcoin long-term holders and short-term holders has grown to record levels recently. Bitcoin Market Has Been Continuing Its Shift Towards HODLing As an analyst in a post on X explained, the gap between the speculators and HODLers in the market has only grown wider recently. The &#8220;short-term holders&#8221; (STHs) and the &#8220;long-term holders&#8221; (LTHs) are the two primary cohorts that the entire Bitcoin market can be divided into. The STHs refer to all those investors who purchased their coins less than 155 days ago, while the LTHs include the holders who have been holding onto their tokens beyond that period. Statistically, the longer an investor keeps their coins dormant, the less likely they become to sell them at any point. Due to this reason, the STHs are usually the group with the weaker conviction of the two. The LTHs often hold through volatile periods in the asset without moving an inch, which has earned them the popular name &#8220;diamond hands.&#8221; The STHs, on the other hand, tend to sell quickly whenever FUD emerges in the sector, or a profitable selling opportunity appears. Related Reading: Here’s What Will Happen If Bitcoin Can Break $33,700 Now, here is a chart that shows the trend in the supplies of these BTC investor groups throughout the history of the cryptocurrency: Looks like the two metrics have been going in opposite directions to each other &#124; Source: @jimmyvs24 on X The graph shows that the Bitcoin LTH supply has been on an uptrend during the past couple of years, while the STH supply has been going down recently. This would suggest that the overall supply of the cryptocurrency is continuously becoming more dormant. The gap between these groups is the widest it has ever been, as the LTH supply is nearing the 15 million BTC mark, while the STH supply has dropped under the 2.5 million BTC level. Related Reading: Bitcoin Exchanges See Three Straight Months Of Withdrawals For First Time Ever The latter&#8217;s latest value is the lowest it has ever been since 2011 when the asset was still in its infancy. It would appear that short-term speculators in the market have thinned to record lows. Last month, Bitcoin witnessed a sharp crash from above the $29,000 level to below the $26,000 mark, and the asset has not recovered. As is apparent from the chart, though, the LTHs haven&#8217;t cared about the asset&#8217;s struggle at all, as their supply has only continued to head up while the STHs have shrunken down further. The LTH group remaining strong and continuing its growth may not affect the market in the short-term, but during longer periods, the supply continuing to become locked in the wallets of these HODLers could have a bullish impact due to how supply-demand dynamics work. BTC Price At the time of writing, Bitcoin is floating around the $25,700 mark, registering a dip of 6% over the past week. BTC remains unable to show a break in either direction &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-06T13:00:25.000Z",
    "title": "GlobaleCrypto: Leading the Charge in User-Centric Cloud Mining",
    "url": "https://www.crypto-news-flash.com/globalecrypto-leading-the-charge-in-user-centric-cloud-mining/",
    "description": "<img width=\"559\" height=\"562\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Unbenannt.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Unbenannt.jpg 559w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Unbenannt-298x300.jpg 298w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Unbenannt-150x150.jpg 150w\" sizes=\"(max-width: 559px) 100vw, 559px\" />In the dynamic realm of cryptocurrency, GlobaleCrypto continues to stand as a trailblazing force, heralding a new era in cloud mining. Renowned for its innovative prowess and unwavering reliability, the company is reshaping the cloud mining landscape with an unyielding focus on user benefits. GlobaleCrypto isn&#8217;t just redefining the game; it&#8217;s giving users the power [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-06T12:54:42.000Z",
    "title": "ConsenSys Report: Where Is the Crypto Industry Today?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/consensys-report-where-is-the-crypto-industry-today/",
    "description": "<p>ConsenSys and YouGov recently released a crypto insight report. The survey featured respondents from 15 nations and offered insight into how people around the globe perceive cryptos and the broader Web3 industry. For this article, we’ll look at some aspects of the crypto report, including growing awareness of Web3 around these nations. We have another [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/consensys-report-where-is-the-crypto-industry-today/\">ConsenSys Report: Where Is the Crypto Industry Today?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-06T12:50:30.000Z",
    "title": "Cosmos (ATOM) Price Prediction 2023-2030: Will ATOM Price Hit $25 Soon?",
    "url": "https://coinedition.com/cosmos-atom-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Cosmos-ATOM-PRICE-PREDICTION.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cosmos (ATOM) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Cosmos-ATOM-PRICE-PREDICTION.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Cosmos-ATOM-PRICE-PREDICTION-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Cosmos-ATOM-PRICE-PREDICTION-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Cosmos-ATOM-PRICE-PREDICTION-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Cosmos-ATOM-PRICE-PREDICTION-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bullish Cosmos (ATOM)price prediction ranges from $10 to $17. Analysis suggests that the Cosmos price might reach above $15. The Cosmos bearish market price prediction for 2023 is $1,065. Cosmos is a blockchain project that was launched in 2016 on the Ethereum network. Its native token ATOM was initially launched as an ERC-20 token before [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/cosmos-atom-price-prediction/\">Cosmos (ATOM) Price Prediction 2023-2030: Will ATOM Price Hit $25 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-06T12:44:55.000Z",
    "title": "MASK, MAGIC, DODO, SRM, GALA Show Historic Buy Signals: Report",
    "url": "https://coinedition.com/mask-magic-dodo-srm-gala-show-historic-buy-signals-report/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/MASK-MAGIC-DODO-SRM-GALA-Show-Historic-Buy-Signals-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The blockchain intelligence platform Santiment revealed in a tweet earlier today that many altcoins are beginning to show mild signs of life. In the post, the platform highlighted DODO, Gala (GALA), MAGIC, Mask Network (MASK), and Serum (SRM) as cryptocurrencies to watch in the coming few weeks since they are presenting historic buy opportunities. DODO [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/mask-magic-dodo-srm-gala-show-historic-buy-signals-report/\">MASK, MAGIC, DODO, SRM, GALA Show Historic Buy Signals: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]