[
  {
    "source": "CoinDesk",
    "date": "2024-02-08T15:10:54.000Z",
    "title": "Bitcoin Breaks Above $45K, Traders Predict a Possible $50K Push ",
    "url": "https://www.coindesk.com/markets/2024/02/08/bitcoin-breaks-above-45k-traders-predict-a-possible-50k-push/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The cryptocurrency last traded above $45,000 on Jan 11."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-08T15:31:17.000Z",
    "title": "Blast Layer-2 Solution: Enhancing Ethereum's Scalability and Yield",
    "url": "https://decrypt.co/resources/blast-layer-2-solution-enhancing-ethereums-scalability-and-yield",
    "description": "Ethereum layer-2 scaling solution Blast sets itself apart with features including native yields for ETH and stablecoins."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-08T15:12:52.000Z",
    "title": " Why is Cardano (ADA) price up this week? ",
    "url": "https://cointelegraph.com/news/why-is-cardano-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDMvZWUyNDI5NjYtNjU2OS00YWFhLTg0ZTEtZDAzY2FiYzMxMWIxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Broader market uptrends and Solana's network outage have triggered this week’s rise in ADA price.</p>\n                    <p><p>This week, Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) has experienced a notable rise, rising over 8.5% to reach $0.535 by Feb. 8. The bulk of this weekly appreciation, approximately 6.5%, occurred in the last 24 hours, driven by a confluence of technical indicators, on-chain data, and foundational developments. </p><p>Cardano’s rise this week mirrors upside sentiment elsewhere in the crypto market. For instance, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), the leading cryptocurrencies by market cap, have risen by over 4% and 5.25% week-to-date, respectively.</p><p>The daily correlation coefficient between Cardano and Bitcoin has remained mostly positive throughout history. As of this week, it was above 0.75.</p><p><a href=\"https://cointelegraph.com/news/why-is-cardano-price-up-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-08T15:09:45.000Z",
    "title": " Sam Bankman-Fried to return to court for hearing over legal representation ",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-court-legal-representation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNDMwZTQ4OTYtMzA2MS00MjNlLTk4MDYtOGM0OTNjOTY4MmI0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The former crypto CEO was convicted of seven felony counts on Nov. 3 and is scheduled to appear for sentencing in March.</p>\n                    <p><p>For one of the first times since the conclusion of his first criminal trial, former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam “SBF” Bankman-Fried</a> will appear before a judge to address potential conflicts of interest in his legal team.</p><p>In a Feb. 7 filing in United States District Court for the Southern District of New York, Judge Lewis Kaplan <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590940/gov.uscourts.nysd.590940.399.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">ordered</a> Bankman-Fried to appear in person on Feb. 21 for a Curcio hearing over concerns about lawyers Marc Mukasey and Torrey Young. According to the New York-based Blanch Law Firm, during a Curcio hearing, a judge may <a href=\"https://www.theblanchlawfirm.com/nyc-criminal-lawyer/\" target=\"_blank\" rel=\"noopener nofollow\">ask</a> a defendant — in this case, SBF — questions about his legal representation and if he was informed about any potential conflict of interest.</p><p>The hearing stemmed from a letter <a href=\"https://cointelegraph.com/news/prosecutors-conflict-interest-lawyers-sam-bankman-fried-alex-mashinsky\">written by U.S. prosecutors</a> on Feb. 6 raising concerns about Mukasey and Young, who filed notices of appearance in both SBF’s and former CEO Alex Mashinsky’s cases. According to prosecutors, Celsius lent money to FTX’s sister company, Alameda Research. Mashinsky partially blamed the firm’s collapse on SBF’s actions — matters that could present a “contrary position” at trial and during either former crypto CEOs’ sentencing. </p><p><a href=\"https://cointelegraph.com/news/sam-bankman-fried-court-legal-representation\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-08T15:00:36.000Z",
    "title": "Starknet-based zkLend announces ZEND token, reveals ambitious 2024 roadmap",
    "url": "https://cryptoslate.com/starknet-based-zklend-announces-zend-token-reveals-ambitious-2024-roadmap/",
    "description": "<p>zkLend, a money market protocol built on the Ethereum layer2 network Starknet, is preparing to launch its native ZEND token this year to enhance its platform&#8217;s utility. In a Feb. 7 statement shared with CryptoSlate, the platform explained that the token would be airdropped at an undisclosed time to the platform&#8217;s users, who are currently [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/starknet-based-zklend-announces-zend-token-reveals-ambitious-2024-roadmap/\">Starknet-based zkLend announces ZEND token, reveals ambitious 2024 roadmap</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-08T15:31:03.000Z",
    "title": "Alphabet CEO Sundar Pichai on Gemini Ultra, Google’s Answer to Rival ChatGPT Plus",
    "url": "https://www.cryptoglobe.com/latest/2024/02/alphabet-ceo-sundar-pichai-on-gemini-ultra-googles-answer-to-rival-chatgpt-plus/",
    "description": "Earlier today, Alphabet and Google CEO Sundar Pichai recently joined CNBC’s “Squawk Box” to discuss significant developments at Google, particularly focusing on the company’s AI rebranding from Bard to Gemini and the introduction of a new paid version termed “Gemini Advanced” or “Gemini Ultra.” The discussion with co-anchor Andrew Ross Sorkin covered various topics, including […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-08T15:37:26.000Z",
    "title": "Think Monero (XMR) Is Out? This Price Analysis Will Make You Reconsider",
    "url": "https://cryptodaily.co.uk/2024/02/think-monero-xmr-is-out-this-price-analysis-will-make-you-reconsider",
    "description": "Explore the shifting sands of the 2024 cryptocurrency market. Dive into our latest analysis to understand the contrasting fortunes of mainstream assets and privacy-focused tokens like Monero (XMR) amid regulatory challenges and evolving investor interests. Stay ahead in the ever-changing world of digital currencies."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-08T15:14:43.000Z",
    "title": "Pullix (PLX) Token Presale Attracts Investors’ Attention As Binance Coin (BNB) And Arbitrum (ARB) Exhibits Turbulent Price Outlook",
    "url": "https://cryptodaily.co.uk/2024/02/pullix-plx-token-presale-attracts-investors-attention-as-binance-coin-bnb-and-arbitrum-arb-exhibits-turbulent-price-outlook",
    "description": "As numerous top crypto coins showed potential for the new year, only a few maintained their bullish momentum into February. Notably, tokens such as Binance (BNB) and Arbitrum (ARB) experienced an early January rise followed by a decline."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-08T15:09:52.000Z",
    "title": "Solana (SOL) Jumps 308% While Ripple (XRP) Gets Bullish, Everlodge (ELDG) Listing Imminent",
    "url": "https://cryptodaily.co.uk/2024/02/solana-sol-jumps-308-while-ripple-xrp-gets-bullish-everlodge-eldg-listing-imminent",
    "description": "Solana (SOL) is showcasing a major upswing on the charts, which can result in a much higher accumulation scale."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-08T14:57:02.000Z",
    "title": "Kinetex integrates 1inch to boost liquidity in cross-chain swaps",
    "url": "https://cryptodaily.co.uk/2024/02/kinetex-integrates-1inch-to-boost-liquidity-in-cross-chain-swaps",
    "description": "Kinetex integrates 1inch to boost liquidity in cross-chain swaps"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-08T14:54:39.000Z",
    "title": "GoDaddy Embrace Ethereum Name Service, Vechain PartnerS With XCMG Group, KangaMoon Presale Buzz Begins",
    "url": "https://cryptodaily.co.uk/2024/02/godaddy-embrace-ethereum-name-service-vechain-partners-with-xcmg-group-kangamoon-presale-buzz-begins",
    "description": "GoDaddy has added Ethereum Name Service to its selection of DNS service. Meanwhile, Vechain has announced a strategic partnership with XCMG Group to reduce the carbon footprint in the construction sector."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-08T14:48:31.000Z",
    "title": "Looking To Make Millions From Crypto? These Are 3 Cryptocurrencies To Add To Your Portfolio",
    "url": "https://cryptodaily.co.uk/2024/02/looking-to-make-millions-from-crypto-these-are-3-cryptocurrencies-to-add-to-your-portfolio",
    "description": "While some top DeFi projects like Render and HNT are improving in the market following recent market corrections, analysts have advised that $RBLZ is the best crypto to invest in. Rebel Satoshi's $RBLZ appears as a top altcoin to invest in due to its potential to surge by 150%. Let's compare RNDR, HNT, and $RBLZ as we explore the best cryptos to buy in 2024."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-08T14:44:07.000Z",
    "title": "Kresus Crypto Wallet To Provide Secure Digital Art and NFT Storage via Sotheby’s Metaverse",
    "url": "https://cryptodaily.co.uk/2024/02/kresus-crypto-wallet-to-provide-secure-digital-art-and-nft-storage-via-sothebys-metaverse",
    "description": "Kresus Crypto Wallet To Provide Secure Digital Art and NFT Storage via Sotheby’s Metaverse"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T15:30:38.000Z",
    "title": "Jupiter’s Strategic Evolution: Pioneering Change in DeFi Tokenomics",
    "url": "https://www.cryptopolitan.com/jupiters-evolution-change-in-defi-tokenomics/",
    "description": "In a surprising twist that&#8217;s causing a buzz in the decentralized finance (DeFi) world, Jupiter, a big player in the DeFi scene, has decided to shake things up. They&#8217;re taking a bold step by pulling all their tokens, JUP, out of circulation. The gutsy move isn&#8217;t just a casual adjustment; it&#8217;s a clear signal that [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T15:27:26.000Z",
    "title": "NBA Faces Class-Action Lawsuit Over Marketing Ties to Failed Crypto Lender Voyager Digital",
    "url": "https://www.cryptopolitan.com/nba-lawsuit-failed-lender-voyager-digital/",
    "description": "A group of disgruntled investors in the now-collapsed crypto lender Voyager Digital has launched a proposed class-action lawsuit against the National Basketball Association (NBA), North America&#8217;s premier basketball league. The investors allege that the NBA&#8217;s marketing deals with the crypto platform were implicit and contributed to substantial losses exceeding $4.2 billion. Filed on February 6 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T15:25:00.000Z",
    "title": "Hong Kong to Implement Universal AML Requirements for OTC Crypto Traders",
    "url": "https://www.cryptopolitan.com/hong-kong-universal-aml-requirements-otc/",
    "description": "The Hong Kong government is set to expand its Anti-Money Laundering (AML) and Counter-Terrorist Financing (CTF) regulations to include over-the-counter (OTC) cryptocurrency transactions. The adjustment is aimed at aligning OTC digital asset trades with the regulatory standards applied to retail cryptocurrency exchanges. Extending AML Ccontrols to OTC cryptocurrency transactions Hong Kong authorities launched a &#8220;Public [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T15:22:48.000Z",
    "title": "Critical Security Alert: WordPress Plugin Vulnerability Exposed",
    "url": "https://www.cryptopolitan.com/security-alert-wordpress-plugin-exposed/",
    "description": "A significant security issue has come to light involving a widely-used WordPress plugin, &#8220;Cryptocurrency Widgets – Price Ticker &#38; Coins List.&#8221;&#160; The problem, pinpointed by the CVE Program, impacts versions 2.0 to 2.6.5 of the plugin, creating a potential for sensitive data exposure due to a SQL Injection vulnerability. Unpacking the WordPress Plugin Issue The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T15:18:55.000Z",
    "title": "Bitcoin anniversary message appears in Times Square, NYC",
    "url": "https://www.cryptopolitan.com/bitcoin-anniversary-message-appears/",
    "description": "A cryptic message referencing the creator of Bitcoin has emerged on digital billboards in the heart of New York City, marking the 15th anniversary of the cryptocurrency&#8217;s genesis block.&#160; Funded by an anonymous donor and publicized by Colin Wu, a prominent Chinese reporter and crypto insider, the advertisement pays homage to the origins of Bitcoin [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T15:08:56.000Z",
    "title": "Hacken unveils inside job in $112.5 million Ripple wallet hack",
    "url": "https://www.cryptopolitan.com/hacken-unveils-inside-job-in-112-5-million/",
    "description": "Hacken, a renowned cybersecurity firm, has revealed compelling evidence indicating an inside job in the recent hacking incident targeting Chris Larsen, the co-founder and chairman of Ripple.&#160; The breach, which resulted in the loss of 213 million XRP valued at $112.5 million, has sent shockwaves through the cryptocurrency community. The duration of the breach, an [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T15:04:07.000Z",
    "title": "New Report Highlights Vulnerability of Highly Skilled Professions to AI Disruption",
    "url": "https://www.cryptopolitan.com/new-report-highlights-vulnerability-of-highly-skilled-professions-to-ai-disruption/",
    "description": "A recent report published by the Society for Human Resource Management (SHRM), in collaboration with the Burning Glass Institute (BGI), has shed light on the potential impact of generative artificial intelligence (GenAI) on various professions.&#160; The report identifies five highly skilled occupations &#8211; certified public accountants, mortgage brokers, legal professionals, tax specialists, and marketing researchers [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T15:03:02.000Z",
    "title": "Middle Eastern governments embrace metaverse to boost economies",
    "url": "https://www.cryptopolitan.com/middle-eastern-governments-embrace-metaverse/",
    "description": "Amidst the evolution of digital landscapes, the metaverse concept has transcended its initial hype, finding resonance in the strategic visions of governments across the Middle East. Samuel Huber, CEO of LandVault, a pioneering metaverse firm, elucidated this burgeoning trend during the Arte Talks event in Dubai.&#160; As the metaverse matures beyond its prototype phase, Middle [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T15:00:30.000Z",
    "title": "Overwatch 2 Season 9 Brings Major Updates and Competitive Rework in Early 2024",
    "url": "https://www.cryptopolitan.com/discover-the-latest-updates-for-overwatch-2-season-9-including-ranked-resets-new-skins-and-a-cowboy-bebop-crossover-launching-on-february-13/",
    "description": "Overwatch 2 enthusiasts are eagerly anticipating the arrival of Season 9, dubbed &#8220;Champions,&#8221; set to commence on February 13th, 2024. With the conclusion of Season 8, players can gear up for a fresh wave of content and gameplay enhancements. While no new hero joins the roster this season, Blizzard promises substantial updates, particularly aimed at [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T14:59:49.000Z",
    "title": "Final Fantasy 7 Rebirth to Feature Expansive World Exploration",
    "url": "https://www.cryptopolitan.com/final-fantasy-7-rebirth-to-feature-expansive/",
    "description": "In the upcoming installment of the iconic Final Fantasy series, Final Fantasy 7 Rebirth, players can anticipate a significant departure from the linear structure of its predecessor, Final Fantasy 7 Remake. While not embracing a traditional open-world format, the game promises a wealth of exploration opportunities across its richly detailed environments. One of the most [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-08T15:30:00.000Z",
    "title": "Spot Bitcoin ETF inflows top $1.55b; investors supporting Solana and NuggetRush",
    "url": "https://crypto.news/spot-bitcoin-etf-inflows-top-1-55b-investors-supporting-solana-and-nuggetrush/",
    "description": "Spot Bitcoin ETFs have attracted over $1.55 billion since Jan. 11. Solana (SOL) and NuggetRush (NUGX) are also receiving strong investor support"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-08T14:40:06.000Z",
    "title": "Creating Killer Whales and bringing web3 to masses: a conversation with Hello Labs CEO Sander Görtjes",
    "url": "https://crypto.news/creating-killer-whales-and-bringing-web3-to-masses-a-conversation-with-hello-labs-ceo-sander-gortjes/",
    "description": "Produced by Hello Labs and boasting a roster of leaders and influencers from the crypto industry, the web3 series showcases crypto and NFT entrepreneurs and the stories behind their concepts."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-08T15:00:55.000Z",
    "title": "Chainlink Breeds New Whales As $49.9 Million Accumulation Spree Cause Prices To Surge",
    "url": "https://www.newsbtc.com/news/chainlink/chainlink-whales-prices-surge/",
    "description": "Chainlink (LINK) has traders buzzing as its price has been up by 40% since the last week of January, massively outpacing the broader cryptocurrency market. Amidst this price spike, mysterious whale wallets have been topping up their holdings, as evidenced by on-chain data.  According to blockchain tracker Lookonchain, there&#8217;s been a massive outflow of LINK from crypto exchange Binance in the past two days, particularly with 49 new wallets receiving 2,745,815 LINK within this timeframe.  Massive LINK Accumulation Occurs On Binance Before Withdrawal Details from Binance point to an ongoing accumulation of LINK from the crypto exchange. In the middle of this accumulation, a particular whale or institution has been going on a buying spree, gobbling up more than 2.7 million LINK tokens worth $49.9 million. This accumulation came days after the Lookonchain noticed that four new wallets had withdrawn over 119,583 LINK tokens worth over $2.15 million from Binance. Related Reading: Bitcoin Miner Reserves Drop To June 2021 Levels, What This Means For Price Whales/institutions continue to accumulate $LINK! This mysterious whale/institution withdrew 2,745,815 $LINK($49.9M) from #Binance via 49 new wallets. Whale&#8221;0x2A19&#8243; withdrew 494,957 $LINK($9M) from #Binance in the past 10 days.https://t.co/QoP2waErBShttps://t.co/iaPHa9f0XB pic.twitter.com/GUW1S33NHf — Lookonchain (@lookonchain) February 7, 2024 Similarly, Lookonchain noted that another whale address &#8220;0x2A19&#8221; has withdrawn 494,957 LINK tokens worth $9 million from Binance in the past 10 days. Notably, whale transaction tracker Whale Alerts has also noted some accumulation of LINK tokens from other crypto exchanges. 🚨 800,000 #LINK (14,701,915 USD) transferred from #Bybit to unknown wallethttps://t.co/RQEu3CxLVM — Whale Alert (@whale_alert) February 7, 2024 Analytics platform Santiment also noted that LINK whale addresses have upped their activity amidst the price surge as large amounts of coins were moved by previously stagnant wallets. This influx of tokens back into the network&#8217;s circulation, coupled with a minor liquidation of wallets, seems to have contributed to the price spike. 🔗📈 #Chainlink has jumped ahead of the #altcoin pack after some previously dormant wallets created the highest Age Consumed spike (5.38B, calculated by multiplying coins moved by the amount of days those coins had been dormant). This influx of $LINK back into the (Cont) 👇 pic.twitter.com/eHVpeJz2HW — Santiment (@santimentfeed) February 1, 2024 How Will New Chainlink Whales Impact Price Action Going Forward? The crypto industry is currently going through a modest price gain led by Bitcoin recently breaking above the $44,000 level again. As a result, the industry is now up by 3.25% in the past 24 hours, with a 22.60% increase in trading volume.  LINK hasn&#8217;t been left out of this price gain, registering a 4.30% gain in the past 24 hours. However, LINK has been on a sustained breakout since January, reaching as high as $19.68 on February 5.  Related Reading: Cardano Activity Sees New Life That Could Send ADA Price Soaring, Here Are The Targets The price spike isn&#8217;t particularly surprising, as fundamentals of the Chainlink ecosystem point to a steady price growth for LINK. Chainlink&#8217;s role in DeFi and NFTs with its smart contracts oracles cannot be overstated. Chainlink also recently released its Staking v0.2 protocol in December, allowing investors to stake a minimum of 1 LINK for a base floor reward rate of 4.5% per year in LINK. Consequently, the massive accumulation of LINK by whales is a very bullish signal for the token&#8217;s price action going forward. These large investors see LINK&#8217;s long-term value and potential and are loading up their bags in anticipation of higher prices. LINK price trading high at $18.7 &#124; Source: LINKUSD on Tradingview.com Featured image from CoinMarketCap, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-08T15:26:57.000Z",
    "title": "What Will It Take to Make Crypto A Viable Medium of Payment?",
    "url": "https://www.crypto-news-flash.com/what-will-it-take-to-make-crypto-a-viable-medium-of-payment/?utm_source=rss&utm_medium=rss&utm_campaign=what-will-it-take-to-make-crypto-a-viable-medium-of-payment",
    "description": "<img width=\"1200\" height=\"850\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/7a2f226f-3932-4a0d-bace-3762f294ef48.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/7a2f226f-3932-4a0d-bace-3762f294ef48.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/7a2f226f-3932-4a0d-bace-3762f294ef48-300x213.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/7a2f226f-3932-4a0d-bace-3762f294ef48-768x544.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/7a2f226f-3932-4a0d-bace-3762f294ef48-150x106.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/7a2f226f-3932-4a0d-bace-3762f294ef48-450x319.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Despite originally being conceived as a new form of payment, crypto has mostly failed to take off as such, instead proving more attractive as an investment asset. However, thanks to developments in the markets and underlying technology driven by regulated payment platforms like Blocktrade, the original utility of Bitcoin and other cryptocurrencies is now seeing [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-08T15:25:17.000Z",
    "title": "Bitget Wallet Announces Integration of ARC-20 Inscription and Lightning Network",
    "url": "https://www.crypto-news-flash.com/bitget-wallet-announces-integration-of-arc-20-inscription-and-lightning-network/?utm_source=rss&utm_medium=rss&utm_campaign=bitget-wallet-announces-integration-of-arc-20-inscription-and-lightning-network",
    "description": "<img width=\"512\" height=\"407\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-67.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-67.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-67-300x238.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-67-150x119.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-67-450x358.png 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Bitget Wallet, a widely used Web3 trading wallet, has introduced significant updates to its platform, aiming to enhance support for the Bitcoin ecosystem. The latest version of Bitget Wallet now includes ARC-20 inscriptions and integrates the Lightning Network, marking notable advancements in cryptocurrency accessibility and functionality. Empowering Mobile Users with ARC-20 Inscription Bitget Wallet&#8217;s latest [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-08T15:00:00.000Z",
    "title": "Dtravel Receives Backing from Borderless Capital to Support DePIN Vacation Rental Ecosystem",
    "url": "https://coinedition.com/dtravel-receives-backing-from-borderless-capital-to-support-depin-vacation-rental-ecosystem/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/02/Dtravel.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/02/Dtravel.jpg 730w, https://coinedition.com/wp-content/uploads/2024/02/Dtravel-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/02/Dtravel-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/02/Dtravel-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/02/Dtravel-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/02/Dtravel-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/02/Dtravel-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/02/Dtravel-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/02/Dtravel-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/02/Dtravel-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/02/Dtravel-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/02/Dtravel-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/02/Dtravel-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/02/Dtravel-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/02/Dtravel-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/02/Dtravel-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Borderless Capital has given Dtravel their stamp of approval with a token investment into TRVL. The partnership not only brings investment, but opens up a wealth of expertise and networking opportunities that will support Dtravel in becoming a leading provider for the vacation rental industry.&#160; Launched in 2021, Dtravel is a peer-to-peer vacation rental ecosystem [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/dtravel-receives-backing-from-borderless-capital-to-support-depin-vacation-rental-ecosystem/\">Dtravel Receives Backing from Borderless Capital to Support DePIN Vacation Rental Ecosystem</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-08T14:45:00.000Z",
    "title": "Shiba Inu: CoinGecko Now Tracks Top 24 Assets on Shibarium",
    "url": "https://coinedition.com/shiba-inu-coingecko-now-tracks-top-24-assets-on-shibarium/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba Inu: CoinGecko Now Tracks Top 24 Assets on Shibarium\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Shiba_Inu_officially_launches_Shibarium_decentralized_blockchain-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>CoinGecko, a leading crypto market tracker, has broadened its scope to encompass assets within Shibarium, the blockchain network linked to the Shiba Inu ecosystem. Specifically, CoinGecko now features a page dedicated to monitoring cryptocurrencies on the Shibarium network.  The page is titled “Top Shibarium Ecosystem Coins by Market Cap” and captures records for 24 digital [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/shiba-inu-coingecko-now-tracks-top-24-assets-on-shibarium/\">Shiba Inu: CoinGecko Now Tracks Top 24 Assets on Shibarium</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-08T15:30:04.000Z",
    "title": "Trader Updates Outlook on Altcoin That’s Exploded 900% in Less Than Four Months, Issues Warning on Solana",
    "url": "https://dailyhodl.com/2024/02/08/trader-updates-outlook-on-altcoin-thats-exploded-900-in-less-than-four-months-issues-warning-on-solana/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/Exploded-Over-900.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/Exploded-Over-900.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2024/02/Exploded-Over-900.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/Exploded-Over-900.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/Exploded-Over-900.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/Exploded-Over-900.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/02/Exploded-Over-900.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist believes that one artificial intelligence (AI) related altcoin project could still move higher even after already seeing heavy gains. Pseudonymous analyst Altcoin Sherpa tells his 206,900 followers on the social media platform X that Bittensor (TAO), a decentralized blockchain platform that focuses on machine learning and AI, could soar more [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/08/trader-updates-outlook-on-altcoin-thats-exploded-900-in-less-than-four-months-issues-warning-on-solana/\">Trader Updates Outlook on Altcoin That’s Exploded 900% in Less Than Four Months, Issues Warning on Solana</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]