[
  {
    "source": "Crypto Briefing",
    "date": "2024-01-15T23:00:40.000Z",
    "title": "14,039 tokens listed on CoinGecko since 2014 are now ‘dead’: Report",
    "url": "https://cryptobriefing.com/14039-tokens-listed-coingecko-now-dead-report/?utm_source=feed&utm_medium=rss",
    "description": "This represents 50% of all the crypto assets listed on the platform, with most of the failed projects being listed during bull runs."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-15T22:41:42.000Z",
    "title": "USDT usage for money laundering surges in East and Southeast Asia: UN report",
    "url": "https://cryptobriefing.com/usdt-usage-money-laundering-surges-east-southeast-asia-un-report/?utm_source=feed&utm_medium=rss",
    "description": "The United Nations Office on Drugs and Crime published a report highlighting the role of casinos, junkets, and crypto in money laundering"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-15T23:03:00.000Z",
    "title": "Long-Dormant Ethereum Whale Resurfaces After Its ETH Holdings Appreciated More than 200,000%",
    "url": "https://www.cryptoglobe.com/latest/2024/01/long-dormant-ethereum-whale-resurfaces-after-its-eth-holdings-appreciated-more-than-200000/",
    "description": "An Ethereum whale that had been dormant for eight and a half years has recently resurfaced and moved 200 ETH from its wallet, worth around $500,000, after seeing the value of its tokens appreciated by between 200,000% and 600,000%. According to available market data, when the whale first received its funds eight and a half […]\n"
  },
  {
    "source": "NullTX",
    "date": "2024-01-15T23:00:56.000Z",
    "title": "XAI Token Surges 42% After Successful $70 Million Airdrop In GameFi Space",
    "url": "https://nulltx.com/xai-token-surges-42-after-successful-70-million-airdrop-in-gamefi-space/",
    "description": "$XAI, a pioneering Layer 3 blockchain designed specifically for gaming utilizing $ARB technology, has swiftly rebounded with a robust 42% surge, establishing itself as a standout performer in the burgeoning GameFi sector.  The digital asset recently achieved a new all-time high (ATH) after experiencing a dip post-airdrop on January 9, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-15T23:00:53.000Z",
    "title": "Whales Accumulating Maker And Aave, Path To 2024 Highs?",
    "url": "https://www.newsbtc.com/news/defi/whales-accumulating-maker-and-aave-path-to-2024-highs/",
    "description": "On-chain data suggests that whales are accumulating large amounts of Maker (MKR) and Aave (AAVE), two leading decentralized finance (DeFi) tokens. This accumulation trend coincides with a broader cooling-off period in the crypto scene days after the United States Securities and Exchange Commission (SEC) approved 11 spot Bitcoin ETFs.  Whales Accumulate MKR And AAVE According to ScopeScan data, Anchorage Digital, a digital asset custody firm, purchased a significant amount of MKR on January 15. The firm acquired 12,103 MKR tokens, valued at approximately $24.7 million, from Coinbase, a leading crypto exchange in the United States.  Related Reading: Ethereum Bloodbath Incoming? Celsius’ $125 Million Move Threatens ETH Price Two whales, &#8220;0xbb5f&#8221; and &#8220;0x4a7,&#8221; also accumulated large quantities of MKR and AAVE. Specifically, &#8220;0xbb5f&#8221; bought 50,000 AAVE and 2,452 MKR worth around $5.03 million and $4.95 million from Binance, a leading cryptocurrency exchange. Meanwhile, 0x4a7 purchased 39,000 AAVE and 2,350 MKR, valued at approximately $3.95 million and $4.75 million, also from Binance. These whale purchases signal a strong belief in the long-term potential of MKR and AAVE. Maker and Aave are two of the world&#8217;s leading decentralized lending and borrowing protocols across DeFi. MKR serves as the governance token for MakerDAO, which also manages the DAI decentralized stablecoin. On the other hand, AAVE is the governance token of Aave, a top decentralized lending platform.  According to the latest DeFiLlama data, Maker and Aave have total value locked (TVL) of over $8.4 billion and $7.3 billion, respectively. Notably, whales are accumulating MKR and AAVE when the DeFi scene is recovering following the sharp contraction from 2022. The industry manages over $56 billion, with Ethereum hosting more liquid DeFi protocols, including Lido DAO when writing in mid-January 2024.  Will Maker and Aave Rally To New 2024 Highs On Recovering DeFi? Last year, MKR and AAVE were among the top-performing DeFi tokens, with MKR rising by over 200% and AAVE appreciating by more than 150%. Protocol-specific fundamentals, including the launch of Spark in Maker, partly drove this strong performance. Related Reading: How Low Can Bitcoin Go? CryptoQuant Head Reveals Target Aave launched the GHO stablecoin and the Lens protocol on the Ethereum sidechain, Polygon. Moreover, expectations of the spot Bitcoin ETF forced aggressive traders to consider top DeFi protocols, lifting altcoins. As whales accumulate, there is more headroom for these tokens to grow. Presently, AAVE and MKR are lower, based on their respective performance in the daily chart. However, overly, the uptrend remains. To illustrate, MKR is within a bullish breakout formation with a critical support level of around $1,560. Any surge past $2,300 might ignite demand, lifting the token to new 2024 highs. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-15T23:01:23.000Z",
    "title": "Nearly $15,000,000,000 in XRP Appears To Move in Attempted Attack on Bitfinex",
    "url": "https://dailyhodl.com/2024/01/15/nearly-15000000000-in-xrp-appears-to-move-in-attempted-attack-on-bitfinex/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/flr-launch-airdrop-xrp.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/flr-launch-airdrop-xrp.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/flr-launch-airdrop-xrp.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/flr-launch-airdrop-xrp.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/flr-launch-airdrop-xrp.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/flr-launch-airdrop-xrp.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/flr-launch-airdrop-xrp.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>What appeared to be a large transfer of XRP was later tied to a bad actor attempting to hack into crypto exchange Bitfinex. According to Bifinex CTO and Tether CEO Paolo Ardoino, an unknown entity attempted to use the XRP Ledger&#8217;s &#8220;partial payment&#8221; feature, which allows users to send less than the specified amount in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/15/nearly-15000000000-in-xrp-appears-to-move-in-attempted-attack-on-bitfinex/\">Nearly $15,000,000,000 in XRP Appears To Move in Attempted Attack on Bitfinex</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]