[
  {
    "source": "Crypto Daily",
    "date": "2023-06-29T17:05:39.000Z",
    "title": "UK passes bill recognising bitcoin and crypto as regulated activity",
    "url": "https://cryptodaily.co.uk/2023/06/uk-passes-bill-recognising-bitcoin-and-crypto-as-regulated-activity",
    "description": "<p>The House of Lords passed the Financial Services and Markets Bill today, which aims to regulate bitcoin and crypto in the UK.</p>\nRocket boost for the economy\n<p>The upper house of the British government, the House of Lords, has voted to pass into law the Financial Services and Markets Bill that will see the UK embark on a path of acceptance of cryptocurrencies as &ldquo;regulated activity&rdquo;.</p>\n<p>Such a bold move from the UK really puts it on the map as regards its announcement last year which stated that it wished to be a global hub for crypto, and flies completely contrary to the anti-crypto environment that permeates the Biden administration in the US.</p>\n<p>Hailed as a &ldquo;Rocket Boost for [the] UK economy&rdquo; on the UK Gov website, the bill aims to make a &ldquo;technologically advanced financial services sector&rdquo; that is &ldquo;open&rdquo;, and which will &ldquo;grow the economy&rdquo;.</p>\n<p>As well as moving away from the US rejection of the crypto industry, the UK will repeal all the old laws that were passed in Brussels when it was a member of the EU. The UK Gov statement on its website affirmed:</p>\n\n<p>&ldquo;By repealing old EU laws set in Brussels it will unlock billions in investment &ndash; cash that can unlock innovation and grow the economy.&rdquo;</p>\n\n<p>The statement also read that today&rsquo;s act will regulate crypto assets so that they can be safely adopted in the UK.&nbsp;</p>\n<p>Just as first suggested by Hester Peirce, US SEC commissioner and staunch defender of the innovations brought by the crypto sector, the UK will &ldquo;establish Sandboxes&rdquo; where crypto financial technologies can be tested before being released to the market.</p>\nCrypto gold rush begins as US looks on\n<p>As the UK government and regulators start to rewrite the financial rule book in order to grease the rails of innovation with full transparency and oversight of its regulators, this move has the potential to set a crypto gold rush in motion.</p>\n<p>The European Union has its MiCA regulations coming into force in 2024, Hong Kong, with Chinese backing, is opening itself up as a potential go-to crypto hub in Asia, and other jurisdictions such as Singapore and Dubai are also competing for a share of the crypto industry.</p>\n<p>Back over the pond in the US things are starting to look more and more gloomy as the SEC with full backing from the government drives the most innovative industry since the Internet away from its shores and into the welcome embrace of the aforementioned countries. The crypto industry will go where it is most welcome - and this certainly is not in the United States of today.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T17:07:23.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T17:02:45.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-29T16:57:04.000Z",
    "title": "King Charles approves UK legislation for crypto oversight",
    "url": "https://crypto.news/king-charles-approves-uk-legislation-for-crypto-oversight/",
    "description": "King Charles has given his official sanction to the UK's Financial Services and Markets Bill, setting the stage for increased supervision of cryptocurrencies and stablecoins."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-29T17:00:09.000Z",
    "title": "Slovakian Lawmakers Pass Amendment Lowering Cryptocurrency Taxation",
    "url": "https://www.newsbtc.com/crypto/slovakian-pass-lowering-crypto-taxation/",
    "description": "Lawmakers in Slovakia have approved new legislation, with a resounding 112-2 vote in favor, aimed at reducing taxes associated with the sale of crypto or digital assets. In addition to the aforementioned tax-cutting law, members of the National Council of the Slovak Republic, the country&#8217;s parliament, have further endorsed additional measures that impact cryptocurrency holders. The National Council of the Slovak Republic passed the amendment that will result in a reduction of personal income tax on profits derived from the sale of cryptocurrencies. This tax reduction specifically applies to individuals who have held the cryptocurrencies for a minimum period of one year. The recent vote marked the third reading of the bill in the National Council. According to reports, the Ministry of Finance in Slovakia has projected that the amendment, once implemented, will have a financial impact of approximately 30 million euros per year. Related Reading: Solana Faces Resistance Yet Traders May Find Buying Opportunities Here In a significant development, the Slovakian parliament recently passed another amendment to the constitution. This amendment specifically codifies the right of citizens to utilize cash as a recognized payment method. This action comes in response to discussions surrounding the potential introduction of a digital euro. The government aims to ensure that citizens retain the freedom to choose their preferred form of payment. Citizens will be able to choose cash payment after it has been implemented within the constitution. Drastic Reduction In Crypto Tax Rates Under the new legislation, the tax rate on profits gained from the sale of cryptocurrencies will be reduced to 7%. This marks a significant decrease compared to the current sliding scale tax rates of 19% or 25%. Moreover, the bill includes a provision that exempts payments received in cryptocurrencies up to 2,400 euros ($2,600) from taxation. Furthermore, the bill also addresses the issue of health insurance contributions. It specifically excludes income derived from cryptocurrencies from being subject to a health insurance contribution of 14%. As a member state of the European Union, Slovakia, like other EU countries, has the freedom to establish its own tax regulations and policies concerning cryptocurrencies. Related Reading: Analyst’s Forecast: Bitcoin (BTC) To Hit $310,000 If This Happens This autonomy allows Slovakia to create tax rules. And it can formulate rules that are conducive to promoting the popularity and adoption of cryptocurrencies within its jurisdiction. Slovakia is among the 27 member states that demonstrate a proactive approach to monitoring the advancements within the cryptocurrency industry across the region. EU Takes Initiative In Forming Guidelines The European Union (EU) recently enacted the Markets in Crypto-Assets (MiCA) regulations into law. This landmark set of regulations aims to establish Europe as a prominent hub for digital asset activities. In contrast to the European Union&#8217;s proactive approach, other major markets like the United States have not yet implemented comprehensive guidelines for the cryptocurrency industry. Related Reading: FTX Puts Sale Of $500 Million Stake In AI Firm Anthropic On Hold While the US remains an important player in the crypto space, there is an ongoing discussion of potential regulations. However, United States Republican lawmakers have proposed the Digital Asset Market Structure bill, which is under review. Featured image from UnSplash, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-29T16:54:15.000Z",
    "title": "Monero Makes a Move: XMR Price Rises Over 3% in 24 Hours, Showing Promising Momentum",
    "url": "https://www.crypto-news-flash.com/monero-makes-a-move-xmr-price-rises-over-3-in-24-hours-showing-promising-momentum/?utm_source=rss&utm_medium=rss&utm_campaign=monero-makes-a-move-xmr-price-rises-over-3-in-24-hours-showing-promising-momentum",
    "description": "Monero&#8217;s XMR has gained around 3 percent in the last 24 hours, signaling larger gains in the short term. The current market sentiment is bullish and technical indicators signal a long-term bullish outlook. Monero has in the last 24 hours gained around 3 percent to trade at $168. Its gains come amidst a wider bullish [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-29T16:55:12.000Z",
    "title": "Demand for One Crypto Asset Tripled in Russia During Short-Lived Wagner Revolt – But It’s Not Bitcoin: Report",
    "url": "https://dailyhodl.com/2023/06/29/demand-for-one-crypto-asset-tripled-in-russia-during-short-lived-wagner-revolt-but-its-not-bitcoin-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/demand-for-one-asset.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/demand-for-one-asset.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/demand-for-one-asset.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/demand-for-one-asset.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/demand-for-one-asset.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/demand-for-one-asset.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/demand-for-one-asset.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Russians reportedly exchanged their rubles for crypto during the short-lived uprising of the Wagner Group and its leader, Yevgeny Prigozhin. While Bitcoin (BTC) is touted as a digital gold for storing cash during war or disaster, Bloomberg reports that the revolt by the mercenary fighters of the Wagner group against the government of Russia sparked [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/29/demand-for-one-crypto-asset-tripled-in-russia-during-short-lived-wagner-revolt-but-its-not-bitcoin-report/\">Demand for One Crypto Asset Tripled in Russia During Short-Lived Wagner Revolt – But It’s Not Bitcoin: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]