[
  {
    "source": "NullTX",
    "date": "2023-08-09T06:17:02.000Z",
    "title": "Top 3 Tokens To Watch As Bitcoin Charges Above $30K: $TON, $SOL & $HBAR",
    "url": "https://nulltx.com/top-3-tokens-to-watch-as-bitcoin-charges-above-30k-ton-sol-hbar/",
    "description": "As Bitcoin regains momentum and surpasses the $30,000 mark, the entire cryptocurrency market is experiencing a renewed sense of confidence. This resurgence in Bitcoin&#8217;s value has brought about a ripple effect in the altcoin space, with several coins showing signs of life. Among the top three coins to watch as Bitcoin leads into a potential [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-09T06:33:23.000Z",
    "title": "Solana and Cardano navigate through market turbulence, Borroe registers growth",
    "url": "https://crypto.news/solana-and-cardano-navigate-through-market-turbulence-borroe-registers-growth/",
    "description": "As Solana (SOL) and Cardano (ADA) struggle to gain momentum, stage 1 of the Borroe presale is ongoing after completing its beta phase"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-09T06:22:30.000Z",
    "title": "Binance gets fully licensed in El Salvador",
    "url": "https://crypto.news/binance-gets-fully-licensed-in-el-salvador/",
    "description": "Binance won two service provider licenses in El Salvador, as its regulatory issues in the United States and Europe still remain. El Salvador&#8217;s Central Reserve Bank granted Binance&#8217;s Bitcoin services provider license application. At the same time, concurrently, the National&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-09T06:11:26.000Z",
    "title": "Tesla and other top companies capitalize on bitcoin portfolio",
    "url": "https://crypto.news/tesla-and-other-top-companies-capitalize-on-bitcoin-portfolio/",
    "description": "Top publicly traded firms reveal their Bitcoin (BTC) portfolios. MicroStrategy leads the list, showcasing the fusion of traditional finance and digital assets. Crypto analytics website CoinGecko has analyzed the top 10 publicly traded companies with the largest Bitcoin portfolios. The&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-09T06:15:21.000Z",
    "title": "Why Is Bitcoin And Crypto Surging Today?",
    "url": "https://www.newsbtc.com/news/why-is-bitcoin-and-crypto-surging-today/",
    "description": "In the last 24 hours, Bitcoin has experienced a 2% surge, pulling the broader crypto market along with it into a bullish trajectory. Leading the charge among altcoins are PEPE with an 8% gain, followed closely by SHIB and HBAR both at 6.3%, TON at 5.6%, SNX at 5.4%, and SOL at 5.3%. The overall crypto market capitalization has swelled to $1.18 trillion(+1.63%), while Bitcoin&#8217;s dominance in the market has edged up to 50.63%. Why Is Bitcoin And Crypto Up Today? The market&#8217;s euphoria was initially triggered by a news piece which was shared by Bloomberg&#8217;s Eric Balchunas. He conveyed that insider sources from BlackRock and Invesco suggest that the approval of a Bitcoin ETF is more a question of &#8216;when&#8217; rather than &#8216;if&#8217;, likely materializing within the next four to six months. The source for this information was Galaxy Digital CEO Mike Novogratz who made these revelations during a recent earnings call. This news, hinting at the imminent approval of a Bitcoin ETF, sent ripples across the Bitcoin and crypto community, igniting optimism and speculation. Following the news, whale activity has also been a notable driver behind the surge. Related Reading: Record-Breaking $10 Billion Open Interest Fuels Bullish Speculation For Bitcoin Reversal Ki Young Ju, CEO of CryptoQuant, tweeted: &#8220;Bitcoin whales opened giga long positions at $29k.&#8221; He also shared screenshots of the taker buy sell ratio on BitMEX, ByBit, Deribit and Huobi Global. Each chart shows an extremely high and sudden jump in buying volume, presumably from whales, as Ju said. Ali Martinez, a renowned analyst, chimed in on the significance of open interest. He pointed out that the Open Interest, which represents the total number of open long and short positions across all crypto derivative exchanges, has reached a remarkable year-to-date peak of $10.086 billion. This metric is particularly noteworthy given its historically strong correlation with Bitcoin&#8217;s price. The recent dip in Bitcoin to $28,700 seems to have presented an opportune moment for traders to adopt a bullish stance, suggesting that Bitcoin&#8217;s price might be poised for an upward trajectory Related Reading: ARK Invest’s CEO Says SEC Could Approve Multiple Spot Bitcoin ETFs Simultaneously Julio Moreno, from CryptoQuant, noted a sharp rise in Coinbase&#8217;s premium, indicating strengthening Bitcoin demand in the US. This observation aligns with the narrowing discount of GBTC, which many see as a proxy of Grayscale&#8217;s potential success against the US Securities and Exchange Commission (SEC) in its lawsuit for a spot ETF, but also as an indicator of the likelihood of a Bitcoin Spot ETF being approved. The GBTC discount fell to -27% yesterday. From a technical market perspective, the euphoria in the market has led to a short squeeze. A total of $37.19 million was liquidated in BTC shorts yesterday, $65.46 million in the overall crypto market. The short liquidations for Bitcoin were the highest since July 13 when the price rose to its yearly high at $31,820. Nevertheless, it is worth noting that while short-sellers were gradually liquidated while there was a premium on spot markets and funding rates on futures markets were falling. This means that the rise move was primarily driven via the spot markets rather than over-leveraged long positions. Remarkably, whales played a key role. At press time, the Bitcoin price faced critical resistance between $29,900 and $30,000. Featured image from iStock, chart from TradigView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-09T06:13:57.000Z",
    "title": "Speculation of TRON’s  Justin Sun Intervention After Huobi Receives $200M USDT, $9M ETH From Whale – Crypto Exchange Responds",
    "url": "https://www.crypto-news-flash.com/speculation-of-trons-justin-sun-intervention-after-huobi-receives-200m-usdt-9m-eth-from-whale-crypto-exchange-responds/?utm_source=rss&utm_medium=rss&utm_campaign=speculation-of-trons-justin-sun-intervention-after-huobi-receives-200m-usdt-9m-eth-from-whale-crypto-exchange-responds",
    "description": "<img width=\"1200\" height=\"628\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Justin Sun countered that Ethereum Layer 2 projects (ARB and OP) and TRON (TRX) assets evaded the DeFi contagion.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun-300x157.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun-1024x536.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun-768x402.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun-351x185.jpg 351w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun-24x13.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun-36x19.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun-48x25.jpg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Huobi has been tagged as insolvent, a claim it has continued to deny. There has been a discrepancy observed in its USDT holdings according to on-chain sleuth. On-chain data has shown that a whale pumped massive funds into cryptocurrency exchange Huobi and this boosted the exchange’s holding of Tether (USDT) and Ethereum (ETH). The funds [...]"
  }
]