[
  {
    "source": "CoinDesk",
    "date": "2023-05-26T08:25:18.000Z",
    "title": "Ether Balance on Exchanges Nears All-Time Low",
    "url": "https://www.coindesk.com/markets/2023/05/26/ether-balance-on-exchanges-nears-all-time-low/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Drop comes as the number of staked ether has surged."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-26T08:18:24.000Z",
    "title": "US Congressmen urge SEC to keep definition of ‘qualified custodian’ unchanged",
    "url": "https://cryptoslate.com/us-congressmen-urge-sec-to-keep-definition-of-qualified-custodian-unchanged/",
    "description": "<p>Congressmen Michael Flood and Ritchie Torres wrote to SEC Chair Gary Gensler, urging him to keep custody rules unchanged. In February, the U.S. Securities and Exchange Commission (SEC) proposed specific changes to the Investment Advisors Act 1940. Currently, the definition of &#8220;qualified custodians&#8221; includes state-chartered banks, state-regulated trust companies, and Federally regulated banks and savings [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/us-congressmen-urge-sec-to-keep-definition-of-qualified-custodian-unchanged/\">US Congressmen urge SEC to keep definition of ‘qualified custodian’ unchanged</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-05-26T08:12:06.000Z",
    "title": "Michael Saylor Thinks Bitcoin Is ‘Politically Correct.’ Is He Right?",
    "url": "https://www.cryptoglobe.com/latest/2023/05/michael-saylor-thinks-bitcoin-is-politically-correct-is-he-right/",
    "description": "In a recent tweet, Michael Saylor, the Co-Founder and Executive Chairman of MicroStrategy, boldly stated, “Bitcoin is Politically Correct.” This tweet has sparked curiosity and debate as it raises questions about the relationship between Bitcoin and politics. Let’s delve deeper into Saylor’s tweet and explore its possible implications. To grasp the meaning behind Saylor’s tweet, […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T08:25:52.000Z",
    "title": "AI Project TradeGDT soars in popularity, hits 10% of Bybit Derivatives Trading Volume in 4 Hours",
    "url": "https://cryptodaily.co.uk/2023/05/ai-project-tradegdt-soars-in-popularity-hits-10-of-bybit-derivatives-trading-volume-in-4-hours",
    "description": "<p>Singapore, Singapore, May 23rd, 2023, Chainwire</p><p>Generative AI can create new content, such as images, videos, and text. With the help of deep learning algorithms like GANs (Generative Adversarial Networks), researchers are developing AI models that can generate realistic and original content. ChatGPT (Generative Pre-train Transformer) has elevated the AI trend and broadened the vision of people toward AI, the conversation with ChatGPT is as human-like as it can be.</p><p>Trading has been one of the centerpieces of the financial markets and the broader economy. Trading helps to establish the market price of an asset, security and crypto itself. Trading also creates liquidity in the market by providing a mechanism for investors to buy and sell assets quickly and easily. Therefore the demand for AI in trading has never been higher, in crypto trading where everything happens at such a lightning pace, human productivity has been the limiting factor where evidence of increasing reliance on bot has been high. The revolution will be the implementation of AI that can be a better human with less emotion and productivity of a bot.</p><p>TradeGDT (Trading Generative Data Transformer) is an upgraded version of a big data quantitative trading bot combined with AI. By combining the ChatGPT plug-in, it can communicate with users more intelligently and flexibly. Users can communicate with TradeGDT to execute orders, and even prompt users to be alert to the pairing dynamics Information, and through AI pattern learning, TradeGDT can analyze and study user data, dynamic trade model, identify the profit model belonging to the trader, and then formulate a set of trading models for automation execution, while becoming the trader's AI smart trading assistant a better version of the trader itself.</p><p>TraderDAO team has been engaging in implementing AI in crypto trading since the start of 2022. TradeGDT has been proposed to cater for the demand of the crypto trading market. The TraderDAO team has been expanding and since gaining its team component that greatly accelerated the development of TradeGDT. With a very clear goal and commitment, TraderDAO has launched the MVP (Minimal Viable Product) to the market with close partnership to Bybit, and has hit the market with a bang which hits more than 10% ($330mil) Bybit 24 hour Trading Volume in 4 hours of their launch.</p><p></p><p>The trading volume was inspired by $POT, a trading fee sharing token in TraderDAO which acts as the AI data training incentive. Traders just need to perform trading to mint $POT and enjoy the fee sharing premium of the entire platform. The minting of each $POT requires a corresponding fee coming from trading fee rebate. Therefore, $POT is minted with 1:1 real yield asset backed, and the $POT treasury will grow bigger in value as the market continues to add new trades in, where these trades will provide data for AI pattern learning, powering the development of TradeGDT.</p><p>$POT is the utility token that incentivises AI training where the $HOT token is the governance token of TraderDAO. $HOT is deeply rooted in the heart of TradeGDT utility, the fuel that is burned off to use or operate all the coming functions and features of TradeGDT AI. TradeGDT will be traders' smart trading assistance that revolutionize trading by improved decision making, increased efficiency, reduced risk, improved portfolio management, faster and more accurate trade execution. All the benefits with $HOT as the gas fee, fueling the path to trading revolution.</p><p>As the AI trend continues to make waves around all spaces, ChatGPT is moving in the forefront of the AI movement. TraderDAO AI TradeGDT could be the beginning of the AIFI (AI Finance) trend, with the past hype brough fort by DeFI and GameFI, AIFI has a far more bigger future with limitless potential, trading is the center to all crypto token value and&nbsp;with the combination of Trading and AI, TradeGDT could be the champion of the AIFI era.</p><p>About TradeGPT</p><p>TradeGDT is a groundbreaking AI project that is transforming the trading landscape. Our team comprises skilled engineers from renowned institutions like Cambridge and TsingHua, with over 5 years of experience in quant trading. With a diverse management team representing talents from Singapore, Malaysia, Taiwan, Hong Kong, and the UK, we foster innovation on a global scale.</p><p>At TradeGDT, we offer an advanced incubation platform designed to help traders develop their AI Trading Brain, providing valuable assistance in trading or allowing others to follow their successful strategies. By seamlessly integrating sophisticated Hidden Markov Models with user-fed trading data, TradeGDT evolves and adapts to each trader's unique trading patterns, precisely identifying the best entry opportunities for them.</p><p>The heart of our ecosystem lies in TraderDAO, a decentralized autonomous organization that continually provides invaluable trading data to TradeGDT. With the input from a community of over 10,000 active traders, our platform generates a more powerful AI Trading Brain, enabling traders to achieve superior results.</p>ContactMaverickTraderDAOcore@traderdao.ai@mave121"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T08:20:17.000Z",
    "title": "Ordinal Pepe (OPEPE) Is Listed for Trading on LBank Exchange",
    "url": "https://cryptodaily.co.uk/2023/05/ordinal-pepe-opepe-is-listed-for-trading-on-lbank-exchange",
    "description": "<p>Road Town, BVI,, May 26th, 2023, Chainwire</p><p>LBank Exchange, the global digital asset trading platform, has listed Ordinal Pepe (OPEPE). The OPEPE/USDT trading pair went live on LBank on May 26. Ordinal Pepe (OPEPE) is the first Pepe token to be issued on the Bitcoin blockchain. This dynamic fusion combines the famous Pepe frog meme with the unrivaled security of Bitcoin.</p><p>Pepe and Ordinals are already making waves in their respective domains. In 2023, PEPE rose to become the most popular memecoin on Ethereum while the demand for collecting rare sats on Bitcoin has demonstrated a new use case through Ordinals. Uniting these two thriving phenomena into a single memecoin on Bitcoin was the logical evolution of things.</p><p>Influenced by the triumph of Pepe and riding on the current enthusiasm surrounding meme tokens, OPEPE has a unique and community-centric approach in place. Offering no tax on buy or sell transactions, complete liquidity lock, and an abundant supply of 1 quadrillion tokens, OPEPE aspires to be the most desirable memecoin on the market.</p><p>OPEPE, powered by its community, seeks to replicate the joy and rewards that Pepe brought to its fans. The vision for OPEPE is to dominate the meme space and achieve deep liquidity through becoming available on leading exchanges. Backed by an innovative strategy and a tight-knit community, the Ordinals Pepe team firmly believe they can realize this ambition.</p><p>About OPEPE Token</p><p>Based on the ERC-20 token standard, OPEPE is a Bitcoin-based memecoin with a total supply of 1 quadrillion (1,000,000,000,000,000). The token was listed on LBank Exchange at 10:00 UTC on May 26, 2023. It aims to become the preeminent memecoin, combining the humor and memetic power of Pepe the frog with the security and reliability of Bitcoin.</p><p>Official Website | Telegram | Twitter | Contract</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users' funds and aims to contribute to the global adoption of cryptocurrencies.</p><p>Start Trading Now: lbank.com</p><p>Community &amp; Social Media:&nbsp;</p><p>Telegram l Twitter l Facebook l LinkedIn l Instagram l YouTube</p>ContactLBK Blockchain Co. Limitedmarketing@lbank.info"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T08:28:32.000Z",
    "title": "Avalanche price analysis: AVAX price reverses to $14, hitting a four-month low",
    "url": "https://www.cryptopolitan.com/avalanche-price-analysis-2023-05-26/",
    "description": "The latest Avalanche price analysis reveals bearish results for the day, with the price suffering yet another loss. Continuing the downtrend that initiated on May 24, 2023, the price has now decreased by $14. The short-term trend line slopes downwards, indicating the prevailing influence of bears. As the price continues its downward trajectory, it has ... <a title=\"Avalanche price analysis: AVAX price reverses to $14, hitting a four-month low\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-analysis-2023-05-26/\" aria-label=\"More on Avalanche price analysis: AVAX price reverses to $14, hitting a four-month low\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T08:11:49.000Z",
    "title": "New York Banking Commission votes to halt deposits at Capital One and Keybank",
    "url": "https://www.cryptopolitan.com/new-york-banking-commission-votes-to-halt-deposits-at-capital-one-and-keybank/",
    "description": "The New York City Banking Commission has frozen deposits into Capital One and KeyBank, two of the city&#8217;s prominent financial institutions. However, the historic decision, sparked by the banks&#8217; failure to submit plans detailing their efforts to combat discrimination, signifies the city&#8217;s commitment to demanding transparency and fairness in the financial sector. Championing equity in ... <a title=\"New York Banking Commission votes to halt deposits at Capital One and Keybank\" class=\"read-more\" href=\"https://www.cryptopolitan.com/new-york-banking-commission-votes-to-halt-deposits-at-capital-one-and-keybank/\" aria-label=\"More on New York Banking Commission votes to halt deposits at Capital One and Keybank\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-26T08:28:26.000Z",
    "title": "Crypto fintech Unbanked shuts down amid US regulatory hurdle",
    "url": "https://crypto.news/crypto-fintech-unbanked-shuts-down-amid-us-regulatory-hurdle/",
    "description": "Unbanked, a crypto fintech firm specializing in crypto custody and payments services, has made the difficult decision to close its operations, citing a harsh regulatory environment for cryptocurrencies in the United States."
  },
  {
    "source": "BTCManager",
    "date": "2023-05-26T08:24:31.000Z",
    "title": "DeFi protocol SeaSwapSui steals $32k from investors ",
    "url": "https://crypto.news/defi-protocol-seaswapsui-steals-32k-from-investors/",
    "description": "CeriK Alert has revealed that DeFi platform SeaSwap has rug-pulled its users, stealing about $32,000 worth of SUI tokens. SeaSwap has also abandoned its other social media channels. SeaSwapSui, a decentralized finance protocol on the recently launched Sui network, has&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-26T08:20:18.000Z",
    "title": "Shiba Inu (SHIB) Price Slump Leaves Over 1 Million Wallets In The Red Zone",
    "url": "https://www.newsbtc.com/news/shiba-inu-1-million-wallets-in-red-zone/",
    "description": "Shiba Inu (SHIB) has experienced a significant price drop, causing a considerable number of investors to find themselves in a precarious position.  With the recent downward trend in SHIB&#8217;s value, a staggering 1 million addresses now find themselves in the red zone, facing losses in their investment.  In the context of crypto trading, the term &#8220;red zone&#8221; often refers to a situation where a digital currency is experiencing a significant decline or negative price movement. It is commonly associated with bearish market conditions or a downtrend. Related Reading: Shiba Inu All Green Today – What’s The Energy Behind The Glow? This turn of events has sparked concern and curiosity among cryptocurrency enthusiasts and market observers alike, as they analyze the factors behind the price decline and its implications for the future of Shiba Inu and its large investor base. Break Even Indicator Highlights Shiba Inu Price Drop Impact In the midst of a volatile cryptocurrency market, the price of Shiba Inu (SHIB) on CoinGecko currently sits at a meager $0.00000852. Recent data indicates that SHIB experienced a modest 0.4% rally within the past 24 hours, but endured a gradual 2.0% decline over the span of seven days. Source: Coingecko According to IntoTheBlock the Break Even Price indicator, the price movement has left a significant impact on SHIB investors. Out of the total SHIB addresses analyzed, approximately 1 million addresses, accounting for 79.74%, find themselves in losses.  Source: IntoTheBlock On the other hand, 219,880 addresses (17.51%) have either realized gains or are currently in profit. Additionally, 34,600 addresses (2.76%) are at a break-even point, meaning they are neither in losses nor profits. Related Reading: Should BONE Holders Worry About Shibarium’s Delayed L2 Launch? The Break Even Price indicator is a metric that examines the realized gains and losses of SHIB holders based on on-chain data. It provides a comprehensive overview of the collective gains and losses experienced by those holding the Shiba Inu cryptocurrency.  This data sheds light on the overall financial state of SHIB investors, highlighting the prevailing challenges faced by a significant portion of the community amidst the recent price fluctuations. SHIB market cap currently at $4.8 billion. Chart: TradingView.com Selloff Pressure As Shibarium Launch Timeline Faces Uncertainty Meanwhile, recent data obtained from Etherscan reveals a noteworthy development within the Shiba Inu ecosystem. In a span of just a few hours, a substantial quantity of nearly 280 billion SHIB tokens, worth approximately $2,360,220, has been transferred to a Huobi wallet. This significant influx of tokens suggests a potential intention to sell them, putting additional downward pressure on the SHIB price. UNDERSTAND &#8211; if some testing goes wrong it may take longer &#8211; it&#8217;s being built &#8211; it&#8217;s not made from magic box😜 — 𝐋𝐔𝐂𝐈𝐄 (@LucieSHIB) May 24, 2023 The Shiba Inu team also faces another challenge regarding the launch of their much-anticipated Shibarium.  In a recent tweet, @LucieSHIB, the official content marketing expert representing the Shiba Inu team, provided an update on the anticipated launch of Shibarium, the project&#8217;s Layer 2 network.  Based on information shared by a SHIB developer known as Shibarium1, @LucieSHIB expressed her expectation that Shibarium could potentially be launched later this year, specifically in the third quarter. -Featured image from The Live Nagpur"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T08:26:00.000Z",
    "title": "TMS Network (TMSN) Continues Thrashing, While Dogecoin (DOGE) and Polkadot (DOT) Crawl",
    "url": "https://www.crypto-news-flash.com/tms-network-tmsn-continues-thrashing-while-dogecoin-doge-and-polkadot-dot-crawl/?utm_source=rss&utm_medium=rss&utm_campaign=tms-network-tmsn-continues-thrashing-while-dogecoin-doge-and-polkadot-dot-crawl",
    "description": "<p>Investors always dream of seeing the value of their investments rise by 100, 200, 500% or more, but that kind of thing rarely happens in reality. More often than not, projects rise by small amounts every now and then, crawling slowly upwards, as is the case with Dogecoin (DOGE) and Polkadot (DOT). However, one project [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/tms-network-tmsn-continues-thrashing-while-dogecoin-doge-and-polkadot-dot-crawl/\">TMS Network (TMSN) Continues Thrashing, While Dogecoin (DOGE) and Polkadot (DOT) Crawl</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T08:20:08.000Z",
    "title": "Ordinal Pepe (OPEPE) Is Listed for Trading on LBank Exchange",
    "url": "https://www.crypto-news-flash.com/ordinal-pepe-opepe-is-listed-for-trading-on-lbank-exchange/?utm_source=rss&utm_medium=rss&utm_campaign=ordinal-pepe-opepe-is-listed-for-trading-on-lbank-exchange",
    "description": "<p>Road Town, BVI,, May 26th, 2023, Chainwire LBank Exchange, the global digital asset trading platform, has listed Ordinal Pepe (OPEPE). The OPEPE/USDT trading pair went live on LBank on May 26. Ordinal Pepe (OPEPE) is the first Pepe token to be issued on the Bitcoin blockchain. This dynamic fusion combines the famous Pepe frog meme [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/ordinal-pepe-opepe-is-listed-for-trading-on-lbank-exchange/\">Ordinal Pepe (OPEPE) Is Listed for Trading on LBank Exchange</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-05-26T08:10:54.000Z",
    "title": "Best Decentralized Exchanges on Stacks",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/best-decentralized-exchanges-on-stacks/",
    "description": "<p>You can compare Stacks to any layer 2 chain, but it&#8217;s built on Bitcoin. In contrast to Bitcoin, it can handle smart contracts and Dapps. So, Stacks brings DeFi and NFTs to Bitcoin. According to DeFillama, its TVL is still low at $27.69 million. But each journey starts with the first step. So, let&#8217;s take [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/best-decentralized-exchanges-on-stacks/\">Best Decentralized Exchanges on Stacks</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-26T08:30:00.000Z",
    "title": "Investors May Look To Capitalize on the Current BTC FUD",
    "url": "https://coinedition.com/investors-may-look-to-capitalize-on-the-current-btc-fud/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/We_are_seeing_the_common_paradox_of_traders_buying_short_term_small-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BTC\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/We_are_seeing_the_common_paradox_of_traders_buying_short_term_small-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/We_are_seeing_the_common_paradox_of_traders_buying_short_term_small-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/We_are_seeing_the_common_paradox_of_traders_buying_short_term_small-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/We_are_seeing_the_common_paradox_of_traders_buying_short_term_small-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/We_are_seeing_the_common_paradox_of_traders_buying_short_term_small-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/We_are_seeing_the_common_paradox_of_traders_buying_short_term_small.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Santiment tweeted this morning that traders are experiencing a common paradox where they eagerly purchase small dips in the short-term price changes in BTC but are hesitant to buy into larger dips over a longer period. The post added that periods with this level of FUD have historically presented good opportunities for investors to capitalize [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/investors-may-look-to-capitalize-on-the-current-btc-fud/\">Investors May Look To Capitalize on the Current BTC FUD</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]