[
  {
    "source": "Cointelegraph",
    "date": "2024-03-20T00:00:39.000Z",
    "title": " Saudi Arabia plans $40B AI investment fund overseen by a16z: Report ",
    "url": "https://cointelegraph.com/news/saudi-arabia-40-billion-ai-fund-a16z-partnership-nyt",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMmIwNjMzZTQtM2FjNy00Zjk2LWEwYTMtYjA3YWQyYjBjNjQ0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>If the $40 billion fund goes ahead, it would make Saudi Arabia the largest investor in the AI space. </p>\n                    <p><p>The Saudi Arabian government is reportedly mulling the creation of a $40 billion investment fund to pour money into artificial intelligence, which could take place in the second half of the year.</p><p>Representatives behind Saudi Arabia’s Public Investment Fund are also considering a partnership with Silicon Valley venture capital firm Andreessen Horowitz (a16z) to oversee the AI investments, The New York Times <a href=\"https://www.nytimes.com/2024/03/19/business/saudi-arabia-investment-artificial-intelligence.html\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on March 19 citing three people familiar with the matter.</p><p>Other venture capitalists may also participate in the AI fund and the a16z partnership could see it setting up an office in the country’s capital, Riyadh.</p><p><a href=\"https://cointelegraph.com/news/saudi-arabia-40-billion-ai-fund-a16z-partnership-nyt\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-19T23:52:00.000Z",
    "title": "Japan’s $1.5 Trillion Pension Giant Seeks Information on Bitcoin, Gold for Potential Portfolio Inclusion",
    "url": "https://www.cryptoglobe.com/latest/2024/03/japans-1-5-trillion-pension-giant-seeks-information-on-bitcoin-gold-for-potential-portfolio-inclusion/",
    "description": "Japan’s Government Pension Investment Fund (GPIF), the world’s largest pension fund with $1.5 trillion in assets under management, is exploring the potential inclusion of Bitcoin, gold, and other assets it considers illiquid in its investment portfolio. This development was revealed after the GPIF announced the development of a new long-term investment approach after it historically […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-20T00:00:14.000Z",
    "title": "Get Ready For Liftoff: XRP Set For 20% Surge Against Bitcoin, Predicts Analyst",
    "url": "https://www.newsbtc.com/analysis/xrp/get-ready-for-liftoff-xrp-set-for-20-surge-against-bitcoin-predicts-analyst/",
    "description": "Recently, a renowned figure in the crypto analysis sphere, CrediBULL Crypto, has spotlighted XRP with a bullish prediction. According to the analyst, XRP is on the verge of a significant rally that could surge its value against Bitcoin in the coming period. XRP Price: Anticipating The Surge CrediBULL Crypto has been closely monitoring XRP&#8217;s movements against Bitcoin. Through analysis, he observed an interesting trend within the XRP/BTC trading pair that suggests an upcoming uptick. Related Reading: Crypto Expert Reveals Why XRP Is Primed For Growth In This Bull Market The key to this prediction is identifying an accumulation phase happening at a lower timeframe within a higher demand zone. This pattern is not new to the analyst, who has identified similar trends. The insights provided by CrediBULL Crypto indicate a potential 15-20% rally for XRP against Bitcoin in the near term. Should the altcoin break through the next major resistance, which is pegged 35% higher, the analyst believes this could trigger a surge, rewarding investors with returns exceeding 100% against BTC. Topped up the $XRP position here for the 4th time- USD and BTC pairings are in sync. Within our larger, HTF zone of demand we now have a lower TF accumulation base formed, a confirmed D3 bull div, and if we close here in about 8 hours we will have a double D3 bull div. At the… https://t.co/lgJeQfLXvG pic.twitter.com/YV7aelYtwT — CrediBULL Crypto (@CredibleCrypto) March 18, 2024 A week before this bullish forecast, CrediBULL Crypto had already increased its position on the XRP/BTC pair, driven by an &#8220;RSI divergence&#8221; observed on the 3-day chart. Such divergences are often harbingers of a significant market turnaround, suggesting that the altcoin had entered a pivotal region ripe for a bullish reversal. XRP&#8217;s Foundation For Growth The potential for XRP isn&#8217;t just a matter of speculative trading. Other market experts have highlighted the cryptocurrency&#8217;s fundamentals. Zach Rector, a prominent voice within the crypto community, has also recognized the altcoin&#8217;s potential. By drawing parallels with Bitcoin, Rector points out the foundation of XRP and the XRPL, setting the stage for XRP&#8217;s significant impact in the next market upturn. Related Reading: XRP To Skyrockets To $1.33 Amidst April Rally: Analysts Analyst Dark Defender also sees a bright future for the altcoin, predicting a climb to the $1.33 price level as an immediate target. Moreover, he suggests that reaching the $1.88 and $5.85 Fibonacci targets in the forthcoming weeks is well within the realm of possibility Hi all. #XRP had the break-out yesterday, as we expected. In the Monthly Time Frame, it is obvious the move has #started. The huge Resistance of $0.6649 is broken in the Daily, &#38; #confirmed $0.6649 will be Confirmed for the Weekly &#38; Monthly Frames. Our targets are closer… pic.twitter.com/pgSJmfT0s6 — Dark Defender (@DefendDark) March 12, 2024 Meanwhile, despite facing a downturn with a 13% decline, followed by a further 1% drop in the last 24 hours, the altcoin&#8217;s trading price remains resilient at $0.6. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-20T00:00:05.000Z",
    "title": "Analyst Predicts Over 100% Rally for Ethereum Rival, Calls One Altcoin ‘Super Strong’ Amid Crypto Volatility",
    "url": "https://dailyhodl.com/2024/03/19/analyst-predicts-over-100-rally-for-ethereum-rival-calls-one-altcoin-super-strong-amid-crypto-volatility/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/fresh-leg-calls-one.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/fresh-leg-calls-one.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/fresh-leg-calls-one.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/fresh-leg-calls-one.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/fresh-leg-calls-one.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/fresh-leg-calls-one.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/fresh-leg-calls-one.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist believes one Ethereum (ETH) competitor is primed to print gains of more than 2x this year. Pseudonymous analyst Altcoin Sherpa tells his 211,900 followers on the social media platform X that he thinks Solana (SOL) will see new all-time highs this year. But while the crypto strategist is long-term bullish [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/19/analyst-predicts-over-100-rally-for-ethereum-rival-calls-one-altcoin-super-strong-amid-crypto-volatility/\">Analyst Predicts Over 100% Rally for Ethereum Rival, Calls One Altcoin ‘Super Strong’ Amid Crypto Volatility</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]