[
  {
    "source": "CoinDesk",
    "date": "2023-06-12T13:48:45.000Z",
    "title": "Robinhood’s May Crypto Trading Volume Falls 68% to $2.1B ",
    "url": "https://www.coindesk.com/markets/2023/06/12/robinhoods-crypto-trading-volume-falls-to-21b-in-may-down-68-yoy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The trading platform recently delisted three tokens that were classified as securities in the SEC's lawsuit against Coinbase and Binance."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-12T14:04:03.000Z",
    "title": "BitGo’s Lawsuit Against Galaxy Digital Over $1.2B Merger Dismissed",
    "url": "https://decrypt.co/144210/bitgos-lawsuit-against-galaxy-digital-over-1-2b-merger-dismissed",
    "description": "Galaxy said it was “pleased” at the dismissal of the $100m lawsuit, after the merger between the companies was called off last year. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-12T13:55:31.000Z",
    "title": "Is Ron DeSantis good for crypto? Republican makes Bitcoin part of campaign",
    "url": "https://cointelegraph.com/news/is-ron-desantis-good-for-crypto-republican-makes-bitcoin-part-of-campaign",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/67454888-5241-474b-9239-538aa7e0610c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The governor of Florida wants to defend people’s right to “do Bitcoin.”  </p>\n                    <p><p>Florida Governor Ron DeSantis officially entered the United States presidential race on May 24. </p><p>During a Twitter broadcast hosted by venture capitalist David Sacks, DeSantis pledged to lead a “Great American Comeback,” <a href=\"https://www.businessinsider.com/trump-accuses-desantis-of-plagiarizing-tagline-great-american-comeback-2023-5\" target=\"_blank\" rel=\"noopener nofollow\">provoking</a> accusations of plagiarism from ex-President and fellow 2024 presidential candidate Donald Trump. </p><p>Among topics like U.S. immigration policy and the supposed prevalence of “critical race theory,” DeSantis gave significant attention to cryptocurrency during his hour-long presentation. He promised to protect “the ability to do things like Bitcoin” and fight the “central planners” at Capitol Hill. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Ron DeSantis on <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>: “I’ll protect the ability to do things like bitcoin. I don’t have an itch to control everything that people may be doing in this space.” <a href=\"https://t.co/j4wRHZACK5\">pic.twitter.com/j4wRHZACK5</a></p>&mdash; Jane Adams (@iLoveJaneAdams) <a href=\"https://twitter.com/iLoveJaneAdams/status/1661538616324112387?ref_src=twsrc%5Etfw\">May 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>DeSantis’ stance on crypto has been fairly consistent over the past few years. Still, his decision to emphasize it again is notable, as was the choice to announce his presidential bid on Twitter in the virtual presence of crypto-adjacent Elon Musk.</p><p>This has led to the characterization of DeSantis as “the choice for crypto enthusiasts in 2024,” and there’s little doubt the politician will keep trying to win unanimous support among the community. </p><h2>A friend of crypto </h2><p>In 2021, the Florida governor proposed that the state government allow businesses to <a href=\"https://cointelegraph.com/news/florida-governor-s-budget-proposal-wants-to-let-residents-pay-fees-in-crypto\">pay state fees with cryptocurrencies</a> in the 2022/23 budgetary year. </p><p>He suggested providing the Florida Department of Financial Services $200,000 of financing to offer local companies the option to pay state fees via crypto, and another $500,000 to explore distributed ledger technology’s potential to maintain motor vehicle records, authenticate Medicaid transactions and detect potential fraud.</p><p>Overall, the governor’s stance has matched general crypto enthusiasm in the state. Miami hosted the <a href=\"https://cointelegraph.com/news/largest-bitcoin-event-in-history-bitcoin-2021-kicks-off-in-miami\">“largest-ever” Bitcoin event</a> in 2021, while its mayor, Francis Suarez, started accepting his <a href=\"https://cointelegraph.com/news/miami-mayor-plans-to-accept-first-paycheck-entirely-in-bitcoin\">paychecks entirely in Bitcoin</a>. </p><p>Miami even <a href=\"https://cointelegraph.com/news/miamicoin-generated-2k-every-10-minutes-for-the-city-says-mayor\">introduced its own cryptocurrency</a>, built on the Bitcoin blockchain, dubbed MiamiCoin. Within the MiamiCoin protocol, 30% of all coins mined made their way to a digital wallet designated for the city.</p><p>In 2023, DeSantis started engaging in political discussions around crypto more seriously. In March, he held a press conference under the banner “Big Brother’s Digital Dollar,” where he <a href=\"https://cointelegraph.com/news/florida-gov-and-us-presidential-hopeful-calls-for-cbdc-ban\">spoke out against</a> the Federal Reserve’s possible plan to issue a central bank digital currency (CBDC). Noting recent inflation rates and the Fed raising interest rates, the politician concentrated on freedom and privacy concerns tied to the “digital dollar:”</p><blockquote>“[A CBDC] provides the government with a direct view of all consumer activities. Any way they can get into society to exercise their agenda, they will do it. So, what the central bank digital currency is all about is surveilling Americans and controlling the behavior of Americans.”</blockquote><p>Concluding the press conference, DeSantis urged Florida lawmakers and their “like-minded” counterparts from other states to introduce legislation prohibiting modifications to the Uniform Commercial Code so no U.S. or foreign CBDC could be included. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ai-eye-is-ai-a-threat-why-ai-advance/\">AI Eye: Is AI a nuke-level threat? Why AI fields all advance at once, dumb pic puns</a></em></strong></p><p>Playing on recent tensions with China, he mentioned the country’s digital yuan project, which he claimed is being used “to monitor citizen behavior allowing for the surveillance of spending habits and to cut off access to goods and services.”</p><p>He later repeated this rhetoric in response to the Fed’s public claim that it would seek Congress’s support if it decided to introduce a CBDC. DeSantis said that it is not a question of benevolent intentions but a constitutional requirement for that kind of major policy change to be authorized by Congress. “Unaccountable institutions cannot impose a CBDC on Americans,” he added. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It is not merely “ideal” that major changes in policy receive specific authorization from Congress; it is constitutionally required.<br><br>Unaccountable institutions cannot impose a CBDC on Americans. They will tell us that CBDC won’t be abused but we are wise enough to know better.… <a href=\"https://t.co/OqJ27Lym2L\">https://t.co/OqJ27Lym2L</a></p>&mdash; Ron DeSantis (@GovRonDeSantis) <a href=\"https://twitter.com/GovRonDeSantis/status/1645443197991043072?ref_src=twsrc%5Etfw\">April 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>A couple of months after his fiery speech about the digital dollar, DeSantis <a href=\"https://cointelegraph.com/news/florida-governor-signs-cbdc-bill-into-law-restricting-some-uses-of-us-and-foreign-cbdcs\">signed a bill restricting the use</a> of possible CBDCs in Florida. Were a U.S. CBDC to be issued, he warned, it would be “a massive transfer of power from consumers to a central authority.” The governor also claimed that a CBDC would threaten private cryptocurrencies.</p><p>Such a fierce anti-statist and pro-market position, complemented by decent knowledge of the crypto market, make DeSantis an attractive candidate for some industry enthusiasts. As J.W. Verret, an associate professor at George Mason Law School, told Cointelegraph: </p><blockquote>“DeSantis’ leadership could cultivate a more supportive environment for cryptocurrencies, potentially stimulating a wave of innovation and entrepreneurship.” </blockquote><p>However, the problem may lie in other areas of DeSantis’ political advocacy unrelated to cryptocurrency. </p><h2>A foe of progressives </h2><p>“The most likely Trump alternative in the race,” as the pundits often <a href=\"https://www.nytimes.com/2023/05/25/opinion/ron-desantis-scorecard.html\" target=\"_blank\" rel=\"noopener nofollow\">call</a> him, DeSantis combines the stature of a successful governor of a large state with a conservative public persona. </p><p>During his tenure in the U.S. Congress, DeSantis fought climate tax hikes, the Affordable Care Act, gun control, Barack Obama’s immigration policy, the special prosecutor Robert Mueller’s investigation of interference in the 2016 presidential election and taxes on social security benefits. He was one of the founders of the conservative-libertarian congressional Freedom Caucus in 2015. </p><p>As governor, DeSantis shifted Florida’s Supreme Court balance to originalism, ensuring the legal system would aid his struggle against major social change. He also imposed stricter rules on Florida universities when collaborating with China and signed an “anti-sanctuary city” bill, preventing so-called “sanctuary cities” from being established in Florida. But perhaps the most contentious of the governor’s political activities is his battle with “critical race theory” and LGBTQ+ awareness in schools. </p><p>“Florida is where the woke goes to die,” he proclaimed during his second-term speech.</p><p>In the summer of 2021, the Florida Board of Education approved a ban on teaching critical race theory in school, which DeSantis endorsed, while in December of the same year, a politician introduced his Stop Wrongs to Our Kids and Employees Act or the Stop WOKE Act.</p><p>The legislation was signed into law in 2022 but was partially injuncted by district judge Mark Walker, who declared it too vague and unconstitutional. However, DeSantis still managed to ban transgender girls from participating in female school sports competitions, and prohibited discussions on gender identity in school classrooms from kindergarten to third grade.</p><p>These efforts have been popular with conservative voters but have not come without consequences. </p><p>He eliminated Disney World’s special tax district in Florida in response to the media giant’s vocal opposition to his anti-LGBTQ+ policies. Disney subsequently <a href=\"https://www.nytimes.com/2023/05/18/business/disney-ron-desantis-florida.html\" target=\"_blank\" rel=\"noopener nofollow\">halted</a> plans for a $1 billion development project in the state, which it claims would have created some 2,000 jobs.</p><p>Furthermore, Republicans <a href=\"https://www.theguardian.com/us-news/2022/nov/09/republican-election-deniers-trump-mastriano-karamo-finchem-marchant-midterms\" target=\"_blank\" rel=\"noopener nofollow\">fell</a> far short of expectations in the 2022 mid-term elections, with American voters failing to rally around the party, the rhetoric of which was largely concentrated on culture-war issues and claims of a stolen election.</p><p>All this, combined with the fact that DeSantis is currently polling well behind former president Trump could spell headwinds for the pro-crypto governor.</p><h2>Voting in the era of polarization</h2><p>DeSantis represents a combination of a pro-free market, low taxes, low welfare economic vision and a populist appetite for cultural wars with progressives, which has become increasingly prevalent in the last decade. </p><p>In this context, his support for crypto is manifested more as a part of a larger anti-statist and business-friendly paradigm, rather than a detailed stance on cryptocurrency specifically — one could hardly recall any nuanced points from DeSantis about the potential of decentralized finance (DeFi), for example. </p><p>Thus, betting on him could widen a notable separation in the U.S. crypto community, with some feeling threatened by the Biden administration’s hawkish crypto stance, in contrast to the relatively pro-crypto rhetoric in the Republican Party, leading to a growing partisan divide.</p><p>Is it productive for the crypto industry to foster stronger ties with the Republican Party in the long run? </p><p>Speaking to Cointelegraph, Anthony Georgiades, co-founder of the Pastel Network — a decentralized blockchain for nonfungible tokens — said in an era of extreme polarization, the answer depends on where one falls on the political spectrum.</p><p>That said, the recent approach of regulation-by-enforcement from the U.S. Securities and Exchange Commission — the head of which was appointed by a Democratic president — has been deeply unsettling for market stakeholders, up to the point of an “existential risk” anxiety:</p><blockquote>“So I imagine that some in our industry would be willing to compromise on their candidate of choice, to some extent at least, because of the related policy stance on crypto. This would also apply to any number of industries, I should add, not just crypto.”</blockquote><p>The CEO and co-founder of carbon-backed digital collectibles Ecosapiens, Nihar Neelakanti, believes that the current situation is merely a projection of a general political polarization in the U.S., where the crypto industry — neutral in basics and uniting a broad spectrum of supporters, from liberals to libertarians — seeks any kind of support it can get. And DeSantis still doesn’t represent the only candidate who could accumulate crypto voters. </p><p>Neekalanti told Cointelegraph, “The good thing is that we now have candidates from both major parties who are supportive of Bitcoin and crypto more generally. If a pro-Bitcoin conservative wins, then there will be many who say this is bad for crypto. But if a pro-Bitcoin liberal wins, many will also say this is bad for crypto. We’re just too politically divided as a nation.”</p><p>Dan Nissanoff, the CEO and founder of Game of Silks metaverse, agrees. Speaking to Cointelegraph, he highlighted that the crypto community is still very far from uniting around any single candidate. </p><p>At least three candidates appear to have embraced the digital asset economy wholeheartedly: Robert F. Kennedy Jr., Ron DeSantis and Vivek Ramaswamy. “DeSantis is popular among conservatives, just as RFK Jr. is popular among a seemingly growing number of liberals. It’s nice to see glimmers of bipartisan support for digital assets.”</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/economics-of-bitcoin-atm-market-could-hinder-wider-adoption\">Economics of Bitcoin ATM market could hinder wider adoption</a></em></strong></p><p>The only sure thing at this point is that Biden is likely to be the least popular candidate for crypto enthusiasts. </p><p>The optimal choice for someone in the crypto community might come down to two factors, Georgieades explained: </p><blockquote>“The first is whether any particular candidate is pro-crypto or not. And, second, how this candidate approaches other hot-button issues facing the country.” </blockquote><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-12T13:58:49.000Z",
    "title": "Ripple and Canada’s Largest University Eye XRP Ledger Validator Launch",
    "url": "https://www.cryptoglobe.com/latest/2023/06/ripple-and-canadas-largest-university-eye-xrp-ledger-validator-launch/",
    "description": "In a significant development for the crypto industry, the University of Toronto, Canada’s largest university, has announced a partnership with Ripple to establish an independent XRP ledger validator, according to a report by CoinDesk published on June 12, 2023. This initiative is a part of Ripple’s University Blockchain Research Initiative (UBRI) in Canada, which has […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-12T14:00:18.000Z",
    "title": "Massive Gaming Celebrates Global Launch of House of Poker With 100% USDC Rewards Guaranteed in Free Bonus Giveaway Event",
    "url": "https://cryptodaily.co.uk/2023/06/massive-gaming-celebrates-global-launch-of-house-of-poker-with-100-usdc-rewards-guaranteed-in-free-bonus-giveaway-event",
    "description": "<p>Seattle, United States, June 12th, 2023, Chainwire</p><p>Massive Gaming is thrilled to announce the successful launch of House of Poker, a groundbreaking online hold'em game that revolutionizes the poker gaming experience. To commemorate this momentous occasion, Massive Gaming invites players from around the world to join in the excitement of the 100% USDC Rewards Guaranteed Free Bonus Giveaway Event, which has a minimum total prize pool of $6,000 USD worth of rewards, this event promises to deliver thrilling gameplay and incredible prizes.&nbsp;</p><p>Check out the House of Poker Launch Trailer on YouTube.</p><p></p><p>The House of Poker Free Bonus Giveaway Event offers a wide range of engaging missions. Some of the exciting missions include:&nbsp;</p><ul><li>House of Poker Log-in mission (Total prize: GEMS worth in $1,000 USDC)</li><li>Shark of the Week's mission (Total prize: $3,000 USDC worth of GEM &uarr; / 100% Reward Guaranteed)</li><li>Friends Invitation mission (Total prize: $2,000 USDC worth of GEM)</li></ul><p>The total prize pool is set to increase as more participants engage in the event, making it an even more enticing opportunity to win big. For full event details and to participate, please visit the event page.</p><p>House of Poker stands out from other online hold'em games with its outstanding features, including ITECH RNG certification, an extensive range of hold'em tournament contents, and the best live face chat feature that allows players to engage with opponents in real-time. The game also boasts a decentralized Play and Earn system and embraces the adoption of USDC for seamless and secure transactions.&nbsp;</p><p>To stay up-to-date on the latest news and developments from Massive Gaming, please visit Massive Gaming's official homepage. House of Poker officially launched on June 12, 2023, offering players an unmatched and immersive online hold'em experience.</p><p>Download House of Poker now from the following links:</p><p>Google &amp; Apple | Mycard APK</p><p>About Massive Gaming</p><p>Massive Gaming is an affiliate of NEOWIZ, focused on the production and publication of Crypto-enabled games and services.</p><p>For more information and to stay updated, please visit Massive Gaming's official website or follow us on social media:</p><p>Homepage | Twitter | Discord | Blog | Facebook Fanpage | Telegram | Medium | Coinmarketcap</p>ContactPress RelationsBill MurphyMassive Gamingbill@massivegaming.io"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-12T14:00:44.000Z",
    "title": "Security Agency Detains Nigeria’s Suspended Anti-Bitcoin Central Bank Governor",
    "url": "https://news.bitcoin.com/security-agency-detains-nigerias-suspended-anti-bitcoin-central-bank-governor/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2258288733-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Security Agency Detains Nigeria&#039;s Suspended Anti-Bitcoin Central Bank Governor\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2258288733-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2258288733-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2258288733-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2258288733-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2258288733-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2258288733-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2258288733.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Central Bank of Nigeria governor, Godwin Emefiele, was suspended by Nigerian President Bola Ahmed Tinubu on June 9 and was subsequently arrested by a domestic security agency. Several reports have linked Emefiele&#8217;s suspension to the central bank&#8217;s controversial naira demonetization exercise. Emefiele&#8217;s Presidential Aspirations The Nigerian central bank governor, Godwin Emefiele, was on June [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T14:00:56.000Z",
    "title": "TMS Network (TMSN) Powerhouse Unleashes on Aave (AAVE) and Avalanche (AVAX): 2000% Gains!",
    "url": "https://www.cryptopolitan.com/tms-network-tmsn-powerhouse-unleashes-on-aave-aave-and-avalanche-avax-2000-gains/",
    "description": "TMS Network (TMSN)&#160;has been experiencing staggering&#160;value surges of up to 2000%&#160;since its presale event went live. This post delves into the factors behind TMS Network&#8217;s (TMSN) continual bullish run in the&#160;fourth phase of its presale, at a time&#160;renowned projects like Aave (AAVE) and Avalanche (AVAX) struggle to stabilize. Aave (AAVE): Exploring The Ethereum-based Money Market ... <a title=\"TMS Network (TMSN) Powerhouse Unleashes on Aave (AAVE) and Avalanche (AVAX): 2000% Gains!\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tms-network-tmsn-powerhouse-unleashes-on-aave-aave-and-avalanche-avax-2000-gains/\" aria-label=\"More on TMS Network (TMSN) Powerhouse Unleashes on Aave (AAVE) and Avalanche (AVAX): 2000% Gains!\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-12T14:00:07.000Z",
    "title": "Tron (TRX) is performing well, showing payment-based systems like Avorak will be strong",
    "url": "https://nulltx.com/tron-trx-is-performing-well-showing-payment-based-systems-like-avorak-will-be-strong/",
    "description": "Tron (TRX), a prominent cryptocurrency, has posted impressive performances, indicating a positive outlook for payment-based systems like Avorak. Tron&#8217;s success underscores the growing demand for efficient and secure payment solutions and bodes well for Avorak and similar platforms. The success of TRX and its implications for payment-based systems hint at an exciting future for digital [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T14:00:00.000Z",
    "title": "Tether to start bitcoin mining in Uruguay; Tradecurve, a DeFi platform, will be available globally",
    "url": "https://crypto.news/tether-to-start-bitcoin-mining-in-uruguay-tradecurve-a-defi-platform-will-be-available-globally/",
    "description": "Tradecurve, a hybrid crypto exchange, will be available globally. Meanwhile, the issuer of Tether (USDT) is setting up a bitcoin mining operation in Uruguay"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T14:00:00.000Z",
    "title": "Binance updates delisting rules in its terms of service",
    "url": "https://crypto.news/binance-updates-delisting-rules-in-its-terms-of-service/",
    "description": "Binance has updated its terms of service regarding managing listed/delisted tokens on the exchange. Under Binance’s new rules, the exchange now has the authority to convert delisted crypto assets still held by its users after a certain period to any&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T14:00:28.000Z",
    "title": "Massive Gaming Celebrates Global Launch of House of Poker With 100% USDC Rewards Guaranteed in Free Bonus Giveaway Event",
    "url": "https://www.crypto-news-flash.com/massive-gaming-celebrates-global-launch-of-house-of-poker-with-100-usdc-rewards-guaranteed-in-free-bonus-giveaway-event/?utm_source=rss&utm_medium=rss&utm_campaign=massive-gaming-celebrates-global-launch-of-house-of-poker-with-100-usdc-rewards-guaranteed-in-free-bonus-giveaway-event",
    "description": "Seattle, United States, June 12th, 2023, Chainwire Massive Gaming is thrilled to announce the successful launch of House of Poker, a groundbreaking online hold&#8217;em game that revolutionizes the poker gaming experience. To commemorate this momentous occasion, Massive Gaming invites players from around the world to join in the excitement of the 100% USDC Rewards Guaranteed [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T14:00:03.000Z",
    "title": "Dogecoin Price Stagnant, Tradecurve Price Has Increased 50% On The 30-Day Chart",
    "url": "https://www.crypto-news-flash.com/dogecoin-price-stagnant-tradecurve-price-has-increased-50-on-the-30-day-chart/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-price-stagnant-tradecurve-price-has-increased-50-on-the-30-day-chart",
    "description": "Amid the ongoing market volatility, Dogecoin, a popular meme-based cryptocurrency shilled by Twitter owner, Elon Musk, has remained locked in a trading range. However a new emerging project, Tradecurve has seen a significant surge in value during its stage 3 token presale. Over the past 30 days, Tradecurve&#8217;s value has increased by 50%, captivating the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T13:49:36.000Z",
    "title": "Ripple: SEC’s Exposure Imminent Tomorrow with Release of Hinman Documents – Will XRP Soar to $1? Exclusive Report",
    "url": "https://www.crypto-news-flash.com/ripple-secs-exposure-imminent-tomorrow-with-release-of-hinman-documents-will-xrp-soar-to-1-exclusive-report/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-secs-exposure-imminent-tomorrow-with-release-of-hinman-documents-will-xrp-soar-to-1-exclusive-report",
    "description": "Pro-XRP attorney John Deaton suggests that the imminent release of Hinman&#8217;s emails could benefit Ripple and Coinbase. The documents won&#8217;t alter the application of the Howey Test but will illustrate its difficulty when applied to modern technology. The long-anticipated release of former SEC official William Hinman&#8217;s emails, set for tomorrow, has set the crypto community [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T13:46:32.000Z",
    "title": "New Memecoin Poised to Dethrone Milady Meme Coin ($LADYS) and Claim a Spot in the Top 20 Memecoins, According to Experts",
    "url": "https://www.crypto-news-flash.com/new-memecoin-poised-to-dethrone-milady-meme-coin-ladys-and-claim-a-spot-in-the-top-20-memecoins-according-to-experts/?utm_source=rss&utm_medium=rss&utm_campaign=new-memecoin-poised-to-dethrone-milady-meme-coin-ladys-and-claim-a-spot-in-the-top-20-memecoins-according-to-experts",
    "description": "Following an astounding 23,287% surge since its launch, the Milady meme coin has established itself as a prominent player, bringing substantial wealth to numerous crypto investors.  However, recent volatility and sell-offs have resulted in $LADYS trading at -75% from its all-time high price levels, causing late investors to incur significant losses. As a result, these [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-12T13:55:00.000Z",
    "title": "BNB Price Rebounds from 90-Day Low as Open Interest Skyrockets",
    "url": "https://coinedition.com/bnb-price-rebounds-from-90-day-low-as-open-interest-skyrockets/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/BNB_Price_Rebounds_from_90_Day_Low_as_Open_Interest_Skyrockets-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/BNB_Price_Rebounds_from_90_Day_Low_as_Open_Interest_Skyrockets-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/BNB_Price_Rebounds_from_90_Day_Low_as_Open_Interest_Skyrockets-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/BNB_Price_Rebounds_from_90_Day_Low_as_Open_Interest_Skyrockets.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Earlier today, Binance&#8217;s (BNB) token witnessed an unexpected twist in its financial saga. Despite a drop in its price, the open interest in its futures soared to a five-month high. This rise in open interest, the tally of active and unsettled futures contracts, was tracked by Coinglass, revealing a staggering increase of 27% within a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bnb-price-rebounds-from-90-day-low-as-open-interest-skyrockets/\">BNB Price Rebounds from 90-Day Low as Open Interest Skyrockets</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-12T13:47:04.000Z",
    "title": "Zcash (ZEC) Price Prediction 2023-2030: Will ZEC reach $100 Soon?",
    "url": "https://coinedition.com/zcash-zec-price-prediction/",
    "description": "<img width=\"150\" height=\"150\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Zcash-ZEC-Price-Prediction-150x150.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Zcash (ZEC) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" /><p>Privacy is one of the features that many users still demand and expect newer developments. Many cryptocurrencies are built to provide various benefits for the community, however, some still lack privacy features.&#160; Zcash is one of the cryptocurrencies that focuses on protecting the privacy of the community while ensuring transactions can be conducted seamlessly. One [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/zcash-zec-price-prediction/\">Zcash (ZEC) Price Prediction 2023-2030: Will ZEC reach $100 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]