[
  {
    "source": "Cointelegraph",
    "date": "2024-03-06T08:35:10.000Z",
    "title": " BlackRock’s iShares ETFs record $788M net inflow as Bitcoin bull run gathers pace ",
    "url": "https://cointelegraph.com/news/blackrock-etfs-record-inflow-bitcoin-bullrun",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMjk0MmY2NmYtYWEwNy00NTBlLTg2ZGItOTA5YzU4ZmU3NDBjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Out of 10 approved ETFs, Grayscale Bitcoin Trust (GBTC) and Invesco Galaxy Bitcoin ETF (BTCO) were the only two record net outflows on March 5, worth $332.5 million and $14.2 million, respectively.</p>\n                    <p><p data-ct-non-breakable=\"true\">The iShares exchange-traded funds (ETFs) by BlackRock (IBIT) recorded its highest daily inflow of $788 million on March 5, exceeding its <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-inflow-ath-680-m\">previous all-time high inflow of $612.1 million</a> from Feb. 28.</p><p>The Bitcoin ecosystem reached two landmark milestones — a new Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) <a href=\"https://cointelegraph.com/news/bitcoin-reaches-new-us-dollar-high-846-days-later\">all-time high of $69,324</a> and an influx of spot BTC ETF investments in the United States. <a href=\"https://farside.co.uk/?p=997\" target=\"_blank\" rel=\"noopener nofollow\">Data</a> from investment management company Farside showed a total inflow of $648.3 million on the day Bitcoin reached its ATH.</p><p>Out of 10 approved ETFs, Grayscale Bitcoin Trust (GBTC) and Invesco Galaxy Bitcoin ETF (BTCO) were the only two record net outflows on March 5, worth $332.5 million and $14.2 million, respectively. </p><p><a href=\"https://cointelegraph.com/news/blackrock-etfs-record-inflow-bitcoin-bullrun\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-06T08:21:24.000Z",
    "title": "Funding rates soared as traders bet big on Bitcoin’s future gains before correction",
    "url": "https://cryptoslate.com/funding-rates-soar-as-traders-bet-big-on-bitcoins-future-gains/",
    "description": "<p>Funding rates are an often overlooked yet vital aspect of the crypto market. These rates are essential in perpetual futures contracts — financial instruments that allow traders to bet on Bitcoin&#8217;s price without an expiration date. Funding rates help align the price of these contracts with the actual market price of Bitcoin through periodic payments [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/funding-rates-soar-as-traders-bet-big-on-bitcoins-future-gains/\">Funding rates soared as traders bet big on Bitcoin&#8217;s future gains before correction</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-06T08:30:40.000Z",
    "title": "Nexo Secures Preliminary VARA Approval to Launch Crypto Lending and Brokerage Services in Dubai",
    "url": "https://news.bitcoin.com/nexo-secures-preliminary-vara-approval-to-launch-crypto-lending-and-brokerage-services-in-dubai/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/nexoxoxd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Nexo Secures Preliminary VARA Approval to Launch Crypto Lending and Brokerage Services in Dubai\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/nexoxoxd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/nexoxoxd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/nexoxoxd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/nexoxoxd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/nexoxoxd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/nexoxoxd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/nexoxoxd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Tuesday, Nexo announced its Dubai entity, Nexo DWTC, had secured preliminary approval from Dubai&#8217;s Virtual Assets Regulatory Authority (VARA) to engage in virtual asset lending, borrowing, and broker-dealer activities within the UAE&#8217;s most populous city. Nexo Gains Initial VARA Approval for Dubai Crypto Operations The crypto lender Nexo received a provisional &#8220;Initial Approval [IA]&#8221; [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-06T08:38:21.000Z",
    "title": "Restaking Protocol EigenLayer Overtakes Aave in TVL Rankings",
    "url": "https://www.cryptopolitan.com/eigenlayer-overtakes-aave-in-tvl-rankings/",
    "description": "Within the decentralized finance (DeFi) space, Ethereum staking protocol EigenLayer has surged past lending protocol Aave, securing its position as the second-largest DeFi protocol by total value locked (TVL).&#160; With a staggering $10.4 billion worth of crypto assets committed to the protocol, EigenLayer&#8217;s ascent marks a noteworthy milestone, shaking up the hierarchy of DeFi platforms. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-06T08:28:06.000Z",
    "title": "UK Government Mandates Collaboration with i.AI for AI Projects",
    "url": "https://www.cryptopolitan.com/uk-government-collaboration-with-i-ai/",
    "description": "The UK government is making a concerted effort to harness the power of Artificial Intelligence (AI) in transforming public services. In a recent speech at Imperial College, London, Deputy Prime Minister Oliver Dowden emphasized AI&#8217;s potential to fundamentally change how public services operate within a few years. Dowden announced that funding for any government AI [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-06T08:26:30.000Z",
    "title": "Analysts bullish on Pullix after Uniswap listing",
    "url": "https://crypto.news/analysts-bullish-on-pullix-after-uniswap-listing/",
    "description": "In the current decentralized finance (DeFi) boom, investors are looking at potent project, mainly Pullix (PLX)"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-06T08:35:00.000Z",
    "title": "Fetch.AI (FET) Price Gains Another 15% Following This Big News",
    "url": "https://www.newsbtc.com/news/fetch-ai-fet-price-gains-15-big-news/",
    "description": "Fetch.AI (FET) has demonstrated remarkable performance in the crypto market today, securing its position among the top-three performers. The asset witnessed an impressive 17% gain within the last 24 hours, marking a significant milestone by crossing the $2 threshold for the first time ever. This surge, propelling Fetch.AI to the 64th place among the top cryptocurrencies by market cap, is a testament to the growing investor confidence and market optimism surrounding its technological advancements and future potential. Why Is Fetch.AI Price Up Today? This surge in FET&#8217;s price can be attributed to a pivotal announcement by the Fetch.AI Foundation, which has evidently ignited investor interest. On March 5, 2024, the foundation unveiled a substantial infrastructure investment with the introduction of &#8220;Fetch Compute,&#8221; following a $100 million investment aimed at enhancing the development capabilities within the AI economy. Introducing: Fetch Compute 🖥️ Following a $100M investment in our infrastructure, we have secured the future for our growing ecosystem with a decentralized computing platform, offering advanced AI-focused @nvidia #GPUs 🚀⚡ But wait, there&#39;s more for $FET stakers! 👀👇 pic.twitter.com/i9FYkJnkLZ &#8212; Fetch.ai (@Fetch_ai) March 5, 2024 Fetch Compute&#8217;s initiative to deploy state-of-the-art Nvidia GPUs, including the H200, H100, and A100 models, aims to significantly accelerate the pace of innovation within the Fetch.AI ecosystem. This strategic investment, funded through the Fetch Ecosystem Fund, is designed to empower developers and users with the computational power necessary for exploring and developing sophisticated models and solutions, addressing the pressing GPU shortage and setting a new standard for the global developer community. Related Reading: Fetch.AI (FET) Surges 21%: Why This Rally Is Just Getting Started A novel incentive mechanism was also announced, where starting March 7, 2024, users staking Fetch.AI’s native coin, FET, will be rewarded with Fetch Compute Credits. These credits can be used to access the computing power on the Fetch Compute network, directly benefiting FET token holders and fostering a robust development ecosystem. Humayun Sheikh, CEO of Fetch.ai, emphasized the transformative nature of Fetch Compute, stating, &#8220;Fetch Compute is not just an infrastructure investment; it&#8217;s an investment in the future of AI and the ecosystem of innovative developers who are pushing the boundaries of what&#8217;s possible with our platform.&#8221; Sheikh further elaborated on the significance of this initiative, &#8220;By marrying substantial compute resources with our unique compute credit system, we&#8217;re ensuring that our community has the support and tools necessary to bring their visionary AI projects to life.” Related Reading: Fetch.AI (FET) Prints Strong Bullish Signal, Targets 500% Spike This strategic expansion not only enhances the utility of the FET token but also reinforces Fetch.AI&#8217;s infrastructure capabilities. The platform’s DeltaV, leveraging Language Models (LLMs) and AI Agents, aims to revolutionize the way users connect with services, thereby redefining the search experience. With the rollout of Fetch Compute, Fetch.AI solidifies its vision of a more intelligent, efficient, and interconnected AI world. FET Price Enters Price Discovery As the FET price has ascended beyond the $2 mark, it has successfully concluded the bull flag pattern, we discussed in earlier price analysis, achieving a 290% increase. Now, the price of FET is entering a phase of price discovery. The Fibonacci extension levels may provide insights into potential future directions for the price. Potential price targets are at $3.04 (2.618 Fib), $4.18 (3.618 Fib) and $4.88 (4.236 Fib). Featured image from MEXC Blog, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-06T08:30:58.000Z",
    "title": "BREAKING: Millions in BTC, XMR Disappear in Darknet Market Exit Scam",
    "url": "https://www.crypto-news-flash.com/breaking-millions-in-btc-xmr-disappear-in-darknet-market-exit-scam/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-millions-in-btc-xmr-disappear-in-darknet-market-exit-scam",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/06/Bitcoin-from-his-room-a-teenager-sets-up-a-scam.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"scam\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/06/Bitcoin-from-his-room-a-teenager-sets-up-a-scam.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2022/06/Bitcoin-from-his-room-a-teenager-sets-up-a-scam-300x158.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/06/Bitcoin-from-his-room-a-teenager-sets-up-a-scam-1024x538.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/06/Bitcoin-from-his-room-a-teenager-sets-up-a-scam-768x403.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/06/Bitcoin-from-his-room-a-teenager-sets-up-a-scam-351x185.jpg 351w, https://www.crypto-news-flash.com/wp-content/uploads/2022/06/Bitcoin-from-his-room-a-teenager-sets-up-a-scam-24x13.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/06/Bitcoin-from-his-room-a-teenager-sets-up-a-scam-36x19.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/06/Bitcoin-from-his-room-a-teenager-sets-up-a-scam-48x25.jpg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Incognito Market faces withdrawal issues and exit scam allegations. Dark web sleuth confirms exit scam amid Bitcoin rally. In the shadowy recesses of the darknet, a major marketplace known as Incognito Market has recently come under scrutiny. This platform, predominantly utilized for narcotics trade, has become a focal point for controversy due to sudden withdrawal [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-06T08:24:18.000Z",
    "title": "Top Rune Projects to Know — Part 1 ",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-rune-projects-to-know-part-1/",
    "description": "<p>Bitcoin&#8217;s core hasn&#8217;t changed. It&#8217;s still a PoW network and there are only 21 million BTC ever available. However, the Bitcoin ecosystem has changed quite a bit recently. It started with the Ordinals and the introduction of a new token standard, the BRC-20. However, now there are also Rune tokens, an improved version of BRC-20 [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-rune-projects-to-know-part-1/\">Top Rune Projects to Know — Part 1 </a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]