[
  {
    "source": "CryptoGlobe",
    "date": "2023-07-21T01:00:00.000Z",
    "title": "Black Swan Author Slams NFTs as Jack Dorsey’s Tweet NFT Receives $1.14 Bid After Being Sold for $2.9 Million in 2021",
    "url": "https://www.cryptoglobe.com/latest/2023/07/black-swan-author-slams-nfts-as-jack-dorseys-tweet-nft-receives-1-14-bid-after-being-sold-for-2-9-million-in-2021/",
    "description": "On the microblogging platform Twitter Nassim Nicholas Taleb, the popular author of the groundbreaking book “Black Swan,” criticized the burgeoning non-fungible token (NFT) industry, pointing out the incredible drop in value some tokens have had since their peak. Through his tweet, Taleb launched a potent barrage of criticism against NFTs, asserting their suboptimal status as […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-21T01:00:13.000Z",
    "title": "Over 2 Million XRP Traded Every Minute, Path To Second Place After Bitcoin?",
    "url": "https://www.newsbtc.com/ripple-2/2-million-xrp-traded-every-minute-second-place-bitcoin/",
    "description": "On-chain data on July 19 shows that as much as 2 million XRP, the native currency of the XRP Ledger, were changing hands every minute on top cryptocurrency exchanges, including KuCoin and Poloniex. In a screen grab shared on Twitter, on-chain data reveals that more XRP was being traded in bulk, driving trading volumes higher across the board.  Accompanying the expansion, prices remain higher as of writing on July 20. The coin is up 72% from July 2023 lows, even though trading volumes in leading exchanges, including Binance, have since tapered slightly. Nonetheless, the resurgence in trading volumes this week suggests that the demand for the coin remains relatively higher. XRP And Its Spectacular Rally The token&#8217;s value experienced a surge following a recent court ruling declaring that the SEC could not provide evidence that it was a security. Per the Howey test, the judge concluded that XRP does not meet the legal definition of a security. Related Reading: SEC Allegedly Delays Assistance For US Crypto Market Bill Three years ago, in December 2020, the regulator filed a lawsuit alleging that Ripple, the blockchain company, and some of its executives, including Brad Garlinghouse, had raised over $1 billion through alleged illegal sales of XRP, an asset they claimed was an unregistered security. Ripple denied the allegations and fought the lawsuit, expending millions of dollars in legal expenses and eventually winning on this item.  Coinbase, Bitstamp, Crypto Exchanges Relisting The rally has also been boosted by the news that Coinbase Global, Kraken, and other top-tier cryptocurrency exchanges have relisted the token. Specifically, Coinbase delisted XRP in December 2020 following the SEC lawsuit, triggering a wave of delisting among cryptocurrency exchanges in the United States.  Relisting XRP across major exchanges could be a sign of confidence. It will likely boost the coin’s liquidity, increasing trading volumes in the coming months. Supporters find the listing a refreshing development, especially for clients in the United States who had been cut off from trading. Related Reading: Terraform Labs Appoints New CEO Following Do Kwon’s Sentencing In Montenegro Some predictions maintain that the token rally will likely continue in H2 2023. Judge Analisa Torres’ ruling in favor of Ripple Labs removed uncertainty around the coin&#8217;s status. This decision can also open more doors for institutional adoption.  Moreover, the rally and regulatory clarity cement the token&#8217;s position in the cryptocurrency market. This development may see it narrow its gap with Ethereum (ETH), perhaps even flipping it to become the second-largest coin after Bitcoin. In the last three years before the court ruling, the token shook off weakness and retained its slot in the top 10 cryptocurrencies by market capitalization amid the biting and extended crypto winter 2022. Feature image from Canva, chart from TradingView"
  }
]