[
  {
    "source": "Decrypt",
    "date": "2023-09-27T19:15:40.000Z",
    "title": "OpenAI's ChatGPT Now Searches the Web in Real Time—Again",
    "url": "https://decrypt.co/198987/openai-brings-web-search-back-to-chatgpt",
    "description": "The ability to search for current information was taken offline earlier this year when it was being used to bypass paywalls."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-27T19:15:00.000Z",
    "title": "SEC's Gensler is loyal to banks, not an impartial regulator — Rep. Tom Emmer",
    "url": "https://cointelegraph.com/news/sec-gensler-loyal-banks-not-impartial-regulator-rep-tom-emmer",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/6658f66e-4dde-4e82-9e6e-412a67393f1a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>During a hearing on Sept. 27, Emmer hinted that Gary Gensler's Wall Street background limits his impartiality as an industry regulator. </p>\n                    <p><p>United States Rep. Tom Emmer has spoken out against Securities and Exchange Commission chairman Gary Gensler during a hearing at the House Financial Services Committee on Sept. 27. <a href=\"https://iqconnect.house.gov/iqextranet/view_newsletter.aspx?id=108787&c=MN06TE\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to the lawmaker, Gensler has been loyal to Wall Street \"at the clear expense of innovation, competition, and everyday Americans.\" </p><p>Over the course of a 4-minute questioning, Emmer hinted at Gensler's background in finance, which included 18 years with Goldman Sachs, where he was a partner and co-head of finance. As per Emmer's view, Gensler's ties to the financial industry limit his ability to be an impartial regulator. Emmer said:</p><blockquote>\"But given your 18-year career at one of the biggest banks in the world and the personal financial fortune you amassed there, do you think it’s possible for you to serve as an impartial regulator and not favor large financial intermediaries?\"</blockquote><p>According to a transcript of the hearing, Emmer went on to say:</p><blockquote>\"And to be clear sir, this perspective has nothing to do with a concern you noted in a speech last year where you said, quote, “Over the past year, several bank executives have shared their concerns with me about the sheer number of depositors who have moved money from their bank accounts into crypto-related exchanges and wallets,” end quote, right?\"</blockquote><p>Gensler was asked to answer all questions with a yes or no response without being allowed to make further comments. In response to the first question about being able to regulate impartially, Gensler said, \"Absolutely, sir.\" In response to the second question, Gensler tried to contextualize his quote but was not allowed to proceed. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/vwFQfjBJJw0\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Congressman Emmer has been positioning himself as a crypto advocate, pushing for regulatory clarity in the United States during the SEC crackdown on crypto firms that began in 2022 following the collapse of crypto exchange FTX. A look at Emmer's top financial contributors between 2021-2022 reveals venture capital firm Andreessen Horowitz, a leading investor in the crypto space. <a href=\"https://www.opensecrets.org/members-of-congress/tom-emmer/summary?cid=N00035440\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to data available on Open Secrets, donations to Emmer from the securities and investment industries stood at $418,020.</p><p>Also during the hearing, Rep. Patrick McHenry <a href=\"https://cointelegraph.com/news/house-committee-threatens-subpoena-ftx-documents\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/house-committee-threatens-subpoena-ftx-documents/amp\">suggested the SEC could be subpoenaed</a> over documents related to former FTX CEO Sam Bankman-Fried. According to McHenry, Gensler made efforts to “choke off the digital asset ecosystem” in addition to “refus[ing] to be transparent with Congress” in connections between the commission, FTX and Bankman-Fried. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2023-09-27T19:15:55.000Z",
    "title": "Whale Makes $1.75M Profit With $FRONT Investment After Waiting For 8 Months",
    "url": "https://nulltx.com/whale-makes-1-75m-profit-with-front-investment-after-waiting-for-8-months/",
    "description": "In January, this anonymous investor withdrew a substantial 7 million $FRONT tokens, valued at $1.33 million at the time, demonstrating their confidence in the project&#8217;s long-term potential. Whale Held $FRONT For Straight Eight Months Fast forward eight months, and this investor&#8217;s patience has paid off. The price of $FRONT has seen a significant increase, validating [&#8230;]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-27T19:36:00.000Z",
    "title": "Bank Of International Settlements’ GM Calls For Legal CBDC Framework",
    "url": "https://coinedition.com/bank-of-international-settlements-gm-calls-for-legal-cbdc-framework/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/CBDC-101.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bank Of International Settlements GM Calls\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/CBDC-101.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/CBDC-101-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/CBDC-101-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/CBDC-101-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/CBDC-101-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/CBDC-101-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Earlier today, Agustin Carstens, the general manager of the Bank for International Settlements (BIS) stated that all nations should establish legal facilities that facilitate the implementation of central bank digital currencies (CBDCs). According to a speech published on the official BIS website, Carstens had quoted: “Wholesale CBDCs have vast potential in the areas of automation [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bank-of-international-settlements-gm-calls-for-legal-cbdc-framework/\">Bank Of International Settlements’ GM Calls For Legal CBDC Framework</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]