[
  {
    "source": "Cointelegraph",
    "date": "2023-12-15T08:46:36.000Z",
    "title": " US dollar hits 4-month low as Bitcoin trader predicts 10% drop to come ",
    "url": "https://cointelegraph.com/news/us-dollar-4-month-low-bitcoin-trader-predicts-10-drop",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYTZhYzc2OGYtN2JkYS00M2Y3LTlmZmEtNWIyMGI2NjBmMGUxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin stands to enjoy further relief if its standard relationship to DXY weakness holds firm, as the dollar shrinks on Fed \"pivot\" bets.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) may enjoy a familiar tailwind in the coming weeks and even beyond if new macro forces continue to play out.</p><p>In a <a href=\"https://twitter.com/Crypto_Ed_NL/status/1735303767724118145/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">post</a> on X (formerly Twitter) on Dec. 14, popular trader Crypto Ed, founder of trading group CryptoTA, eyed multi-month lows in U.S. dollar strength.</p><p>Bitcoin and dollar strength have in the past exhibited inverse correlation. While this has <a href=\"https://cointelegraph.com/news/bitcoin-price-2017-like-rally-again-dollar\">decreased in recent times</a>, changes to U.S. macro policy are now broadly seen to boost Bitcoin but pressure the greenback going forward.</p><p><a href=\"https://cointelegraph.com/news/us-dollar-4-month-low-bitcoin-trader-predicts-10-drop\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-15T09:00:54.000Z",
    "title": "Adam Back Says ‘Suck That Truthoors’ as Cantor Fitzgerald CEO Reveals Company Holds Tether’s Treasuries",
    "url": "https://news.bitcoin.com/adam-back-says-suck-that-truthoors-as-cantor-fitzgerald-ceo-reveals-company-holds-tethers-treasuries/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/628cf5b5-6323-4c42-9a8e-6d2b2ffc9a45-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Cantor Fitzgerald CEO Reveals Company Holds Tether Treasuries\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/628cf5b5-6323-4c42-9a8e-6d2b2ffc9a45-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/628cf5b5-6323-4c42-9a8e-6d2b2ffc9a45-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/628cf5b5-6323-4c42-9a8e-6d2b2ffc9a45-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/628cf5b5-6323-4c42-9a8e-6d2b2ffc9a45-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/628cf5b5-6323-4c42-9a8e-6d2b2ffc9a45-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/628cf5b5-6323-4c42-9a8e-6d2b2ffc9a45-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/628cf5b5-6323-4c42-9a8e-6d2b2ffc9a45.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Howard Lutnick, CEO of Cantor Fitzgerald, a Wall Street private financial services company, has recently confirmed that they lent their services to Tether, the issuer of the biggest stablecoin in the cryptocurrency market. On CNBC&#x2019;s Money Movers, Lutnick stated that he was a fan of Tether and that they held their treasuries. Cantor Fitzgerald CEO [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-15T09:02:19.000Z",
    "title": "Chainlink and The Sandbox Growth Indicators Fall Behind Borroe Finance",
    "url": "https://nulltx.com/chainlink-and-the-sandbox-growth-indicators-fall-behind-borroe-finance/",
    "description": "In the ever-changing landscape of cryptocurrencies, there’s always a new star rising, and right now, Borroe Finance ($ROE) is that star. As we delve into the world of digital assets, it&#8217;s clear that while established players like Chainlink and The Sandbox have made their mark, Borroe Finance is quickly becoming [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-15T08:50:03.000Z",
    "title": "Investors Eye New Cryptocurrency as a Promising Alternative to Chainlink and Optimism",
    "url": "https://nulltx.com/investors-eye-new-cryptocurrency-as-a-promising-alternative-to-chainlink-and-optimism/",
    "description": "TLDR Chainlink plummets 7% in a week, but an upward correction is due soon. Optimism climbs 21% in a week on news of Coinbase planning to launch OP futures. Rebel Satoshi continues attracting investors after surging 80% to date. Top crypto coins like Chainlink (LINK) and Optimism (OP) have performed [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-15T08:44:35.000Z",
    "title": "Predicting Cardano’s (ADA) 70% Rise to $0.75; Investors Turn to Eos (EOS), InQubeta (QUBE) for Portfolio Growth",
    "url": "https://nulltx.com/predicting-cardanos-ada-70-rise-to-0-75-investors-turn-to-eos-eos-inqubeta-qube-for-portfolio-growth/",
    "description": "The cryptocurrency community is abuzz with excitement as analysts discuss the potential surge in Cardano (ADA), predicting a noteworthy 70% increase to $0.75. Amidst this intriguing forecast, investors are strategically diversifying their portfolios, eyeing altcoins like Eos (EOS) and InQubeta (QUBE) for their promising potential. Let&#8217;s delve into the details [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-15T08:42:38.000Z",
    "title": "The Emerging Cryptocurrency Poised for Exceptional Growth, Outshining Celestia and ORDI",
    "url": "https://nulltx.com/the-emerging-cryptocurrency-poised-for-exceptional-growth-outshining-celestia-and-ordi/",
    "description": "TLDR Celestia&#8217;s (TIA) market bullishness has continued since its main network launch. Bitcoin Ordinals (ORDI) have recorded a sharp market capitalization increase since its listing on Binance. NuggetRush (NUGX) is a play-to-earn adventure that offers wealth-building opportunities and a mining thrill. Celestia (TIA) has continued its market rise since the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-15T09:03:54.000Z",
    "title": "Binance to remove ETH, XRP, ADA liquidity pools to reduce slippage",
    "url": "https://crypto.news/binance-to-remove-eth-xrp-ada-liquidity-pools-to-reduce-slippage/",
    "description": "Crypto exchange Binance is set to delist multiple liquidity pools with large-cap altcoins from its swap service. In a blog announcement on Dec. 15, 2023, Binance said it is going to remove multiple liquidity pools from its swap service, Binance&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-15T08:43:43.000Z",
    "title": "Shiba Inu rising; Kava and InQubeta demand surge",
    "url": "https://crypto.news/shiba-inu-rising-kava-and-inqubeta-demand-surge/",
    "description": "Shiba Inu is taking more SHIB away from circulation. Amid this, investors have been looking at Kava and InQubeta"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-15T09:00:46.000Z",
    "title": "Terra Luna Classic Rockets Over 300% And Collapses — More Pain Ahead?",
    "url": "https://www.newsbtc.com/news/terra-luna-classic-rockets-over-300-and-collapses-more-pain-ahead/",
    "description": "After an impressive 300% rally in the past week, Terra Luna Classic (LUNC) is now facing bearish pressure as it slumped nearly 10% this week. Despite positive internal news for LUNC, the bears still hold the market at a chokehold. According to CoinGlass, a total of $222,000 worth of long positions were wiped out in the past 24 hours despite the open interest remaining positive.  Related Reading: SHIB Roars As Shibarium Hits 100 Million Transactions – Big Things Unfolding Terra Luna Classic: Internal Developments Drive Growth Terra Luna Classic is making some noise online with its community X account being fairly active this month. Enterprise Protocol, a project powered by Terra Luna Classic, recently announced that the protocol can now create cross-chain treasuries on the Juno Network.  1/10 It&#8217;s official: cross-chain treasuries are LIVE on Enterprise DAO! 🎉 With the addition of cross-chain treasuries, Enterprise DAO becomes an even more powerful no-code DAO platform. See the announcement for details, or read on 🧵⤵️https://t.co/12HOpE6RJW — Enterprise Protocol (@enterprise_dao) November 24, 2023 1/ Big announcement! Enterprise DAOs can now create cross-chain treasuries on @JunoNetwork 🚀 What this means for DAOs and the $JUNO community 🧵 ⤵️ pic.twitter.com/ig4viyYvcK — Enterprise Protocol (@enterprise_dao) December 14, 2023 “Enterprise is dedicated to simplifying DAO management. This includes no-code setup, voting &#38; treasury management, and easy distribution of rewards to members. But limiting the fun to one chain would be sad. Which is why Enterprise DAO is expanding cross-chain!” the dev team said in a recent thread.  2/ Enterprise is dedicated to simplifying DAO management. This includes no-code setup, voting &#38; treasury management, and easy distribution of rewards to members. But limiting the fun to one chain would be sad 😢 Which is why Enterprise DAO is expanding cross-chain! — Enterprise Protocol (@enterprise_dao) December 14, 2023 LUNCUSD currently trading at $0.0000177 on the daily chart: TradingView.com This development would bring more throughput to the network, potentially increasing its exposure to other investors. Even though LUNC enjoys an active community, the market still holds a large sway on the token’s price. As of writing, the market is slowly cooling down after an enormous rally in the past week.  More Pain To Come At These Levels LUNC’s current price is standing above $0.00017491. As it currently stands, the token is at a crucial price point as any movement here can make or break future price movements. Investors and traders should exercise caution in the next couple of days as the market slows down and assets return to a more stable price point.  Chart: TradingView LUNC’s main problem is its reliance on major market movements to instigate a hike in price. According to Coingecko, both Bitcoin and Ethereum are experiencing major pullbacks in price after a successful rally last week. Although LUNC is included on the gainers list, investors should not hold this to heart as any pain in the broader market will hurt short to medium-term gains.  Related Reading: Solana Shows Its Mettle As SOL Barrels Past $70 – Details But there is hope on the horizon as the US economy enters a dovish phase with market leaders speculating about rate cuts in 2024.  &#8220;The soft landing that many doubted was possible is becoming more realistic every day,&#8221; Ryan Detrick, chief market strategist at Carson Group, said in an interview with Reuters. &#8220;Inflation is no longer the problem it was and we still have a very healthy consumer, judging by today’s retail sales data,” he added.  Featured image from Shutterstock"
  }
]