[
  {
    "source": "CryptoSlate",
    "date": "2023-06-26T23:16:06.000Z",
    "title": "Court says it doesn’t need to “wordsmith” Binance and SEC’s announcements",
    "url": "https://cryptoslate.com/court-says-it-doesnt-need-to-wordsmith-binance-and-secs-announcements/",
    "description": "<p>The court handling the SEC&#8217;s ongoing case against Binance said that it is not necessary to revise either party&#8217;s public statements on June 26. The relevant order, signed by Judge Amy Berman Jackson, declared: &#8220;While all of the lawyers in this case should adhere to their ethical obligations &#8230; it is not &#8230; necessary or [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/court-says-it-doesnt-need-to-wordsmith-binance-and-secs-announcements/\">Court says it doesn’t need to “wordsmith” Binance and SEC&#8217;s announcements</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-26T23:30:20.000Z",
    "title": "JPMorgan Outlines 4 Global Outlook Scenarios — Warns of ‘Boil the Frog’ Recession as Global Downturn Looms",
    "url": "https://news.bitcoin.com/jpmorgan-outlines-4-global-outlook-scenarios-warns-of-boil-the-frog-recession-as-global-downturn-looms/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/jpmorgan-recession-scenarios-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"JPMorgan Outlines 4 Global Outlook Scenarios — Warns of &#039;Boil the Frog&#039; Recession as Global Downturn Looms\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/jpmorgan-recession-scenarios-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jpmorgan-recession-scenarios-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jpmorgan-recession-scenarios-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jpmorgan-recession-scenarios-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jpmorgan-recession-scenarios-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jpmorgan-recession-scenarios-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/jpmorgan-recession-scenarios.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Global investment bank JPMorgan has presented four probable global outlook scenarios, with &#8220;boil the frog&#8221; recession emerging as the most likely outcome. The bank’s economists warned: “Broad-based developed-market tightening points to a more synchronized global downturn sometime in 2024.” JPMorgan’s Global Outlook and &#8216;Boil the Frog&#8217; Recession Global investment bank JPMorgan has provided an overview [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T23:33:23.000Z",
    "title": "BitTorrent Price Prediction 2023-2032: Is BTT a Good Investment?",
    "url": "https://www.cryptopolitan.com/bittorrent-btt-price-prediction/",
    "description": "BitTorrent Price Predictions 2023-2032 Those who request data buy and spend BTT tokens or wish to increase their download speed. What&#8217;s happening to the BitTorrent network that can motivate us to check out the BitTorrent Price Prediction? #BTT Staking APY is now over 15% on #BitTorrent Chain, with over 46,833b $BTT in total staked! Since ... <a title=\"BitTorrent Price Prediction 2023-2032: Is BTT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bittorrent-btt-price-prediction/\" aria-label=\"More on BitTorrent Price Prediction 2023-2032: Is BTT a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-26T23:38:37.000Z",
    "title": "GM: How A Morning Star Pattern Could Awaken Altcoins",
    "url": "https://www.newsbtc.com/news/gm-morning-star-pattern-altcoins-crypto/",
    "description": "Like a strong cup of highly-caffeinated coffee or the sound of a rooster crowing at the crack of dawn, some things have the potential to be a real eye-opener. When it comes to altcoins, crypto investors could get a wake up alarm they won’t be able to ignore. Keep reading to learn all about the morning star pattern that recently appeared on the weekly chart of several blue chip cryptocurrencies. Why Crypto Could Be In For A Good “Morning” Earlier in June, the United States SEC launched an onslaught of enforcement action against Binance and Coinbase. Many top altcoins were named as securities in the case. This list explicitly mentioned MATIC, SOL, and a handful of others. The result was a deep selloff, severely worsened as US-based institutions began unloading altcoin holdings en masse without care of market impact. Related Reading: Bitcoin Price Breaks Above $30,000: Is The Bull Run Back On? However, following the news that BlackRock and several other institutions were filing for Bitcoin ETFs, the market staged a strong recovery. The rebound was especially powerful in altcoins, which have been extremely oversold in the midst of the ongoing regulatory uncertainty. The sharp turnaround was also enough to form a morning star pattern in many top cryptocurrencies . Top altcoins have formed a morning star pattern &#124; ETHUSD on TradingView.com The Morning Star Pattern: A Wake Up Call For Altcoins A morning star pattern has formed on blue chip altcoins like Ethereum, Litecoin, Chainlink, and Fetch.ai. This type of Japanese candlestick pattern is a potential bullish reversal pattern with powerful implications. The pattern solidified with Sunday night’s weekly close, but to fully confirm must be followed by further upside. This upside is expected to materialized within 3-5 candlesticks, or in this case, weeks. Related Reading: Momentum: Why The Bitcoin Train Is Ready To Leave The Station With many of these more fundamentally-sound and regulator-friendly coins recovering most of what they lost in June, follow through could spark a more significant bullish trend across the brutalized altcoin space. This chart originally appeared in Issue #9 of CoinChartist (VIP). Get 10% off a year subscription with this link: https://coinchartist.substack.com/NEWSBTC Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]