[
  {
    "source": "Decrypt",
    "date": "2023-10-20T22:04:11.000Z",
    "title": "Twitch Will Let Users Stream Across Platforms—But They Better Act Right",
    "url": "https://decrypt.co/202617/twitch-let-users-stream-across-platforms-they-better-act-right",
    "description": "Popular video game streaming site Twitch introduces big changes at TwitchCon 2023 as rivals new and old start to pose serious competition."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-20T22:00:33.000Z",
    "title": "Bitcoin stays resilient as global instability looms",
    "url": "https://cryptoslate.com/insights/bitcoin-stays-resilient-as-global-instability-looms/",
    "description": "<p>Quick Take This past week has been chock-full of significant events within the financial and cryptocurrency markets, with potential global ramifications. In an episode earlier this week, Cointelegraph erroneously announced the approval of BlackRock&#8217;s spot Bitcoin ETF, which sent Bitcoin from roughly $27,500 to $29,000. Grayscale Bitcoin Trust (GBTC) experienced a contraction in its discount [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-stays-resilient-as-global-instability-looms/\">Bitcoin stays resilient as global instability looms</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-20T21:50:56.000Z",
    "title": "FBI charges six individuals in multimillion-dollar Bitcoin money-laundering scheme",
    "url": "https://cryptoslate.com/fbi-charges-six-individuals-in-multimillion-dollar-bitcoin-money-laundering-scheme/",
    "description": "<p>The Federal Bureau of Investigation (FBI) has charged six individuals in connection to an unlicensed money-transmitting business involving crypto as a money laundering tool. Court filings dated Oct. 18 indicate that the accused individuals worked to convert Bitcoin and other cryptocurrencies to cash at least between July 2021 and September 2023. The conversion process involved [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/fbi-charges-six-individuals-in-multimillion-dollar-bitcoin-money-laundering-scheme/\">FBI charges six individuals in multimillion-dollar Bitcoin money-laundering scheme</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-20T22:00:38.000Z",
    "title": "Binance to Sunset Visa Crypto Card as 2023 Sees Decline in Digital Debit Cards",
    "url": "https://news.bitcoin.com/binance-to-sunset-visa-crypto-card-as-2023-sees-decline-in-digital-debit-cards/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/bvisa-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance to Sunset Visa Crypto Card as 2023 Sees Decline in Digital Debit Cards\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/bvisa-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bvisa-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bvisa-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bvisa-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bvisa-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bvisa-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bvisa.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Several reports have revealed that Binance, which is recognized as the leading crypto exchange by trading volume, intends to discontinue its Visa crypto card on December 20, 2023. The enterprise emphasized that only a &#8220;small number of Binance users&#8221; would be affected by this development. Binance to Discontinue Visa Offering by Year&#8217;s End In 2023, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-20T22:00:26.000Z",
    "title": "CEO Is Super Bullish On Solana, Predicts SOL To 2X If This Pattern Is Confirmed",
    "url": "https://www.newsbtc.com/news/solana/ceo-is-super-bullish-on-solana-predicts-sol-to-2x/",
    "description": "Raoul Pal, the founder of Real Vision and one of crypto frequent commentators, thinks SOL, the native currency of Solana, a smart contract platform, has &#8220;been extremely bullish all year.&#8221; In Pal&#8217;s assessment, the coin will likely double in the next few sessions, especially if there is a welcomed breakout above the immediate liquidation level.  Taking to X on October 20, the founder noted that SOL has rallied by 171% in 2023 alone. At the same time, looking at technical candlestick arrangements, the immediate resistance level that traders should watch out for is $30. This line, Pal thinks, marks a critical liquidation level per the &#8220;big inverse head and shoulders&#8221; pattern evident in the daily chart.  In technical analysis, this pattern signals that bear momentum is slowing, and the uptrend could be around the corner. Often, it forms when prices make three lows, with the middle low (the head) being lower than the other two lows (the shoulders).  Related Reading: Bulls Thrust Solana To $25 – What Traders Should Expect Next Pal Is Bullish On Solana, Will SOL 2x? Even so, as Pal notes, the uptrend will be valid once there is a high volume bullish breakout above the &#8220;neckline.&#8221; In the Solana price chart in the daily chart, the neckline is at $30, a psychological level buyers have failed to break since it was registered in July 2023. This level also marks Solana&#8217;s highest price this year. While Solana struggles to overcome the strong resistance by USDT (and technically USD bulls), SOL bulls have been easing past resistance levels versus Ethereum (ETH) and Bitcoin (BTC). As of October 2023, SOL bulls appear to be reversing losses posted in 2022 versus the two top coins by market cap. To highlight this development, SOL is trading at new 2023 highs versus Ethereum, reversing losses and edging higher as bulls flock. SOL bulls have broken two critical liquidation zones at spot levels versus Ethereum registered in January and July. Still, Ethereum remains solid from a top-down preview, up 70% versus SOL reading from the SOLETH daily chart. Will SOL Rally Trigger &#8220;Crypto Summer&#8221; In 2024? While SOL bulls double down, the Real Vision CEO thinks the coin could lead the market to a &#8220;Crypto Summer&#8221; in 2024. The uptrend could be fanned by several developments, especially on partnerships struck in the recent past. Related Reading: Here’s Why This Wall Street Expert Believes XRP Is Very Bullish In early September, Visa, a global payment processor, introduced USDC settlement on Solana, citing the network&#8217;s high throughput. Through this extension, Visa hopes to &#8220;improve the speed of cross-border settlement and provide a modern option for our clients to easily send or receive funds from Visa&#8217;s treasury.&#8221; Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-20T22:01:41.000Z",
    "title": "Crypto Lobby Group Files Amicus Brief in SEC Lawsuit Against Binance, Likens Exchange to E-Commerce Giant Amazon",
    "url": "https://dailyhodl.com/2023/10/20/crypto-lobby-group-files-amicus-brief-in-sec-lawsuit-against-binance-likens-exchange-to-e-commerce-giant-amazon/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/binance-expands-trading-operations.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/binance-expands-trading-operations.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/binance-expands-trading-operations.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/binance-expands-trading-operations.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/binance-expands-trading-operations.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/binance-expands-trading-operations.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/binance-expands-trading-operations.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto lobbying group is petitioning the courts in favor of Binance in the exchange&#8217;s lawsuit with the U.S. Securities and Exchange Commission (SEC). In an amicus briefing filed yesterday, the Chamber of Digital Commerce told the U.S. District Court of Columbia that the US, once a haven for new tech, is pushing away crypto and blockchain [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/20/crypto-lobby-group-files-amicus-brief-in-sec-lawsuit-against-binance-likens-exchange-to-e-commerce-giant-amazon/\">Crypto Lobby Group Files Amicus Brief in SEC Lawsuit Against Binance, Likens Exchange to E-Commerce Giant Amazon</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]