[
  {
    "source": "Cointelegraph",
    "date": "2023-08-28T04:51:10.000Z",
    "title": "Bitcoin revenue per terahash nears record lows as hashrate soars",
    "url": "https://cointelegraph.com/news/bitcoin-profitability-nears-record-lows-hashrate-soars",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/003ed9cc-5c09-445d-b4ac-753a209f557c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>As the Bitcoin network hash rate tops 414 EH/s, miners are struggling to stay afloat amid plummeting profitability.</p>\n                    <p><p>Bitcoin mining revenue or “hash price” — a measure of dollars earned per TH/s per day — has slumped to levels not seen since the collapse of FTX in November 2022, while hash rate has reached new highs. </p><p>Over the past week, Bitcoin network hash rate topped 414 exahashes per second (EH/s) on Aug. 18 marking a new peak for the metric.</p><p>The peak has seen network hash rate surging 54% from what it was at the beginning of 2023 and 80% over the past 12 months, according to <a href=\"https://www.blockchain.com/explorer/charts/hash-rate\" target=\"_blank\" rel=\"noopener nofollow\">Blockchain.com</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b0357612-e78e-4919-b9e4-aa13e55b0b60.jpg\"  /><figcaption style=\"text-align: center;\"><em>BTC hash rate and price 1 year. Source: blockchain.com</em></figcaption></figure><p>However, while the network looks good in terms of security, things are not so rosy for <a href=\"https://cointelegraph.com/learn/how-to-mine-bitcoin-a-beginners-guide-to-mine-btc\">Bitcoin miners</a> as revenue has fallen sharply, hitting levels when <a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a> fell to a market cycle low of around $16,500 in November 2022.</p><p>According to <a href=\"https://data.hashrateindex.com/network-data/btc\" target=\"_blank\" rel=\"noopener nofollow\">HashPriceIndex</a>, revenue is just $0.060 per terahash per second per day, around half of what it was in early May when the Bitcoin Ordinals inscription frenzy caused a heavy demand for block space.</p><p>Market analyst Dylan LeClair <a href=\"https://twitter.com/DylanLeClair_/status/1695902583074763140\" target=\"_blank\" rel=\"noopener nofollow\">commented</a> on the falling revenue and hash rate peak stating that more efficient new rigs will keep being produced, “but it's almost time for the price to outpace,” meaning that prices need to adjust upwards to keep mining profitable at such high hash rates. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/aba57232-1e68-451e-ab42-760fa3a3b977.jpg\"  /><figcaption style=\"text-align: center;\"><em>Miner revenue per terahash. Source: Glassnode</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-miners-btc-price-98k-halving\"><strong><em>Bitcoin miners need BTC price over $98K by the halving</em></strong></a></p><p>Bitcoin miners have reportedly been relying on funds from stock sales in the second quarter to keep them afloat during the bear market.</p><p>On Aug. 24, Bloomberg reported that the 12 major publicly traded <a href=\"https://cointelegraph.com/news/future-btc-mining-and-the-bitcoin-halving\">miners</a> raised about $440 million through stock sales in Q2. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Major <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> miners are in BIG trouble heading to the halving <br><br>To avoid selling the ~$900M BTC they&#39;re hoarding, miners relied on debt and diluting shareholders<br><br>Now those lifelines are drying up. Soon their only option is dumping into the market<a href=\"https://t.co/I27tvV4kxu\">https://t.co/I27tvV4kxu</a></p>&mdash; Rho Rider (@RhoRider) <a href=\"https://twitter.com/RhoRider/status/1695232828022427730?ref_src=twsrc%5Etfw\">August 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Mark Jeftovic, who runs the Bitcoin Capitalist newsletter, said “Some mining companies are diluting shareholders at an excessive rate,” before adding “If they are diluting you faster than Bitcoin is going up, then you are going the wrong way on a treadmill.”</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/recursive-inscriptions-bitcoin-supercomputer-defi-aws-possible/\">Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-28T05:01:47.000Z",
    "title": "\n                        Ethereum AMM Balancer Exploited for Roughly $900k Following Vulnerability Warning\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/ethereum-amm-balancer-exploited-for-roughly-900k-following-vulnerability-warning",
    "description": "\n                        <p class=\"md-end-block md-p\">Ethereum automated market maker (AMM) Balancer, has put out an official disclosure to confirm that it had been exploited for approximately $900,000 (USD). The news comes just days after the decentralized finance protocol highlighted a vulnerability affecting several of its pools.</p>\n<p class=\"md-end-block md-p\">Blockchain security expert Meier Dolev identified an Ethereum address believed to belong to the alleged attacker. Subsequent to the exploit, this address received two transfers of the Dai (DAI) stablecoin, amounting to $636,812 and $257,527 respectively.</p>\n<p class=\"md-end-block md-p\">According to Dolev, the account affected over $893,978 in balance.</p>\n<p class=\"md-end-block md-p md-focus\">Through a statement on the social platform X, formerly known as Twitter, the Balancer team acknowledged the situation. They stated, &ldquo;Balancer is aware of an exploit related to the vulnerability below.&rdquo; Although they had implemented mitigation measures that significantly lowered the associated risks, they were unable to halt the affected pools. As a precautionary measure, the team urged users to withdraw from the compromised liquidity providers (LPs).</p>\n\n<p dir=\"ltr\" lang=\"en\">The attacker continues with his operation, approx $900K affected, more than $600K moved to this address0xB23711b9D92C0f1c7b211c4E2DC69791c2df38c1 pic.twitter.com/inNqH4zel2</p>\n&mdash; Meir Dolev (@Meir_Dv) August 27, 2023\n<p>Previously, on August 22,&nbsp;Balancer had reported a critical vulnerability impacting its boosted pools. The platform had implored users to remove their funds from LPs and initiated a pause on pools to minimize potential harm. Assets that were under threat spanned various platforms including Ethereum, Polygon, Arbitrum, Optimism, Avalanche, Gnosis, Fantom, and zkEVM (from Polygon).</p>\n<p class=\"md-end-block md-p\">Upon the revelation of the vulnerability, merely 1.4% or over $5 million of Balancer's entire assets were at jeopardy. However, by August 24, an estimated $2.8 million, which constitutes 0.42% of its total value locked, was still exposed. The platform had issued a warning on X, advising its users:</p>\n\n<p class=\"md-end-block md-p\">&ldquo;We believe funds in the mitigated pools (labeled &lsquo;mitigated&rsquo;) are safe, but still strongly recommend timely migration to safe pools, or withdrawal. Pools that were unable to be fortified are marked &rsquo;at risk&rsquo;. If you participate as an LP in any of these pools, it is advised to exit immediately.&rdquo;</p>\n\n<p class=\"md-end-block md-p\">Balancer had transitioned to the Optimism network in June the previous year with the intent of amplifying user functionality and diminishing transaction costs.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-28T04:54:49.000Z",
    "title": "Bitcoin Cash Price Could Restart Increase To $250 If It Breaks This Resistance",
    "url": "https://www.newsbtc.com/analysis/bch/bitcoin-cash-price-increase-250/",
    "description": "Bitcoin Cash price recovered from the $160 zone against the US Dollar. BCH might aim a fresh rally toward the $240 and $250 levels. Bitcoin cash price is consolidating above the $180 level against the US Dollar. The price is trading below $200 and the 100 simple moving average (4 hours). There is a key rising channel forming with resistance near $200 on the 4-hour chart of the BCH/USD pair (data feed from Kraken). The pair is likely to accelerate higher if it clears $195 and $200. Bitcoin Cash Price Prepares For The Next Move After a strong decline, Bitcoin Cash price found support near the $160 level. BCH traded as low as $160.90 and recently started a recovery wave, like Bitcoin and Ethereum. The price climbed above the $175 and $180 resistance levels. There was a break above the 23.6% Fib retracement level of the downward move from the $237 swing high to the $160 low. The price is now trading in a range above the $190 level. Bitcoin Cash is now trading below $200 and the 100 simple moving average (4 hours). There is also a key rising channel forming with resistance near $200 on the 4-hour chart of the BCH/USD pair. Immediate resistance is near the $200 level, the channel zone, and the 100 simple moving average (4 hours). The next major resistance is near $220 or the 76.4% Fib retracement level of the downward move from the $237 swing high to the $160 low. Source: BCH/USD on TradingView.com Any further gains could lead the price toward the $240 and $250 resistance levels in the near term. The next major hurdle is near the $265 level. Dips Supported in BCH? If Bitcoin Cash price fails to clear the $200 resistance, it could start a fresh decline. Initial support on the downside is near the $185 level. The next major support is near the $180 level, where the bulls are likely to appear. If the price fails to stay above the $180 support, the price could test the $170 support. Any further losses could lead the price toward the $160 zone in the near term. Technical indicators 4-hour MACD – The MACD for BCH/USD is losing pace in the bullish zone. 4-hour RSI (Relative Strength Index) – The RSI is currently above the 50 level. Key Support Levels – $185 and $180. Key Resistance Levels – $200 and $220."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-28T04:56:22.000Z",
    "title": "Shiba Inu’s BONE Token Surges 11% Higher: Is It Time to Fill Your Bags? Report",
    "url": "https://www.crypto-news-flash.com/shiba-inus-bone-token-surges-11-higher-is-it-time-to-fill-your-bags-report/",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T130201.105.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bone\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T130201.105.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T130201.105-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />ICRYPEX lists BONE, triggering positive sentiment and a price increase.  Shibarium&#8217;s progress towards relaunch and new features by Kusama contribute to its growing popularity. Taking an unexpected twist, the BONE token linked to Shiba Inu has emerged as a standout performer within the current cryptocurrency market. Despite the overall subdued performance of the market, the [...]"
  }
]