[
  {
    "source": "Cointelegraph",
    "date": "2023-12-04T17:45:00.000Z",
    "title": " Meta&#039;s AI boss says there’s an ‘AI war’ underway and Nvidia is ‘supplying the weapons’ ",
    "url": "https://cointelegraph.com/news/meta-s-ai-artificial-intelligence-quantum-computing-yann-lecun-boss-ai-war-nvidia-supplying-weapons",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNWQyZDliODUtOWVmMS00MTFhLWE2ZDctYWMwNzg1ZDJhNTVhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The outspoken executive also said that Meta isn’t pursuing quantum computing because it isn’t currently useful.</p>\n                    <p><p>Meta AI boss Yann LeCun sounded off on the industry-wide state of artificial intelligence and quantum computing during a recent event to celebrate the 10 year anniversary of the founding of Meta’s Fundamental Artificial Intelligence Research (FAIR) team. </p><p>During LeCun’s commentary, he <a href=\"https://www.cnbc.com/2023/12/03/meta-ai-chief-yann-lecun-skeptical-about-agi-quantum-computing.html\" target=\"_blank\" rel=\"noopener nofollow\" >commented</a> on Nvidia’s current stranglehold on the AI hardware industry, the likelihood human-level AI will emerge in the near future, and why Meta isn’t currently pursuing quantum computing alongside its competitors. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">By \"not any time soon\", I mean \"clearly not in the next 5 years\", contrary to a number of folks in the AI industry.<br>Yes, I'm skeptical of quantum computing, particularly when it comes to its application to AI.<a href=\"https://t.co/5t63w1GNfL\" >https://t.co/5t63w1GNfL</a></p>— Yann LeCun (@ylecun) <a href=\"https://twitter.com/ylecun/status/1731445805817409918?ref_src=twsrc%5Etfw\">December 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<h2>The artificial intelligence war</h2><p>LeCun’s views on the imminence of so-called human-level AI are <a href=\"https://www.businessinsider.com/ai-chatgpt-not-smart-dogs-cats-yet-yan-lecun-meta-2023-6?r=US&IR=T\" target=\"_blank\" rel=\"noopener nofollow\" >well-documented</a>. </p><p>By comparison, Elon Musk recently gave the bold prediction that <a href=\"https://cointelegraph.com/news/elon-musk-artificial-inteligence-digital-god-make-ai-copyright-lawsuits-irrelevant\" >a “Digital God” would arrive within the next 3 to 5 years</a>. </p><p>In the middle, perhaps, lies Nvidia CEO Jensen Huang. He recently <a href=\"https://www.theverge.com/2023/11/29/23981053/nvidias-ceo-thinks-agi-will-be-here-in-the-next-10-years\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> that AI would be able to complete tests in a manner “fairly competitive” with humans in the next five years. </p><p><a href=\"https://cointelegraph.com/news/meta-s-ai-artificial-intelligence-quantum-computing-yann-lecun-boss-ai-war-nvidia-supplying-weapons\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-04T18:04:40.000Z",
    "title": "Digital asset market experiences significant liquidations, Bitcoin and Binance take center stage",
    "url": "https://www.cryptopolitan.com/bitcoin-and-binance-take-center-stage/",
    "description": "The digital asset market has been hit by a major financial reset, resulting in the liquidation of over $214 million worth of assets within a mere 24-hour period. The majority of these liquidations, totaling $166 million, are attributed to short positions.&#160; In this tumultuous turn of events, Bitcoin and Binance have emerged as key players, ... <a title=\"Digital asset market experiences significant liquidations, Bitcoin and Binance take center stage\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-and-binance-take-center-stage/\" aria-label=\"More on Digital asset market experiences significant liquidations, Bitcoin and Binance take center stage\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-04T18:03:25.000Z",
    "title": "AI Revolutionizes Payments Landscape with Generative AI Integration",
    "url": "https://www.cryptopolitan.com/ai-revolutionizes-payments-landscape-with-generative-ai-integration/",
    "description": "Generative AI, a groundbreaking technology, is reshaping the landscape of artificial intelligence (AI) and its applications. Ahsan Shah, Senior Vice President of Data Analytics and AI at Billtrust, highlights the pivotal role of large language models (LLMs), such as OpenAI&#8217;s ChatGPT, in this transformative journey. The fusion of natural language processing (NLP) with conventional AI ... <a title=\"AI Revolutionizes Payments Landscape with Generative AI Integration\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-revolutionizes-payments-landscape-with-generative-ai-integration/\" aria-label=\"More on AI Revolutionizes Payments Landscape with Generative AI Integration\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-04T18:02:38.000Z",
    "title": "US Force Major discusses the importance of Bitcoin in national defense",
    "url": "https://www.cryptopolitan.com/us-force-major-the-importance-of-bitcoin/",
    "description": "The United States Space Force Major Jason Lowery has recently advocated for a formal investigation into the strategic applications of proof-of-work (PoW) systems, specifically focusing on Bitcoin, as a means of enhancing national defense. Beyond its conventional role as a monetary system, Lowery highlights Bitcoin’s potential to secure various forms of data, messages, and command ... <a title=\"US Force Major discusses the importance of Bitcoin in national defense\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-force-major-the-importance-of-bitcoin/\" aria-label=\"More on US Force Major discusses the importance of Bitcoin in national defense\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-04T17:58:57.000Z",
    "title": "UK lawmakers urge government to reconsider digital pound limits and interest",
    "url": "https://www.cryptopolitan.com/uk-lawmakers-urge-government-to-reconsider-digital-pound-limits-and-interest/",
    "description": "Lawmakers in the UK are urging the government to reevaluate the proposed limits for a potential digital pound and to ensure that its design allows for the possibility of paying interest. This development comes as both the UK and the European Union have expressed their reservations about retail digital currencies earning interest, similar to traditional ... <a title=\"UK lawmakers urge government to reconsider digital pound limits and interest\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-lawmakers-urge-government-to-reconsider-digital-pound-limits-and-interest/\" aria-label=\"More on UK lawmakers urge government to reconsider digital pound limits and interest\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-04T17:53:56.000Z",
    "title": "Mantle launches liquid staking protocol on Ethereum mainnet",
    "url": "https://www.cryptopolitan.com/mantle-launches-liquid-staking-protocol/",
    "description": "Mantle, a blockchain developer governed by a decentralized autonomous organization (DAO), has officially launched its Liquid Staking Protocol (LSP) on the Ethereum mainnet. This innovative protocol enables users to deposit Ethereum (ETH) and actively participate in network staking through validator nodes. The move comes as a significant step forward for Mantle, following its successful deployment ... <a title=\"Mantle launches liquid staking protocol on Ethereum mainnet\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mantle-launches-liquid-staking-protocol/\" aria-label=\"More on Mantle launches liquid staking protocol on Ethereum mainnet\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-04T17:49:37.000Z",
    "title": "Safe wallet users lost $2 million to scammers in one week",
    "url": "https://www.cryptopolitan.com/safe-wallet-lost-2-million-scammers-in-week/",
    "description": "Cryptocurrency enthusiasts find themselves increasingly at risk as a sophisticated hacker exploits a technique known as “address poisoning,” resulting in cumulative losses exceeding $5 million over the past four months. The attacker, identified as the same individual responsible for a recent high-profile attack on Florence Finance, has escalated activities against Safe Wallet users. In the ... <a title=\"Safe wallet users lost $2 million to scammers in one week\" class=\"read-more\" href=\"https://www.cryptopolitan.com/safe-wallet-lost-2-million-scammers-in-week/\" aria-label=\"More on Safe wallet users lost $2 million to scammers in one week\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-04T17:47:04.000Z",
    "title": "Surge in trading volume on HashKey Exchange attributed to token rewards program",
    "url": "https://www.cryptopolitan.com/surge-in-trading-volume-on-hashkey-exchange/",
    "description": "Hong Kong-based HashKey Exchange experienced a significant increase in trading volume last week, driven by a token rewards program. The company, which became the first licensed retail crypto trading platform in Hong Kong earlier this year, saw daily trading volume spike to $4.5 billion on December 1, before returning to around $275 million on December ... <a title=\"Surge in trading volume on HashKey Exchange attributed to token rewards program\" class=\"read-more\" href=\"https://www.cryptopolitan.com/surge-in-trading-volume-on-hashkey-exchange/\" aria-label=\"More on Surge in trading volume on HashKey Exchange attributed to token rewards program\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-12-04T18:09:01.000Z",
    "title": "$DYDX Experiences Increased Smart Money Outflow After Token Unlock Event",
    "url": "https://nulltx.com/dydx-experiences-increased-smart-money-outflow-after-token-unlock-event/",
    "description": "$DYDX, the Ethereum-based token, witnessed a notable shift in its dynamics after the recent token unlock event on December 1. With 150 million $DYDX tokens, equivalent to around $485 million and representing 83.2% of the circulating supply, being unlocked, the token&#8217;s Smart Money Outflow ranking on SpotOnChain rose to the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-04T17:59:30.000Z",
    "title": "Terra Ecosystem Excels As $LUNA Surpasses The $1 Mark; $LUNC Achieves $1B Market Cap",
    "url": "https://nulltx.com/terra-ecosystem-excels-as-luna-surpasses-the-1-mark-lunc-achieves-1b-market-cap/",
    "description": "In the past few weeks, the Terra ecosystem has demonstrated impressive performance, outshining broader market trends with significant gains. During November, Terraform Labs, overseeing Terra Luna Classic (LUNC) and TerraClassicUSD (USTC) altcoins, distributed over $17 million across various liquidity pools. This strategic move, including allocations like $1.5M for LUNA/axlUSDC, $1M [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-04T18:00:10.000Z",
    "title": "ADA In The Spotlight: Heavyweight Investors Pile Into Cardano, What’s Next?",
    "url": "https://www.newsbtc.com/analysis/ada/ada-in-the-spotlight-heavyweight-investors-pile-into-cardano-whats-next/",
    "description": "Cardano (ADA) has recently caught the attention of large-scale investors, also known as &#8216;whales.&#8217; Crypto analyst Ali, leveraging on-chain data, has observed a significant uptick in large ADA transactions, typically over $100,000, in the past three months. Ali noted that this growing trend suggests a heightened interest from institutional players and high-net-worth individuals in ADA. The analyst further disclosed that such whale activities have often been precursors of imminent price movements. #Cardano &#124; In the last three months, there&#8217;s been a significant increase in $ADA transactions over $100,000, reaching new highs consistently. This surge points to growing interest in #ADA from institutional players and whales, which is usually a precursor to price spikes. pic.twitter.com/APczM2PGxM — Ali (@ali_charts) December 4, 2023 Notably, while transactions can significantly impact a crypto&#8217;s market dynamics, when whales accumulate an asset, it often reduces circulating supply, creating potential upward pressure on prices. Conversely, when they sell, it can result in a sudden increase in supply, leading to price drops. In ADA&#8217;s case, the recent whale activities have coincided with a positive price trajectory. ADA Bullish Trajectory And Market Outlook ADA&#8217;s market performance has mirrored the growing whale interest. In the last 24 hours alone, the crypto asset has experienced a 2.2% increase, and over 5% in the past week. Although ADA has seen some retracement from its recently achieved peak above the $0.41 mark, it currently maintains a steady position in the $0.40 zone. This bullish trend is further supported by a surge in ADA&#8217;s trading volume, which has doubled from $250 million to over $500 million in a week. This increase in trading activity and price aligns with the predictions of another analyst, Dan Gambardello. Gambardello has identified bullish setups in Bitcoin, Ethereum, and ADA, projecting that ADA could climb to $0.45 in the short term, with a longer-term target of $0.80-$0.85. The analyst attributes his optimistic forecast to the growth and resilience of the Cardano ecosystem, even amid the recent broader market&#8217;s bearish trends. GROUNDBREAKING MOMENT: Bitcoin, Cardano, Ethereum Setup For BULL MARKET https://t.co/cPfZzIVCxh — Dan Gambardello (@cryptorecruitr) December 4, 2023 Recent data from DeFiLlama reveals a notable uptick in Cardano’s ecosystem, with its Total Value Locked (TVL) experiencing over 20% growth in the past month, currently standing at $275 million. Although this figure is below its March 2022 peak of over $300 million, the ecosystem’s approach toward this previous high point reflects its resilience, as indicated by Gambardello amid the recent bearish market sentiments. Cardano’s Ecosystem: A Catalyst For Future Growth? Gambardello&#8217;s enthusiasm for Cardano extends beyond its current market performance. The analyst believes that the Cardano ecosystem&#8217;s development during the bear cycle positions it for significant growth in the future. Gambardello predicts that Cardano could soon account for 1% of the total crypto market capitalization. Such a milestone would be a testament to the asset&#8217;s ecosystem robustness and innovation, potentially leading to ADA&#8217;s substantial rise in the next bull run. Notably, Gambardello isn&#8217;t the only analyst predicting a bullish future for ADA. In a recent post on X, Ali highlighted ADA’s presence in a crucial demand zone. The analyst pointed out that the price levels around $0.37 to $0.38 have seen substantial buying activity, with over 166,470 wallets acquiring ADA in this range. #Cardano sits at a key demand zone between $0.37 and $0.38. Here, 166,470 wallets acquired 4.88 billion $ADA. With minimal resistance ahead and solid support below, remaining above this zone could pave the way for $ADA to climb to new yearly highs. Still, watch out, as losing… pic.twitter.com/GDjhspFSVr — Ali (@ali_charts) November 27, 2023 Ali interprets this strong buying interest as an indication of a solid support level for ADA. According to his analysis, ADA is poised for an uptrend with little resistance ahead, potentially exceeding its yearly high of $0.4518. Related Reading: On The Brink Of Breakthrough? Analyst Foresees Cardano (ADA) Hitting New Annual Heights Despite ADA recently surpassing and seemingly respecting these key demand zones, its price has only reached a peak of $0.41 so far, not quite breaching the $0.45 mark. However, given the surge in whale activity and the bullish sentiment enveloping the global crypto market, reaching and possibly surpassing the yearly high remains a plausible outcome. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-04T18:05:08.000Z",
    "title": "Will Dogecoin, Shiba Inu, and Pepe Coin Breakout 100x in the Crypto Bull Run? Unveiling of Top Meme Coins to Buy Now",
    "url": "https://www.crypto-news-flash.com/will-dogecoin-shiba-inu-and-pepe-coin-breakout-100x-in-the-crypto-bull-run-unveiling-of-top-meme-coins-to-buy-now/?utm_source=rss&utm_medium=rss&utm_campaign=will-dogecoin-shiba-inu-and-pepe-coin-breakout-100x-in-the-crypto-bull-run-unveiling-of-top-meme-coins-to-buy-now",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-96.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-96.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-96-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the bustling arena of cryptocurrency, 2023 is brimming with anticipation for a potential bull run, thrusting meme coins like Dogecoin, Shiba Inu, and Pepe Coin into the limelight of the digital token market. These meme-based cryptocurrencies, known for their viral appeal and large communities, are once again catching the eyes of crypto enthusiasts. Amidst [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-04T17:59:59.000Z",
    "title": "BC.GAME Honored with the “Best Casino Operator 2023” Award from SiGMA",
    "url": "https://www.crypto-news-flash.com/bc-game-honored-with-the-best-casino-operator-2023-award-from-sigma/?utm_source=rss&utm_medium=rss&utm_campaign=bc-game-honored-with-the-best-casino-operator-2023-award-from-sigma",
    "description": "<img width=\"512\" height=\"384\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-04T205713.861.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-04T205713.861.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-04T205713.861-300x225.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Malta, November 15, 2023 &#8211; BC.GAME, a leading innovator in online gambling, proudly announces its recognition with the prestigious Best Casino Operator 2023 award by SiGMA. This esteemed accolade, presented at the SiGMA Europe 2023 event, marks BC.GAME&#8217;s distinguished standing among the world&#8217;s top online casinos. The award celebrates BC.GAME&#8217;s commitment to excellence in providing [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-04T17:48:43.000Z",
    "title": "El Salvador Celebrates $3 Million in Bitcoin Profits in a Resounding Success",
    "url": "https://www.crypto-news-flash.com/el-salvador-celebrates-3-million-in-bitcoin-profits-in-a-resounding-success/?utm_source=rss&utm_medium=rss&utm_campaign=el-salvador-celebrates-3-million-in-bitcoin-profits-in-a-resounding-success",
    "description": "<img width=\"640\" height=\"427\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/pexels-karolina-grabowska-5980926.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"cartera de Bitcoin de El Salvador\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/pexels-karolina-grabowska-5980926.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/pexels-karolina-grabowska-5980926-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/pexels-karolina-grabowska-5980926-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />El Salvador&#8217;s Bitcoin wallet surprises by bouncing back from losses, generating more than $3 million in recent profits. President Bukele challenges critics to acknowledge success, highlighting the strength of the nation&#8217;s crypto strategy. In an unexpected turn of events, El Salvador&#8217;s Bitcoin wallet has not only recovered from previous losses, but has experienced a remarkable [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-04T17:58:34.000Z",
    "title": "CAGA Crypto – Decentralized Financial Movement Unveiled on MEXC and Bitget",
    "url": "https://dailyhodl.com/2023/12/04/caga-crypto-decentralized-financial-movement-unveiled-on-mexc-and-bitget/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-CAGA-Industry-Announcement-Featured-Image-Template.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-CAGA-Industry-Announcement-Featured-Image-Template.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-CAGA-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-CAGA-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-CAGA-Industry-Announcement-Featured-Image-Template.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-CAGA-Industry-Announcement-Featured-Image-Template.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-CAGA-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-CAGA-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-CAGA-Industry-Announcement-Featured-Image-Template.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2023/12/UPSCALED-CAGA-Industry-Announcement-Featured-Image-Template.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New York, United States CAGA Crypto, a bright example of DeFi innovation, is set for a triumphant entry onto major exchanges, including MEXC and Bitget. With a community-driven DAO model, innovative liquid staking and transparent governance, CAGA stands out. Its recently announced listings on Gate.io and BitMart mark a significant milestone, propelling this movement towards [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/04/caga-crypto-decentralized-financial-movement-unveiled-on-mexc-and-bitget/\">CAGA Crypto – Decentralized Financial Movement Unveiled on MEXC and Bitget</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-04T17:55:46.000Z",
    "title": "Sam Bankman-Fried Won’t Pursue Post-Trial Motions After Fraud Conviction: Lawyers",
    "url": "https://dailyhodl.com/2023/12/04/sam-bankman-fried-wont-pursue-post-trial-motions-after-fraud-conviction-lawyers/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/FTX-Harrison-Steps-Down.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/FTX-Harrison-Steps-Down.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/FTX-Harrison-Steps-Down.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/FTX-Harrison-Steps-Down.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/FTX-Harrison-Steps-Down.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/FTX-Harrison-Steps-Down.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/FTX-Harrison-Steps-Down.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Lawyers for Sam Bankman-Fried are not filing any post-trial motions after the disgraced FTX founder was convicted on seven criminal counts related to the misuse of the crypto exchange&#8217;s customer funds. In a letter to Judge Lewis Kaplan of the U.S. District Court for the Southern District of New York, lawyers Mark S. Cohen and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/04/sam-bankman-fried-wont-pursue-post-trial-motions-after-fraud-conviction-lawyers/\">Sam Bankman-Fried Won’t Pursue Post-Trial Motions After Fraud Conviction: Lawyers</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]