[
  {
    "source": "Decrypt",
    "date": "2023-11-06T22:54:55.000Z",
    "title": "Ava Labs Employees Report Layoffs, 'Many People' Affected",
    "url": "https://decrypt.co/204581/ava-labs-employees-report-layoffs-many-people-affected",
    "description": "The Ava Labs cuts, which occurred Monday, have reportedly impacted numerous teams including communications and marketing."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-06T23:00:21.000Z",
    "title": "Top 3 Altcoins For November 2023 That Could 100x Your Crypto Portfolio",
    "url": "https://www.newsbtc.com/altcoin/3-altcoins-november-crypto-100x/",
    "description": "Altcoins have become one of the most preferred ways for crypto investors to secure massive gains in the industry especially given Bitcoin’s massive growth rate in the last decade. Because a lot of these altcoins have significantly smaller market caps, they tend to have a lot of runway for growth, making them an enticing option. So here is a list of the top 3 altcoins that could 100x your crypto portfolio in the coming bull market, in no particular order. Memecoin (MEME): The New Meme Crypto Memecoin (MEME) is the latest brainchild from the 9GAG team. The team had successfully launched multiple non-fungible token (NFT) projects in the last year before finally moving on to the launch of their very own cryptocurrency; MEME. Related Reading: ETH Sent To Exchanges Climbs Above 500,000, Is Ethereum At $2,000 Still Possible? So far, MEME looks to be like any other meme coin in the crypto market with no promises or roadmap. But as far as altcoins go, MEME has one of the most important factors that can guarantee success for a project and that is a very strong community. The Memecoin official Twitter account already has 2.8 million followers, surpassing established meme coin players such as Floki Inu and falling just behind Shiba Inu which sits at 3.7 million followers. This massive support from the community, coupled with the fact that its market cap is sitting at only $180 million, makes it one of the altcoins with a lot of potential going into the bull run. Liquity (LQTY) Joins Altcoins With Potential Liquity (LQTY) has made a name for itself as being one of the decentralized finance (DeFi) protocols offering interest-free borrowing on the Ethereum network. This is a good draw for investors looking to take out loans but not having to pay huge interest on those loans. In the DeFi summer that was recorded between 2020 and 2021, these kinds of protocols were proven to be an investor favorite. As such, their native tokens are wont to soar if there is a repeat of such a trend. LQTY token is still trading below $2 and just like MEME, it has a low market just above $150 million. This makes it one of the altcoins with a good runway to grow especially in a bull market and secure good gains for crypto investors. LQTY price at $1.69 &#124; Source: LQTYUSDT on Tradingview.com Shiba Inu’s BONE Could Be A Game Changer For years, the Shiba Inu-based BONE token has been able to fly under the radar and has not achieved the notoriety of some of its meme coin counterparts. However, this could quickly change especially with the launch of the Shibarium network. Related Reading: Bitcoin Ends October On A High Note, What To Expect For BTC Price In November Shibarium, which is a Layer 2 network built atop the Ethereum blockchain, actually uses the BONE token as its ecosystem utility token. Many expected this to be Shiba Inu but the team has clarified that SHIB only acts as a governance token in the network. Given that BONE is the native token of the Shibarium network, it stands to gain a lot when the network begins to gain widespread adoption. And with a market cap under $160 million, there is still a long way to go for BONE to catch up with its competitors in the space. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Binance, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-06T23:01:10.000Z",
    "title": "Wyoming Senator Cynthia Lummis Aiming for New Crypto Bill To Be Passed in Early 2024: Report",
    "url": "https://dailyhodl.com/2023/11/06/wyoming-senator-cynthia-lummis-aiming-for-new-crypto-bill-to-be-passed-in-early-2024-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/Merten-Issues-Bitcoin-Warning.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/Merten-Issues-Bitcoin-Warning.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/Merten-Issues-Bitcoin-Warning.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/Merten-Issues-Bitcoin-Warning.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/Merten-Issues-Bitcoin-Warning.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/Merten-Issues-Bitcoin-Warning.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/Merten-Issues-Bitcoin-Warning.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Pro-Bitcoin (BTC) Senator Cynthia Lummis wants a crypto regulation bill to pass early next year in the US. In a new interview with Yahoo Finance, Senator Lummis says that the overreach by the U.S. Securities and Exchange Commission (SEC) into crypto is just one of the reasons she wants to introduce crypto regulation by early 2024. &#8220;I [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/06/wyoming-senator-cynthia-lummis-aiming-for-new-crypto-bill-to-be-passed-in-early-2024-report/\">Wyoming Senator Cynthia Lummis Aiming for New Crypto Bill To Be Passed in Early 2024: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]