[
  {
    "source": "Cointelegraph",
    "date": "2024-02-07T03:20:31.000Z",
    "title": " Crypto investors pocketed $887 gains on average in 2023: CoinLedger ",
    "url": "https://cointelegraph.com/news/crypto-investors-realized-gains-2023-coinledger",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOGRkNTViYjctNzI3My00ZTU3LTkzNWMtYWRhZjBkNGUwOWU1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The gains mark a “stark contrast” to the crypto winter of 2022, which saw investors nursing over $7,000 of realized losses on average.</p>\n                    <p><p>Crypto investors made nearly $900 in net gains on average from selling crypto in 2023, a “stark contrast” from 2022, which saw billions wiped from investors amid several crypto firms’ collapses, according to data from crypto tax software provider CoinLedger.</p><p>CoinLedger analyzed 500,000 of its users’ reporting and found the average crypto investor took home $887.60 in realized gains in 2023 as the industry began to recover, and added: </p><p>Realized gains and losses occur when an investor disposes or sells crypto for a different price than they initially acquired it for. For <a href=\"https://cointelegraph.com/news/spanish-treasury-seize-crypto-pay-tax-debts\">tax purposes</a> in the United States, a disposal event typically involves the transfer of cryptocurrency to a wallet not owned by the investor — such as when it’s sold on an exchange. </p><p><a href=\"https://cointelegraph.com/news/crypto-investors-realized-gains-2023-coinledger\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-07T03:30:59.000Z",
    "title": "South Korean Regulator Plans to Discuss Crypto Rules With US SEC Chair Gary Gensler",
    "url": "https://news.bitcoin.com/south-korean-regulator-plans-to-discuss-crypto-rules-with-us-sec-chair-gary-gensler/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/south-korea-gensler-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"South Korean Regulator Plans to Discuss Crypto Rules With SEC Chair Gary Gensler\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/south-korea-gensler-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/south-korea-gensler-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/south-korea-gensler-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/south-korea-gensler-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/south-korea-gensler-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/south-korea-gensler-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/south-korea-gensler.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />South Korea&#8217;s financial watchdog chief is planning to visit the U.S. to discuss crypto regulation with the chairman of the U.S. Securities and Exchange Commission (SEC), Gary Gensler, with a focus on the SEC&#8217;s recent decision to approve spot bitcoin exchange-traded funds (ETFs). He stressed that currently, the impact of SEC policies on the world [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T03:39:19.000Z",
    "title": "Helix Breaks Ground with On-Chain Japanese Yen Market Introduction",
    "url": "https://www.cryptopolitan.com/helix-chain-japanese-yen-market-introduction/",
    "description": "Helix, the trailblazing decentralized exchange built on the Injective protocol, has today announced a monumental development in the world of cryptocurrency trading.&#160; In collaboration with FX market titan Cables Finance, Helix has launched the first-ever on-chain market for the Japanese Yen (JPY), marking a pioneering moment in the integration of traditional fiat currencies with decentralized [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T03:20:56.000Z",
    "title": "Recent Research Highlights Diagnostic Challenges in Darker Skin Tones. Can AI Assistance Enhance Accuracy?",
    "url": "https://www.cryptopolitan.com/diagnostic-darker-skin-tones-ai-assistance/",
    "description": "In a study unveiled by MIT researchers, it has been revealed that dermatologists and general practitioners face considerable challenges in accurately diagnosing skin diseases in patients with darker skin tones. Leveraging AI assistance, yet, holds promising prospects in addressing this disparity. The study, published in Nature Medicine, sheds light on the implications of diagnostic discrepancies [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T03:17:32.000Z",
    "title": "Spot Ethereum ETF approval timeline uncertain amid SEC’s deliberations",
    "url": "https://www.cryptopolitan.com/spot-ethereum-etf-approval-time-uncertain/",
    "description": "The U.S. Securities and Exchange Commission (SEC) has opted to prolong its decision-making process regarding the proposed spot Ether exchange-traded fund (ETF) from Invesco and Galaxy Digital.&#160; This move comes after the SEC&#8217;s groundbreaking approval of spot Bitcoin ETFs earlier. The delay has been initiated to allow for additional assessment, raising the deadline by an [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T03:17:09.000Z",
    "title": "CleanSpark’s Expansion: Cementing Its Position in the Bitcoin Mining Sector",
    "url": "https://www.cryptopolitan.com/cleansparks-expansion-bitcoin-mining-sector/",
    "description": "CleanSpark Inc., a prominent player in the Bitcoin mining industry, has announced a significant stride in its expansion strategy. The company has recently entered into definitive agreements for acquiring new mining facilities in Mississippi and Dalton, GA. These acquisitions are set to significantly boost CleanSpark&#8217;s operational hashrate, further solidifying its position in the rapidly evolving [&#8230;]"
  }
]