[
  {
    "source": "CryptoSlate",
    "date": "2023-08-22T04:00:06.000Z",
    "title": "Bitcoin’s surprising stability: A signal of a maturing market despite severe dips",
    "url": "https://cryptoslate.com/insights/bitcoins-surprising-stability-a-signal-of-maturing-market-despite-severe-dips/",
    "description": "<p>Quick Take On August 17, Bitcoin experienced its 190th worst day in terms of performance, showcasing a significant drop of 7.23%. The market exhibited signs of distress with the price tumbling from around $29,000 to below $26,000. However, despite the stark depreciation, an analysis of Bitcoin&#8217;s entire price history reveals a compelling trend — a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-surprising-stability-a-signal-of-maturing-market-despite-severe-dips/\">Bitcoin&#8217;s surprising stability: A signal of a maturing market despite severe dips</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-22T04:00:00.000Z",
    "title": "BRICS Not Focusing on Creating Common Currency, Indian Official Says",
    "url": "https://news.bitcoin.com/brics-not-focusing-on-creating-common-currency-indian-official-says/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/india-brics-currency-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BRICS Not Focusing on Creating Common Currency, Says Indian Official\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/india-brics-currency-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/india-brics-currency-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/india-brics-currency-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/india-brics-currency-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/india-brics-currency-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/india-brics-currency-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/india-brics-currency.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A top Indian official has downplayed the creation of a shared BRICS currency. Emphasizing that “common currency discussions have several prerequisites before you can even talk about a common currency framework,” the official stressed that the BRICS nations have focused on boosting settlements in national currencies. Indian Foreign Secretary on BRICS Currency India&#8217;s Foreign Secretary [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T03:49:29.000Z",
    "title": "Thailand to seek a court-issued shutdown order against Facebook",
    "url": "https://www.cryptopolitan.com/thailand-to-shutdown-facebook/",
    "description": "Thailand has taken a stern stance against Facebook&#8217;s alleged negligence in addressing fraudulent investment and cryptocurrency scam advertisements on its platform. The Ministry of Digital Economy and Society (MDES) has announced its intention to seek a court-issued shutdown order against the social media giant unless immediate measures are taken to curb these scams. According to ... <a title=\"Thailand to seek a court-issued shutdown order against Facebook\" class=\"read-more\" href=\"https://www.cryptopolitan.com/thailand-to-shutdown-facebook/\" aria-label=\"More on Thailand to seek a court-issued shutdown order against Facebook\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-22T03:58:29.000Z",
    "title": "Ethereum Price Key Indicators Suggest Rising Selling Interest Below $1,700",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-selling-interest-1700/",
    "description": "Ethereum price is struggling to recover above the $1,700 resistance against the US Dollar. ETH could start a fresh decline if it stays below $1,700 and $1,720. Ethereum is struggling to recover above the $1,700 and $1,720 levels. The price is trading below $1,700 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance near $1,680 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start another decline if it stays below the $1,700 level in the near term. Ethereum Price Consolidates Below $1,700 Ethereum’s price started a recovery wave from the $1,520 zone. ETH managed to recover above the $1,550 and $1,580 levels, similar to Bitcoin. However, the price is struggling to recover above the $1,700 and $1,720 levels. It is now moving lower and trading below the 23.6% Fib retracement level of the recovery wave from the $1,517 swing low to the $1,716 high. There is also a key bearish trend line forming with resistance near $1,680 on the hourly chart of ETH/USD. Ether is now trading below $1,700 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $1,680 level and the trend line. Source: ETHUSD on TradingView.com The next resistance is near $1,690 or the 100-hourly Simple Moving Average. The first major resistance is forming near $1,700 and $1,720. A close above the $1,720 level could start a decent increase in the near term. The next major resistance is near the $1,750 level. Any more gains might send the price toward the $1,820 resistance or even $1,880 in the coming days. Another Drop in ETH? If Ethereum fails to clear the $1,700 resistance, it could start another decline. Initial support on the downside is near the $1,620 level or the 50% Fib retracement level of the recovery wave from the $1,517 swing low to the $1,716 high. The first major support is near the $1,600 zone. If there is a downside break below $1,600, there could be more losses. The next major support is near the $1,565 support level. Any more losses might send the price toward the $1,520 level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,600 Major Resistance Level – $1,700"
  }
]