[
  {
    "source": "Cointelegraph",
    "date": "2023-08-14T20:45:00.000Z",
    "title": "Kraken Ventures to raise $100M in second fund with focus on ‘early stage founders’",
    "url": "https://cointelegraph.com/news/kraken-ventures-to-raise-100m-in-second-fund-with-focus-on-early-stage-founders",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/8f5143f9-334f-4c5d-ae72-40a458859f8e.jpeg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The organization will also reserve a “significant portion” of the fund for follow-on investments and long-term entrepreneurial support. </p>\n                    <p><p>Citing the organization’s extensive experience in having completed “hundreds of early stage investments,” Brandon Gath, managing partner for Kraken Ventures told Cointelegraph, in an email, that the new fund would focus on early stage founders, but would offer support throughout the venture:</p><blockquote>“Kraken Ventures' (KV) next fund will double down on our existing thesis and continue to support founders through their full journey from initial capital to IPO.”</blockquote><p>This marks the second fund from Kraken Ventures. Its previous fund <a href=\"https://www.crunchbase.com/funding_round/rightfoot-series-a--624f9d05\" target=\"_blank\" rel=\"noopener nofollow\">raised</a> $65 million, according to Crunchbase, and was announced December 17, 2021. The second fund’s $100 million aim represents a massive uptick, even as the venture market for blockchain and cryptocurrency-adjacent projects appears to be in somewhat of a decline. </p><p>Gath also mentioned that Kraken Ventures believes that “smaller funds best serve entrepreneurs and investors, as the entrepreneur gets a more hands-on partner, and data overwhelmingly shows that small funds outperform large funds,” indicating that the fund will likely be issued to numerous projects rather than one or two large-sized investments. </p><p>The email did, however, point out that a “significant portion” of the fund would be dedicated to follow-up investments.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/UnitedStates?src=hash&ref_src=twsrc%5Etfw\">#UnitedStates</a> startup Rightfoot Raises $15M Series A Round from Bain Capital, Kraken Ventures, Renegade Partners, BoxGroup <a href=\"https://t.co/raC43BbBzW\">https://t.co/raC43BbBzW</a></p>— Parsers VC (@Parsers_vc) <a href=\"https://twitter.com/Parsers_vc/status/1691141408332066825?ref_src=twsrc%5Etfw\">August 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Kraken Ventures has reportedly invested in at least 32 companies, with the majority of the investments being series A funding. Most recently it was part of an effort raising $15 million for fintech startup Rightfoot, which is building a data portal for computer-permissioned data. </p><p>Prior investments have included artificial intelligence companies, decentralized finance organizations, and numerous blockchain technology companies. </p><p>According to Gath, though Kraken Ventures is an independent and fully-autonomous organization, its mission aligns with cryptocurrency exchange Kraken, “to create a more open and transparent financial system by backing early-stage founders building blockchain-based products with that shared goal.”</p><p>Kraken Ventures plans to raise $100 million for its second crypto ventures fund, according to a spokesperson who confirmed the information in an email with Cointelegraph.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-14T21:00:49.000Z",
    "title": "Bitcoin Price Outlook for August",
    "url": "https://news.bitcoin.com/bitcoin-price-outlook-for-august/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2315050591-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Price Outlook for August\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2315050591-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2315050591-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2315050591-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2315050591-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2315050591-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2315050591-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2315050591.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Aside from last week&#x2019;s move above $30,000, bitcoin has mostly consolidated below this level for the majority of August. Market volatility has eased, seemingly as a result of lower trading volumes due to the summer period. Despite this, history shows that bulls tend to return closer to the beginning of September. Current Market Status Bitcoin [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T21:01:06.000Z",
    "title": "AI’s Transformative Impact on Asset Management,From Brokers to Bots",
    "url": "https://www.cryptopolitan.com/ais-transformative-impact-on-asset/",
    "description": "In a world where technology is rapidly advancing, the financial services industry is undergoing a profound transformation, with artificial intelligence (AI) emerging as a game-changing force. One sector particularly influenced by this technological evolution is asset management, where AI is revolutionizing operations, efficiency, and profitability. With the potential to process extensive data volumes at unprecedented ... <a title=\"AI&#8217;s Transformative Impact on Asset Management,From Brokers to Bots\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ais-transformative-impact-on-asset/\" aria-label=\"More on AI&#8217;s Transformative Impact on Asset Management,From Brokers to Bots\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T20:45:25.000Z",
    "title": "AI Stocks to Watch in 2023, Unveiling a Thriving Landscape",
    "url": "https://www.cryptopolitan.com/challenges-oflarge-language-models-llms/",
    "description": "In November 2022, the launch of OpenAI&#8217;s ChatGPT marked a watershed moment in artificial intelligence. What was once limited to generating art and refining text swiftly evolved into a tool capable of providing intricate answers to complex queries. The significance of ChatGPT&#8217;s success cannot be understated, with an astonishing 100 million users registering within a ... <a title=\"AI Stocks to Watch in 2023, Unveiling a Thriving Landscape\" class=\"read-more\" href=\"https://www.cryptopolitan.com/challenges-oflarge-language-models-llms/\" aria-label=\"More on AI Stocks to Watch in 2023, Unveiling a Thriving Landscape\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-14T21:00:52.000Z",
    "title": "BALD Deployer Moves Proceeds Of The Rug From Base To Ethereum",
    "url": "https://www.newsbtc.com/altcoin/bald-deployer-moves-proceeds/",
    "description": "In a shocking turn of events, the developer behind the controversial meme coin BALD initiated a series of significant transactions, raising eyebrows within the cryptocurrency community. The events surrounding the deployer’s recent actions have left both the coin&#8217;s value and its reputation teetering on the edge. BALD Deployers Send Funds To Kraken Exchange Blockchain analysis platform Lookonchain has revealed that the deployer of the BALD token has executed audacious moves, bridging a staggering 7,000 ETH ($12.9 million) out of the Coinbase Layer 2 network, Base. Of the 7,000 ETH that has been sent to the Ethereum network, the deployer sent 2,100 ETH ($3.87 million) in two different transactions to the Kraken crypto exchange, for purposes that can only be for selling. Related Reading: Bitcoin-Friendly Javier Milei Wins Presidential Primaries In Argentina Following this, the BALD deployer currently holds 4,902 ETH in their balance on the Ethereum blockchain, worth over $9 million at current prices. The wallet’s tokens holdings also remain significant, sitting at $1.115 million at the time of this writing. The recent transactions have now dredged up speculations about who the BALD deployer might be. On-chain investigator ZachXBT previously lent his expertise to the investigations, with findings pointing toward an X (formerly Twitter) user who goes by the username @milkyway16eth due to a previous transaction between the deployer wallet and Milkyway’s wallet. However, there is yet to be any concrete proof if Milkyway is actually the brains behind the rug. A Rollercoaster For Investors The BALD meme coin started making the rounds on X (formerly Twitter) shortly after being launched on Base. The coin which was named after Coinbase’s CEO Brian Armstrong’s bald head rose rapidly, climbing more than 289,000% in less than two days. This growth rate served as an attraction for investors, who bridged quickly to the ETH blockchain to invest in the token. It continued to rise, crossing a $70 million market amid the euphoria. However, this would end up being short-lived. Related Reading: More Selling? Bankrupt Voyager Sends Millions In SHIB And ETH To Coinbase On August 1, the BALD deployer pulled liquidity from the token, making off with 10,705 ETH ($20 million at the time). The coin’s price declined rapidly after this, although the official X account for BALD continued to deny that it was a rug pull. Although BALD continues to trade on the Base network, it has been unable to reclaim its past glory. Its price is down over 90% from its all-time high and recorded 18% losses in the last 24 hours alone, according to data from Coinmarketcap. Its daily trading volume is sitting at $503,000 and its market cap is $9.03 million. Total market cap recovers to $1.154 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com Featured image from Publish0x, chart from Tradingview.com"
  }
]