[
  {
    "source": "Decrypt",
    "date": "2023-09-07T20:14:29.000Z",
    "title": "EA Sports UFC 5: Everything You Need to Know",
    "url": "https://decrypt.co/155400/ea-sports-ufc-5-everything-you-need-know",
    "description": "Are you ready to rumble? EA Sports UFC 5 will be the first Mature-rated entry in the MMA fighting series, coming to PlayStation 5 and Xbox Series X/S."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-07T20:30:18.000Z",
    "title": "Riot Showcases Demand Response Strategy: Bitcoin Mining’s Role in Strengthening Texas Energy Grid",
    "url": "https://news.bitcoin.com/riot-showcases-demand-response-strategy-bitcoin-minings-role-in-strengthening-texas-energy-grid/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-powr-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Riot Showcases Demand Response Strategy: Bitcoin Mining&#039;s Role in Strengthening Texas Energy Grid\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-powr-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-powr-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-powr-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-powr-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-powr-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-powr-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btc-powr.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin mining aided the Electric Reliability Council of Texas, or ERCOT, when the bitcoin mining company Riot Platforms reduced its power usage amid a Texas summer heatwave. Riot said in its most recent production and operations update that it received $31.7 million in power and demand response credits for August. Bitcoin Mining&#x2019;s Win-Win: Riot Cuts [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-07T20:30:44.000Z",
    "title": "IMF report claims crypto adoption pose risk to financial stability",
    "url": "https://crypto.news/imf-report-claims-crypto-adoption-pose-risk-to-financial-stability/",
    "description": "Global regulators, including the IMF, are working to reduce risks that cryptocurrencies may pose to economic and financial stability"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-07T20:18:35.000Z",
    "title": "Polygon Labs denies dumping MATIC on Binance",
    "url": "https://crypto.news/polygon-labs-denies-dumping-matic-on-binance/",
    "description": "Polygon Labs has refuted claims of dumping MATIC on Binance"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-07T20:30:16.000Z",
    "title": "Cardano Announces Warp Transactions, ADA Remains Stuck In Ranging Market",
    "url": "https://www.newsbtc.com/news/cardano/cardano-announces-warp-transactions-ada-remains-stuck-in-ranging-market/",
    "description": "Strica, a company working on solutions and use cases for the Cardano blockchain, unveiled a new feature for the smart contract platform via their wallet, Warp Transactions.  According to an official press release, described as a “game changer for token transfers,” Warp Transactions were created to ease the burden of transaction fees paid when sending assets on this network.  Related Reading: Cardano HODLing: Long-Term Holders See 170% Rise In Past Year Cardano New Feature Eliminates Sender Fees, But There Is A Clause Usually, on Cardano, every token transfer demands the sender to pay a minimum fee of 1.14 ADA to secure against network attacks. However, the Warp Transaction now offers an alternative for this mechanism. Warp Transactions are based on the Unspent Transaction Output (UTXO) model. UTXOs refer to the small amount of digital currency after one executes a transaction.  Now, Warp Transactions are considered a type of UTXO transaction. They use the receiver address’s UTXOs to cover the minimum ADA fee required to process transactions on the Cardano network. However, there is a clause that this new feature employs a multi-signature function. Therefore, the receiver and sender must sign off for any transaction to be completed and published on the blockchain. Furthermore, while Warp Transactions may mark a new era for the ADA community, this feature is only available for users of the Typhon Wallet.  Whenever a Warp Transaction is initiated, the receiving address is notified and given 24 hours to accept or reject the transaction.  During this period, the tokens are moved from the sender&#8217;s wallet and are locked in a mempool, which acts as a “holding area” till the receiver approves or cancels the transaction. This mempool is managed by the backend of the Typhon Wallet.  Related Reading: Analyst Calls ADA Amazon Of The Crypto World, Forecasts Bright Future Ahead ADA Struggles For Market Breakout In other news, ADA, native token of the Cardano network, has been moving sideways over the last few days. According to data from CoinMarketCap, the altcoin has been stuck in a market ranging between $0.25 and $0.26 price zone since the start of September.  Before this market consolidation, ADA had been on a downtrend, losing about 12.9% of its value in August. According to data from Coincodex, the general sentiment around ADA remains bearish, with a Fear and Greed index of 41. However, the prediction team projects that ADA will maintain its ranging market for now, reaching around 0.261 in the next five days. At the time of writing, ADA trades around $0.256 with a 1.09% loss in the last day based on data from CoinMarketCap. The token’s trading volume is also down by 7.92% and is now valued at $104.7 million.  ADA trading at $0.2557 on the daily chart &#124; Source: ADAUSDT chart on Tradingview.com Featured image from The Independent, chart from Tradingview."
  }
]