[
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T04:54:22.000Z",
    "title": "Grayscale asks SEC to meet on 'way forward' for Bitcoin ETF conversion",
    "url": "https://cointelegraph.com/news/grayscale-asks-sec-meet-for-bitcoin-etf-conversion",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/96a1ac76-2eab-4899-a23d-0af41a8ea1cc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>“We believe the Trust’s nearly one million investors deserve this fair playing field as quickly as possible,” Grayscale's lawyers wrote to the regulator. </p>\n                    <p><p>Grayscale has told the Securities and Exchange Commission it has no legal reasoning left to block the conversion of the asset manager’s flagship Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) fund to a spot exchange-traded fund (ETF).</p><p>On Sept. 5, Grayscale’s lawyers sent a <a href=\"https://grayscale2021s.wpengine.com/wp-content/uploads/2023/09/GBTC-DPW-Letter-to-SEC-re-DC-Circuit-Court-Decision.pdf\" target=\"_blank\" rel=\"noopener nofollow\">letter</a> to the SEC requesting the pair meet to discuss the next steps following the regulator’s court loss regarding the conversion of the Grayscale Bitcoin Trust (GBTC).</p><blockquote>“Now that the Court of Appeals has spoken, there is no available rationale that would distinguish a Bitcoin futures ETP from a spot Bitcoin ETP under the legal analysis previously adopted by the Commission in rejecting spot Bitcoin ETPs.” </blockquote><p>Grayscale added it believes the SEC should conclude there are \"no grounds\" for treating the GBTC differently from Bitcoin futures ETFs whose filings \"the Commission has previously approved.\"</p><p>On Aug. 29, a United States Appeals Court <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">ruled against</a> the SEC’s denial of Grayscale’s application to convert its GBTC to a spot Bitcoin ETF.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/f42c9cf8-1ee4-4027-bebc-574e56eb6917.jpg\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of the letter sent to the SEC by Grayscale’s retained law firm Davis Polk. Source: Grayscale</em></figcaption></figure><p>Grayscale said if there was any other reason for rejecting the conversion besides the Exchange Act’s requirement that rules be “designed to prevent fraudulent and manipulative acts and practices,” it would have already been made apparent.</p><p>“We are confident that it would have surfaced by now in one of the fifteen Commission orders that rejected spot Bitcoin filings even after Bitcoin futures ETPs began trading,” Grayscale wrote.</p><p>Grayscale added its fund conversion application has been pending for nearly three times longer than the length of time stipulated by the SEC’s rules.</p><p>Joseph A. Hall — who also penned Grayscale’s letter in July <a href=\"https://cointelegraph.com/news/grayscale-sec-approve-all-bitcoin-etfs-together\">urging the SEC</a> to approve all pending ETF applications together — concluded his latest letter by saying:</p><blockquote>“We believe the Trust’s nearly one million investors deserve this fair playing field as quickly as possible.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/grayscale-wins-court-battle-what-does-this-mean-for-spot-bitcoin-etf\"><strong><em>Grayscale wins the court battle, but what does this mean for a spot Bitcoin ETF?</em></strong></a></p><p>Since the Aug. 29 court ruling the GBTC discount — the percentage showing how far off an ETF is trading above or below its net asset value — has fallen to 19.9%.</p><p>GBTC’s discount was nearing negative 50% during the bear cycle bottom following the FTX collapse in December 2022.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong><strong><em></em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-06T04:52:59.000Z",
    "title": "How is AI in Space Transforming the Way We Select and Monitor Astronauts?",
    "url": "https://www.cryptopolitan.com/ai-in-space-select-monitor-astronauts/",
    "description": "The Ministry of Business, Innovation and Employment (MBIE) has joined forces with the renowned US space company Axiom Space to pioneer an innovative AI-assisted tool that will revolutionize astronaut selection and clinical monitoring. Spearheaded by Dr. Brian Russell of Ambient Cognition, this project represents a crucial advancement in astronaut health and performance management. The development ... <a title=\"How is AI in Space Transforming the Way We Select and Monitor Astronauts?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-in-space-select-monitor-astronauts/\" aria-label=\"More on How is AI in Space Transforming the Way We Select and Monitor Astronauts?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-09-06T04:59:36.000Z",
    "title": "Base Becomes The Most Profitable L2 Network In August Ahead Of zkSync and Arbitrum",
    "url": "https://nulltx.com/base-becomes-the-most-profitable-l2-network-in-august-ahead-of-zksync-and-arbitrum/",
    "description": "Base is a Layer 2 (L2) network built on Ethereum. It uses a rollup technology called Optimistic Rollups to scale Ethereum by processing transactions off-chain and then batching them and submitting them to the Ethereum mainchain. This allows Base to offer cheaper and faster transactions than Ethereum mainnet. Base Overtakes zkSync and Arbitrum Base launched [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-06T04:54:31.000Z",
    "title": "Ripple: Could XRP Reach $50 or $100? Pundit Makes a Compelling Case",
    "url": "https://www.crypto-news-flash.com/ripple-could-xrp-reach-50-or-100-pundit-makes-a-compelling-case/",
    "description": "<img width=\"800\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"This decline could be just the initial sign of greater challenges for XRP. Whale Alert, a well-known entity tracking significant cryptocurrency transactions, highlighted a remarkable development.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-48x29.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />CTO of Ripple implies that digital assets can replace the USD to become world reserve currencies.  A member of the XRP community seems to believe that XRP could reach such heights, while its price surges to new levels.  A market pundit seems to believe that Ripple (XRP) has the capacity to surge to $50, and [...]"
  }
]