[
  {
    "source": "CryptoGlobe",
    "date": "2024-02-28T02:51:00.000Z",
    "title": "DFW Labs Doubles Down on Floki Inu with $10 Million Investment, Boosting $FLOKI Price",
    "url": "https://www.cryptoglobe.com/latest/2024/02/dfw-labs-doubles-down-on-floki-inu-with-10-million-investment-boosting-floki-price/",
    "description": "Web3 investment firm DFW Labs is making a renewed commitment to the ecosystem of the meme-inspired cryptocurrency Floki Inu through a $10 million purchase of $FLOKI tokens. This follows their initial investment of $5 million in May 2023, marking its continued support for the meme coin’s ecosystem. The funds, according to a recent announcement, for […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T03:04:44.000Z",
    "title": "Cathie Wood Shifts Strategy – Ditches AI Stocks, Embraces Tech Underdogs",
    "url": "https://www.cryptopolitan.com/cathie-wood-shifts-strategy-ditche-ai-stocks/",
    "description": "In a surprising move that has rattled the investment world, Cathie Wood, the famed founder of Ark Investment Management, has executed a series of bold trades, divesting from shares in prominent AI stocks and cryptocurrency companies while doubling down on struggling tech stocks. Wood&#8217;s decision, which saw her ditching positions in Nvidia, Coinbase, and Robinhood, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T02:45:44.000Z",
    "title": "The Future Focus – Apple AI Takes the Spotlight Post-Apple Car Debacle",
    "url": "https://www.cryptopolitan.com/apple-ai-takes-spotlight-apple-car-debacle/",
    "description": "Apple&#8217;s recent abandonment of its ambitious Project Titan, commonly known as the Apple Car, has sparked a flurry of speculation about the company&#8217;s future trajectory, particularly in the realm of Apple AI. Amidst this upheaval, investment firm Wedbush has emerged with a bold assertion: the demise of the Apple Car signals a pivotal shift towards [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-28T03:02:08.000Z",
    "title": "DWF Labs To Invest $10 Million In Floki Tokens To Boost Ecosystem Growth",
    "url": "https://nulltx.com/dwf-labs-to-invest-10-million-in-floki-tokens-to-boost-ecosystem-growth/",
    "description": "In a bid to fortify the Floki Ecosystem, DWF Labs, a prominent Web3 investment firm, has announced plans to acquire $10,000,000 worth of FLOKI tokens. This substantial investment underscores DWF Labs&#8217; commitment to fostering the development and expansion of the Floki project across the digital asset landscape. DWF LABS TO [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-28T03:05:26.000Z",
    "title": "Bitcoin Price Consolidates Gains, Can BTC Extend Rally To $60K?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-consolidates-58k/",
    "description": "Bitcoin price rallied further toward $58,000. BTC is now consolidating gains and might soon attempt more gains toward the $60,000 resistance. Bitcoin price is consolidating gains below the $57,500 resistance zone. The price is trading above $56,000 and the 100 hourly Simple moving average. There is a rising channel forming with resistance near $57,650 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could extend its current rally toward the $60,000 resistance zone. Bitcoin Price Faces Fresh Hurdle Bitcoin price extended its rally above the $55,000 resistance zone. BTC gained bullish momentum after it broke the $55,500 and $56,000 resistance levels. There was also a spike above the $57,000 resistance zone. A new multi-week high is formed near $57,572 and the price is now consolidating gains. There was a minor decline below the $57,000 level, but the price is still above the 23.6% Fib retracement level of the recent wave from the $50,950 swing low to the $57,572 high. Bitcoin is now trading above $56,000 and the 100 hourly Simple moving average. Immediate resistance is near the $57,200 level. The next key resistance could be $57,500. Source: BTCUSD on TradingView.com There is also a rising channel forming with resistance near $57,650 on the hourly chart of the BTC/USD pair, above which the price could rise toward the $58,000 resistance zone. If the bulls remain in action, the price could even surpass $58,000 and test $58,800. The main hurdle for them is visible near the $60,000 zone. Are Dips Supported In BTC? If Bitcoin fails to rise above the $57,500 resistance zone, it could start a downside correction. Immediate support on the downside is near the $56,800 level. The first major support is $56,000. If there is a close below $56,000, the price could start a decent pullback toward the 50% Fib retracement level of the recent wave from the $50,950 swing low to the $57,572 high at $54,250. Any more losses might send the price toward the $53,200 support zone. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $56,800, followed by $56,000. Major Resistance Levels – $57,500, $57,650, and $58,000."
  }
]