[
  {
    "source": "Cointelegraph",
    "date": "2023-07-19T11:51:30.000Z",
    "title": "Societe General’s subsidiary becomes the first fully licensed crypto provider in France ",
    "url": "https://cointelegraph.com/news/crypto-societe-general-s-subsidiary-becomes-the-first-fully-licensed-crypto-provider-in-france",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/96eef617-ad3c-45be-96fb-e8fcc4d989a5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Forge will have a right not only to custody the digital assets but also to purchase and sell them for legal tender, as well as to trade against each other. </p>\n                    <p><p>Forge, the subsidiary of Société Générale, France’s third-largest bank, became the first company to obtain the highest access license for providing crypto services in the country — a prerequisite for numerous service activities (PSAN). Now the provider will have a right not only to custody the digital assets but also to purchase and sell them for legal tender and trade against each other. </p><p>Local media paid attention to the update in the <a href=\"https://www.amf-france.org/en/professionals/fintech/my-relations-amf/obtain-dasp-authorisation\" target=\"_blank\" rel=\"noopener nofollow\">register</a> of the French stock market regulator, the Autorité des Marchés Financiers (AMF), on July 19. As the Societe Generale representatives state in their press release: </p><blockquote>“Accreditation represents the highest level of regulatory certification currently possible for digital asset transactions.”</blockquote><p>So far, around 90 companies have already been on the AMF list of licensed providers. For example, the subsidiary of Societe Generale’s powerful competitor, bank Crédit Agricole, got <a href=\"https://cointelegraph.com/news/santander-credit-agricole-asset-arm-receives-french-crypto-custody-license\">approval for digital custody</a> in June 2023. However, Forge became the first one to receive the highest approval for numerous services from the regulator. As the French radio station Business FM <a href=\"https://www.bfmtv.com/crypto/la-societe-generale-avec-sa-filiale-forge-devient-le-premier-acteur-a-obtenir-l-agrement-psan_AV-202307190327.html\" target=\"_blank\" rel=\"noopener nofollow\">notes</a>, such stringent requirements for this level of approval give an obvious advantage to large traditional banks over smaller crypto companies. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/french-financial-markets-ombudsman-reports-jump-in-crypto-related-mediations\"><strong><em>French financial markets ombudsman reports jump in crypto-related mediations</em></strong></a></p><p>Societe General has been quite active in the crypto sector, <a href=\"https://cointelegraph.com/news/societe-generale-subsidiary-issues-100-million-euro-bond-on-ethereum-blockchain\">issuing euro bonds on the Ethereum blockchain</a> and <a href=\"https://cointelegraph.com/news/one-of-europe-s-largest-investment-banks-issues-security-token-on-tezos\">security tokens on the Tezos blockchain</a>, and <a href=\"https://cointelegraph.com/news/societe-generale-proposes-historic-20m-dai-loan-in-exchange-for-bond-tokens\">proposing DAI stablecoin loans</a> in exchange for bond tokens. In April 2023, Forge launched EUR CoinVertible, the <a href=\"https://cointelegraph.com/news/societe-generale-launches-euro-pegged-stablecoin-on-ethereum\">euro-pegged stablecoin</a> for qualified institutional clients. The new digital asset is only available to investors onboarded by Societe Generale through its existing Know Your Customer and Anti-Money Laundering procedures.</p><p>While France remains one of the friendliest European jurisdictions to crypto, the local arm of Binance has been the <a href=\"https://cointelegraph.com/news/binance-france-investigation-report\">subject of a preliminary investigation</a>, conducted by the Judicial Investigation Service of Finance under the direction of the specialized interregional jurisdiction of Paris. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\"><strong><em>Experts want to give AI human ‘souls’ so they don’t kill us all</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-19T12:00:00.000Z",
    "title": "EtherFi CEO Condemns OpenSea’s Suspension Of Its NFTs",
    "url": "https://cryptodaily.co.uk/2023/07/etherfi-ceo-condemns-opensea-suspension-of-its-nfts",
    "description": "<p>Staking protocol EtherFi has called out the OpenSea marketplace for its decision to suspend the trading of the former&rsquo;s EtherFan NFT collection last week.&nbsp;</p>\nEtherFi Open Letter Slams OpenSea&nbsp;\n<p>Founder and CEO at EtherFi, Mike Silagadze, penned a reproachful letter addressing the OpenSea marketplace and its decision to halt the trading of the EtherFan NFT collection.&nbsp;</p>\n<p>Silagadze wrote that even though the collection launch was a success, it was short-lived. He wrote that even though the collection&rsquo;s all 3000 NFTs were minted within a day, the listings were removed from the OpenSea platform without any warning. The creators attempted to contact OpenSea through multiple channels but received no response for several days.</p>\n&ldquo;OpenSea - An Unlicensed Casino&rdquo;\n<p>Silagadze wrote that after days of attempted contact, the NFT marketplace finally responded in the form of a letter from its generic support email. The communication claimed that NFT collections involved in financial activities subject to registration or licensing are not allowed on the OpenSea platform. Since EtherFan NFTs are wrapped staked ETH with a PFP (Profile Picture), they fall under the category devised by the platform&rsquo;s conservative interpretation.</p>\n<p>Saligadze also claimed that the NFT creators had previously communicated with the marketplace team prior to the launch to ensure compatibility and had received the green signal from them.&nbsp;</p>\n<p>He wrote,&nbsp;</p>\n\n<p>&ldquo;OpenSea has been running a de facto unlicensed casino where people engage in ruinous gambling and spend millions on pictures of monkeys and such. This is all great and ok apparently, but listing a collection that actually has utility is disallowed because it has utility.&rdquo;</p>\n\nOpenSea Too Big To Take Risks\n<p>He did state that he did not believe there were any malicious intentions behind the actions, but just that the scope of the platform has become too big for operational clarity. He believes OpenSea's growth into a large organization might have led to increased caution and risk aversion.</p>\n<p>He wrote,&nbsp;</p>\n\n<p>&ldquo;Having the EtherFan NFT listed on a marketplace was a fairly important part of our marketing strategy because we expected there would be a resale market&hellip;Unequivocally, we did not get any indication whatsoever from OpenSea that any of what we were doing was potentially in violation of their Terms of Service,&rdquo;&nbsp;</p>\n\n<p>The incident has sparked discussions within the crypto community about the importance of companies taking principled stands, with some pointing to Coinbase as an example. For now, EtherFan NFTs remain unavailable on OpenSea, leaving its creators and users seeking alternative solutions for trading and engagement.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T12:08:05.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T11:55:15.000Z",
    "title": "International Students Propel US AI Industry to New Heights",
    "url": "https://www.cryptopolitan.com/international-students-propel-us-ai-industry/",
    "description": "International students have made a significant impact on the growth and success of the AI industry in the United States, according to a groundbreaking analysis by the National Foundation for American Policy (NFAP). These students, hailing from various countries, have emerged as a valuable source of researchers and entrepreneurial potential in artificial intelligence, driving innovation ... <a title=\"International Students Propel US AI Industry to New Heights\" class=\"read-more\" href=\"https://www.cryptopolitan.com/international-students-propel-us-ai-industry/\" aria-label=\"More on International Students Propel US AI Industry to New Heights\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T11:51:27.000Z",
    "title": "Exclusive Co-Branded Hardware Wallets Announced by Ledger and B2BinPay",
    "url": "https://www.cryptopolitan.com/exclusive-co-branded-hardware-wallets-announced-by-ledger-and-b2binpay/",
    "description": "In an exciting move, Ledger, the global platform for digital assets, and B2BinPay, an all-inclusive crypto payment service, are delighted to announce a unique partnership.&#160; Together, they are releasing a limited-edition Ledger Nano X hardware wallet with a distinct design. This custom device, displaying the B2BinPay logo, is the product of a powerful collaboration to ... <a title=\"Exclusive Co-Branded Hardware Wallets Announced by Ledger and B2BinPay\" class=\"read-more\" href=\"https://www.cryptopolitan.com/exclusive-co-branded-hardware-wallets-announced-by-ledger-and-b2binpay/\" aria-label=\"More on Exclusive Co-Branded Hardware Wallets Announced by Ledger and B2BinPay\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T11:48:20.000Z",
    "title": "Can VeChain (VET), Uwerx (WERX), or Dash (DASH) Top the Crypto Market Heading to the Third Quarter of 2023?",
    "url": "https://www.cryptopolitan.com/can-vechain-vet-uwerx-werx-or-dash-dash-top-the-crypto-market-heading-to-the-third-quarter-of-2023/",
    "description": "The race for dominance continues as we approach the third quarter of 2023. VeChain (VET), Uwerx, and Dash (DASH) have emerged as promising contenders, each with its own unique strengths and potential. As the crypto market landscape rapidly shifts, investors and enthusiasts eagerly anticipate which digital assets will rise to the top. VeChain (VET): Empowering ... <a title=\"Can VeChain (VET), Uwerx (WERX), or Dash (DASH) Top the Crypto Market Heading to the Third Quarter of 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/can-vechain-vet-uwerx-werx-or-dash-dash-top-the-crypto-market-heading-to-the-third-quarter-of-2023/\" aria-label=\"More on Can VeChain (VET), Uwerx (WERX), or Dash (DASH) Top the Crypto Market Heading to the Third Quarter of 2023?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-19T11:59:35.000Z",
    "title": "Crypto Big Boys Betting On InQubeta (QUBE), XRP, and Lido (LDO); Time to Buy?",
    "url": "https://www.crypto-news-flash.com/crypto-big-boys-betting-on-inqubeta-qube-xrp-and-lido-ldo-time-to-buy/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-big-boys-betting-on-inqubeta-qube-xrp-and-lido-ldo-time-to-buy",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T145500.196.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T145500.196.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T145500.196-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T145500.196-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-evolving world of cryptocurrencies, it&#8217;s essential to keep an eye on the moves of industry giants. Recently, some of the crypto big boys have shown their confidence in certain tokens, including InQubeta (QUBE), Ripple (XRP), and Lido (LDO). Their investments and support indicate the potential and value they see in these projects.  Let’s [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-19T11:45:28.000Z",
    "title": "G20 Urges Global Crypto Rules To Put End to Regulatory Arbitrage: Reuters",
    "url": "https://dailyhodl.com/2023/07/19/g20-urges-global-crypto-rules-to-put-end-to-regulatory-arbitrage-reuters/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/G20-Urges-Global-Crypto-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/G20-Urges-Global-Crypto-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/G20-Urges-Global-Crypto-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/G20-Urges-Global-Crypto-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/G20-Urges-Global-Crypto-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/G20-Urges-Global-Crypto-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/G20-Urges-Global-Crypto-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The G20&#8217;s Financial Stability Board (FSB) is rolling out a set of recommendations for crypto and stablecoin policies in an effort to address the sector&#8217;s international regulatory gaps. The crypto recommendations are designed to establish a &#8220;global regulatory baseline&#8221; after last year&#8217;s high-profile Terra (LUNA) and FTX implosions rattled the digital asset sector. The FSB [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/19/g20-urges-global-crypto-rules-to-put-end-to-regulatory-arbitrage-reuters/\">G20 Urges Global Crypto Rules To Put End to Regulatory Arbitrage: Reuters</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]