[
  {
    "source": "Cointelegraph",
    "date": "2024-02-05T09:10:24.000Z",
    "title": " S. Korea proposes FSC screening of crypto execs prior employment ",
    "url": "https://cointelegraph.com/news/south-korea-financial-regulator-proposal-reporting-requirements-crypto-executives",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZjBkMDkyYjUtMjcwYS00MzQ3LWIwMWMtZjYzZGEzYmIwYmEzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The proposed amendment to South Korea’s virtual asset service provider reporting requirements is expected to go into effect by the end of March 2024. </p>\n                    <p><p>South Korea’s financial watchdog proposed amendments requiring new executives on crypto projects to get regulatory approval before they start working in crypto companies.  </p><p>On Feb. 5, the Financial Services Commission (FSC) <a href=\"https://www.moleg.go.kr/lawinfo/makingInfo.mo?lawSeq=76590&amp;lawCd=0&amp;&amp;lawType=TYPE5&amp;mid=a10104010000\" target=\"_blank\" rel=\"noopener nofollow\">proposed</a> a major change in its virtual asset service provider (VASP) reporting requirements. The proposal aims to give the FSC the authority to screen executives joining crypto companies. If enacted, the law would compel crypto firms to report changes in personnel to the financial regulator. With this, executives would not be able to start their jobs unless the FSC approves their personnel change report. </p><p>Local news outlet Money Today <a href=\"https://news.mt.co.kr/mtview.php?no=2024020423442012484\" target=\"_blank\" rel=\"noopener nofollow\">expects</a> the amendment to go into effect by the end of March 2024 after going through several procedures, including a review from the Ministry of Government Legislation and a resolution by the FSC. Once the ordinance is revised, the rules will apply to VASP renewal reports to be made in the second half of 2024. </p><p><a href=\"https://cointelegraph.com/news/south-korea-financial-regulator-proposal-reporting-requirements-crypto-executives\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-05T09:30:56.000Z",
    "title": "Kenyan High Court Unfreezes $3 Million Belonging to Nigerian Fintech Giant Flutterwave",
    "url": "https://news.bitcoin.com/kenyan-high-court-unfreezes-3-million-belonging-to-nigerian-fintech-giant-flutterwave/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2151556331-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2151556331-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2151556331-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2151556331-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2151556331-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2151556331-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2151556331-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2151556331.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A recent ruling by the Kenyan High Court in favor of the Nigerian fintech startup Flutterwave will see it finally get access to $3 million which has been frozen since July 2022. The judge slammed the Assets Recovery Agency for continuing to hold onto the funds even after it withdrew its suit against Flutterwave. Flutterwave’s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T09:35:29.000Z",
    "title": "Beijing Scientists Reveal Game-Changing Optical Neural Network, Revolutionizing AI Training",
    "url": "https://www.cryptopolitan.com/scientists-reveal-optical-neural-network/",
    "description": "In a groundbreaking development, researchers from the Beijing Institute of Technology, led by Professor Xiangdong Zhang, have unveiled a novel type of optical neural network (ONN) that demonstrates a remarkable &#8220;quantum speedup.&#8221;&#160; This innovation leverages classical optical correlations to significantly enhance the computational power of ONNs. Published in Light Science &#38; Application, this achievement represents [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T09:34:25.000Z",
    "title": "Unprofitable Tech Stocks Grapple with Investor Skepticism Amid Economic Uncertainties",
    "url": "https://www.cryptopolitan.com/unprofitable-tech-stocks-grapple-skepticism/",
    "description": "In January, the tech stocks market painted a somber picture for investors, particularly those eyeing growth-oriented companies with unprofitable business models. Among the notable casualties were SoundHound AI, C3.ai, and IonQ, which grappled with substantial declines in their stock prices.&#160; This downturn, attributed to a myriad of factors including unexpected competition, broader market anxieties, and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T09:21:45.000Z",
    "title": "UK High Court: Craig Wright Presents Case in Bitcoin Creator Claim",
    "url": "https://www.cryptopolitan.com/craig-wright-case-in-bitcoin-creator/",
    "description": "In a significant development today, the UK High Court witnessed the presentation of the case by Craig Wright, who claims to be the elusive creator of Bitcoin, Satoshi Nakamoto. Wright has been asserting his association with Bitcoin since 2016, but substantial evidence supporting his claims has remained elusive. The Crypto Open Patent Alliance (COPA) trial [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T09:17:54.000Z",
    "title": "South Korea Proposes Stricter Oversight on Crypto Executives",
    "url": "https://www.cryptopolitan.com/south-korea-stricter-on-crypto-executives/",
    "description": "In a move to bolster regulatory control in the cryptocurrency sector, South Korea&#8217;s Financial Services Commission (FSC) has unveiled a set of proposed amendments. If enacted, these changes could significantly enhance the authority of the local regulator over the crypto industry. Mandatory approval for new crypto executives The key proposal entails mandatory regulatory approval for [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T09:10:38.000Z",
    "title": "AI Developer Finds Love: From Tinder Swipes to a Proposal with AI’s Help",
    "url": "https://www.cryptopolitan.com/ai-developer-finds-love-proposal-with-ai/",
    "description": "In the digital age, the search for love has taken a unique turn for Russian AI developer, Alexander Zhadan. Frustrated by traditional dating methods, Zhadan embarked on an experiment that combined technology, algorithms, and romance. His journey, which began in 2022, led to unexpected insights and ultimately, a proposal that defied conventional expectations. Version 1: [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-05T09:30:51.000Z",
    "title": "Meme Coin Blues: Nearly 70% Of Shiba Inu Investors Underwater As Price Flops",
    "url": "https://www.newsbtc.com/news/meme-coin-blues-nearly-70-of-shiba-inu-investors-underwater-as-price-flops/",
    "description": "Shiba Inu (SHIB), often touted as the &#8220;Dogecoin killer,&#8221; finds itself at a critical juncture as it grapples with a recent downturn, inviting scrutiny into its stability and future prospects. Related Reading: The $50K Quest: Bitcoin Oracle’s Pre-Halving Proclamation Sparks Excitement Shibarium Surge Sparks Investor Optimism, Concerns Linger Despite some investors maintaining an optimistic outlook, buoyed by recent developments such as the surge in Shibarium, others harbor reservations about the token&#8217;s performance and distribution dynamics. The red signals flashing for SHIB investors are hard to ignore. A recent analysis by IntoTheBlock reveals that a substantial 67% of investors currently find themselves in the red, indicating that their investments are underwater. Source: IntoTheBlock This underlines the token&#8217;s struggle to gain traction in the prevailing market conditions. Over the past month, SHIB has experienced a 5.86% decline in price, coupled with a lackluster 0.78% decrease in the last 24 hours, currently trading at $0.000009039. Adding to the concerns, trading volume has dwindled by 10.03%, signaling diminishing interest and prompting investors to exercise caution. This wariness is further underscored by the fact that only 28% of SHIB investors are currently in profit, with an additional 6% breaking even. SHIBUSD currently trading at $0.00000896 on the daily chart: TradingView.com Wealth Accumulation, Another Challenge The accumulation of wealth within the Shiba Inu ecosystem poses another challenge. Nearly 80% of the total holdings are concentrated in the hands of a small group of large investors. This lopsided distribution raises legitimate concerns about market manipulation and heightened volatility, thereby increasing the risk for average investors. However, amidst the prevailing uncertainties, there exists a silver lining in the form of Shibarium. The project&#8217;s Layer-2 blockchain solution has witnessed a remarkable surge in activity. Source: Shibariumscan Within just three days, the number of new accounts on Shibarium skyrocketed by an astonishing 254%, reaching an impressive 63,162. This surge in network usage often foreshadows significant price fluctuations, providing a glimmer of hope for the future prospects of SHIB. Related Reading: Avalanche To Unleash 9.5 Million Tokens, Traders Brace For Impact As the token stands at a crossroads, its future hinges on several pivotal factors. Market sentiment, particularly towards meme coins, could play a decisive role in influencing the token&#8217;s price. Additionally, the success of any new initiatives or partnerships that enhance SHIB&#8217;s utility and adoption has the potential to attract fresh investors and elevate its overall valuation. SHIB investors are urged to tread carefully. While the recent performance and wealth concentration raise legitimate concerns, the surge in Shibarium activity suggests a potential avenue for growth. Featured image from Adobe Stock, chart from TradingView"
  }
]