[
  {
    "source": "CoinDesk",
    "date": "2023-11-17T11:19:49.000Z",
    "title": "Mastercard Says Customers Are Too Comfortable With Today's Money for Adoption of CBDCs: CNBC ",
    "url": "https://www.coindesk.com/policy/2023/11/17/mastercard-says-customers-are-too-comfortable-with-todays-money-for-adoption-of-cbdcs-cnbc/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The widespread use of central bank digital currencies (CBDCs) does not have enough justification at the moment as customers are so comfortable using today's type of money, a senior Mastercard official has said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-17T11:31:59.000Z",
    "title": "WisdomTree amends S-1 form spot Bitcoin ETF filing as crypto crowd awaits SEC decisions",
    "url": "http://cointelegraph.com/news/wisdomtree-amends-spot-bitcoin-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/93f39062-6de7-4e5e-aaa1-7c9765fafd44.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>After the latest S-1 form spot Bitcoin ETF amendment by WisdomTree, only Franklin Templeton and Global X are yet to amend S-1 filings.</p>\n                    <p><p>The global exchange-traded fund (ETF) provider WisdomTree <a href=\"https://www.sec.gov/Archives/edgar/data/1850391/000121465923015256/d111123s1a3.htm\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> an amended S-1 form spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETF prospectus with the United States Securities and Exchange Commission (SEC) on Nov. 16.</p><p>The update comes a few months after WisdomTree <a href=\"https://cdn.cboe.com/resources/regulation/rule_filings/pending/2023/SR-CboeBZX-2023-042.pdf\" target=\"_blank\" rel=\"noopener nofollow\">refiled</a> its spot Bitcoin ETF application in June 2023, proposing a rule change to list and trade shares of the WisdomTree Bitcoin Trust on the BZX Exchange by Chicago Board Options Exchange (CBOE).</p><p>The amended prospectus mentions that the WisdomTree Bitcoin Trust ETF will trade under a ticker symbol BTCW, with Coinbase Custody Trust serving as the custodian and will hold all of the trust’s Bitcoin on its behalf.</p><p>According to Bloomberg ETF analyst James Seyffart, the updated S-1 form spot Bitcoin ETF filing by WisdomTree means that the firm is still planning to launch an ETF and is discussing the opportunity with the SEC.</p><p>“All issuers were expected to have to file one of these in order to potentially launch their ETF at some point. Just a step in the process. Nothing critical,” Seyffart <a href=\"https://x.com/JSeyff/status/1725225523574382821?s=20\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> on X (formerly Twitter).</p><p>Eric Balchunas, another Bloomberg ETF expert, <a href=\"https://x.com/EricBalchunas/status/1725245202246320496?s=20\" target=\"_blank\" rel=\"noopener nofollow\">noticed</a> that WisdomTree took “long enough” to amend their S-1 form Bitcoin ETF filing. “Please tell me the SEC isn’t waiting till all S-1s are updated before issuing a second round of comments,” he added.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/first-deadline-window-looms-for-sec-to-approve-bitcoin-etfs-law-decoded-nov-6-13\"><strong><em>First deadline window looms for SEC to approve Bitcoin ETFs: Law Decoded</em></strong></a></p><p>According to Seyffart’s data, only two spot Bitcoin ETF filers out of total 12 firms that have filed for such a product in the U.S. are yet to amend their S-1 filings with the SEC, including Franklin Templeton and Global X.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Okay, we&#39;re nearing in on deadline dates for 3 spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>  ETF applications. I want to get ahead of it because there&#39;s a pretty good chance we&#39;ll see delay orders from the SEC. Delays WOULD NOT change anything about our views &amp; 90% odds for 19b-4 approval by Jan 10, 2024 <a href=\"https://t.co/LE7sOlHAHM\">pic.twitter.com/LE7sOlHAHM</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1724469793422508533?ref_src=twsrc%5Etfw\">November 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Franklin Templeton is among the firms <a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-window-sec-bloomberg-analysts\">awaiting its first spot Bitcoin ETF deadline on Nov. 17</a> alongside Hashdex, whose deadline was <a href=\"https://www.sec.gov/files/rules/sro/nysearca/2023/34-98947.pdf\" target=\"_blank\" rel=\"noopener nofollow\">moved</a> by the SEC a few days ago.</p><p>Global X, another firm that hasn’t amended its S-1 filing yet, is also awaiting its second spot Bitcoin ETF deadline on Nov. 21.</p><p>Bloomberg ETF analysts like Seyffart <a href=\"https://x.com/JSeyff/status/1724868343549550880?s=20\" target=\"_blank\" rel=\"noopener nofollow\">expect</a> the SEC to do another round of delays on decisions regarding the upcoming deadlines in the near future. However, Seyffart still believes the delays would not alter his perspective of the 90% likelihood of the SEC approving a spot Bitcoin ETF before the end of January 2024.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-17T11:26:22.000Z",
    "title": "AI's energy consumption concerns echo Bitcoin mining criticisms, says Heatbit founder",
    "url": "http://cointelegraph.com/news/ai-energy-consumption-echo-bitcoin-mining-criticisms-says-heatbit-founder",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/bd047b63-eba6-4c9d-b855-526edeebd42f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>While artificial intelligence continues to grab headlines, small and large-scale Bitcoin miners might not necessarily jump ship to the AI and machine learning hype train. </p>\n                    <p><p>AI and machine learning (ML) is demanding huge amounts of computing resources as interest in the space grows, but conventional Bitcoin miners are not jumping on the bandwagon just yet.</p><p>Speaking to Cointelegraph journalist Joe Hall at Web Summit 2023 in Lisbon, Heatbit founder Alex Busarov believes that mining farms, data centers and small-scale computing power providers are far more clued up on Bitcoin mining than the nascent AI and ML infrastructure space.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/3b84b5e9-00a3-48a8-a61b-750874f484a9.JPG\"><figcaption style=\"text-align: center;\">Alex Busarov at Web Summit 2023, with a Heatbit Bitcoin-mining heater strapped to his back. Credit: Joe Hall.</figcaption></figure><p>“The reason for that is when people talk about AI, that’s normally the actual application side of AI, “it can speak for you, or it can create your voice or whatnot,” but people don’t really think of the compute side of AI as much,” Busarov explains.</p><p>Busarov’s Heatbit company has pioneered heating hardware devices that simultaneously mine Bitcoin and generate heat to warm homes. The Bitcoin-mining heaters feature a circuit board that is capable of mining BTC as well as being used for AI training and computing resources.</p><p><a href=\"https://cointelegraph.com/news/107-000-gpus-on-the-waitlist-io-net-beta-launch-attracts-data-centers-gpu-clusters\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/107-000-gpus-on-the-waitlist-io-net-beta-launch-attracts-data-centers-gpu-clusters/amp\"><strong><em>Related: ‘107,000 GPUs on the waitlist’ — Io.net beta launch attracts data centers, GPU clusters</em></strong></a></p><p>Web Summit, which has attracted more than 70,000 people to Lisbon for the annual conference in recent years, provided an opportunity for Busarov to expand Heatbit’s original BTC-centric focus on its ability to be used as an AI training resource.</p><p>Part of the company’s marketing strategy is focused on the negative perception around Bitcoin mining's energy usage.</p><p>While conceding that the BTC-heaters are playing their part in innovating Bitcoin mining by allowing it to be a secondary heating source in colder climates, Busarov believes AI computing may soon garner a similar negative perception as the industry continues to demand hardware resources.</p><blockquote>“I think AI is going to overtake Bitcoin mining with all the headlines like, “AI training is using more energy than this in this country” quite soon. They're going to need devices like ours, just with AI training chips.”</blockquote><p>Heatbit’s hardware already caters to providing AI and ML resources. Still, Busarov also believes that the wider GPU and ASIC infrastructure ecosystem might not necessarily shift away from Bitcoin and cryptocurrency mining endeavors just yet.</p><blockquote>“I think what sticks with people is actually bitcoin mining. I think they actually understand Bitcoin mining computing a lot better than AI training computing.”</blockquote><p>The Heatbit founder also believes that home mining might become more viable again in the future given that the level of hardware precision involved in large scale mining means that competition comes down to the cost of energy:</p><blockquote>“Who's got the cheapest cost of energy? Well, the one who doesn't have to pay for the cost of energy.”</blockquote><p>Busarov says combining mining with additional functions like heating and cooling leads to zero energy costs for the mining itself. </p><blockquote>“That's why I think it's going to go back to home mining, for economic reasons, through applications like ours.”</blockquote><p>As Cointelegraph recently <a href=\"https://cointelegraph.com/news/107-000-gpus-on-the-waitlist-io-net-beta-launch-attracts-data-centers-gpu-clusters\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/107-000-gpus-on-the-waitlist-io-net-beta-launch-attracts-data-centers-gpu-clusters/amp\">reported</a>, demand for AI computing resources is rising. Innovative startups like io.net are leveraging blockchain solutions to power networks that source GPU computing power from geographically diverse data centers, cryptocurrency miners and decentralized storage providers to power machine learning and artificial intelligence (AI) computing.</p><p><strong></strong><a href=\"https://cointelegraph.com/magazine/cuba-bitcoin-revolution-adoption-embargo/\"><strong><em>Magazine: The truth behind Cuba’s Bitcoin revolution: An on-the-ground report</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-17T11:17:18.000Z",
    "title": "Stuart Alderoty questions SEC’s approach in Ripple’s legal saga",
    "url": "https://www.cryptopolitan.com/stuart-alderoty-question-sec-approach-on-xrp/",
    "description": "Ripple&#8217;s Chief Legal Officer, Stuart Alderoty, has recently raised critical points against the Securities and Exchange Commission (SEC), led by Gary Gensler. Alderoty&#8217;s remarks follow Gensler&#8217;s keynote speech at the 2023 Securities Enforcement Forum, where he discussed the commission&#8217;s achievements and referenced historical statements by former SEC chairs. However, Alderoty contends that the SEC&#8217;s actions, ... <a title=\"Stuart Alderoty questions SEC&#8217;s approach in Ripple&#8217;s legal saga\" class=\"read-more\" href=\"https://www.cryptopolitan.com/stuart-alderoty-question-sec-approach-on-xrp/\" aria-label=\"More on Stuart Alderoty questions SEC&#8217;s approach in Ripple&#8217;s legal saga\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-17T11:36:47.000Z",
    "title": "Proton Mail to start using blockchain for email verifications",
    "url": "https://crypto.news/proton-mail-to-start-using-blockchain-for-email-verifications/",
    "description": "A new feature developed by Proton Mail will allow users to verify email addresses with the help of blockchain technology. Swiss end-to-end email provider focused on encryption Proton Mail is piloting a new blockchain-based feature allowing users to verify email&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-17T11:35:48.000Z",
    "title": "Analysts forecast Rebel Satoshi, Flow, and THORChain to extend gains in November",
    "url": "https://crypto.news/analysts-forecast-rebel-satoshi-flow-and-thorchain-to-extend-gains-in-november/",
    "description": "In November, Rebel Satoshi (RBLZ), Flow (FLOW), and THORChain (RUNE) are in focus"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-17T11:28:56.000Z",
    "title": "Coinbase introduces standard for onchain payments",
    "url": "https://crypto.news/coinbase-introduces-standard-for-onchain-payments/",
    "description": "Crypto exchange Coinbase announced an update to its commerce product based on the new Onchain Payment Protocol. It simplifies and standardizes onchain payments. The company said that the updated product will solve the problems of volatility and complexity with transactions. It will&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-17T11:11:12.000Z",
    "title": "Best performing altcoins this week",
    "url": "https://crypto.news/best-performing-altcoins/",
    "description": "Miles Detcher, a popular crypto community analyst, named the most promising altcoins this week. Among the altcoins to watch, there are leaders in capitalization and very young projects. The analyst explained the reasons for including each coin on the altcoin&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-17T11:22:50.000Z",
    "title": "Litecoin (LTC) Price Analysis: Will LTC Surge Above $100? Analysts Weigh In",
    "url": "https://www.crypto-news-flash.com/litecoin-ltc-price-analysis-will-ltc-surge-above-100-analysts-weigh-in/?utm_source=rss&utm_medium=rss&utm_campaign=litecoin-ltc-price-analysis-will-ltc-surge-above-100-analysts-weigh-in",
    "description": "<img width=\"510\" height=\"340\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/litecoin-6228177__340.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Litecoin\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/litecoin-6228177__340.jpg 510w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/litecoin-6228177__340-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/litecoin-6228177__340-104x69.jpg 104w\" sizes=\"(max-width: 510px) 100vw, 510px\" />Litecoin (LTC) experiences a surge in network activity, processing over a million transactions in a historic milestone, surpassing the Bitcoin network. LTC&#8217;s weekly technical analysis reveals a gradual price increase, with a breakout from a trend line in October. Bitcoin competitor Litecoin (LTC) has been making some strong moves catching the attention of crypto investors [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-17T11:21:57.000Z",
    "title": "Top 5 Economic Concepts to Understand How Cryptos Work",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-economic-concepts-to-understand-how-cryptos-work/",
    "description": "<p>To comprehend the dynamics of cryptos, one must delve into the fundamental concepts of economics and finance that underpin this revolutionary digital asset class. This article explores five key concepts that provide a foundation for understanding cryptos: scarcity, decentralization, blockchain technology, market dynamics, and regulatory environment. 1) Scarcity At the core of economic principles lies [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-economic-concepts-to-understand-how-cryptos-work/\">Top 5 Economic Concepts to Understand How Cryptos Work</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-17T11:13:47.000Z",
    "title": "Cardano Founder Supports Ethereum Insider’s Accusations Against Buterin",
    "url": "https://coinedition.com/cardano-founder-supports-ethereum-insiders-accusations-against-buterin/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Charles-Hoskinson-Mocks-Ethereum.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Charles Hoskinson Mocks Ethereum\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Charles-Hoskinson-Mocks-Ethereum.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Charles-Hoskinson-Mocks-Ethereum-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Charles-Hoskinson-Mocks-Ethereum-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Charles-Hoskinson-Mocks-Ethereum-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Charles-Hoskinson-Mocks-Ethereum-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Charles-Hoskinson-Mocks-Ethereum-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Charles Hoskinson, the founder of the Cardano ecosystem and co-founder of the Ethereum blockchain, commented on the recently controversial audio NFTs shared by Steven Nerayoff, a former advisor to Ethereum.  Hoskinson reiterated that Nerayoff had been analyzing the fall of Ethereum in its early stages, providing the founder, Vitalik Buterin, with a well-oriented “Ethereum rescue [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/cardano-founder-supports-ethereum-insiders-accusations-against-buterin/\">Cardano Founder Supports Ethereum Insider’s Accusations Against Buterin</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]