[
  {
    "source": "CryptoGlobe",
    "date": "2023-07-20T07:56:36.000Z",
    "title": "Crypto Analyst Forecasts XRP Price Surge to $15 and Potentially $35 with Well-Timed Ripple IPO",
    "url": "https://www.cryptoglobe.com/latest/2023/07/crypto-analyst-forecasts-xrp-price-surge-to-15-and-potentially-35-with-well-timed-ripple-ipo/",
    "description": "Highly popular YouTuber and crypto influencer Ben “BitBoy” Armstrong has made a bold prediction about the future price of XRP. According to Armstrong, XRP could potentially rally to $15 within the next 18 months and even surge to $35 if Ripple successfully times its IPO. Armstrong’s forecast, shared in a tweet, suggests a significant increase […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-20T07:40:00.000Z",
    "title": "Solana Rolls Out Solang Compiler, Enhances Ethereum Compatibility",
    "url": "https://cryptodaily.co.uk/2023/07/solana-rolls-out-solang-compiler-enhances-ethereum-compatibility",
    "description": "<p>Solana Labs, the entity behind Solana, has announced the rollout of the Solang compiler. The new compiler will help Ethereum Virtual Machine (EVM) developers transition to the Solana ecosystem.&nbsp;</p>\n<p>The move aligns with Solana&rsquo;s efforts to become more accessible with Solidity, the programming language used with Ethereum smart contracts.&nbsp;</p>\nA New Compiler&nbsp;\n<p>The launch of Solang will help developers who have worked with the Ethereum Virtual Machine (EVM) to transition into the Solana ecosystem smoothly. Solang gives developers who are familiar with Solidity, Ethereum&rsquo;s primary smart contract programming language, all the tools required to write and create apps on the Solana network. The unveiling of the new compiler comes only a day after Neon EVM released a similar tool. In a statement published on its website, Solana Labs stated,&nbsp;</p>\n\n<p>&ldquo;Solana development is well known for using Rust or C for writing smart contracts, but Solana is evolving to become more accessible with Solidity, the primary programming language used for Ethereum smart contracts. Solana Labs is thrilled to announce that today you can now build on Solana with Solidity using Solang, a new compiler that helps bridge the gap between EVM developers and the Solana ecosystem.&rdquo;</p>\n\nA List Of Features\n<p>According to the statement, the addition of more programming languages for building on Solana will see an influx of developers with broader skill sets into the Solana ecosystem. This was witnessed with the launch of Seahorse, a community-led initiative. Seahorse enables developers to write Solana smart contracts in Python, which is arguably the world&rsquo;s most popular programming language. The Solang launch is the continuation of efforts to broaden the reach and appeal of the Solana ecosystem among developers.&nbsp;</p>\n<p>The Solang compiler introduces an array of new features, chief among which are better compatibility with Ethereum Solidity version 0.8 and the integration of Solana SPL tokens with the Solidity language. Additionally, it also grants EVM frameworks on Solana access to the network&rsquo;s built-in functionality. Other important highlights of the new Solang compiler include the ability to call other Solana smart contracts, support for program-derived addresses, enabling development with Anchor, and native Solana smart contracts.&nbsp;</p>\n<p>Solana Labs has also created a beginners guide to assist developers in leveraging their existing knowledge in Solidity and tapping into Solana&rsquo;s high-speed and low-cost network. Using the guide, developers can easily set up their development environment, create and test their first smart contract, and then deploy it on Solana. Development on the Solana network has typically been around programming languages such as Rust or C, used to script smart contracts.&nbsp;</p>\nGrowing Efforts To Improve Ethereum-Solana Compatibility\n<p>Solang&rsquo;s launch, coupled with Neon EVM&rsquo;s release, highlights the growing and continuous efforts to improve compatibility between the Solana network and Ethereum. Like Solang, Neon EVM&rsquo;s computing environment allows developers to write and create Ethereum applications on top of Solana. The implementation utilizes a smart contract built on top of Solana and deploys the Ethereum Virtual Machine (EVM) code, which was not previously possible on the network.&nbsp;</p>\n<p>Apart from providing access to the Solana network, Neon EVM also looks to help Ethereum applications to take advantage of functionalities that are native to Solana, such as parallel execution of transactions. At the time of its launch, the director of the Neon Foundation, Marina Guryeva, had stated,&nbsp;</p>\n\n<p>&ldquo;We are very excited to see Neon EVM live on Solana Mainnet. Once we repeat these tests in production, we will present the figures based on real-world data.&rdquo;</p>\n\nSolana&rsquo;s Foray Into AI&nbsp;\n<p>Solana had recently made a significant announcement, officially integrating a ChatGPT plugin developed by Solana Labs and marking the official integration of AI into the network. AI has seen significant interest from big and small players in the crypto space. The Solana Foundation revealed that the integration would help users interact with the Solana network directly through ChatGPT.&nbsp;</p>\n\n<p>&ldquo;This integration from Solana Labs serves as a reference for how AI can make it easier to understand Solana data and protocols or surface data about Solana&rsquo;s computing infrastructure and DeFi projects.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-20T07:45:58.000Z",
    "title": "Baby Doge Coin On Burning Frenzy, Over $387,953.63 Burned In The Last Month",
    "url": "https://nulltx.com/baby-doge-coin-on-burning-frenzy-over-387953-63-burned-in-the-last-month/",
    "description": "Baby Doge Coin&#8217;s burning frenzy and deflationary design aim to create scarcity and potentially drive up its value over time. By burning a significant portion of their supply (approximately 49.146%), the cryptocurrency&#8217;s developers have demonstrated a commitment to reducing the total circulating coins, which could lead to increased demand and a potential price surge. Continuous [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-20T08:00:00.000Z",
    "title": "InQubeta draws investors, Axie Infinity struggling for traction on App Store",
    "url": "https://crypto.news/inqubeta-draws-investors-axie-infinity-struggling-for-traction-on-app-store/",
    "description": "While Axie Infinity struggles to gain momentum on Apple's App Store, InQubeta is being explored by investors"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-20T07:45:16.000Z",
    "title": "Cardano (ADA) Price Action Points To Potential Trend Reversal",
    "url": "https://www.newsbtc.com/news/cardano/cardano-ada-price-action-potential-trend-reversal/",
    "description": "Cardano (ADA) is recently showing signs of a potential trend reversal. But after staging an impressive 48% rally from its low in June, the ADA price faces crucial hurdles to solidify its bullish stance. Cardano (ADA) Price Analysis Cardano enthusiasts have had their patience tested as the ADA price navigated through a series of ups and downs. Following a dip to $0.221 in June, Cardano embarked on an impressive 48% rally, fueled in part by positive sentiment stemming from the Ripple legal dispute with the SEC. During this period, the price surged to the 61.8% Fibonacci retracement level, sparking excitement among the bulls. However, enthusiasm soon waned as the buy side struggled to stabilize above the 200-day EMA (blue). ADA subsequently corrected back to the crucial breakout level at $0.30, where the bulls regained their footing and lifted the price above the EMA50 (orange). Bullish ADA Price Targets For the short-term outlook to brighten further, ADA needs to overcome some important hurdles. The first key resistance is at the 38.2% Fibonacci retracement level, sitting at $0.328. A successful push beyond this level could open the path for an attack towards the $0.355 mark, where the 200-day EMA poses its most significant challenge. Related Reading: Cardano Bulls Reclaim Control As ADA Rallies 28% However, an impulse from the broader crypto market, Bitcoin or also more positive news from the Ripple legal battle with the SEC is probably required for this. Only when the buy side can recapture the 200-day EMA on the daily closing price, the probability for a near-term trend reversal increases significantly. A sustained break of the 61.8% Fibonacci retracement level at $0.38 is essential for a true bullish trend reversal. This milestone would increase the probability of revisiting the previous week&#8217;s high. For this, a breakout above the critical zone between $0.361 and $0.38 would be a trend reversal for the bulls. If successful, the ADA price could eye the local high of $0.399. Then, the next target becomes the 78.6% Fibonacci retracement level at $0.415. Here, the fate of Cardano&#8217;s upward trajectory will be decided, with a potential push towards the April 15 annual high of $0.463. However, prudent investors should be prepared to take profits if ADA approaches this level. Related Reading: Cardano Development Activity Dropping – What Does It Mean For ADA Price? Beyond this point, an ongoing bullish scenario opens up possibilities to target the local high of September 10, 2022, at $0.524. And if the bullish momentum remains robust, the high of August 2022 at $0.590 could become the next objective. Bearish Price Targets While the upward trend is evident, a sustainable market structure change is not yet confirmed. The bears showed their presence on July 15, holding the ADA price below the &#8220;bear market line&#8221; represented by the 200-day EMA. However, the recent 21% correction saw the buy side reclaim control, at least for the time being. To initiate another sell-off, the bears need a daily close below the 50-day EMA at $0.311. Until that happens, the bulls can feel relatively secure in their position. A failure to do so may lead to a retest of the support zone between $0.30 and the 23.6% Fibonacci retracement at $0.296, with further correction potential towards the $0.266 support area. The Relative Strength Index (RSI) initially surged to 72 but has since settled into the neutral zone at 54. Generating a fresh buy signal will be crucial for a massive price increase, as an overheated RSI typically accompanies substantial rallies. On a positive note, the MACD indicator triggered a new long signal by crossing above the 0-line, adding to the short-term optimism. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T07:55:14.000Z",
    "title": "Ripple’s Landmark Victory vs. SEC Boosts XRP Price to New Highs of $0.85 – Can the Price Reach a New All-Time High of $10 in 2023? Details",
    "url": "https://www.crypto-news-flash.com/ripples-landmark-victory-vs-sec-boosts-xrp-price-to-new-highs-of-0-85-can-the-price-reach-a-new-all-time-high-of-10-in-2023-details/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-landmark-victory-vs-sec-boosts-xrp-price-to-new-highs-of-0-85-can-the-price-reach-a-new-all-time-high-of-10-in-2023-details",
    "description": "<img width=\"800\" height=\"390\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SEC\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1.png 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1-300x146.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1-768x374.png 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" />Ripple secures a significant legal victory as a U.S. federal court rules that XRP is not a security, setting a precedent for the crypto industry. The decision has led to a surge in XRP price, reaching new highs of $0.85, and prompted major exchanges to relist XRP. In a groundbreaking ruling, a U.S. federal court [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-20T08:04:21.000Z",
    "title": "My 2024 Bitcoin Halving Strategy for Maximum Gains",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/my-2024-bitcoin-halving-strategy-for-maximum-gains/",
    "description": "<p>Only 272 days left to Bitcoin Halving. Bitcoin halvings always lead to massive crypto pumps. But Why? In the first halving it went up 8000%. In 2nd halving almost 2800%, in 3rd halving 1200%.  And if we have to believe Cathy Wood or Tim Draper. This bitcoin halving is going to be even bigger. You don’t want to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/my-2024-bitcoin-halving-strategy-for-maximum-gains/\">My 2024 Bitcoin Halving Strategy for Maximum Gains</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]