[
  {
    "source": "CoinDesk",
    "date": "2023-08-22T07:46:38.000Z",
    "title": "Thailand Warn Meta to Rein in Crypto Scams or Face Expulsion",
    "url": "https://www.coindesk.com/policy/2023/08/22/thailand-warn-meta-to-rein-in-crypto-scams-or-face-expulsion/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A Thai lawmaker is seeking a court order to shut down Facebook in the country by the end of the month, accusing the platform of supporting fraudulent investment schemes."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-22T08:01:25.000Z",
    "title": "Pro-XRP Lawyer: SEC’s Crypto Litigation Implies They Think They’re Above the Law",
    "url": "https://www.cryptoglobe.com/latest/2023/08/pro-xrp-lawyer-secs-crypto-litigation-implies-they-think-theyre-above-the-law/",
    "description": "Introduction On 21 August 2023, John Deaton, a prominent American attorney who has been closely observing the SEC v. Ripple lawsuit since its inception in December 2020, expressed his concerns regarding the SEC’s approach to cryptocurrency litigation. In a post on X (previously Twitter), Deaton delved into the SEC’s inconsistent arguments and its handling of […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-22T07:40:00.000Z",
    "title": "\n                        Coinbase Takes Equity Stake In Circle, To Shut Centre Consortium\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/coinbase-takes-equity-stake-in-circle-to-shut-centre-consortium",
    "description": "\n                        <p dir=\"ltr\">Coinbase and Circle, the two entities behind USD Coin (USDC), have announced new terms that would change the governance and funding of the USDC stablecoin.&nbsp;</p>\n<p dir=\"ltr\">The new terms will see Coinbase acquire an equity stake in Circle, with the two also shutting the Centre Consortium, which initially governed the stablecoin.&nbsp;</p>\nCoinbase Takes Equity Stake&nbsp;\n<p dir=\"ltr\">The new agreement reflects the shifting economics and popularity of the USDC stablecoin and comes at a time when it is facing competition from other stablecoins in the market and an uncertain regulatory environment. Competing stablecoins include offshore rival Tether and the recently announced PayPal stablecoin. As part of the new terms, Circle will also be launching USDC on six new blockchains over the next few months. The company hopes this will increase the adoption of the stablecoin, although it has not provided any details about how. In an update published on its website, Circle stated,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;Circle and Coinbase, the founding companies behind Centre Consortium, a jointly managed self-governance consortium for USDC, have agreed that with growing regulatory clarity for stablecoins in the U.S. and around the world, the requirement of a separate governance body like Centre is no longer needed.&rdquo;</p>\n\n<p dir=\"ltr\">It is also still unclear how big of a stake Coinbase got in Circle. However, what is known is that Coinbase did not give Circle cash for the deal, according to sources familiar with the matter. It is also not known which six blockchains will see the introduction of USDC. Circle did state back in September 2022 that it was looking to add Near, Polkadot, Optimism, and Cosmos.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;USDC will be launching on six new blockchains between September and October, bringing multi-chain access of USDC up to 15 to continue accelerating USDC&rsquo;s momentum with developers around the world.&rdquo;</p>\n\nA Strong Alignment For Long-Term Success&nbsp;\n<p dir=\"ltr\">Circle CEO Jeremy Allaire stated that the new arrangement helps to &ldquo;tune up the economics in a way that felt really fair for both of us.&rdquo; He further stated that the equity lays the foundation for a good, strong alignment for long-term success. Coinbase and Circle previously operated using a revenue-share agreement outlined in financial disclosure forms from both companies. The split was based on the amount of USDC distributed by each firm and the amount of USDC held on each platform.&nbsp;</p>\n<p dir=\"ltr\">Under the new agreement, income generated through interest will be equally shared from off-platform USDC, such as USDC held in DeFi wallets.&nbsp;</p>\nA Major Change For USDC&nbsp;\n<p dir=\"ltr\">The shuttering of Centre is a significant change for USDC. The initial whitepaper showed Centre as a steward for a global, interoperable payments network that focused on consumers and would include a number of fiat-backed tokens. However, so far, Centre has only launched USDC, while Circle issued a euro-backed stablecoin which was accessible on two blockchains.&nbsp;</p>\n<p dir=\"ltr\">However, recent initiatives around USDC have targeted the crypto developer community. These include the launch of cross-blockchain transfers and programmable wallets, which also reflect on the predominance of DeFi.&nbsp;</p>\nGovernance To Shift Under Circle&nbsp;\n<p dir=\"ltr\">Centre initially described itself as a consortium but only included Coinbase and Circle as members. This is because partnerships with other firms did not materialize. The organization, at one point, had over 20 employees, although this figure dwindled to under 10 in recent months. The new arrangement will see the governance of USDC shift under Circle. According to Allaire, governance under a separate entity like Centre was no longer needed as governments worldwide developed and adopted stablecoin legislation.&nbsp;</p>\nSpurring Growth&nbsp;\n<p dir=\"ltr\">For the moment, Coinbase and Circle face a different challenge, that of spurring the growth of USDC. Back in March, Circle revealed that around $3.3 billion of the reserves backing USDC were stuck at Silicon Valley Bank. As a result, the stablecoin had briefly lost its peg to the dollar. However, the price recovered after the federal government guaranteed Circle&rsquo;s deposits with the bank. However, USDC has seen a considerable decline in its market share, with most of the stablecoin market moving to Tether. Tether&rsquo;s market cap is currently around $83 billion, while USDC is around $26 billion.&nbsp;</p>\n<p dir=\"ltr\">The stablecoin markets have also seen a considerable shakeup with the introduction of PayPal&rsquo;s PYUSD stablecoin, launched in partnership with Paxos.&nbsp;</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-22T08:00:26.000Z",
    "title": "Dutch ING Bank Analysts: BRICS Expansion to Power De-Dollarization Across World Economies",
    "url": "https://news.bitcoin.com/dutch-ing-bank-analysts-brics-expansion-to-power-de-dollarization-across-world-economies/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_320438300-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Dutch ING Bank Analysts: BRICS Expansion to Power De-Dollarization Across World Economies\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_320438300-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_320438300-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_320438300-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_320438300-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_320438300-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_320438300-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_320438300.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Analysts of ING bank believe the de-dollarization trend that has been growing in the world might pick up momentum due to the possible expansion of the BRICS bloc. While the issuance of a BRICS common currency remains uncertain, according to some developing narratives, the Chinese yuan could become the de facto substitute for the U.S. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T08:06:27.000Z",
    "title": "How does the Avalanche Consensus Uniquely Achieve Agreement in Decentralized Networks?",
    "url": "https://www.cryptopolitan.com/avalanche-consensus-decentralized-networks/",
    "description": "In the ever-evolving landscape of blockchain technology, consensus ensures that a decentralized network arrives at a unified decision. From enabling secure financial transactions to supporting complex decentralized applications, consensus protocols are pivotal in maintaining the integrity and trustworthiness of distributed ledgers. Amid this realm of cryptographic innovations emerges a protocol that has garnered attention for ... <a title=\"How does the Avalanche Consensus Uniquely Achieve Agreement in Decentralized Networks?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-consensus-decentralized-networks/\" aria-label=\"More on How does the Avalanche Consensus Uniquely Achieve Agreement in Decentralized Networks?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T08:02:13.000Z",
    "title": "Friend.tech’s Data Breach: The Controversy Surrounding the Decentralized Network",
    "url": "https://www.cryptopolitan.com/friend-techs-data-breach/",
    "description": "In the rapidly evolving world of cryptocurrency and decentralized networks, Friend. tech emerged as a promising player, only to face significant backlash due to a recent data breach. This incident has raised concerns about the platform&#8217;s security measures and the broader implications for users who trust third-party platforms with their data. A Promising Start Marred ... <a title=\"Friend.tech&#8217;s Data Breach: The Controversy Surrounding the Decentralized Network\" class=\"read-more\" href=\"https://www.cryptopolitan.com/friend-techs-data-breach/\" aria-label=\"More on Friend.tech&#8217;s Data Breach: The Controversy Surrounding the Decentralized Network\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T07:50:06.000Z",
    "title": "Chapter 11 Bankruptcy: Specific Type of Financial Distress and Entities",
    "url": "https://www.cryptopolitan.com/chapter-11-bankruptcy-specific-type-distress/",
    "description": "The history of bankruptcy in the United States can be traced back to the origins of the nation itself. Rooted in the Constitution, this legal tool has undergone substantial modifications to address the evolving economic challenges and complexities. The development and implementation of Chapter 11 is a testament to the meticulous adaptation of bankruptcy laws ... <a title=\"Chapter 11 Bankruptcy: Specific Type of Financial Distress and Entities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chapter-11-bankruptcy-specific-type-distress/\" aria-label=\"More on Chapter 11 Bankruptcy: Specific Type of Financial Distress and Entities\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-22T07:40:21.000Z",
    "title": "Bybit to issue scholarships for top performers at AUS",
    "url": "https://crypto.news/bybit-to-issue-scholarships-for-top-performers-at-aus/",
    "description": "Bybit has partnered with the American University of Sharjah (AUS) to award scholarships of around $272,000 (AED 1 million)  to high-achieving students"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-22T08:02:15.000Z",
    "title": "Shiba Inu’s Shibarium Reopens After Enhanced Security Updates – Will It Drive SHIB Price to $0.0001? Report",
    "url": "https://www.crypto-news-flash.com/shiba-inus-shibarium-reopens-after-enhanced-security-updates-will-it-drive-shib-price-to-0-0001-report/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-shibarium-reopens-after-enhanced-security-updates-will-it-drive-shib-price-to-0-0001-report",
    "description": "<img width=\"960\" height=\"540\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/Shiba.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/Shiba.jpeg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/Shiba-300x169.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/Shiba-768x432.jpeg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/Shiba-24x14.jpeg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/Shiba-36x20.jpeg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/Shiba-48x27.jpeg 48w\" sizes=\"(max-width: 960px) 100vw, 960px\" />After two days of rigorous testing, Shiba Inu&#8217;s Shibarium is optimized and set to reopen to the public with heightened security. Shytoshi Kusama, Shiba Inu&#8217;s lead developer, emphasizes their commitment to decentralization and urges the community to be cautious of FUD (Fear, Uncertainty, Doubt). The blockchain world is abuzz as Shiba Inu&#8217;s Shibarium makes its [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-22T08:00:28.000Z",
    "title": "North Korean Hackers Pilfer $2 Billion; Retail Investors Place Bets On DOT, ATOM, TOADS and AAVE",
    "url": "https://www.crypto-news-flash.com/north-korean-hackers-pilfer-2-billion-retail-investors-place-bets-on-dot-atom-toads-and-aave/?utm_source=rss&utm_medium=rss&utm_campaign=north-korean-hackers-pilfer-2-billion-retail-investors-place-bets-on-dot-atom-toads-and-aave",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-64.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-64.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-64-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-64-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />North Korea’s heists in the crypto industry have intensified, with vast funds stolen. These hackers have stolen approximately $2 billion in the past few years, with over $180 million stolen within the first six months of 2023. Many crypto service providers have fallen victim to North Korea’s malicious entities. With the increased crime rate, retail [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-22T07:58:56.000Z",
    "title": "4 Reasons Crypto Prices Crashed Over 5%, What Altcoins Are Bouncing Back Quickly?",
    "url": "https://www.crypto-news-flash.com/4-reasons-crypto-prices-crashed-over-5-what-altcoins-are-bouncing-back-quickly/?utm_source=rss&utm_medium=rss&utm_campaign=4-reasons-crypto-prices-crashed-over-5-what-altcoins-are-bouncing-back-quickly",
    "description": "<img width=\"1143\" height=\"764\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTC.jpg 1143w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTC-300x201.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTC-1024x684.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTC-768x513.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTC-104x69.jpg 104w\" sizes=\"(max-width: 1143px) 100vw, 1143px\" />2023 started great for the crypto industry following the bearish market of 2022. Most tokens have been persistently rising. However, the past few days have been tough for crypto. There are several reasons why the crypto market is suddenly on a bearish trend. Despite this trend, some coins are looking promising. Here is a look [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-22T07:41:27.000Z",
    "title": "The NFT Market, A Negative Dip or Trend?",
    "url": "https://www.altcoinbuzz.io/nft/the-nft-market-a-negative-dip-or-trend/",
    "description": "<p>The NFT market is in the middle of a serious slump. Few projects are making profits and seeing turnover. Floor prices are down on all kinds of collections. The well-known collections and the smaller, lesser-known collections all suffer. Is this just a negative dip and will NFTs recover in the next bull run? Or is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/nft/the-nft-market-a-negative-dip-or-trend/\">The NFT Market, A Negative Dip or Trend?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]