[
  {
    "source": "CoinDesk",
    "date": "2023-11-20T15:58:42.000Z",
    "title": "Celsius Revamp Plan Hits Speed Bump With SEC: Source",
    "url": "https://www.coindesk.com/business/2023/11/20/celsius-revamp-plan-hits-speed-bump-with-sec-source/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Securities and Exchange Commission wants more information about the assets of the former crypto lender, which is reorganizing through bankruptcy, a person familiar with the matter said."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-20T15:53:51.000Z",
    "title": "MSFT, NVDA Jump as Microsoft Launches AI Venture With Sam Altman",
    "url": "https://decrypt.co/206678/msft-nvda-stock-microsoft-ai-venture-sam-altman",
    "description": "Microsoft saw its stock rise 1.5% after the company announced it had hired OpenAI co-founders Sam Altman and Greg Brockman."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-20T15:47:41.000Z",
    "title": "Japan’s Osaka Digital Exchange to kick off security token trading with Ichigo’s real estate assets",
    "url": "https://cryptoslate.com/japans-osaka-digital-exchange-to-kick-off-security-token-trading-with-ichigos-real-estate-assets/",
    "description": "<p>Osaka Digital Exchange (ODX) revealed that its Proprietary Trading System (PTS) &#8220;START&#8221; for security tokens will begin operations by Dec. 25, according to a Nov. 20 statement. A security token is essentially a digital form of traditional securities. These tokens represent fractions of real-value assets, such as equity, a company, real estate, etc. ODX&#8217;s offering [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/japans-osaka-digital-exchange-to-kick-off-security-token-trading-with-ichigos-real-estate-assets/\">Japan&#8217;s Osaka Digital Exchange to kick off security token trading with Ichigo&#8217;s real estate assets</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-20T15:56:31.000Z",
    "title": "Ripple’s VP of Central Bank Engagements on CBDCs: Paving the Way for Global Financial Inclusion",
    "url": "https://www.cryptoglobe.com/latest/2023/11/ripples-vp-of-central-bank-engagements-on-cbdcs-paving-the-way-for-global-financial-inclusion/",
    "description": "In a recent episode of Ripple’s YouTube series “Crypto in One Minute,” James Wallis, VP of Central Bank Engagements, shared his expertise on how Central Bank Digital Currencies (CBDCs) could be instrumental in fostering financial inclusion across the globe. CBDCs, or Central Bank Digital Currencies, are a digital form of a country’s fiat currency, issued […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-20T16:08:40.000Z",
    "title": "Didn't Catch the THORChain Rise in 2023? Consider Investing in Rebel Satoshi and PancakeSwap",
    "url": "https://cryptodaily.co.uk/2023/11/didnt-catch-the-thorchain-rise-in-2023-consider-investing-in-rebel-satoshi-and-pancakeswap",
    "description": "Top altcoins like THORChain (RUNE) have made moonshots in Q4. As a result, novice investors who missed the THORChain rally are seeking alternative investments"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-20T16:03:56.000Z",
    "title": "Metaverse and Online Gambling: What Awaits Us?",
    "url": "https://cryptodaily.co.uk/2023/11/metaverse-and-online-gambling-what-awaits-us",
    "description": "Digital gaming is by no means new, as the gaming sector was one of the first to fully exploit the potential of the internet and the web."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-20T16:00:27.000Z",
    "title": "Crypto Market’s Mixed Fortunes — BONK, TAO, and KAS Rise as Several Other Cryptos Stagnate",
    "url": "https://news.bitcoin.com/crypto-markets-mixed-fortunes-bonk-tao-and-kas-rise-as-several-other-cryptos-stagnate/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/lose-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Market’s Mixed Fortunes — BONK, TAO, and KAS Rise as Several Other Cryptos Stagnate\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/lose-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/lose-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/lose-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/lose-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/lose-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/lose-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/lose.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />As of this writing, the crypto market is cruising at a value of $1.42 trillion, with bitcoin (BTC) holding 49.9% of the overall market cap. This past week saw both bitcoin and ethereum experiencing notably stagnant weeks in terms of their percentage changes, while a number of other digital currencies outshone the top two. Standing [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-20T16:07:41.000Z",
    "title": "Cathie Wood’s Ark Invest pulls a 3rd Bitcoin ETF amendment filing – Details",
    "url": "https://www.cryptopolitan.com/ark-invest-pulls-a-3rd-btc-etf-amendment/",
    "description": "Cathie Wood&#8217;s Ark Invest has unexpectedly submitted its third amendment to the Bitcoin ETF filing, which contains substantial changes that have captured the attention of the financial community. At this time, ARK Invest remains committed to its objective of establishing an exchange-traded fund (ETF) specializing in spot Bitcoin within the United States. Ark Invest sends ... <a title=\"Cathie Wood&#8217;s Ark Invest pulls a 3rd Bitcoin ETF amendment filing &#8211; Details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ark-invest-pulls-a-3rd-btc-etf-amendment/\" aria-label=\"More on Cathie Wood&#8217;s Ark Invest pulls a 3rd Bitcoin ETF amendment filing &#8211; Details\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-20T16:06:10.000Z",
    "title": "Wall street banks show keen interest in workday’s AI products",
    "url": "https://www.cryptopolitan.com/wall-street-banks-show-keen-interest-in-ai/",
    "description": "New AI-driven tools by Workday are catching the attention of Wall Street banks, as they seek ways to enhance productivity and streamline operations. Workday, a leading software firm specializing in workforce management solutions, has unveiled a range of innovative AI products designed to boost workplace efficiency. These tools, set to become available in the coming ... <a title=\"Wall street banks show keen interest in workday&#8217;s AI products\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wall-street-banks-show-keen-interest-in-ai/\" aria-label=\"More on Wall street banks show keen interest in workday&#8217;s AI products\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-20T15:59:34.000Z",
    "title": "Elon Musk’s banter aside, Microsoft teams enjoys unprecedented growth",
    "url": "https://www.cryptopolitan.com/elon-musks-banter-aside-microsoft-teams/",
    "description": "In the midst of leadership changes and high-profile hirings at Microsoft, Elon Musk, the former CEO of Twitter, couldn&#8217;t resist taking a playful jab at Microsoft CEO Satya Nadella and his recent appointment of former OpenAI CEO Sam Altman. Musk&#8217;s comment drew attention to the video conferencing platform used by Microsoft, but the reality is ... <a title=\"Elon Musk&#8217;s banter aside, Microsoft teams enjoys unprecedented growth\" class=\"read-more\" href=\"https://www.cryptopolitan.com/elon-musks-banter-aside-microsoft-teams/\" aria-label=\"More on Elon Musk&#8217;s banter aside, Microsoft teams enjoys unprecedented growth\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-20T15:47:33.000Z",
    "title": "OpenAI board’s bold move sends Ripples through tech community",
    "url": "https://www.cryptopolitan.com/openai-boards-bold-move-sends-ripples/",
    "description": "In a surprising turn of events, the tech world witnessed a whirlwind of developments over the weekend as Sam Altman, the former CEO of OpenAI, was abruptly ousted from his position by the nonprofit organization&#8217;s board. The decision, which was met with widespread shock and speculation, ultimately resulted in Altman&#8217;s transition to Microsoft, where he ... <a title=\"OpenAI board&#8217;s bold move sends Ripples through tech community\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openai-boards-bold-move-sends-ripples/\" aria-label=\"More on OpenAI board&#8217;s bold move sends Ripples through tech community\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-20T15:46:43.000Z",
    "title": "Santander Private Bank debuts BTC and ETH trading in Switzerland",
    "url": "https://www.cryptopolitan.com/santander-debuts-btc-eth-trading-switzerland/",
    "description": "Santander Private Banking International, a subsidiary of Banco Santander, is making a significant move by extending its financial services to high-net-worth clients with Swiss accounts, allowing them to trade and invest in major cryptocurrencies such as bitcoin (BTC) and ether (ETH). This decision marks a departure from the cautious stance adopted by many major banks, ... <a title=\"Santander Private Bank debuts BTC and ETH trading in Switzerland\" class=\"read-more\" href=\"https://www.cryptopolitan.com/santander-debuts-btc-eth-trading-switzerland/\" aria-label=\"More on Santander Private Bank debuts BTC and ETH trading in Switzerland\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-20T15:41:02.000Z",
    "title": "Abu Dhabi ADGM to amend its virtual asset regulations and introduce DeFi regulations",
    "url": "https://www.cryptopolitan.com/abu-dhabi-adgm-to-amend-its-virtual-asset-regulations-and-introduce-defi-regulations/",
    "description": "The Abu Dhabi financial free zone hub, ADGM (Abu Dhabi Global Market) and its regulatory body the FSRA (Financial Services regulatory Authority) have published their business plan for 2024 which outlines introducing DeFi regulations as well as amendments to its virtual assets regulatory framework. ADGM which announced its virtual assets framework back in 2018 has ... <a title=\"Abu Dhabi ADGM to amend its virtual asset regulations and introduce DeFi regulations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/abu-dhabi-adgm-to-amend-its-virtual-asset-regulations-and-introduce-defi-regulations/\" aria-label=\"More on Abu Dhabi ADGM to amend its virtual asset regulations and introduce DeFi regulations\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-20T15:57:43.000Z",
    "title": "Osaka Digital Exchange to launch trading of Japan’s first digital securities ",
    "url": "https://crypto.news/osaka-digital-exchange-to-launch-trading-of-japans-first-digital-securities/",
    "description": "According to a Nov. 20 notice from Japan's Osaka Digital Exchange, ODX is set to initiate the trading of digital securities in the country through the issuance of security tokens on Dec. 25."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-20T16:00:47.000Z",
    "title": "Bitcoin ETF Hype: Bloomberg Intelligence Envisions $100 Billion Market If Regulatory Approval Granted",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-etf-hype-bloomberg-intelligence-envisions-100-billion-market-if-regulatory-approval-granted/",
    "description": "As Bitcoin (BTC) continues its upward trajectory toward $38,000, the long-awaited arrival of a US spot Bitcoin exchange-traded fund (ETF) could open the floodgates of digital currency investing for institutional and retail investors. Notably, Bloomberg Intelligence estimates that the potential spot Bitcoin ETF market could reach a staggering $100 billion, signaling a breakthrough for cryptocurrencies on Wall Street. Inquiries Surge As Spot Bitcoin ETF Looms The anticipation surrounding Bitcoin ETFs stems from the expected regulatory approval by the US Securities and Exchange Commission (SEC). After a decade of rejecting various applications, the SEC is on track to green-light ETFs that will enable the buying and selling Bitcoin within a tax-efficient and cost-effective framework.  This pivotal regulatory shift has sparked optimism among digital asset proponents, who see this as a redemption opportunity following the industry&#8217;s recent challenges. Respected heavyweights such as BlackRock, Fidelity, and Invesco are expected to participate in the spot Bitcoin ETF market. Collaborations like the one between Galaxy Digital Holdings and Invesco further emphasize the growing interest from reputable financial institutions.  Related Reading: Altcoin Corrections Signal Strong Buy Opportunities: Crypto Analyst On this matter, Galaxy Digital recently hosted a conference call attended by approximately 300 investment professionals, discussing strategies for allocating investments to Bitcoin in anticipation of the ETF debut. According to Bloomberg, wealth managers and financial advisers are increasingly intrigued by the potential of Bitcoin ETFs. Professionals like Jeff Janson at Summit Wealth have received inquiries from investors of all ages, indicating a growing appetite for digital assets in portfolios.  Coinbase suggests that ETFs will attract immediate inflows and reshape the market through fresh lending and derivatives trades. However, it is important to note that this transformation will take time to unfold fully. The imminent launch of Bitcoin ETFs represents a significant milestone for the cryptocurrency industry, potentially catapulting it into the mainstream financial landscape.  As estimated by Bloomberg Intelligence, the projected $100 billion market for spot Bitcoin ETF underscores the growing confidence and widespread interest among investors.  BTC’s Dominance Unshaken According to a recent report by CoinShares, Bitcoin has maintained its dominance in the cryptocurrency market, experiencing a notable inflow of $155 million.  This surge in investment comes as the last eight weeks of inflows alone account for approximately 3.4% of the total assets under management. Related Reading: Solana DEX Trading Volume Spikes 54% In The Last Week, TVL Climbs Interestingly, while Bitcoin saw substantial inflows, there were outflows of approximately $8.5 million from short-Bitcoin positions the previous week. This suggests that investors are increasingly optimistic about BTC’s future and its potential for further growth.  In line with the above, the report suggests that this positive BTC sentiment is closely linked to the expected approval of a spot Bitcoin ETF in the United States. At the time of writing, BTC is trading at $37,100, up 1.7% in the past 24 hours, with expectations that the largest cryptocurrency on the market can once again break through the $38,000 mark and consolidate above it to target the $40,000 mark.  However, it remains to be seen whether the SEC&#8217;s approval of spot Bitcoin ETFs will be the main catalyst for further gains in the coming months or whether a rejection could cause BTC to test investor confidence and lower support levels. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-20T16:02:00.000Z",
    "title": "Pseudo-Anonymous Crypto Trader Predicts SEI Token Will Rally Soon",
    "url": "https://coinedition.com/pseudo-anonymous-crypto-trader-predicts-sei-token-will-rally-soon/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Pseudo-Anonymous Crypto Trader Predicts SEI Token Will Rally Soon\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-7.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-7-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-7-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-7-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-7-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A pseudo-anonymous crypto trader on X with the handle @sell9000 told their followers they have been investing in SEI, a DeFi infrastructure blockchain token. The trader used a thread of posts to explain their reasons for investing in SEI and why they think the token is about to rally.  According to the crypto trader, they [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/pseudo-anonymous-crypto-trader-predicts-sei-token-will-rally-soon/\">Pseudo-Anonymous Crypto Trader Predicts SEI Token Will Rally Soon</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]