[
  {
    "source": "Cointelegraph",
    "date": "2024-01-23T04:29:59.000Z",
    "title": " ‘Enjoyable experience’ — Su Zhu loved his 3 months in Singaporean prison ",
    "url": "https://cointelegraph.com/news/three-arrows-capital-su-zhu-enjoyed-best-sleep-in-prison",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvODFlNGRiZGMtYTY4ZS00ZDQ3LThhYmYtOTFlY2FlNzRmZDRhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Three Arrows Capital co-founder says he had the best sleep of his life and felt a “magical feeling” of kinship with his ancestors. </p>\n                    <p><p>Su Zhu, the co-founder of the collapsed hedge fund Three Arrows Capital, says he had the “best sleep” of his life while serving a nearly three-month-long sentence in Singaporean prison, remarking it was an \"enjoyable experience overall.\"</p><p>In a Jan. 22 post on X, Zhu reflected on his time behind bars through several edited clips from an unreleased podcast, which also featured fellow 3AC co-founder Kyle Davies, pseudonymous OX social media manager “Lukas” and another unknown guest in several edited clips from an unreleased podcast. </p><p>Zhu was <a href=\"https://cointelegraph.com/news/3ac-su-zhu-arrested-in-singapore\">arrested in Singapore in September</a> last year when he attempted to leav the country after a local court sentenced him to four months in prison for failing to cooperate with an investigation into 3AC’s liquidation. </p><p><a href=\"https://cointelegraph.com/news/three-arrows-capital-su-zhu-enjoyed-best-sleep-in-prison\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T04:28:46.000Z",
    "title": "FTX estate and Alameda Research sell majority of Grayscale Bitcoin Trust shares",
    "url": "https://www.cryptopolitan.com/ftx-estate-and-alameda-research-sell/",
    "description": "The estate associated with the failed crypto exchange  FTX and hedge fund Alameda Research reportedly sold over two-thirds of its Grayscale Bitcoin Trust (GBTC) shares recently.  The sale, which occurred at the onset of spot exchange-traded fund (ETF) trading for GBTC, is estimated to have generated at least $600 million in proceeds.&#160; This move by [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T04:17:38.000Z",
    "title": "An In-Depth Look into Q-Learning’s Role in Reinforcement Learning",
    "url": "https://www.cryptopolitan.com/q-learnings-role-in-reinforcement-learning/",
    "description": "In the realm of artificial intelligence and machine learning, a revolutionary algorithm has been making waves – Q-Learning. Originally conceived as an incremental algorithm for optimal decision-making, Q-learning has evolved into a powerhouse in reinforcement learning.&#160; This piece delves into an exploration to unravel the intricacies of single-agent and multi-agent Q-learning algorithms, exploring their applications [&#8230;]"
  }
]