[
  {
    "source": "NewsBTC",
    "date": "2023-11-12T13:30:06.000Z",
    "title": "Crypto Analyst Confirms Dogecoin Price Breakout – Here’s The Target",
    "url": "https://www.newsbtc.com/altcoin/crypto-analyst-confirms-dogecoin-price-breakout-heres-the-target/",
    "description": "Dogecoin supporters are celebrating a 35% increase in the last month. While this is good news, other altcoins like Solana, Chainlink, and Cardano (ADA) have outperformed, with gains of 170%, 118%, and 55%, respectively, in the same timeframe. According to one crypto analyst, DOGE&#8217;s rally isn&#8217;t over, as recent price action suggests the crypto is on the verge of a bullish breakout. Crypto Analyst Confirms Dogecoin Breakout Dogecoin has officially broken out of a descending channel pattern, according to crypto analyst Rekt Capital. The analyst confirmed this in a recent post on social media platform X. Rekt Capital has been following the meme token in a series of posts in a thread since August, sharing updates of its price on a 1-week DOGE/USD chart. Related Reading: New All-Time Highs For Bitcoin In 2023? Analyst Shares Ultra Bullish Prediction A look into price action on the chart indicates Dogecoin has been on a downward channel starting from the last quarter of 2022. Since then, DOGE has created a series of lower highs and lower lows between the trendlines to indicate the bears having major control of the market. However, things started to change in the middle of October, and a breakout past the channel top became glaring.  $DOGE Retest was successful Dogecoin has made all the right steps in confirming a breakout from its Channel#DOGE #Crypto #Dogecoin https://t.co/UH5IRtccST pic.twitter.com/004LK14lN2 — Rekt Capital (@rektcapital) November 11, 2023 At the time of writing, the meme token has formed four consecutive bullish candles since it rebounded from the channel bottom. Rekt Capital has previously emphasized that a weekly close over the channel would cement a shift in trend, as the crypto has only registered misleading wicks over this point in the past year. A breakout over the resistance trendline has now been confirmed after a brief retest. Bitcoin (BTC) is currently trading at $37.081. Chart: TradingView.com What’s Next For Doge? Rekt Capital&#8217;s previous analysis has put the price rally in case of a strong break out at just over the top of the channel’s highest high at $0.15. Dogecoin is currently trading at $0.07827 and is already up by 39% from its October bottom. A rally to $0.15 would represent a gain of over 90% from its current price and a gain of 163% from its October bottom.  DOGE finally broke over the $0.076 level a few days ago as whales worked tirelessly to push the meme coin to a rally. IntoTheBlock data shows whales have injected more than $2 billion into DOGE In 30 Days. Social dominance is also rising on social media, indicating a bullish sentiment on the short term. Popular anonymous crypto analyst Kaleo believes a stronger rally will be ignited when DOGE finally crosses over $0.08. fwiw &#8211; still hasn&#8217;t started yet, don&#8217;t think we really see insane momentum until 8 cents is cleared — K A L E O (@CryptoKaleo) November 11, 2023 Related Reading: Binance Freezes $11.8 Million In Stolen Assets Following Kidnapping Incident – Details Although DOGE is still the 9th largest crypto in terms of market cap, the meme token is now far below its all-time high of $0.65. Featured image from iStock"
  }
]